{
  "id": "20443",
  "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
  "full_name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "205",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basri"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Qaysi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14139",
      "name": "Shamh bin 'Abdur Rahman سحامة بن عبد الرحمن ويقال",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20156",
      "name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20501",
      "name": "Aflah bin Sa'id al-Ansari أفلح بن سعيد الأنصاري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38644",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20242",
      "name": "'Aabad bin Rashid al-Tamimi عباد بن راشد التميمي مولاهم البصري البزا",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20505",
      "name": "'Abdullah bin Ja'far bin 'Abdur Rahman عبد الله بن جعفر بن عبد الرحمن - المخرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11643",
      "name": "'Umar bin Abi Za'id'h عمر بن أبي زائدة الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30437",
      "name": "'Abbas bin 'Abdul 'Azeem al-'Anbari عباس بن عبد العظيم العنبري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30441",
      "name": "'Uqba bin Mukaram bin Aflah al-''Ami عقبة بن مكرم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30495",
      "name": "Ahmed bin al-Hasan bin Khrash أحمد بن الحسن بن خراش",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38252",
      "name": "Sulaiman bin 'Ubaidullah سليمان بن عبيد الله الأنصاري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38562",
      "name": "Muhammad bin 'Amr bin محمد بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20523",
      "name": "Abu Bakr bin Nafi' al-'Adwi, The Client أبو بكر بن نافع العدوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30432",
      "name": "Zayd bin Yazid al-Thqfy زيد بن يزيد الثقفي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34140",
      "name": "'Abdul Malik bin Muhammad bin 'Abdullah عبد الملك بن محمد أبو قلابة الرقاشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "15487",
      "name": "Muhammad bin Shadad محمد بن شداد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "9",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر العقدي، قال حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Faith (Belief) consists of more than sixty branches     (i.e. parts). And Haya (This term \"Haya\" covers a large number of      concepts which are to be taken together; amongst them are self      respect, modesty, bashfulness, and scruple, etc.) is a part of      faith.\"",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "91",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر، قال حدثنا سليمان بن بلال المديني، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن النبي صلى الله عليه وسلم سأله رجل عن اللقطة فقال ‏\"‏ اعرف وكاءها  أو قال وعاءها  وعفاصها، ثم عرفها سنة، ثم استمتع بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال فضالة الإبل فغضب حتى احمرت وجنتاه  أو قال احمر وجهه  فقال ‏\"‏ وما لك ولها معها سقاؤها وحذاؤها، ترد الماء، وترعى الشجر، فذرها حتى يلقاها ربها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked the Prophet about the picking up of a \"Luqata\" (fallen lost thing). The Prophet replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet replied, \"It is either for you, for your brother (another person) or for the wolf.\"",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "892",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا أبو عامر العقدي، قال حدثنا إبراهيم بن طهمان، عن أبي جمرة الضبعي، عن ابن عباس، أنه قال إن أول جمعة جمعت بعد جمعة في مسجد رسول الله صلى الله عليه وسلم في مسجد عبد القيس بجواثى من البحرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first Jumua prayer which was offered after a Jumua prayer offered at the mosque of Allah's Apostle took place in the mosque of the tribe of `Abdul Qais at Jawathi in Bahrain.",
      "chain": [
        "30170",
        "20443",
        "20187",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك  رضى الله عنه  قال شهدنا بنتا لرسول الله صلى الله عليه وسلم قال ورسول الله صلى الله عليه وسلم جالس على القبر  قال فرأيت عينيه تدمعان قال  فقال ‏\"‏ هل منكم رجل لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل ‏\"‏‏.‏ قال فنزل في قبرها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were (in the funeral procession) of one of the daughters of the Prophet and he was sitting by the side of the grave. I saw his eyes shedding tears. He said, \"Is there anyone among you who did not have sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so the Prophet told him to get down in the grave. And so he got down in her grave.",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا قرة، عن محمد بن سيرين، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبي بكرة،، ورجل، أفضل في نفسي من عبد الرحمن حميد بن عبد الرحمن عن أبي بكرة  رضى الله عنه  قال خطبنا النبي صلى الله عليه وسلم يوم النحر، قال ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس ذو الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليست بالبلدة الحرام ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم عليكم حرام، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا، إلى يوم تلقون ربكم‏.‏ ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، فليبلغ الشاهد الغائب، فرب مبلغ أوعى من سامع، فلا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet delivered to us a sermon on the Day of Nahr. He said, \"Do you know what is the day today?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give that day another name. He said, \"Isn't it the Day of Nahr?\" We said, \"It is.\" He further asked, \"Which month is this?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the month of Dhul-Hijja?\" We replied: \"Yes! It is.\" He further asked, \"What town is this?\" We replied, \"Allah and His Apostle know it better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the forbidden (Sacred) town (of Mecca)?\" We said, \"Yes. It is.\" He said, \"No doubt, your blood and your properties are sacred to one another like the sanctity of this day of yours, in this month of yours, in this town of yours, till the day you meet your Lord. No doubt! Haven't I conveyed Allah's message to you? They said, \"Yes.\" He said, \"O Allah! Be witness. So it is incumbent upon those who are present to convey it (this information) to those who are absent because the informed one might comprehend it (what I have said) better than the present audience, who will convey it to him. Beware! Do not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\"",
      "chain": [
        "30351",
        "20443",
        "11301",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2348",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، وحدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان يوما يحدث وعنده رجل من أهل البادية ‏\"‏ أن رجلا من أهل الجنة استأذن ربه في الزرع فقال له ألست فيما شئت قال بلى ولكني أحب أن أزرع‏.‏ قال فبذر فبادر الطرف نباته واستواؤه واستحصاده، فكان أمثال الجبال فيقول الله دونك يا ابن آدم، فإنه لا يشبعك شىء ‏\"‏‏.‏ فقال الأعرابي والله لا تجده إلا قرشيا أو أنصاريا، فإنهم أصحاب زرع، وأما نحن فلسنا بأصحاب زرع‏.‏ فضحك النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the Prophet was narrating (a story), while a bedouin was sitting with him. \"One of the inhabitants of Paradise will ask Allah to allow him to cultivate the land. Allah will ask him, 'Are you not living in the pleasures you like?' He will say, 'Yes, but I like to cultivate the land.' \" The Prophet added, \"When the man (will be permitted he) will sow the seeds and the plants will grow up and get ripe, ready for reaping and so on till it will be as huge as mountains within a wink. Allah will then say to him, 'O son of Adam! Take here you are, gather (the yield); nothing satisfies you.' \" On that, the bedouin said, \"The man must be either from Quraish (i.e. an emigrant) or an Ansari, for they are farmers, whereas we are not farmers.\" The Prophet smiled (at this).",
      "chain": [
        "34207",
        "20169",
        "11229",
        "30351",
        "20443",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2399",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى به في الدنيا والآخرة اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن مات وترك مالا فليرثه عصبته من كانوا، ومن ترك دينا أو ضياعا فليأتني فأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I am closer to the believers than their selves in this world and in the Hereafter, and if you like, you can read Allah's Statement: \"The Prophet is closer to the believers than their own selves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors (from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they should come to me as I am the guardian of the deceased.\"",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3026",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وقال أبو عامر حدثنا مغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تمنوا لقاء العدو، فإذا لقيتموهم فاصبروا ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said: \"Do not wish to meet the enemy, but when you meet      face) the enemy, be patient.\"",
      "chain": [
        "20443",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3261",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا همام، عن أبي جمرة الضبعي، قال كنت أجالس ابن عباس بمكة، فأخذتني الحمى، فقال أبردها عنك بماء زمزم، فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ الحمى من فيح جهنم فأبردوها بالماء ‏\"‏‏.‏ أو قال ‏\"‏ بماء زمزم ‏\"‏‏.‏ شك همام‏.‏",
      "text_en": " Narrated Abu Jamra Ad-Dabi:                     I used to sit with Ibn `Abbas in Mecca. Once I had a fever and he said (to me), \"Cool your fever with Zamzam water, for Allah's Apostle said: 'It, (the Fever) is from the heat of the (Hell) Fire; so, cool it with water (or Zamzam water).",
      "chain": [
        "30351",
        "20443",
        "20297",
        "11309"
      ]
    },
    {
      "hadith_no": "3365",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر عبد الملك بن عمرو، قال حدثنا إبراهيم بن نافع، عن كثير بن كثير، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما كان بين إبراهيم وبين أهله ما كان، خرج بإسماعيل وأم إسماعيل، ومعهم شنة فيها ماء، فجعلت أم إسماعيل تشرب من الشنة فيدر لبنها على صبيها حتى قدم مكة، فوضعها تحت دوحة، ثم رجع إبراهيم إلى أهله، فاتبعته أم إسماعيل، حتى لما بلغوا كداء نادته من ورائه يا إبراهيم إلى من تتركنا قال إلى الله‏.‏ قالت رضيت بالله‏.‏ قال فرجعت فجعلت تشرب من الشنة ويدر لبنها على صبيها، حتى لما فني الماء قالت لو ذهبت فنظرت لعلي أحس أحدا‏.‏ قال فذهبت فصعدت الصفا فنظرت ونظرت هل تحس أحدا فلم تحس أحدا، فلما بلغت الوادي سعت وأتت المروة ففعلت ذلك أشواطا، ثم قالت لو ذهبت فنظرت ما فعل  تعني الصبي  فذهبت فنظرت، فإذا هو على حاله كأنه ينشغ للموت، فلم تقرها نفسها، فقالت لو ذهبت فنظرت لعلي أحس أحدا، فذهبت فصعدت الصفا فنظرت ونظرت فلم تحس أحدا، حتى أتمت سبعا، ثم قالت لو ذهبت فنظرت ما فعل، فإذا هي بصوت فقالت أغث إن كان عندك خير‏.‏ فإذا جبريل، قال فقال بعقبه هكذا، وغمز عقبه على الأرض، قال فانبثق الماء، فدهشت أم إسماعيل فجعلت تحفز‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ لو تركته كان الماء ظاهرا ‏\"‏‏.‏ قال فجعلت تشرب من الماء، ويدر لبنها على صبيها  قال  فمر ناس من جرهم ببطن الوادي، فإذا هم بطير، كأنهم أنكروا ذاك، وقالوا ما يكون الطير إلا على ماء‏.‏ فبعثوا رسولهم، فنظر فإذا هم بالماء، فأتاهم فأخبرهم فأتوا إليها، فقالوا يا أم إسماعيل، أتأذنين لنا أن نكون معك أو نسكن معك فبلغ ابنها فنكح فيهم امرأة، قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فسلم فقال أين إسماعيل فقالت امرأته ذهب يصيد‏.‏ قال قولي له إذا جاء غير عتبة بابك‏.‏ فلما جاء أخبرته قال أنت ذاك فاذهبي إلى أهلك‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فقال أين إسماعيل فقالت امرأته ذهب يصيد، فقالت ألا تنزل فتطعم وتشرب فقال وما طعامكم وما شرابكم قالت طعامنا اللحم، وشرابنا الماء‏.‏ قال اللهم بارك لهم في طعامهم وشرابهم‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ بركة بدعوة إبراهيم ‏\"‏‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ فجاء فوافق إسماعيل من وراء زمزم، يصلح نبلا له، فقال يا إسماعيل، إن ربك أمرني أن أبني له بيتا‏.‏ قال أطع ربك‏.‏ قال إنه قد أمرني أن تعينني عليه‏.‏ قال إذا أفعل‏.‏ أو كما قال‏.‏ قال فقاما فجعل إبراهيم يبني، وإسماعيل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم‏}‏ قال حتى ارتفع البناء وضعف الشيخ على نقل الحجارة، فقام على حجر المقام، فجعل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم ‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Abraham had differences with his wife), (because of her jealousy of Hajar, Ishmael's mother), he took Ishmael and his mother and went away. They had a water-skin with them containing some water, Ishmael's mother used to drink water from the water-skin so that her milk would increase for her child. When Abraham reached Mecca, he made her sit under a tree and afterwards returned home. Ishmael's mother followed him, and when they reached Kada', she called him from behind, 'O Abraham! To whom are you leaving us?' He replied, '(I am leaving you) to Allah's (Care).' She said, 'I am satisfied to be with Allah.' She returned to her place and started drinking water from the water-skin, and her milk increased for her child. When the water had all been used up, she said to herself, 'I'd better go and look so that I may see somebody.' She ascended the Safa mountain and looked, hoping to see somebody, but in vain. When she came down to the valley, she ran till she reached the Marwa mountain. She ran to and fro (between the two mountains) many times. They she said to herself, 'i'd better go and see the state of the child,' she went and found it in a state of one on the point of dying. She could not endure to watch it dying and said (to herself), 'If I go and look, I may find somebody.' She went and ascended the Safa mountain and looked for a long while but could not find anybody. Thus she completed seven rounds (of running) between Safa and Marwa. Again she said (to herself), 'I'd better go back and see the state of the child.' But suddenly she heard a voice, and she said to that strange voice, 'Help us if you can offer any help.' Lo! It was Gabriel (who had made the voice). Gabriel hit the earth with his heel like this (Ibn `Abbas hit the earth with his heel to Illustrate it), and so the water gushed out. Ishmael's mother was astonished and started digging. (Abu Al-Qasim) (i.e. the Prophet) said, \"If she had left the water, (flow naturally without her intervention), it would have been flowing on the surface of the earth.\") Ishmael's mother started drinking from the water and her milk increased for her child . Afterwards some people of the tribe of Jurhum, while passing through the bottom of the valley, saw some birds, and that astonished them, and they said, 'Birds can only be found at a place where there is water.' They sent a messenger who searched the place and found the water, and returned to inform them about it. Then they all went to her and said, 'O ishmael's mother! Will you allow us to be with you (or dwell with you)?' (And thus they stayed there.) Later on her boy reached the age of puberty and married a lady from them. Then an idea occurred to Abraham which he disclosed to his wife (Sarah), 'I want to call on my dependents I left (at Mecca).' When he went there, he greeted (Ishmael's wife) and said, 'Where is Ishmael?' She replied, 'He has gone out hunting.' Abraham said (to her), 'When he comes, tell him to change the threshold of his gate.' When he came, she told him the same whereupon Ishmael said to her, 'You are the threshold, so go to your family (i.e. you are divorced).' Again Abraham thought of visiting his dependents whom he had left (at Mecca), and he told his wife (Sarah) of his intentions. Abraham came to Ishmael's house and asked. \"Where is Ishmael?\" Ishmael's wife replied, \"He has gone out hunting,\" and added, \"Will you stay (for some time) and have something to eat and drink?' Abraham asked, 'What is your food and what is your drink?' She replied, 'Our food is meat and our drink is water.' He said, 'O Allah! Bless their meals and their drink.\" Abu Al-Qa-sim (i.e. Prophet) said, \"Because of Abraham's invocation there are blessings (in Mecca).\" Once more Abraham thought of visiting his family he had left (at Mecca), so he told his wife (Sarah) of his decision. He went and found Ishmael behind the Zamzam well, mending his arrows. He said, \"O Ishmael, Your Lord has ordered me to build a house for Him.\" Ishmael said, \"Obey (the order of) your Lord.\" Abraham said, \"Allah has also ordered me that you should help me therein.\" Ishmael said, \"Then I will do.\" So, both of them rose and Abraham started building (the Ka`ba) while Ishmael went on handing him the stones, and both of them were saying, \"O our Lord ! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.\" (2.127). When the building became high and the old man (i.e. Abraham) could no longer lift the stones (to such a high position), he stood over the stone of Al- Maqam and Ishmael carried on handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) from us, Verily You are All-Hearing, All-Knowing.\" (2.127)",
      "chain": [
        "30351",
        "20443",
        "20189",
        "11563",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3697",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، قال حدثني سالم أبو النضر، عن بسر بن سعيد، عن أبي سعيد الخدري  رضى الله عنه  قال خطب رسول الله صلى الله عليه وسلم الناس وقال ‏\"‏ إن الله خير عبدا بين الدنيا وبين ما عنده فاختار ذلك العبد ما عند الله ‏\"‏‏.‏ قال فبكى أبو بكر، فعجبنا لبكائه أن يخبر رسول الله صلى الله عليه وسلم عن عبد خير‏.‏ فكان رسول الله صلى الله عليه وسلم هو المخير وكان أبو بكر أعلمنا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبا بكر، ولو كنت متخذا خليلا غير ربي لاتخذت أبا بكر، ولكن أخوة الإسلام ومودته، لا يبقين في المسجد باب إلا سد، إلا باب أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle addressed the people saying, \"Allah has given option to a slave to choose this world or what is with Him. The slave has chosen what is with Allah.\" Abu Bakr wept, and we were astonished at his weeping caused by what the Prophet mentioned as to a Slave ( of Allah) who had been offered a choice, (we learned later on) that Allah's Apostle himself was the person who was given the choice, and that Abu Bakr knew best of all of us. Allah's Apostle added, \"The person who has favored me most of all both with his company and wealth, is Abu Bakr. If I were to take a Khalil other than my Lord, I would have taken Abu Bakr as such, but (what relates us) is the Islamic brotherhood and friendliness. All the gates of the Mosque should be closed except the gate of Abu Bakr.\"",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11164",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "4224",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا إسرائيل، عن مجزأة بن زاهر الأسلمي، عن أبيه  وكان ممن شهد الشجرة  قال إني لأوقد تحت القدر بلحوم الحمر إذ نادى منادي رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم ينهاكم عن لحوم الحمر‏.‏",
      "text_en": " Narrated Zahir Al-Aslami:                     (who was one of those who had witnessed (the Pledge of allegiance beneath) the Tree) While I was making fire beneath the cooking pots containing donkey's meat, the announcer of Allah's Apostle announced, \"Allah's Apostle forbids you to eat donkey's meat.\" The same narration was told by Majzaa from a man called Uhban bin Aus who was one of those who had witnessed (the Pledge of allegiance beneath) the Tree., and who had some trouble in his knee so that while doing prostrations, he used to put a pillow underneath his knee.",
      "chain": [
        "30351",
        "20443",
        "20311",
        "11650"
      ]
    },
    {
      "hadith_no": "4411",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا أبو عامر العقدي، حدثنا قرة، عن أبي جمرة، قلت لابن عباس  رضى الله عنهما  إن لي جرة ينتبذ لي نبيذ، فأشربه حلوا في جر إن أكثرت منه، فجالست القوم، فأطلت الجلوس خشيت أن أفتضح فقال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقال ‏\"‏ مرحبا بالقوم غير خزايا ولا الندامى ‏\"‏‏.‏ فقالوا يا رسول الله، إن بيننا وبينك المشركين من مضر، وإنا لا نصل إليك إلا في أشهر الحرم، حدثنا بجمل من الأمر، إن عملنا به دخلنا الجنة، وندعو به من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع، الإيمان بالله، هل تدرون ما الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة وصوم رمضان، وأن تعطوا من المغانم الخمس، وأنهاكم عن أربع ما انتبذ في الدباء، والنقير، والحنتم، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Jamra:                     I said to Ibn `Abbas, \"I have an earthenware pot containing Nabidh (i.e. water and dates or grapes) for me, and I drink of it while it is sweet. If I drink much of it and stay with the people for a long time, I get afraid that they may discover it (for I will appear as if I were drunk). Ibn `Abbas said, \"A delegation of `Abdul Qais came to Allah's Apostle and he said, \"Welcome, O people! Neither will you have disgrace nor will you regret.\" They said, \"O Allah's Apostle! There are the Mudar pagans between you and us, so we cannot come to you except in the sacred Months. So please teach us some orders on acting upon which we will enter Paradise. Besides, we will preach that to our people who are behind us.\" The Prophet said, \"I order you to do four things and forbid you from four things (I order you): To believe in Allah...Do you know what is to believe in Allah? That is to testify that None has the right to be worshipped except Allah: (I order you also to offer prayers perfectly to pay Zakat; and to fast the month of Ramadan and to give the Khumus (i.e. one-fifth of the booty) (for Allah's Sake). I forbid you from four other things (i.e. the wine that is prepared in) Ad-Dubba, An-Naquir, Az-Hantam and Al-Muzaffat. (See Hadith No. 50 Vol. 1)",
      "chain": [
        "30021",
        "20443",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4571",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو عامر العقدي، حدثنا عباد بن راشد، حدثنا الحسن، قال حدثني معقل بن يسار، قال كانت لي أخت تخطب إلى‏.‏ وقال إبراهيم عن يونس، عن الحسن، حدثني معقل بن يسار،‏.‏ حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا يونس، عن الحسن، أن أخت، معقل بن يسار طلقها زوجها، فتركها حتى انقضت عدتها، فخطبها فأبى معقل، فنزلت ‏{‏فلا تعضلوهن أن ينكحن أزواجهن‏}‏‏.‏",
      "text_en": " Narrated Al-Hasan:                     The sister of Ma'qal bin Yasar was divorced by her husband who left her till she had fulfilled her term of 'Iddat (i.e. the period which should elapse before she can Remarry) and then he wanted to remarry her but Maqal refused, so this Verse was revealed:-- \"Do not prevent them from marrying their (former) husbands.\" (2.232)",
      "chain": [
        "30359",
        "20443",
        "20242",
        "11016",
        "3120",
        "20150",
        "20475",
        "11016",
        "30315",
        "20258",
        "20475",
        "11016"
      ]
    },
    {
      "hadith_no": "5349",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر عبد الملك بن عمرو، حدثنا إبراهيم، عن خالد، عن عكرمة، عن ابن عباس، قال طاف رسول الله صلى الله عليه وسلم على بعيره، وكان كلما أتى على الركن أشار إليه، وكبر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle performed the Tawaf (around the Ka`ba while riding his camel, and every time he reached the corner (of the Black Stone) he pointed at it with his hand and said, \"Allahu Akbar.\" (Zainab said: The Prophet said, \"An opening has been made in the wall of Gog and Magog like this and this,\" forming the number 90 (with his thumb and index finger).",
      "chain": [
        "30351",
        "20443",
        "20150",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5673",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم دخل على رجل من الأنصار ومعه صاحب له فقال له النبي صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات هذه الليلة في شنة، وإلا كرعنا ‏\"‏‏.‏ قال والرجل يحول الماء في حائطه  قال  فقال الرجل يا رسول الله عندي ماء بائت فانطلق إلى العريش  قال  فانطلق بهما، فسكب في قدح، ثم حلب عليه من داجن له  قال  فشرب رسول الله صلى الله عليه وسلم ثم شرب الرجل الذي جاء معه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle and one of his companions entered upon an Ansari man and the Prophet said to him, \"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting our mouth in it.\" The man was watering his garden then. He said, \"O Allah's Apostle! I have water kept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and milked a domestic goat of his in it. Allah's Apostle drank, and then the man who had come along with him, drank.",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "5857",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا إبراهيم بن نافع، عن الحسن، عن طاوس، عن أبي هريرة، قال ضرب رسول الله صلى الله عليه وسلم مثل البخيل والمتصدق، كمثل رجلين عليهما جبتان من حديد، قد اضطرت أيديهما إلى ثديهما وتراقيهما، فجعل المتصدق كلما تصدق بصدقة انبسطت عنه حتى تغشى أنامله وتعفو أثره، وجعل البخيل كلما هم بصدقة قلصت، وأخذت كل حلقة بمكانها‏.‏ قال أبو هريرة فأنا رأيت رسول الله صلى الله عليه وسلم يقول بإصبعه هكذا في جيبه، فلو رأيته يوسعها ولا تتوسع‏.‏ تابعه ابن طاوس عن أبيه وأبو الزناد عن الأعرج في الجبتين‏.‏ وقال حنظلة سمعت طاوسا سمعت أبا هريرة يقول جبتان‏.‏ وقال جعفر عن الأعرج جبتان‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle has set forth an example for a miser and a charitable person by comparing them to two men wearing two iron cloaks and their hands are raised to their breasts and necks. Whenever the charitable man tries to give a charitable gift, his iron cloak expands till it becomes so wide that it will cover his fingertips and obliterate his tracks And, whenever the miser wants to give a charitable gift, his cloak becomes very tight over him and every ring gets stuck to its place Abu Huraira added; I saw Allah's Apostle putting his finger in the (chest) pocket of his shirt like that If you but saw him trying to widen (the opening of his shirt) but it did not widen.",
      "chain": [
        "30351",
        "20443",
        "20189",
        "11016",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "6301",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا أبو عامر، حدثنا زهير، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس بالطرقات ‏\"‏‏.‏ فقالوا يا رسول الله ما لنا من مجالسنا بد نتحدث فيها‏.‏ فقال ‏\"‏ إذا أبيتم إلا المجلس فأعطوا الطريق حقه ‏\"‏‏.‏ قالوا وما حق الطريق يا رسول الله قال ‏\"‏ غض البصر، وكف الأذى، ورد السلام، والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, 'Beware! Avoid sitting on the roads.\" They (the people) said, \"O Allah s Apostle! We can't help sitting (on the roads) as these are (our places) here we have talks.\" The Prophet said, ' l f you refuse but to sit, then pay the road its right ' They said, \"What is the right of the road, O Allah's Apostle?\" He said, 'Lowering your gaze, refraining from harming others, returning greeting, and enjoining what is good, and forbidding what is evil.\"",
      "chain": [
        "30351",
        "20443",
        "20321",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "7260",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن بشار، حدثنا العقدي، حدثنا شعبة، عن سعيد بن أبي بردة، قال سمعت أبي قال، بعث النبي صلى الله عليه وسلم أبي ومعاذ بن جبل على اليمن فقال ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ‏\"‏‏.‏ فقال له أبو موسى إنه يصنع بأرضنا البتع‏.‏ فقال ‏\"‏ كل مسكر حرام ‏\"‏‏.‏ وقال النضر وأبو داود ويزيد بن هارون ووكيع عن شعبة عن سعيد عن أبيه عن جده عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Burda:                     The Prophet sent my father and Mu`adh bin Jabal to Yemen and said (to them), \"Make things easy for the people and do not put hurdles in their way, and give them glad tiding, and don't let them have aversion (i.e. to make people to hate good deeds) and you both should work in cooperation and mutual understanding\" Abu Musa said to Allah's Apostle, \"In our country a special alcoholic drink called Al- Bit', is prepared (for drinking).\" The Prophet said, \"Every intoxicant is prohibited. \"",
      "chain": [
        "30160",
        "20443",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "21",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني أبو أيوب، سليمان بن عبيد الله الغيلاني حدثنا أبو عامر، - يعني العقدي - حدثنا رباح، عن قيس بن سعد، عن مجاهد، قال جاء بشير العدوي إلى ابن عباس فجعل يحدث ويقول قال رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم فجعل ابن عباس لا يأذن لحديثه ولا ينظر إليه فقال يا ابن عباس ما لي لا أراك تسمع لحديثي أحدثك عن رسول الله صلى الله عليه وسلم ولا تسمع ‏.‏ فقال ابن عباس إنا كنا مرة إذا سمعنا رجلا يقول قال رسول الله صلى الله عليه وسلم ابتدرته أبصارنا وأصغينا إليه بآذاننا فلما ركب الناس الصعب والذلول لم نأخذ من الناس إلا ما نعرف ‏.‏",
      "text_en": "",
      "chain": [
        "20443",
        "172",
        "11028"
      ]
    },
    {
      "hadith_no": "161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن سعيد، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وسبعون شعبة والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Prophet (may peace be upon him) said:                      Iman has over seventy branches, and modesty is a branch of Iman.",
      "chain": [
        "30359",
        "30553",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق، قالا أخبرنا أبو عامر العقدي، حدثنا داود بن قيس، حدثني إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي، قال نهاني حبي صلى الله عليه وسلم أن أقرأ راكعا أو ساجدا ‏.‏",
      "text_en": " 'Ali reported:                      My loved one (the Holy Prophet) forbade me that I should recite (the Qur'an) in a state of bowing and prostration.",
      "chain": [
        "30022",
        "30312",
        "20443",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "1343",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، حدثنا عبد الله بن جعفر، عن إسماعيل بن محمد، عن عامر بن سعد، عن أبيه، قال كنت أرى رسول الله صلى الله عليه وسلم يسلم عن يمينه وعن يساره حتى أرى بياض خده ‏.‏",
      "text_en": " 'Amir b. Sa'd reported:                      I saw the Messenger of Allah (may peace be open him) pronouncing taslim on his right and on his left till I saw the whiteness of his cheek.",
      "chain": [
        "30123",
        "20443",
        "108",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا زهير بن حرب، حدثنا أبو عامر العقدي، ح قال وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، كلاهما عن شعبة، بهذا الإسناد ‏.‏ وفي حديثهما قال شعبة رفعه مرة ولم يرفعه مرتين ‏.‏",
      "text_en": " Abu Bakr b Abu Shaiban and Yahya b Abu Bukair both of them narrated this hadith with the same chain of transmitters.",
      "chain": [
        "30022",
        "20443",
        "30201"
      ]
    },
    {
      "hadith_no": "2097",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، حدثنا فليح، عن ضمرة، بن سعيد عن عبيد الله بن عبد الله بن عتبة، عن أبي واقد الليثي، قال سألني عمر بن الخطاب عما قرأ به رسول الله صلى الله عليه وسلم في يوم العيد فقلت ب ‏{‏ اقتربت الساعة‏}‏ و ‏{‏ ق والقرآن المجيد‏}‏",
      "text_en": " 'Utba reported that his father Waqid al-Laithi said:                      'Umar b. Khattab asked me what the Messenger of Allah (may peace be upon him) recited on 'Id day. I said:\" The Hour drew near\" and Qaf. By the Glorious Qur'an\".",
      "chain": [
        "30123",
        "20443",
        "20169",
        "11861",
        "11004",
        "4044"
      ]
    },
    {
      "hadith_no": "2407",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني سليمان بن عبيد الله أبو أيوب الغيلاني، حدثنا أبو عامر، - يعني العقدي - حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن طاوس، عن أبي هريرة، قال ضرب رسول الله صلى الله عليه وسلم ‏\"‏ مثل البخيل والمتصدق كمثل رجلين عليهما جنتان من حديد قد اضطرت أيديهما إلى ثديهما وتراقيهما فجعل المتصدق كلما تصدق بصدقة انبسطت عنه حتى تغشي أنامله وتعفو أثره وجعل البخيل كلما هم بصدقة قلصت وأخذت كل حلقة مكانها ‏\"‏ ‏.‏ قال فأنا رأيت رسول الله صلى الله عليه وسلم يقول بإصبعه في جيبه فلو رأيته يوسعها ولا توسع ‏.‏",
      "text_en": " Abu Haraira reported that the Messenger of Allah (may peace be upon him) gave similitudes of a miserly man and the giver of charity as two persons who have two coats-of-mail over them with their hands pressed closely to their breasts and their collar bones. Whenever the giver of charity gives charity it (the coat-of mail) expands so much as to cover his finger tips and obliterate his foot prints. And whenever the miserly person intends to give charity (the coat-of-mail) contracts and every ring grips the place where it is. He (Abu Huraira) said:                      I saw the Messenger of Allah (may peace be upon him) saying with fingers in the opening of his shirt:\" If you had seen him trying to expand it, it will not expand.\"",
      "chain": [
        "20443",
        "20189",
        "11557",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2410",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو عامر الأشعري وابن نمير وأبو كريب كلهم عن أبي أسامة، - قال أبو عامر حدثنا أبو أسامة، - حدثنا بريد، عن جده أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الخازن المسلم الأمين الذي ينفذ - وربما قال يعطي - ما أمر به فيعطيه كاملا موفرا طيبة به نفسه فيدفعه إلى الذي أمر له به - أحد المتصدقين ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Apostle (may peace be upon him) as saying:                      The honest Muslim trustee who spends (sometimes he said\" who gives\" ) what he is commanded to do and he gives that in full with his heart overflowing with cheerfulness and he gives it to one to whom he is ordered, he is one of the givers of charity.",
      "chain": [
        "30201",
        "20318",
        "20443",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2571",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام ح وحدثنا ابن المثنى، حدثنا أبو عامر، حدثنا هشام، ح وحدثنا ابن المثنى، وابن أبي عمر، قالا حدثنا عبد الوهاب بن عبد المجيد، حدثنا أيوب، ح وحدثني زهير بن حرب، حدثنا حسين بن، محمد حدثنا شيبان، كلهم عن يحيى بن أبي كثير، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahya b. Abi Kathir with the same chain of transmitters.",
      "chain": [
        "30483",
        "20401",
        "20443",
        "20295",
        "30421",
        "20259",
        "11015",
        "30022",
        "20384"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، عن التيمي، ح وحدثناه محمد بن المثنى، حدثنا ابن مهدي، حدثنا شعبة، وقال ابن المثنى، حدثنا أبو عامر، حدثنا هشام، وقال ابن المثنى، حدثنا سالم بن نوح، حدثنا عمر يعني ابن عامر، ح وحدثنا أبو بكر بن أبي شيبة حدثنا محمد بن بشر، عن سعيد، كلهم عن قتادة، بهذا الإسناد ‏.‏ نحو حديث همام غير أن في حديث التيمي وعمر بن عامر وهشام لثمان عشرة خلت وفي حديث سعيد في ثنتى عشرة ‏.‏ وشعبة لسبع عشرة أو تسع عشرة ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Qatada with the same chain of transmitters by different narrators (except this difference) that in the hadith transmitted by Taimi and Umar b. Amir and Hisham (the date of setting out is) 18th, and in the hadith transmitted by Sa'id it is the 12th, and in the one transmitted by Shu'ba it is the 17th or 19th.",
      "chain": [
        "30161",
        "20031",
        "11289",
        "30170",
        "20033",
        "20020",
        "20443",
        "20295",
        "20542",
        "30201",
        "20352"
      ]
    },
    {
      "hadith_no": "2736",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه عبد بن حميد، حدثنا أبو عامر عبد الملك بن عمرو، حدثنا إبراهيم، بن طهمان بهذا الإسناد غير أنه قال فناديا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibrahim b. Tahman with the same chain of transmitters but with this variation that he said:                      Both of them made the announcement.\"",
      "chain": [
        "30553",
        "20443",
        "20187"
      ]
    },
    {
      "hadith_no": "2829",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عامر، حدثنا هشام، عن يحيى، عن أبي سلمة، قال تذاكرنا ليلة القدر فأتيت أبا سعيد الخدري - رضى الله عنه - وكان لي صديقا فقلت ألا تخرج بنا إلى النخل فخرج وعليه خميصة فقلت له سمعت رسول الله صلى الله عليه وسلم يذكر ليلة القدر فقال نعم اعتكفنا مع رسول الله صلى الله عليه وسلم العشر الوسطى من رمضان فخرجنا صبيحة عشرين فخطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إني أريت ليلة القدر وإني نسيتها - أو أنسيتها - فالتمسوها في العشر الأواخر من كل وتر وإني أريت أني أسجد في ماء وطين فمن كان اعتكف مع رسول الله صلى الله عليه وسلم فليرجع ‏\"‏ ‏.‏ قال فرجعنا وما نرى في السماء قزعة قال وجاءت سحابة فمطرنا حتى سال سقف المسجد وكان من جريد النخل وأقيمت الصلاة فرأيت رسول الله صلى الله عليه وسلم يسجد في الماء والطين قال حتى رأيت أثر الطين في جبهته ‏.‏",
      "text_en": " Abu Salama reported:                      'We discussed amongst ourselves Lailat-ul-Qadr. I came to Abu Sa'id al-Khudri (Allah be pleased with him) who was a friend of mine and said to him: Would you not go with us to the garden of date trees? He went out with a cloak over him. I said to him: Did you hear the Messenger of Allah (may peace be upon him) making mention of Lailat-ul-Qadr? He said: Yes, (and added) we were observing i'tikaf with the Messenger of Allah (may peace be upon him) in the middle ten days of Ramadan, and came out on the morning of the twentieth and the Messenger of Allah (may peace be upon him) addressed us and said: I was shown Lailat-ul-Qadr, but I forgot (the exact night) or I was caused to forget it, so seek it in the last ten odd (nights), and I was shown that I was prostrating in water and clay. So he who wanted to observe i'tikaf with the Messenger of Allah (inay peace be upon him) should return (to the place of i'tikaf). He (Abu Sa'id al-Khudri) said: And we returned and did not find any patch of cloud in the sky. Then the cloud gathered and there was (so heavy) a downpour that the roof of the mosque which was made of the branches of date-palms began to drip. Then there was prayer and I saw the Messenger of Allah (may peace be upon him) prostrating in water and clay till I saw the traces of clay on his forehead.",
      "chain": [
        "30170",
        "20443",
        "20295",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "2965",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وأبو أيوب الغيلاني وأحمد بن خراش قال إسحاق أخبرنا وقال الآخران، حدثنا أبو عامر، - وهو عبد الملك بن عمرو - حدثنا رباح، - وهو ابن أبي معروف - عن عطاء، عن ابن عباس، - رضى الله عنهما - أن النبي صلى الله عليه وسلم قال لضباعة رضى الله عنها ‏\"‏ حجي واشترطي أن محلي حيث تحبسني ‏\"‏ ‏.‏ وفي رواية إسحاق أمر ضباعة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Abbas with a slight variation of words.",
      "chain": [
        "30123",
        "30312",
        "20443",
        "10635",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2977",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني سليمان بن عبيد الله أبو أيوب الغيلاني، حدثنا أبو عامر عبد الملك، بن عمرو حدثنا عبد العزيز بن أبي سلمة الماجشون، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نذكر إلا الحج حتى جئنا سرف فطمثت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقلت والله لوددت أني لم أكن خرجت العام قال ‏\"‏ ما لك لعلك نفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ هذا شىء كتبه الله على بنات آدم افعلي ما يفعل الحاج غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏ ‏.‏ قالت فلما قدمت مكة قال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ اجعلوها عمرة ‏\"‏ ‏.‏ فأحل الناس إلا من كان معه الهدى - قالت - فكان الهدى مع النبي صلى الله عليه وسلم وأبي بكر وعمر وذوي اليسارة ثم أهلوا حين راحوا - قالت - فلما كان يوم النحر طهرت فأمرني رسول الله صلى الله عليه وسلم فأفضت - قالت - فأتينا بلحم بقر ‏.‏ فقلت ما هذا فقالوا أهدى رسول الله صلى الله عليه وسلم عن نسائه البقر ‏.‏ فلما كانت ليلة الحصبة قلت يا رسول الله يرجع الناس بحجة وعمرة وأرجع بحجة قالت فأمر عبد الرحمن بن أبي بكر فأردفني على جمله - قالت - فإني لأذكر وأنا جارية حديثة السن أنعس فتصيب وجهي مؤخرة الرحل حتى جئنا إلى التنعيم فأهللت منها بعمرة جزاء بعمرة الناس التي اعتمروا ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported:                      We went with the Messenger of Allah (may peace be upon him) with no other aim but that of Hajj till we came (to the place known as) Sarif; and there I entered in the state of menses. The Messenger of Allah (may peace be upon him) came to me while I was weeping. He said: What makes you weep? I said: Would that I had not come (for Pilgrimage) this year. He (the Holy Prophet) said: What has happened to you? You have perhaps entered the period of menses. I said: Yes. He said: This is what has been ordained for the daughters of Adam. Do what a pilgrim does except that you should not circumambu- late the House, till you are purified (of the menses). She ('A'isha) said: When I came to Mecca, the Messenger of Allah (may peace be upon him) said to his companions: Make this (Ihram) the Ihram for 'Umra. So the people put off Ihbaim except those who had sacrificial animals with them. She ('A'isha) said: The Apostle of Allah (may peace be upon him) had the sacrificial animal with him, and so had Abd Bakr, 'Umar and other persons of means. They (those who had put off lhram again) put on Ihram (for Hajj) when they marched (towards Mina), and it was the 8th of Dhu'I-Hijja. She ('A'isha) said: When it was the day of sacrifice (10th of Dhu'I-Hijia), I was purified, and the Messenger of Allah (may peace be upon him) commanded me and I did the circumambulation of Ifada. She said that the flesh of cow was sent to us. I said: What is It? They said: The Messenger of Allah (may peace be upon him) has offered cow as sacrifice on behalf of his wives. When it was the might at Hasba, I said: Messenger of Allah, people are coming back from Hajj and Umra, where as I am coming back from Hajj (alone). She (IA'isha) reported: He (the Holy Prophet) commanded\" Abd al- Rahman b. Abu Bakr to mount me upon his camel behind him. She ('A'isha) said: I was very young and I well remember that I dozed oil and my face touched the bind part of the haudaj (camel litter) till we came to Tan'im, and entered into the state of Ihram in lieu of Umra (which I for the time being abandoned) and which the people had performed.",
      "chain": [
        "20443",
        "20026",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3386",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، جميعا عن العقدي، - قال عبد أخبرنا عبد الملك بن عمرو، - حدثنا عبد الله بن جعفر، عن إسماعيل بن محمد، عن عامر بن، سعد أن سعدا، ركب إلى قصره بالعقيق فوجد عبدا يقطع شجرا أو يخبطه فسلبه فلما رجع سعد جاءه أهل العبد فكلموه أن يرد على غلامهم أو عليهم ما أخذ من غلامهم فقال معاذ الله أن أرد شيئا نفلنيه رسول الله صلى الله عليه وسلم ‏.‏ وأبى أن يرد عليهم ‏.‏",
      "text_en": " 'Amir b. Sa'd reported that Sa'd rode to his castle in al-'Aqiq and found a slave cutting down the trees, or beating off their leaves, so he stripped him off his belongings. When Sa'd returned, there came to him the masters of the slave and negotiated with him asking him to return to their slave or to them what he had taken from their slave, whereupon he said:                      God forbid that I should return anything which Allah's Messenger (may peace be upon him) has given me as spoil, and refused to return anything to them.",
      "chain": [
        "30123",
        "30553",
        "20443",
        "108",
        "10554"
      ]
    },
    {
      "hadith_no": "3909",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثنا أبو عامر، - يعني العقدي - حدثنا قرة، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من اشترى شاة مصراة فهو بالخيار ثلاثة أيام فإن ردها رد معها صاعا من طعام لا سمراء ‏\"‏‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      lie who buys a goat having its udder tied up has the option to return it within three days. If he returns it he should pay a sa' of dates. Wheat is not essential.",
      "chain": [
        "30452",
        "20443",
        "11301",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4234",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، وأبو عامر العقدي ح وحدثنا محمد بن المثنى، حدثنا وهب بن جرير، كلهم عن شعبة، بهذا الإسناد ‏.‏ في حديث وهب بن جرير فنزلت آية الفرائض ‏.‏ وفي حديث النضر والعقدي فنزلت آية الفرض ‏.‏ وليس في رواية أحد منهم قول شعبة لابن المنكدر ‏.‏",
      "text_en": " This hadith is transmitted on the authority of Shu'ba but with a slight variation of words.",
      "chain": [
        "30123",
        "20291",
        "20443",
        "30170",
        "20298"
      ]
    },
    {
      "hadith_no": "4480",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا قرة بن خالد، حدثنا محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، وعن رجل، آخر هو في نفسي أفضل من عبد الرحمن بن أبي بكرة ح وحدثنا محمد بن عمرو بن جبلة وأحمد بن خراش قالا حدثنا أبو عامر عبد الملك بن عمرو حدثنا قرة بإسناد يحيى بن سعيد - وسمى الرجل حميد بن عبد الرحمن - عن أبي بكرة قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر فقال ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ وساقوا الحديث بمثل حديث ابن عون غير أنه لا يذكر ‏\"‏ وأعراضكم ‏\"‏ ‏.‏ ولا يذكر ثم انكفأ إلى كبشين وما بعده وقال في الحديث ‏\"‏ كحرمة يومكم هذا في شهركم هذا في بلدكم هذا إلى يوم تلقون ربكم ألا هل بلغت ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Bakra through another chain of transmitters (and the words are):                     \" Allah's Messenger (may peace be upon him) addressed us on the day of Nahr (Sacrifice) and said: What day is this? And the rest of the hadith is the same except that he did not make mention of\" your honour,\" and also did not make mention of this: He then turned his attention towards two rams and what follows, and in a hadith (the words pertaining to sacred- ness are recorded in this way):\" Like the sacredness of this day of yours, in this month of yours, in this city of yours to the day when you will meet your Lord. Behold, have I not conveyed (the Message of God)? They said: Yes. He said: O Allah, bear witness.\"",
      "chain": [
        "30514",
        "20031",
        "11301",
        "11035",
        "11294",
        "11220",
        "20443"
      ]
    },
    {
      "hadith_no": "4497",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، وإسحاق بن منصور، جميعا عن أبي عامر العقدي، حدثنا عبد الله بن جعفر، - من ولد المسور بن مخرمة - عن يزيد بن، عبد الله بن الهاد بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Yazid b. 'Abdullah b. al-Had with the same chain of transmitters.",
      "chain": [
        "30123",
        "30170",
        "30313",
        "20443"
      ]
    },
    {
      "hadith_no": "4522",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، كلاهما عن شعبة، عن سماك، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث ابن جعفر ووافقه شبابة على قوله فرده مرتين ‏.‏ وفي حديث أبي عامر فرده مرتين أو ثلاثا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir b. Samura through another chain of transmitters with the difference that along with the mentioning (of the fact) that he (the Holy Prophet) turned him away twice, or thrice.",
      "chain": [
        "30201",
        "20426",
        "30123",
        "20443",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4639",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسن بن علي الحلواني، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، عن المغيرة، - وهو ابن عبد الرحمن الحزامي - عن أبي الزناد، عن الأعرج، عن أبي، هريرة أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تمنوا لقاء العدو فإذا لقيتموهم فاصبروا‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Do not desire an encounter with the enemy; but when you encounter them, be firm.",
      "chain": [
        "30115",
        "30553",
        "20443",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4779",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هاشم بن القاسم، ح وحدثنا إسحاق بن، إبراهيم أخبرنا أبو عامر العقدي، كلاهما عن عكرمة بن عمار، ح وحدثنا عبد الله بن، عبد الرحمن الدارمي - وهذا حديثه - أخبرنا أبو علي الحنفي، عبيد الله بن عبد المجيد حدثنا عكرمة، - وهو ابن عمار - حدثني إياس بن سلمة، حدثني أبي قال، قدمنا الحديبية مع رسول الله صلى الله عليه وسلم ونحن أربع عشرة مائة وعليها خمسون شاة لا ترويها - قال - فقعد رسول الله صلى الله عليه وسلم على جبا الركية فإما دعا وإما بسق فيها - قال - فجاشت فسقينا واستقينا ‏.‏ قال ثم إن رسول الله صلى الله عليه وسلم دعانا للبيعة في أصل الشجرة ‏.‏ قال فبايعته أول الناس ثم بايع وبايع حتى إذا كان في وسط من الناس قال ‏\"‏ بايع يا سلمة ‏\"‏ ‏.‏ قال قلت قد بايعتك يا رسول الله في أول الناس قال ‏\"‏ وأيضا ‏\"‏ ‏.‏ قال ورآني رسول الله صلى الله عليه وسلم عزلا - يعني ليس معه سلاح - قال فأعطاني رسول الله صلى الله عليه وسلم حجفة أو درقة ثم بايع حتى إذا كان في آخر الناس قال ‏\"‏ ألا تبايعني يا سلمة ‏\"‏ ‏.‏ قال قلت قد بايعتك يا رسول الله في أول الناس وفي أوسط الناس قال ‏\"‏ وأيضا ‏\"‏ ‏.‏ قال فبايعته الثالثة ثم قال لي ‏\"‏ يا سلمة أين حجفتك أو درقتك التي أعطيتك ‏\"‏ ‏.‏ قال قلت يا رسول الله لقيني عمي عامر عزلا فأعطيته إياها - قال - فضحك رسول الله صلى الله عليه وسلم وقال ‏\"‏ إنك كالذي قال الأول اللهم أبغني حبيبا هو أحب إلى من نفسي ‏\"‏ ‏.‏ ثم إن المشركين راسلونا الصلح حتى مشى بعضنا في بعض واصطلحنا ‏.‏ قال وكنت تبيعا لطلحة بن عبيد الله أسقي فرسه وأحسه وأخدمه وآكل من طعامه وتركت أهلي ومالي مهاجرا إلى الله ورسوله صلى الله عليه وسلم قال فلما اصطلحنا نحن وأهل مكة واختلط بعضنا ببعض أتيت شجرة فكسحت شوكها فاضطجعت في أصلها - قال - فأتاني أربعة من المشركين من أهل مكة فجعلوا يقعون في رسول الله صلى الله عليه وسلم فأبغضتهم فتحولت إلى شجرة أخرى وعلقوا سلاحهم واضطجعوا فبينما هم كذلك إذ نادى مناد من أسفل الوادي يا للمهاجرين قتل ابن زنيم ‏.‏ قال فاخترطت سيفي ثم شددت على أولئك الأربعة وهم رقود فأخذت سلاحهم ‏.‏ فجعلته ضغثا في يدي قال ثم قلت والذي كرم وجه محمد لا يرفع أحد منكم رأسه إلا ضربت الذي فيه عيناه ‏.‏ قال ثم جئت بهم أسوقهم إلى رسول الله صلى الله عليه وسلم - قال - وجاء عمي عامر برجل من العبلات يقال له مكرز ‏.‏ يقوده إلى رسول الله صلى الله عليه وسلم على فرس مجفف في سبعين من المشركين فنظر إليهم رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعوهم يكن لهم بدء الفجور وثناه ‏\"‏ فعفا عنهم رسول الله صلى الله عليه وسلم وأنزل الله ‏{‏ وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏}‏ الآية كلها ‏.‏ قال ثم خرجنا راجعين إلى المدينة فنزلنا منزلا بيننا وبين بني لحيان جبل وهم المشركون فاستغفر رسول الله صلى الله عليه وسلم لمن رقي هذا الجبل الليلة كأنه طليعة للنبي صلى الله عليه وسلم وأصحابه - قال سلمة - فرقيت تلك الليلة مرتين أو ثلاثا ثم قدمنا المدينة فبعث رسول الله صلى الله عليه وسلم بظهره مع رباح غلام رسول الله صلى الله عليه وسلم وأنا معه وخرجت معه بفرس طلحة أنديه مع الظهر فلما أصبحنا إذا عبد الرحمن الفزاري قد أغار على ظهر رسول الله صلى الله عليه وسلم فاستاقه أجمع وقتل راعيه قال فقلت يا رباح خذ هذا الفرس فأبلغه طلحة بن عبيد الله وأخبر رسول الله صلى الله عليه وسلم أن المشركين قد أغاروا على سرحه - قال - ثم قمت على أكمة فاستقبلت المدينة فناديت ثلاثا يا صباحاه ‏.‏ ثم خرجت في آثار القوم أرميهم بالنبل وأرتجز أقول أنا ابن الأكوع واليوم يوم الرضع فألحق رجلا منهم فأصك سهما في رحله حتى خلص نصل السهم إلى كتفه - قال - قلت خذها وأنا ابن الأكوع واليوم يوم الرضع قال فوالله ما زلت أرميهم وأعقر بهم فإذا رجع إلى فارس أتيت شجرة فجلست في أصلها ثم رميته فعقرت به حتى إذا تضايق الجبل فدخلوا في تضايقه علوت الجبل فجعلت أرديهم بالحجارة - قال - فما زلت كذلك أتبعهم حتى ما خلق الله من بعير من ظهر رسول الله صلى الله عليه وسلم إلا خلفته وراء ظهري وخلوا بيني وبينه ثم اتبعتهم أرميهم حتى ألقوا أكثر من ثلاثين بردة وثلاثين رمحا يستخفون ولا يطرحون شيئا إلا جعلت عليه آراما من الحجارة يعرفها رسول الله صلى الله عليه وسلم وأصحابه حتى أتوا متضايقا من ثنية فإذا هم قد أتاهم فلان بن بدر الفزاري فجلسوا يتضحون - يعني يتغدون - وجلست على رأس قرن قال الفزاري ما هذا الذي أرى قالوا لقينا من هذا البرح والله ما فارقنا منذ غلس يرمينا حتى انتزع كل شىء في أيدينا ‏.‏ قال فليقم إليه نفر منكم أربعة ‏.‏ قال فصعد إلى منهم أربعة في الجبل - قال - فلما أمكنوني من الكلام - قال - قلت هل تعرفوني قالوا لا ومن أنت قال قلت أنا سلمة بن الأكوع والذي كرم وجه محمد صلى الله عليه وسلم لا أطلب رجلا منكم إلا أدركته ولا يطلبني رجل منكم ‏.‏ فيدركني قال أحدهم أنا أظن ‏.‏ قال فرجعوا فما برحت مكاني حتى رأيت فوارس رسول الله صلى الله عليه وسلم يتخللون الشجر - قال - فإذا أولهم الأخرم الأسدي على إثره أبو قتادة الأنصاري وعلى إثره المقداد بن الأسود الكندي - قال - فأخذت بعنان الأخرم - قال - فولوا مدبرين قلت يا أخرم احذرهم لا يقتطعوك حتى يلحق رسول الله صلى الله عليه وسلم وأصحابه ‏.‏ قال يا سلمة إن كنت تؤمن بالله واليوم الآخر وتعلم أن الجنة حق والنار حق فلا تحل بيني وبين الشهادة ‏.‏ قال فخليته فالتقى هو وعبد الرحمن - قال - فعقر بعبد الرحمن فرسه وطعنه عبد الرحمن فقتله وتحول على فرسه ولحق أبو قتادة فارس رسول الله صلى الله عليه وسلم بعبد الرحمن فطعنه فقتله فوالذي كرم وجه محمد صلى الله عليه وسلم لتبعتهم أعدو على رجلى حتى ما أرى ورائي من أصحاب محمد صلى الله عليه وسلم ولا غبارهم شيئا حتى يعدلوا قبل غروب الشمس إلى شعب فيه ماء يقال له ذو قرد ليشربوا منه وهم عطاش - قال - فنظروا إلى أعدو وراءهم فحليتهم عنه - يعني أجليتهم عنه - فما ذاقوا منه قطرة - قال - ويخرجون فيشتدون في ثنية - قال - فأعدو فألحق رجلا منهم فأصكه بسهم في نغض كتفه ‏.‏ قال قلت خذها وأنا ابن الأكوع واليوم يوم الرضع قال يا ثكلته أمه أكوعه بكرة قال قلت نعم يا عدو نفسه أكوعك بكرة - قال - وأردوا فرسين على ثنية قال فجئت بهما أسوقهما إلى رسول الله صلى الله عليه وسلم - قال - ولحقني عامر بسطيحة فيها مذقة من لبن وسطيحة فيها ماء فتوضأت وشربت ثم أتيت رسول الله صلى الله عليه وسلم وهو على الماء الذي حليتهم عنه فإذا رسول الله صلى الله عليه وسلم قد أخذ تلك الإبل وكل شىء استنقذته من المشركين وكل رمح وبردة وإذا بلال نحر ناقة من الإبل الذي استنقذت من القوم وإذا هو يشوي لرسول الله صلى الله عليه وسلم من كبدها وسنامها - قال - قلت يا رسول الله خلني فأنتخب من القوم مائة رجل فأتبع القوم فلا يبقى منهم مخبر إلا قتلته - قال - فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه في ضوء النار فقال ‏\"‏ يا سلمة أتراك كنت فاعلا ‏\"‏ ‏.‏ قلت نعم والذي أكرمك ‏.‏ فقال ‏\"‏ إنهم الآن ليقرون في أرض غطفان ‏\"‏ ‏.‏ قال فجاء رجل من غطفان فقال نحر لهم فلان جزورا فلما كشفوا جلدها رأوا غبارا فقالوا أتاكم القوم فخرجوا هاربين ‏.‏ فلما أصبحنا قال رسول الله صلى الله عليه وسلم ‏\"‏ كان خير فرساننا اليوم أبو قتادة وخير رجالتنا سلمة ‏\"‏ ‏.‏ قال ثم أعطاني رسول الله صلى الله عليه وسلم سهمين سهم الفارس وسهم الراجل فجمعهما لي جميعا ثم أردفني رسول الله صلى الله عليه وسلم وراءه على العضباء راجعين إلى المدينة - قال - فبينما نحن نسير قال وكان رجل من الأنصار لا يسبق شدا - قال - فجعل يقول ألا مسابق إلى المدينة هل من مسابق فجعل يعيد ذلك - قال - فلما سمعت كلامه قلت أما تكرم كريما ولا تهاب شريفا قال لا إلا أن يكون رسول الله صلى الله عليه وسلم قال قلت يا رسول الله بأبي وأمي ذرني فلأسابق الرجل قال ‏\"‏ إن شئت ‏\"‏ ‏.‏ قال قلت اذهب إليك وثنيت رجلى فطفرت فعدوت - قال - فربطت عليه شرفا أو شرفين أستبقي نفسي ثم عدوت في إثره فربطت عليه شرفا أو شرفين ثم إني رفعت حتى ألحقه - قال - فأصكه بين كتفيه - قال - قلت قد سبقت والله قال أنا أظن ‏.‏ قال فسبقته إلى المدينة قال فوالله ما لبثنا إلا ثلاث ليال حتى خرجنا إلى خيبر مع رسول الله صلى الله عليه وسلم قال فجعل عمي عامر يرتجز بالقوم تالله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا ونحن عن فضلك ما استغنينا فثبت الأقدام إن لاقينا وأنزلن سكينة علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا ‏\"‏ ‏.‏ قال أنا عامر ‏.‏ قال ‏\"‏ غفر لك ربك ‏\"‏ ‏.‏ قال وما استغفر رسول الله صلى الله عليه وسلم لإنسان يخصه إلا استشهد ‏.‏ قال فنادى عمر بن الخطاب وهو على جمل له يا نبي الله لولا ما متعتنا بعامر ‏.‏ قال فلما قدمنا خيبر قال خرج ملكهم مرحب يخطر بسيفه ويقول قد علمت خيبر أني مرحب شاكي السلاح بطل مجرب إذا الحروب أقبلت تلهب قال وبرز له عمي عامر فقال قد علمت خيبر أني عامر شاكي السلاح بطل مغامر قال فاختلفا ضربتين فوقع سيف مرحب في ترس عامر وذهب عامر يسفل له فرجع سيفه على نفسه فقطع أكحله فكانت فيها نفسه ‏.‏ قال سلمة فخرجت فإذا نفر من أصحاب النبي صلى الله عليه وسلم يقولون بطل عمل عامر قتل نفسه قال فأتيت النبي صلى الله عليه وسلم وأنا أبكي فقلت يا رسول الله بطل عمل عامر قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال ذلك ‏\"‏ ‏.‏ قال قلت ناس من أصحابك ‏.‏ قال ‏\"‏ كذب من قال ذلك بل له أجره مرتين ‏\"‏ ‏.‏ ثم أرسلني إلى علي وهو أرمد فقال ‏\"‏ لأعطين الراية رجلا يحب الله ورسوله أو يحبه الله ورسوله ‏\"‏ ‏.‏ قال فأتيت عليا فجئت به أقوده وهو أرمد حتى أتيت به رسول الله صلى الله عليه وسلم فبسق في عينيه فبرأ وأعطاه الراية وخرج مرحب فقال قد علمت خيبر أني مرحب شاكي السلاح بطل مجرب إذا الحروب أقبلت تلهب فقال علي أنا الذي سمتني أمي حيدره كليث غابات كريه المنظره أوفيهم بالصاع كيل السندره قال فضرب رأس مرحب فقتله ثم كان الفتح على يديه ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Salama. He heard the tradition from his father who said:                      We arrived at Hudaibiya with the Messenger of Allah (may peace be upon him) and we were fourteen hundred in number. There were fifty goats for them which could not be watered (by the small quantity of water in the local well). So, the Messenger of Allah (may peace be upon him) sat on the brink of the well. Either he prayed or spat into the well The water welled up. We drank and watered (the beasts as well). Then the Messenger of Allah (may peace be upon him) called us to take the vow of allegiance, as he was sitting at the base of a tree. I was the first man to take the vow. Then other people took the vow. When half the number of people had done so, he said to me: You take the vow, Salama. I said: I was one of those who took the vow in the first instance. He said: (You may do) again. Then the Messenger. of Allah (may peace be upon him) saw that I was without weapons. He gave me a big or a small shield. Then he continued to administer vows to the people until it was the last batch of them. He said (to me): Won't you swear allegiance, Salama? I said: Messenger of Allah, I took the oath with the first batch of the people and then again when you were in the middle of the people. He said: (Doesn't matter), you may (do so) again. So I took the oath of allegiance thrice. Then he said to me: Salama, where is the shield which I gave to thee? I said: Messenger of Allah, my uncle 'Amir met me and he was without any weapons. So I gave the shield to him. The Messenger of Allah (may peace be upon him) laughed and said: You are like a person of the days gone by who said: O God. I seek a friend who is dearer to me than myself. (When all Companions had sworn allegiance to the Holy Prophet), the polytheists sent messages of peace, until people could move from our camp to that of the Meccans and vice versa. Finally, the peace treaty was concluded. I was a dependant of Talha b. Ubaidullah. I watered his horse, rubbed its back. I served Talha (doing odd jobs for him) and partook from his food. I had left my family and my property as an emigrant in the cause of Allah and His Messenger (may peace be uron him). When we and the people of Mecca had concluded a peace treaty and the people of one side began to mix with those of the other, I came to a tree, swept away its thorns and lay down (for rest) at its base; (while I lay there), four of the polytheists from the Meccans came to me and began to talk ill of the Messenger of Allah (may peace be upon him). I got enraged with them and moved to another tree. They hung their weapons (to the branches of the tree) and lay down (for rest). (While they lay there), somebody from the lower part of the valley cried out: Run up, O Muhajirs! Ibn Zunaim has been murdered. I drew my sword and attacked these four while they were asleep. I seized their arms and collected them up in my hand, and said: By the Being Who has conferred honour upon Muhammad, none of you shall raise his head, else I will smite his face. (Then) I came driving them along to the Holy Prophet (may peace be upon him). (At the same time). my uncle Amir came (to him) with a man from\" Abalat called Mikraz. Amir was dragging him on a horse with a thick covering on its back along with seventy polytheists. The Messenger of Allah (may peace be upon him) cast a glance at them and said: Let them go (so that) they may prove guilty of breach of trust more than once (before we take action against them). So the Messenger of Allah (may peace be upon him) forgave them. On this occasion. God revealed the Qur'anic verse:\" It is He Who restrained their hands from you and your hands from them in the valley of Mecca after He had granted you a victory over them\" (xlviii. 24). Then we moved returning to Medina, and halted at a place where there was a mountain between us and Banu Lihyan who were polytheists. The Messenaer of Allah (may peace be upon him) asked God's forgiveness for one who ascended the mountain at night to act as a scout for the Messenger of Allah (may peace be upon him) and his Compinions. I ascended (that mountain) twice or thrice that night. (At last) we reached Medina. The Messenger of Allah (may peace be upon him) sent his camels with his slave, Rabah, and I was with him. I (also) went to the pasture with the horse of Talha along with the camels. When the day dawned, Abd al-Rahman al-Fazari made a raid and drove away all the camels of the Messenger of Allah (may peace be upon him), and killed the man who looked after them. I said: Rabah, ride this horse, take it to Talha b. 'Ubaidullah and Inform the Messenger of Allah (may peace be upon him) that the polytheists have made away with his camels. Then I stood upon a hillock and turning my face to Medina, shouted thrice: Come to our help I Then I set out in pursuit of the raiders, shooting at them with arrows and chanting a (self-eulogatory) verse in the Iambic metre: I am the son of al-Akwa' And today is the day of defeat for the mean. I would overtake a man from them, shoot at him an arrow which, piercing through the saddle, would reach his shoulder. and I would say: Take it, chanting at the same time the verse And I am the son of al-Akwa' And tody is the day of defeat for the mean. By God, I continued shooting at them and hamstringing their animals. Whenever a horseman turned upon me, I would come to a tree and (hid myself) sitting at its base. Then I would shoot at him and hamstring his horse. (At last) they entered a narrow mountain gorge. I ascended that mountain and held them at bay throwing stones at them. I continued to chase them in this way until I got all the camels of the Messenger of Allah (may peace be upon him) released and no camel was left with them. They left me; then I followed them shooting at them (continually) until they dropped more than thirty mantles and thirty lances. lightening their burden. On everything they dropped, I put a mark with the help of (a piece of) stone so that the Messenger of Allah (may peace be upon him) and his Companions might recognise them (that it was booty left by the enemy). (They went on) until They came to a narrow valley when so and so, son of Badr al-Fazari joined them. They (now) sat down to take their breakfast and I sat on the top of a tapering rock. Al-Fazari said: Who is that fellow I am seeing? They said: This fellow has harassed us. By God, he has not left us since dusk and has been (continually) shooting at us until he has snatched everything from our hands. He said: Four of you should make a dash at him (and kill him). (Accordingly), four of them ascended the mountain coming towards me. When it became possible for me to talk to them, I said: Do you recognise me? They said: No. Who are thou? I said: I am Salama, son of al-Akwa'. By the Being Who has honoured the countenance of Muhammad (may peace be upon him) I can kill any of you I like but none of you will be able to kill me. One of them said: I think (he is right). So they returned. I did not move from my place until I saw the horsemen of the Messenger of Allah (may peace be upon him), who came riding through the trees. Lo! the foremost among them was Akhram al-Asadi. Behind him was Abu Qatada al-Ansari and behind him was al-Miqdad b. al-Aswad al-Kindi. I caught hold of the rein of Akhram's horse (Seeing this). they (the raiders) fled. I said (to Akhram): Akhram, guard yourself against them until Allah's Messenger (may peace be upon him) and his Companions join you. He said: ) Salama, if you believe In Allah and the Day of Judgment and (if) you kaow that Paradise is a reality and Hell is a reality, you should not stand between me and martyrdom. so I let him go. Akhram and Abd al-Rahman (Fazari) met in combat. Akhram hamstrung Abd al-Rahman's horse and the latter struck him with his lance and killed him. Abd al-Rabman turned about riding Akhram's horse. Abu Qatada, a horse-man of the Messenger of Allah (may peace be upon him), met 'Abd al-Rahman (in combat), smote him with his lance and killed him. By the Being Who honoured the countenance of Muhammad (may peace oe upon him), I followed them running on my feet (so fast) that I couldn't see behind me the Companions of Muhammad (may peace be upon him), nor any dust raised by their horses. (I followed them) until before sunset they reached a valley which had a spring of water, which was called Dhu Qarad, so that they could have a drink, for they were thirsty. They saw me running towards them. I turned them out of the valley before they could drink a drop of its water. They left the valley and ran down a slope. I ran (behind them), overtook a man from them, shot him with an arrow through the shoulder blade and said: Take this. I am the son of al-Akwa'; and today is the day of annihilation for the people who are mean. The fellow (who was wounded) said: May his mother weep over him! Are you the Akwa' who has been chasing us since morning? I said: Yes, O enemy of thyself, the same Akwa'. They left two horses dead tired on the hillock and I came dragging them along to the Messenger of Allah (may peace be upon him). I met 'Amir who had with him a container having milk diluted with water and a container having water. I performed ablution with the water and drank the milk. Then I came to the Messenger of Allah (may peace be upon him) while he was at (the spring of) water from which I had driven them away. The Messenger of Allah (may peace be upon him) had captured those camels and everything else I had captured and all the lances and mantles I had snatched from the polytheists and Bilal had slaughtered a she-camel from the camels I had seized from the people, and was roasting its liver and hump for the Messenger of Allah (may peace be upon him). I said: Messenger of Allah, let me select from our people one hundred men and I will follow the marauders and I will finish them all so that nobody is left to convey the news (of their destruction to their people). (At these words of mine), the Messenger of Allah (may peace be upon him) laughed so much that his molar teeth could be seen in the light of the fire, and he said: Salama, do you think you can do this? I said: Yes, by the Being Who has honoured you. He said: Now they have reached the land of Ghatafan where they are being feted. (At this time) a man from the Ghatafan came along and said: So and so slaughtered a camel for them. When they were exposing its skin, they saw dust (being raised far off). They said: They (Akwa' and his companions) have come. So. they went away fleeing. When it was morning, the Messenger of Allah (may peace be upon him) said: Our best horseman today is Abu Qatada and our best footman today is Salama. Then he gave me two shares of the booty-the share meant for the horseman and the share meant for the footman, and combined both of them for me. Intending to return to Medina, he made me mount behind him on his she-camel named al-Adba'. While we were travelling, a man from the Ansar who could not be beaten in a race said: Is there anyone who could compete (with me) in race to Medina? Is there any competitor? He continued repeating this. When I heard his talk, I said: Don't you show consideration to a dignified person and don't you have awe for a noble man? He said: No, unless he be the Messenger of Allah (may peace be upon him). I said: Messenger of Allah, may my father and mother be thy ransom, let me get down so that I may beat this man (in the race). He said: It you wish, (you may). I said (to the man): I am coming to thee, I then turned my feet. sprang up and tan and gasped (for a while) when one or two elevated places were left and again followed his heel and again gasped (for a while) when one or two elevated places were left and again dashed until I joined him and gave a blow between his shoulders. I said: You have been overtaken, by God. He said: I think so. Thus, I reached Medina ahead of him. By God, we had stayed there only three nights when we set out to Khaibar with the Messenger of Allah (may peace be upon him). (On the way) my uncle, Amir, began to recite the following rajaz verses for the people: By God, if Thou hadst not guided us aright, We would have neither practised charity nor offered prayers. (O God! ) We cannot do without Thy favours; Keep us steadfast when we encounter the enemy, And descend tranquillity upon us. The Messenger of Allah (may peace be upon him) said: Who is this? 'Amir said: it is 'Amir. He said: May thy God forgive thee! The narrator said: Whenever the Messenger of Allah (may peace be upon him) asked forgiveness for a particular person, he was sure to embrace martyrdom. Umar b. Khattab who was riding on his camel called out: Prophet of Allah, I wish you had allowed us to benefit from Amir. Salama continued: When we reached Khaibar, its king named Marhab advanced brandishing his sword and chanting: Khaibar knows that I am Marhab (who behaves like) A fully armed, and well-tried warrior. When the war comes spreading its flames. My uncle, Amir, came out to combat with him, saying: Khaibar certainly knows that I am 'Amir, A fully armed veteran who plunges into battles. They exchanged blows. Marbab's sword struck the shield of 'Amir who bent forward to attack his opponent from below, but his sword recoiled upon him and cut the main artery: in his forearm which caused his death. Salama said: I came out and beard some people among the Companions of the Holy Prophet (may peace be upon him) as saying: Amir's deed has gone waste; he has killed himself. So I came to the Holy Prophet (may peace be upon him) weeping and I said: Messenger of Allah. Amir's deed has gone waste. The Messenger (may peace be upon him) said: Who passed this remark? I said: Some of your Companions. He said: He who has passed that remark has told a lie, for 'Amir there is a double reward. Then he sent me to 'Ali who had tore eyes, and said: I will give the banner to a man who loves Allah and His Messenger or whom Allah and His Messenger love. So I went to 'Ali, brought him beading him along and he had sore eyes, and I took him to the Messenger of Allah (may peace be upon him), who applied his saliva to his eyes and he got well. The Messenger of Allah (may peace be upon him) gave him the banner (and 'Ali went to meet Marhab in a single combat). The latter advanced chanting: Khaibar knows certainly that I am Marhab, A fully armed and well-tried valorous warrior (hero) When war comes spreading its flames. 'Ali chanted in reply: I am the one whose mother named him Haidar, (And am) like a lion of the forest with a terror-striking countenance. I give my opponents the measure of sandara in exchange for sa' (i. e. return thir attack with one that is much more fierce). The narrator said: 'Ali struck at the head of Mirhab and killed him, so the victory (capture of Khaibar) was due to him. This long tradition has also been handed down Through a different chain of transmitters.",
      "chain": [
        "30201",
        "20390",
        "30123",
        "20443",
        "10704",
        "20260",
        "10704"
      ]
    },
    {
      "hadith_no": "5190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثناه ابن المثنى، حدثني وهب بن جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا  أبو عامر العقدي، حدثنا شعبة، بهذا الإسناد ‏.‏ ولم يذكر الشك في قوله هي خير من مسنة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but did not mention tht doubt (expressed in his statement) That is (the goat of less than a year) is better than a goat of more than one year.",
      "chain": [
        "20298",
        "30123",
        "20443"
      ]
    },
    {
      "hadith_no": "5513",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه أبو كريب، حدثنا ابن إدريس، أخبرنا أبو إسحاق الشيباني، وليث بن، أبي سليم عن أشعث بن أبي الشعثاء، بإسنادهم ولم يذكر زيادة جرير وابن مسهر ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن، معاذ حدثنا أبي ح، وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، ح وحدثنا عبد، الرحمن بن بشر حدثنا بهز، قالوا جميعا حدثنا شعبة، عن أشعث بن سليم، بإسنادهم ومعنى حديثهم إلا قوله وإفشاء السلام ‏.‏ فإنه قال بدلها ورد السلام ‏.‏ وقال نهانا عن خاتم الذهب أو حلقة الذهب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ash'ath b. Sulaim with the same chain of transmitters but with this difference that instead of the words:                      Ifsha as-Salam (spreading the salutations), he substituted the words Radd as-Saldm (i. e. responding to the words of salutation) and he said: He forbade (the use of) gold ring.",
      "chain": [
        "30216",
        "20102",
        "11352",
        "10957",
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "30123",
        "20443"
      ]
    },
    {
      "hadith_no": "5652",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، وعقبة بن مكرم، عن سعيد بن عامر، ح وحدثناه إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، جميعا عن شعبة، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30123",
        "30441",
        "20232",
        "30123",
        "20443"
      ]
    },
    {
      "hadith_no": "5763",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، حدثنا النضر بن شميل، وأبو عامر العقدي ح وحدثنا  محمد بن المثنى، حدثني وهب بن جرير، ح وحدثني عبد الرحمن بن بشر، حدثنا بهز، كلهم عن شعبة، بهذا الإسناد ‏.‏ وفي حديثهم كأنه كره ذلك ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording and that is:                      The Holy Prophet (may peace be upon him) uttered these words: It is I. it is I.\" in the manner as if he disapproved of this.",
      "chain": [
        "30123",
        "20291",
        "20443",
        "30170",
        "20298",
        "30356"
      ]
    },
    {
      "hadith_no": "6115",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني أبو معن الرقاشي، وأبو بكر بن نافع وعبد بن حميد قالوا حدثنا أبو عامر - وهو عبد الملك بن عمرو - حدثنا أفلح بن سعيد، حدثنا عبد الله بن رافع، قال كانت أم سلمة تحدث أنها سمعت النبي صلى الله عليه وسلم يقول على المنبر وهي تمتشط ‏\"‏ أيها الناس ‏\"‏ ‏.‏ فقالت لماشطتها كفي رأسي ‏.‏ بنحو حديث بكير عن القاسم بن عباس ‏.‏",
      "text_en": " Umm Salama reported that she heard Allah's Apostle (may peace be upon him) saying this as he was sitting on the pulpit and she was getting her hair combed. (He uttered these words):                     \" O people.\" And she said to one who was combing: Leave my head; the rest of the hadith is the same.",
      "chain": [
        "30432",
        "20443",
        "20501",
        "11864"
      ]
    },
    {
      "hadith_no": "6561",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو عامر الأشعري، وأبو كريب جميعا عن أبي أسامة، قال أبو عامر حدثنا أبو أسامة، حدثنا بريد، عن جده أبي بردة، عن أبي موسى، قال كنت عند النبي صلى الله عليه وسلم وهو نازل بالجعرانة بين مكة والمدينة ومعه بلال فأتى رسول الله صلى الله عليه وسلم رجل أعرابي فقال ألا تنجز لي يا محمد ما وعدتني فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أبشر ‏\"‏ ‏.‏ فقال له الأعرابي أكثرت على من ‏\"‏ أبشر ‏\"‏ ‏.‏ فأقبل رسول الله صلى الله عليه وسلم على أبي موسى وبلال كهيئة الغضبان فقال ‏\"‏ إن هذا قد رد البشرى فاقبلا أنتما ‏\"‏ ‏.‏ فقالا قبلنا يا رسول الله ‏.‏ ثم دعا رسول الله صلى الله عليه وسلم بقدح فيه ماء فغسل يديه ووجهه فيه ومج فيه ثم قال ‏\"‏ اشربا منه وأفرغا على وجوهكما ونحوركما وأبشرا ‏\"‏ ‏.‏ فأخذا القدح ففعلا ما أمرهما به رسول الله صلى الله عليه وسلم فنادتهما أم سلمة من وراء الستر أفضلا لأمكما مما في إنائكما ‏.‏ فأفضلا لها منه طائفة ‏.‏",
      "text_en": " Abu Musa reported:                      I was in the company of Allah's Apostle (may peace be upon him) as he had been sitting in Ji'rana (a place) between Mecca and Medina and Bilal was also there, that there came to Allah's Apostle (may peace be upon him) a desert Arab, and he said: Muhammad, fulfill your promise that you made with me. Allah's Messenger (may peace be upon him) said to him: Accept glad tidings. Thereupon the desert Arab said: You shower glad tidings upon me very much; then Allah's Messenger (may peace be upon him) turned towards Abu Musa and Bilal seemingly in a state of annoyance and said: Verily he has rejected glad tidings but you two should accept them. We said: Allah's Messenger, we have readily accepted them. Then Allah's Messenger (may peace be upon him) called for a cup of water and washed his hands in that and face too and put the saliva in it and then said: Drink out of it and pour it over your faces and over your chest and gladden yourselves. They took hold of the cup and did as Allah's Messenger (may peace be upon him) had commanded them to do. Thereupon Umm Salama called from behind the veil: Spare some water in your vessel for your mother also, and they also gave some water which had been spared for her.",
      "chain": [
        "20318",
        "20443",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6564",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو عامر الأشعري، وأبو كريب جميعا عن أبي أسامة، قال أبو عامر حدثنا أبو أسامة، حدثني بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الأشعريين إذا أرملوا في الغزو أو قل طعام عيالهم بالمدينة جمعوا ما كان عندهم في ثوب واحد ثم اقتسموه بينهم في إناء واحد بالسوية فهم مني وأنا منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that Allah's Messenger (may peace be upon him) said:                      When the Ash'arites run short of provisions in the campaigns or run short of food for their children in Medina they collect whatever is with them in the cloth and then partake equally from one vessel. They are from me and I am from them.",
      "chain": [
        "20318",
        "20443",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7020",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا سليمان بن عبيد الله أبو أيوب الغيلاني، حدثنا أبو عامر، - يعني العقدي - حدثنا عمر، - وهو ابن أبي زائدة - عن أبي إسحاق، عن عمرو بن ميمون، قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير عشر مرار كان كمن أعتق أربعة أنفس من ولد إسماعيل ‏\"‏ ‏.‏ وقال سليمان حدثنا أبو عامر حدثنا عمر حدثنا عبد الله بن أبي السفر عن الشعبي عن ربيع بن خثيم ‏.‏ بمثل ذلك قال فقلت للربيع ممن سمعته قال من عمرو بن ميمون - قال - فأتيت عمرو بن ميمون فقلت ممن سمعته قال من ابن أبي ليلى - قال - فأتيت ابن أبي ليلى فقلت ممن سمعته قال من أبي أيوب الأنصاري يحدثه عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Amr b. Maimun reported:                      He who uttered:\" There is no god but Allah, the One, having no partner with Him, His is the Sovereignty and all praise is due to Him and He is Potent over everything\" ten times, he is like one who emancipated four slaves from the progeny of Isma'il. Rabi' b. Khuthaim narrated a hadith like this. Sha'bi reported: I said to Rabi': From whom did you hear it? He said: From 'Amr b. Maimun. I came to 'Amr b. Maimun and said to him: From whom did you hear this hadith? He said: from Ibn Abi Laila. I came to Ibn Abi Laila and said to him: From whom did you hear this hadith? He said: From Abu Ayyub Ansari, who narrated from Allah's Messenger (may peace be upon him).",
      "chain": [
        "20443",
        "11643",
        "11049",
        "11382"
      ]
    },
    {
      "hadith_no": "7375",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبيد الله بن سعيد، وأبو بكر بن نافع وعبد بن حميد قالوا حدثنا أبو عامر العقدي حدثنا أفلح بن سعيد، حدثني عبد الله بن رافع، مولى أم سلمة قال سمعت  أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن طالت بك مدة أوشكت أن ترى قوما يغدون في سخط الله ويروحون في لعنته في أيديهم مثل أذناب البقر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      If you live for a time, you would certainly see people get up (in the morning) in the wrath of Allah and getting into the evening under the curse of Allah, and there would be in their hands (whips) like the tail of an ox.",
      "chain": [
        "30359",
        "20443",
        "20501",
        "11864",
        "13"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زهير بن حرب، وغيره، قالا حدثنا عبد الملك بن عمرو، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش قالت كنت أستحاض حيضة كثيرة شديدة فأتيت رسول الله صلى الله عليه وسلم أستفتيه وأخبره فوجدته في بيت أختي زينب بنت جحش فقلت يا رسول الله إني امرأة أستحاض حيضة كثيرة شديدة فما ترى فيها قد منعتني الصلاة والصوم فقال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قالت هو أكثر من ذلك ‏.‏ قال ‏\"‏ فاتخذي ثوبا ‏\"‏ ‏.‏ فقالت هو أكثر من ذلك إنما أثج ثجا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ سآمرك بأمرين أيهما فعلت أجزأ عنك من الآخر وإن قويت عليهما فأنت أعلم ‏\"‏ ‏.‏ فقال لها ‏\"‏ إنما هذه ركضة من ركضات الشيطان فتحيضي ستة أيام أو سبعة أيام في علم الله ثم اغتسلي حتى إذا رأيت أنك قد طهرت واستنقأت فصلي ثلاثا وعشرين ليلة أو أربعا وعشرين ليلة وأيامها وصومي فإن ذلك يجزئك وكذلك فافعلي في كل شهر كما تحيض النساء وكما يطهرن ميقات حيضهن وطهرهن وإن قويت على أن تؤخري الظهر وتعجلي العصر فتغتسلين وتجمعين بين الصلاتين الظهر والعصر وتؤخرين المغرب وتعجلين العشاء ثم تغتسلين وتجمعين بين الصلاتين فافعلي وتغتسلين مع الفجر فافعلي وصومي إن قدرت على ذلك ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وهذا أعجب الأمرين إلى ‏\"‏ ‏.1قال أبو داود ورواه عمرو بن ثابت عن ابن عقيل قال فقالت حمنة فقلت هذا أعجب الأمرين إلى ‏.‏2 لم يجعله من قول النبي صلى الله عليه وسلم جعله كلام حمنة ‏.‏ قال أبو داود وعمرو بن ثابت رافضي رجل سوء ولكنه كان صدوقا في الحديث وثابت بن المقدام رجل ثقة وذكره عن يحيى بن معين ‏.‏ قال أبو داود سمعت أحمد يقول حديث ابن عقيل في نفسي منه شىء ‏.‏",
      "text_en": " Narrated Hamnah daughter of Jahsh:                     Hamnah said my menstruation was great in quantity and severe. So I came to the Messenger of Allah (ﷺ) for a decision and told him. I found him in the house of my sister, Zaynab, daughter of Jahsh.  I said: Messenger of Allah, I am a woman who menstruates in great quantity and it is severe, so what do you think about it? It has prevented me from praying and fasting.  He said: I suggest that you should use cotton, for it absorbs the blood.  She replied: It is too copious for that.  He said: Then take a cloth.  She replied: It is too copious for that, for my blood keeps flowing.  The Messenger of Allah (ﷺ) said: I shall give you two commands; whichever of them you follow, that will be sufficient for you without the other, but you know best whether you are strong enough to follow both of them.  He added: This is a stroke of the Devil, so observe your menses for six or seven days, Allah alone knows which it should be; then wash. And when you see that you are purified and quite clean, pray during twenty-three or twenty-four days and nights and fast, for that will be enough for you, and do so every month, just as women menstruate and are purified at the time of their menstruation and their purification.  But if you are strong enough to delay the noon (Zuhr) prayer and advance the afternoon ('Asr) prayer, to wash, and then combine the noon and the afternoon prayer; to delay the sunset prayer and advance the night prayer, to wash, and then combine the two prayers, do so: and to wash at dawn, do so: and fast if you are able to do so if possible.The Messenger of Allah (ﷺ) said: Of the two commands this is more to my liking.1Abu Dawud said: 'Amr b. Thabit narrated from Ibn 'Aqil: Hamnah said: Of the two commands this is the one which is more to my liking.2 In this version these words were not quoted as the statement of the Prophet (ﷺ); it gives it as a statement of Hamnah.Abu Dawud said: 'Amr b. Thabit was a Rafidi. This has been said by Yahya b. Ma'in.Abu Dawud said: I heard Ahmad (b. Hanbal) say: I am doubtful about the tradition transmitted by Ibn 'Aqil.",
      "chain": [
        "30022",
        "20443",
        "20394",
        "12246",
        "11827",
        "578",
        "72"
      ]
    },
    {
      "hadith_no": "511",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو عامر، - يعني العقدي عبد الملك بن عمرو - حدثنا شعبة، عن أبي جعفر، مؤذن مسجد العريان قال سمعت أبا المثنى، مؤذن مسجد الأكبر يقول سمعت ابن عمر، وساق الحديث",
      "text_en": " This tradition has been narrated by Abu Ja’far, the mu’adhdhin of ‘Uryan mosque (at Kufah), from Abu al-Muthanna, the mu’adhdhin of masjid al-akbar (at kufah) on the authority of Ibn ‘Umar. The rest of the tradition was transmitted in a like manner.",
      "chain": [
        "11222",
        "20443",
        "20020",
        "18"
      ]
    },
    {
      "hadith_no": "734",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، أخبرني فليح، حدثني عباس بن سهل، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله صلى الله عليه وسلم فقال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم فذكر بعض هذا قال ثم ركع فوضع يديه على ركبتيه كأنه قابض عليهما ووتر يديه فتجافى عن جنبيه قال ثم سجد فأمكن أنفه وجبهته ونحى يديه عن جنبيه ووضع كفيه حذو منكبيه ثم رفع رأسه حتى رجع كل عظم في موضعه حتى فرغ ثم جلس فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ووضع كفه اليمنى على ركبته اليمنى وكفه اليسرى على ركبته اليسرى وأشار بأصبعه ‏.‏ قال أبو داود روى هذا الحديث عتبة بن أبي حكيم عن عبد الله بن عيسى عن العباس بن سهل لم يذكر التورك وذكر نحو حديث فليح وذكر الحسن بن الحر نحو جلسة حديث فليح وعتبة ‏.‏",
      "text_en": " ‘Abbas b. Sahl. Said:                      Abu Humaid, Abu Usaid, Sahl. B Sa’d and Muhammad b. Maslamah (once) got together and discussed how the Messenger of Allah(ﷺ) used to offer his prayer. Abu Humaid said: I am more informed than any of you regarding the prayer offered by the Messenger of Allah (ﷺ). Then he mentioned a part of it, and said: He then bowed and placed his hands upon his knees as if he caught hold of them; and bent them, keeping (his arms) away from his sides. He them prostrated himself and placed his nose and forehead (on the ground); and kept his arms away from his side, and placed his palms (on the ground opposite his shoulders; he then raised his head that every bone returned to its proper place; (he then prostrated twice) until he finished this prostrations). Then he sat down and spread out his left foot, putting forward the front of his right foot towards the qiblah placing the palm of his right hand on his right knee, and the palm of his left hand on his left knee, and he pointed with his finger.Abu Dawud said: This tradition has been narrated by Ibn al-Mubarak from Fulaih who heard ‘Abbas . Sahl narrating it; but I do not remember it. I think he made the mention of ‘Isa b. ‘Abd Allah who heard ‘Abbas b. Sahl saying: I accompanied Abu Humaid al-Sa’idi.",
      "chain": [
        "30007",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "886",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الملك بن مروان الأهوازي، حدثنا أبو عامر، وأبو داود عن ابن أبي ذئب، عن إسحاق بن يزيد الهذلي، عن عون بن عبد الله، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ركع أحدكم فليقل ثلاث مرات سبحان ربي العظيم وذلك أدناه وإذا سجد فليقل سبحان ربي الأعلى ثلاثا وذلك أدناه ‏\"‏ ‏.‏ قال أبو داود هذا مرسل عون لم يدرك عبد الله ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: When one of you bows, he should say three time,:\"Glory be to my mighty Lord,\" and when he prostrates, he should say: \"Glory be to my most high Lord\" three times. This is the minimum number.Abu Dawud said: The chain of this tradition is broken. The narrator 'Awn did not see 'Abd Allah (b. Mas'ud).",
      "chain": [
        "20443",
        "30002",
        "20177",
        "12010",
        "10806",
        "16"
      ]
    },
    {
      "hadith_no": "905",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الملك بن عمرو، حدثنا هشام، - يعني ابن سعد - عن زيد بن أسلم، عن عطاء بن يسار، عن زيد بن خالد الجهني، أن النبي صلى الله عليه وسلم قال ‏\"‏ من توضأ فأحسن وضوءه ثم صلى ركعتين لا يسهو فيهما غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported the Messenger of Allah (ﷺ) as saying:                      Anyone who performs ablution and performs his ablution well, and then he offers two rak’ahs of prayers in a way that he does not forget ( anything in it), will be forgiven all his past sins.",
      "chain": [
        "30007",
        "20443",
        "20519",
        "11163",
        "11020",
        "3625"
      ]
    },
    {
      "hadith_no": "931",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يونس النسائي، حدثنا عبد الملك بن عمرو، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال لما قدمت على رسول الله صلى الله عليه وسلم علمت أمورا من أمور الإسلام فكان فيما علمت أن قال لي ‏\"‏ إذا عطست فاحمد الله وإذا عطس العاطس فحمد الله فقل يرحمك الله ‏\"‏ ‏.‏ قال فبينما أنا قائم مع رسول الله صلى الله عليه وسلم في الصلاة إذ عطس رجل فحمد الله فقلت يرحمك الله رافعا بها صوتي فرماني الناس بأبصارهم حتى احتملني ذلك فقلت ما لكم تنظرون إلى بأعين شزر قال فسبحوا فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال ‏\"‏ من المتكلم ‏\"‏ ‏.‏ قيل هذا الأعرابي فدعاني رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ إنما الصلاة لقراءة القرآن وذكر الله جل وعز فإذا كنت فيها فليكن ذلك شأنك ‏\"‏ ‏.‏ فما رأيت معلما قط أرفق من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Mu’awiyah b. al-Hakam al-Sulami said ; when I came to the Messenger of Allah (ﷺ) I learnt many things about islam. One of the things that I was taught was that it was that it was pointed out me. When you sneeze, praise Allah (I,e, say “praise be to Allah”); and when someone sneezes and praises Allah, say “ May Allah have mercy on you. Meanwhile I was standing along with the Messenger of Allah (may peace be upon  him) during prayer, all of a sudden a man sneezed, and he praised Allah. So I said, “may Allah have mercy on you”, in a loud voice. The people  gave me disapproving looks so much so that I took ill of it. So I said :                      what do you mean by looking at me with furtive glances. Then they glorified Allah. When the prophet (ﷺ) finished his prayer, he asked; who was the speaker? The Prophet told him; this Bedouin. The Messenger of Allah (ﷺ) called me and said to me: Prayer is meant for the recitation of the Quran, and making mention of Allah. When you are in it (prayer), this should be your work therein. I never saw an instructor more lenient than the Messenger of Allah (ﷺ)",
      "chain": [
        "38623",
        "20443",
        "20169",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، أخبرني فليح، أخبرني عباس بن سهل، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكر هذا الحديث ولم يذكر الرفع إذا قام من ثنتين ولا الجلوس قال حتى فرغ ثم جلس فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ‏.‏",
      "text_en": " ‘Abbas b. Sahl said:                      Abu Humaid, Abu usaid, Sahl b. Sa’d and Muhammad b. Maslamah got together. Then he narrated this tradition. He did not mention the raising of hands when he stood after two rak’ahs, nor did he mention sitting. He said: When he finished (his prostration), he spread his foot (on the ground) and turned the toes of his right feet towards the qiblah(and then he sat on his left foot).",
      "chain": [
        "30007",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "1887",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، يقول فيم الرملان اليوم والكشف عن المناكب، وقد أطأ الله الإسلام ونفى الكفر وأهله مع ذلك لا ندع شيئا كنا نفعله على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Aslam said:                      I heard Umar ibn al-Khattab say: What is the need of walking proudly (ramal) and moving the shoulders (while going round the Ka'bah)? Allah has now strengthened Islam and obliterated disbelief and the infidels. In spite of that we shall not forsake anything that we used to do during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "30007",
        "20443",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2087",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن المثنى، حدثني أبو عامر، حدثنا عباد بن راشد، عن الحسن، حدثني معقل بن يسار، قال كانت لي أخت تخطب إلى فأتاني ابن عم لي فأنكحتها إياه ثم طلقها طلاقا له رجعة ثم تركها حتى انقضت عدتها فلما خطبت إلى أتاني يخطبها فقلت لا والله لا أنكحها أبدا ‏.‏ قال ففي نزلت هذه الآية ‏{‏ وإذا طلقتم النساء فبلغن أجلهن فلا تعضلوهن أن ينكحن أزواجهن ‏}‏ الآية ‏.‏ قال فكفرت عن يميني فأنكحتها إياه ‏.‏",
      "text_en": " Ma’qil bin Yasar said:                      I had a sister and I was asked to give her in marriage. My cousin came to me and I married her to him. He then divorced her one revocable divorce. He abandoned her till her waiting period passed. When I was asked to give her in marriage, he again came to me and asked her in marriage. Thereupon I said to him “No, by Allah, I will never marry her to you. Then the following verse was revealed about my case: “And when ye have divorced women and they reach their term, place not difficulties in the way of their marrying their husbands.” So I expiated for my oath, and married her off to him.",
      "chain": [
        "30170",
        "20443",
        "20242",
        "11016",
        "3120"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن معمر، حدثنا أبو عامر عبد الملك بن عمرو، حدثنا أبو عمرو السدوسي المديني، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن عمرة، عن عائشة، أن حبيبة بنت سهل، كانت عند ثابت بن قيس بن شماس فضربها فكسر بعضها فأتت رسول الله صلى الله عليه وسلم بعد الصبح فاشتكته إليه فدعا النبي صلى الله عليه وسلم ثابتا فقال ‏\"‏ خذ بعض مالها وفارقها ‏\"‏ ‏.‏ فقال ويصلح ذلك يا رسول الله قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإني أصدقتها حديقتين وهما بيدها فقال النبي صلى الله عليه وسلم ‏\"‏ خذهما ففارقها ‏\"‏ ‏.‏ ففعل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Habibah daughter of Sahl was the wife of Thabit ibn Qays Shimmas He beat her and broke some of her part. So she came to the Prophet (ﷺ) after morning, and complained to him against her husband. The Prophet (ﷺ) called on Thabit ibn Qays and said (to him): Take a part of her property and separate yourself from her. He asked: Is that right, Messenger of Allah? He said: Yes. He said: I have given her two gardens of mine as a dower, and they are already in her possession. The Prophet (ﷺ) said: Take them and separate yourself from her.",
      "chain": [
        "30172",
        "20443",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2278",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا عبد الملك بن عمرو، حدثنا عبد العزيز بن محمد، عن يزيد بن الهاد، عن محمد بن إبراهيم، عن نافع بن عجير، عن أبيه، عن علي، - رضى الله عنه - قال خرج زيد بن حارثة إلى مكة فقدم بابنة حمزة فقال جعفر أنا آخذها أنا أحق بها ابنة عمي وعندي خالتها وإنما الخالة أم ‏.‏ فقال علي أنا أحق بها ابنة عمي وعندي ابنة رسول الله صلى الله عليه وسلم وهي أحق بها ‏.‏ فقال زيد أنا أحق بها أنا خرجت إليها وسافرت وقدمت بها ‏.‏ فخرج النبي صلى الله عليه وسلم فذكر حديثا قال ‏\"‏ وأما الجارية فأقضي بها لجعفر تكون مع خالتها وإنما الخالة أم ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Zayd ibn Harithah went out to Mecca and brought the daughter of Hamzah with him. Then Ja'far said: I shall take her; I have more right to her; she is my uncle's daughter and her maternal aunt is my wife; the maternal aunt is like mother. Ali said: I am more entitled to take her. She is my uncle's daughter. The daughter of the Messenger of Allah (ﷺ) is my wife, and she has more right to her. Zayd said: I have more right to her. I went out and journeyed to her, and brought her with me. The Prophet (ﷺ) came out. The narrator mentioned the rest of the tradition. He (i.e. the Prophet) said: As for the girl, I decided in favour of Ja'far. She will live with her maternal aunt. The maternal aunt is like mother.",
      "chain": [
        "30437",
        "20443",
        "20167",
        "11234",
        "11213",
        "947",
        "945",
        "5"
      ]
    },
    {
      "hadith_no": "2638",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الصمد، وأبو عامر عن عكرمة بن عمار، حدثنا إياس بن سلمة، عن أبيه، قال أمر رسول الله صلى الله عليه وسلم علينا أبا بكر - رضى الله عنه - فغزونا ناسا من المشركين فبيتناهم نقتلهم وكان شعارنا تلك الليلة أمت أمت ‏.‏ قال سلمة فقتلت بيدي تلك الليلة سبعة أهل أبيات من المشركين ‏.‏",
      "text_en": " Narrated Salamah ibn al-Akwa':                     The Messenger of Allah (ﷺ) appointed AbuBakr our commander and we fought with some people who were polytheists, and we attacked them at night, killing them.  Our war-cry that night was \"put to death; put to death.\" Salamah said: I killed that night with my hand polytheists belonging to seven houses.",
      "chain": [
        "30115",
        "20250",
        "20443",
        "10704"
      ]
    },
    {
      "hadith_no": "3786",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا ابن المثنى، حدثني أبو عامر، حدثنا هشام، عن قتادة، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم نهى عن لبن الجلالة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) prohibited to drink the milk of the animal which feeds on filth.",
      "chain": [
        "30170",
        "20443",
        "20295",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3827",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عباس بن عبد العظيم، حدثنا أبو عامر عبد الملك بن عمرو، حدثنا خالد بن ميسرة، - يعني العطار - عن معاوية بن قرة، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن هاتين الشجرتين وقال ‏\"‏ من أكلهما فلا يقربن مسجدنا ‏\"‏ ‏.‏ وقال ‏\"‏ إن كنتم لا بد آكليهما فأميتوهما طبخا ‏\"‏ ‏.‏ قال يعني البصل والثوم ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn Qurrah:                     The Messenger of Allah (ﷺ) forbade these two plants (i.e. garlic and onions), and he said: He who eats them should not come near our mosque. If it is necessary to eat them, make them dead by cooking, that is, onions and garlic.",
      "chain": [
        "30437",
        "20443",
        "24112",
        "11306",
        "5238"
      ]
    },
    {
      "hadith_no": "3856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود، وأبو عامر - وهذا لفظ أبي عامر - عن فليح بن سليمان، عن أيوب بن عبد الرحمن بن صعصعة الأنصاري، عن يعقوب بن أبي يعقوب، عن أم المنذر بنت قيس الأنصارية، قالت دخل على رسول الله صلى الله عليه وسلم ومعه علي عليه السلام وعلي ناقه ولنا دوالي معلقة فقام رسول الله صلى الله عليه وسلم يأكل منها وقام علي ليأكل فطفق رسول الله صلى الله عليه وسلم يقول لعلي ‏\"‏ مه إنك ناقه ‏\"‏ ‏.‏ حتى كف علي عليه السلام ‏.‏ قالت وصنعت شعيرا وسلقا فجئت به فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا علي أصب من هذا فهو أنفع لك ‏\"‏ ‏.‏ قال أبو داود قال هارون العدوية ‏.‏",
      "text_en": " Narrated Umm al-Mundhar bint Qays al-Ansariyyah:                     The Messenger of Allah (ﷺ) came to visit me, accompanied by Ali who was convalescing. We had some ripe dates hung up. The Messenger of Allah (ﷺ) got up and began to eat from them.  Ali also got up to eat, but the Messenger of Allah (ﷺ) said repeatedly to Ali: Stop, Ali, for you are convalescing, and Ali stopped.  She said: I then prepared some barley and beer-root and brought it.  The Messenger of Allah (ﷺ) then said: Take some of this, Ali, for it will be more beneficial for you.  AbuDawud said: The narrator Harun said: al-Adawiyyah (i.e. Umm al-Mundhar).",
      "chain": [
        "30524",
        "30002",
        "20443",
        "20169",
        "12604"
      ]
    },
    {
      "hadith_no": "4089",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو عامر، - يعني عبد الملك بن عمرو - حدثنا هشام بن سعد، عن قيس بن بشر التغلبي، قال أخبرني أبي، - وكان جليسا لأبي الدرداء - قال كان بدمشق رجل من أصحاب النبي صلى الله عليه وسلم يقال له ابن الحنظلية وكان رجلا متوحدا قلما يجالس الناس إنما هو صلاة فإذا فرغ فإنما هو تسبيح وتكبير حتى يأتي أهله فمر بنا ونحن عند أبي الدرداء فقال له أبو الدرداء كلمة تنفعنا ولا تضرك قال بعث رسول الله صلى الله عليه وسلم سرية فقدمت فجاء رجل منهم فجلس في المجلس الذي يجلس فيه رسول الله صلى الله عليه وسلم فقال لرجل إلى جنبه لو رأيتنا حين التقينا نحن والعدو فحمل فلان فطعن فقال خذها مني وأنا الغلام الغفاري كيف ترى في قوله قال ما أراه إلا قد بطل أجره فسمع بذلك آخر فقال ما أرى بذلك بأسا فتنازعا حتى سمع رسول الله صلى الله عليه وسلم فقال ‏\"‏ سبحان الله لا بأس أن يؤجر ويحمد ‏\"‏ ‏.‏ فرأيت أبا الدرداء سر بذلك وجعل يرفع رأسه إليه ويقول أنت سمعت ذلك من رسول الله صلى الله عليه وسلم فيقول نعم ‏.‏ فما زال يعيد عليه حتى إني لأقول ليبركن على ركبتيه ‏.‏ قال فمر بنا يوما آخر فقال له أبو الدرداء كلمة تنفعنا ولا تضرك قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ المنفق على الخيل كالباسط يده بالصدقة لا يقبضها ‏\"‏ ‏.‏ ثم مر بنا يوما آخر فقال له أبو الدرداء كلمة تنفعنا ولا تضرك ‏.‏ قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ نعم الرجل خريم الأسدي لولا طول جمته وإسبال إزاره ‏\"‏ ‏.‏ فبلغ ذلك خريما فعجل فأخذ شفرة فقطع بها جمته إلى أذنيه ورفع إزاره إلى أنصاف ساقيه ‏.‏ ثم مر بنا يوما آخر فقال له أبو الدرداء كلمة تنفعنا ولا تضرك فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنكم قادمون على إخوانكم فأصلحوا رحالكم وأصلحوا لباسكم حتى تكونوا كأنكم شامة في الناس فإن الله لا يحب الفحش ولا التفحش ‏\"‏ ‏.‏ قال أبو داود وكذلك قال أبو نعيم عن هشام قال حتى تكونوا كالشامة في الناس ‏.‏",
      "text_en": " Narrated Qays ibn Bishr at-Taghlibi:                     My father told me that he was a companion of Abu Darda'. There was in Damascus a man from the companions of the Prophet (ﷺ), called Ibn al-Hanzaliyyah. He was a recluse and rarely met the people. He remained engaged in prayer. When he was not praying he was occupied in glorifying Allah and exalting Him until he went to his family. Once he passed us when we were with AbudDarda'.  AbudDarda' said to him: Tell us a word which benefits us and does not harm you.  He said: The Messenger of Allah (ﷺ) sent out a contingent and it came back. One of the men came and sat in the place where the Messenger of Allah (ﷺ) used to sit, and he said to a man beside him: Would that you saw us when we met the enemy and so-and-so attacked and cut through a lance.  He said: Take it from me and I am a boy of the tribe Ghifar. What do you think about his statement?  He replied: I think his reward was lost.  Another man heard it and said: I do not think that there is any harm in it.  They quarrelled until the Messenger of Allah (ﷺ) heard it, and he said: Glory be to Allah! There is no harm if he is rewarded and praised. I saw that AbudDarda' was pleased with it and began to raise his hand to him and say: Did you hear it from the Messenger of Allah (ﷺ)?  He said: Yes. He continued to repeat it to him so often that I thought he was going to kneel down. He said: On another day he again passed us.  AbudDarda' said to him: (Tell us) a word which benefits us and does not harm you.  He said: The Messenger of Allah (ﷺ) said to us: One who spends on (the maintenance of) horses (for jihad) is like the one who spreads his hand to give alms (sadaqah) and does not withhold it. He then passed us on another day.  AbudDarda' said to him: (Tell us) a word which benefits us and does no harm to you.  He said: The Messenger of Allah (ﷺ) said: Khuraym al-Asadi would be a fine man were it not for the length of his hair, which reaches the shoulders, and the way he lets his lower garment hang down. When Khuraym heard that, he hurriedly, took a knife, cut his hair in line with his ears and raised his lower garment half way up his legs. He then passed us on another day.  AbudDarda' said to him: (tell us) a word which benefits us and does not harm you.  He said: I heard the Messenger of Allah (ﷺ) say: You are coming to your brethren; so tidy your mounts and tidy your dress, until you are like a mole among the people. Allah does not like obscene words or deeds, or do intentional committing of obscenity.Abu Dawud said: Similarly, Abu Nu'aim narrated from Hisham. He said: Until you will be like a mole among the people.",
      "chain": [
        "30524",
        "20443",
        "20519"
      ]
    },
    {
      "hadith_no": "4098",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا زهير بن حرب، حدثنا أبو عامر، عن سليمان بن بلال، عن سهيل، عن أبيه، عن أبي هريرة، قال لعن رسول الله صلى الله عليه وسلم الرجل يلبس لبسة المرأة والمرأة تلبس لبسة الرجل ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) cursed the man who dressed like a woman and the woman who dressed like a man.",
      "chain": [
        "30022",
        "20443",
        "20160",
        "13"
      ]
    },
    {
      "hadith_no": "4309",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا القاسم بن أحمد البغدادي، حدثنا أبو عامر، عن زهير بن محمد، عن موسى بن جبير، عن أبي أمامة بن سهل بن حنيف، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ اتركوا الحبشة ما تركوكم فإنه لا يستخرج كنز الكعبة إلا ذو السويقتين من الحبشة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Leave the Abyssinians alone as long as they leave you alone, for it is only the Abyssinian with short legs who will seek to take out the treasure of the Ka'bah.",
      "chain": [
        "20443",
        "20394",
        "21181",
        "405",
        "29"
      ]
    },
    {
      "hadith_no": "4775",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو عامر، حدثنا محمد بن هلال، سمع أباه، يحدث قال قال أبو هريرة وهو يحدثنا كان النبي صلى الله عليه وسلم يجلس معنا في المجلس يحدثنا فإذا قام قمنا قياما حتى نراه قد دخل بعض بيوت أزواجه فحدثنا يوما فقمنا حين قام فنظرنا إلى أعرابي قد أدركه فجبذه بردائه فحمر رقبته قال أبو هريرة وكان رداء خشنا فالتفت فقال له الأعرابي احمل لي على بعيرى هذين فإنك لا تحمل لي من مالك ولا من مال أبيك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا وأستغفر الله لا وأستغفر الله لا وأستغفر الله لا أحمل لك حتى تقيدني من جبذتك التي جبذتني ‏\"‏ ‏.‏ فكل ذلك يقول له الأعرابي والله لا أقيدكها ‏.‏ فذكر الحديث قال ثم دعا رجلا فقال له ‏\"‏ احمل له على بعيريه هذين على بعير شعيرا وعلى الآخر تمرا ‏\"‏ ‏.‏ ثم التفت إلينا فقال ‏\"‏ انصرفوا على بركة الله تعالى ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to sit with us in meetings and talk to us. When he stood up we also used to stand up and see him entering the house of one of his wives. One day he talked to us and we stood up as he stood up and we saw that an Arabi (a nomadic Arab) caught hold of him and gave his cloak a violent tug making his neck red.  AbuHurayrah said: The cloak was coarse. He turned to him and the Arabi said to him: Load these two camels of mine, for you do not give me anything from your property or from your father's property.  The Prophet (ﷺ) said to him: No, I ask Allah's forgiveness; no, I ask Allah's forgiveness; no, I ask Allah's forgiveness. I shall not give you the camel-load until you make amends for the way in which you tugged at me.  Each time the Arabi said to him: I swear by Allah, I shall not do so.  He then mentioned the rest of the tradition. He (the Prophet), then called a man and said to him: Load these two camels of his: one camel with barley and the other with dates. He then turned to us and said: Go on your way with the blessing of Allah.",
      "chain": [
        "30524",
        "20443",
        "12489"
      ]
    },
    {
      "hadith_no": "4833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا زهير بن محمد، قال حدثني موسى بن وردان، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الرجل على دين خليله فلينظر أحدكم من يخالل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: A man follows the religion of his friend; so each one should consider whom he makes his friend.",
      "chain": [
        "30160",
        "20443",
        "30002",
        "20394",
        "13"
      ]
    },
    {
      "hadith_no": "4903",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن صالح البغدادي، حدثنا أبو عامر، - يعني عبد الملك بن عمرو - حدثنا سليمان بن بلال، عن إبراهيم بن أبي أسيد، عن جده، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والحسد فإن الحسد يأكل الحسنات كما تأكل النار الحطب ‏\"‏ ‏.‏ أو قال ‏\"‏ العشب ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Avoid envy, for envy devours good deeds just as fire devours fuel or (he said) \"grass.\"",
      "chain": [
        "30236",
        "20443",
        "20160",
        "13"
      ]
    },
    {
      "hadith_no": "4912",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، وأحمد بن سعيد السرخسي، أن أبا عامر، أخبرهم قال حدثنا محمد بن هلال، قال حدثني أبي، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لمؤمن أن يهجر مؤمنا فوق ثلاث فإن مرت به ثلاث فليلقه فليسلم عليه فإن رد عليه السلام فقد اشتركا في الأجر وإن لم يرد عليه فقد باء بالإثم ‏\"‏ ‏.‏ زاد أحمد ‏\"‏ وخرج المسلم من الهجرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not allowable for a believer to keep from a believer for more than three days. If three days pass, he should meet him and give him a salutation, and if he replies to it they will both have shared in the reward; but if he does not reply he will bear his sin (according to Ahmad's version) and the one who gives the salutation will have come forth from the sin of keeping apart.",
      "chain": [
        "30024",
        "30296",
        "20443",
        "12489",
        "13"
      ]
    },
    {
      "hadith_no": "4995",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عامر، حدثنا إبراهيم بن طهمان، عن علي بن عبد الأعلى، عن أبي النعمان، عن أبي وقاص، عن زيد بن أرقم، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وعد الرجل أخاه - ومن نيته أن يفي له - فلم يف ولم يجئ للميعاد فلا إثم عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Arqam:                     The Prophet (ﷺ) said: When a man makes a promise to his brother with the intention of fulfilling it and does not do so, and does not come at the appointed time, he is guilty of no sin.",
      "chain": [
        "30170",
        "20443",
        "20187",
        "19877",
        "20283",
        "384"
      ]
    },
    {
      "hadith_no": "5064",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عباس العنبري، حدثنا عبد الملك بن عمرو، حدثنا عبد العزيز بن محمد، عن يزيد بن الهاد، عن محمد بن كعب القرظي، عن شبث بن ربعي، عن علي، عليه السلام عن النبي صلى الله عليه وسلم بهذا الخبر قال فيه قال علي فما تركتهن منذ سمعتهن من رسول الله صلى الله عليه وسلم إلا ليلة صفين فإني ذكرتها من آخر الليل فقلتها ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The tradition (No 5045, about Tasbih Fatimah) has been transmitted by Ali to the same effect through a different chain of narrators. This version adds: Ali said: I did not leave them (Tasbih Fatimah) since I heard them from the Messenger of Allah (ﷺ) except on the night of Siffin, for I remembered them towards  the end of the night and then I uttered them.",
      "chain": [
        "30437",
        "20443",
        "20167",
        "11234",
        "11221"
      ]
    },
    {
      "hadith_no": "5090",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا العباس بن عبد العظيم، ومحمد بن المثنى، قالا حدثنا عبد الملك بن عمرو، عن عبد الجليل بن عطية، عن جعفر بن ميمون، قال حدثني عبد الرحمن بن أبي بكرة، أنه قال لأبيه يا أبة إني أسمعك تدعو كل غداة اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا إله إلا أنت تعيدها ثلاثا حين تصبح وثلاثا حين تمسي ‏.‏ فقال إني سمعت رسول الله صلى الله عليه وسلم يدعو بهن فأنا أحب أن أستن بسنته ‏.‏ قال عباس فيه وتقول اللهم إني أعوذ بك من الكفر والفقر اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت تعيدها ثلاثا حين تصبح وثلاثا حين تمسي فتدعو بهن فأحب أن أستن بسنته قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوات المكروب اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله لا إله إلا أنت ‏\"‏ ‏.‏ وبعضهم يزيد على صاحبه ‏.‏",
      "text_en": " Narrated AbuBakrah:                     AbdurRahman ibn AbuBakrah said that he told his father: O my father! I hear you supplicating every morning: \"O Allah! Grant me health in my body. O Allah! Grant me good hearing. O Allah! Grant me good eyesight. There is no god but Thou.\" You repeat them three times in the morning and three times in the evening.  He said: I heard the Messenger of Allah (ﷺ) using these words as a supplication and I like to follow his practice.  The transmitter, Abbas, said in this version: And you say: \"O Allah! I seek refuge in Thee from infidelity and poverty. O Allah! I seek refuge in Thee from punishment in the grave. There is no god but Thee\". You repeat them three times in the morning and three times in the evening, and use them as a supplication. I like to follow his practice.  He said: The Messenger of Allah (ﷺ) said: The supplications to be used by one who is distressed are: \"O Allah! Thy mercy is what I hope for. Do not abandon me to myself for an instant, but put all my affairs in good order for me. There is no god but Thou.\" Some transmitters added more than others.",
      "chain": [
        "30437",
        "30170",
        "20443",
        "24251",
        "18132",
        "11294"
      ]
    },
    {
      "hadith_no": "5118",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو عامر، حدثنا سفيان، عن سماك بن حرب، عن عبد الرحمن بن عبد الله، عن أبيه، قال انتهيت إلى النبي صلى الله عليه وسلم وهو في قبة من أدم فذكر نحوه ‏.‏",
      "text_en": " ‘Abd Allah b. Mas’ud said :                      I went to the prophet (May peace be upon him) when he was in a skin tent. He then mentioned something similar to it.",
      "chain": [
        "30160",
        "20443",
        "20012",
        "10770",
        "20439",
        "11183"
      ]
    },
    {
      "hadith_no": "128",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش قالت كنت أستحاض حيضة كثيرة شديدة فأتيت النبي صلى الله عليه وسلم أستفتيه وأخبره فوجدته في بيت أختي زينب بنت جحش فقلت يا رسول الله إني أستحاض حيضة كثيرة شديدة فما تأمرني فيها قد منعتني الصيام والصلاة قال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فتلجمي ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فاتخذي ثوبا ‏\"‏ ‏.‏ قالت هو أكثر من ذلك إنما أثج ثجا فقال النبي صلى الله عليه وسلم ‏\"‏ سآمرك بأمرين أيهما صنعت أجزأ عنك فإن قويت عليهما فأنت أعلم ‏\"‏ ‏.‏ فقال ‏\"‏ إنما هي ركضة من الشيطان فتحيضي ستة أيام أو سبعة أيام في علم الله ثم اغتسلي فإذا رأيت أنك قد طهرت واستنقأت فصلي أربعا وعشرين ليلة أو ثلاثا وعشرين ليلة وأيامها وصومي وصلي فإن ذلك يجزئك وكذلك فافعلي كما تحيض النساء وكما يطهرن لميقات حيضهن وطهرهن فإن قويت على أن تؤخري الظهر وتعجلي العصر ثم تغتسلين حين تطهرين وتصلين الظهر والعصر جميعا ثم تؤخرين المغرب وتعجلين العشاء ثم تغتسلين وتجمعين بين الصلاتين فافعلي وتغتسلين مع الصبح وتصلين وكذلك فافعلي وصومي إن قويت على ذلك ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وهو أعجب الأمرين إلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه عبيد الله بن عمرو الرقي وابن جريج وشريك عن عبد الله بن محمد بن عقيل عن إبراهيم بن محمد بن طلحة عن عمه عمران عن أمه حمنة إلا أن ابن جريج يقول عمر بن طلحة والصحيح عمران بن طلحة ‏.‏ قال وسألت محمدا عن هذا الحديث فقال هو حديث حسن صحيح ‏.‏ وهكذا قال أحمد بن حنبل هو حديث حسن صحيح ‏.‏ وقال أحمد وإسحاق في المستحاضة إذا كانت تعرف حيضها بإقبال الدم وإدباره وإقباله أن يكون أسود ‏.‏ وإدباره أن يتغير إلى الصفرة فالحكم لها على حديث فاطمة بنت أبي حبيش وإن كانت المستحاضة لها أيام معروفة قبل أن تستحاض فإنها تدع الصلاة أيام أقرائها ثم تغتسل وتتوضأ لكل صلاة وتصلي وإذا استمر بها الدم ولم يكن لها أيام معروفة ولم تعرف الحيض بإقبال الدم وإدباره فالحكم لها على حديث حمنة بنت جحش ‏.‏ وكذلك قال أبو عبيد ‏.‏ وقال الشافعي المستحاضة إذا استمر بها الدم في أول ما رأت فدامت على ذلك فإنها تدع الصلاة ما بينها وبين خمسة عشر يوما فإذا طهرت في خمسة عشر يوما أو قبل ذلك فإنها أيام حيض فإذا رأت الدم أكثر من خمسة عشر يوما فإنها تقضي صلاة أربعة عشر يوما ثم تدع الصلاة بعد ذلك أقل ما تحيض النساء وهو يوم وليلة ‏.‏ قال أبو عيسى واختلف أهل العلم في أقل الحيض وأكثره فقال بعض أهل العلم أقل الحيض ثلاثة وأكثره عشرة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يأخذ ابن المبارك وروي عنه خلاف هذا ‏.‏ وقال بعض أهل العلم منهم عطاء بن أبي رباح أقل الحيض يوم وليلة وأكثره خمسة عشر يوما ‏.‏ وهو قول مالك والأوزاعي والشافعي وأحمد وإسحاق وأبي عبيد ‏.‏",
      "text_en": " Hamnah bint Jahsh narrated:                     \"I had a case of blood flow that was severe and excessive. So I went to the Prophet to inform him and ask him about it. I found him in the house of my sister Zainab bint Jahsh. I said, 'O Messenger of Allah! I suffer from a case of severe and excessive blood flow. So what do you order me to do for it, and does this prevent me from fasting and performing Salat?' He said: 'Tie a cotton rag around yourself and the bIood will go away.' I said, 'It is more than that.' He said: 'Make it tight.' I said, 'It is more than that.' He said: 'Then use a cloth (to bind it).' I said, it is more than that. It flows too much.' So the Prophet said: 'I will order you to do one of two things, which ever of them you do, it will be acceptable for you. You should know which of them you are able to do.' Then he said: 'This is only a blow from Shaitan. Menstruate for six or seven days, which Allah knows, then perform Ghusl. When you see that you have become pure and clean, then perform Salat for twenty-three or twenty-four nights and their days. Perform Salat and fast, and that will be acceptable for you. So do this (if you can) just as (other) women who menstruate and become pure during their periods of menstruation and purity. If (not, and) you are able to delay Zuhr and hasten Asr then perform Ghusl when you have become pure, and pray Zuhr and Asr together. Then delay Maghrib and hasten Isha, then perform Ghusl and combine the two prayers. So do this (if you are able). Then perform Ghusl with the dawn and pray. Do this, and fast if you are able to do so.' Then Allah's Messenger said: 'That is what is preferable to me of the two.'\"",
      "chain": [
        "30160",
        "20443",
        "20394",
        "12246",
        "11827",
        "578",
        "72"
      ]
    },
    {
      "hadith_no": "260",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا أبو عامر العقدي، حدثنا فليح بن سليمان، حدثنا عباس بن سهل بن سعد، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم ركع فوضع يديه على ركبتيه كأنه قابض عليهما ووتر يديه فنحاهما عن جنبيه ‏.‏ قال وفي الباب عن أنس ‏.‏ قال أبو عيسى حديث أبي حميد حديث حسن صحيح ‏.‏ وهو الذي اختاره أهل العلم أن يجافي الرجل يديه عن جنبيه في الركوع والسجود ‏.‏",
      "text_en": " Abbas bin Sahl [bin Sa'd] narrated:                     \"Abu Humaid, Abu Usaid, Sahl bin Sa'd, and Muhammad bin Maslamah were once together and they were mentioning the Salat of Allah's Messenger. Abu Humaid said: 'I am the most knowledgeable among you of the Salat of Allah's Messenger: Allah's Messenger would bow and place his hands on his knees as if he was grasping them, and he would draw his forearms to hold them away from his sides.'\"",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا أبو عامر العقدي، حدثنا فليح بن سليمان، حدثني عباس بن سهل، عن أبي حميد الساعدي، أن النبي صلى الله عليه وسلم كان إذا سجد أمكن أنفه وجبهته من الأرض ونحى يديه عن جنبيه ووضع كفيه حذو منكبيه ‏.‏ قال وفي الباب عن ابن عباس ووائل بن حجر وأبي سعيد ‏.‏ قال أبو عيسى حديث أبي حميد حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم أن يسجد الرجل على جبهته وأنفه فإن سجد على جبهته دون أنفه فقد قال قوم من أهل العلم يجزئه ‏.‏ وقال غيرهم لا يجزئه حتى يسجد على الجبهة والأنف ‏.‏",
      "text_en": " Abu Humaid As-Sa'idi narrated:                     \"When the Prophet would prostrate, he placed his nose and his forehead on the ground, and he held his forearms away from his sides, and he placed his hands parallel to his shoulders.\"",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697",
        "1457"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، محمد بن بشار حدثنا أبو عامر العقدي، حدثنا فليح بن سليمان المدني، حدثني عباس بن سهل الساعدي، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم جلس - يعني - للتشهد فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ووضع كفه اليمنى على ركبته اليمنى وكفه اليسرى على ركبته اليسرى وأشار بأصبعه يعني السبابة ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وبه يقول بعض أهل العلم وهو قول الشافعي وأحمد وإسحاق قالوا يقعد في التشهد الآخر على وركه واحتجوا بحديث أبي حميد وقالوا يقعد في التشهد الأول على رجله اليسرى وينصب اليمنى ‏.‏",
      "text_en": " Abbas bin SAhl [bin Sa'd] narrated:                     \"Abu Humaid, Abu Usaid, Sahl bin Sa'd, and Muhammad bin Maslamah were once together and they were mentioning the Salat of Allah's Messenger. Abu Humaid said: \"I am the most knowledgeable among you of the Salat of Allah's Messenger: Indeed Allah's Messenger sat - meaning for Tashah-hud - he spread his left foot, and made the top of his right (foot) face the Qiblah, and he placed his right hand on his right knee, and his left hand on his left knee, and indicated with his finger - meaning the index finge.'\"",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا سفيان، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، قال كان النبي صلى الله عليه وسلم يصلي قبل الظهر أربعا وبعدها ركعتين ‏.‏ قال وفي الباب عن عائشة وأم حبيبة ‏.‏ قال أبو عيسى حديث علي حديث حسن ‏.‏ قال أبو بكر العطار قال علي بن عبد الله عن يحيى بن سعيد عن سفيان قال كنا نعرف فضل حديث عاصم بن ضمرة على حديث الحارث ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم يختارون أن يصلي الرجل قبل الظهر أربع ركعات ‏.‏ وهو قول سفيان الثوري وابن المبارك وإسحاق وأهل الكوفة ‏.‏ وقال بعض أهل العلم صلاة الليل والنهار مثنى مثنى يرون الفصل بين كل ركعتين ‏.‏ وبه يقول الشافعي وأحمد ‏.‏",
      "text_en": " Ali narrated:                     \"The Prophet (S) would pray four Rak'ah before Az-Zuhr and two Rak'ah after it.\"",
      "chain": [
        "30160",
        "20443",
        "20012",
        "11049",
        "19871",
        "5"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، محمد بن بشار حدثنا أبو عامر، هو العقدي عبد الملك بن عمرو حدثنا سفيان، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، قال كان النبي صلى الله عليه وسلم يصلي قبل العصر أربع ركعات يفصل بينهن بالتسليم على الملائكة المقربين ومن تبعهم من المسلمين والمؤمنين ‏.‏ قال أبو عيسى وفي الباب عن ابن عمر وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث علي حديث حسن ‏.‏ واختار إسحاق بن إبراهيم أن لا يفصل في الأربع قبل العصر واحتج بهذا الحديث ‏.‏ وقال إسحاق ومعنى أنه يفصل بينهن بالتسليم يعني التشهد ‏.‏ ورأى الشافعي وأحمد صلاة الليل والنهار مثنى مثنى يختاران الفصل في الأربع قبل العصر ‏.‏",
      "text_en": " Ali narrated:                     \"Allah's Messenger (S) would pray four Rak'ah before Al-Asr separating between them with At-Taslim upon the angels that are close (to Allah) and those who follow them among the Muslims and the believers.\"",
      "chain": [
        "30160",
        "20443",
        "20012",
        "11049",
        "19871",
        "5"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا أبو عامر العقدي، حدثنا كثير بن عبد الله بن عمرو بن عوف المزني، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجمعة ساعة لا يسأل الله العبد فيها شيئا إلا آتاه الله إياه ‏\"‏ ‏.‏ قالوا يا رسول الله أية ساعة هي قال ‏\"‏ حين تقام الصلاة إلى الانصراف منها ‏\"‏ ‏.‏ قال وفي الباب عن أبي موسى وأبي ذر وسلمان وعبد الله بن سلام وأبي لبابة وسعد بن عبادة وأبي أمامة ‏.‏ قال أبو عيسى حديث عمرو بن عوف حديث حسن غريب ‏.‏",
      "text_en": " Kathir bin Abdullah bin Amr bin Awf Al-Muzani narrated from his father, from his grandfather, that :                     the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"",
      "chain": [
        "30249",
        "20443"
      ]
    },
    {
      "hadith_no": "765",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، عن هشام بن سعد، عن أبي حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة لبابا يدعى الريان يدعى له الصائمون فمن كان من الصائمين دخله ومن دخله لم يظمأ أبدا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Sahl bin Sa'd narrated that:                     The Prophet said: \"There is a gate in Paradise called Ar-Raiyyan, those who fast shall be invited into it, and whoever was among those who fasted, then he will enter it; and whoever enters it, he will never thirst again.\"",
      "chain": [
        "30160",
        "20443",
        "20519",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، وأبو عامر العقدي قالا حدثنا هشام بن سعد، عن سعيد بن أبي هلال، عن ربيعة بن سيف، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يموت يوم الجمعة أو ليلة الجمعة إلا وقاه الله فتنة القبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بمتصل ‏.‏ ربيعة بن سيف إنما يروي عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو ولا نعرف لربيعة بن سيف سماعا من عبد الله بن عمرو ‏.‏",
      "text_en": " Abdullah bin Amr narrated that:                     The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"",
      "chain": [
        "30160",
        "20033",
        "20443",
        "20519",
        "11169",
        "18277",
        "29"
      ]
    },
    {
      "hadith_no": "1252",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا قرة بن خالد، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من اشترى مصراة فهو بالخيار ثلاثة أيام فإن ردها رد معها صاعا من طعام لا سمراء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أصحابنا منهم الشافعي وأحمد وإسحاق ‏.‏ ومعنى قوله ‏\"‏ لا سمراء ‏\"‏ ‏.‏ يعني لا بر ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"Whoever purchases an animal that has not been milked, then he retains the option for three days. If he returns it, then he is to return with it a Sa' of food, not Samra' \"[Abu 'Eisa said:] The meaning of \"Not Samra'\" is \"not wheat.\"This Hadith is Hasan Sahih. This Hadith is acted upon according to our companions, among them Ash-Shafi'i, Ahmad, and Ishaq.",
      "chain": [
        "30160",
        "20443",
        "11301",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، وأبو عامر العقدي عن ابن أبي ذئب، عن مخلد بن خفاف، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قضى أن الخراج بالضمان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي هذا الحديث من غير هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Messenger of Allah (ﷺ) judged: \"The produce is for the responsible one.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This Hadith has been reported through routes other than this, and this acted upon according to the people of knowledge.",
      "chain": [
        "30170",
        "20262",
        "20443",
        "20177",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو عامر العقدي، حدثنا ابن أبي ذئب، عن خاله الحارث بن عبد الرحمن، عن أبي سلمة، عن عبد الله بن عمرو، قال لعن رسول الله صلى الله عليه وسلم الراشي والمرتشي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated:                      \"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe.\"",
      "chain": [
        "20443",
        "20177",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1352",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو عامر العقدي، حدثنا كثير بن عبد الله بن عمرو بن عوف المزني، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الصلح جائز بين المسلمين إلا صلحا حرم حلالا أو أحل حراما والمسلمون على شروطهم إلا شرطا حرم حلالا أو أحل حراما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Kathir bin 'Amr bin 'Awf Al-Muzani narrated from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                      \"Reconciliation is allowed among the Muslims, except for reconciliation that makes the lawful unlawful, or the unlawful lawful. And the Muslims will be held to their conditions, except the conditions that make the lawful unlawful, or the unlawful lawful.\"",
      "chain": [
        "30115",
        "20443"
      ]
    },
    {
      "hadith_no": "1419",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا عبد العزيز بن المطلب، عن عبد الله بن الحسن، عن إبراهيم بن محمد بن طلحة، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏ قال وفي الباب عن علي وسعيد بن زيد وأبي هريرة وابن عمر وابن عباس وجابر ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن وقد روي عنه من غير وجه ‏.‏ وقد رخص بعض أهل العلم للرجل أن يقاتل عن نفسه وماله ‏.‏ وقال ابن المبارك يقاتل عن ماله ولو درهمين ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Prophet (ﷺ) said: \"Whoever is killed over his wealth, then he is martyr.\"",
      "chain": [
        "30160",
        "20443",
        "20511",
        "19809",
        "11827",
        "29"
      ]
    },
    {
      "hadith_no": "1616",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن رافع، حدثنا أبو عامر العقدي، عن حماد بن سلمة، عن حميد، عن أنس بن مالك، أن النبي صلى الله عليه وسلم كان يعجبه إذا خرج لحاجة أن يسمع يا راشد يا نجيح ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That the Prophet (ﷺ) used to like it when he set out upon an affair if he heard: \"O directed one, O successful one.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.",
      "chain": [
        "30375",
        "20443",
        "20021",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2151",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، عن كثير بن زيد، عن سالم، عن ابن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يكون المؤمن لعانا ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن مسعود ‏.‏ وهذا حديث حسن غريب ‏.‏ وروى بعضهم بهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينبغي للمؤمن أن يكون لعانا ‏\"‏ ‏.‏ وهذا الحديث مفسر ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah said:                     \"The believer is not one who curses others.\"",
      "chain": [
        "30160",
        "20443",
        "22171",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2171",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا فليح بن سليمان، عن أيوب بن عبد الرحمن، عن يعقوب، عن أم المنذر الأنصارية، في حديثه قالت دخل علينا رسول الله صلى الله عليه وسلم فذكر نحو حديث يونس بن محمد إلا أنه قال ‏\"‏ أنفع لك ‏\"‏ ‏.‏ وقال محمد بن بشار وحدثنيه أيوب بن عبد الرحمن ‏.‏ هذا حديث جيد غريب ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20443",
        "20547",
        "20169",
        "20184"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا إبراهيم بن إسماعيل بن أبي حبيبة، عن داود بن حصين، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يعلمهم من الحمى ومن الأوجاع كلها أن يقول ‏\"‏ بسم الله الكبير أعوذ بالله العظيم من شر كل عرق نعار ومن شر حر النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث إبراهيم بن إسماعيل بن أبي حبيبة ‏.‏ وإبراهيم يضعف في الحديث ‏.‏ ويروى ‏\"‏ عرق يعار ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas narrated:                     \"For fever, and all pains, the Prophet (S.A.W) would teach them to say: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (In the name of Allah the great, I seek refuge with Allah he magnificent of the evil of every gushing vein, and from the evil of the heat of the Fire)\"",
      "chain": [
        "30160",
        "20443",
        "22000",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2304",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، عن محمد بن أبي حميد، عن إسماعيل بن محمد بن سعد بن أبي وقاص، عن أبيه، عن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سعادة ابن آدم رضاه بما قضى الله له ومن شقاوة ابن آدم تركه استخارة الله ومن شقاوة ابن آدم سخطه بما قضى الله له ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث محمد بن أبي حميد ‏.‏ ويقال له أيضا حماد بن أبي حميد وهو أبو إبراهيم المدني وليس هو بالقوي عند أهل الحديث ‏.‏",
      "text_en": " Sa'd narrated that the Messenger of Allah (s.a.w) said:                     'From (the signs of) the son of Adam's prosperity, is his satisfaction with what Allah decreed for him, and from the son of Adam's misery is his avoiding to request guidance from Allah, and from the son of Adam's misery is his anger with what Allah decreed for him.\"",
      "chain": [
        "30160",
        "20443",
        "9"
      ]
    },
    {
      "hadith_no": "2264",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا محمد بن أبي حميد، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخيار أمرائكم وشرارهم خيارهم الذين تحبونهم ويحبونكم وتدعون لهم ويدعون لكم وشرار أمرائكم الذين تبغضونهم ويبغضونكم وتلعنونهم ويلعنونكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث محمد بن أبي حميد ‏.‏ ومحمد يضعف من قبل حفظه ‏.‏",
      "text_en": " 'Umar bin Al-Khattab narrated that the Prophet(s.a.w) said:                     \"Shall I not inform you of the best of your leaders and the worst of them: The best of them are those whom you love and they love you, you supplicate for them, and they supplicate for you. And the evilest of your leaders are those who hate you, and you hate them, and they curse you and you curse them.\"",
      "chain": [
        "30160",
        "20443",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا زهير بن محمد، حدثني موسى بن وردان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الرجل على دين خليله فلينظر أحدكم من يخالل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"A man is upon the religion of his friend, so let one of you look at whom he befriends.\"",
      "chain": [
        "30160",
        "20443",
        "20547",
        "20394",
        "13"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا إبراهيم بن طهمان، عن علي بن عبد الأعلى، عن أبي النعمان، عن أبي وقاص، عن زيد بن أرقم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وعد الرجل وينوي أن يفي به فلم يف به فلا جناح عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بالقوي ‏.‏ علي بن عبد الأعلى ثقة ولا يعرف أبو النعمان ولا أبو وقاص وهما مجهولان ‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     that the Messenger of Allah (ﷺ) said: \"Whenever a man makes a promise and he intends to fulfill it, but he does not fulfill it, then there is no burden upon him.\"",
      "chain": [
        "30160",
        "20443",
        "20187",
        "19877",
        "20283",
        "384"
      ]
    },
    {
      "hadith_no": "3029",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا خالد بن إلياس، ويقال ابن إياس، عن صالح بن أبي حسان، قال سمعت سعيد بن المسيب، يقول إن الله طيب يحب الطيب نظيف يحب النظافة كريم يحب الكرم جواد يحب الجود فنظفوا أراه قال أفنيتكم ولا تشبهوا باليهود ‏.‏ قال فذكرت ذلك لمهاجر بن مسمار فقال حدثنيه عامر بن سعد بن أبي وقاص عن أبيه عن النبي صلى الله عليه وسلم مثله إلا أنه قال نظفوا أفنيتكم ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وخالد بن إلياس يضعف ‏.‏",
      "text_en": " Narrated Salih bin Abi Hassan:                     \"I heard Sa'eed bin Musayyab saying: 'Indeed Allah is Tayyib (good) and he loves Tayyib (what is good), and He is Nazif (clean) and He loves cleanliness, He is Karim (kind) and He loves kindness, He is Jawad (generous) and He loves generosity. So clean' - I think he said - 'your courtyards, and do not resemble the Jews.'\" He said: \"I mentioned that to Muhajir bin Mismar, and he said: \"Amir bin Sa'd [bin Abi Waqqas] narrated it to me from his father from the Prophet (ﷺ), similarly, except that he did not say: \"Clean your courtyards.\"",
      "chain": [
        "30160",
        "20443",
        "22048",
        "11002"
      ]
    },
    {
      "hadith_no": "3261",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا أبو عامر، وهو الخزاز ويزيد بن إبراهيم كلاهما عن ابن أبي مليكة، قال يزيد عن ابن أبي مليكة، عن القاسم بن محمد، عن عائشة، ولم يذكر أبو عامر القاسم قالت سألت رسول الله صلى الله عليه وسلم عن قوله ‏:‏ ‏(‏ فأما الذين في قلوبهم زيع فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله ‏)‏ قال ‏\"‏ فإذا رأيتيهم فاعرفيهم ‏\"‏ ‏.‏ وقال يزيد فإذا رأيتموهم فاعرفوهم ‏.‏ قالها مرتين أو ثلاثا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"I asked the Messenger of Allah (ﷺ) about Allah's saying: So, as for those in whose hearts there is a deviation, they follow that which is not entirely clear thereof, seeking Al-Fitnah and seeking its Ta'wil (3:7). He said: 'When you see them, be aware of them.'\" Yazid (one of the narrators in the chain) said: \"When you see them, be aware of them' - she said it two or three times.\"",
      "chain": [
        "30160",
        "20547",
        "20443",
        "11090",
        "20472",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3397",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بندار، محمد بن بشار حدثنا أبو عامر العقدي، هو عبد الملك بن عمرو حدثنا سليمان بن سفيان، عن عبد الله بن دينار، عن ابن عمر، عن عمر بن الخطاب، قال لما نزلت هذه الآية ‏:‏ ‏(‏ منهم شقي وسعيد ‏)‏ سألت رسول الله صلى الله عليه وسلم فقلت يا نبي الله فعلى ما نعمل على شيء قد فرغ منه أو على شيء لم يفرغ منه قال ‏\"‏ بل على شيء قد فرغ منه وجرت به الأقلام يا عمر ولكن كل ميسر لما خلق له ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث عبد الملك بن عمرو ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that 'Umar bin Al-Khattab said: \"When this Ayah was revealed: Some among them will be wretches and (others) blessed (11:105). I asked the Messenger of Allah (ﷺ) saying: 'O Prophet of Allah! Based upon what are we then working; something that has already finished or something that has not yet happened?' He said: 'Rather something that has happened, and the Pens have already passed over it O 'Umar! But for everyone, what he has been created for is made easy.'\"",
      "chain": [
        "30160",
        "20443",
        "11183",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "3416",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا النضر بن شميل، ووهب بن جرير، وأبو عامر العقدي وعبد الصمد بن عبد الوارث قالوا حدثنا هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلمة، حدثني ربيعة بن كعب الأسلمي، قال كنت أبيت عند باب النبي صلى الله عليه وسلم فأعطيه وضوءه فأسمعه الهوي من الليل يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ وأسمعه الهوي من الليل يقول ‏\"‏ الحمد لله رب العالمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Rabi’ah bin Ka’b Al-Aslami said:                     “I used to spend the night at the door of the Prophet, so that I may give him his water for Wudu, and I would hear him, for a long period of the night, saying: ‘Allah hears the one who praise Him (Sami Allahu Liman Hamidah).’ And I would hear him, for a long period saying: ‘All praise is due to Allah, Lord of the all that exists. (Al-Hamdullilahi Rabbil-Alamin).’”",
      "chain": [
        "30313",
        "20291",
        "20298",
        "20443",
        "20295",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "hadith_no": "3451",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا سليمان بن سفيان المدني، حدثني بلال بن يحيى بن طلحة بن عبيد الله، عن أبيه، عن جده، طلحة بن عبيد الله أن النبي صلى الله عليه وسلم كان إذا رأى الهلال قال ‏\"‏ اللهم أهلله علينا باليمن والإيمان والسلامة والإسلام ربي وربك الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Bilal bin Yahya bin Talhah bin Ubaidullah narrated :                     from his father, from his grandfather Talhah bin Ubaidullah that when the Prophet would see a crescent moon, he would say: “O Allah, bring it over us with blessing and faith, and security and Islam. My Lord and your Lord is Allah (Allahumma Ahlilhu Alaina Bil-Wal-Islam, Rabbi Wa Rabuk Allah).”",
      "chain": [
        "30160",
        "20443",
        "22032",
        "6"
      ]
    },
    {
      "hadith_no": "3484",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا أبو مصعب المدني، عن عمرو بن أبي عمرو، مولى المطلب عن أنس بن مالك، رضى الله عنه قال كثيرا ما كنت أسمع النبي صلى الله عليه وسلم يدعو بهؤلاء الكلمات ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " Anas bin Mallik [may Allah be pleased with him] narrates, saying:                     “I used to often hear the Prophet supplicating with these words: ‘O Allah, I seek refuge in You from sadness, grief, helplessness, laziness, being stingy, overwhelming debt, and the overpowering of men (Allahumma Inni A’udhu Bika Minal-Hammi Wal-Hazani Wal-Ajzi Wal-Kasali Wal-Bukhli Wa Dala’id=Dain Wa Qahrir-Rijal).’”",
      "chain": [
        "30160",
        "20443",
        "11209",
        "19"
      ]
    },
    {
      "hadith_no": "3546",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، وزياد بن أيوب، قالا حدثنا أبو عامر العقدي، عن سليمان بن بلال، عن عمارة بن غزية، عن عبد الله بن علي بن حسين بن علي بن أبي طالب، عن أبيه، عن حسين بن علي بن أبي طالب، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البخيل الذي من ذكرت عنده فلم يصل على ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that the Messenger of Allah said:                     “The stingy person is the one before whom I am mentioned, and he does not send Salat upon me.”",
      "chain": [
        "30221",
        "30249",
        "20443",
        "20160",
        "11894",
        "6405",
        "20315",
        "5"
      ]
    },
    {
      "hadith_no": "3558",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير، وهو ابن محمد عن عبد الله بن محمد بن عقيل، أن معاذ بن رفاعة، أخبره عن أبيه، قال قام أبو بكر الصديق على المنبر ثم بكى فقال قام رسول الله صلى الله عليه وسلم عام الأول على المنبر ثم بكى فقال ‏\"‏ سلوا الله العفو والعافية فإن أحدا لم يعط بعد اليقين خيرا من العافية ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه عن أبي بكر رضى الله عنه ‏.‏",
      "text_en": " Mu’adh bin Rifa’ah narrated from his father, that he said:                     “Abu Bakr stood upon the Minbar, then wept, and said: ‘The Messenger of Allah stood upon the Minbar the first year (of Hijrah), then wept, and said: “Ask Allah for pardon and Al-Afiyah, for verily, none has been given anything better than Al-Afiyah.’”",
      "chain": [
        "30160",
        "20443",
        "20321",
        "12246",
        "11554",
        "323"
      ]
    },
    {
      "hadith_no": "3972",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن الطفيل بن أبى بن كعب، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثلي في النبيين كمثل رجل بنى دارا فأحسنها وأكملها وأجملها وترك منها موضع لبنة فجعل الناس يطوفون بالبناء ويعجبون منه ويقولون لو تم موضع تلك اللبنة وأنا في النبيين موضع تلك اللبنة ‏\"‏ ‏.‏",
      "text_en": " Narrated At-Tufail bin Ubayy bin Ka'b:                     from his father that the Messenger of Allah (ﷺ) said: \"The parable of me and the Prophets is that of a man who built a house, and he built it well, completing it, and beautifying it, but he left a space for one brick. So the people began going around the house amazed at it, saying \"If only the space for that brick was filled.' And I am, with regards to the Prophets, in the position of that brick.\"And with this chain, from the Prophet (ﷺ) that he said: \"Upon the Day of Judgement I will be the leader of the Prophets and their spokesman, and the bearer of their intercession, without bragging.\"",
      "chain": [
        "30160",
        "20443",
        "20394",
        "12246",
        "18938"
      ]
    },
    {
      "hadith_no": "4045",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن رافع، قالا حدثنا أبو عامر العقدي، حدثنا خارجة بن عبد الله الأنصاري، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم أعز الإسلام بأحب هذين الرجلين إليك بأبي جهل أو بعمر بن الخطاب ‏\"‏ ‏.‏ قال وكان أحبهما إليه عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث ابن عمر ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"O Allah! Honor Islam through the most dear of these two men to you: Through Abu Jahl or through 'Umar bin Al-Khattab.\" He said: \"And the most dear of them to Him was 'Umar.\"",
      "chain": [
        "30160",
        "30375",
        "20443",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4046",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا خارجة بن عبد الله، هو الأنصاري عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله جعل الحق على لسان عمر وقلبه ‏\"‏ ‏.‏ وقال ابن عمر ما نزل بالناس أمر قط فقالوا فيه وقال فيه عمر أو قال ابن الخطاب فيه شك خارجة إلا نزل فيه القرآن على نحو ما قال عمر ‏.‏ قال أبو عيسى وفي الباب عن الفضل بن العباس وأبي ذر وأبي هريرة وهذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وخارجة بن عبد الله الأنصاري هو ابن سليمان بن زيد بن ثابت وهو ثقة ‏.‏",
      "text_en": " Narrated Nafi':                     from Ibn 'Umar, that the Messenger of Allah (ﷺ) said: \"Indeed Allah has put the truth upon the tongue and in the heard of 'Umar.\" He said: \"And Ibn 'Umar said: 'No affair occurred among the people, except that they said something about it, and 'Umar said something about it'\" or he said - \"Ibn Al-Khattab\" - Kharijah (one of the narrators) had a doubt about it - \"except that the Qur'an was revealed in line with what 'Umar had said.\"",
      "chain": [
        "30160",
        "20443",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زمعة بن صالح، عن سلمة بن وهرام، عن عكرمة، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم حامل الحسن بن علي على عاتقه فقال رجل نعم المركب ركبت يا غلام ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ونعم الراكب هو ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ وزمعة بن صالح قد ضعفه بعض أهل الحديث من قبل حفظه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) was carrying Al-Hasan bin 'Ali upon his shoulder, so a man said: \"What an excellent mount you are riding, O child.\" So the Prophet (ﷺ) said: \"And what an excellent rider he is.\"",
      "chain": [
        "30160",
        "20443",
        "10636",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4273",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، عن زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن الطفيل بن أبى بن كعب، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا الهجرة لكنت امرأ من الأنصار ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     Ubayy bin Ka'bthat the Messenger of Allah (ﷺ) said: \"If it were not for the Hijrah, I would be a man from the Ansar.\"",
      "chain": [
        "30160",
        "20443",
        "20394",
        "12246",
        "18938"
      ]
    },
    {
      "hadith_no": "4336",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا هشام بن سعد، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لينتهين أقوام يفتخرون بآبائهم الذين ماتوا إنما هم فحم جهنم أو ليكونن أهون على الله من الجعل الذي يدهده الخراء بأنفه إن الله قد أذهب عنكم عبية الجاهلية إنما هو مؤمن تقي وفاجر شقي الناس كلهم بنو آدم وآدم خلق من تراب ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وابن عباس ‏.‏ قال وهذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"People should stop boasting about their fathers who have died, while they are but coals of Hell, or they will be more humiliated with Allah than the dung beetle who rolls dung with his nose. Indeed Allah removed Jahiliyyah from you, and its boasting about lineage. [Indeed a person is either] a pious believer, or a miserable sinner. And people are all the children of Adam, and Adam was [created] from dust.\"",
      "chain": [
        "30160",
        "20443",
        "20519",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الملك بن عمرو، قال حدثنا عبد العزيز بن مسلم، - وكان من العابدين - عن مطرف بن طريف، عن خالد بن أبي نوف، عن سليط، عن ابن أبي سعيد الخدري، عن أبيه، قال مررت بالنبي صلى الله عليه وسلم وهو يتوضأ من بئر بضاعة فقلت أتتوضأ منها وهي يطرح فيها ما يكره من النتن فقال ‏\"‏ الماء لا ينجسه شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abi Sa'eed Al-Khudri that his father said:                      \"I passed by the Prophet (ﷺ) when he was performing Wudu' from the well of Buda'ah. I said: 'Are you performing Wudu' from it when garbage is thrown into it?' He said: 'Water is not made impure by anything.'\"",
      "chain": [
        "30437",
        "20443",
        "20253",
        "11395",
        "18252"
      ]
    },
    {
      "hadith_no": "690",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر، حدثنا شعبة، عن عمرو بن عامر الأنصاري، عن أنس بن مالك، قال كان المؤذن إذا أذن قام ناس من أصحاب النبي صلى الله عليه وسلم فيبتدرون السواري يصلون حتى يخرج النبي صلى الله عليه وسلم وهم كذلك ويصلون قبل المغرب ولم يكن بين الأذان والإقامة شىء ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"When the Mu'adhdhin called the Adhan, some of the Companions of the Prophet (ﷺ) would get up and rush to the pillars (in the Masjid) and pray until the Prophet (ﷺ) came out and they were like that. They would pray before Maghrib and there was nothing between the Adhan and Iqamah.\"",
      "chain": [
        "30123",
        "20443",
        "20020",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا سليمان بن عبيد الله الغيلاني، - بصري - قال حدثنا أبو عامر، قال حدثنا سليمان، عن ربيعة، عن عبد الملك بن سعيد، قال سمعت أبا حميد، وأبا، أسيد يقولان قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخل أحدكم المسجد فليقل اللهم افتح لي أبواب رحمتك وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdul-Malik bin Sa'eed said:                      \"I heard Abu Humaid and Abu Usaid say: 'The Messenger of Allah (ﷺ) said: \"When any one of you enters the Masjid, let him say: 'Allahumma aftahli abwaba rahmatik (O Allah, open to me the gates of your mercy). And when he leaves let him say: Allahumma inni as'aluka min fadlik (O Allah, I ask You of Your bounty).'\"",
      "chain": [
        "20443",
        "20160",
        "11162"
      ]
    },
    {
      "hadith_no": "1317",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر العقدي، قال حدثنا عبد الله بن جعفر المخرمي، عن إسماعيل بن محمد بن سعد، عن عامر بن سعد، عن سعد، قال كنت أرى رسول الله صلى الله عليه وسلم يسلم عن يمينه وعن يساره حتى يرى بياض خده ‏.‏ قال أبو عبد الرحمن عبد الله بن جعفر هذا ليس به بأس وعبد الله بن جعفر بن نجيح والد علي بن المديني متروك الحديث ‏.‏",
      "text_en": " It was narrated that Sa'd said:                     \"I used to see the Messenger of Allah (ﷺ) saying the taslim to his right and to his left until the whiteness of his cheek could be seen.\"",
      "chain": [
        "30123",
        "20443",
        "20505",
        "11500",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "2008",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو عامر، عن عبد الله بن جعفر، عن إسماعيل بن محمد، عن عامر بن سعد، ‏:‏ أن سعدا، لما حضرته الوفاة قال ‏:‏ الحدوا لي لحدا، وانصبوا على نصبا كما فعل برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Amir bin Sa'd that when Sa'd was dying he said:                     \"Make a niche for me in the side of the grave and set up (bricks) over me as was done for the Messenger of Allah.\"",
      "chain": [
        "30524",
        "20443",
        "108",
        "10554"
      ]
    },
    {
      "hadith_no": "2091",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عامر العقدي، قال حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال نهينا في القرآن أن نسأل النبي صلى الله عليه وسلم عن شىء فكان يعجبنا أن يجيء الرجل العاقل من أهل البادية فيسأله فجاء رجل من أهل البادية فقال يا محمد أتانا رسولك فأخبرنا أنك تزعم أن الله عز وجل أرسلك قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فمن خلق السماء قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فمن خلق الأرض قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فمن نصب فيها الجبال قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فمن جعل فيها المنافع قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فبالذي خلق السماء والأرض ونصب فيها الجبال وجعل فيها المنافع آلله أرسلك قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا خمس صلوات في كل يوم وليلة قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا زكاة أموالنا قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا صوم شهر رمضان في كل سنة ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا الحج من استطاع إليه سبيلا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فوالذي بعثك بالحق لا أزيدن عليهن شيئا ولا أنقص ‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ لئن صدق ليدخلن الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"We were forbidden in the Quran to ask the Prophet about anything not imperative, so we liked it when a wise man from among the people of the desert came and asked him. A man from among the desert people came and said: 'O Muhammad,  your messenger came to us and told us that you say that Allah, the Mighty and Sublime, has sent you.' He said: 'He spoke the trought.\" He said: \"Who created the heavens?' He said: Allah. He said: 'Who created the Earth? He said: Allah. He said: 'Who set up the mountains in it?' He said: 'Allah.' He said: Who created beneficial things in them?' He said; 'Allah.' He said: 'By the One Who created the heavens and the Earth, and set up the mountains therein, and created beneficial things in them has Allah sent you?' He said: 'Yes.' He said; 'Your messenger said that we have to offer five prayers each day and night.' He said: 'He spoke the truth.' He said: 'By the One Who sent you, has Allah commanded you to do this?' he said: 'Yes.' He said: 'Your messenger said that we have to pay Zakah on our wealth.' He said: 'He spoke the truth.' He said: 'By the One Who sent you, has Allah commanded you to do this?' He said: 'Yes.' He said; 'Your messenger said that we have to fast the month of Ramadan each year.' He said: 'He spoke the truth . He said: 'By the One Who sent You, has Allah commanded you to do this?' He said: 'yes .' He said: 'Your messenger said that we have to perform Hajj, those who can afford it.' He said: 'He spoke the truth.' He said: 'By the One Who sent you, has Allah commanded you to do this?' he said: 'yes. He said: 'By the One Who sent you with the truth, I will not do more that this or less.' When he left, the Prophet, said: 'If he is sincere, he will certainly center paradise.\"'",
      "chain": [
        "30172",
        "20443",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن يحيى بن أيوب، قال حدثنا حماد بن الخياط، وأبو عامر قالا حدثنا ابن أبي ذئب، عن الزهري، عن أبي سلمة، عن عبد الرحمن بن عوف، قال الصائم في السفر كالمفطر في الحضر ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin 'Awf said:                     \"The one who fasts while traveling is like one who does not fast while a resident.\" (Daif)",
      "chain": [
        "38617",
        "20443",
        "20177",
        "11013",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "2723",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر، قال حدثنا شعبة، عن الحكم، قال سمعت علي بن حسين، يحدث عن مروان، أن عثمان، نهى عن المتعة، وأن يجمع الرجل بين الحج والعمرة فقال علي لبيك بحجة وعمرة معا ‏.‏ فقال عثمان أتفعلها وأنا أنهى عنها فقال علي لم أكن لأدع سنة رسول الله صلى الله عليه وسلم لأحد من الناس ‏.‏",
      "text_en": " It was narrated that Al-Hakam said:                     \"I heard 'Ali binHusain narrating from Marwan, that 'Uthman forbade Mut'ah and joining Hajj and \"Umrah. 'Ali said; 'Labbaika bi Hajjatin wa 'Umratin ma'an Here I am, (O Allah) for Hajj and \"Umrah together. 'Uthman said: 'Are you doing this when I have forbidden it?' 'Ali said; 'I will not give up the Summah of the Messenger of Allah for any of the people.'''",
      "chain": [
        "30123",
        "20443",
        "20020",
        "11069",
        "11045",
        "20201"
      ]
    },
    {
      "hadith_no": "3677",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عامر، قال حدثنا شعبة، عن سعد، - يعني ابن إبراهيم - عن عروة، عن بشير، أنه نحل ابنه غلاما فأتى النبي صلى الله عليه وسلم فأراد أن يشهد النبي صلى الله عليه وسلم فقال ‏\"‏ أكل ولدك نحلته مثل ذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Bashir that he gave his son a slave as a present, then he came to the Prophet and he wanted the Prophet to bear witness to that. He said:                      \"Have you given a similar present to all of your children?\" He said: \"No.\" He said: \"Then take (your present) back.\"",
      "chain": [
        "30172",
        "20443",
        "20020",
        "11063",
        "10511",
        "11810"
      ]
    },
    {
      "hadith_no": "4048",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا العباس بن محمد الدوري، قال حدثنا أبو عامر العقدي، عن إبراهيم بن طهمان، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث خصال زان محصن يرجم أو رجل قتل رجلا متعمدا فيقتل أو رجل يخرج من الإسلام يحارب الله عز وجل ورسوله فيقتل أو يصلب أو ينفى من الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messenger of Allah [SAW] said: \"It is not permissible to shed the blood of a Muslim except in three cases: An adulterer who had been married, who should be stoned to death; a man who killed another man intentionally, who should be killed; and a man who left Islam and waged war against Allah, the Might and Sublime, and His Messenger, who should be killed, or crucified, or banished from the land.\"",
      "chain": [
        "20443",
        "20187",
        "11257",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "5004",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا أبو عامر، قال حدثنا سليمان، - وهو ابن بلال - عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وسبعون شعبة والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Faith has seventy odd branches and modes (Al-Haya') is a branch of faith.\"",
      "chain": [
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5298",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، وأبو عامر قالا حدثنا شعبة، عن أبي عون الثقفي، قال سمعت أبا صالح الحنفي، يقول سمعت عليا، يقول أهديت لرسول الله صلى الله عليه وسلم حلة سيراء فبعث بها إلى فلبستها فعرفت الغضب في وجهه فقال ‏\"‏ أما إني لم أعطكها لتلبسها ‏\"‏ ‏.‏ فأمرني فأطرتها بين نسائي ‏.‏",
      "text_en": " 'Ali said:                     \"A Hullah of Sira' was given to the Messenger of Allah [SAW] and he sent it to me. I put it on, then I saw anger in his face. He said: 'I did not give it to you to wear it.' Then he told me to divide it among my womenfolk.\"",
      "chain": [
        "30123",
        "20291",
        "20443",
        "20020",
        "11649",
        "5"
      ]
    },
    {
      "hadith_no": "5399",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا أبو عامر، قال حدثنا سفيان، عن الشيباني، عن الشعبي، عن شريح، أنه كتب إلى عمر يسأله فكتب إليه أن اقض بما في كتاب الله فإن لم يكن في كتاب الله فبسنة رسول الله صلى الله عليه وسلم فإن لم يكن في كتاب الله ولا في سنة رسول الله صلى الله عليه وسلم فاقض بما قضى به الصالحون فإن لم يكن في كتاب الله ولا في سنة رسول الله صلى الله عليه وسلم ولم يقض به الصالحون فإن شئت فتقدم وإن شئت فتأخر ولا أرى التأخر إلا خيرا لك والسلام عليكم‏.‏",
      "text_en": " It was narrated from Shuraih that:                     He wrote to 'Umar, to ask him (a question), and 'Umar wrote back to him telling him: \"Judge according to what is in the Book of Allah. If it is not (mentioned) in the Book of Allah, then (judge) according to the Sunnah of the Messenger of Allah [SAW]. If it is not (mentioned) in the Book of Allah or the Sunnah of the Messenger of Allah [SAW], then pass judgment according to the way the righteous passed judgment. If it is not (mentioned) in the Book of Allah, or the Sunnah of the Messenger of Allah [SAW], and the righteous did not pass judgment concerning it, then if you wish, go ahead (and try to work it out by yourself) or if you wish, leave it. And I think that leaving it is better for you. And peace be upon you.\"",
      "chain": [
        "30160",
        "20443",
        "20012",
        "11352",
        "11052"
      ]
    },
    {
      "hadith_no": "5517",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر العقدي، قال حدثنا شعبة، عن بديل بن ميسرة، عن عبد الله بن شقيق، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يتعوذ من عذاب جهنم وعذاب القبر والمسيح الدجال ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] used to seek refuge (with Allah) from the torment of Hell, the torment of the grave, and Al-Masihid-Dajjal.\"",
      "chain": [
        "30123",
        "20443",
        "20020",
        "10672",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "5688",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر، والنضر بن شميل، ووهب بن جرير، قالوا حدثنا شعبة، عن سلمة بن كهيل، قال سمعت أبا الحكم، يحدث قال ابن عباس من سره أن يحرم، - إن كان محرما ما حرم الله ورسوله - فليحرم النبيذ ‏.‏",
      "text_en": " Ibn 'Abbas said:                     \"Whoever would like to regard as forbidden that which Allah and His Messenger [SAW] regard as forbidden, let him regard Nabidh as forbidden.\"",
      "chain": [
        "30123",
        "20443",
        "20291",
        "20298",
        "20020",
        "11350"
      ]
    },
    {
      "hadith_no": "329",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن الفضل، حدثنا أبو عامر، حدثنا عدي بن الفضل، عن علي بن الحكم، عن أبي نضرة، عن جابر بن عبد الله، قال نهى رسول الله  صلى الله عليه وسلم  أن يبول قائما ‏.‏ سمعت محمد بن يزيد أبا عبد الله يقول سمعت أحمد بن عبد الرحمن المخزومي يقول قال سفيان الثوري - في حديث عائشة أنا رأيته يبول قاعدا - قال الرجل أعلم بهذا منها ‏.‏ قال أحمد بن عبد الرحمن كان من شأن العرب البول قائما ألا تراه في حديث عبد الرحمن ابن حسنة يقول قعد يبول كما تبول المرأة ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah forbade us to urinate while standing.\" (Da'if)I heard Muhammed bin Yazid, Abu 'Abdullah, say: \"I heard Ahmad bin 'Abdur-Rahman Al-Makhzumi say: 'Sufyan Ath-Thawri said concerning the Hadith of 'Aisha- 'I (always) saw him urinating whilst sitting down' - a man knows more about that (about such matters) than she.' Ahmad bin 'Abdur-Rahman said: 'It was the custom of the Arabs to urinate standing up. Do you not see that in the Hadith of 'Abdur-Rahman bin Hasanah it was said: 'He sits down to urinate as a woman does.'\"",
      "chain": [
        "20443",
        "24312",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا زيد بن الحباب، ح وحدثنا محمد بن بشار، حدثنا أبو عامر العقدي، ح وحدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، قالوا حدثنا كثير بن زيد، عن ربيح بن عبد الرحمن بن أبي سعيد، عن أبيه، عن أبي سعيد، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     The Messenger of Allah said: \"There is no ablution for one who does not mention the Name of Allah (before doing it).\"",
      "chain": [
        "30216",
        "20650",
        "30160",
        "20443",
        "30242",
        "20355",
        "22171",
        "22055",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو نعيم، ح وحدثنا محمد بن بشار، حدثنا أبو عامر، قالا حدثنا عبد الله بن عبد الرحمن بن يعلى الطائفي، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت ما نام رسول الله  صلى الله عليه وسلم  قبل العشاء ولا سمر بعدها ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah did not sleep before the 'Isha' nor stay up (talking) after it.\"",
      "chain": [
        "30201",
        "20348",
        "30160",
        "20443",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "725",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، وإسحاق بن منصور، قالا حدثنا أبو عامر، حدثنا سفيان، عن طلحة بن يحيى، عن عيسى بن طلحة، قال سمعت معاوية بن أبي سفيان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المؤذنون أطول الناس أعناقا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Esa bin Talhah said:                     \"I heard Mu'awiyah bin Abu Sufyan say that Messenger of Allah said: \"The Mu'adh-dhin will have the longest necks of all people on the Day of Resurrection.\"",
      "chain": [
        "30160",
        "30313",
        "20443",
        "20012",
        "11863",
        "10573",
        "27"
      ]
    },
    {
      "hadith_no": "755",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن الفضل المقري، حدثنا أبو عامر، حدثنا حماد بن سلمة، عن عاصم، عن أبي صالح، عن أبي هريرة، أن رجلا، من الأنصار أرسل إلى رسول الله  صلى الله عليه وسلم  أن تعال فخط لي مسجدا في داري أصلي فيه وذلك بعد ما عمي فجاء ففعل ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     A man among the Ansar sent word to the Messenger of Allah saying: \"Come and designate a place in my house where I can perform prayer,' that was after he had become blind. So he went and did that.",
      "chain": [
        "20443",
        "20021",
        "11080",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا فليح بن سليمان، حدثنا عباس بن سهل الساعدي، قال اجتمع أبو حميد وأبو أسيد الساعدي وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله  صلى الله عليه وسلم  فقال أبو حميد أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  إن رسول الله  صلى الله عليه وسلم  قام فكبر ورفع يديه ثم رفع حين كبر للركوع ثم قام فرفع يديه واستوى حتى رجع كل عظم إلى موضعه ‏.‏",
      "text_en": " ‘Abbasbin Sahl As-Sa’di said:                      “Abu Humaid, Abu Usaid As-Sa’di, Sahlbin Sa’d, and Muhammad bin Maslamah came together and spoke abouttheprayer of the Messenger of Allah (ﷺ). Abu Humaid said: ‘I amthemost knowledgeable of you about the prayer of the Messenger ofAllah(ﷺ). The Messenger of Allah (ﷺ) stood up and said AllahuAkbar,and raised his hands, then he raised them when he said AllahuAkbarfor Ruku’, then he stood up and raised his hands, and stoodstraightuntil every bone had returned to its place.’”",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "956",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، ح وحدثنا محمد بن المثنى، حدثنا أبو عامر، قال أنبأنا عبد الله بن جعفر، عن يزيد بن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله هذا السلام عليك قد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك كما صليت على إبراهيم وبارك على محمد وعلى آل محمد كما باركت على إبراهيم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “We said: ‘O Messengerof Allah! We know what it means to send greetings upon you, but whatdoes it mean to send peace and blessings upon you?’ He said: ‘Say:“Allahumma salli ‘ala Muhammadin ‘abdika wa Rasulika kamasalayta ‘ala Ibrahima, wa barik ‘ala Muhammad (wa ‘ala aliMuhammadin) kama barakta ‘ala Ibrahima [O Allah, send Your grace,honor and mercy upon Muhammad, Your slave and Messenger, as You sentYour (grace, honour and mercy) upon Ibrahim, and send Your blessingsupon Muhammad (and the family of Muhammad) as You sent Your blessingsupon Ibrahim].”",
      "chain": [
        "30201",
        "30463",
        "30170",
        "20443",
        "108",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "1124",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا أبو عامر، عن عيسى بن حفص بن عاصم بن عمر بن الخطاب، حدثني أبي قال، كنا مع ابن عمر في سفر فصلى بنا ثم انصرفنا معه وانصرف ‏.‏ قال فالتفت فرأى أناسا يصلون فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا لأتممت صلاتي يا ابن أخي إني صحبت رسول الله  صلى الله عليه وسلم  فلم يزد على ركعتين في السفر حتى قبضه الله ثم صحبت أبا بكر فلم يزد على ركعتين ثم صحبت عمر فلم يزد على ركعتين ثم صحبت عثمان فلم يزد على ركعتين حتى قبضهم الله والله يقول ‏{لقد كان لكم في رسول الله أسوة حسنة ‏}‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Isa bin Hafs bin ‘Asim bin ‘Umar bin Khattabthat his father told him:                      “We were with Ibn ‘Umar on a journey,and he led us in prayer. Then we finished with him and he finishedturning around, and saw some people praying. He said: ‘What arethese people doing?’ I said: ‘Glorifying Allah.’* He said: ‘IfI wanted to glorify Allah (perform voluntary prayer) I would havecompleted my prayer. O son of my brother! I accompanied the Messengerof Allah (ﷺ) and he never prayed more than two Rak’ah when he wastraveling, until Allah took his soul. Then I accompanied Abu Bakr andhe never prayed more than two Rak’ah (when he was traveling), untilAllah took his soul. Then I accompanied ‘Umar and he never prayedmore than two Rak’ah, until Allah took his soul. Then I accompanied‘Uthman and he never prayed more than two Rak’ah, until Allahtook his soul. Allah says: ‘Indeed in the Messnger of Allah(Muhammad (ﷺ)) you have a good example to follow.’” [33:21]",
      "chain": [
        "30357",
        "20443",
        "11533",
        "11420"
      ]
    },
    {
      "hadith_no": "1180",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عامر، حدثنا زهير، عن أسيد بن أبي أسيد، ح وحدثنا أحمد بن عيسى المصري، حدثنا عبد الله بن وهب، عن ابن أبي ذئب، عن أسيد بن أبي أسيد، عن عبد الله بن أبي قتادة، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من ترك الجمعة ثلاثا من غير ضرورة طبع الله على قلبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) said: ‘Whoever abandons Friday (prayer) three times, fornonecessary reason, Allah will place a seal over his heart.’”",
      "chain": [
        "30170",
        "20443",
        "20321",
        "19800",
        "30227",
        "20029",
        "20177",
        "19800",
        "11804",
        "34"
      ]
    },
    {
      "hadith_no": "1513",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا كثير بن زيد، عن إسحاق بن عبد الله بن جعفر، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لقنوا موتاكم لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم الحمد لله رب العالمين ‏\"‏ ‏.‏ قالوا يا رسول الله كيف للأحياء قال ‏\"‏ أجود وأجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ishaq bin ‘Abdullah bin Ja’far that his fathersaid:                      “The Messenger of Allah (ﷺ) said: ‘Urge your dying onestosay: “La ilaha illallahul-Halimul-Karim, Subhan-AllahiRabbil-‘Arshil-‘Azim, Al-Hamdu Lillahi Rabbil-‘alamin (None hastheright to be worshipped but Allah, the Forbearing, the Most Kind.Gloryis to Allah, Lord of the magnificent Throne; praise is toAllah, theLord of the worlds).’” They said: ‘O Messenger ofAllah, what aboutthose who are alive?’ He said: ‘Even better,even better.’”",
      "chain": [
        "30160",
        "20443",
        "22171",
        "18023",
        "108"
      ]
    },
    {
      "hadith_no": "1623",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عامر، حدثنا عبد الله بن جعفر الزهري، عن إسماعيل بن محمد بن سعد، عن عامر بن سعد، عن سعد، أنه قال ألحدوا لي لحدا وانصبوا على اللبن نصبا كما فعل برسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Sa’d said:                      “Make a niche-grave for me, and blockitup with bricks as was done for the Messenger of Allah (ﷺ).”",
      "chain": [
        "30170",
        "20443",
        "11500",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، ح وحدثنا عبد الرحمن بن إبراهيم، وهارون بن عبد الله الحمال، قالا حدثنا ابن أبي فديك، جميعا عن هشام بن سعد، عن عثمان بن حيان الدمشقي، حدثتني أم الدرداء، عن أبي الدرداء، أنه قال لقد رأيتنا مع رسول الله  صلى الله عليه وسلم  في بعض أسفاره في اليوم الحار الشديد الحر وإن الرجل ليضع يده على رأسه من شدة الحر وما في القوم أحد صائم إلا رسول الله  صلى الله عليه وسلم  وعبد الله بن رواحة ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      “We were with the Messenger ofAllah (ﷺ) on one of his journeys on a hot day, and it was extremelyhot. A man would put his hand over his head because of the intenseheat. No one among the people was fasting except for the Messenger ofAllah (ﷺ) and ‘Abdullah bin Rawahah.”",
      "chain": [
        "30160",
        "20443",
        "30285",
        "30524",
        "20172",
        "20519",
        "11890",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "1763",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا زمعة بن صالح، عن سلمة، عن عكرمة، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ استعينوا بطعام السحر على صيام النهار وبالقيلولة على قيام الليل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “Seekhelpby eating Suhur for fasting that day, and by taking a brief rest(atmidday) for praying at night.”",
      "chain": [
        "30160",
        "20443",
        "10636",
        "237",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2009",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، عن زمعة بن صالح، عن سلمة بن وهرام، عن عكرمة، عن ابن عباس، قال لعن رسول الله  صلى الله عليه وسلم  المحلل والمحلل له ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     “The Messenger of Allah cursed the Muhallil and the Muhallal lahu.”",
      "chain": [
        "30160",
        "20443",
        "10636",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا شعبة، عن عثمان بن عبد الله بن موهب، قال سمعت عبد الله بن أبي قتادة، عن أبيه، أن النبي صلى الله عليه وسلم أتي بجنازة ليصلي عليها فقال ‏\"‏ صلوا على صاحبكم فإن عليه دينا ‏\"‏ ‏.‏ فقال أبو قتادة أنا أتكفل به ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ بالوفاء ‏\"‏ ‏.‏ قال بالوفاء ‏.‏ وكان الذي عليه ثمانية عشر أو تسعة عشر درهما ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Abdullah bin Mawhab said:                     “I heard 'Abdullah bin Abu Qatadah narrate from his father that a corpse was brought  to the Prophet (ﷺ)  for him to offer the funeral prayer, and he said: 'Pray for your companion, for he owes a debt.' Abu Qatadah said: 'I will stand surely for him?'  The Prophet (ﷺ) said: 'In full?' He said: 'In full.” And the debt he owed was eighteen or nineteen Dirham.”",
      "chain": [
        "30160",
        "20443",
        "20020",
        "11524",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "2513",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا شعبة، عن عبد الملك بن عمير، قال سمعت ربعي بن حراش، يحدث عن حذيفة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا مات فقيل له ما عملت - فإما ذكر أو ذكر - قال إني كنت أتجوز في السكة والنقد وأنظر المعسر ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Prophet (ﷺ) said:                     “A man died and it was said to him: 'What did you do?' Either he remembered or was reminded and said: 'I used to be easy going in coins and cash collecting debts due, and I used to give respite to (the debtor) who was in difficulty. So, Allah (SWT) forgave him.' ” Abu Masud said: “I heard that from the Messenger of Allah (ﷺ).”",
      "chain": [
        "30160",
        "20443",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا عبد العزيز بن المطلب، عن عبد الله بن الحسن، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أريد ماله ظلما فقتل فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     “The Messenger of Allah (ﷺ) said: 'If a man's property is wrongfully targeted, and he is killed, he is a martyr.”",
      "chain": [
        "30160",
        "20443",
        "20511",
        "19809",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2935",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا سفيان، عن أبي إسحاق، عن البراء بن عازب، قال كنا نتحدث أن أصحاب، رسول الله صلى الله عليه وسلم كانوا يوم بدر ثلاثمائة وبضعة عشر على عدة أصحاب طالوت من جاز معه النهر وما جاز معه إلا مؤمن ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “We were talking abouthow,on the Day of Badr, the Companions of the Messenger of Allah(ﷺ)numbered three hundred ten and something, the same number as theCompanions of (Talut) who crossed the river with him, and no onecrossed the river with him but a believer.”",
      "chain": [
        "30160",
        "20443",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3344",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، وعبد الرحمن بن عبد الوهاب، قالا حدثنا أبو عامر العقدي، حدثنا إبراهيم بن الفضل، عن سعيد المقبري، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  عن قتل الصرد والضفدع والنملة والهدهد ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)forbade killing shrikes*, frogs, ants and hoopoes.”",
      "chain": [
        "30160",
        "20443",
        "22009",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3545",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا زمعة بن صالح، عن سلمة بن وهرام، عن عكرمة، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  عن اختناث الأسقية وإن رجلا بعدما نهى رسول الله  صلى الله عليه وسلم  عن ذلك قام من الليل إلى سقاء فاختنثه فخرجت عليه منه حية ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)forbade tipping up water skins. After the Messenger of Allah (ﷺ)hadforbidden that, a man got up at night and tipped up a water skin,anda snake fell out of it onto him.”",
      "chain": [
        "30160",
        "20443",
        "10636",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3568",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن أيوب بن عبد الرحمن بن عبد الله بن أبي صعصعة، ح وحدثنا محمد بن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا فليح بن سليمان، عن أيوب بن عبد الرحمن، عن يعقوب بن أبي يعقوب، عن أم المنذر بنت قيس الأنصارية، قالت دخل علينا رسول الله  صلى الله عليه وسلم  ومعه علي بن أبي طالب وعلي ناقه من مرض ولنا دوالي معلقة وكان النبي  صلى الله عليه وسلم  يأكل منها فتناول علي ليأكل فقال النبي  صلى الله عليه وسلم  ‏\"‏ مه يا علي إنك ناقه ‏\"‏ ‏.‏ قالت فصنعت للنبي  صلى الله عليه وسلم  سلقا وشعيرا فقال النبي  صلى الله عليه وسلم  ‏\"‏ يا علي من هذا فأصب فإنه أنفع لك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Mundhir bint Qais Ansariyyah said:                      “TheMessengerof Allah (ﷺ) entered upon us, and with him was ‘Ali binAbuTalib, who had recently recovered from an illness. We had bunchesofunripe dates hanging up, and the Prophet (ﷺ) was eating fromthem.‘Ali reached out to eat some, and the Prophet (ﷺ) said to‘Ali:‘Stop, O ‘Ali! You have just recovered from an illness.’ I madesome greens and barley for the Prophet (ﷺ), and the Prophet (ﷺ)said to ‘Ali: ‘O ‘Ali, eat some of this, for it is better foryou.’”",
      "chain": [
        "30201",
        "20393",
        "20169",
        "30160",
        "20443",
        "20547",
        "20169",
        "12604"
      ]
    },
    {
      "hadith_no": "3654",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن سليمان بن هشام البغدادي، حدثنا وكيع، ح وحدثنا أبو بكر بن خلاد الباهلي، حدثنا أبو عامر، قالا حدثنا سفيان، عن منصور، عن منهال، عن سعيد بن جبير، عن ابن عباس، قال كان النبي  صلى الله عليه وسلم  يعوذ الحسن والحسين يقول ‏\"‏ أعوذ بكلمات الله التامة من كل شيطان وهامة ومن كل عين لامة ‏\"‏ ‏.‏ قال ‏\"‏ وكان أبونا إبراهيم يعوذ بها إسماعيل وإسحاق ‏\"‏ ‏.‏ أو قال ‏\"‏ إسماعيل ويعقوب ‏\"‏ ‏.‏ وهذا حديث وكيع ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Prophet (ﷺ) used to seekrefuge for Hasan and Husain and say: A’udhu bikalimatil-lahil-tammati, min kulli shaitanin wa hammah, wa min kulli‘aynin lammah (Iseek refuge for you both in the Perfect Words ofAllah, from everydevil and every poisonous reptile, and from everyevil eye).’ And hewould say: ‘Thus Ibrahim used to seek refugewith Allah for Isma’iland Ishaq,’ or he said: ‘for Isma’iland Ya’qub.’”",
      "chain": [
        "20032",
        "30357",
        "20443",
        "20012",
        "11067",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3655",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا إبراهيم الأشهلي، عن داود بن حصين، عن عكرمة، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كان يعلمهم من الحمى ومن الأوجاع كلها أن يقولوا ‏\"‏ بسم الله الكبير أعوذ بالله العظيم من شر عرق نعار ومن شر حر النار ‏\"‏ ‏.‏ قال أبو عامر أنا أخالف الناس في هذا أقول يعار ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that, for fever and all kinds ofpain, theProphet (ﷺ) used to teach them to say:                      “Bismillahil-kabir,a’udhubillahil-‘Azim min sharri ‘irqin na’ar wa, min sharriharrin-nar (In the Name of Allah the Great, I seek refuge with AllahtheAlmighty from the evil of a vein gushing (with blood) and theevil ofthe heat of the Fire.”",
      "chain": [
        "30160",
        "20443",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3924",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، أخبرني ابن جريج، أخبرني موسى بن عقبة، أخبرني سالم بن عبد الله، عن عبد الله بن عمر، عن رؤيا النبي،  صلى الله عليه وسلم  قال ‏\"‏ رأيت امرأة سوداء ثائرة الرأس خرجت من المدينة حتى قامت بالمهيعة وهي الجحفة ‏.‏ فأولتها وباء بالمدينة فنقل إلى الجحفة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar concerning the dream of theProphet (ﷺ) that he (the Prophet (ﷺ)) said:                      “I saw a blackwomanwith disheveled hair, who left Al-Madinah and went to stay inAl-Mahya’ah, which is Juhfah. I interpreted it as referring to anepidemic in Al-Madinah which moved to Juhfah.”",
      "chain": [
        "30160",
        "20443",
        "11070",
        "11106",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 151
}