{
  "id": "20450",
  "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
  "full_name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "206",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Yamama"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Yemami"
    ]
  },
  "parents": [
    {
      "id": "20474",
      "name": "Yonus bin al-Qasim al-Hnfy يونس بن القاسم الحنفي أبو عمر اليمامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20474",
      "name": "Yonus bin al-Qasim al-Hnfy يونس بن القاسم الحنفي أبو عمر اليمامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18068",
      "name": "Ayoub bin 'Utba أيوب بن عتبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20412",
      "name": "Ayoub bin al-Njar bin Ziyad أيوب بن النجار بن زياد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28086",
      "name": "Jhdm bin 'Abdullah bin Aby جهضم بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20163",
      "name": "'Asim bin Muhammad bin Zayd عاصم بن محمد بن زيد العمري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28634",
      "name": "Yahya bin 'Abdul 'Aziz يحيى بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28521",
      "name": "Muhammad bin 'Abdullah bin Tawus محمد بن عبد الله بن طاوس",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20743",
      "name": "Malazm bin 'Amr - Lazaym ملازم بن عمرو اليمامي - لزيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "38072",
      "name": "Abu Thaur al-Kalbi إبراهيم بن خالد أبو ثور الكلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30432",
      "name": "Zayd bin Yazid al-Thqfy زيد بن يزيد الثقفي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30314",
      "name": "Ishaq bin Wahb bin Ziyad إسحاق بن وهب بن زياد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38393",
      "name": "'Ali bin al-Husain bin Ibrahim Ashkab علي بن الحسين بن إبراهيم بن الحر أشكاب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30269",
      "name": "Muhammad bin al-Sabah محمد بن الصباح البزاز الدولابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30567",
      "name": "Mkhld bin Khalid bin Yazid مخلد بن خالد بن يزيد الشعيري",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2207",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن وهب، حدثنا عمر بن يونس، قال حدثني أبي قال، حدثني إسحاق بن أبي طلحة الأنصاري، عن أنس بن مالك  رضى الله عنه  أنه قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة، والمخاضرة، والملامسة، والمنابذة، والمزابنة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle forbade Muhaqala, Mukhadara, Mulamasa, Munabadha and Muzabana. (See glossary and previous Hadiths for the meanings of these terms.)",
      "chain": [
        "30314",
        "20450",
        "20474",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، قال حدثني أبو كثير، قال حدثني أبو هريرة، قال كنا قعودا حول رسول الله صلى الله عليه وسلم معنا أبو بكر وعمر في نفر فقام رسول الله صلى الله عليه وسلم من بين أظهرنا فأبطأ علينا وخشينا أن يقتطع دوننا وفزعنا فقمنا فكنت أول من فزع فخرجت أبتغي رسول الله صلى الله عليه وسلم حتى أتيت حائطا للأنصار لبني النجار فدرت به هل أجد له بابا فلم أجد فإذا ربيع يدخل في جوف حائط من بئر خارجة - والربيع الجدول - فاحتفزت كما يحتفز الثعلب فدخلت على رسول الله صلى الله عليه وسلم فقال ‏\"‏ أبو هريرة ‏\"‏ ‏.‏ فقلت نعم يا رسول الله ‏.‏ قال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قلت كنت بين أظهرنا فقمت فأبطأت علينا فخشينا أن تقتطع دوننا ففزعنا فكنت أول من فزع فأتيت هذا الحائط فاحتفزت كما يحتفز الثعلب وهؤلاء الناس ورائي فقال ‏\"‏ يا أبا هريرة ‏\"‏ ‏.‏ وأعطاني نعليه قال ‏\"‏ اذهب بنعلى هاتين فمن لقيت من وراء هذا الحائط يشهد أن لا إله إلا الله مستيقنا بها قلبه فبشره بالجنة ‏\"‏ فكان أول من لقيت عمر فقال ما هاتان النعلان يا أبا هريرة ‏.‏ فقلت هاتان نعلا رسول الله صلى الله عليه وسلم بعثني بهما من لقيت يشهد أن لا إله إلا الله مستيقنا بها قلبه بشرته بالجنة ‏.‏ فضرب عمر بيده بين ثديى فخررت لاستي فقال ارجع يا أبا هريرة فرجعت إلى رسول الله صلى الله عليه وسلم فأجهشت بكاء وركبني عمر فإذا هو على أثري فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما لك يا أبا هريرة ‏\"‏ ‏.‏ قلت لقيت عمر فأخبرته بالذي بعثتني به فضرب بين ثديى ضربة خررت لاستي قال ارجع ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ يا عمر ما حملك على ما فعلت ‏\"‏ ‏.‏ قال يا رسول الله بأبي أنت وأمي أبعثت أبا هريرة بنعليك من لقي يشهد أن لا إله إلا الله مستيقنا بها قلبه بشره بالجنة ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فلا تفعل فإني أخشى أن يتكل الناس عليها فخلهم يعملون ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فخلهم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira:                      We were sitting around the Messenger of Allah (may peace and blessings be upon him). Abu Bakr and Umar were also there among the audience. In the meanwhile the Messenger of Allah got up and left us, He delayed in coming back to us, which caused anxiety that he might be attacked by some enemy when we were not with him; so being alarmed we got up. I was the first to be alarmed. I, therefore, went out to look for the Messenger of Allah (may peace and blessings be upon him) and came to a garden belonging to the Banu an-Najjar, a section of the Ansar went round it looking for a gate but failed to find one. Seeing a rabi' (i. e. streamlet) flowing into the garden from a well outside, drew myself together, like a fox, and slinked into (the place) where God's Messenger was. He (the Holy Prophet) said: Is it Abu Huraira? I (Abu Huraira) replied: Yes, Messenger of Allah. He (the Holy Prophet) said: What is the matter with you? replied: You were amongst us but got up and went away and delayed for a time, so fearing that you might be attacked by some enemy when we were not with you, we became alarmed. I was the first to be alarmed. So when I came to this garden, I drew myself together as a fox does, and these people are following me. He addressed me as Abu Huraira and gave me his sandals and said: Take away these sandals of mine, and when you meet anyone outside this garden who testifies that there is no god but Allah, being assured of it in his heart, gladden him by announcing that he shall go to Paradise. Now the first one I met was Umar. He asked: What are these sandals, Abu Huraira? I replied: These are the sandals of the Messenger of Allah with which he has sent me to gladden anyone I meet who testifies that there is no god but Allah, being assured of it in his heart, with the announcement that he would go to Paradise. Thereupon 'Umar struck me on the breast and I fell on my back. He then said: Go back, Abu Huraira, So I returned to the Messenger of Allah (may peace be upon him), and was about to break into tears. 'Umar followed me closely and there he was behind me. The Messenger of Allah (may peace and blessings be on him) said: What is the matter with you, Abu Huraira? I said: I happened to meet 'Umar and conveyed to him the message with which you sent me. He struck me on my breast which made me fall down upon my back and ordered me to go back. Upon this the Messenger of Allah (may peace be upon him) said: What prompted you to do this, 'Umar? He said: Messenger of Allah, my mother and father be sacrificed to thee, did you send Abu Huraira with your sandals to gladden anyone he met and who testified that there is no god but Allah, and being assured of it in his heart, with the tidings that he would go to Paradise? He said: Yes. Umar said: Please do it not, for I am afraid that people will trust in it alone; let them go on doing (good) deeds. The Messenger of Allah (may peace be upon him) said: Well, let them.",
      "chain": [
        "30022",
        "20450",
        "10704",
        "19466",
        "13"
      ]
    },
    {
      "hadith_no": "240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، وأبو معن الرقاشي قالا حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثني يحيى بن أبي كثير، قال حدثني - أو، حدثنا - أبو سلمة بن عبد الرحمن، حدثني سالم، مولى المهري قال خرجت أنا وعبد الرحمن بن أبي بكر، في جنازة سعد بن أبي وقاص فمررنا على باب حجرة عائشة فذكر عنها عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Salim, the freed slave of Mahri, reported:                      I and 'Abd al-Rahman b. Abu Bakr went out (in order to join) the funeral procession of Sa'd b. Abi Waqqas and passed by the door of the residence of 'A'isha, and then he transmitted a hadith like this from her who (narrated it) from the Holy Prophet (may peace be upon him).",
      "chain": [
        "38487",
        "30432",
        "20450",
        "10704",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، حدثنا إسحاق بن أبي طلحة، حدثني أنس بن مالك، - وهو عم إسحاق - قال بينما نحن في المسجد مع رسول الله صلى الله عليه وسلم إذ جاء أعرابي فقام يبول في المسجد فقال أصحاب رسول الله صلى الله عليه وسلم مه مه ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزرموه دعوه ‏\"‏ ‏.‏ فتركوه حتى بال ‏.‏ ثم إن رسول الله صلى الله عليه وسلم دعاه فقال له ‏\"‏ إن هذه المساجد لا تصلح لشىء من هذا البول ولا القذر إنما هي لذكر الله عز وجل والصلاة وقراءة القرآن ‏\"‏ ‏.‏ أو كما قال رسول الله صلى الله عليه وسلم ‏.‏ قال فأمر رجلا من القوم فجاء بدلو من ماء فشنه عليه ‏.‏",
      "text_en": " Anas b. Malik reported:                      While we were in the mosque with Allah's Messenger (may peace be upon him), a desert Arab came and stood up and began to urinate in the mosque. The Companions of Allah's Messenger (may peace be upon him) said: Stop, stop, but the Messenger of Allah (may peace be upon him) said: Don't interrupt him; leave him alone. They left him alone, and when he finished urinating, Allah's Messenger (may peace be upon him) called him and said to him: These mosques are not the places meant for urine and filth, but are only for the remembrance of Allah, prayer and the recitation of the Qur'an, or Allah's Messenger said something like that. He (the narrator) said that he (the Holy Prophet) then gave orders to one of the people who brought a bucket of water and poured It over.",
      "chain": [
        "30022",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "310",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، قال قال إسحاق بن أبي طلحة حدثني أنس بن مالك، قال جاءت أم سليم - وهي جدة إسحاق - إلى رسول الله صلى الله عليه وسلم فقالت له وعائشة عنده يا رسول الله المرأة ترى ما يرى الرجل في المنام فترى من نفسها ما يرى الرجل من نفسه ‏.‏ فقالت عائشة يا أم سليم فضحت النساء تربت يمينك ‏.‏ فقال لعائشة ‏\"‏ بل أنت فتربت يمينك نعم فلتغتسل يا أم سليم إذا رأت ذاك ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      Umm Sulaim who was the grandmother of Ishaq came to the Messenger of Allah (may peace be upon him) in the presence of 'A'isha and said to him: Messenger of Allah, in case or woman sees what a man sees in dream and she experiences in dream what a man experiences (i. e. experiences orgasm)? Upon this 'A'isha remarked: O Umm Sulaim, you brought humiliation to women;may your right hand be covered with dust. He (the Holy Prophet) said to 'A'isha: Let your hand be covered with dust, and (addressing Umm Sulaim) said: Well, O Umm Sulaim, she should take a bath if she sees that (i. e. she experiences orgasm in dream).",
      "chain": [
        "30022",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن حاتم، وعبد بن حميد، وأبو معن الرقاشي قالوا حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا يحيى بن أبي كثير، حدثني أبو سلمة، بن عبد الرحمن بن عوف قال سألت عائشة أم المؤمنين بأى شىء كان نبي الله صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل قالت كان إذا قام من الليل افتتح صلاته ‏\"‏ اللهم رب جبرائيل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏",
      "text_en": " 'Ali b. Abu Talib reported that when the Messenger of Allah (may peace be upon him) got up at night for prayer he would say:                      I turn my face in complete devotion to One Who is the Originator of the heaven and the earth and I am not of the polytheists. Verily my prayer, my sacrifice, my living and my dying are for Allah, the Lord of the worlds; There is no partner with Him and this is what I have been commanded (to profess and believe) and I am of the believers. O Allah, Thou art the King, there is no god but Thee, Thou art my Lord, and I am Thy bondman. I wronged myself and make a confession of my Sin. Forgive all my sins, for no one forgives the sins but Thee, and guide me in the best of conduct for none but Thee guideth anyone (in) good conduct. Remove sins from me, for none else but Thou can remove sins from me. Here I am at Thy service, and Grace is to Thee and the whole of good is in Thine hand, and one cannot get nearneststo Thee through evil. My (power as well as existence) is due to Thee (Thine grace) and I turn to Thee (for supplication). Thou art blessed and Thou art exalted. I seek forgiveness from Thee and turn to Thee in repentance: and when he would bow, he would say: O Allah, it is for Thee that I bowed. I affirm my faith in Thee and I submit to Thee, and submit humbly before Thee my hearing, my eyesight, my marrow, my bone, my sinew; and when he would raise his head, he would say: O Allah, our Lord, praise is due to Thee, (the praise) with which is filled the heavens and the earth, and with which is filled that (space) which exists between them, and filled with anything that Thou desireth afterward. And when he prostrated himself, he (the Holy Prophet) would say: O Allah, it is to Thee that I prostrate myself and it is in Thee that I affirm my faith, and I submit to Thee. My face is submitted before One Who created it, and shaped it, and opened his faculties of hearing and seeing. Blessed is Allah, the best of Creators; and he would then say between Tashahhud and the pronouncing of salutation: Forgive me of the earlier and later open and secret (sins) and that where I made transgression and that Thou knowest better than I. Thou art the First and the Last. There is no god, but Thee.",
      "chain": [
        "30170",
        "38487",
        "30553",
        "30432",
        "20450",
        "10704",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2435",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وزهير بن حرب، وعبد بن حميد، قالوا حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا شداد، قال سمعت أبا أمامة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا ابن آدم إنك أن تبذل الفضل خير لك وأن تمسكه شر لك ولا تلام على كفاف وابدأ بمن تعول واليد العليا خير من اليد السفلى ‏\"‏.",
      "text_en": " Abu Umama reported Allah's Messenger (may peace be upon him) as saying:                      O son of Adam, it is better for you if you spend your surplus (wealth), but if you withhold it, it is evil for you. There is (however) no reproach for you (if you withhold means necessary) for a living. And begin (charity) with your dependents; and the upper hand is better than the lower hand.",
      "chain": [
        "30395",
        "30022",
        "30553",
        "20450",
        "10704",
        "4048"
      ]
    },
    {
      "hadith_no": "2477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، ح وحدثني زهير بن حرب، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، كلهم عن إسحاق بن عبد الله بن أبي طلحة، عن أنس، بن مالك عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ وفي حديث عكرمة بن عمار من الزيادة قال ثم جبذه إليه جبذة رجع نبي الله صلى الله عليه وسلم في نحر الأعرابي ‏.‏ وفي حديث همام فجاذبه حتى انشق البرد وحتى بقيت حاشيته في عنق رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters. And In the hadith transmitted by Ikrima b. 'Ammir there is an addition:                     \" He (the bedouin) pulled his (mantle) so violently that the Apostle of Allah (may peace be upon him) was drifted very close to the bedouin.\" And in the hadith transmitted by Hammam, (the words are):\" He pulled it so violently that the mantle was torn and the border was left around the neck of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30022",
        "20250",
        "20297",
        "30022",
        "20450",
        "10704",
        "30417",
        "20442",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3764",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثني زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، عن سماك أبي زميل، حدثني عبد الله بن عباس، حدثني عمر بن الخطاب، قال لما اعتزل نبي الله صلى الله عليه وسلم نساءه - قال - دخلت المسجد فإذا الناس ينكتون بالحصى ويقولون طلق رسول الله صلى الله عليه وسلم نساءه وذلك قبل أن يؤمرن بالحجاب فقال عمر فقلت لأعلمن ذلك اليوم قال فدخلت على عائشة فقلت يا بنت أبي بكر أقد بلغ من شأنك أن تؤذي رسول الله صلى الله عليه وسلم فقالت ما لي وما لك يا ابن الخطاب عليك بعيبتك ‏.‏ قال فدخلت على حفصة بنت عمر فقلت لها يا حفصة أقد بلغ من شأنك أن تؤذي رسول الله صلى الله عليه وسلم والله لقد علمت أن رسول الله صلى الله عليه وسلم لا يحبك ‏.‏ ولولا أنا لطلقك رسول الله صلى الله عليه وسلم ‏.‏ فبكت أشد البكاء فقلت لها أين رسول الله صلى الله عليه وسلم قالت هو في خزانته في المشربة ‏.‏ فدخلت فإذا أنا برباح غلام رسول الله صلى الله عليه وسلم قاعدا على أسكفة المشربة مدل رجليه على نقير من خشب وهو جذع يرقى عليه رسول الله صلى الله عليه وسلم وينحدر فناديت يا رباح استأذن لي عندك على رسول الله صلى الله عليه وسلم ‏.‏ فنظر رباح إلى الغرفة ثم نظر إلى فلم يقل شيئا ثم قلت يا رباح استأذن لي عندك على رسول الله صلى الله عليه وسلم ‏.‏ فنظر رباح إلى الغرفة ثم نظر إلى فلم يقل شيئا ثم رفعت صوتي فقلت يا رباح استأذن لي عندك على رسول الله صلى الله عليه وسلم فإني أظن أن رسول الله صلى الله عليه وسلم ظن أني جئت من أجل حفصة والله لئن أمرني رسول الله صلى الله عليه وسلم بضرب عنقها لأضربن عنقها ‏.‏ ورفعت صوتي فأومأ إلى أن ارقه فدخلت على رسول الله صلى الله عليه وسلم وهو مضطجع على حصير فجلست فأدنى عليه إزاره وليس عليه غيره وإذا الحصير قد أثر في جنبه فنظرت ببصري في خزانة رسول الله صلى الله عليه وسلم فإذا أنا بقبضة من شعير نحو الصاع ومثلها قرظا في ناحية الغرفة وإذا أفيق معلق - قال - فابتدرت عيناى قال ‏\"‏ ما يبكيك يا ابن الخطاب ‏\"‏ ‏.‏ قلت يا نبي الله وما لي لا أبكي وهذا الحصير قد أثر في جنبك وهذه خزانتك لا أرى فيها إلا ما أرى وذاك قيصر وكسرى في الثمار والأنهار وأنت رسول الله صلى الله عليه وسلم وصفوته وهذه خزانتك ‏.‏ فقال ‏\"‏ يا ابن الخطاب ألا ترضى أن تكون لنا الآخرة ولهم الدنيا ‏\"‏ ‏.‏ قلت بلى - قال - ودخلت عليه حين دخلت وأنا أرى في وجهه الغضب فقلت يا رسول الله ما يشق عليك من شأن النساء فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكائيل وأنا وأبو بكر والمؤمنون معك وقلما تكلمت وأحمد الله بكلام إلا رجوت أن يكون الله يصدق قولي الذي أقول ونزلت هذه الآية آية التخيير ‏{‏ عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن‏}‏ ‏{‏ وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير‏}‏ وكانت عائشة بنت أبي بكر وحفصة تظاهران على سائر نساء النبي صلى الله عليه وسلم فقلت يا رسول الله أطلقتهن قال ‏\"‏ لا ‏\"‏ ‏.‏ قلت يا رسول الله إني دخلت المسجد والمسلمون ينكتون بالحصى يقولون طلق رسول الله صلى الله عليه وسلم نساءه أفأنزل فأخبرهم أنك لم تطلقهن قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏ فلم أزل أحدثه حتى تحسر الغضب عن وجهه وحتى كشر فضحك وكان من أحسن الناس ثغرا ثم نزل نبي الله صلى الله عليه وسلم ونزلت فنزلت أتشبث بالجذع ونزل رسول الله صلى الله عليه وسلم كأنما يمشي على الأرض ما يمسه بيده فقلت يا رسول الله إنما كنت في الغرفة تسعة وعشرين ‏.‏ قال ‏\"‏ إن الشهر يكون تسعا وعشرين ‏\"‏ ‏.‏ فقمت على باب المسجد فناديت بأعلى صوتي لم يطلق رسول الله صلى الله عليه وسلم نساءه ‏.‏ ونزلت هذه الآية ‏{‏ وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم‏}‏ فكنت أنا استنبطت ذلك الأمر وأنزل الله عز وجل آية التخيير ‏.‏",
      "text_en": " 'Umar b. al-Khattab (Allah be pleased with him) reported:                      When Allah's Apostle (may peace be upon him) kept himself away from his wives, I entered the mosque, and found people striking the ground with pebblesand saying: Allah's Messenger (may peace be upon him) has divorced his wives, and that was before they were commanded to observe seclusion 'Umar said to himself: I must find this (actual position) today. So I went to 'A'isha (Allah be pleased with her) and said (to her): Daughter of Abu Bakr, have you gone to the extent of giving trouble to Allah's Messenger (may peace be upon him)? Thereupon she said: Son of Khattab, you have nothing to do with me, and I have nothing to do with you. You should look to your own receptacle. He ('Umar) said: I visited Hafsa daughter of 'Umar, and said to her: Hafsa, the (news) has reached me that you cause Allah's Messenger (may peace be upon him) trouble. You know that Allah's Messenger (may peace be upon him) does not love you, and had I not been (your father) he would have divorced you. (On hearing this) she wept bitterly. I said to her: Where is Allah's Messenger (may peace be upon him)? Shesaid: He is in the attic room. I went in and found Rabah, the servant of Allah's Messenger (may peace be upon him), sitting on the thresholds of the window dangling his feet on the hollow wood of the date-palm with the help of which Allah's Messenger (may peace be upon him) climbed (to the apartment) and came down. I cried: 0 Rabah, seek permission for me from Allah's Messenger (way peace be upon him). Rabah cast a glance at the apartment and then looked toward me but said nothing. I again said: Rabah, seek permission for me from Allah's Messenger (may peace be upon him). Rabah looked towards the apartment and then cast a glance at me, but said nothig. I then raised my voice and said: 0 Rabah, seek permission for me from Allah's Messenger (may peace be upon him). I think that Allah's Messenger (may peace be upon him) is under the impression that I have come for the sake of Hafsa. By Allah, if Allah's Messenger (may peace be upon him) would command me to strike her neck, I would certainly strike her neck. I raised my voice and he pointed me to climb up (and get into his apartment). I visited Allah's Messenger (may peace be upon him), and he was lying on a mat. I sat down and he drew up his lower garment over him and he had nothing (else) over him, and that the mat had left its marks on his sides. I looked with my eyes in the store room of Allah's Messenger (may peace be upon him). I found only a handful of barley equal to one sa' and an equal quantity of the leaves of Mimosa Flava placed in the nook of the cell, and a semi-tanned leather bag hanging (in one side), and I was moved to tears (on seeing this extremely austere living of the Holy Piophet), and he said: Ibn Khattab, what wakes you weep? I said: Apostle of Allah, why should I not shed tears? This mat has left its marks on your sides and I do not see in your store room (except these few things) that I have seen; Ceasar and Closroes are leading their lives in plenty whereas you are Allah's Messenger. His chosen one, and that is your store! He said: Ibn Khattab, aren't you satisfied that for us (there should be the prosperity) of the Hereafter, and for them (there should be the prosperity of) this world? I said: Yes. And as I had entered I had seen the signs of anger on his face, and I therefore, said: Messenger of Allah, what trouble do you feel from your wives, and if youhave divorced them, verily Allah is with you, His angels, Gabriel, Mika'il, I and Abu Bakr and the believers are with you. And seldom I talked and (which I uttered on that day) I hoped that Allah would testify to my words that I uttered. And so the verse of option (Ayat al-Takhyir) was revealed. Maybe his Lord, if he divorce you, will give him in your place wives better than you...\" (Ixv. 5). And if you back up one another against him, then surely Allah is his Patron, and Gabriel and the righteous believers, and the angels after that are the aidera (lvi. 4). And it was 'A'isha, daughter of Abu Bakr, and Hafsa who had prevailed upon all the wives of Allah's Prophet (way peace be upon him) for (pressing them for mote money). I said: Messenger of Allah, have you divorced them? He said: No. I said: Messenger of Allah, I entered the mosque and found the Muslims playing with pebbles (absorbed in thought) and saying: Allah's Messenger has divorced his wives. Should I get down and inform there that you have not divorced them? He said: Yes, if you so like. And I went on talking to him until I (found) the signs of anger disappeared on his face and (his seriousness was changed to a happy mood and as a result thereof) his face had the natural tranquillity upon it and he laughed and his teeth were the most charming (among the teeth) of all people. Then Allah's Apostle (may peace be upon him) climbed down and I also climbed down and catching hold of the wood of the palm-tree and Allah's Messenger (may peace be upon him) came down (with such ease) as if he was walking on the ground, not touching anything with his hand (to get support). I said: Messenger of Allah, you remained in your apartment for twenty-nine days. He said: (At times) the month consists of twenty-nine days. I stood at the door of the mosque and I called out at the top of my voice: The Messenger of Allah (may peace be upon him) has not divorced his wives (and it was on this occasion that this) verse was revealed:\" And if any matter pertaining to peace or alarm comes within their ken, they broadcast it; whereas, if they would refer it to the Apostle and those who have been entrusted with authority amongst them, those of them who are engaged in obtaining intelligence would indeed know (what to do with) it\" (iv 83). And it was I who understood this matter, and Allah revealed the verse pertaining to option (given to the Holy Prophet (may peace be upon him in regard to the retaining or divorcing of his wives).",
      "chain": [
        "30022",
        "20450",
        "10704",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "4671",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، حدثني إياس بن سلمة، حدثني أبي سلمة بن الأكوع، قال غزونا مع رسول الله صلى الله عليه وسلم هوازن فبينا نحن نتضحى مع رسول الله صلى الله عليه وسلم إذ جاء رجل على جمل أحمر فأناخه ثم انتزع طلقا من حقبه فقيد به الجمل ثم تقدم يتغدى مع القوم وجعل ينظر وفينا ضعفة ورقة في الظهر وبعضنا مشاة إذ خرج يشتد فأتى جمله فأطلق قيده ثم أناخه وقعد عليه فأثاره فاشتد به الجمل فاتبعه رجل على ناقة ورقاء ‏.‏ قال سلمة وخرجت أشتد فكنت عند ورك الناقة ‏.‏ ثم تقدمت حتى كنت عند ورك الجمل ثم تقدمت حتى أخذت بخطام الجمل فأنخته فلما وضع ركبته في الأرض اخترطت سيفي فضربت رأس الرجل فندر ثم جئت بالجمل أقوده عليه رحله وسلاحه فاستقبلني رسول الله صلى الله عليه وسلم والناس معه فقال ‏\"‏ من قتل الرجل ‏\"‏ ‏.‏ قالوا ابن الأكوع ‏.‏ قال ‏\"‏ له سلبه أجمع ‏\"‏ ‏.‏",
      "text_en": " It has been reported by Salama b. al-Akwa':                      We fought the Battle of Hawazin along with the Messenger of Allah (may peace be upon him). (One day) when we were having our breakfast with the Messenger of Allah (may peace he upon him), a man came riding a red camel. He made it kneel down, extracted a strip of leather from its girth and tethered the camel with it. Then he began to take food with the people and look (curiously around). We were in a poor condition as some of us were on foot (being without any riding animals). All of a sudden, he left us hurriedy, came to his camel, untethered it, made it kneel down, mounted it and urged the beast which ran off with him. A man on a brown rhe-camel chased him (taking him for a spy). Salama (the narrator) said: I followed on foot. I ran on until I was near the thigh of the she-camel. I advanced further until I was near the haunches of the camel. I advanced still further until I caught hold of the nosestring of the camel. I made it kneel down. As soon as it placed its knee on the ground, I drew my sword and struck at the head, of the rider who fell down. I brought the camel driving it along with the man's baggage and weapons. The Messenger of Allah (may peace be upon him) came forward to meet me and the people were with him. He asked: Who has killed the man? The people said: Ibn Akwa'. He said: Everything of the man is for him (Ibn Akwa').",
      "chain": [
        "30022",
        "20450",
        "10704"
      ]
    },
    {
      "hadith_no": "4672",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثني إياس بن سلمة، حدثني أبي قال، غزونا فزارة وعلينا أبو بكر أمره رسول الله صلى الله عليه وسلم علينا فلما كان بيننا وبين الماء ساعة أمرنا أبو بكر فعرسنا ثم شن الغارة فورد الماء فقتل من قتل عليه وسبى وأنظر إلى عنق من الناس فيهم الذراري فخشيت أن يسبقوني إلى الجبل فرميت بسهم بينهم وبين الجبل فلما رأوا السهم وقفوا فجئت بهم أسوقهم وفيهم امرأة من بني فزارة عليها قشع من أدم - قال القشع النطع - معها ابنة لها من أحسن العرب فسقتهم حتى أتيت بهم أبا بكر فنفلني أبو بكر ابنتها فقدمنا المدينة وما كشفت لها ثوبا فلقيني رسول الله صلى الله عليه وسلم في السوق فقال ‏\"‏ يا سلمة هب لي المرأة ‏\"‏ ‏.‏ فقلت يا رسول الله والله لقد أعجبتني وما كشفت لها ثوبا ثم لقيني رسول الله صلى الله عليه وسلم من الغد في السوق فقال لي ‏\"‏ يا سلمة هب لي المرأة لله أبوك ‏\"‏ ‏.‏ فقلت هي لك يا رسول الله فوالله ما كشفت لها ثوبا فبعث بها رسول الله صلى الله عليه وسلم إلى أهل مكة ففدى بها ناسا من المسلمين كانوا أسروا بمكة ‏.‏",
      "text_en": " It has been narrated on the authority of Salama (b. al-Akwa') who said:                      We fought against the Fazara and Abu Bakr was the commander over us. He had been appointed by the Messenger oi Allah (may peace be upon him). When we were onlv at an hour's distance from the water of the enemy, Abu Bakr ordered us to attack. We made a halt during the last part of the night tor rest and then we attacked from all sides and reached their watering-place where a battle was fought. Some of the enemies were killed and some were taken prisoners. I saw a group of persons that consisted of women and children. I was afraid lest they should reach the mountain before me, so I shot an arrow between them and the mountain. When they saw the arrow, they stopped. So I brought them, driving them along. Among them was a woman from Banu Fazara. She was wearing a leather coat. With her was her daughter who was one of the prettiest girls in Arabia. I drove them along until I brought them to Abu Bakr who bestowed that girl upon me as a prize. So we arrived in Medina. I had not yet disrobed her when the Messenger of Allah (may peace be upon him) met me in the street and said: Give me that girl, O Salama. I said: Messenger of Allah, she has fascinated me. I had not yet disrobed her. When on the next day. the Messenger of Allah (may peace be upon him) ag;tin met me in the street, he said: O Salama, give me that girl, may God bless your father. I said: She is for you. Messenger of Allah! By Allah. I have not yet disrobed her. The Messenger of Allah (may peace be upon him) sent her to the people of Mecca, and surrendered her as ransom for a number of Muslims who had been kept as prisoners at Mecca.",
      "chain": [
        "30022",
        "20450",
        "10704"
      ]
    },
    {
      "hadith_no": "4687",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن المبارك، عن عكرمة بن عمار، حدثني سماك، الحنفي قال سمعت ابن عباس، يقول حدثني عمر بن الخطاب، قال لما كان يوم بدر ح وحدثنا زهير بن حرب - واللفظ له - حدثنا عمر بن يونس الحنفي حدثنا عكرمة بن عمار حدثني أبو زميل - هو سماك الحنفي - حدثني عبد الله بن عباس قال حدثني عمر بن الخطاب قال لما كان يوم بدر نظر رسول الله صلى الله عليه وسلم إلى المشركين وهم ألف وأصحابه ثلاثمائة وتسعة عشر رجلا فاستقبل نبي الله صلى الله عليه وسلم القبلة ثم مد يديه فجعل يهتف بربه ‏\"‏ اللهم أنجز لي ما وعدتني اللهم آت ما وعدتني اللهم إن تهلك هذه العصابة من أهل الإسلام لا تعبد في الأرض ‏\"‏ ‏.‏ فمازال يهتف بربه مادا يديه مستقبل القبلة حتى سقط رداؤه عن منكبيه فأتاه أبو بكر فأخذ رداءه فألقاه على منكبيه ثم التزمه من ورائه ‏.‏ وقال يا نبي الله كذاك مناشدتك ربك فإنه سينجز لك ما وعدك فأنزل الله عز وجل ‏{‏ إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين‏}‏ فأمده الله بالملائكة ‏.‏ قال أبو زميل فحدثني ابن عباس قال بينما رجل من المسلمين يومئذ يشتد في أثر رجل من المشركين أمامه إذ سمع ضربة بالسوط فوقه وصوت الفارس يقول أقدم حيزوم ‏.‏ فنظر إلى المشرك أمامه فخر مستلقيا فنظر إليه فإذا هو قد خطم أنفه وشق وجهه كضربة السوط فاخضر ذلك أجمع ‏.‏ فجاء الأنصاري فحدث بذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ صدقت ذلك من مدد السماء الثالثة ‏\"‏ ‏.‏ فقتلوا يومئذ سبعين وأسروا سبعين ‏.‏ قال أبو زميل قال ابن عباس فلما أسروا الأسارى قال رسول الله صلى الله عليه وسلم لأبي بكر وعمر ‏\"‏ ما ترون في هؤلاء الأسارى ‏\"‏ ‏.‏ فقال أبو بكر يا نبي الله هم بنو العم والعشيرة أرى أن تأخذ منهم فدية فتكون لنا قوة على الكفار فعسى الله أن يهديهم للإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما ترى يا ابن الخطاب ‏\"‏ ‏.‏ قلت لا والله يا رسول الله ما أرى الذي رأى أبو بكر ولكني أرى أن تمكنا فنضرب أعناقهم فتمكن عليا من عقيل فيضرب عنقه وتمكني من فلان - نسيبا لعمر - فأضرب عنقه فإن هؤلاء أئمة الكفر وصناديدها فهوي رسول الله صلى الله عليه وسلم ما قال أبو بكر ولم يهو ما قلت فلما كان من الغد جئت فإذا رسول الله صلى الله عليه وسلم وأبو بكر قاعدين يبكيان قلت يا رسول الله أخبرني من أى شىء تبكي أنت وصاحبك فإن وجدت بكاء بكيت وإن لم أجد بكاء تباكيت لبكائكما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبكي للذي عرض على أصحابك من أخذهم الفداء لقد عرض على عذابهم أدنى من هذه الشجرة ‏\"‏ ‏.‏ شجرة قريبة من نبي الله صلى الله عليه وسلم ‏.‏ وأنزل الله عز وجل ‏{‏ ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض‏}‏ إلى قوله ‏{‏ فكلوا مما غنمتم حلالا طيبا‏}‏ فأحل الله الغنيمة لهم ‏.‏",
      "text_en": " It has been narrated on the authority of 'Umar b. al-Khattab who said:                      When it was the day on which the Battle of Badr was fought, the Messenger of Allah (may peace be upon him) cast a glance at the infidels, and they were one thousand while his own Companions were three hundred and nineteen. The Holy Prophet (may peace be upon him) turned (his face) towards the Qibla Then he stretched his hands and began his supplication to his Lord:\" O Allah, accomplish for me what Thou hast promised to me. O Allah, bring about what Thou hast promised to me. O Allah, if this small band of Muslims is destroyed. Thou will not be worshipped on this earth.\" He continued his supplication to his Lord, stretching his hands, facing the Qibla, until his mantle slipped down from his shoulders. So Abu Bakr came to him, picked up his mantle and put it on his shoulders. Then he embraced him from behind and said:. Prophet of Allah, this prayer of yours to your Lord will suffice you, and He will fulfil for you what He has promised you. So Allah, the Glorious and Exalted, revealed (the Qur'anic verse):\" When ye appealed to your Lord for help, He responded to your call (saying): I will help you with one thousand angels coming in succession.\" So Allah helped him with angels. Abu Zumail said that the badith was narrated to him by Ibn 'Abbas who said: While on that day a Muslim was chasing a disbeliever who was going ahead of him, he heard over him' the swishing of the whip and the voice of the rider saying: Go ahead, Haizi'm! He glanced at the polytheist who had (now) fallen down on his back. When he looked at him (carefully he found that) there was a scar on his nose and his face was torn as if it had been lashed with a whip, and had turned green with its poison. An Ansari came to the Messenger of Allah (may peace be upon him) and related this (event) to him. He said: You have told the truth. This was the help from the third heaven. The Muslims that day (i. e. the day of the Battle of Badr) killed seventy persons and captured seventy. The Messenger of Allah (may peace be upon him) said to Abu Bakr and 'Umar (Allah be pleased with them): What is your opinion about these captives? Abu Bakr said: They are our kith and kin. I think you should release them after getting from them a ransom. This will be a source of strength to us against the infidels. It is quite possible that Allah may guide them to Islam. Then the Messenger of Allah (may peace be upon him) said: What is your opinion. Ibn Khattab? He said: Messenger of Allah. I do not hold the same opinion as Abu Bakr. I am of the opinion that you should hand them over to us so that we may cut off their heads. Hand over 'Aqil to 'Ali that he may cut off his head, and hand over such and such relative to me that I may but off his head. They are leaders of the disbelievers and veterans among them. The Messenger of Allah (may peace be upon him) approved the opinion of Abu Bakr and did not approve what I said The next day when I came to the Messenger of Allah (may peace be upon him), I found that both he and Abu Bakr were sitting shedding tears. I said: Messenger of Allah, why are you and your Companion shedding tears? Tell me the reason. For I will weep ate, if not, I will at least pretend to weep in sympathy with you. The Messenger of Allah (may peace be upon him) said: I weep for what has happened to your companions for taking ransom (from the prisoners). I was shown the torture to which they were subjected. It was brought to me as close as this tree. (He pointed to a tree close to him.) Then God revealed the verse:\" It is not befitting for a prophet that he should take prisoners until the force of the disbelievers has been crushed...\" to the end of the verse:\" so eat ye the spoils of war, (it is) lawful and pure. So Allah made booty lawful for them.\"",
      "chain": [
        "30480",
        "20025",
        "10704",
        "17",
        "3",
        "30022",
        "20450",
        "10704"
      ]
    },
    {
      "hadith_no": "4719",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، حدثني إياس بن سلمة، حدثني أبي قال، غزونا مع رسول الله صلى الله عليه وسلم حنينا فلما واجهنا العدو تقدمت فأعلو ثنية فاستقبلني رجل من العدو فأرميه بسهم فتوارى عني فما دريت ما صنع ونظرت إلى القوم فإذا هم قد طلعوا من ثنية أخرى فالتقوا هم وصحابة النبي صلى الله عليه وسلم فولى صحابة النبي صلى الله عليه وسلم وأرجع منهزما وعلى بردتان متزرا بإحداهما مرتديا بالأخرى فاستطلق إزاري فجمعتهما جميعا ومررت على رسول الله صلى الله عليه وسلم منهزما وهو على بغلته الشهباء فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأى ابن الأكوع فزعا ‏\"‏ ‏.‏ فلما غشوا رسول الله صلى الله عليه وسلم نزل عن البغلة ثم قبض قبضة من تراب من الأرض ثم استقبل به وجوههم فقال ‏\"‏ شاهت الوجوه ‏\"‏ ‏.‏ فما خلق الله منهم إنسانا إلا ملأ عينيه ترابا بتلك القبضة فولوا مدبرين فهزمهم الله عز وجل وقسم رسول الله صلى الله عليه وسلم غنائمهم بين المسلمين ‏.‏",
      "text_en": " This tradition has been narrated on the authority of Salama who said:                      We fought by the side of the Messenger of Allah (may peace be upon him) at Hunain. When we encountered the enemy, I advanced and ascended a hillock. A man from the enemy side turned towards me and I shot him with an arrow. He (ducked and) hid himself from me. I could not understand what he did, but (all of a sudden) I saw that a group of people appeared from the other hillock. They and the Companions of the Prophet (may peace be upon him) met in combat, but the Companions of the Prophet turned back and I too turned back defeated. I had two mantles, one of which I was wrapping round the waist (covering the lower part of my body) and the other I was putting around my shoulders. My waist-wrapper got loose and I held the two mantles together. (In this downcast condition) I passed by the Messenger of Allah (may peace be upon him) who was riding on his white mule. He said: The son of Akwa' finds himself to be utterly perplexed. Wher. the Companions gathered round him from all sides. the Messenger of Allah (may peace be upon him) got down from his mule. picked up a handful of dust from the ground, threw it into their (enemy) faces and said: May these faces be deformed 1 There was no one among the enemy whose eyes were not filled with the dust from this handful. So they turned back fleeing. and Allah the Exalted and Glorious defeated them, and the Messenger of Allah (may peace be upon him) distributed their booty among the Muslims.",
      "chain": [
        "30022",
        "20450",
        "10704"
      ]
    },
    {
      "hadith_no": "6155",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني أبو معن الرقاشي، زيد بن يزيد أخبرنا عمر بن يونس، حدثنا عكرمة، - وهو ابن عمار - قال قال إسحاق قال أنس كان رسول الله صلى الله عليه وسلم من أحسن الناس خلقا فأرسلني يوما لحاجة فقلت والله لا أذهب ‏.‏ وفي نفسي أن أذهب لما أمرني به نبي الله صلى الله عليه وسلم فخرجت حتى أمر على صبيان وهم يلعبون في السوق فإذا رسول الله صلى الله عليه وسلم قد قبض بقفاى من ورائي - قال - فنظرت إليه وهو يضحك فقال ‏\"‏ يا أنيس أذهبت حيث أمرتك ‏\"‏ ‏.‏ قال قلت نعم أنا أذهب يا رسول الله ‏.‏  قال أنس والله لقد خدمته تسع سنين ما علمته قال لشىء صنعته لم فعلت كذا وكذا أو لشىء تركته هلا فعلت كذا وكذا ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) had the best disposition amongst people. He sent me on an errand one day, and I said:                      By Allah, I would not go. I had, however, this idea in my mind that I would do as Allah's Apostle (may peace be upon him) had commanded me to do. I went out until I happened to come across children who had been playing in the street. In the meanwhile, Allah's Messenger (may peace be upon him) came there and he caught me by the back of my neck from behind me. As I looked towards him I found him smiling and he said: Unais, did you go where I commanded you to go? I said: Allah's Messenger, yes, I am going. Anas further said: I served him for nine years but I know not that he ever said to me about a thing which I had done why I did that, or about a thing I had left as to why I had not done that.",
      "chain": [
        "30432",
        "20450",
        "10704",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "6531",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو معن الرقاشي، حدثنا عمر بن يونس، حدثنا عكرمة، حدثنا إسحاق، حدثنا أنس، قال جاءت بي أمي أم أنس إلى رسول الله صلى الله عليه وسلم وقد أزرتني بنصف خمارها وردتني بنصفه فقالت يا رسول الله هذا أنيس ابني أتيتك به يخدمك فادع الله له ‏.‏ فقال ‏\"‏ اللهم أكثر ماله وولده ‏\"‏ ‏.‏ قال أنس فوالله إن مالي لكثير وإن ولدي وولد ولدي ليتعادون على نحو المائة اليوم ‏.‏",
      "text_en": " Anas reported:                      My mother Umm Anas came to Allah's Messenger (may peace be upon him). And she prepared my lower garment out of the half of her headdress and (with the other half) she covered my upper body and said: Allah's Messenger, here is my son Unais; I have brought him to you for serving you. Invoke blessings of Allah upon him. Thereupon he (the Holy Prophet) said: O Allah, make an increase in his wealth, and progeny. Anas said: By Allah, my fortune is huge and my children, and grand-children are now more than one hundred.",
      "chain": [
        "30432",
        "20450",
        "11023",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "6551",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو الناقد، حدثنا عمر بن يونس اليمامي، حدثنا عكرمة بن عمار، عن  أبي كثير، يزيد بن عبد الرحمن حدثني أبو هريرة، قال كنت أدعو أمي إلى الإسلام وهي مشركة فدعوتها يوما فأسمعتني في رسول الله صلى الله عليه وسلم ما أكره فأتيت رسول الله صلى الله عليه وسلم وأنا أبكي قلت يا رسول الله إني كنت أدعو أمي إلى الإسلام فتأبى على فدعوتها اليوم فأسمعتني فيك ما أكره فادع الله أن يهدي أم أبي هريرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اهد أم أبي هريرة ‏\"‏ ‏.‏ فخرجت مستبشرا بدعوة نبي الله صلى الله عليه وسلم فلما جئت فصرت إلى الباب فإذا هو مجاف فسمعت أمي خشف قدمى فقالت مكانك يا أبا هريرة ‏.‏ وسمعت خضخضة الماء قال - فاغتسلت ولبست درعها وعجلت عن خمارها ففتحت الباب ثم قالت يا أبا هريرة أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله - قال - فرجعت إلى رسول الله صلى الله عليه وسلم فأتيته وأنا أبكي من الفرح - قال - قلت يا رسول الله أبشر قد استجاب الله دعوتك وهدى أم أبي هريرة ‏.‏ فحمد الله وأثنى عليه وقال خيرا - قال - قلت يا رسول الله ادع الله أن يحببني أنا وأمي إلى عباده المؤمنين ويحببهم إلينا - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم حبب عبيدك هذا - يعني أبا هريرة وأمه - إلى عبادك المؤمنين وحبب إليهم المؤمنين ‏\"‏ ‏.‏ فما خلق مؤمن يسمع بي ولا يراني إلا أحبني ‏.‏",
      "text_en": " Abu Huraira reported:                      I invited my mother, who was a polytlieist, to Islam. I invited her one day and she said to me something about Allah's Messenger (may peace be upon him) which I hated. I came to Allah's Messenger (may peace be upon him) weeping and said: Allah's Messenger, I invited my mother to Islam but she did not accept (my invitation). I invited her today but she said to me something which I did not like. (Kindly) supplicate Allah that He may set the mother of Abu Huraira right. Thereupon Allah's Messenger (may peace be upon him) said: O Allah, set the mother of Abu Huraira on the right path. I came out quite pleased with the supplication of Allah's Apostle (may peace be upon him) and when I came near the door it was closed from within. My mother heard the noise of my footsteps and she said: Abu Huraira, just wait, and I heard the noiee of falling of water. She took a bath and put on the shirt and quickly covered her head with a headdress and opened the door and then said: Abu Huraira, I bear witness to the fact that there is no god but Allah and Mubammad is His bondsman and His Messenger. He (Abu Huraira) said: I went back to Allah's Messenger (may peace be upon him) and (this time) I was shedding the tears of joy. I said: Allah's Messenger, be happy, for Allah has responded to your supplication and He has set on the right path the mother of Abu Huraira. He (the Holy Prophet) praised Allah, and extolled Him and uttered good words. I said: Allah's Messenger, supplicate to Allah so that He may instil love of mine and that of my mother too in the believing servants and let our hearts be filled with their love, whereupon Allah's Messenger (may peace be upon him) said: O Allah, let there be love of these servants of yours, i. e. Abu Huraira and his mother, in the hearts of the believing servants and let their hearts be filled with the love of the believing servants. (Abu Huraira said: This prayer) was so well granted by Allah that no believer was ever born who heard of me and who saw me but did not love me.",
      "chain": [
        "30263",
        "20450",
        "10704",
        "13"
      ]
    },
    {
      "hadith_no": "6572",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو معن الرقاشي، حدثنا عمر بن يونس، حدثنا عكرمة، - وهو ابن عمار - حدثنا إسحاق، - وهو ابن عبد الله بن أبي طلحة - أن أنسا، حدثه أن رسول الله صلى الله عليه وسلم استغفر للأنصار - قال - وأحسبه قال ‏\"‏ ولذراري الأنصار ولموالي الأنصار ‏\"‏ ‏.‏ لا أشك فيه ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) sought forgiveness for the Ansar and he said:                      I think (he also sought forgiveness) for the children of the Ansar and the slaves and the freed men of the Ansar. I have no doubt about it.",
      "chain": [
        "30432",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6792",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، وأبو معن الرقاشي - واللفظ لزهير - قالا حدثنا عمر، بن يونس حدثنا عكرمة بن عمار، حدثنا إسحاق بن أبي طلحة، حدثني أنس بن مالك، قال كانت عند أم سليم يتيمة وهي أم أنس فرأى رسول الله صلى الله عليه وسلم اليتيمة فقال ‏\"‏ آنت هيه لقد كبرت لا كبر سنك ‏\"‏ ‏.‏ فرجعت اليتيمة إلى أم سليم تبكي فقالت أم سليم ما لك يا بنية قالت الجارية دعا على نبي الله صلى الله عليه وسلم أن لا يكبر سني فالآن لا يكبر سني أبدا - أو قالت قرني - فخرجت أم سليم مستعجلة تلوث خمارها حتى لقيت رسول الله صلى الله عليه وسلم فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ ما لك يا أم سليم ‏\"‏ ‏.‏ فقالت يا نبي الله أدعوت على يتيمتي قال ‏\"‏ وما ذاك يا أم سليم ‏\"‏ ‏.‏ قالت زعمت أنك دعوت أن لا يكبر سنها ولا يكبر قرنها - قال - فضحك رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا أم سليم أما تعلمين أن شرطي على ربي أني اشترطت على ربي فقلت إنما أنا بشر أرضى كما يرضى البشر وأغضب كما يغضب البشر فأيما أحد دعوت عليه من أمتي بدعوة ليس لها بأهل أن تجعلها له طهورا وزكاة وقربة يقربه بها منه يوم القيامة ‏\"‏ ‏.‏ وقال أبو معن يتيمة ‏.‏ بالتصغير في المواضع الثلاثة من الحديث ‏.‏",
      "text_en": " Anas b. Malik reported that there was an orphan girl with Umm Sulaim (who was the mother of Anas). Allah's Messenger (may peace be upon him) saw that orphan girl and said:                      O, it is you; you have grown young. May you not advance in years! That slave-girl returned to Umm Sulaim weeping. Umm Sulaim said: O daughter, what is the matter with you? She said: Allah's Apostle (may peace be upon him) has invoked curse upon me that I should not grow in age and thus I would never grow in age, or she said, in my (length) of life. Umm Sulaim went out wrapping her head-dress hurriedly until she met Allah's Messenger (may peace be upon him). He said to her: Umm Sulaim, what is the matter with you? She said: Allah's Apostle, you invoked curse upon my orphan girl. He said: Umm Sulaim, what is that? She said: She (the orphan girl) states you have cursed her saying that she might not grow in age or grow in life. Allah's Messenger (may peace be upon him) smiled and then said: Umm Sulaim, don't you know that I have made this term with my Lord. And the term with my Lord is that I said to Him: 1 am a human being and I am pleased just as a human being is pleased and I lose temper just as a human being loses temper, so for any person from amongst my Ummah whom I curse and he in no way deserves it, let that, O Lord, be made a source of purification and purity and nearness to (Allah) on the Day of Resurrection.",
      "chain": [
        "30022",
        "30432",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7136",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن الصباح، وزهير بن حرب، قالا حدثنا عمر بن يونس، حدثنا  عكرمة بن عمار، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثنا أنس بن مالك، - وهو عمه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لله أشد فرحا بتوبة عبده حين يتوب إليه من أحدكم كان على راحلته بأرض فلاة فانفلتت منه وعليها طعامه وشرابه فأيس منها فأتى شجرة فاضطجع في ظلها قد أيس من راحلته فبينا هو كذلك إذا هو بها قائمة عنده فأخذ بخطامها ثم قال من شدة الفرح اللهم أنت عبدي وأنا ربك ‏.‏ أخطأ من شدة الفرح ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      Allah is more pleased with the repentance of a servant as he turns towards Him for repentance than this that one amongst you is upon the camel in a waterless desert and there is upon (that camel) his provision of food and drink also and it is lost by him, and he having lost all hope (to get tbat) lies down in the shadow and is disappointed about his camel and there he finds that camel standing before him. He takes hold of his nosestring and then out of boundless joy says: 0 Lord, Thou art my servant and I am Thine Lord. He commits this mistake out of extreme delight.",
      "chain": [
        "30269",
        "30022",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7183",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وزهير بن حرب، - واللفظ لزهير - قالا حدثنا  عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا شداد، حدثنا أبو أمامة، قال بينما رسول الله صلى الله عليه وسلم في المسجد ونحن قعود معه إذ جاء رجل فقال يا رسول الله إني أصبت حدا فأقمه على ‏.‏ فسكت عنه رسول الله صلى الله عليه وسلم ثم أعاد فقال يا رسول الله إني أصبت حدا فأقمه على ‏.‏ فسكت عنه وأقيمت الصلاة فلما انصرف نبي الله صلى الله عليه وسلم قال أبو أمامة فاتبع الرجل رسول الله صلى الله عليه وسلم حين انصرف واتبعت رسول الله صلى الله عليه وسلم أنظر ما يرد على الرجل فلحق الرجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إني أصبت حدا فأقمه على - قال أبو أمامة - فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت حين خرجت من بيتك أليس قد توضأت فأحسنت الوضوء ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ ثم شهدت الصلاة معنا ‏\"‏ ‏.‏ فقال نعم يا رسول الله ‏.‏ قال فقال له رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد غفر لك حدك - أو قال - ذنبك ‏\"‏ ‏.‏",
      "text_en": " Abu Umama reported:                      We were sitting in the mosque in the company of Allah's Messenger (may peace be upon him). A person came there and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. Allah's Messenger (may peace be upon him) kept silent. He repeated it and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. He (the Holy Prophet) kept silent, and it was at this time that Iqama was pronounced for prayer (and the prayer was observed). And when Allah's Apostle (may peace be upon him) had concluded the payer that person followed Allah's Messenger (may peace be upon him). Abu Umama said: I too followed Allah's Messenger (may peace be upon him) after he had concluded the prayer, so that I should know what answer he would give to that person. That person remained attached to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, I have committed an offence which deserves imposition of hadd upon me, so impose it upon me. Abu Umama reported that Allah's Messenger (may peace be upon him) said to him: Didn't you see that as you got out of the house, you performed ablution perfectly well. He said: Allah's Messenger, of course. I did it. He again said to him: Then you observed prayer along with us. He said: Allah's Messenger, yes, it is so. Thereupon Allah's Messenger (may peace be upon him) said to him: Verily, Allah has exempted you from the imposition of hadd, or he said. From your sin.",
      "chain": [
        "30395",
        "30022",
        "20450",
        "10704",
        "4048"
      ]
    },
    {
      "hadith_no": "767",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن المثنى، حدثنا عمر بن يونس، حدثنا عكرمة، حدثني يحيى بن أبي كثير، حدثني أبو سلمة بن عبد الرحمن بن عوف، سألت عائشة بأى شىء كان نبي الله صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل قالت كان إذا قام من الليل يفتتح صلاته ‏\"‏ اللهم رب جبريل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك أنت تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏",
      "text_en": " Abu Salamah b. ‘Abd al-Rahman b. ‘Awf said:                      I asked ‘A’ishah: By what words the Prophet(ﷺ) used to begin his prayer when he stood up at night (to offer tahajjud prayer). She said: When he stood up at night, he began his prayer by saying: O Allah, Lord of Jibra’il, Lord of Mik’ail, and Lord of Israfil, Creator of the Heavens and the Earth, the Knower of what is seen and of what is unseen; Thou decides between Thy servants in which they used to differ. Guide me to the truth where there is a difference of opinion by Thy permission. Thou guidest anyone Thou wishes to the right path.",
      "chain": [
        "30170",
        "20450",
        "11023",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا عمر بن يونس اليمامي، حدثني محمد بن عبد الله بن طاوس، عن أبيه، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه كان يقول بعد التشهد ‏\"‏ اللهم إني أعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة الدجال وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) used to say after the tashahhud: \"O Allah, I seek refuge in Thee from the punishment in Hell, and I seek refuge in Thee from the punishment in the grave, and I seek refuge in Thee from the trial of antichrist, and I seek refuge in Thee from the trial of life and death.\"",
      "chain": [
        "30569",
        "20450",
        "28521",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عباس العنبري، حدثنا عمر بن يونس، حدثنا ملازم بن عمرو، حدثني موسى بن نجدة، عن جده، يزيد بن عبد الرحمن - وهو أبو كثير - قال حدثني أبو هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من طلب قضاء المسلمين حتى يناله ثم غلب عدله جوره فله الجنة ومن غلب جوره عدله فله النار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone seeks the office of judge among Muslims till he gets it and his justice prevails over his tyranny, he will go to Paradise; but the man whose tyranny prevails over his justice will go to Hell.",
      "chain": [
        "30437",
        "20450",
        "20743",
        "19053",
        "13"
      ]
    },
    {
      "hadith_no": "3598",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن الحسين بن إبراهيم، حدثنا عمر بن يونس، حدثنا عاصم بن محمد بن زيد العمري، حدثني المثنى بن يزيد، عن مطر الوراق، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعناه قال ‏\"‏ ومن أعان على خصومة بظلم فقد باء بغضب من الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) through different chain of narrators to the same effect. In this version he also said:                      \"He who assits in a dispute unjustly deserves the anger of Allah, Most High.",
      "chain": [
        "11045",
        "20450",
        "20163",
        "10719",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4037",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن خالد أبو ثور الكلبي، حدثنا عمر بن يونس بن القاسم اليمامي، حدثنا عكرمة بن عمار، حدثنا أبو زميل، حدثني عبد الله بن عباس، قال لما خرجت الحرورية أتيت عليا - رضى الله عنه - فقال ائت هؤلاء القوم ‏.‏ فلبست أحسن ما يكون من حلل اليمن - قال أبو زميل وكان ابن عباس رجلا جميلا جهيرا - قال ابن عباس فأتيتهم فقالوا مرحبا بك يا ابن عباس ما هذه الحلة قال ما تعيبون على لقد رأيت على رسول الله صلى الله عليه وسلم أحسن ما يكون من الحلل ‏.‏ قال أبو داود اسم أبي زميل سماك بن الوليد الحنفي ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     When the Haruriyyah made a revolt, I came to Ali (may Allah be pleased with him). He said: Go to these people. I then put on the best suit of the Yemen. AbuZumayl (a transmitter) said: Ibn Abbas was handsome and of imposing countenance. Ibn Abbas said: I then came to them and they said: Welcome to you, Ibn Abbas! what is this suit of clothes? I said: Why are you objecting to me? I saw over the Messenger of Allah (ﷺ) the best suit of clothes.Abu Dawud said: The name of Abu Zumail is Sammak b. al-Walid al-Hanafi.",
      "chain": [
        "38072",
        "20450",
        "10704",
        "17"
      ]
    },
    {
      "hadith_no": "4773",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مخلد بن خالد الشعيري، حدثنا عمر بن يونس، حدثنا عكرمة، - يعني ابن عمار - قال حدثني إسحاق، - يعني ابن عبد الله بن أبي طلحة - قال قال أنس كان رسول الله صلى الله عليه وسلم من أحسن الناس خلقا فأرسلني يوما لحاجة فقلت والله لا أذهب ‏.‏ وفي نفسي أن أذهب لما أمرني به نبي الله صلى الله عليه وسلم ‏.‏ قال فخرجت حتى أمر على صبيان وهم يلعبون في السوق فإذا رسول الله صلى الله عليه وسلم قابض بقفاى من ورائي فنظرت إليه وهو يضحك فقال ‏\"‏ يا أنيس اذهب حيث أمرتك ‏\"‏ ‏.‏ قلت نعم أنا أذهب يا رسول الله ‏.‏ قال أنس والله لقد خدمته سبع سنين أو تسع سنين ما علمت قال لشىء صنعت لم فعلت كذا وكذا ‏.‏ ولا لشىء تركت هلا فعلت كذا وكذا ‏.‏",
      "text_en": " ANAS SAID:                      THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) WAS ONE OF THE BEST OF MEN IN CHARACTER. ONE DAY HE SENT ME TO DO SOMETHING, AND I SAID: I SWEAR BY ALLAH THAT I WILL NOT GO. BUT IN MY HEART I FELT THAT I SHOULD GO TO DO WHAT THE  PROPHET OF ALLAH (MAY PEACE BE UPON HIM) HAD COMMANDED ME; SO I WENT OUT AND CAME UPON SOME BOYS WHO WERE PLAYING IN THE STREET. ALL OF A SUDDEN THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) WHO HAD COME UP BEHIND CAUGHT ME BY THE BACK OF THE NECK, AND WHEN I LOOKED AT HIM HE WAS LAUGHING. HE SAID: GO WHERE I ORDERED YOU, LITTLE ANAS. I REPLIED : YES, I AM GOING, APOSTLE OF ALLAH! ANAS SAID: I SWEAR BY ALLAH, I SERVED HIM FOR SEVEN OR NINE YEARS, AND HE NEVER SAID TO ME ABOUT A THING WHICH I HAD DONE: WHY DID YOU DO SUCH AND SUCH? NOR ABOUT A THING WHICH I LEFT: WHY DID NOT DO SUCH AND SUCH?",
      "chain": [
        "30567",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "995",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، عن هشام بن حسان، عن محمد بن سيرين، عن أبي قتادة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ولي أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏ وفيه عن جابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقال ابن المبارك قال سلام بن أبي مطيع في قوله ‏\"‏ وليحسن أحدكم كفن أخيه ‏\"‏ قال هو الصفاق ليس بالمرتفع ‏.‏",
      "text_en": " Abu Qatadah narrated that:                     The Messenger of Allah said: \"When one of you shrouds his brother, then let him use the best of his shrouds.\"",
      "chain": [
        "30160",
        "20450",
        "10704",
        "11311",
        "11035",
        "391"
      ]
    },
    {
      "hadith_no": "2343",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمر بن يونس، - هو اليمامي حدثنا عكرمة بن عمار، حدثنا شداد بن عبد الله، قال سمعت أبا أمامة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يا ابن آدم إنك إن تبذل الفضل خير لك وإن تمسكه شر لك ولا تلام على كفاف وابدأ بمن تعول واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وشداد بن عبد الله يكنى أبا عمار ‏.‏",
      "text_en": " Abu Umamah narrated that the Prophet (s.a.w) said:                     \"O son of Adam! If you give your surplus it is better for you, and if you keep it, it is worse for you, but there is no harm with what is sufficient. And begin(the giving) with your dependents, and the upper hand (giving) is better than the lower hand (receiving).\"",
      "chain": [
        "30160",
        "20450",
        "10704",
        "4048"
      ]
    },
    {
      "hadith_no": "2691",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثني أبو زميل، حدثني ابن عباس، حدثني عمر بن الخطاب، قال استأذنت على رسول الله صلى الله عليه وسلم ثلاثا فأذن لي ‏.‏ قال أبو عيسى هذا حديث حسن غريب وأبو زميل اسمه سماك الحنفي ‏.‏ وإنما أنكر عمر عندنا على أبي موسى حيث روى عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ الاستئذان ثلاث فإن أذن لك وإلا فارجع ‏\"‏ ‏.‏ وقد كان عمر استأذن على النبي صلى الله عليه وسلم ثلاثا فأذن له ولم يكن علم هذا الذي رواه أبو موسى عن النبي صلى الله عليه وسلم أنه قال فإن أذن لك وإلا فارجع ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that Uman bin Al-Khattab said: \"I sought permission (to enter) from the Messenger of Allah (ﷺ) three times, then he permitted me.\"",
      "chain": [
        "30277",
        "20450",
        "10704",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3361",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمر بن يونس اليمامي، حدثنا عكرمة بن عمار، حدثنا أبو زميل، حدثنا عبد الله بن عباس، حدثنا عمر بن الخطاب، قال نظر نبي الله صلى الله عليه وسلم إلى المشركين وهم ألف وأصحابه ثلاثمائة وبضعة عشر رجلا فاستقبل نبي الله صلى الله عليه وسلم القبلة ثم مد يديه وجعل يهتف بربه ‏\"‏ اللهم أنجز لي ما وعدتني اللهم آتني ما وعدتني اللهم إن تهلك هذه العصابة من أهل الإسلام لا تعبد في الأرض ‏\"‏ ‏.‏ فما زال يهتف بربه مادا يديه مستقبل القبلة حتى سقط رداؤه من منكبيه فأتاه أبو بكر فأخذ رداءه فألقاه على منكبيه ثم التزمه من ورائه فقال يا نبي الله كفاك مناشدتك ربك فإنه سينجز لك ما وعدك فأنزل الله ‏:‏ ‏(‏إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين ‏)‏ فأمدهم الله بالملائكة ‏.‏ قال هذا حديث حسن صحيح غريب لا نعرفه من حديث عمر إلا من حديث عكرمة بن عمار عن أبي زميل وأبو زميل اسمه سماك الحنفي وإنما كان هذا يوم بدر ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     from 'Umar bin Al-Khattab, who said: \"The Prophet (ﷺ) looked over the idolaters, and there were a thousand of them, while his Companions were three-hundred and ten and some odd number of men. So the Prophet of Allah (ﷺ) faced the Qiblah, stretched forth his hands and began beseeching his Lord: 'O Allah! Fulfill what You promised for me. [O Allah! Bring about what You promised for me] O Allah! If you destroy this band of adherents to Islam, you will not be worshiped upon the earth,' He continued beseeching his Lord with his hands stretched, facing the Qiblah until his Rida fell from his shoulders. Abu Bakr came to him, took his Rida and placed it back upon his shoulders, then embraced him from behind and said: 'O Prophet of Allah! You have sufficiently beseeched your Lord, indeed He shall fulfill what He promised you.' So Allah, Blessed and Most High, revealed: When you sought help of your Lord and He answered you (saying): 'I will help you with a thousand of the angels in succession (8:9).'",
      "chain": [
        "30160",
        "20450",
        "10704",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3420",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، وغير، واحد، قالوا أخبرنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا يحيى بن أبي كثير، حدثنا أبو سلمة، قال سألت عائشة رضى الله عنها بأى شيء كان النبي صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل قالت كان إذا قام من الليل افتتح صلاته فقال ‏\"‏ اللهم رب جبريل وميكائيل وإسرافيل فاطر السموات والأرض وعالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Salamah said:                     “I asked Aishah [may Allah be pleased with her]: ‘With what did the Prophet used to open his Salat when he stood up in the night?’ She said: ‘When he stood up in the night, he would open his Salat by saying: “O Allah, Lord of Jibra’il, Mika’il, and Israfil; Originator of the heavens and the earth, [and] Knower of the hidden and the seen; You judge between Your slaves concerning that which they used to differ, guide me through that which there has been difference concerning the truth, verily, You are upon a straight path (Allahumma RAbba Jibra’ila Wa Mika’ila Wa Israfil, Fatira-Samawati Wal-Ardi [Wa] Alinal-Ghaibi Wash-Shahadati Anta Tahkumu Baina Ibadika Fima Kanu Fihi Taktalifun, Ihdini Limakhtulifa Fihi Minal-Haqqi Bi’idhnika Innaka Ala Siratin Mustaqim).”",
      "chain": [
        "30221",
        "20450",
        "10704",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3987",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عمر بن يونس، عن عكرمة بن عمار، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم خطب إلى لزق جذع واتخذوا له منبرا فخطب عليه فحن الجذع حنين الناقة فنزل النبي صلى الله عليه وسلم فمسه فسكن ‏.‏ قال أبو عيسى وفي الباب عن أبى وجابر وابن عمر وسهل بن سعد وابن عباس وأم سلمة وحديث أنس حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) used to give Khutbah next to a tree, and then they made a Minbar for him, so he gave Khutbahs on it, so the tree whimpered like a camel. So the Prophet (ﷺ) rubbed it, and it quieted.\"",
      "chain": [
        "30277",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1625",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال أنبأنا عمر بن يونس، قال حدثنا عكرمة بن عمار، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال سألت عائشة بأى شىء كان النبي صلى الله عليه وسلم يفتتح صلاته قالت كان إذا قام من الليل افتتح صلاته قال ‏\"‏ اللهم رب جبريل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اللهم اهدني لما اختلف فيه من الحق إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏",
      "text_en": " Abu Salamah bin 'Abdur-Rahman said:                     \"I asked 'Aishah: 'With what did the Prophet (ﷺ) start his prayer?' She said: 'When he got up to pray at night he would start his prayer with the words: Allahumma Rabba Jibril wa Maika'il wa Israfil; Fatirus-samawati wal-ard, 'alim al-ghaybi wash-shahadah, anta tahkumu bayna 'ibadika fima kanu fihi yakhtalifun, Allahumma ihdini limakktulifa fihi min al-haqq innaka tahdi man tasha'ila siratin mustaqim (O Allah, Lord of Jibril, Mika'il and Israfil, Creator of the heavens and the earth, Knower of the unseen and the seen, You judge between Your slaves concerning wherein they differ. O Allah, guide me to the disputed matters of truth for You are the One Who guides to the Straight Path).\"",
      "chain": [
        "30437",
        "20450",
        "10704",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "4183",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا عمر بن يونس، عن عكرمة بن عمار، عن الهرماس بن زياد، قال مددت يدي إلى النبي صلى الله عليه وسلم وأنا غلام ليبايعني فلم يبايعني ‏.‏",
      "text_en": " It was narrated that Al-Hirmas bin Ziyad said:                     \"I stretched forth my hand to the Prophet for him to accept my pledge, when I was a child, but he did not accept my pledge.\"",
      "chain": [
        "36587",
        "20450",
        "10704",
        "5320"
      ]
    },
    {
      "hadith_no": "1419",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن عمر، حدثنا عمر بن يونس اليمامي، حدثنا عكرمة بن عمار، حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، قال سألت عائشة بما كان يستفتح النبي  صلى الله عليه وسلم  صلاته إذا قام من الليل قالت كان يقول ‏\"‏ اللهم رب جبرئيل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك لتهدي إلى صراط مستقيم ‏\"‏ ‏.‏ قال عبد الرحمن بن عمر احفظوه جبرئيل مهموزة فإنه كذا عن النبي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Abu Salamah bin ‘Abdur-Rahman said:                      “I asked‘Aishah: ‘With what did the Prophet (ﷺ) start his voluntaryprayers?’ She said: ‘He would say: “Allahumma Rabba Jibra’ilwaMika’il wa Israfil, Fatiras-samawati wal-ard, ‘alimal-ghaybiwash-shahadah, Anta tahkumu baina ‘ibadika fima kanu fihiyakhtalifun,ahdini lima akhtulifa fihi minal-haqqi bi ihdnika,innaka latahdi ilasiratin mustaqim (O Allah, Lord of Jibra’il,Mika’il and Israfil,Creator of the heavens and the earth, Knowerof the unseen and theseen, You judge between Your slaves concerningthat wherein theydiffer. Guide me to the disputed matters of truthby Your Leave, forYou are the One Who guides to the straight Path).”",
      "chain": [
        "20450",
        "10704",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "1541",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، عن هشام بن حسان، عن محمد بن سيرين، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا ولي أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah that the Messenger of Allah (ﷺ)said:                      “Ifanyone of you is charged with taking care of his brother(afterdeath), let him shroud him well.”",
      "chain": [
        "30160",
        "20450",
        "10704",
        "11311",
        "11035",
        "391"
      ]
    }
  ],
  "total_hadiths": 36
}