{
  "id": "20451",
  "name": "Anbs'h bin Khalid bin Yazid عنبسة بن خالد بن يزيد",
  "full_name": "Anbs'h bin Khalid bin Yazid عنبسة بن خالد بن يزيد",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "198",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  -  صدوق ]"
    ],
    "tags": [
      "B.Umayya",
      "Client"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ خ  د  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ خ  د  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ خ  د  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "Banu Umayya",
        "ar": "بنو أمية",
        "ckb": "بەنی ئومەیە"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2272",
      "hadith_no": "2272",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثني يونس بن يزيد، قال قال محمد بن مسلم بن شهاب أخبرني عروة بن الزبير، أن عائشة، - رضى الله عنها - زوج النبي صلى الله عليه وسلم أخبرته أن النكاح كان في الجاهلية على أربعة أنحاء فنكاح منها نكاح الناس اليوم يخطب الرجل إلى الرجل وليته فيصدقها ثم ينكحها ونكاح آخر كان الرجل يقول لامرأته إذا طهرت من طمثها أرسلي إلى فلان فاستبضعي منه ويعتزلها زوجها ولا يمسها أبدا حتى يتبين حملها من ذلك الرجل الذي تستبضع منه فإذا تبين حملها أصابها زوجها إن أحب وإنما يفعل ذلك رغبة في نجابة الولد فكان هذا النكاح يسمى نكاح الاستبضاع ونكاح آخر يجتمع الرهط دون العشرة فيدخلون على المرأة كلهم يصيبها فإذا حملت ووضعت ومر ليال بعد أن تضع حملها أرسلت إليهم فلم يستطع رجل منهم أن يمتنع حتى يجتمعوا عندها فتقول لهم قد عرفتم الذي كان من أمركم وقد ولدت وهو ابنك يا فلان فتسمي من أحبت منهم باسمه فيلحق به ولدها ونكاح رابع يجتمع الناس الكثير فيدخلون على المرأة لا تمتنع ممن جاءها وهن البغايا كن ينصبن على أبوابهن رايات يكن علما لمن أرادهن دخل عليهن فإذا حملت فوضعت حملها جمعوا لها ودعوا لهم القافة ثم ألحقوا ولدها بالذي يرون فالتاطه ودعي ابنه لا يمتنع من ذلك فلما بعث الله محمدا صلى الله عليه وسلم هدم نكاح أهل الجاهلية كله إلا نكاح أهل الإسلام اليوم ‏.‏",
      "text_en": " A’ishah wife of the Prophet (ﷺ) said “Marriage in pre Islamic times was of four kinds.” One of them was the marriage contracted by the people today. A man asked another man to marry his relative (sister or daughter) to him. He fixed the dower and married her to him. Another kind of marriage was that a man asked his wife when she became pure from menstruation to send fro so and so and have sexual intercourse with him. Her husband kept himself aloof and did not have intercourse with her till It became apparent that she was pregnant from the man who had intercourse with her. When it was manifest that she was pregnant, her husband approached her if he liked. This marriage was called istibda’(to utilize man for intercourse for a noble birth). A third kind of marriage was that a group of people less than ten in number entered upon a woman and had intercourse with her. When she conceived gave birth to a child and a number of days passed after her delivery, she sent for them. No one of them could refuse to attend and they gathered before her. She said to them “You have realized your affair. I have now given birth to a child. And this is your son.  O so and so. She called the name of anyone of them she liked and the child was attributed to him. A fourth kind of marriage was that many people gathered together and entered upon a woman who did not prevent anyone who came to her. They were prostitutes. They hoisted flags at their doors which served as a sign for the one who intended to enter upon them. When she became pregnant and delivered the child , they got together before her and called for the experts of tracing relationship from physical features. They attributed the child to whom they considered and it was given to him. The child was called his son and he could not deny. When Allah sent Muhammad (ﷺ) as a Prophet, he abolished all kinds of marriages prevalent among the people of the pre Islamic times except of the Muslims practiced today.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20451",
        "20475",
        "167",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2986",
      "hadith_no": "2986",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثنا يونس، عن ابن شهاب، أخبرني علي بن حسين، أن حسين بن علي، أخبره أن علي بن أبي طالب قال كانت لي شارف من نصيبي من المغنم يوم بدر وكان رسول الله صلى الله عليه وسلم أعطاني شارفا من الخمس يومئذ فلما أردت أن أبني بفاطمة بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع أن يرتحل معي فنأتي بإذخر أردت أن أبيعه من الصواغين فأستعين به في وليمة عرسي فبينا أنا أجمع لشارفى متاعا من الأقتاب والغرائر والحبال - وشارفاى مناخان إلى جنب حجرة رجل من الأنصار - أقبلت حين جمعت ما جمعت فإذا بشارفى قد اجتبت أسنمتهما وبقرت خواصرهما وأخذ من أكبادهما فلم أملك عينى حين رأيت ذلك المنظر فقلت من فعل هذا قالوا فعله حمزة بن عبد المطلب وهو في هذا البيت في شرب من الأنصار غنته قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء فوثب إلى السيف فاجتب أسنمتهما وبقر خواصرهما وأخذ من أكبادهما ‏.‏ قال علي فانطلقت حتى أدخل على رسول الله صلى الله عليه وسلم وعنده زيد بن حارثة قال فعرف رسول الله صلى الله عليه وسلم الذي لقيت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لك ‏\"‏ ‏.‏ قال قلت يا رسول الله ما رأيت كاليوم عدا حمزة على ناقتى فاجتب أسنمتهما وبقر خواصرهما وها هو ذا في بيت معه شرب فدعا رسول الله صلى الله عليه وسلم بردائه فارتداه ثم انطلق يمشي واتبعته أنا وزيد بن حارثة حتى جاء البيت الذي فيه حمزة فاستأذن فأذن له فإذا هم شرب فطفق رسول الله صلى الله عليه وسلم يلوم حمزة فيما فعل فإذا حمزة ثمل محمرة عيناه فنظر حمزة إلى رسول الله صلى الله عليه وسلم ثم صعد النظر فنظر إلى ركبتيه ثم صعد النظر فنظر إلى سرته ثم صعد النظر فنظر إلى وجهه ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف رسول الله صلى الله عليه وسلم أنه ثمل فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى فخرج وخرجنا معه ‏.‏",
      "text_en": " ‘Ali bin Abi Talib said “I had an old she Camel that I got as my share from the booty on the day of Badr. The Apostle of Allaah(ﷺ) also gave me an old she camel from the fifth that day. When I intended to cohabit with Fathimah daughter of the Apostle of Allaah(ﷺ), I made arrangement with a man who was a goldsmith belonging to Banu Qainuqa’ to go with me so that we may bring grass. I intended to sell it to the goldsmith there by seeking help in my wedding feast. While I was collecting for my old Camels saddles, baskets and ropes both of she Camels were seated in a corner of the apartment of a man of the Ansar. When I collected what I collected (i.e., equipment) I turned (towards them). I suddenly found that the humps of she Camels were cut off and their hips were pierced and their lives were taken out. I could not control my eyes (to weep) when I saw that scene. I said “Who has done this?” They (the people) replied “Hamzah bin ‘Abd Al Muttalib”. He is among the drunkards of the Ansar in this house. A singing girl is singing for him and his Companions. While singing she said “Oh Hamza, rise to these plumpy old she Camels. So he jumped to the sword and cut off their humps, pierced their hips and took out their livers.” ‘Ali said “I went till I entered upon the Apostle of Allaah(ﷺ) while Zaid bin Harithah was with him.” The Apostle of Allaah(ﷺ) realized what I had met with. The Apostle of Allaah(ﷺ) aid “What is the matter with you?” I said Apostle of Allaah(ﷺ), I never saw the thing that happened with me today. Hamzah wronged my she Camels, he cut off their humps, pierced their hips. Lo! He is in a house with drunkards. The Apostle of Allaah(ﷺ) asked for his cloak. It was brought to him. He then went out, I and Zaid bin Harithah followed him until we reached the house where Hamzah was. He asked permission ( to entre). He was permitted. He found drunkards there. The Apostle of Allaah(ﷺ) began to rebuke him (Hamzah) for his action. Hamzah was intoxicated and his eyes were reddish. Hamzah looked at the Apostle of Allaah(ﷺ). He then raised his eyes and looked at his knees, he then raised his eyes and looked at his navel and he then raised his eyes and looked at his face. Hamzah then said “Are you but the salves of my father? Then the Apostle of Allaah(ﷺ) knew that he was intoxicated. So the Apostle of Allaah(ﷺ) moved backward. He then went out and we also went out with him.”",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11013",
        "11045",
        "20315",
        "5"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3372",
      "hadith_no": "3372",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثني يونس، قال سألت أبا الزناد عن بيع الثمر، قبل أن يبدو، صلاحه وما ذكر في ذلك فقال كان عروة بن الزبير يحدث عن سهل بن أبي حثمة عن زيد بن ثابت قال كان الناس يتبايعون الثمار قبل أن يبدو صلاحها فإذا جد الناس وحضر تقاضيهم قال المبتاع قد أصاب الثمر الدمان وأصابه قشام وأصابه مراض عاهات يحتجون بها فلما كثرت خصومتهم عند النبي صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم كالمشورة يشير بها ‏\"‏ فإما لا فلا تتبايعوا الثمرة حتى يبدو صلاحها ‏\"‏ ‏.‏ لكثرة خصومتهم واختلافهم ‏.‏",
      "text_en": " Yunus said:                      I asked Abu Zinad about the sale of fruits before they were clearly in good condition, and what was said about it. He replied: Urwah ibn az-Zubayr reports a tradition from Sahl ibn Abi Hathmah on the authority of Zayd ibn Thabit who said: The people used to sell fruits before they were clearly in good condition. When the people cut off the fruits, and were demanded to pay the price, the buyer said: The fruits have been smitten by duman, qusham and murad fruit diseases on which they used to dispute. When their disputes which were brought to the Prophet (ﷺ) increased, the Messenger of Allah (ﷺ) said to them as an advice: No, do not sell fruits till they are in good condition, due to a large number of their disputes and differences.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11061",
        "10511",
        "1822",
        "49"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3379",
      "hadith_no": "3379",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثنا يونس، عن ابن شهاب، قال أخبرني عامر بن سعد بن أبي وقاص، أن أبا سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم بمعنى حديث سفيان وعبد الرزاق جميعا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Said al-Khudri through a different chain of narrators from the Messenger of Allah (ﷺ) to the same effect as narrated by both Sufyan and 'Abd al-Razzaq.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11013",
        "10554",
        "38"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 4,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [9th Generation]",
    "ar": "تابع التابعين [الجيل التاسع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
  }
}