{
  "id": "20459",
  "name": "Muhammad bin al-Walid al-Zubaidi محمد بن الوليد بن عامر الزبيدي",
  "full_name": "Muhammad bin al-Walid al-Zubaidi محمد بن الوليد بن عامر الزبيدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "149",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ثبت ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Zubaidi",
      "Judge",
      "B.Zuhrah",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "28671",
      "name": "Abu Bakr bin al-Walid bin 'Amir أبو بكر بن الوليد بن عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10942",
      "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11178",
      "name": "'Amir bin 'Abdullah عامر بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10915",
      "name": "Sulaym bin 'Amir al-Kula'i al-Khaba'ri سليم بن عامر الكلاعي الخبائري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18477",
      "name": "'Amir bin Jshyb عامر بن جشيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18978",
      "name": "Mrwan bin Rwbh al-Tghlby Abu مروان بن روبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18888",
      "name": "Lqman bin 'Amir al-Wsaby لقمان بن عامر الوصابي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10882",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن يزيد بن تميم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10978",
      "name": "Yahya bin Jabir al-Tai'i يحيى بن جابر الطائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19173",
      "name": "Yazid bin Sharih al-Hadrami يزيد بن شريح الحضرمي الحمصي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19199",
      "name": "Yonus bin Syf يونس بن سيف",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20428",
      "name": "Shu'aib bin Abi Hamza شعيب بن أبي حمزة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28671",
      "name": "Abu Bakr bin al-Walid bin 'Amir أبو بكر بن الوليد بن عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20432",
      "name": "'Abdullah bin Salm al-Asha'ri عبد الله بن سالم الأشعري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20454",
      "name": "Muhammad bin Harb al-Khulani محمد بن حرب الخولاني الأبرش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28654",
      "name": "Yman bin Ady al-Hdrmy يمان بن عدي الحضرمي أبو عدي الحمصي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27542",
      "name": "Muhammad bin 'Isa bin al-Qasim محمد بن عيسى بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27049",
      "name": "Yahya bin Sa'id al-Tar يحيى بن سعيد العطار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "77",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن يوسف، قال حدثنا أبو مسهر، قال حدثني محمد بن حرب، حدثني الزبيدي، عن الزهري، عن محمود بن الربيع، قال عقلت من النبي صلى الله عليه وسلم مجة مجها في وجهي وأنا ابن خمس سنين من دلو‏.‏",
      "text_en": " Narrated Mahmud bin Rabi`a:                     When I was a boy of five, I remember, the Prophet took water from a bucket (used far getting water out of a well) with his mouth and threw it on my face.",
      "chain": [
        "30388",
        "30284",
        "30373",
        "20459",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "944",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا حيوة بن شريح، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس  رضى الله عنهما  قال قام النبي صلى الله عليه وسلم وقام الناس معه، فكبر وكبروا معه، وركع وركع ناس منهم، ثم سجد وسجدوا معه، ثم قام للثانية فقام الذين سجدوا وحرسوا إخوانهم، وأتت الطائفة الأخرى فركعوا وسجدوا معه، والناس كلهم في صلاة، ولكن يحرس بعضهم بعضا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet (p.b.u.h) led the fear prayer and the people stood behind him. He said Takbir (Allahu-Akbar) and the people said the same. He bowed and some of them bowed. Then he prostrated and they also prostrated. Then he stood for the second rak`a and those who had prayed the first rak`a left and guarded their brothers. The second party joined him and performed bowing and prostration with him. All the people were in prayer but they were guarding one another during the prayer.",
      "chain": [
        "26010",
        "30373",
        "20459",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2078",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثنا الزبيدي، عن الزهري، عن عبيد الله بن عبد الله، أنه سمع أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ كان تاجر يداين الناس، فإذا رأى معسرا قال لفتيانه تجاوزوا عنه، لعل الله أن يتجاوز عنا، فتجاوز الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There was a merchant who used to lend the people, and whenever his debtor was in straitened circumstances, he would say to his employees, 'Forgive him so that Allah may forgive us.' So, Allah forgave him.\"",
      "chain": [
        "30288",
        "20402",
        "20459",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "3713",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "وقال عبد الله بن سالم عن الزبيدي، قال عبد الرحمن بن القاسم أخبرني القاسم، أن عائشة  رضى الله عنها  قالت شخص بصر النبي صلى الله عليه وسلم ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا، وقص الحديث، قالت فما كانت من خطبتهما من خطبة إلا نفع الله بها، لقد خوف عمر الناس وإن فيهم لنفاقا، فردهم الله بذلك‏.‏ ثم لقد بصر أبو بكر الناس الهدى وعرفهم الحق الذي عليهم وخرجوا به يتلون ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى ‏{‏الشاكرين‏}‏",
      "text_en": " 'Aisha said (in another narration), (\"When the Prophet was on his death-bed) he looked up and said thrice, (Amongst) the Highest Companion (See Qur'an 4.69)' Aisha said, Allah benefited the people by their two speeches. 'Umar frightened the people some of whom were hypocrites whom Allah caused to abandon Islam because of 'Umar's speech. Then Abu Bakr led the people to True Guidance and acquainted them with the right path they were to follow so that they went out reciting:                     -- \"Muhammad is no more than an Apostle and indeed many Apostles have passed away before him..\" (3.144)",
      "chain": [
        "35061",
        "20459",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4285",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "ويذكر عن الزبيدي، عن الزهري، قال أخبرني عنبسة بن سعيد، أنه سمع أبا هريرة، يخبر سعيد بن العاصي قال بعث رسول الله صلى الله عليه وسلم أبان على سرية من المدينة قبل نجد، قال أبو هريرة فقدم أبان وأصحابه على النبي صلى الله عليه وسلم بخيبر، بعد ما افتتحها، وإن حزم خيلهم لليف، قال أبو هريرة قلت يا رسول الله، لا تقسم لهم‏.‏ قال أبان وأنت بهذا يا وبر تحدر من رأس ضأن‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبان اجلس ‏\"‏ فلم يقسم لهم‏.‏",
      "text_en": "",
      "chain": [
        "20459",
        "11013",
        "25221"
      ]
    },
    {
      "hadith_no": "5798",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن خالد، حدثنا محمد بن وهب بن عطية الدمشقي، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، أخبرنا الزهري، عن عروة بن الزبير، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم رأى في بيتها جارية في وجهها سفعة فقال ‏\"‏ استرقوا لها، فإن بها النظرة ‏\"‏‏.‏ وقال عقيل عن الزهري أخبرني عروة عن النبي صلى الله عليه وسلم‏.‏ تابعه عبد الله بن سالم عن الزبيدي‏.‏",
      "text_en": " Narrated Um Salama:                     that the Prophet saw in her house a girl whose face had a black spot. He said. \"She is under the effect of an evil eye; so treat her with a Ruqya.\"",
      "chain": [
        "38496",
        "30287",
        "30373",
        "20459",
        "11013",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "7082",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا خالد بن خلي، حدثنا محمد بن حرب، حدثني الزبيدي، عن الزهري، قال أبو سلمة قال أبو قتادة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ من رآني فقد رأى الحق ‏\"‏‏.‏ تابعه يونس وابن أخي الزهري",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Whoever sees me (in a dream) then he indeed has seen the truth .\"",
      "chain": [
        "30333",
        "30373",
        "20459",
        "11013",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "1197",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ مثل حديث يونس ‏.‏",
      "text_en": " Abu Huraira reported:                      I heard the Messenger of Allah (may peace be upon him) saying a hadith like that of Yunus.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2133",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا حاجب بن الوليد، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، عن الزهري، قال كان كثير بن عباس يحدث أن ابن عباس، كان يحدث عن صلاة، رسول الله صلى الله عليه وسلم يوم كسفت الشمس بمثل ما حدث عروة عن عائشة ‏.‏",
      "text_en": " Zuhri said:                      Kathir b. Abbas used to narrate that Ibn 'Abbas used to relate about the prayer of the Messenger of Allah (may peace be upon him) in regard to the eclipse of the sun like that what was narrated by 'Urwa on the authority of 'A'isha.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "17"
      ]
    },
    {
      "hadith_no": "3442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا عيسى بن المنذر الحمصي، حدثنا محمد بن، حرب حدثنا الزبيدي، عن الزهري، عن أبي سلمة بن عبد الرحمن، وأبي عبد الله الأغر، مولى الجهنيين - وكان من أصحاب أبي هريرة - أنهما سمعا أبا هريرة يقول صلاة في مسجد رسول الله صلى الله عليه وسلم أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام فإن رسول الله صلى الله عليه وسلم آخر الأنبياء وإن مسجده آخر المساجد ‏.‏ قال أبو سلمة وأبو عبد الله لم نشك أن أبا هريرة كان يقول عن حديث رسول الله صلى الله عليه وسلم فمنعنا ذلك أن نستثبت أبا هريرة عن ذلك الحديث حتى إذا توفي أبو هريرة تذاكرنا ذلك وتلاومنا أن لا نكون كلمنا أبا هريرة في ذلك حتى يسنده إلى رسول الله صلى الله عليه وسلم إن كان سمعه منه فبينا نحن على ذلك جالسنا عبد الله بن إبراهيم بن قارظ فذكرنا ذلك الحديث والذي فرطنا فيه من نص أبي هريرة عنه فقال لنا عبد الله بن إبراهيم أشهد أني سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ فإني آخر الأنبياء وإن مسجدي آخر المساجد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      Prayer in the mosque of Allah's Messenger (may peace be upon him) is more excellent than a thousand prayers in other mosques except the Masjid al-Haram, for Allah's Messenger (may peace be upon him) is the last of the Apostles, and his mosque is the last of the mosques. Abu Salama and Abu Abdullah (two of the narrators in this chain of narrations said: We had no doubt that what Abu Haraira (Allah be pleased with him) had said was from Allah's Messenger (may peace be upon him), and so we did not like to get an attestation from Abu Huraira about this hadith until Abu Huraira (Allah be pleased with him) died. We discussed it (the issue of getting attestation from Abu Huraira) amongst ourselves and blamed one another as to why we did not talk about it to Abu Huraira regarding it so that he could attribute its transmission to Allah's Messenger (may peace be upon him) in case he had heard It from him. While we were discussing it as we sat with 'Abdullah b. Ibrahlm b. Qariz; we made a mention of this hadith, and our omission (in getting its attestation) about its direct transmission by Abu Huraira from him (the Holy Proohet) ; thereupon Abdullah b. Ibrahim said to us: I bear witness to the fact that I heard Abu Huraira (Allah be pleased with him) say that Allah's Messenger (may peace be upon him) said: I am the last of the Apostles and my mosque is the last of the mosques.",
      "chain": [
        "30313",
        "30558",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3587",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني إسحاق بن منصور، حدثني عيسى بن المنذر، حدثنا بقية، حدثنا الزبيدي، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من دعي إلى عرس أو نحوه فليجب ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleated with them) reported Allah's Messenger (may peace be upon him) having said:                      He who is invited to a wedding feast or like it, he should accept it.",
      "chain": [
        "30313",
        "20644",
        "20459",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنيه إسحاق بن منصور، أخبرنا يزيد بن عبد ربه، حدثنا محمد بن حرب، حدثني الزبيدي، عن الزهري، بهذا الإسناد غير أنه قال قال ابن عمر فراجعتها وحسبت لها التطليقة التي طلقتها ‏.‏",
      "text_en": "  A hadith like this was reported on the authority of Zuhri with the same chain of narrators. Ibn Umar (Allah be pleased with them), however, said:                      I took her back, and counted this pronouncement of divorce (as valid) with which I divorced her.",
      "chain": [
        "30572",
        "30373",
        "20459"
      ]
    },
    {
      "hadith_no": "4994",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن محمد بن الوليد الزبيدي، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري، أن رجلا، أتى النبي صلى الله عليه وسلم فقال أى الناس أفضل فقال ‏\"‏ رجل يجاهد في سبيل الله بماله ونفسه ‏\"‏ قال ثم من قال ‏\"‏ مؤمن في شعب من الشعاب يعبد الله ربه ويدع الناس من شره ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Sa'id Khudri that a man came to the Holy Prophet (may peace he upon him) and said:                      Who is the best of men? He replied: A man who fights in the way of Allah spending his wealth and staking his life. The man then asked: Who is next to him (in excellence)? He said: Next to him is a believer who lives in a mountain gorge worshipping hid Lord and sparing men from his mischief.",
      "chain": [
        "30523",
        "20402",
        "20459",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "5225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا أبو مسهر، حدثنا يحيى بن حمزة، حدثني  الزبيدي، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن ثوبان، مولى رسول الله صلى الله عليه وسلم قال قال لي رسول الله صلى الله عليه وسلم في حجة الوداع ‏\"‏ أصلح هذا اللحم ‏\"‏ ‏.‏ قال فأصلحته فلم يزل يأكل منه حتى بلغ المدينة ‏.‏  وحدثنيه عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن المبارك، حدثنا يحيى، بن حمزة بهذا الإسناد ولم يقل في حجة الوداع ‏.‏",
      "text_en": " Thauban, the freed slave of Allah's Messenger (may peace be upon him), reported:                      Allah's Messenger (may peace be upon him) said to me on the occasion of Hajjat-al-Wada' (the Farewell Pilgrimage): Make the flesh usable. So I made it usable (for him) and he ate it constantly until he reached Medina. This hadith has been narrated on the authority of Yabya b. Hamza with the same chain of transmitters, but he did not say: On the occasion of Hajjat-al-Wada'.",
      "chain": [
        "30313",
        "30284",
        "20402",
        "20459",
        "10942"
      ]
    },
    {
      "hadith_no": "5854",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود حدثنا محمد بن حرب، حدثني محمد بن الوليد، الزبيدي عن الزهري، عن عروة بن الزبير، عن زينب بنت أم سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال لجارية في بيت أم سلمة زوج النبي صلى الله عليه وسلم رأى بوجهها سفعة فقال ‏\"‏ بها نظرة فاسترقوا لها ‏\"‏ ‏.‏ يعني بوجهها صفرة ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) said to a small girl in the house of Umm Salama that he had been seeing on her face black stains and told her that that was due to the infiluence of an evil eye, and he asked that she should be cured with the help of incantation (hoping) that her face should become spotles.",
      "chain": [
        "30137",
        "30373",
        "20459",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "5962",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني  سالم بن عبد الله، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يأمر بقتل الكلاب يقول ‏\"‏ اقتلوا الحيات والكلاب واقتلوا ذا الطفيتين والأبتر فإنهما يلتمسان البصر ويستسقطان الحبالى ‏\"‏ ‏.‏ قال الزهري ونرى ذلك من سميهما والله أعلم ‏.‏ قال سالم قال عبد الله بن عمر فلبثت لا أترك حية أراها إلا قتلتها فبينا أنا أطارد حية يوما من ذوات البيوت مر بي زيد بن الخطاب أو أبو لبابة وأنا أطاردها فقال مهلا يا عبد الله ‏.‏ فقلت إن رسول الله صلى الله عليه وسلم أمر بقتلهن ‏.‏ قال إن رسول الله صلى الله عليه وسلم قد نهى عن ذوات البيوت ‏.‏  وحدثنيه حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا عبد بن، حميد أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا حسن الحلواني، حدثنا يعقوب، حدثنا  أبي، عن صالح، كلهم عن الزهري، بهذا الإسناد غير أن صالحا، قال حتى رآني أبو لبابة بن عبد المنذر وزيد بن الخطاب فقالا إنه قد نهى عن ذوات البيوت ‏.‏ وفي حديث يونس ‏\"‏ اقتلوا الحيات ‏\"‏ ‏.‏ ولم يقل ‏\"‏ ذا الطفيتين والأبتر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I heard Allah's Messenger (may peace be upon him) commanding the killing of dogs and the killing of the striped and the short-tailed snakes, for both of them affect the eyesight adversely and cause miscarriage. Zuhri said: We thought of their poison (the pernicious effects of these two). Allah, however, knows best. 'Abdullah b. 'Umar said: I did not spare any snake. I rather killed everyone that I saw. One day as I was pursuing a snake from amongst the snakes of the house, Zaid b. Khattab or Abu Lubaba happened to pass by me and found me pursuing it. He said: 'Abdullah, wait. I said: Allah's Messenger (may peace be upon him) commanded (us) to kill them, whereupon he said that Allah's Messenger (may peace be upon him) forbade the killing of the snakes of the houses. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6065",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، أخبرني الزهري، عن عبيد الله بن عبد الله، أن ابن عباس، أو أبا هريرة كان يحدث أن رجلا، أتى رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "6691",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، عن الزهري، أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ح",
      "text_en": " Anas b. Malik reported Allah's Messenger (may peace be upon him) as saying like this. This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "6698",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا  سفيان، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا حاجب، بن الوليد حدثنا محمد بن حرب، عن الزبيدي، ح وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد، بن رافع وعبد بن حميد عن عبد الرزاق، عن معمر، كلهم عن الزهري، بإسناد مالك ومثل حديثه إلا قوله ‏\"‏ فيعرض هذا ويعرض هذا ‏\"‏ ‏.‏ فإنهم جميعا قالوا في حديثهم غير مالك ‏\"‏ فيصد هذا ويصد هذا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri with a slight variation of wording (and the words are):                     \" The one turning away and the other turning away when they meet and one avoids the other and the other also avoids him.\"",
      "chain": [
        "30367",
        "20005",
        "30487",
        "20029",
        "20475",
        "30373",
        "20459",
        "30021",
        "30375",
        "20121"
      ]
    },
    {
      "hadith_no": "6810",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني  حميد بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس الشديد بالصرعة ‏\"‏ ‏.‏ قالوا فالشديد أيم هو يا رسول الله قال ‏\"‏ الذي يملك نفسه عند الغضب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      I heard Allah's Messenger (may peace be upon him) as saying: One is not strong because of one's wrestling skillfully. They said: Allah's Messenger, then who is strong? He said: He who controls his anger when he is in a fit of rage.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "6926",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني  سعيد بن المسيب، عن أبي هريرة، أنه كان يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مولود إلا يولد على الفطرة فأبواه يهودانه وينصرانه ويمجسانه كما تنتج البهيمة بهيمة جمعاء هل تحسون فيها من جدعاء ‏\"‏ ‏.‏ ثم يقول أبو هريرة واقرءوا إن شئتم ‏{‏ فطرة الله التي فطر الناس عليها لا تبديل لخلق الله‏}‏ الآية ‏.‏",
      "text_en": " There is none born but is created to his true nature (Islam). It is his parents who make him a Jew or a Christian or a Magian quite as beasts produce their young with their limbs perfect. Do you see anything deficient in them? Then he quoted the Qur'an., The nature made by Allah in which He has created men there is no altering of Allah's creation; that is the right religion\" (xxx. 33)",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "7159",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود حدثنا محمد بن حرب، حدثني الزبيدي، قال الزهري حدثني حميد بن عبد الرحمن بن عوف، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسرف عبد على نفسه ‏\"‏ ‏.‏ بنحو حديث معمر إلى قوله ‏\"‏ فغفر الله له ‏\"‏ ‏.‏ ولم يذكر حديث المرأة في قصة الهرة وفي حديث الزبيدي قال ‏\"‏ فقال الله عز وجل لكل شىء أخذ منه شيئا أد ما أخذت منه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying that a servant transgressed the litnit in committing sins. The rest of the hadith is the same but there is no mention of the story of the cat in it and in the hadith transmitted on the authority of Ziibaidl (the words are):                     \" Allah, the Exalted and Glorious, said to everything which had taken a part of lies ashes to return what it had taken.\"",
      "chain": [
        "30137",
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، حدثنا الزبيدي، ح وحدثنا عياش بن الأزرق، أخبرنا ابن وهب، عن يونس، ح وحدثنا مخلد بن خالد، حدثنا إبراهيم بن خالد، - إمام مسجد صنعاء - حدثنا رباح، عن معمر، ح وحدثنا مؤمل بن الفضل، حدثنا الوليد، عن الأوزاعي، كلهم عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة وصف الناس صفوفهم فخرج رسول الله صلى الله عليه وسلم حتى إذا قام في مقامه ذكر أنه لم يغتسل فقال للناس ‏\"‏ مكانكم ‏\"‏ ‏.‏ ثم رجع إلى بيته فخرج علينا ينطف رأسه وقد اغتسل ونحن صفوف ‏.‏ وهذا لفظ ابن حرب وقال عياش في حديثه فلم نزل قياما ننتظره حتى خرج علينا وقد اغتسل ‏.‏",
      "text_en": " Abu Hurairah reported:                      The prayer (in congregation) began and people stood in their rows. The Messenger of Allah (May peace be upon him) came out (from his residence). When he stood at his proper place he recalled that he did not take a bath. He then said to the people: (Remain standing) at your places. Then he returned to his house and came out upon us after taking a bath while the drops of water were coming down from his head. We were standing in the rows (of prayer). This is the version of Ibn Harb. ‘Ayyash reported in his version: we kept on waiting for him while we were standing until he came upon us after he had taken a bath.",
      "chain": [
        "10581",
        "30373",
        "20459",
        "20029",
        "20475",
        "30567",
        "38072",
        "20115",
        "38659",
        "20733",
        "20024",
        "11013",
        "10567"
      ]
    },
    {
      "hadith_no": "387",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، حدثنا محمد، - يعني ابن عائذ - حدثني يحيى، - يعني ابن حمزة - عن الأوزاعي، عن محمد بن الوليد، أخبرني أيضا، سعيد بن أبي سعيد عن القعقاع بن حكيم، عن عائشة، عن رسول الله صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " 'Aishah reported a similar tradition from the Messenger of Allah (ﷺ).",
      "chain": [
        "37534",
        "37529",
        "20402",
        "20024",
        "20459",
        "11168",
        "10612",
        "53"
      ]
    },
    {
      "hadith_no": "655",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، وشعيب بن إسحاق، عن الأوزاعي، حدثني محمد بن الوليد، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فخلع نعليه فلا يؤذ بهما أحدا ليجعلهما بين رجليه أو ليصل فيهما ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when any of you prays and takes off his sandals, he should not harm anyone by them. He should place them between his feet or pray with them on",
      "chain": [
        "38363",
        "20644",
        "20239",
        "20024",
        "20459",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، حدثنا الزبيدي، عن الزهري، عن سالم، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة رفع يديه حتى تكونا حذو منكبيه ثم كبر وهما كذلك فيركع ثم إذا أراد أن يرفع صلبه رفعهما حتى تكونا حذو منكبيه ثم قال سمع الله لمن حمده ولا يرفع يديه في السجود ويرفعهما في كل تكبيرة يكبرها قبل الركوع حتى تنقضي صلاته ‏.‏",
      "text_en": " ‘Abd Allah b. Umar said:                      The Messenger of Allah (ﷺ) used to raise his hands opposite his shoulders when he began prayer, then he uttered takbir (Allah is most great) in the same condition, and then he bowed. And when he raised his back (head) after bowing he raised them opposite his shoulders, and said: “Allah listens to him who praises Him.” But he did not raise his hand when he prostrated himself; he rather raised them when he uttered the takbir (Allah is most great) before bowing until his prayer is finished.",
      "chain": [
        "20644",
        "20459",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1163",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عوف، قال قرأت في كتاب عمرو بن الحارث - يعني الحمصي - عن عبد الله بن سالم، عن الزبيدي، عن محمد بن مسلم، بهذا الحديث بإسناده لم يذكر الصلاة قال وحول رداءه فجعل عطافه الأيمن على عاتقه الأيسر وجعل عطافه الأيسر على عاتقه الأيمن ثم دعا الله عز وجل ‏.‏",
      "text_en": " The above-mentioned tradition has also been transmitted by Muhammad b. Muslim through a different chain of narrators.  But there is no mention of prayer in this version. The version adds:                      \"He turned around his cloak, putting its right side on his left shoulder and its left side on his right shoulder.  Thereafter he made supplication to Allah.\"",
      "chain": [
        "38566",
        "28443",
        "20432",
        "20459",
        "11013",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1582",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يونس النسائي، حدثنا روح، حدثنا زكرياء بن إسحاق، بإسناده بهذا الحديث قال مسلم بن شعبة ‏.‏ قال فيه والشافع التي في بطنها الولد ‏.‏ قال أبو داود وقرأت في كتاب عبد الله بن سالم بحمص عند آل عمرو بن الحارث الحمصي عن الزبيدي قال وأخبرني يحيى بن جابر عن جبير بن نفير عن عبد الله بن معاوية الغاضري - من غاضرة قيس - قال قال النبي صلى الله عليه وسلم ‏\"‏ ثلاث من فعلهن فقد طعم طعم الإيمان من عبد الله وحده وأنه لا إله إلا الله وأعطى زكاة ماله طيبة بها نفسه رافدة عليه كل عام ولا يعطي الهرمة ولا الدرنة ولا المريضة ولا الشرط اللئيمة ولكن من وسط أموالكم فإن الله لم يسألكم خيره ولم يأمركم بشره ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been narrated by Zakariyya bin Ishaq through his chain of narrators. In this version Mulsim bin Shu'bah said:                      Shafi' means a goat which has a baby in its womb.Abu Dawud said: I read in a document possessed by Abdullah ibn Salim at Hims: Abdullah ibn Mu'awiyah al-Ghadiri reported the Prophet (ﷺ) as saying: He who performs three things will have the taste of the faith. (They are:) One who worships Allah alone and one believes that there is no god but Allah; and one who pays the zakat on his property agreeably every year. One should not give an aged animal, nor one suffering from itch or ailing, and one most condemned, but one should give animals of medium quality, for Allah did not demand from you the best of your animals, nor did He command you to give the animals of worst quality.",
      "chain": [
        "38623",
        "20229",
        "11244",
        "30002",
        "20459",
        "10978",
        "4097"
      ]
    },
    {
      "hadith_no": "2723",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، قال حدثنا إسماعيل بن عياش، عن محمد بن الوليد الزبيدي، عن الزهري، أن عنبسة بن سعيد، أخبره أنه، سمع أبا هريرة، يحدث سعيد بن العاص أن رسول الله صلى الله عليه وسلم بعث أبان بن سعيد بن العاص على سرية من المدينة قبل نجد فقدم أبان بن سعيد وأصحابه على رسول الله صلى الله عليه وسلم بخيبر بعد أن فتحها وإن حزم خيلهم ليف فقال أبان اقسم لنا يا رسول الله ‏.‏ قال أبو هريرة فقلت لا تقسم لهم يا رسول الله ‏.‏ فقال أبان أنت بها يا وبر تحدر علينا من رأس ضال ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اجلس يا أبان ‏\"‏ ‏.‏ ولم يقسم لهم رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Sa'id ibn al-'As:                     The Messenger of Allah (ﷺ) sent AbuSa'id ibn al-'As with an expedition from Medina towards Najd. Aban ibn Sa'id and his companions came to the Messenger of Allah (ﷺ) at Khaybar after it had been captured. The girths of their horses were made of palm fibres. Aban said: Give us a share (from the booty), Messenger of Allah. AbuHurayrah said: I said: Do not give them a share, Messenger of Allah. Aban said: Why are you talking so, Wabr. You have come to us from the peak of Dal. The Prophet (ﷺ) said: Sit down, Aban. The Messenger of Allah (ﷺ) did not give any share to them (from the booty).",
      "chain": [
        "30116",
        "20736",
        "20459",
        "11013",
        "25221",
        "13",
        "989"
      ]
    },
    {
      "hadith_no": "2856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا محمد بن حرب، ح وحدثنا محمد بن المصفى، حدثنا بقية، عن الزبيدي، حدثنا يونس بن سيف، حدثنا أبو إدريس الخولاني، حدثني أبو ثعلبة الخشني، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ثعلبة كل ما ردت عليك قوسك وكلبك ‏\"‏ ‏.‏ زاد عن ابن حرب ‏\"‏ المعلم ويدك فكل ذكيا وغير ذكي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said to me: AbuTha'labah, eat what returns to you by your bow and your dog.  Ibn Harb's version adds: \"The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered\".",
      "chain": [
        "30373",
        "20644",
        "20459",
        "19199",
        "11027"
      ]
    },
    {
      "hadith_no": "3320",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المتوكل، حدثنا عبد الرزاق، قال أخبرني معمر، عن الزهري، قال أخبرني ابن كعب بن مالك، قال ‏:‏ كان أبو لبابة، فذكر معناه والقصة لأبي لبابة ‏.‏ قال أبو داود ‏:‏ رواه يونس عن ابن شهاب عن بعض بني السائب بن أبي لبابة، ورواه الزبيدي عن الزهري عن حسين بن السائب بن أبي لبابة مثله ‏.‏",
      "text_en": " This tradition has also been transmitted by Ibn Ka'b b. Malik through a different chain of narrators. This version has:                      \"He then mentioned the tradition to the same effect. This versions attributes this story to Abu Lubabah.\"Abu Dawud said: This tradition has been narrated by Yunus from Ibn Shihab from some of the children of al-Sa'ib son of Abu Lubabah. A similar tradition has also been transmitted by al-Zabidi from al-Zuhri from Husain b. al-Sa'ib son of Abu Lubabah.",
      "chain": [
        "20121",
        "20115",
        "11013",
        "20475",
        "11013",
        "20459",
        "11013"
      ]
    },
    {
      "hadith_no": "3522",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا عبد الله بن عبد الجبار، - يعني الخبائري - حدثنا إسماعيل، - يعني ابن عياش - عن الزبيدي، - قال أبو داود وهو محمد بن الوليد أبو الهذيل الحمصي - عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه قال ‏\"‏ فإن كان قضاه من ثمنها شيئا فما بقي فهو أسوة الغرماء وأيما امرئ هلك وعنده متاع امرئ بعينه اقتضى منه شيئا أو لم يقتض فهو أسوة الغرماء ‏\"‏ ‏.‏ قال أبو داود حديث مالك أصح ‏.‏",
      "text_en": " A similar tradition (to the No. 3513) has been transmitted by AbuHurayrah from the Prophet (ﷺ). This version has:                      If he paid something from its price, then he will be equal to the creditors in the remaining price. If a man dies and he has the very property of a man (i.e. seller), he is equal to the creditors whether he (the buyer) pays him (the price) or not.Abu Dawud said: Malik's version of this tradition is sounder.",
      "chain": [
        "38566",
        "28292",
        "20736",
        "20459",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "3739",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، حدثنا الزبيدي، عن نافع، بإسناد أيوب ومعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Nafi’ to the same effect through the chain of narrators as mentioned in Ayyub.",
      "chain": [
        "20644",
        "20459"
      ]
    },
    {
      "hadith_no": "3804",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا محمد بن حرب، عن الزبيدي، عن مروان بن رؤبة التغلبي، عن عبد الرحمن بن أبي عوف، عن المقدام بن معديكرب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا لا يحل ذو ناب من السباع ولا الحمار الأهلي ولا اللقطة من مال معاهد إلا أن يستغني عنها وأيما رجل ضاف قوما فلم يقروه فإن له أن يعقبهم بمثل قراه ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib:                     The Prophet (ﷺ) said: Beware, the fanged beast of prey is not lawful, nor the domestic asses, nor the find from the property of a man with whom treaty has been concluded, except that he did not need it. If anyone is a guest of people who provide no hospitality for him, he is entitled to take from them the equivalent of the hospitality due to him.",
      "chain": [
        "30373",
        "20459",
        "18639"
      ]
    },
    {
      "hadith_no": "3899",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، حدثني الزبيدي، عن الزهري، عن طارق، - يعني ابن مخاشن - عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بلديغ لدغته عقرب قال فقال ‏\"‏ لو قال أعوذ بكلمات الله التامة من شر ما خلق لم يلدغ ‏\"‏ ‏.‏ أو ‏\"‏ لم تضره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     A man who was stung by a scorpion was brought to the Prophet (ﷺ). He said: Had he said the word: \"I seek refuge in the perfect words of Allah from the evil of what He created, \"he would not have been stung, or he said, \"It would not have harmed him.\"",
      "chain": [
        "26010",
        "20644",
        "20459",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد الحمصيان، قالا حدثنا بقية، عن الزبيدي، عن الزهري، عن أنس بن مالك، أنه حدثه أنه، رأى على أم كلثوم بنت رسول الله صلى الله عليه وسلم بردا سيراء ‏.‏ قال والسيراء المضلع بالقز ‏.‏",
      "text_en": " Anas b. Malik said that he saw a striped garment over Umm Kulthum, daughter of the Messenger of Allah (ﷺ). He said:                      The word \"siyara\" means striped with silk.",
      "chain": [
        "10581",
        "38462",
        "20644",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4636",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، عن الزبيدي، عن ابن شهاب، عن عمرو بن أبان بن عثمان، عن جابر بن عبد الله، أنه كان يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أري الليلة رجل صالح أن أبا بكر نيط برسول الله صلى الله عليه وسلم ونيط عمر بأبي بكر ونيط عثمان بعمر ‏\"‏ ‏.‏ قال جابر فلما قمنا من عند رسول الله صلى الله عليه وسلم قلنا أما الرجل الصالح فرسول الله صلى الله عليه وسلم وأما تنوط بعضهم ببعض فهم ولاة هذا الأمر الذي بعث الله به نبيه صلى الله عليه وسلم ‏.‏ قال أبو داود ورواه يونس وشعيب لم يذكرا عمرا ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as saying:                      Last night a good man had a vision in which Abu Bakr seemed to be joined to the Messenger of Allah (ﷺ). ‘Umar to Abu Bakr, and ‘Uthman to ‘Umar. Jabir said: When we got up and left the Messenger of Allah (ﷺ), we said: The good man is the Messenger of Allah (ﷺ), and that their being joined together means that they are the rulers over this matter with which Allah has sent His Prophet (ﷺ).Abu Dawud said: It has been transmitted by Yunus and Shu’aib, but they did not mention ‘Amr b. Aban.",
      "chain": [
        "10581",
        "30373",
        "20459",
        "11013",
        "34"
      ]
    },
    {
      "hadith_no": "56",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، عن عمر بن عبد الواحد، عن الأوزاعي، عن محمد بن الوليد، عن الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، قال قام أعرابي فبال في المسجد فتناوله الناس فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ دعوه وأهريقوا على بوله دلوا من ماء فإنما بعثتم ميسرين ولم تبعثوا معسرين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A Bedouin stood up and urinated in the Masjid, ans the people started shouting. The Messenger of Allah (ﷺ) said to them: 'Leave him alone, and spill a bucket of water over his urine. For you have been sent to make things easy for people, you have not been sent to make things difficult.'\"",
      "chain": [
        "30285",
        "27536",
        "20024",
        "20459",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هشام بن عبد الملك، قال حدثنا محمد، - يعني ابن حرب - قال حدثني الزبيدي، عن الزهري، أن عمر بن عبد العزيز، أخبره أن عبد الله بن قارظ أخبره أن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11010",
        "13"
      ]
    },
    {
      "hadith_no": "180",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هشام بن عبد الملك، قال حدثنا محمد، قال حدثنا الزبيدي، قال أخبرني الزهري، أن عبد الملك بن أبي بكر، أخبره أن خارجة بن زيد بن ثابت أخبره أن زيد بن ثابت قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Thabit said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30213",
        "20459",
        "11013",
        "11006",
        "49"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هشام بن عبد الملك، قال حدثنا ابن حرب، قال حدثنا الزبيدي، عن الزهري، أن أبا سلمة بن عبد الرحمن، أخبره عن أبي سفيان بن سعيد بن الأخنس بن شريق، أنه أخبره أنه، دخل على أم حبيبة زوج النبي صلى الله عليه وسلم وهي خالته فسقته سويقا ثم قالت له توضأ يا ابن أختي فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sufyan bin Sa'eed bin Al-Akhnas bin Shariq that he entered upon Umm Habibah, the wife of the Prophet (ﷺ), who was his maternal aunt, and she made Sawiq for him, then she said to him:                      \"Perform Wudu' O son of my sister! For the Messenger of Allah (ﷺ) said: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "20459",
        "11013",
        "10567"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا كثير بن عبيد، عن محمد بن حرب، عن الزبيدي، عن الزهري، عن عروة، أن عائشة، أخبرته أن أم سليم كلمت رسول الله صلى الله عليه وسلم وعائشة جالسة فقالت له يا رسول الله إن الله لا يستحيي من الحق أرأيت المرأة ترى في النوم ما يرى الرجل أفتغتسل من ذلك فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قالت عائشة فقلت لها أف لك أوترى المرأة ذلك فالتفت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ تربت يمينك فمن أين يكون الشبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Urwah that 'Aishah told him that Umm Sulaim spoke to the Messenger of Allah (ﷺ) when 'Aishah was sitting there. She said to him:                      \"O Messenger of Allah! Allah is not shy to tell the truth. Inform me: if a women sees in a dream what men see should she perform Ghusl from that?\" The Messenger of Allah (ﷺ) said to her: \"Yes.\" 'Aishah said: \"I expressed my displeasure and said: 'Does a woman see that?' The Messenger of Allah (ﷺ) turned to me and said: 'May your right hand be covered with dust! How else would (her child) resemble her?'\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "330",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، عن عمر بن عبد الواحد، عن الأوزاعي، عن محمد بن الوليد، عن الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، قال قام أعرابي فبال في المسجد فتناوله الناس فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ دعوه وأهريقوا على بوله دلوا من ماء فإنما بعثتم ميسرين ولم تبعثوا معسرين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A Bedouin stood up and urinated in the Masjid, so the people grabbed him. The Messenger of Allah (ﷺ) said to them: 'Leave him alone, and pour a bucket of water over his urine. For you have been sent to make things easy for people, you have not been sent to make things difficult.'\"",
      "chain": [
        "30285",
        "27536",
        "20024",
        "20459",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تفضل صلاة الجمع على صلاة أحدكم وحده بخمسة وعشرين جزءا ويجتمع ملائكة الليل والنهار في صلاة الفجر واقرءوا إن شئتم ‏{‏ وقرآن الفجر إن قرآن الفجر كان مشهودا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Prayer in congregation is twenty-five times more virtuous than the prayer of any one of you offered on his own. The angels of the night and the day meet at Fajr prayer. Recite if you wish: Verily, the recitation of the Qur'an in the early dawn is ever witnessed.\"[1][1]Al-Isra' 17:78.",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "500",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، قال أخبرني أنس، أن رسول الله صلى الله عليه وسلم خرج حين زاغت الشمس فصلى بهم صلاة الظهر ‏.‏",
      "text_en": " It was narrated from Az-Zuhri he said:                      \"Anas told me that the Messenger of Allah (ﷺ) went out when the sun had passed its zenith, and led them in Zuhr prayer.\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "694",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن أبي سلمة بن عبد الرحمن، وأبي عبد الله الأغر، مولى الجهنيين وكانا من أصحاب أبي هريرة أنهما سمعا أبا هريرة يقول صلاة في مسجد رسول الله صلى الله عليه وسلم أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام فإن رسول الله صلى الله عليه وسلم آخر الأنبياء ومسجده آخر المساجد ‏.‏ قال أبو سلمة وأبو عبد الله لم نشك أن أبا هريرة كان يقول عن حديث رسول الله صلى الله عليه وسلم فمنعنا أن نستثبت أبا هريرة في ذلك الحديث حتى إذا توفي أبو هريرة ذكرنا ذلك وتلاومنا أن لا نكون كلمنا أبا هريرة في ذلك حتى يسنده إلى رسول الله صلى الله عليه وسلم إن كان سمعه منه فبينا نحن على ذلك جالسنا عبد الله بن إبراهيم بن قارظ فذكرنا ذلك الحديث والذي فرطنا فيه من نص أبي هريرة فقال لنا عبد الله بن إبراهيم أشهد أني سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ فإني آخر الأنبياء وإنه آخر المساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin 'Abdur-Rahman and Abu 'Abdullah Al-Agharr, the freed slave of the Juhanis - better of whom were companions of Abu Hurairah - that they heard Abu Hurairah say:                      \"One prayer in the Masjid of the  Messenger of Allah (ﷺ) is better than one thousand prayers offered in other mosques, except Al-Masjid Al-Haram, for the Messenger of Allah (ﷺ) was the last of the prophets and his Masjid was the last of the Masjids.\" Abu Salamah and Abu 'Abdullah said: \"We do not doubt that Abu Hurairah was speaking on the basis of the Hadith of the Messenger of Allah (ﷺ), but we could not verify that Hadith with Abu Hurairah before he died. Then we remembered that and we blamed one another for not having spoken to Abu Hurairah about that, so that he could attribute it to the Messenger of Allah (ﷺ) if he had indeed heard it from him. While we were arguing, we went and sat down with 'Abdullah bin Ibrahim bin Qariz, and we told him about the Hadith and how we had been negligent in not checking it with Abu Hurairah. 'Abdullah bin Ibrahim said to us: 'I bear witness that I heard Abu Hurairah say: The Messenger of Allah (ﷺ) said: I am the last of the prophets and it is the last of the Masjids.'\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "792",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، والوليد، عن الأوزاعي، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة فصف الناس صفوفهم وخرج رسول الله صلى الله عليه وسلم حتى إذا قام في مصلاه ذكر أنه لم يغتسل فقال للناس ‏\"‏ مكانكم ‏\"‏ ‏.‏ ثم رجع إلى بيته فخرج علينا ينطف رأسه فاغتسل ونحن صفوف ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Iqamah for prayer was said and the people stood in rows, and the Messenger of Allah (ﷺ) came out. Then when he stood in the place where he prayed, he remembered that he had not performed Ghusl. He said to the people: 'Stay where you are.' Then he went back to his house, then he came out with his head dripping with water. He performed Ghusl while we were standing in our rows.\"",
      "chain": [
        "38429",
        "30373",
        "20459",
        "11013",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "925",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن الزبيدي، قال أخبرني الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أمن القارئ فأمنوا فإن الملائكة تؤمن فمن وافق تأمينه تأمين الملائكة غفر الله له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'When the reciter says Amin, then say: \"Amin\" too, for the angels say Amin and if a person's Amin coincides with the Amin of the angels, Allah will forgive his previous sins\"",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن أبي سلمة، أن أبا هريرة، قال قام رسول الله صلى الله عليه وسلم إلى الصلاة وقمنا معه فقال أعرابي وهو في الصلاة اللهم ارحمني ومحمدا ولا ترحم معنا أحدا ‏.‏ فلما سلم رسول الله صلى الله عليه وسلم قال للأعرابي ‏\"‏ لقد تحجرت واسعا ‏\"‏ ‏.‏ يريد رحمة الله عز وجل ‏.‏",
      "text_en": " It was narrated from Abu Salamah that :                     Abu Hurairah said: \"The Messenger of Allah (ﷺ) stood up to pray and we stood up with him. A Bedouin said- while he was praying- 'O Allah, have mercy on me and Muhammad and do not have mercy on anyone else.' When the Messenger of Allah (ﷺ) said the Salam, he said to the Bedouin: 'You have limited something vast,\" meaning the mercy of Allah (SWT).\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1534",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، عن محمد، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن عباس، قال قام رسول الله صلى الله عليه وسلم وقام الناس معه فكبر وكبروا ثم ركع وركع أناس منهم ثم سجد وسجدوا ثم قام إلى الركعة الثانية فتأخر الذين سجدوا معه وحرسوا إخوانهم وأتت الطائفة الأخرى فركعوا مع النبي صلى الله عليه وسلم وسجدوا والناس كلهم في صلاة يكبرون ولكن يحرس بعضهم بعضا ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin Abdullah bin Utbah that:                     'Abdullah bin 'Abbas said: \"The Messenger of Allah (ﷺ) stood and the people stood with him, and he said the takbir and they said the takbir. Then he bowed, and some of them bowed, then he prostrated and they prostrated, then he stood for the second rak'ah and those who had prostrated with him moved back and guarded their brothers, and the other group came and bowed and prostrated with the Prophet (ﷺ). All the people were praying and saying the takbir, but they were guarding one another.\"",
      "chain": [
        "38429",
        "30213",
        "20459",
        "11013",
        "11004",
        "17"
      ]
    }
  ],
  "total_hadiths": 80
}