{
  "id": "20452",
  "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
  "full_name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "192",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11863",
      "name": "Talha bin Yahya bin Talha طلحة بن يحيى بن طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11679",
      "name": "al-J'ad bin 'Abdur Rahman الجعد/الجعيد بن عبد الرحمن بن أوس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28375",
      "name": "Abd al-Mu'mn bin Khalid عبد المؤمن بن خالد الحنفي أبو خالد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11504",
      "name": "Khthym bin Arak bin Malik خثيم بن عراك بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11629",
      "name": "Sa'id bin 'Ubaid al-Tai'i سعيد بن عبيد الطائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20458",
      "name": "Muhammad bin Maymun, Abu Hamza محمد بن ميمون المروزي أبو حمزة السكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30325",
      "name": "al-Husain bin Hryth الحسين بن حريث",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30401",
      "name": "Yusuf bin 'Isa bin Dinar يوسف بن عيسى بن دينار الزهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30379",
      "name": "Muhammad bin 'Abdul 'Aziz bin Abi Razma محمد بن عبد العزيز بن أبي رزمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38130",
      "name": "al-Jarwd bin Mua'dh al-Slmy الجارود بن معاذ السلمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20642",
      "name": "Ibrahim bin Ishaq bin 'Isa إبراهيم بن إسحاق أبو إسحاق الطالقاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38426",
      "name": "'Amr bin Rafa'i al-Qazwayni عمرو بن رافع بن الفرات القزويني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30269",
      "name": "Muhammad bin al-Sabah محمد بن الصباح البزاز الدولابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38696",
      "name": "Yahya bin Aktham bin Muhammad يحيى بن أكثم بن محمد بن قطن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38627",
      "name": "Mhmwd bin Sulaiman al-Blkhy محمود بن سليمان البلخي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38366",
      "name": "Abd'h bin Abd al-Rhym عبدة بن عبد الرحيم بن حسان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38495",
      "name": "Muhammad bin Hmyd bin Hyan محمد بن حميد بن حيان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "274",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا يوسف بن عيسى، قال أخبرنا الفضل بن موسى، قال أخبرنا الأعمش، عن سالم، عن كريب، مولى ابن عباس عن ابن عباس، عن ميمونة، قالت وضع رسول الله صلى الله عليه وسلم وضوءا لجنابة فأكفأ بيمينه على شماله مرتين، أو ثلاثا، ثم غسل فرجه، ثم ضرب يده بالأرض  أو الحائط  مرتين أو ثلاثا، ثم مضمض واستنشق، وغسل وجهه وذراعيه، ثم أفاض على رأسه الماء، ثم غسل جسده، ثم تنحى فغسل رجليه‏.‏ قالت فأتيته بخرقة، فلم يردها، فجعل ينفض بيده‏.‏",
      "text_en": " Narrated Maimuna:                     Water was placed for the ablution of Allah's Apostle after Janaba. He poured water with his right hand over his left twice or thrice and then washed his private parts and rubbed his hand on the earth or on a wall twice or thrice and then rinsed his mouth, washed his nose by putting water in it and then blowing it out arid then washed his face and forearms and poured water over his head and washed his body. Then he shifted from that place and washed his feet. I brought a piece of cloth, but he did not take it and removed the traces of water from his body with his hand.\"",
      "chain": [
        "30401",
        "20452",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "724",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن أسد، قال أخبرنا الفضل بن موسى، قال أخبرنا سعيد بن عبيد الطائي، عن بشير بن يسار الأنصاري، عن أنس بن مالك، أنه قدم المدينة فقيل له ما أنكرت منا منذ يوم عهدت رسول الله صلى الله عليه وسلم قال ما أنكرت شيئا إلا أنكم لا تقيمون الصفوف‏.‏ وقال عقبة بن عبيد عن بشير بن يسار قدم علينا أنس بن مالك المدينة بهذا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I arrived at Medina and was asked whether I found any change since the days of Allah's Apostle. I said, \"I have not found any change except that you do not stand in alignment in your prayers.\"",
      "chain": [
        "30176",
        "20452",
        "11629",
        "11810",
        "19"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا حسين بن حريث، أخبرنا الفضل، عن جعيد، عن عائشة، قالت سمعت سعدا  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يكيد أهل المدينة أحد إلا انماع كما ينماع الملح في الماء ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     I heard the Prophet saying, \"None plots against the people of Medina but that he will be dissolved (destroyed) like the salt is dissolved in water.\"",
      "chain": [
        "30325",
        "20452",
        "11679",
        "53",
        "9"
      ]
    },
    {
      "hadith_no": "3580",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إسحاق، أخبرنا الفضل بن موسى، عن الجعيد بن عبد الرحمن، رأيت السائب بن يزيد ابن أربع وتسعين جلدا معتدلا فقال قد علمت ما متعت به سمعي وبصري إلا بدعاء رسول الله صلى الله عليه وسلم، إن خالتي ذهبت بي إليه فقالت يا رسول الله إن ابن أختي شاك فادع الله‏.‏ قال فدعا لي‏.‏",
      "text_en": " Narrated Al-Ju'aid bin `Abdur Rahman:                     I saw As-Sa'ib bin Yazid when he was ninety-four years old, quite strong and of straight figure. He said, \"I know that I enjoyed my hearing and seeing powers only because of the invocation of Allah's Apostle . My aunt took me to him and said, 'O Allah's Apostle! My nephew is sick; will you invoke Allah for him?' So he invoked (Allah) for me.\"",
      "chain": [
        "30312",
        "20452"
      ]
    },
    {
      "hadith_no": "6631",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا الفضل بن موسى، أخبرنا الفضيل، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ما بين منكبى الكافر مسيرة ثلاثة أيام للراكب المسرع‏\"‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The width between the two shoulders of a Kafir      (disbeliever) will be equal to the distance covered by a fast rider in     three days.\"",
      "chain": [
        "30176",
        "20452",
        "20271",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا ابن المبارك، ويزيد بن هارون، ح وحدثني علي بن حجر، أخبرنا ابن المبارك، والفضل بن موسى، كلهم عن حسين، بهذا الإسناد ولم يذكروا أم كعب ‏.‏",
      "text_en": " This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.",
      "chain": [
        "30201",
        "20025",
        "20472",
        "20387",
        "20025",
        "20452"
      ]
    },
    {
      "hadith_no": "3316",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني علي بن خشرم، أخبرنا عيسى، عن ابن جريج، عن ابن شهاب، حدثنا سليمان بن يسار، عن ابن عباس، عن الفضل، أن امرأة، من خثعم قالت يا رسول الله إن أبي شيخ كبير عليه فريضة الله في الحج وهو لا يستطيع أن يستوي على ظهر بعيره ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فحجي عنه ‏\"‏ ‏.‏",
      "text_en": " Fadl reported that a woman of Banu Khath'am said:                      Messenger of Allah, my father is very old. There is an old obligation of Hajj upon him from Allah, but he is not capable of sitting on the back of the camel. Thereupon Allah's Apostle (may peace be upon him) said: Perform Hajj on his behalf.",
      "chain": [
        "30556",
        "20347",
        "11070",
        "11013",
        "11005",
        "17",
        "20452"
      ]
    },
    {
      "hadith_no": "3415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يوسف بن عيسى، حدثنا الفضل بن موسى، أخبرنا هشام بن عروة، عن صالح بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصبر أحد على لأواء المدينة ‏\"‏ ‏.‏ بمثله ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      None who shows endurance on the hardships of Medina,... (the rest of the hadith is the same).",
      "chain": [
        "30401",
        "20452",
        "11065",
        "10511",
        "13"
      ]
    },
    {
      "hadith_no": "4041",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا الثقفي، عن أيوب، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم جميعا عن وكيع، عن سفيان، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن جريج، ح وحدثني علي بن حجر، حدثنا الفضل بن موسى، عن شريك، عن شعبة، كلهم عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Ibn Abbas (Allah be pleased with them).",
      "chain": [
        "30421",
        "11015",
        "30201",
        "30123",
        "20032",
        "20012",
        "30490",
        "20023",
        "11070",
        "20387",
        "20452",
        "20587",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4850",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا الفضل بن موسى، حدثنا إسماعيل، بن أبي خالد أخبرنا قيس بن أبي حازم، قال سمعت عدي بن عميرة الكندي، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديثهم ‏.‏",
      "text_en": " Adi b. 'Amira al-Kindi heard Allah's Messenger (may peace be upon him) as saying (as) was narrated in the (above-mentioned) hadith.",
      "chain": [
        "30021",
        "20452",
        "11418",
        "11046",
        "5171"
      ]
    },
    {
      "hadith_no": "5759",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا حسين بن حريث أبو عمار، حدثنا الفضل بن موسى، أخبرنا طلحة بن، يحيى عن أبي بردة، عن أبي موسى الأشعري، قال جاء أبو موسى إلى عمر بن الخطاب فقال السلام عليكم هذا عبد الله بن قيس ‏.‏ فلم يأذن له فقال السلام عليكم هذا أبو موسى السلام عليكم هذا الأشعري ‏.‏ ثم انصرف فقال ردوا على ردوا على ‏.‏ فجاء فقال يا أبا موسى ما ردك كنا في شغل ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الاستئذان ثلاث فإن أذن لك وإلا فارجع ‏\"‏ ‏.‏ قال لتأتيني على هذا ببينة وإلا فعلت وفعلت ‏.‏ فذهب أبو موسى قال عمر إن وجد بينة تجدوه عند المنبر عشية وإن لم يجد بينة فلم تجدوه ‏.‏ فلما أن جاء بالعشي وجدوه قال يا أبا موسى ما تقول أقد وجدت قال نعم أبى بن كعب ‏.‏ قال عدل ‏.‏ قال يا أبا الطفيل ما يقول هذا قال سمعت رسول الله صلى الله عليه وسلم يقول ذلك يا ابن الخطاب فلا تكونن عذابا على أصحاب رسول الله صلى الله عليه وسلم ‏.‏ قال سبحان الله إنما سمعت شيئا فأحببت أن أتثبت ‏.‏",
      "text_en": " Abu Musa Ash'ari reported that he went to 'Umar b. Khattab and greeted him by saying:                      As-Salamu-'Alaikum, here is 'Abdullah b. Qais, but he did not permit him (to get in). He (Abu Musa Ash'ari) again greeted him with as-Salamu-'Alaikum and said: Here is Abu Musa, but he (Hadrat 'Umar) did not permit him (to get in). He again said: As-Salam-u-'Alaikum, (and said) here is Ash'ari, (then receiving no response he came back). He (Hadrat 'Umar) said: Bring him back to me, bring him back to me So he went there (in the presence of Hadrat 'Umar) and he said to him: Abu Musa, what made you go back, while we were busy in some work? He said: I heard Allah's Messenger (may. peace be upon him) as saying: Permission should be sought thrice. And if you are permitted, (then get in), otherwise go back. He said: Bring witness to this fact, otherwise I shall do this and that, i. e. I shall punish you. Abu Musa went away and 'Umar said to him (on his departure): It he (Abu Musa) finds a witness he should meet him by the side of the pulpit in the evening and it he does not find a witness you would not find him there. When it was evening he (Hadrat 'Umar) found him (Abu Musa) there. He (Hadrat 'Umar) said: Abu Musa, have you been able to find a witness to what you have said? He said: Yes. Here is Ubayy bin Ka'b, whereupon he (Hadrat 'Umar) said: Yes, he is an authentic (witness). He (Hadrat 'Umar) said: Abu Tufail (the kunya of Ubayy b. Ka'b), what does he (Abu Musa say? Thereupon he said: Ibn Khattab, I heard Allah's Messenger (may peace be upon him) as saying so. Do not prove to be a hard (task-master) for the Companions of Allah's Messenger (may peace be upon him), whereupon he Hadrat 'Umar said: Hallowed be Allah. I had heard something (in this connection), but I wished it to be established (as an undeniable fact).",
      "chain": [
        "30325",
        "20452",
        "11863",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6470",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان أبو أحمد، حدثنا الفضل بن موسى السيناني، أخبرنا  طلحة بن يحيى بن طلحة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أسرعكن لحاقا بي أطولكن يدا ‏\"‏ ‏.‏ قالت فكن يتطاولن أيتهن أطول يدا ‏.‏ قالت فكانت أطولنا يدا زينب لأنها كانت تعمل بيدها وتصدق ‏.‏",
      "text_en": " 'A'isha, the Mother of the Faithful, reported that Allah's Messenger (may peace be upon him) said:                      One who has the longest hands amongst you would meet me most immediately. She farther said: They (the wives of Allah's Apostle) used to measure the hands as to whose hand was the longest and it was the hand of Zainab that was the longest amongst them, as she used to work with her hand and Spend (that income) on charity.",
      "chain": [
        "30277",
        "20452",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "6593",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني حسين بن حريث، حدثنا الفضل بن موسى، عن خثيم بن عراك، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم سالمها الله وغفار غفر الله لها أما إني لم أقلها ولكن قالها الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon. Verily it is not I that say this, but (it is) Allah the Exalted and Glorious. (who) says this.",
      "chain": [
        "30325",
        "20452",
        "11504",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "7389",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني أبو عمار، حسين بن حريث حدثنا الفضل بن موسى، عن الحسين، عن  مطر، حدثني قتادة، عن مطرف بن عبد الله بن الشخير، عن عياض بن حمار، أخي بني مجاشع قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم خطيبا فقال ‏\"‏ إن الله أمرني ‏\"‏ ‏.‏ وساق الحديث بمثل حديث هشام عن قتادة وزاد فيه ‏\"‏ وإن الله أوحى إلى أن تواضعوا حتى لا يفخر أحد على أحد ولا يبغي أحد على أحد ‏\"‏ ‏.‏ وقال في حديثه ‏\"‏ وهم فيكم تبعا لا يبغون أهلا ولا مالا ‏\"‏ ‏.‏ فقلت فيكون ذلك يا أبا عبد الله قال نعم  والله لقد أدركتهم في الجاهلية وإن الرجل ليرعى على الحى ما به إلا وليدتهم يطؤها  ‏.‏",
      "text_en": " Iyad. b. Himar reported tbat, while Allah's Messenger (may peace be upon him) was delivering an address, he stated that Allah commanded me The rest of the hadith is the same, and there is an addition in it:                     \" Allah revealed to me that we should be humble amongst ourselves and none should show pride upon the others, And it does not behove one to do so, and He also said: There are among you people to follow not caring a bit for their family and property. Qatada said: Abu Abdullah, would this happen? Thereupon he said: Yes. By Allah, I found this in the days of ignorance that a person grazed the goat of a tribe and did not find anyone but their slave-girl (and he did not spare her) but committed adultery with her.",
      "chain": [
        "20452",
        "11278",
        "11019",
        "11305",
        "5217"
      ]
    },
    {
      "hadith_no": "1025",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرنا الفضل بن موسى، عن عبد الله بن كيسان، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم سمى سجدتى السهو المرغمتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) named the two prostrations of forgetfulness disgraceful for the devil.",
      "chain": [
        "30379",
        "20452",
        "18570",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1130",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة المروزي، أخبرنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن عطاء، عن ابن عمر، قال كان إذا كان بمكة فصلى الجمعة تقدم فصلى ركعتين ثم تقدم فصلى أربعا وإذا كان بالمدينة صلى الجمعة ثم رجع إلى بيته فصلى ركعتين ولم يصل في المسجد فقيل له فقال كان رسول الله صلى الله عليه وسلم يفعل ذلك ‏.‏",
      "text_en": " 'Ata said:                      When Ibn 'Umar offered the Friday prayer in Mecca he would go forward and pray two rak'ahs, he would then go forward and pray four rak'ahs; but when he was in Medina, he offered the Friday prayer, then returned to his house and prayed two rak'ahs, not praying them in the mosque. Someone mentioned this to him and he replied that the Messenger of Allah (ﷺ) used to do it.",
      "chain": [
        "20452",
        "11875",
        "11411",
        "11029",
        "18"
      ]
    },
    {
      "hadith_no": "1155",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا الفضل بن موسى السيناني، حدثنا ابن جريج، عن عطاء، عن عبد الله بن السائب، قال شهدت مع رسول الله صلى الله عليه وسلم العيد فلما قضى الصلاة قال ‏\"‏ إنا نخطب فمن أحب أن يجلس للخطبة فليجلس ومن أحب أن يذهب فليذهب ‏\"‏ ‏.‏ قال أبو داود هذا مرسل عن عطاء عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn as-Sa'ib:                     I attended the 'Id prayer along with the Messenger of Allah (ﷺ). When he finished the prayer, he said: We shall deliver the sermon; he who likes to sit for listening to it may sit and he who likes to go away may go away.Abu Dawud said: this is a mursal tradition (i.e. the successor 'Ata directly reporting from the Prophet (ﷺ) and omitting the link of the Companions).",
      "chain": [
        "30269",
        "20452",
        "11070",
        "11029",
        "2065"
      ]
    },
    {
      "hadith_no": "1419",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن المثنى، حدثنا أبو إسحاق الطالقاني، حدثنا الفضل بن موسى، عن عبيد الله بن عبد الله العتكي، عن عبد الله بن بريدة، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الوتر حق فمن لم يوتر فليس منا الوتر حق فمن لم يوتر فليس منا الوتر حق فمن لم يوتر فليس منا ‏\"‏‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     I heard the Messenger of Allah (ﷺ) say: The witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us.",
      "chain": [
        "30170",
        "20642",
        "20452",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "قال أبو داود كتب إلى حسين بن حريث المروزي حدثنا الفضل بن موسى، عن الحسين بن واقد، عن عمارة بن أبي حفصة، عن عكرمة، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إن امرأتي لا تمنع يد لامس ‏.‏ قال ‏\"‏ غربها ‏\"‏ ‏.‏ قال أخاف أن تتبعها نفسي ‏.‏ قال ‏\"‏ فاستمتع بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man came to the Prophet (ﷺ), and said: My wife does not prevent the hand of a man who touches her. He said: Divorce her. He then said: I am afraid my inner self may covet her. He said: Then enjoy her.",
      "chain": [
        "20452",
        "20648",
        "11711",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "قال أبو داود سمعت محمد بن عيسى، يحدث به حدثنا المعتمر، قال سمعت الحكم بن أبان، يحدث بهذا الحديث ولم يذكر ابن عباس قال عن عكرمةقال أبو داود كتب إلى الحسين بن حريث قال أخبرنا الفضل بن موسى، عن معمر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، بمعناه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dawud said “I heard Muhammad bin Isa narrating this tradition who said Mu’tamar narrated it to us. And he (Mu’tamar) said “ I heard Al Hakam bin Aban narrating this tradition. He did not mention the name of Ibn ‘Abbas.Abu Dawud said “Al Hussain bin Huraith wrote to me saying “Al Fadl bin Musa narrated from Ibn ‘Abbas to the same effect from the Prophet(ﷺ).",
      "chain": [
        "30002",
        "31167",
        "20288",
        "19904",
        "20452",
        "20115",
        "19904",
        "11023"
      ]
    },
    {
      "hadith_no": "3818",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرنا الفضل بن موسى، عن حسين بن واقد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وددت أن عندي خبزة بيضاء من برة سمراء ملبقة بسمن ولبن ‏\"‏ ‏.‏ فقام رجل من القوم فاتخذه فجاء به فقال ‏\"‏ في أى شىء كان هذا ‏\"‏ ‏.‏ قال في عكة ضب قال ‏\"‏ ارفعه ‏\"‏ ‏.‏ قال أبو داود هذا حديث منكر ‏.‏ قال أبو داود وأيوب ليس هو السختياني ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: I wish I had a white loaf made from tawny and softened with clarified butter and milk. A man from among the people got up and getting one brought it. He asked: In which had it been? He replied: In a lizard skin. He said: Take it away.Abu Dawud said: This is a munkar (rejected) tradition.Abu Dawud said: Ayyub, the narrator of this tradition, is not (Ayyub) al-Sakhtiyani.",
      "chain": [
        "30379",
        "20452",
        "20648",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا الفضل بن موسى، عن عبد المؤمن بن خالد الحنفي، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى رسول الله صلى الله عليه وسلم القميص ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The clothing which the Messenger of Allah (ﷺ) liked best was shirt.",
      "chain": [
        "30309",
        "20452",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "137",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسين بن حريث، أخبرنا الفضل بن موسى، عن أبي حمزة السكري، عن عبد الكريم، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كان دما أحمر فدينار وإذا كان دما أصفر فنصف دينار ‏\"‏ ‏.‏ قال أبو عيسى حديث الكفارة في إتيان الحائض قد روي عن ابن عباس موقوفا ومرفوعا ‏.‏ وهو قول بعض أهل العلم ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال ابن المبارك يستغفر ربه ولا كفارة عليه ‏.‏ وقد روي نحو قول ابن المبارك عن بعض التابعين منهم سعيد بن جبير وإبراهيم النخعي وهو قول عامة علماء الأمصار ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"When the blood is red then (give) a Dinar. And when the blood is yellow then half Dinar.\"",
      "chain": [
        "30325",
        "20452",
        "20458",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "170",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الله بن عمر العمري، عن القاسم بن غنام، عن عمته أم فروة، وكانت، ممن بايعت النبي صلى الله عليه وسلم قالت سئل النبي صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ الصلاة لأول وقتها ‏\"‏ ‏.‏",
      "text_en": " Umm Farwah - and she was one of those who gave pledge of allegiance to the Prophet  - narrated:                     \"The Prophet was asked: 'Which deed is the best?' So he said: 'Salat in the beginning of its time.'\"",
      "chain": [
        "30325",
        "20452",
        "20507",
        "12432"
      ]
    },
    {
      "hadith_no": "587",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمود بن غيلان، وغير، واحد، قالوا حدثنا الفضل بن موسى، عن عبد الله بن سعيد بن أبي هند، عن ثور بن زيد، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يلحظ في الصلاة يمينا وشمالا ولا يلوي عنقه خلف ظهره ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد خالف وكيع الفضل بن موسى في روايته ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Messenger of Allah would glance toward the right and the left during Salat but he would not turn his neck to look behind him.\"",
      "chain": [
        "30277",
        "20452",
        "11184",
        "11155",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "905",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسين بن حريث، وغير، واحد، قالوا حدثنا الفضل بن موسى، عن حسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع النبي صلى الله عليه وسلم في سفر ‏.‏ فحضر الأضحى فاشتركنا في البقرة سبعة وفي الجزور عشرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب وهو حديث حسين بن واقد ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"We were with the Prophet on a journey (on the Day of) Adha, so seven of us shared in a cow, and ten for a camel.\"",
      "chain": [
        "30325",
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1035",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عبد الله بن المبارك، والفضل بن موسى، عن حسين المعلم، عن عبد الله بن بريدة، عن سمرة بن جندب، أن النبي صلى الله عليه وسلم صلى على امرأة فقام وسطها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة عن حسين المعلم ‏.‏",
      "text_en": " Samurah bin Jundab narrated:                     \"The Prophet prayed over a woman, so he stood at her middle.\"",
      "chain": [
        "20387",
        "20025",
        "20452",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1222",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن غيلان، أنبأنا الفضل بن موسى، عن سفيان، أنبأنا محمد بن عبد الرحمن، وهو مولى آل طلحة عن سليمان بن يسار، عن الربيع بنت معوذ بن عفراء، أنها اختلعت على عهد النبي صلى الله عليه وسلم فأمرها النبي صلى الله عليه وسلم - أو أمرت - أن تعتد بحيضة ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث الربيع الصحيح أنها أمرت أن تعتد بحيضة ‏.‏",
      "text_en": " AR-Rubayyi bint Mu'awwidh bin Al-Afra narrated:                     that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"",
      "chain": [
        "30277",
        "20452",
        "20012",
        "11105",
        "11005",
        "617"
      ]
    },
    {
      "hadith_no": "1239",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "أنبأنا أبو عمار الحسين بن حريث، أنبأنا الفضل بن موسى، عن معمر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، أن رجلا، أتى النبي صلى الله عليه وسلم قد ظاهر من امرأته فوقع عليها فقال يا رسول الله إني قد ظاهرت من زوجتي فوقعت عليها قبل أن أكفر ‏.‏ فقال ‏\"‏ وما حملك على ذلك يرحمك الله ‏\"‏ ‏.‏ قال رأيت خلخالها في ضوء القمر ‏.‏ قال ‏\"‏ فلا تقربها حتى تفعل ما أمرك الله به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     A man came to the Prophet, and he had uttered Zihar upon his wife then he had intercourse with her. So he said: 'O Messenger of Allah! I uttered Zihar against my wife, then I had intercourse with her before atoning.' He (pbuh) said: \"What caused you to do that, may Allah have mercy upon you?' He said: 'I saw her anklets in the moonlight.' He said: 'Then do not go near her until you have done what Allah ordered (for it).'\"",
      "chain": [
        "30325",
        "20452",
        "20115",
        "19904",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1288",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث الخزاعي، حدثنا الفضل بن موسى، عن صالح بن أبي جبير، عن أبيه، عن رافع بن عمرو، قال كنت أرمي نخل الأنصار فأخذوني فذهبوا بي إلى النبي صلى الله عليه وسلم فقال ‏\"‏ يا رافع لم ترمي نخلهم ‏\"‏ ‏.‏ قال قلت يا رسول الله الجوع ‏.‏ قال ‏\"‏ لا ترم وكل ما وقع أشبعك الله وأرواك ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Rafi' bin 'Amr:                     \"I was throwing stones at a date-palm belonging to some of the Ansar. They tool me along with them to the Prophet (ﷺ). He said: \"O Rafi'! Why were you throwing stones at their date-palm?'\" He said: \"I said: 'Out of hunger, O Messenger of Allah! He said: 'Do not throw stones at them, eat what falls. May Allah fill you and quench your thirst.'\"This Hadith is Hasan Gharib Sahih.",
      "chain": [
        "20452",
        "3241"
      ]
    },
    {
      "hadith_no": "1371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا الفضل بن موسى، عن أبي حمزة السكري، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشريك شفيع والشفعة في كل شيء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مثل هذا إلا من حديث أبي حمزة السكري ‏.‏ وقد روى غير واحد هذا الحديث عن عبد العزيز بن رفيع عن ابن أبي مليكة عن النبي صلى الله عليه وسلم مرسلا وهذا أصح ‏.‏  حدثنا هناد، حدثنا أبو بكر بن عياش، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن النبي صلى الله عليه وسلم نحوه بمعناه وليس فيه عن ابن عباس وهكذا روى غير واحد عن عبد العزيز بن رفيع مثل هذا ليس فيه عن ابن عباس وهذا أصح من حديث أبي حمزة ‏.‏ وأبو حمزة ثقة يمكن أن يكون الخطأ من غير أبي حمزة ‏.‏  حدثنا هناد، حدثنا أبو الأحوص، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن النبي صلى الله عليه وسلم نحو حديث أبي بكر بن عياش ‏.‏ وقال أكثر أهل العلم إنما تكون الشفعة في الدور والأرضين ولم يروا الشفعة في كل شيء ‏.‏ وقال بعض أهل العلم الشفعة في كل شيء ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Narrated Ibn Abbas:                     that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"",
      "chain": [
        "30401",
        "20452",
        "20458",
        "11257",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "1385",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمود بن غيلان، أخبرنا الفضل بن موسى الشيباني، أخبرنا شريك، عن شعبة، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لم يحرم المزارعة ولكن أمر أن يرفق بعضهم ببعض ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وحديث رافع فيه اضطراب يروى هذا الحديث عن رافع بن خديج عن عمومته ويروى عنه عن ظهير بن رافع وهو أحد عمومته وقد روي هذا الحديث عنه على روايات مختلفة ‏.‏ وفي الباب عن زيد بن ثابت وجابر رضى الله عنهما ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other.\"",
      "chain": [
        "30277",
        "20452",
        "20587",
        "20020",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1391",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو عمار، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن يزيد بن عمرو النحوي، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ دية الأصابع اليدين والرجلين سواء عشر من الإبل لكل أصبع ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي موسى وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح غريب من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم وبه يقول سفيان والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"The blood-money for the fingers on the hands and (the toes of) the feet is the same: Ten camels for each finger.\"",
      "chain": [
        "20452",
        "20648",
        "16117",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1398",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن يزيد الرقاشي، حدثنا أبو الحكم البجلي، قال سمعت أبا سعيد الخدري، وأبا، هريرة يذكران عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو أن أهل السماء وأهل الأرض اشتركوا في دم مؤمن لأكبهم الله في النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏. ‏وأبو الحكم البجلي هو عبد الرحمن بن أبي نعم الكوفي.",
      "text_en": " Narrated Abul-Hakam Al-Bajali:                     \"I heard Abu Sa'eed Al-Khudri and Abu Hurairah mentioning from the Messenger of Allah (ﷺ) that he said: 'If the inhabitants of the heavens and the inhabitants of the earth all took part in shedding the blood of believer, then Allah would cast them (all) in the Fire.\"",
      "chain": [
        "30325",
        "20452",
        "20648",
        "14422",
        "38"
      ]
    },
    {
      "hadith_no": "1501",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فحضر الأضحى فاشتركنا في البقرة سبعة وفي البعير عشرة ‏.‏ قال أبو عيسى وفي الباب عن أبي الأسود السلمي عن أبيه عن جده وأبي أيوب ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن غريب لا نعرفه إلا من حديث الفضل بن موسى ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"We were with the Messenger of Allah (ﷺ) on a journey when the (Day of) Adha came, so we shared seven for a cow and ten for a camel.\"",
      "chain": [
        "30325",
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، حدثنا واقد بن عمرو بن سعد بن معاذ، قال قدم أنس بن مالك فأتيته فقال من أنت فقلت أنا واقد بن عمرو بن سعد بن معاذ، ‏.‏ قال فبكى وقال إنك لشبيه بسعد وإن سعدا كان من أعظم الناس وأطولهم وإنه بعث إلى النبي صلى الله عليه وسلم جبة من ديباج منسوج فيها الذهب فلبسها رسول الله صلى الله عليه وسلم فصعد المنبر فقام أو قعد فجعل الناس يلمسونها فقالوا ما رأينا كاليوم ثوبا قط ‏.‏ فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة خير مما ترون ‏\"‏ ‏.‏ قال وفي الباب عن أسماء بنت أبي بكر ‏.‏ وهذا حديث صحيح ‏.‏",
      "text_en": " Narrated Waqid bin 'Amr bin Sa'd bin Mu'adh:                     \"Anas bin Malik arrived. So I went to him and he said: 'Who are you ?' I said: 'I am Waqid bin 'Amr [bin Sa'd bin Ma'adh].'\" He said: \"So he began to cry and he said: 'You resemble Sa'd. Sa'd was one of the greatest people, and of the tallest. The Messenger of Allah (ﷺ) was sent a cloak of Dibaj with gold woven into it. The Messenger of Allah (ﷺ) wore it and ascended the Minbar. Then he stood, or sat, and the people began touching it, and they said: 'We never saw a garment like this before today.' So he said: 'Are you amazed at this ? The handkerchiefs of Sa'd in Paradise are better than what you see.'\"He said: There is something on this topic from Asma' bint Abu Bakr. This Hadith is Sahih.",
      "chain": [
        "20452",
        "11220",
        "10621",
        "9"
      ]
    },
    {
      "hadith_no": "1762",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، والفضل بن موسى، وزيد بن حباب، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث عبد المؤمن بن خالد تفرد به وهو مروزي ‏.‏ وروى بعضهم هذا الحديث عن أبي تميلة عن عبد المؤمن بن خالد عن عبد الله بن بريدة عن أمه عن أم سلمة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is from Al-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, from Umm Salamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, from Umm Salamah is more correct, Abu Tumailah mentioned 'his mother' in it.\"",
      "chain": [
        "38495",
        "20183",
        "20452",
        "20650",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الفضل بن موسى، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى رسول الله صلى الله عليه وسلم القميص ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"",
      "chain": [
        "20387",
        "20452",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "2164",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا يحيى بن أكثم، والجارود بن معاذ، قالا حدثنا الفضل بن موسى، حدثنا الحسين بن واقد، عن أوفى بن دلهم، عن نافع، عن ابن عمر، قال صعد رسول الله صلى الله عليه وسلم المنبر فنادى بصوت رفيع فقال ‏\"‏ يا معشر من قد أسلم بلسانه ولم يفض الإيمان إلى قلبه لا تؤذوا المسلمين ولا تعيروهم ولا تتبعوا عوراتهم فإنه من تتبع عورة أخيه المسلم تتبع الله عورته ومن تتبع الله عورته يفضحه ولو في جوف رحله ‏\"‏ قال ونظر ابن عمر يوما إلى البيت أو إلى الكعبة فقال ما أعظمك وأعظم حرمتك والمؤمن أعظم حرمة عند الله منك ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الحسين بن واقد ‏.‏ وروى إسحاق بن إبراهيم السمرقندي عن حسين بن واقد نحوه وروي عن أبي برزة الأسلمي عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Nafi'",
      "chain": [
        "38696",
        "20452",
        "20648",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2220",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر، حدثنا الفضل بن موسى، عن شريك بن عبد الله، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏ قال أبو عيسى يقال الكذاب المختار بن أبي عبيد والمبير الحجاج بن يوسف ‏.‏ حدثنا أبو داود سليمان بن سلم البلخي أخبرنا النضر بن شميل عن هشام بن حسان قال أحصوا ما قتل الحجاج صبرا فبلغ مائة ألف وعشرين ألف قتيل ‏.‏\t قال أبو عيسى وفي الباب عن أسماء بنت أبي بكر ‏.‏ حدثنا عبد الرحمن بن واقد، حدثنا شريك، نحوه بهذا الإسناد ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏ وشريك يقول عبد الله بن عصم وإسرائيل يقول عبد الله بن عصمة ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah(s.a.w) said:                     \"In Thaqif there will be a great liar and destroyer.\"",
      "chain": [
        "20387",
        "20452",
        "20587",
        "15290",
        "18"
      ]
    },
    {
      "hadith_no": "2307",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكثروا ذكر هاذم اللذات ‏\"‏ ‏.‏ يعني الموت ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Increase in remembrance of the severer of pleasures.\" Meaning death.",
      "chain": [
        "30277",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2627",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، أخبرنا الفضل بن موسى، عن زكريا بن أبي زائدة، عن عطية، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من أمتي من يشفع للفئام ومنهم من يشفع للقبيلة ومنهم من يشفع للعصبة ومنهم من يشفع للرجل حتى يدخلوا الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Abu Sa'eed narrated the Messenger of Allah (s.a.w)said:                     \"Indeed in my Ummah are those who intercede for large groups pf people, and among them  (there are) who intercede for a tribe, and among them (there are) who intercede for a group, and among them (there are) who intercede for a man, until they are admitted to Paradise.\"",
      "chain": [
        "30325",
        "20452",
        "11338",
        "38"
      ]
    },
    {
      "hadith_no": "2668",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا الجارود بن معاذ، حدثنا الفضل بن موسى، عن سفيان الثوري، عن أبي حمزة، عن إبراهيم النخعي، قال البناء كله وبال قلت أرأيت ما لا بد منه قال لا أجر ولا وزر ‏.‏",
      "text_en": " Sufyan Ath-Thawri narrated:                     From Abu Hamzah, (who said): \"From Ibrahim An-Nakha'i who said: 'All buildings and concerns for them will be against you.' I said: 'What do you think about what one can not do without?' He said: 'There is no reward for that nor harm.'\"",
      "chain": [
        "20452",
        "20012",
        "20458",
        "11051"
      ]
    },
    {
      "hadith_no": "2621",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، ويوسف بن عيسى، قالا حدثنا الفضل بن موسى، عن الحسين بن واقد، ح وحدثنا أبو عمار الحسين بن حريث، ومحمود بن غيلان، قالا حدثنا علي بن الحسين بن واقد، عن أبيه، ح وحدثنا محمد بن علي بن الحسن بن شقيق، ومحمود بن غيلان، قالا حدثنا علي بن الحسن بن شقيق، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abdullah bin Buraidah narrated from his father:                     that the Messenger of Allah (ﷺ) said: \"The covenant between us and them is the Salat, so whoever abandons it he has committed disbelief.\"",
      "chain": [
        "30325",
        "30401",
        "20452",
        "20648",
        "30325",
        "30277",
        "30555",
        "20648",
        "38554",
        "30277"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسين بن حريث أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تفرقت اليهود على إحدى وسبعين أو اثنتين وسبعين فرقة والنصارى مثل ذلك وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن عمرو وعوف بن مالك ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The Jews split into seventy-one sects, or seventy-two sects, and the Christians similarly, and my Ummah will split into seventy-three sects.\"",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3078",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سميتم باسمي فلا تكتنوا بي ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir:                     that the Messenger of Allah (ﷺ): \"When you name yourself after me, then do not use my Kunyah.\"",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3400",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، عن سفيان، عن سماك، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم نحوه بمعناه ولم يذكر فيه الأعمش وقد روى سليمان التيمي هذا الحديث عن أبي عثمان النهدي عن ابن مسعود عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "20452",
        "20012",
        "10770",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث الخزاعي المروزي، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الكريم بن الكريم بن الكريم بن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم قال ولو لبثت في السجن ما لبث ثم جاءني الرسول أجبت ‏.‏ ثم قرأ ‏:‏ ‏(‏ فلما جاءه الرسول قال ارجع إلى ربك فاسأله ما بال النسوة اللاتي قطعن أيديهن ‏)‏ قال ‏:‏ ورحمة الله على لوط إن كان ليأوي إلى ركن شديد إذ قال ‏:‏ ‏(‏ لو أن لي بكم قوة أو آوي إلى ركن شديد ‏)‏ فما بعث الله من بعده نبيا إلا في ذروة من قومه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Indeed, the honorable, the son of the honorable, the son of the honorable, the son of the honorable: Yusuf bin Ya'qub bin Ishaq bin Ibrahim.\" He said: \"And if I were to have remained in the prison as long as Yusuf, then the messenger came, I would have accepted.\" Then he recited: When the messenger came to him, he said: \"Return to your king and ask him: 'What happened to the women who cut their hands? (12:50)' He said: \"May Allah have mercy upon Lut, certainly he used to lean toward powerful support, since he said: \"Would that I had strength to overpower you, or that I could betake myself to some powerful support (11:80).\" So Allah did not send a Prophet after him except among a high ranking family (Dhirwah) among his people.\"",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3416",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن أبى بن كعب، قال قال النبي صلى الله عليه وسلم ‏\"‏ ما أنزل الله في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     that the Messenger of Allah (ﷺ) said: \"Allah has not revealed the likes of Umm Al-Kitab in the Tawrah, nor the Injil. It is the seven oft-repeated, and (Allah said) 'It is divided between Myself and My slave, and My slave shall have what he asks for.'\"",
      "chain": [
        "30325",
        "20452",
        "11875",
        "10606",
        "11884",
        "13",
        "39"
      ]
    },
    {
      "hadith_no": "3421",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن عيسى بن عبيد، عن الربيع بن أنس، عن أبي العالية، قال حدثني أبى بن كعب، قال لما كان يوم أحد أصيب من الأنصار أربعة وستون رجلا ومن المهاجرين ستة فيهم حمزة فمثلوا بهم فقالت الأنصار لئن أصبنا منهم يوما مثل هذا لنربين عليهم قال فلما كان يوم فتح مكة فأنزل الله ‏(‏ وإن عاقبتم فعاقبوا بمثل ما عوقبتم به ولئن صبرتم لهو خير للصابرين ‏)‏ فقال رجل لا قريش بعد اليوم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كفوا عن القوم إلا أربعة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من حديث أبى بن كعب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"On the Day of Uhud, sixty-four of the Ansar were killed, and six from the Muhajirin, one of whom was Hamzah, and they mutilated them, so the Ansar said: 'If, (in the future) we are able to kill them on a day like this, we would mutilate from among them as twice as they (mutilate from among us).'\" He said: \"So on the day of the Conquest of Makkah, Allah revealed: And if you punish them, then punish them with the like of that with which you were afflicted. But if you have patience, then it is better for those who are patient (16:126). So a man said: 'There shall be no Quraish after today.' But the Messenger of Allah (ﷺ) said: 'Leave the people, except for four.'\"",
      "chain": [
        "30325",
        "20452",
        "28471",
        "19844",
        "11618",
        "39"
      ]
    }
  ],
  "total_hadiths": 108
}