{
  "id": "20452",
  "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
  "full_name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "192",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11863",
      "name": "Talha bin Yahya bin Talha طلحة بن يحيى بن طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11679",
      "name": "al-J'ad bin 'Abdur Rahman الجعد/الجعيد بن عبد الرحمن بن أوس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28375",
      "name": "Abd al-Mu'mn bin Khalid عبد المؤمن بن خالد الحنفي أبو خالد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11504",
      "name": "Khthym bin Arak bin Malik خثيم بن عراك بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11629",
      "name": "Sa'id bin 'Ubaid al-Tai'i سعيد بن عبيد الطائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20458",
      "name": "Muhammad bin Maymun, Abu Hamza محمد بن ميمون المروزي أبو حمزة السكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30325",
      "name": "al-Husain bin Hryth الحسين بن حريث",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30401",
      "name": "Yusuf bin 'Isa bin Dinar يوسف بن عيسى بن دينار الزهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30379",
      "name": "Muhammad bin 'Abdul 'Aziz bin Abi Razma محمد بن عبد العزيز بن أبي رزمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38130",
      "name": "al-Jarwd bin Mua'dh al-Slmy الجارود بن معاذ السلمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20642",
      "name": "Ibrahim bin Ishaq bin 'Isa إبراهيم بن إسحاق أبو إسحاق الطالقاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38426",
      "name": "'Amr bin Rafa'i al-Qazwayni عمرو بن رافع بن الفرات القزويني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30269",
      "name": "Muhammad bin al-Sabah محمد بن الصباح البزاز الدولابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38696",
      "name": "Yahya bin Aktham bin Muhammad يحيى بن أكثم بن محمد بن قطن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38627",
      "name": "Mhmwd bin Sulaiman al-Blkhy محمود بن سليمان البلخي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38366",
      "name": "Abd'h bin Abd al-Rhym عبدة بن عبد الرحيم بن حسان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38495",
      "name": "Muhammad bin Hmyd bin Hyan محمد بن حميد بن حيان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-274",
      "hadith_no": "274",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا يوسف بن عيسى، قال أخبرنا الفضل بن موسى، قال أخبرنا الأعمش، عن سالم، عن كريب، مولى ابن عباس عن ابن عباس، عن ميمونة، قالت وضع رسول الله صلى الله عليه وسلم وضوءا لجنابة فأكفأ بيمينه على شماله مرتين، أو ثلاثا، ثم غسل فرجه، ثم ضرب يده بالأرض  أو الحائط  مرتين أو ثلاثا، ثم مضمض واستنشق، وغسل وجهه وذراعيه، ثم أفاض على رأسه الماء، ثم غسل جسده، ثم تنحى فغسل رجليه‏.‏ قالت فأتيته بخرقة، فلم يردها، فجعل ينفض بيده‏.‏",
      "text_en": " Narrated Maimuna:                     Water was placed for the ablution of Allah's Apostle after Janaba. He poured water with his right hand over his left twice or thrice and then washed his private parts and rubbed his hand on the earth or on a wall twice or thrice and then rinsed his mouth, washed his nose by putting water in it and then blowing it out arid then washed his face and forearms and poured water over his head and washed his body. Then he shifted from that place and washed his feet. I brought a piece of cloth, but he did not take it and removed the traces of water from his body with his hand.\"",
      "usc_msa_ref": "273",
      "chain": [
        "30401",
        "20452",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-724",
      "hadith_no": "724",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن أسد، قال أخبرنا الفضل بن موسى، قال أخبرنا سعيد بن عبيد الطائي، عن بشير بن يسار الأنصاري، عن أنس بن مالك، أنه قدم المدينة فقيل له ما أنكرت منا منذ يوم عهدت رسول الله صلى الله عليه وسلم قال ما أنكرت شيئا إلا أنكم لا تقيمون الصفوف‏.‏ وقال عقبة بن عبيد عن بشير بن يسار قدم علينا أنس بن مالك المدينة بهذا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I arrived at Medina and was asked whether I found any change since the days of Allah's Apostle. I said, \"I have not found any change except that you do not stand in alignment in your prayers.\"",
      "usc_msa_ref": "691",
      "chain": [
        "30176",
        "20452",
        "11629",
        "11810",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1910",
      "hadith_no": "1910",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا حسين بن حريث، أخبرنا الفضل، عن جعيد، عن عائشة، قالت سمعت سعدا  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يكيد أهل المدينة أحد إلا انماع كما ينماع الملح في الماء ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     I heard the Prophet saying, \"None plots against the people of Medina but that he will be dissolved (destroyed) like the salt is dissolved in water.\"",
      "usc_msa_ref": "101",
      "chain": [
        "30325",
        "20452",
        "11679",
        "53",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-3580",
      "hadith_no": "3580",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إسحاق، أخبرنا الفضل بن موسى، عن الجعيد بن عبد الرحمن، رأيت السائب بن يزيد ابن أربع وتسعين جلدا معتدلا فقال قد علمت ما متعت به سمعي وبصري إلا بدعاء رسول الله صلى الله عليه وسلم، إن خالتي ذهبت بي إليه فقالت يا رسول الله إن ابن أختي شاك فادع الله‏.‏ قال فدعا لي‏.‏",
      "text_en": " Narrated Al-Ju'aid bin `Abdur Rahman:                     I saw As-Sa'ib bin Yazid when he was ninety-four years old, quite strong and of straight figure. He said, \"I know that I enjoyed my hearing and seeing powers only because of the invocation of Allah's Apostle . My aunt took me to him and said, 'O Allah's Apostle! My nephew is sick; will you invoke Allah for him?' So he invoked (Allah) for me.\"",
      "usc_msa_ref": "740",
      "chain": [
        "30312",
        "20452"
      ]
    },
    {
      "id": "sahih-bukhari-6631",
      "hadith_no": "6631",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا الفضل بن موسى، أخبرنا الفضيل، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ما بين منكبى الكافر مسيرة ثلاثة أيام للراكب المسرع‏\"‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The width between the two shoulders of a Kafir      (disbeliever) will be equal to the distance covered by a fast rider in     three days.\"",
      "usc_msa_ref": "559",
      "chain": [
        "30176",
        "20452",
        "20271",
        "11172",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2280",
      "hadith_no": "2280",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا ابن المبارك، ويزيد بن هارون، ح وحدثني علي بن حجر، أخبرنا ابن المبارك، والفضل بن موسى، كلهم عن حسين، بهذا الإسناد ولم يذكروا أم كعب ‏.‏",
      "text_en": " This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20025",
        "20472",
        "20387",
        "20025",
        "20452"
      ]
    },
    {
      "id": "sahih-muslim-3316",
      "hadith_no": "3316",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني علي بن خشرم، أخبرنا عيسى، عن ابن جريج، عن ابن شهاب، حدثنا سليمان بن يسار، عن ابن عباس، عن الفضل، أن امرأة، من خثعم قالت يا رسول الله إن أبي شيخ كبير عليه فريضة الله في الحج وهو لا يستطيع أن يستوي على ظهر بعيره ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فحجي عنه ‏\"‏ ‏.‏",
      "text_en": " Fadl reported that a woman of Banu Khath'am said:                      Messenger of Allah, my father is very old. There is an old obligation of Hajj upon him from Allah, but he is not capable of sitting on the back of the camel. Thereupon Allah's Apostle (may peace be upon him) said: Perform Hajj on his behalf.",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "20347",
        "11070",
        "11013",
        "11005",
        "17",
        "20452"
      ]
    },
    {
      "id": "sahih-muslim-3415",
      "hadith_no": "3415",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يوسف بن عيسى، حدثنا الفضل بن موسى، أخبرنا هشام بن عروة، عن صالح بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصبر أحد على لأواء المدينة ‏\"‏ ‏.‏ بمثله ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      None who shows endurance on the hardships of Medina,... (the rest of the hadith is the same).",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "11065",
        "10511",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4041",
      "hadith_no": "4041",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا الثقفي، عن أيوب، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم جميعا عن وكيع، عن سفيان، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن جريج، ح وحدثني علي بن حجر، حدثنا الفضل بن موسى، عن شريك، عن شعبة، كلهم عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Ibn Abbas (Allah be pleased with them).",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "11015",
        "30201",
        "30123",
        "20032",
        "20012",
        "30490",
        "20023",
        "11070",
        "20387",
        "20452",
        "20587",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-4850",
      "hadith_no": "4850",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا الفضل بن موسى، حدثنا إسماعيل، بن أبي خالد أخبرنا قيس بن أبي حازم، قال سمعت عدي بن عميرة الكندي، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديثهم ‏.‏",
      "text_en": " Adi b. 'Amira al-Kindi heard Allah's Messenger (may peace be upon him) as saying (as) was narrated in the (above-mentioned) hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20452",
        "11418",
        "11046",
        "5171"
      ]
    },
    {
      "id": "sahih-muslim-5759",
      "hadith_no": "5759",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا حسين بن حريث أبو عمار، حدثنا الفضل بن موسى، أخبرنا طلحة بن، يحيى عن أبي بردة، عن أبي موسى الأشعري، قال جاء أبو موسى إلى عمر بن الخطاب فقال السلام عليكم هذا عبد الله بن قيس ‏.‏ فلم يأذن له فقال السلام عليكم هذا أبو موسى السلام عليكم هذا الأشعري ‏.‏ ثم انصرف فقال ردوا على ردوا على ‏.‏ فجاء فقال يا أبا موسى ما ردك كنا في شغل ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الاستئذان ثلاث فإن أذن لك وإلا فارجع ‏\"‏ ‏.‏ قال لتأتيني على هذا ببينة وإلا فعلت وفعلت ‏.‏ فذهب أبو موسى قال عمر إن وجد بينة تجدوه عند المنبر عشية وإن لم يجد بينة فلم تجدوه ‏.‏ فلما أن جاء بالعشي وجدوه قال يا أبا موسى ما تقول أقد وجدت قال نعم أبى بن كعب ‏.‏ قال عدل ‏.‏ قال يا أبا الطفيل ما يقول هذا قال سمعت رسول الله صلى الله عليه وسلم يقول ذلك يا ابن الخطاب فلا تكونن عذابا على أصحاب رسول الله صلى الله عليه وسلم ‏.‏ قال سبحان الله إنما سمعت شيئا فأحببت أن أتثبت ‏.‏",
      "text_en": " Abu Musa Ash'ari reported that he went to 'Umar b. Khattab and greeted him by saying:                      As-Salamu-'Alaikum, here is 'Abdullah b. Qais, but he did not permit him (to get in). He (Abu Musa Ash'ari) again greeted him with as-Salamu-'Alaikum and said: Here is Abu Musa, but he (Hadrat 'Umar) did not permit him (to get in). He again said: As-Salam-u-'Alaikum, (and said) here is Ash'ari, (then receiving no response he came back). He (Hadrat 'Umar) said: Bring him back to me, bring him back to me So he went there (in the presence of Hadrat 'Umar) and he said to him: Abu Musa, what made you go back, while we were busy in some work? He said: I heard Allah's Messenger (may. peace be upon him) as saying: Permission should be sought thrice. And if you are permitted, (then get in), otherwise go back. He said: Bring witness to this fact, otherwise I shall do this and that, i. e. I shall punish you. Abu Musa went away and 'Umar said to him (on his departure): It he (Abu Musa) finds a witness he should meet him by the side of the pulpit in the evening and it he does not find a witness you would not find him there. When it was evening he (Hadrat 'Umar) found him (Abu Musa) there. He (Hadrat 'Umar) said: Abu Musa, have you been able to find a witness to what you have said? He said: Yes. Here is Ubayy bin Ka'b, whereupon he (Hadrat 'Umar) said: Yes, he is an authentic (witness). He (Hadrat 'Umar) said: Abu Tufail (the kunya of Ubayy b. Ka'b), what does he (Abu Musa say? Thereupon he said: Ibn Khattab, I heard Allah's Messenger (may peace be upon him) as saying so. Do not prove to be a hard (task-master) for the Companions of Allah's Messenger (may peace be upon him), whereupon he Hadrat 'Umar said: Hallowed be Allah. I had heard something (in this connection), but I wished it to be established (as an undeniable fact).",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11863",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-6470",
      "hadith_no": "6470",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان أبو أحمد، حدثنا الفضل بن موسى السيناني، أخبرنا  طلحة بن يحيى بن طلحة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أسرعكن لحاقا بي أطولكن يدا ‏\"‏ ‏.‏ قالت فكن يتطاولن أيتهن أطول يدا ‏.‏ قالت فكانت أطولنا يدا زينب لأنها كانت تعمل بيدها وتصدق ‏.‏",
      "text_en": " 'A'isha, the Mother of the Faithful, reported that Allah's Messenger (may peace be upon him) said:                      One who has the longest hands amongst you would meet me most immediately. She farther said: They (the wives of Allah's Apostle) used to measure the hands as to whose hand was the longest and it was the hand of Zainab that was the longest amongst them, as she used to work with her hand and Spend (that income) on charity.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6593",
      "hadith_no": "6593",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني حسين بن حريث، حدثنا الفضل بن موسى، عن خثيم بن عراك، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم سالمها الله وغفار غفر الله لها أما إني لم أقلها ولكن قالها الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon. Verily it is not I that say this, but (it is) Allah the Exalted and Glorious. (who) says this.",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11504",
        "11204",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7389",
      "hadith_no": "7389",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني أبو عمار، حسين بن حريث حدثنا الفضل بن موسى، عن الحسين، عن  مطر، حدثني قتادة، عن مطرف بن عبد الله بن الشخير، عن عياض بن حمار، أخي بني مجاشع قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم خطيبا فقال ‏\"‏ إن الله أمرني ‏\"‏ ‏.‏ وساق الحديث بمثل حديث هشام عن قتادة وزاد فيه ‏\"‏ وإن الله أوحى إلى أن تواضعوا حتى لا يفخر أحد على أحد ولا يبغي أحد على أحد ‏\"‏ ‏.‏ وقال في حديثه ‏\"‏ وهم فيكم تبعا لا يبغون أهلا ولا مالا ‏\"‏ ‏.‏ فقلت فيكون ذلك يا أبا عبد الله قال نعم  والله لقد أدركتهم في الجاهلية وإن الرجل ليرعى على الحى ما به إلا وليدتهم يطؤها  ‏.‏",
      "text_en": " Iyad. b. Himar reported tbat, while Allah's Messenger (may peace be upon him) was delivering an address, he stated that Allah commanded me The rest of the hadith is the same, and there is an addition in it:                     \" Allah revealed to me that we should be humble amongst ourselves and none should show pride upon the others, And it does not behove one to do so, and He also said: There are among you people to follow not caring a bit for their family and property. Qatada said: Abu Abdullah, would this happen? Thereupon he said: Yes. By Allah, I found this in the days of ignorance that a person grazed the goat of a tribe and did not find anyone but their slave-girl (and he did not spare her) but committed adultery with her.",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "11278",
        "11019",
        "11305",
        "5217"
      ]
    },
    {
      "id": "sunan-abi-daud-1025",
      "hadith_no": "1025",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرنا الفضل بن موسى، عن عبد الله بن كيسان، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم سمى سجدتى السهو المرغمتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) named the two prostrations of forgetfulness disgraceful for the devil.",
      "usc_msa_ref": "",
      "chain": [
        "30379",
        "20452",
        "18570",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1130",
      "hadith_no": "1130",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة المروزي، أخبرنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن عطاء، عن ابن عمر، قال كان إذا كان بمكة فصلى الجمعة تقدم فصلى ركعتين ثم تقدم فصلى أربعا وإذا كان بالمدينة صلى الجمعة ثم رجع إلى بيته فصلى ركعتين ولم يصل في المسجد فقيل له فقال كان رسول الله صلى الله عليه وسلم يفعل ذلك ‏.‏",
      "text_en": " 'Ata said:                      When Ibn 'Umar offered the Friday prayer in Mecca he would go forward and pray two rak'ahs, he would then go forward and pray four rak'ahs; but when he was in Medina, he offered the Friday prayer, then returned to his house and prayed two rak'ahs, not praying them in the mosque. Someone mentioned this to him and he replied that the Messenger of Allah (ﷺ) used to do it.",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "11875",
        "11411",
        "11029",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1155",
      "hadith_no": "1155",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا الفضل بن موسى السيناني، حدثنا ابن جريج، عن عطاء، عن عبد الله بن السائب، قال شهدت مع رسول الله صلى الله عليه وسلم العيد فلما قضى الصلاة قال ‏\"‏ إنا نخطب فمن أحب أن يجلس للخطبة فليجلس ومن أحب أن يذهب فليذهب ‏\"‏ ‏.‏ قال أبو داود هذا مرسل عن عطاء عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn as-Sa'ib:                     I attended the 'Id prayer along with the Messenger of Allah (ﷺ). When he finished the prayer, he said: We shall deliver the sermon; he who likes to sit for listening to it may sit and he who likes to go away may go away.Abu Dawud said: this is a mursal tradition (i.e. the successor 'Ata directly reporting from the Prophet (ﷺ) and omitting the link of the Companions).",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20452",
        "11070",
        "11029",
        "2065"
      ]
    },
    {
      "id": "sunan-abi-daud-1419",
      "hadith_no": "1419",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن المثنى، حدثنا أبو إسحاق الطالقاني، حدثنا الفضل بن موسى، عن عبيد الله بن عبد الله العتكي، عن عبد الله بن بريدة، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الوتر حق فمن لم يوتر فليس منا الوتر حق فمن لم يوتر فليس منا الوتر حق فمن لم يوتر فليس منا ‏\"‏‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     I heard the Messenger of Allah (ﷺ) say: The witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20642",
        "20452",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2049",
      "hadith_no": "2049",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "قال أبو داود كتب إلى حسين بن حريث المروزي حدثنا الفضل بن موسى، عن الحسين بن واقد، عن عمارة بن أبي حفصة، عن عكرمة، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إن امرأتي لا تمنع يد لامس ‏.‏ قال ‏\"‏ غربها ‏\"‏ ‏.‏ قال أخاف أن تتبعها نفسي ‏.‏ قال ‏\"‏ فاستمتع بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man came to the Prophet (ﷺ), and said: My wife does not prevent the hand of a man who touches her. He said: Divorce her. He then said: I am afraid my inner self may covet her. He said: Then enjoy her.",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "11711",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2225",
      "hadith_no": "2225",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "قال أبو داود سمعت محمد بن عيسى، يحدث به حدثنا المعتمر، قال سمعت الحكم بن أبان، يحدث بهذا الحديث ولم يذكر ابن عباس قال عن عكرمةقال أبو داود كتب إلى الحسين بن حريث قال أخبرنا الفضل بن موسى، عن معمر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، بمعناه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dawud said “I heard Muhammad bin Isa narrating this tradition who said Mu’tamar narrated it to us. And he (Mu’tamar) said “ I heard Al Hakam bin Aban narrating this tradition. He did not mention the name of Ibn ‘Abbas.Abu Dawud said “Al Hussain bin Huraith wrote to me saying “Al Fadl bin Musa narrated from Ibn ‘Abbas to the same effect from the Prophet(ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "31167",
        "20288",
        "19904",
        "20452",
        "20115",
        "19904",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-3818",
      "hadith_no": "3818",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرنا الفضل بن موسى، عن حسين بن واقد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وددت أن عندي خبزة بيضاء من برة سمراء ملبقة بسمن ولبن ‏\"‏ ‏.‏ فقام رجل من القوم فاتخذه فجاء به فقال ‏\"‏ في أى شىء كان هذا ‏\"‏ ‏.‏ قال في عكة ضب قال ‏\"‏ ارفعه ‏\"‏ ‏.‏ قال أبو داود هذا حديث منكر ‏.‏ قال أبو داود وأيوب ليس هو السختياني ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: I wish I had a white loaf made from tawny and softened with clarified butter and milk. A man from among the people got up and getting one brought it. He asked: In which had it been? He replied: In a lizard skin. He said: Take it away.Abu Dawud said: This is a munkar (rejected) tradition.Abu Dawud said: Ayyub, the narrator of this tradition, is not (Ayyub) al-Sakhtiyani.",
      "usc_msa_ref": "",
      "chain": [
        "30379",
        "20452",
        "20648",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4025",
      "hadith_no": "4025",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا الفضل بن موسى، عن عبد المؤمن بن خالد الحنفي، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى رسول الله صلى الله عليه وسلم القميص ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The clothing which the Messenger of Allah (ﷺ) liked best was shirt.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20452",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-137",
      "hadith_no": "137",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسين بن حريث، أخبرنا الفضل بن موسى، عن أبي حمزة السكري، عن عبد الكريم، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كان دما أحمر فدينار وإذا كان دما أصفر فنصف دينار ‏\"‏ ‏.‏ قال أبو عيسى حديث الكفارة في إتيان الحائض قد روي عن ابن عباس موقوفا ومرفوعا ‏.‏ وهو قول بعض أهل العلم ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال ابن المبارك يستغفر ربه ولا كفارة عليه ‏.‏ وقد روي نحو قول ابن المبارك عن بعض التابعين منهم سعيد بن جبير وإبراهيم النخعي وهو قول عامة علماء الأمصار ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"When the blood is red then (give) a Dinar. And when the blood is yellow then half Dinar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20458",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-170",
      "hadith_no": "170",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الله بن عمر العمري، عن القاسم بن غنام، عن عمته أم فروة، وكانت، ممن بايعت النبي صلى الله عليه وسلم قالت سئل النبي صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ الصلاة لأول وقتها ‏\"‏ ‏.‏",
      "text_en": " Umm Farwah - and she was one of those who gave pledge of allegiance to the Prophet  - narrated:                     \"The Prophet was asked: 'Which deed is the best?' So he said: 'Salat in the beginning of its time.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20507",
        "12432"
      ]
    },
    {
      "id": "jami-al-tirmidhi-587",
      "hadith_no": "587",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمود بن غيلان، وغير، واحد، قالوا حدثنا الفضل بن موسى، عن عبد الله بن سعيد بن أبي هند، عن ثور بن زيد، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يلحظ في الصلاة يمينا وشمالا ولا يلوي عنقه خلف ظهره ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد خالف وكيع الفضل بن موسى في روايته ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Messenger of Allah would glance toward the right and the left during Salat but he would not turn his neck to look behind him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "11184",
        "11155",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-905",
      "hadith_no": "905",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسين بن حريث، وغير، واحد، قالوا حدثنا الفضل بن موسى، عن حسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع النبي صلى الله عليه وسلم في سفر ‏.‏ فحضر الأضحى فاشتركنا في البقرة سبعة وفي الجزور عشرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب وهو حديث حسين بن واقد ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"We were with the Prophet on a journey (on the Day of) Adha, so seven of us shared in a cow, and ten for a camel.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1035",
      "hadith_no": "1035",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عبد الله بن المبارك، والفضل بن موسى، عن حسين المعلم، عن عبد الله بن بريدة، عن سمرة بن جندب، أن النبي صلى الله عليه وسلم صلى على امرأة فقام وسطها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة عن حسين المعلم ‏.‏",
      "text_en": " Samurah bin Jundab narrated:                     \"The Prophet prayed over a woman, so he stood at her middle.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20025",
        "20452",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1222",
      "hadith_no": "1222",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن غيلان، أنبأنا الفضل بن موسى، عن سفيان، أنبأنا محمد بن عبد الرحمن، وهو مولى آل طلحة عن سليمان بن يسار، عن الربيع بنت معوذ بن عفراء، أنها اختلعت على عهد النبي صلى الله عليه وسلم فأمرها النبي صلى الله عليه وسلم - أو أمرت - أن تعتد بحيضة ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث الربيع الصحيح أنها أمرت أن تعتد بحيضة ‏.‏",
      "text_en": " AR-Rubayyi bint Mu'awwidh bin Al-Afra narrated:                     that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "20012",
        "11105",
        "11005",
        "617"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1239",
      "hadith_no": "1239",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "أنبأنا أبو عمار الحسين بن حريث، أنبأنا الفضل بن موسى، عن معمر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، أن رجلا، أتى النبي صلى الله عليه وسلم قد ظاهر من امرأته فوقع عليها فقال يا رسول الله إني قد ظاهرت من زوجتي فوقعت عليها قبل أن أكفر ‏.‏ فقال ‏\"‏ وما حملك على ذلك يرحمك الله ‏\"‏ ‏.‏ قال رأيت خلخالها في ضوء القمر ‏.‏ قال ‏\"‏ فلا تقربها حتى تفعل ما أمرك الله به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     A man came to the Prophet, and he had uttered Zihar upon his wife then he had intercourse with her. So he said: 'O Messenger of Allah! I uttered Zihar against my wife, then I had intercourse with her before atoning.' He (pbuh) said: \"What caused you to do that, may Allah have mercy upon you?' He said: 'I saw her anklets in the moonlight.' He said: 'Then do not go near her until you have done what Allah ordered (for it).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20115",
        "19904",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1288",
      "hadith_no": "1288",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث الخزاعي، حدثنا الفضل بن موسى، عن صالح بن أبي جبير، عن أبيه، عن رافع بن عمرو، قال كنت أرمي نخل الأنصار فأخذوني فذهبوا بي إلى النبي صلى الله عليه وسلم فقال ‏\"‏ يا رافع لم ترمي نخلهم ‏\"‏ ‏.‏ قال قلت يا رسول الله الجوع ‏.‏ قال ‏\"‏ لا ترم وكل ما وقع أشبعك الله وأرواك ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Rafi' bin 'Amr:                     \"I was throwing stones at a date-palm belonging to some of the Ansar. They tool me along with them to the Prophet (ﷺ). He said: \"O Rafi'! Why were you throwing stones at their date-palm?'\" He said: \"I said: 'Out of hunger, O Messenger of Allah! He said: 'Do not throw stones at them, eat what falls. May Allah fill you and quench your thirst.'\"This Hadith is Hasan Gharib Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "3241"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1371",
      "hadith_no": "1371",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا الفضل بن موسى، عن أبي حمزة السكري، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشريك شفيع والشفعة في كل شيء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مثل هذا إلا من حديث أبي حمزة السكري ‏.‏ وقد روى غير واحد هذا الحديث عن عبد العزيز بن رفيع عن ابن أبي مليكة عن النبي صلى الله عليه وسلم مرسلا وهذا أصح ‏.‏  حدثنا هناد، حدثنا أبو بكر بن عياش، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن النبي صلى الله عليه وسلم نحوه بمعناه وليس فيه عن ابن عباس وهكذا روى غير واحد عن عبد العزيز بن رفيع مثل هذا ليس فيه عن ابن عباس وهذا أصح من حديث أبي حمزة ‏.‏ وأبو حمزة ثقة يمكن أن يكون الخطأ من غير أبي حمزة ‏.‏  حدثنا هناد، حدثنا أبو الأحوص، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن النبي صلى الله عليه وسلم نحو حديث أبي بكر بن عياش ‏.‏ وقال أكثر أهل العلم إنما تكون الشفعة في الدور والأرضين ولم يروا الشفعة في كل شيء ‏.‏ وقال بعض أهل العلم الشفعة في كل شيء ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Narrated Ibn Abbas:                     that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "20458",
        "11257",
        "11090",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1385",
      "hadith_no": "1385",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمود بن غيلان، أخبرنا الفضل بن موسى الشيباني، أخبرنا شريك، عن شعبة، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لم يحرم المزارعة ولكن أمر أن يرفق بعضهم ببعض ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وحديث رافع فيه اضطراب يروى هذا الحديث عن رافع بن خديج عن عمومته ويروى عنه عن ظهير بن رافع وهو أحد عمومته وقد روي هذا الحديث عنه على روايات مختلفة ‏.‏ وفي الباب عن زيد بن ثابت وجابر رضى الله عنهما ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "20587",
        "20020",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1391",
      "hadith_no": "1391",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو عمار، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن يزيد بن عمرو النحوي، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ دية الأصابع اليدين والرجلين سواء عشر من الإبل لكل أصبع ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي موسى وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح غريب من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم وبه يقول سفيان والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"The blood-money for the fingers on the hands and (the toes of) the feet is the same: Ten camels for each finger.\"",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "16117",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1398",
      "hadith_no": "1398",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن يزيد الرقاشي، حدثنا أبو الحكم البجلي، قال سمعت أبا سعيد الخدري، وأبا، هريرة يذكران عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو أن أهل السماء وأهل الأرض اشتركوا في دم مؤمن لأكبهم الله في النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏. ‏وأبو الحكم البجلي هو عبد الرحمن بن أبي نعم الكوفي.",
      "text_en": " Narrated Abul-Hakam Al-Bajali:                     \"I heard Abu Sa'eed Al-Khudri and Abu Hurairah mentioning from the Messenger of Allah (ﷺ) that he said: 'If the inhabitants of the heavens and the inhabitants of the earth all took part in shedding the blood of believer, then Allah would cast them (all) in the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "14422",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1501",
      "hadith_no": "1501",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فحضر الأضحى فاشتركنا في البقرة سبعة وفي البعير عشرة ‏.‏ قال أبو عيسى وفي الباب عن أبي الأسود السلمي عن أبيه عن جده وأبي أيوب ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن غريب لا نعرفه إلا من حديث الفضل بن موسى ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"We were with the Messenger of Allah (ﷺ) on a journey when the (Day of) Adha came, so we shared seven for a cow and ten for a camel.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1723",
      "hadith_no": "1723",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، حدثنا واقد بن عمرو بن سعد بن معاذ، قال قدم أنس بن مالك فأتيته فقال من أنت فقلت أنا واقد بن عمرو بن سعد بن معاذ، ‏.‏ قال فبكى وقال إنك لشبيه بسعد وإن سعدا كان من أعظم الناس وأطولهم وإنه بعث إلى النبي صلى الله عليه وسلم جبة من ديباج منسوج فيها الذهب فلبسها رسول الله صلى الله عليه وسلم فصعد المنبر فقام أو قعد فجعل الناس يلمسونها فقالوا ما رأينا كاليوم ثوبا قط ‏.‏ فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة خير مما ترون ‏\"‏ ‏.‏ قال وفي الباب عن أسماء بنت أبي بكر ‏.‏ وهذا حديث صحيح ‏.‏",
      "text_en": " Narrated Waqid bin 'Amr bin Sa'd bin Mu'adh:                     \"Anas bin Malik arrived. So I went to him and he said: 'Who are you ?' I said: 'I am Waqid bin 'Amr [bin Sa'd bin Ma'adh].'\" He said: \"So he began to cry and he said: 'You resemble Sa'd. Sa'd was one of the greatest people, and of the tallest. The Messenger of Allah (ﷺ) was sent a cloak of Dibaj with gold woven into it. The Messenger of Allah (ﷺ) wore it and ascended the Minbar. Then he stood, or sat, and the people began touching it, and they said: 'We never saw a garment like this before today.' So he said: 'Are you amazed at this ? The handkerchiefs of Sa'd in Paradise are better than what you see.'\"He said: There is something on this topic from Asma' bint Abu Bakr. This Hadith is Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "11220",
        "10621",
        "9"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1762",
      "hadith_no": "1762",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، والفضل بن موسى، وزيد بن حباب، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث عبد المؤمن بن خالد تفرد به وهو مروزي ‏.‏ وروى بعضهم هذا الحديث عن أبي تميلة عن عبد المؤمن بن خالد عن عبد الله بن بريدة عن أمه عن أم سلمة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is from Al-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, from Umm Salamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, from Umm Salamah is more correct, Abu Tumailah mentioned 'his mother' in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20183",
        "20452",
        "20650",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1764",
      "hadith_no": "1764",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الفضل بن موسى، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى رسول الله صلى الله عليه وسلم القميص ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20452",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2164",
      "hadith_no": "2164",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا يحيى بن أكثم، والجارود بن معاذ، قالا حدثنا الفضل بن موسى، حدثنا الحسين بن واقد، عن أوفى بن دلهم، عن نافع، عن ابن عمر، قال صعد رسول الله صلى الله عليه وسلم المنبر فنادى بصوت رفيع فقال ‏\"‏ يا معشر من قد أسلم بلسانه ولم يفض الإيمان إلى قلبه لا تؤذوا المسلمين ولا تعيروهم ولا تتبعوا عوراتهم فإنه من تتبع عورة أخيه المسلم تتبع الله عورته ومن تتبع الله عورته يفضحه ولو في جوف رحله ‏\"‏ قال ونظر ابن عمر يوما إلى البيت أو إلى الكعبة فقال ما أعظمك وأعظم حرمتك والمؤمن أعظم حرمة عند الله منك ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الحسين بن واقد ‏.‏ وروى إسحاق بن إبراهيم السمرقندي عن حسين بن واقد نحوه وروي عن أبي برزة الأسلمي عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Nafi'",
      "usc_msa_ref": "",
      "chain": [
        "38696",
        "20452",
        "20648",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2220-2",
      "hadith_no": "2220",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر، حدثنا الفضل بن موسى، عن شريك بن عبد الله، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏ قال أبو عيسى يقال الكذاب المختار بن أبي عبيد والمبير الحجاج بن يوسف ‏.‏ حدثنا أبو داود سليمان بن سلم البلخي أخبرنا النضر بن شميل عن هشام بن حسان قال أحصوا ما قتل الحجاج صبرا فبلغ مائة ألف وعشرين ألف قتيل ‏.‏\t قال أبو عيسى وفي الباب عن أسماء بنت أبي بكر ‏.‏ حدثنا عبد الرحمن بن واقد، حدثنا شريك، نحوه بهذا الإسناد ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏ وشريك يقول عبد الله بن عصم وإسرائيل يقول عبد الله بن عصمة ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah(s.a.w) said:                     \"In Thaqif there will be a great liar and destroyer.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20452",
        "20587",
        "15290",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2307-2",
      "hadith_no": "2307",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكثروا ذكر هاذم اللذات ‏\"‏ ‏.‏ يعني الموت ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Increase in remembrance of the severer of pleasures.\" Meaning death.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2627",
      "hadith_no": "2627",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، أخبرنا الفضل بن موسى، عن زكريا بن أبي زائدة، عن عطية، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من أمتي من يشفع للفئام ومنهم من يشفع للقبيلة ومنهم من يشفع للعصبة ومنهم من يشفع للرجل حتى يدخلوا الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Abu Sa'eed narrated the Messenger of Allah (s.a.w)said:                     \"Indeed in my Ummah are those who intercede for large groups pf people, and among them  (there are) who intercede for a tribe, and among them (there are) who intercede for a group, and among them (there are) who intercede for a man, until they are admitted to Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11338",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2668",
      "hadith_no": "2668",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا الجارود بن معاذ، حدثنا الفضل بن موسى، عن سفيان الثوري، عن أبي حمزة، عن إبراهيم النخعي، قال البناء كله وبال قلت أرأيت ما لا بد منه قال لا أجر ولا وزر ‏.‏",
      "text_en": " Sufyan Ath-Thawri narrated:                     From Abu Hamzah, (who said): \"From Ibrahim An-Nakha'i who said: 'All buildings and concerns for them will be against you.' I said: 'What do you think about what one can not do without?' He said: 'There is no reward for that nor harm.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20012",
        "20458",
        "11051"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2621-2",
      "hadith_no": "2621",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، ويوسف بن عيسى، قالا حدثنا الفضل بن موسى، عن الحسين بن واقد، ح وحدثنا أبو عمار الحسين بن حريث، ومحمود بن غيلان، قالا حدثنا علي بن الحسين بن واقد، عن أبيه، ح وحدثنا محمد بن علي بن الحسن بن شقيق، ومحمود بن غيلان، قالا حدثنا علي بن الحسن بن شقيق، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abdullah bin Buraidah narrated from his father:                     that the Messenger of Allah (ﷺ) said: \"The covenant between us and them is the Salat, so whoever abandons it he has committed disbelief.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "30401",
        "20452",
        "20648",
        "30325",
        "30277",
        "30555",
        "20648",
        "38554",
        "30277"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2640-2",
      "hadith_no": "2640",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسين بن حريث أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تفرقت اليهود على إحدى وسبعين أو اثنتين وسبعين فرقة والنصارى مثل ذلك وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن عمرو وعوف بن مالك ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The Jews split into seventy-one sects, or seventy-two sects, and the Christians similarly, and my Ummah will split into seventy-three sects.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3078",
      "hadith_no": "3078",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سميتم باسمي فلا تكتنوا بي ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir:                     that the Messenger of Allah (ﷺ): \"When you name yourself after me, then do not use my Kunyah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11263",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3400",
      "hadith_no": "3400",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، عن سفيان، عن سماك، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم نحوه بمعناه ولم يذكر فيه الأعمش وقد روى سليمان التيمي هذا الحديث عن أبي عثمان النهدي عن ابن مسعود عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "20012",
        "10770",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3404",
      "hadith_no": "3404",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث الخزاعي المروزي، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الكريم بن الكريم بن الكريم بن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم قال ولو لبثت في السجن ما لبث ثم جاءني الرسول أجبت ‏.‏ ثم قرأ ‏:‏ ‏(‏ فلما جاءه الرسول قال ارجع إلى ربك فاسأله ما بال النسوة اللاتي قطعن أيديهن ‏)‏ قال ‏:‏ ورحمة الله على لوط إن كان ليأوي إلى ركن شديد إذ قال ‏:‏ ‏(‏ لو أن لي بكم قوة أو آوي إلى ركن شديد ‏)‏ فما بعث الله من بعده نبيا إلا في ذروة من قومه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Indeed, the honorable, the son of the honorable, the son of the honorable, the son of the honorable: Yusuf bin Ya'qub bin Ishaq bin Ibrahim.\" He said: \"And if I were to have remained in the prison as long as Yusuf, then the messenger came, I would have accepted.\" Then he recited: When the messenger came to him, he said: \"Return to your king and ask him: 'What happened to the women who cut their hands? (12:50)' He said: \"May Allah have mercy upon Lut, certainly he used to lean toward powerful support, since he said: \"Would that I had strength to overpower you, or that I could betake myself to some powerful support (11:80).\" So Allah did not send a Prophet after him except among a high ranking family (Dhirwah) among his people.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3416",
      "hadith_no": "3416",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن أبى بن كعب، قال قال النبي صلى الله عليه وسلم ‏\"‏ ما أنزل الله في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     that the Messenger of Allah (ﷺ) said: \"Allah has not revealed the likes of Umm Al-Kitab in the Tawrah, nor the Injil. It is the seven oft-repeated, and (Allah said) 'It is divided between Myself and My slave, and My slave shall have what he asks for.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11875",
        "10606",
        "11884",
        "13",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3421",
      "hadith_no": "3421",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن عيسى بن عبيد، عن الربيع بن أنس، عن أبي العالية، قال حدثني أبى بن كعب، قال لما كان يوم أحد أصيب من الأنصار أربعة وستون رجلا ومن المهاجرين ستة فيهم حمزة فمثلوا بهم فقالت الأنصار لئن أصبنا منهم يوما مثل هذا لنربين عليهم قال فلما كان يوم فتح مكة فأنزل الله ‏(‏ وإن عاقبتم فعاقبوا بمثل ما عوقبتم به ولئن صبرتم لهو خير للصابرين ‏)‏ فقال رجل لا قريش بعد اليوم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كفوا عن القوم إلا أربعة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من حديث أبى بن كعب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"On the Day of Uhud, sixty-four of the Ansar were killed, and six from the Muhajirin, one of whom was Hamzah, and they mutilated them, so the Ansar said: 'If, (in the future) we are able to kill them on a day like this, we would mutilate from among them as twice as they (mutilate from among us).'\" He said: \"So on the day of the Conquest of Makkah, Allah revealed: And if you punish them, then punish them with the like of that with which you were afflicted. But if you have patience, then it is better for those who are patient (16:126). So a man said: 'There shall be no Quraish after today.' But the Messenger of Allah (ﷺ) said: 'Leave the people, except for four.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "28471",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3577",
      "hadith_no": "3577",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن أبي إسحاق، عن البراء بن عازب، في قوله ‏:‏ ‏(‏ إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون ‏)‏ قال فقام رجل فقال يا رسول الله إن حمدي زين وإن ذمي شين فقال النبي صلى الله عليه وسلم ‏\"‏ ذاك الله تعالى ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Al-Bara bin 'Azib:                     regarding the saying of Allah the Most High: Verily, those who call you from behind the dwellings, most of them have no sense (49:4). He said: \"A man stood and said: 'O Messenger of Allah! Indeed my praise (of others) is worthwhile and my censure is appropriate.' So the Prophet (ﷺ) said: 'That is for Allah, the Mighty and Sublime.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11049",
        "400"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3377-2",
      "hadith_no": "3377",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الله بن سعيد، هو ابن أبي هند عن زياد، مولى ابن عياش عن أبي بحرية، عن أبي الدرداء، رضي الله عنه قال قال النبي صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بخير أعمالكم وأزكاها عند مليككم وأرفعها في درجاتكم وخير لكم من إنفاق الذهب والورق وخير لكم من أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ ذكر الله تعالى ‏\"‏ ‏.‏ فقال معاذ بن جبل رضى الله عنه ما شيء أنجى من عذاب الله من ذكر الله ‏.‏ قال أبو عيسى وقد روى بعضهم هذا الحديث عن عبد الله بن سعيد مثل هذا بهذا الإسناد وروى بعضهم عنه فأرسله ‏.‏",
      "text_en": " Abu Ad-Darda [may Allah be pleased with him] narrated that :                     the Prophet said: “Should I not inform you of the best of your deed, and the purest of them with your Master, and the highest of them in your ranks, and what is better for you than spending gold and silver, and better for you than meeting your enemy and striking their necks, and they strike your necks?” They said: “Of course.” He said, “The remembrance of Allah [Most High].” [Then] Mu’adh bin Jabal [may Allah be pleased with him] said: “There is nothing that brings more salvation from the punishment of Allah than the remembrance of Allah.”",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11184",
        "19921"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3504-2",
      "hadith_no": "3504",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا الفضل بن موسى، عن الحسين بن واقد، عن أبي إسحاق، عن الحارث، عن علي، رضى الله عنه قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا أعلمك كلمات إذا قلتهن غفر الله لك وإن كنت مغفورا لك ‏\"‏ ‏.‏ قال ‏\"‏ قل لا إله إلا الله العلي العظيم لا إله إلا الله الحليم الكريم لا إله إلا الله سبحان الله رب العرش العظيم ‏\"‏ ‏.‏ قال علي بن خشرم وأخبرنا علي بن الحسين بن واقد، عن أبيه، بمثل ذلك إلا أنه قال في آخرها ‏\"‏ الحمد لله رب العالمين ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث أبي إسحاق عن الحارث عن علي ‏.‏",
      "text_en": " Ali [may Allah be pleased with him] said:                     “The Messenger of Allah said to me: ‘Should I not teach you some words that if you say them, Allah will forgive you, even if you were already forgiven?’ He said: ‘Say: None has the right to be worshipped by Allah, the Most High, the Magnificent. None has the right to be worshipped but Allah. Glory to Allah, the Lord of the Magnificent Throne. (La Ilaha Illallahul-Aliyul-Azim, La Ilaha Illallahul-Halimul-Karim, Lailaha Illallah, Subhan Allahu Rabbil-Arshil-Azim.)’”",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "20452",
        "20648",
        "11049",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3512-2",
      "hadith_no": "3512",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا الفضل بن موسى، حدثنا سلمة بن وردان، عن أنس بن مالك، أن رجلا، جاء إلى النبي صلى الله عليه وسلم فقال يا رسول الله أى الدعاء أفضل قال ‏\"‏ سل ربك العافية والمعافاة في الدنيا والآخرة ‏\"‏ ‏.‏ ثم أتاه في اليوم الثاني فقال يا رسول الله أى الدعاء أفضل فقال له مثل ذلك ثم أتاه في اليوم الثالث فقال له مثل ذلك ‏.‏ قال ‏\"‏ فإذا أعطيت العافية في الدنيا وأعطيتها في الآخرة فقد أفلحت ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه إنما نعرفه من حديث سلمة بن وردان ‏.‏",
      "text_en": " Anas bin Malik narrated that a man came to the Prophet and said:                     “O Messenger of Allah, which supplication is the best?” He said: “Ask Your Lord For Al-Afiyah and Al-Mu’afah in this world and in the Hereafter.” Then he came to him on the second day and said: “O Messenger of Allah, which supplication is the best?” So he said to him similar to that. Then he came to him on the third day, so he said to him similar to that. He said: “So when you have been given Al-Afiyah in this world, and you have been given it in the Hereafter, then you have succeeded.”",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3533-2",
      "hadith_no": "3533",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا الفضل بن موسى، عن الأعمش، عن أنس، أن رسول الله صلى الله عليه وسلم مر بشجرة يابسة الورق فضربها بعصاه فتناثر الورق فقال ‏\"‏ إن الحمد لله وسبحان الله ولا إله إلا الله والله أكبر لتساقط من ذنوب العبد كما تساقط ورق هذه الشجرة ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ ولا نعرف للأعمش سماعا من أنس إلا أنه قد رآه ونظر إليه ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     the Prophet passed by a tree with dry leaves, so he struck it with his staff, making the leaves fall. Then he said: “Indeed, all praise is due to Allah, (Al-Hamdulillah)’ ‘glory to Allah, (Subhan Allah)’ none has the right to be worshipped by Allah, (La Ilaha Illallah)’ and ‘Allah is the greatest (Allahu Akbar)’ cause the sins to fall from the worshipper, just as the leaves of this tree fall.”",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20452",
        "11060",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4189",
      "hadith_no": "4189",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت أراد النبي صلى الله عليه وسلم أن ينحي مخاط أسامة قالت عائشة دعني دعني حتى أكون أنا الذي أفعل ‏.‏ قال ‏\"‏ يا عائشة أحبيه فإني أحبه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Aishah, the Mother of the Believers:                     \"The Prophet (ﷺ) wanted to wipe the running nose of Usamah.\" 'Aishah said: \"Leave it to me so that I may be the one to do it.\" He said: \"O 'Aishah, love him, for verily I love him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4250",
      "hadith_no": "4250",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما حسدت أحدا ما حسدت خديجة وما تزوجني رسول الله صلى الله عليه وسلم إلا بعد ما ماتت وذلك أن رسول الله صلى الله عليه وسلم بشرها ببيت في الجنة من قصب لا صخب فيه ولا نصب ‏.‏ قال هذا حديث حسن صحيح ‏.‏ من قصب قال إنما يعني به قصب اللؤلؤ ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"I did not envy any woman as I envied Khadijah - and the Messenger of Allah (ﷺ) did not marry me except after she had died - that was because the Messenger of Allah (ﷺ) gave her glad tidings of a house in Paradise made of Qasab, without clamoring nor discomforts in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4280",
      "hadith_no": "4280",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن زكريا بن أبي زائدة، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا إن عيبتي التي آوي إليها أهل بيتي وإن كرشي الأنصار فاعفوا عن مسيئهم واقبلوا من محسنهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ قال وفي الباب عن أنس ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that the Prophet (ﷺ) said: \"Indeed my elite, those whom I lean towards, are the people of my house and my close ones are the Ansar, so forgive those who do wrong from them and accept from those who do good from them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11338",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4302",
      "hadith_no": "4302",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عيسى بن عبيد، عن غيلان بن عبد الله العامري، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله أوحى إلى أى هؤلاء الثلاثة نزلت فهي دار هجرتك المدينة أو البحرين أو قنسرين ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث الفضل بن موسى تفرد به أبو عامر ‏.‏",
      "text_en": " Narrated Jarir bin 'Abdullah:                     that the Prophet (ﷺ) said: \"Indeed Allah has revealed to me that: Whichever of these three places you go to will be the place of your emigration: Al-Madinah, Bahrain, or Qinnasrin.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "28471",
        "28478",
        "11406",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4303",
      "hadith_no": "4303",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، حدثنا هشام بن عروة، عن صالح بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يصبر على لأواء المدينة وشدتها أحد إلا كنت له شهيدا أو شفيعا يوم القيامة ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وسفيان بن أبي زهير وسبيعة الأسلمية ‏.‏ قال وهذا حديث حسن غريب من هذا الوجه ‏.‏ قال وصالح بن أبي صالح أخو سهيل بن أبي صالح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"No one is patient with the difficulties and hardships of Al-Madinah, except that I am an intercessor, or a witness for him on the Day of Judgement.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "11065",
        "10511",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4324",
      "hadith_no": "4324",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الفضل بن موسى، عن شريك، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"In Thaqif there is a liar and a destroyer.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20452",
        "20587",
        "15290",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-100",
      "hadith_no": "100",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن جعيد بن عبد الرحمن، قال أخبرني عبد الملك بن مروان بن الحارث بن أبي ذباب، قال أخبرني أبو عبد الله، سالم سبلان قال وكانت عائشة تستعجب بأمانته وتستأجره فأرتني كيف كان رسول الله صلى الله عليه وسلم يتوضأ فتمضمضت واستنثرت ثلاثا وغسلت وجهها ثلاثا ثم غسلت يدها اليمنى ثلاثا واليسرى ثلاثا ووضعت يدها في مقدم رأسها ثم مسحت رأسها مسحة واحدة إلى مؤخره ثم أمرت يديها بأذنيها ثم مرت على الخدين قال سالم كنت آتيها مكاتبا ما تختفي مني فتجلس بين يدى وتتحدث معي حتى جئتها ذات يوم فقلت ادعي لي بالبركة يا أم المؤمنين ‏.‏ قالت وما ذاك قلت أعتقني الله ‏.‏ قالت بارك الله لك ‏.‏ وأرخت الحجاب دوني فلم أرها بعد ذلك اليوم ‏.‏",
      "text_en": " Abu 'Abdullah Salim Sabalan said:                      \"'Aishah liked my honesty and hired me, and she showed me how the Messenger of Allah (ﷺ) used to perform Wudu'. She rinsed her mouth, sniffed water into her nose and blew it out three times, and washed her face three times. Then she washed her right hand three times and her left hand three times. Then she put her hand on the front of her head and wiped her head once, front to back. Then she rubbed her ears with her hands, then she passed her hands over her cheeks.\"Salim said: \"I came to her as a slave with a contract of manumission, and she did not hide herself from me. She would sit before me and talk to me, until I came to her one day and said: 'Pray for blessing for me, O Mother of Believers.' She said: 'Why is that?' I said: 'Allah has set me free.' She said: 'May Allah bless you.' Then she lowered the Hijab before me, and I never saw her again after that day.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "12317",
        "30184"
      ]
    },
    {
      "id": "sunan-an-nasai-463",
      "hadith_no": "463",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                      \"The Messenger of Allah (ﷺ) said: 'The covenant that stands between us and them is the Salah; whoever abandons it, he has committed disbelief.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-506",
      "hadith_no": "506",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل عليه السلام جاءكم يعلمكم دينكم ‏\"‏ ‏.‏ فصلى الصبح حين طلع الفجر وصلى الظهر حين زاغت الشمس ثم صلى العصر حين رأى الظل مثله ثم صلى المغرب حين غربت الشمس وحل فطر الصائم ثم صلى العشاء حين ذهب شفق الليل ثم جاءه الغد فصلى به الصبح حين أسفر قليلا ثم صلى به الظهر حين كان الظل مثله ثم صلى العصر حين كان الظل مثليه ثم صلى المغرب بوقت واحد حين غربت الشمس وحل فطر الصائم ثم صلى العشاء حين ذهب ساعة من الليل ثم قال ‏\"‏ الصلاة ما بين صلاتك أمس وصلاتك اليوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: This is 'Jibril, peace be upon you, he came to teach you your religion. He prayed Subh when the dawn appeared, and he prayed Zuhr when the sun had (passed its zenith), and he prayed 'Asr when he saw that the shadow of a thing was equal to its height, then he prayed Maghrib when the sub had set and it is permissible for the fasting person to eat. Then he prayed 'Isha' when the twilight had disappeared. Then he came to him the following day and prayed Subh when it had got a little lighter, then he prayed Zuhr when the shadow of a thing was equal to its height, then he prayed 'Asr when the shadow of a thing was equal to twice its height, then he prayed Maghrib at the same time as before, then he prayed 'Isha' when a short period of the night had passed. Then he said: 'The prayer is between the times when you prayed yesterday and the times when you prayed today.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-609",
      "hadith_no": "609",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن أبي رزمة، - واسمه غزوان - قال حدثنا الفضل بن موسى، عن الأعمش، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يصلي بالمدينة يجمع بين الصلاتين بين الظهر والعصر والمغرب والعشاء من غير خوف ولا مطر ‏.‏ قيل له لم قال لئلا يكون على أمته حرج ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) used to pray in Al-Madinah combining two prayer. Joining Zuhr and 'Asr, and Maghrib and 'Isha', when there was no fear nor rain. It was said to him:                      \"Why?\" He said: \"So that there would not be any hardship on his Ummah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "11060",
        "11331",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-695",
      "hadith_no": "695",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن معمر، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني خرجت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Abi Qatadah that his father said:                      \"The Messenger of Allah (ﷺ) said: 'When the Iqamah for prayer is said, do not stand up until you see that I have come out.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20115",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "id": "sunan-an-nasai-914",
      "hadith_no": "914",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنزل الله عز وجل في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah (ﷺ) said: 'Allah, the Mighty and Sublime, did not reveal in the Tawrah or the Injil anything like Umm Al-Quran (Al-Fatihah), which is the seven oft-recited, and (Allah said) it is divided between Myself and My slave will have what he asked for.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11875",
        "10606",
        "11884",
        "13",
        "39"
      ]
    },
    {
      "id": "sunan-an-nasai-924",
      "hadith_no": "924",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يوسف بن عيسى، ومحمود بن غيلان، عن الفضل بن موسى، قال حدثنا مسعر، عن إبراهيم السكسكي، عن ابن أبي أوفى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني لا أستطيع أن آخذ شيئا من القرآن فعلمني شيئا يجزئني من القرآن ‏.‏ فقال ‏\"‏ قل سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abi Awfa said:                     \"A man came to the Prophet (ﷺ) and said: 'I cannot learn anything of the Quran; teach me something that I can say instead of reciting the Quran.' He said: 'Say: SubhanAllah, wal-hamdulilah, wa la illaha ill-Allah, wa Allahu Akbar, wa la hawla wa la quwwata illa Billahil-aliy al-azim (Glory be to Allah, praise be to Allah, there is none worthy of worship except Allah, Allah is Most Great, and there is no power and no strength except with Allah the Exalted and Magnificent ).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "30277",
        "20452",
        "20359",
        "5115"
      ]
    },
    {
      "id": "sunan-an-nasai-1201",
      "hadith_no": "1201",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أبو عمار الحسين بن حريث، قال حدثنا الفضل بن موسى، عن عبد الله بن سعيد بن أبي هند، عن ثور بن زيد، عن عكرمة، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يلتفت في صلاته يمينا وشمالا ولا يلوي عنقه خلف ظهره ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) used to turn to his right and left when praying, but he did not twist his neck to look behind him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11184",
        "11155",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-49",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال حدثنا الفضل بن موسى، عن حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال كان النبي صلى الله عليه وسلم يخطب فجاء الحسن والحسين - رضى الله عنهما - وعليهما قميصان أحمران يعثران فيهما فنزل النبي صلى الله عليه وسلم فقطع كلامه فحملهما ثم عاد إلى المنبر ثم قال ‏\"‏ صدق الله ‏{‏ إنما أموالكم وأولادكم فتنة ‏}‏ رأيت هذين يعثران في قميصيهما فلم أصبر حتى قطعت كلامي فحملتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that:                     His father said: \"The Prophet (ﷺ) was preaching, then Al-Hasan and Al-Husain came, wearing red shirts and stumbling in them. The Prophet (ﷺ) came down, interrupting himself, and picked them up, then he went back to the minbar and said: 'Allah has spoken the truth: Your wealth and your children are only a trial. I saw these two stumbling in their shirts and I could not continue until I had interrupted myself and picked them up.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30380",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-50",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن غزوان، قال أنبأنا الفضل بن موسى، عن الحسين بن واقد، قال حدثني يحيى بن عقيل، قال سمعت عبد الله بن أبي أوفى، يقول كان رسول الله صلى الله عليه وسلم يكثر الذكر ويقل اللغو ويطيل الصلاة ويقصر الخطبة ولا يأنف أن يمشي مع الأرملة والمسكين فيقضي له الحاجة ‏.‏",
      "text_en": " 'Abdullah bin Abi Awfa said:                     \"The Messenger of Allah (ﷺ) used to recite a great deal of remembrance, engage little in idle talk, make the prayer long and keep the khutbah short, and he would not refrain from walking with a widow or poor person and tending to their needs.\"",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "10726",
        "5115"
      ]
    },
    {
      "id": "sunan-an-nasai-1571",
      "hadith_no": "1571",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن يحيى بن أيوب، قال حدثنا الفضل بن موسى، قال حدثنا ابن جريج، عن عطاء، عن عبد الله بن السائب، أن النبي صلى الله عليه وسلم صلى العيد قال ‏\"‏ من أحب أن ينصرف فلينصرف ومن أحب أن يقيم للخطبة فليقم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin As-SA'ib that:                     The Prophet (ﷺ) offered the 'Eid prayer and said: 'Whoever would like to leave, let him leave, and whoever would like to stay for the Khutbah, let him stay.\"",
      "usc_msa_ref": "",
      "chain": [
        "38617",
        "20452",
        "11070",
        "11029",
        "2065"
      ]
    },
    {
      "id": "sunan-an-nasai-1824",
      "hadith_no": "1824",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن محمد بن عمرو، ح وأخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يزيد، قال أنبأنا محمد بن إبراهيم، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكثروا ذكر هاذم اللذات ‏\"‏ ‏.‏ قال أبو عبد الرحمن محمد بن إبراهيم والد أبي بكر بن أبي شيبة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Remember often the destroyer of pleasures.\"' (Hasan)Abu 'Abdur-Rahaman (An-Nasai) said: Muhammad bin Ibrahim (one of the narrators) is the father of Abu Bakr Ibn Abi Shaibah.",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11220",
        "20472",
        "11213",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1979",
      "hadith_no": "1979",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا ابن المبارك، والفضل بن موسى، ح وأخبرنا سويد، قال أنبأنا عبد الله، عن حسين المكتب، عن عبد الله بن بريدة، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم صلى على أم فلان ماتت في نفاسها فقام في وسطها ‏.‏",
      "text_en": " It was narrated from Samurah bin Jundab:                     That the Messenger of Allah offered the funeral prayer for a mother who had died in childbirth, and he stood in line with her middle.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20025",
        "20452",
        "18",
        "11432",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-2020",
      "hadith_no": "2020",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن الحسين بن واقد، قال حدثنا عمرو بن دينار، قال سمعت جابرا، يقول ‏:‏ إن النبي صلى الله عليه وسلم أمر بعبد الله بن أبى فأخرجه من قبره، فوضع رأسه على ركبتيه فتفل فيه من ريقه، وألبسه قميصه ‏.‏ قال جابر ‏:‏ وصلى عليه والله أعلم ‏.‏",
      "text_en": " Jabir said:                     \"The Prophet commanded that 'Abdullah bin Ubayy by brought out of his grave, then he placed his head on his knees and blew on him and put his shirt on him.\" \"And he prayed for him. And Allah knows best.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11081",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2112",
      "hadith_no": "2112",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن أبي رزمة، قال أنبأنا الفضل بن موسى، عن سفيان، عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال رأيت الهلال ‏.‏ فقال ‏\"‏ أتشهد أن لا إله إلا الله وأن محمدا عبده ورسوله ‏\"‏ ‏.‏ قال نعم ‏.‏ فنادى النبي صلى الله عليه وسلم ‏\"‏ أن صوموا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said;\"A Bedouin came to the Prphet and said:                      'I have sighted the crescent.' He said: 'Do you bear witness that there is none worthy of worship except Allah, and that Muhammad is His slave and Messenger?' He said: 'Yes.' So the Prophet gave the call saying: 'Fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30379",
        "20452",
        "20012",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2422",
      "hadith_no": "2422",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال أنبأنا الفضل بن موسى، عن فطر، عن يحيى بن سام، عن موسى بن طلحة، عن أبي ذر، قال أمرنا رسول الله صلى الله عليه وسلم أن نصوم من الشهر ثلاثة أيام البيض ثلاث عشرة وأربع عشرة وخمس عشرة ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah commanded us to fast the three days of Al-Bid, the thirteenth, fourteenth and fifteenth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30380",
        "20452",
        "19145",
        "579",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2529",
      "hadith_no": "2529",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن الحسين، عن منصور، عن شقيق، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يأمرنا بالصدقة فما يجد أحدنا شيئا يتصدق به حتى ينطلق إلى السوق فيحمل على ظهره فيجيء بالمد فيعطيه رسول الله صلى الله عليه وسلم إني لأعرف اليوم رجلا له مائة ألف ما كان له يومئذ درهم ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah used to tell us to give in charity, and one of us could not find anything to give until he went to the market place and hired himself out to carry loads for people. Then he would bring a Mudd and give it to the Messenger of Allah. I know a man who has a hundred thousand now, but on that day he had (only) one Dirham.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "11278",
        "11067",
        "11353",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-2532",
      "hadith_no": "2532",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يوسف بن عيسى، قال أنبأنا الفضل بن موسى، قال حدثنا يزيد، - وهو ابن زياد بن أبي الجعد - عن جامع بن شداد، عن طارق المحاربي، قال قدمنا المدينة فإذا رسول الله صلى الله عليه وسلم قائم على المنبر يخطب الناس وهو يقول ‏\"‏ يد المعطي العليا وابدأ بمن تعول أمك وأباك وأختك وأخاك ثم أدناك أدناك ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Tariq Al-Muharibi said:                     \"We came to Al-Madinah and the Messenger of Allah was standing on the Minbar addressing the people and saying: 'The hand which gives is the upper hand. Start with those for whom you are responsible; your mother, your father, your sister, your brother, then the next closest, and the next closet.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "25362",
        "11328",
        "5100"
      ]
    },
    {
      "id": "sunan-an-nasai-3034",
      "hadith_no": "3034",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو عاصم، وعفان، وسليمان، عن شعبة، عن مشاش، عن عطاء، عن ابن عباس، عن الفضل، أن النبي صلى الله عليه وسلم أمر ضعفة بني هاشم أن ينفروا من جمع بليل ‏.‏",
      "text_en": " It was narrated from Ibn Abbas, from Al-Fadl, that:                     the Prophet commanded the weak ones among Banu Hashim to move on from Jam' (Al-Muzadalifah) at night.",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20241",
        "30106",
        "11060",
        "20020",
        "11029",
        "17",
        "20452"
      ]
    },
    {
      "id": "sunan-an-nasai-3081",
      "hadith_no": "3081",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا حسين، قال حدثنا أبو خيثمة، قال حدثنا خصيف، عن مجاهد، وعطاء، وسعيد بن جبير، عن ابن عباس، أن الفضل، أخبره أنه، كان رديف رسول الله صلى الله عليه وسلم وأنه لم يزل يلبي حتى رمى الجمرة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     Al-Fadl to him that he roed behind the Messenger of Allah and he continued to recited the Talbiyah until eh stoned the Jamrat.",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "11278",
        "20321",
        "19908",
        "11028",
        "11029",
        "11050",
        "17",
        "20452"
      ]
    },
    {
      "id": "sunan-an-nasai-3221",
      "hadith_no": "3221",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال خطب أبو بكر وعمر رضى الله عنهما فاطمة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها صغيرة ‏\"‏ ‏.‏ فخطبها علي فزوجها منه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     It was narrated from 'Abdullah bin Buraidah that his father said: \"Abu Bakr and 'Umar, may Allah be pleased with them, proposed marriage to Fatimah but the Messenger of Allah said: 'She is young.' Then 'Ali proposed marriage to her and he married her to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3457",
      "hadith_no": "3457",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن معمر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، أن رجلا، أتى النبي صلى الله عليه وسلم قد ظاهر من امرأته فوقع عليها فقال يا رسول الله إني ظاهرت من امرأتي فوقعت قبل أن أكفر ‏.‏ قال ‏\"‏ وما حملك على ذلك يرحمك الله ‏\"‏ ‏.‏ قال رأيت خلخالها في ضوء القمر ‏.‏ فقال ‏\"‏ لا تقربها حتى تفعل ما أمر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that a man came to the Prophet who had declared Zihar from his wife, then he had intercourse with her. He said:                      \"O Messenger of Allah, I declared Zihar on my wife, then I had intercourse with her before I offered the expiation.\" He said: \"What made you do that, may Allah have mercy on you?\" He said: \"I saw her anklets in the light of the moon.\" He said: \"Do not approach her until you have done that which Allah, the Mighty and Sublime, has commanded.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20115",
        "19904",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3464",
      "hadith_no": "3464",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، قال حدثنا الحسين بن واقد، عن عمارة بن أبي حفصة، عن عكرمة، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إن امرأتي لا تمنع يد لامس ‏.‏ فقال ‏\"‏ غربها إن شئت ‏\"‏ ‏.‏ قال إني أخاف أن تتبعها نفسي ‏.‏ قال ‏\"‏ استمتع بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"A man came to the Messenger of Allah and said: 'My wife does not object if anyone touches her.' He said: 'Divorce her if you wish.' He said: 'I am afraid that I will miss her.' He said: 'Then stay with her as much as you need to.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11711",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3558",
      "hadith_no": "3558",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يوسف بن عيسى، - مروزي - قال حدثنا الفضل بن موسى، قال حدثنا حنظلة، عن سالم، عن ابن عمر، أنه طلق امرأته وهي حائض فأمره رسول الله صلى الله عليه وسلم فراجعها ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he divorced his wife when she was menstruating, and the Messenger of Allah told him to take her back.",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "11243",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3763",
      "hadith_no": "3763",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الفضل بن موسى، قال حدثني محمد بن عمرو، قال حدثنا أبو سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لما خلق الله الجنة والنار أرسل جبريل عليه السلام إلى الجنة فقال انظر إليها وإلى ما أعددت لأهلها فيها ‏.‏ فنظر إليها فرجع فقال وعزتك لا يسمع بها أحد إلا دخلها ‏.‏ فأمر بها فحفت بالمكاره فقال اذهب إليها فانظر إليها وإلى ما أعددت لأهلها فيها فنظر إليها فإذا هي قد حفت بالمكاره فقال وعزتك لقد خشيت أن لا يدخلها أحد ‏.‏ قال اذهب فانظر إلى النار وإلى ما أعددت لأهلها فيها ‏.‏ فنظر إليها فإذا هي يركب بعضها بعضا فرجع فقال وعزتك لا يدخلها أحد ‏.‏ فأمر بها فحفت بالشهوات فقال ارجع فانظر إليها ‏.‏ فإذا هي قد حفت بالشهوات فرجع وقال وعزتك لقد خشيت أن لا ينجو منها أحد إلا دخلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"When Allah created Paradise and Hell, He sent Jibril, peace be upon him, to Paradise and said: 'Look at it and at what I have prepared for its people in it.' He looked at it, then he came back and said: 'By Your Glory, no one will hear of it but he will enter it.' So He commanded that it be surrounded by hardships and said: 'Go and look at it and at what I have prepared for its people in it.' He looked at it and saw that it had been surrounded with hardships. He (Jibril) said: 'By Your Glory, I fear that no one will enter it.' He (Allah) said: 'Go and look at the Fire and at what I have prepared for its people in it.' So he looked at it and parts of it were piled upon other parts. He came back and said: 'By Your Glory, no one will enter it.' So He commanded that it be surrounded with pleasures and said: 'Go and look at it.' So he looked at it and saw that it was surrounded with pleasures. He came back and said: 'By Your Glory, I fear that no one will be saved from it and all will enter it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3772",
      "hadith_no": "3772",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال إني بريء من الإسلام فإن كان كاذبا فهو كما قال وإن كان صادقا لم يعد إلى الإسلام سالما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                      \"The Messenger of Allah said: 'Whoever says: I have nothing to do with Islam, if he is lying then he is as he said, and if he is telling the truth, his Islam will not be sound.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3773",
      "hadith_no": "3773",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يوسف بن عيسى، قال حدثنا الفضل بن موسى، قال حدثنا مسعر، عن معبد بن خالد، عن عبد الله بن يسار، عن قتيلة، - امرأة من جهينة - أن يهوديا، أتى النبي صلى الله عليه وسلم فقال إنكم تنددون وإنكم تشركون تقولون ما شاء الله وشئت وتقولون والكعبة ‏.‏ فأمرهم النبي صلى الله عليه وسلم إذا أرادوا أن يحلفوا أن يقولوا ‏\"‏ ورب الكعبة ‏\"‏ ‏.‏ ويقولون ‏\"‏ ما شاء الله ثم شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Yasar, from Qutailah, a woman from Juhainah, that a Jew came to the Prophet and said:                      \"You are setting up rivals (to Allah) and associating others (with Him). You say: 'Whatever Allah wills and you will,' and you say: 'By the Ka'bah.'\" So the Prophet commanded them, if they wanted to swear an oath, to say: \"By the Lord of the Ka'bah;\" and to say: \"Whatever Allah wills, then what you will.\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "20359",
        "11396",
        "15313"
      ]
    },
    {
      "id": "sunan-an-nasai-4097",
      "hadith_no": "4097",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الفضل بن موسى، قال حدثنا معمر، عن ابن طاوس، عن أبيه، عن ابن الزبير، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شهر سيفه ثم وضعه فدمه هدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Az-Zubair that:                     The Messenger of Allah [SAW] said: \"Whoever unsheathes his sword and starts to strike the people with it, it is permissible to shed his blood.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20452",
        "20115",
        "11433",
        "11053",
        "106"
      ]
    },
    {
      "id": "sunan-an-nasai-4213",
      "hadith_no": "4213",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم عق عن الحسن والحسين ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah, from his father, that:                     the Messenger of Allah offered the 'Aqiqah for Al-Hasan and Al-Husain.",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4240",
      "hadith_no": "4240",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن أبي رزمة، قال أنبأنا الفضل بن موسى، عن إسماعيل بن أبي خالد، عن الشعبي، عن عكرمة، عن ابن عباس، عن سودة، زوج النبي صلى الله عليه وسلم قالت ماتت شاة لنا فدبغنا مسكها فمازلنا ننبذ فيها حتى صارت شنا ‏.‏",
      "text_en": " It was narrated that Sawdah, the wife of the Prophet, said:                     \"A sheep of ours died, and we tanned its skin, and continued to make Nabidh in it until it wore out.\"",
      "usc_msa_ref": "",
      "chain": [
        "30379",
        "20452",
        "11418",
        "11052",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4329",
      "hadith_no": "4329",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن الحسين، - وهو ابن واقد - عن أبي الزبير، عن جابر، وعمرو بن دينار، عن جابر، وعن ابن أبي نجيح، عن عطاء، عن جابر، قال أطعمنا رسول الله صلى الله عليه وسلم يوم خيبر لحوم الخيل ونهانا عن لحوم الحمر ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \" On the Day of Khaibar, the Messenger of Allah allowed us to eat the flesh of horses but he forbade us from the flesh donkeys.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11263",
        "34",
        "11081",
        "34",
        "11254",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4392",
      "hadith_no": "4392",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن غزوان، قال حدثنا الفضل بن موسى، عن حسين، - يعني ابن واقد - عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فحضر النحر فاشتركنا في البعير عن عشرة والبقرة عن سبعة ‏.‏",
      "text_en": " It was narrated that  Ibn 'Abbas said:                     \"We were with the Mesenger of Allah on a journey, when the Day of Sacrifice came, so we shared a camel among ten men, and a cow among seven.\"",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4433",
      "hadith_no": "4433",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يوسف بن عيسى، قال حدثنا الفضل بن موسى، قال حدثنا يزيد، - وهو ابن زياد بن أبي الجعد - عن عبد الرحمن بن عابس، عن أبيه، قال سألت عائشة عن لحوم الأضاحي، قالت كنا نخبأ الكراع لرسول الله صلى الله عليه وسلم شهرا ثم يأكله ‏.‏",
      "text_en": " It was narrated from 'Abdur'Rahman bin 'Abis that his father said:                     \"I asked 'Aishah about the meat of the sacrificial animals and she said: 'We used to keep the trotters for the Messenger of Allah for a month, then he would eat them.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "25362",
        "11638",
        "11357",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4451",
      "hadith_no": "4451",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا يوسف بن عيسى، قال أنبأنا الفضل بن موسى، قال أنبأنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أطيب ما أكل الرجل من كسبه وولده من كسبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'The best (most pure) food that a man eats is that which he has earned himself, and his child (and his child's wealth) is part of his earning,\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4660",
      "hadith_no": "4660",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى السيناني، عن حسين بن واقد، عن أيوب السختياني، عن عطاء، عن جابر، أن رسول الله صلى الله عليه وسلم نهى عن بيع الماء ‏.‏",
      "text_en": " It was narrated from Jabir that:                     the Messenger of Allah forbade selling water.",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11015",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4705",
      "hadith_no": "4705",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن أبي رزمة، قال حدثنا الفضل بن موسى، عن حسين، - وهو ابن واقد - عن أبي الزبير، عن جابر، قال قضى رسول الله صلى الله عليه وسلم بالشفعة والجوار ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah decreed the principle of pre-emption, and the (rights of) neighbors.\"",
      "usc_msa_ref": "",
      "chain": [
        "30379",
        "20452",
        "20648",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4839",
      "hadith_no": "4839",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا يوسف بن عيسى، قال أنبأنا الفضل بن موسى، قال أنبأنا يزيد، - وهو ابن زياد بن أبي الجعد - عن جامع بن شداد، عن طارق المحاربي، أن رجلا، قال يا رسول الله هؤلاء بنو ثعلبة الذين قتلوا فلانا في الجاهلية ‏.‏ فخذ لنا بثأرنا ‏.‏ فرفع يديه حتى رأيت بياض إبطيه وهو يقول ‏\"‏ لا تجني أم على ولد ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " It was narrated from Tariq and Muharibi that a manh said:                     \"O Messenger of Allah, these are Banu Tha'labah who killed so and so during the Jahiliyyah: avenger us! He raised his arms until the whiteness of his armpits could be seen and said: \"No mother's sin can affect her child,\" twice. (Shaih)",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "25362",
        "11328",
        "5100"
      ]
    },
    {
      "id": "sunan-an-nasai-5018",
      "hadith_no": "5018",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا يوسف بن عيسى قال أنبأنا الفضل بن موسى قال أنبأنا الأعمش عن عدي عن زر قال قال علي  إنه لعهد النبي الأمي صلى الله عليه وسلم إلي أنه لا يحبك إلا مؤمن ولا يبغضك إلا منافق",
      "text_en": " It was narrated that Zirr said:                     'Ali said: \"The Unlettered Prophet [SAW] made a covenant with me, that none but a believer would love me, and none but a hypocrite would hate me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "11060",
        "11372",
        "11337",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5071",
      "hadith_no": "5071",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن اليهود والنصارى لا تصبغ فخالفوا عليهم فاصبغوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'The Jews and the Christians do not dye their hair, so be different from them and dye your hair.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20115",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5400",
      "hadith_no": "5400",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن سفيان بن سعيد، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال كانت ملوك بعد عيسى ابن مريم عليه الصلاة والسلام بدلوا التوراة والإنجيل وكان فيهم مؤمنون يقرءون التوراة قيل لملوكهم ما نجد شتما أشد من شتم يشتمونا هؤلاء إنهم يقرءون ‏{‏ومن لم يحكم بما أنزل الله فأولئك هم الكافرون‏}‏ وهؤلاء الآيات مع ما يعيبونا به في أعمالنا في قراءتهم فادعهم فليقرءوا كما نقرأ وليؤمنوا كما آمنا‏.‏ فدعاهم فجمعهم وعرض عليهم القتل أو يتركوا قراءة التوراة والإنجيل إلا ما بدلوا منها فقالوا ما تريدون إلى ذلك دعونا‏.‏ فقالت طائفة منهم ابنوا لنا أسطوانة ثم ارفعونا إليها ثم اعطونا شيئا نرفع به طعامنا وشرابنا فلا نرد عليكم‏.‏ وقالت طائفة منهم دعونا نسيح في الأرض ونهيم ونشرب كما يشرب الوحش فإن قدرتم علينا في أرضكم فاقتلونا‏.‏ وقالت طائفة منهم ابنوا لنا دورا في الفيافي ونحتفر الآبار ونحترث البقول فلا نرد عليكم ولا نمر بكم وليس أحد من القبائل إلا وله حميم فيهم‏.‏ قال ففعلوا ذلك فأنزل الله عز وجل ‏{‏ورهبانية ابتدعوها ما كتبناها عليهم إلا ابتغاء رضوان الله فما رعوها حق رعايتها‏}‏ والآخرون قالوا نتعبد كما تعبد فلان ونسيح كما ساح فلان ونتخذ دورا كما اتخذ فلان‏.‏ وهم على شركهم لا علم لهم بإيمان الذين اقتدوا به فلما بعث الله النبي صلى الله عليه وسلم ولم يبق منهم إلا قليل انحط رجل من صومعته وجاء سائح من سياحته وصاحب الدير من ديره فآمنوا به وصدقوه فقال الله تبارك وتعالى ‏{‏يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله يؤتكم كفلين من رحمته‏}‏ أجرين بإيمانهم بعيسى وبالتوراة والإنجيل وبإيمانهم بمحمد صلى الله عليه وسلم وتصديقهم قال ‏{‏يجعل لكم نورا تمشون به‏}‏ القرآن واتباعهم النبي صلى الله عليه وسلم قال ‏{‏لئلا يعلم أهل الكتاب‏}‏ يتشبهون بكم ‏{‏أن لا يقدرون على شىء من فضل الله‏}‏ الآية‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"There were kings after 'Isa bin Mariam who altered the Tawrah and the Injil, but there were among them believers who read the Tawrah. It was said to their kings: 'We have never heard of any slander worse than that of those (believers) who slander us and recite: \"And whosoever does not judge by what Allah has revealed, such are the disbelievers.\" In these Verses, they are criticizing us for our deeds when they recite them.' So he called them together and gave them the choice between being put to death, or giving up reading the Tawrah and Injil, except for what had been altered. They said: 'Why do you want us to change? Leave us alone.' Some of them said: 'Build us a tower and let us go up there, and give us something to lift up our food and drink so we do not have to mix with you.' Others said: 'Let us go and wander throughout the land, and we will drink as the wild animals drink, and if you capture us in your land, you may kill us.' Others said: 'Build houses for us in the wilderness, and we will dig wells and grow vegetables, and we will not mix with you or pass by you, for there is no one of the tribes among whom we do not have close relatives.' So they did that, and Allah revealed the words: 'But the monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but that they did not observe it with the right observance.' Then others said: 'We will worship as so-and-so worshipped, and we will wander as so-and-so wandered, and we will adopt houses (in the wilderness) as so-and-so did.' But they were still following their Shirk with no knowledge of the faith of those whom they claimed to be following. When Allah sent the Prophet [SAW], and they were only a few of them left, a man came down from his cell, and a wanderer came from his travels, and a monk came from his monastery, and they believed in him. And Allah said: 'O you who believe! Fear Allah, and believe in His Messenger (Muhammad), He will give you a double portion of His mercy - meaning, two rewards, because of their having believed in 'Isa and in the Tawrah and Injil, and for having believing in Muhammad [SAW]; and He will give you a light by which you shall walk (straight), - meaning, the Qur'an, and their following the Prophet [SAW]; and He said: 'So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20012",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5446",
      "hadith_no": "5446",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال حدثنا الفضل بن موسى، عن زكريا، عن أبي إسحاق، عن عمرو بن ميمون، عن ابن مسعود، قال كان النبي صلى الله عليه وسلم يتعوذ من خمس من البخل والجبن وسوء العمر وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"The Prophet [SAW] used to seek refuge (with Allah) from five things: From miserliness, cowardice, reaching the age of second childhood, the tribulation of the heart and the torment of the grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30380",
        "20452",
        "11338",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5531",
      "hadith_no": "5531",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا الفضل بن موسى، عن عبد الله بن سعيد، عن صيفي، مولى أبي أيوب عن أبي اليسر، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من التردي والهدم والغرق والحريق وأعوذ بك أن يتخبطني الشيطان عند الموت وأعوذ بك أن أموت في سبيلك مدبرا وأعوذ بك أن أموت لديغا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Yasar said:                     \"The Messenger of Allah [SAW] used to say: 'Allahumma inni a'udhu bika minat-taraddi, wal-hadmi, wal-gharaqi, wal-hariqi, wa a'udhu bika, an yatakhabbatanish-shaitanu 'indal-mawti, wa a'udhu bika an amuta fi sabilika mudbiran, wa a'udhu bika an amuta ladigha (O Allah, I seek refuge with You from being thrown from a high place or crushed beneath a falling wall, or drowning or being burned, and I seek refuge with You from being led astray by the Shaitan at the time of death, and I seek refuge with You from dying in Your cause while fleeing from the battlefield, and I seek refuge with You from dying of a scorpion sting.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "11184",
        "12780",
        "1040"
      ]
    },
    {
      "id": "sunan-ibn-majah-1349",
      "hadith_no": "1349",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هدية بن عبد الوهاب، وعمرو بن رافع البجلي، قالا حدثنا الفضل بن موسى، حدثنا ابن جريج، عن عطاء، عن عبد الله بن السائب، قال حضرت العيد مع رسول الله  صلى الله عليه وسلم  فصلى بنا العيد ثم قال ‏\"‏ قد قضينا الصلاة فمن أحب أن يجلس للخطبة فليجلس ومن أحب أن يذهب فليذهب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Sa’ib said:                      “I attended the ‘Eidprayer with the Messenger of Allah (ﷺ). He led us in offering the‘Eid prayer, then he said: ‘I have finished the prayer. Whoeverwantsto sit (and listen to) the sermon, then let him sit, andwhoever wantsto leave, then let him leave.’”",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "20452",
        "11070",
        "11029",
        "2065"
      ]
    },
    {
      "id": "sunan-ibn-majah-2178",
      "hadith_no": "2178",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا عمرو بن رافع البجلي، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال إني بريء من الإسلام فإن كان كاذبا فهو كما قال وإن كان صادقا لم يعد إليه الإسلام سالما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Buraidah that his father told that :                     the Messenger of Allah (ﷺ) said: \"Whoever says: 'I have nothing to do with Islam,' if he is lying then he is as he said, and if he is telling the truth, his Islam will not be sound.\"",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3062",
      "hadith_no": "3062",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا هدية بن عبد الوهاب، حدثنا الفضل بن موسى، قالا حدثنا معروف بن خربوذ المكي، قال سمعت أبا الطفيل، عامر بن واثلة قال رأيت النبي  صلى الله عليه وسلم  يطوف بالبيت على راحلته يستلم الركن بمحجنه ويقبل المحجن ‏.‏",
      "text_en": " Ma’rufbin Kharrabudh Al-Makki narrated:                      “I heard Abu Tufail, ‘AmirbinWathilah, say: ‘I saw the Prophet (ﷺ) performing Tawaf on hiscamel, touching the corner with his staff and kissing the staff.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20452",
        "11564"
      ]
    },
    {
      "id": "sunan-ibn-majah-3251",
      "hadith_no": "3251",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هدية بن عبد الوهاب، أنبأنا الفضل بن موسى، أنبأنا الحسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع رسول الله  صلى الله عليه وسلم  في سفر فحضر الأضحى فاشتركنا في الجزور عن عشرة والبقرة عن سبعة ‏.‏",
      "text_en": " it wasnarrated that Ibn ‘Abbas said:                      “We were with the Messenger ofAllah (ﷺ) on a journey, and the (day of) Al-Adha came. We(sacrificed) one camel on behalf of ten (people) and one cow onbehalfof seven.”",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3466",
      "hadith_no": "3466",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا هدية بن عبد الوهاب، حدثنا الفضل بن موسى السيناني، حدثنا الحسين بن واقد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ذات يوم ‏\"‏ وددت لو أن عندنا خبزة بيضاء من برة سمراء ملبقة بسمن نأكلها ‏\"‏ ‏.‏ قال فسمع بذلك رجل من الأنصار فاتخذه فجاء به إليه فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ في أى شىء كان هذا السمن ‏\"‏ ‏.‏ قال في عكة ضب ‏.‏ قال فأبى أن يأكله ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “One day, the Messenger of Allah(ﷺ) said: ‘I wish that we had some white bread made of brownwheat,softened with ghee, that we could eat.’ A man from among theAnsarheard that, so he took some (of that food) and brought it tohim. TheMessenger of Allah (ﷺ) said: ‘Where was this ghee kept?’He said:‘In a container made of mastigure skin.’ And he refusedto eat it.”",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "11015",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 108
}