{
  "id": "20468",
  "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
  "full_name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "104",
      "date_gregorian": "NA",
      "date_display": [
        "104 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "183",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Wasti",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10956",
      "name": "al-Qasim bin Mhran al-Qaysy القاسم بن مهران القيسي مولى بني قيس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10986",
      "name": "Ya'la bin 'Ata' يعلى بن عطاء العامري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11436",
      "name": "'Ubaidullah bin Abi Bakr عبيد الله بن أبي بكر بن أنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11429",
      "name": "Siyar Abu al-Hakam al-Anzi سيار أبو الحكم العنزي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11867",
      "name": "'Abdullah bin Abi Salah al-Saman عبد الله/عباد بن أبي صالح السمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10945",
      "name": "'Abdul Malik bin Aby عبد الملك بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19818",
      "name": "'Umar bin Abi Salma bin 'Abdur Rahman عمر بن أبي سلمة بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "30415",
      "name": "Isma'il bin Salm al-Sa'agh إسماعيل بن سالم الصائغ",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "11441",
      "name": "al-'Awwam bin Hushab العوام بن حوشب بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11314",
      "name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11444",
      "name": "Mnswr bin Zadhan منصور بن زاذان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20573",
      "name": "Wasil bin 'Abdur Rahman واصل بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30278",
      "name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30415",
      "name": "Isma'il bin Salm al-Sa'agh إسماعيل بن سالم الصائغ",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30252",
      "name": "Sa'id bin Sulaiman al-Dabi سعيد بن سليمان - سعدويه الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30251",
      "name": "Sryj bin Yonus bin Ibrahim سريج بن يونس بن إبراهيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30154",
      "name": "'Amr bin 'Awn/'Auf bin Aws عمرو بن عون/عوف بن أوس البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30269",
      "name": "Muhammad bin al-Sabah محمد بن الصباح البزاز الدولابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30242",
      "name": "Ahmed bin Manay' أحمد بن منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30261",
      "name": "'Ali bin Muslim bin Sa'id علي بن مسلم بن سعيد الطوسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30365",
      "name": "'Amr bin Zararah bin Waqid عمرو بن زرارة بن واقد الكلابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30526",
      "name": "Yahya bin Ayoub al-Maqabri يحيى بن أيوب المقابري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "335",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا هشيم، ح قال وحدثني سعيد بن النضر، قال أخبرنا هشيم، قال أخبرنا سيار، قال حدثنا يزيد  هو ابن صهيب الفقير  قال أخبرنا جابر بن عبد الله، أن النبي صلى الله عليه وسلم قال ‏\"‏ أعطيت خمسا لم يعطهن أحد قبلي نصرت بالرعب مسيرة شهر، وجعلت لي الأرض مسجدا وطهورا، فأيما رجل من أمتي أدركته الصلاة فليصل، وأحلت لي المغانم ولم تحل لأحد قبلي، وأعطيت الشفاعة، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس عامة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"I have been given five things which were not given to any one else before me. -1. Allah made me victorious by awe, (by His frightening my enemies) for a distance of one month's journey. -2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum, therefore anyone of my followers can pray wherever the time of a prayer is due. -3. The booty has been made Halal (lawful) for me yet it was not lawful for anyone else before me. -4. I have been given the right of intercession (on the Day of Resurrection). -5. Every Prophet used to be sent to his nation only but I have been sent to all mankind.",
      "chain": [
        "34207",
        "20468",
        "30253",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عون، قال حدثنا هشيم، عن حميد، عن أنس، قال قال عمر وافقت ربي في ثلاث، فقلت يا رسول الله لو اتخذنا من مقام إبراهيم مصلى فنزلت ‏{‏واتخذوا من مقام إبراهيم مصلى‏}‏ وآية الحجاب قلت يا رسول الله، لو أمرت نساءك أن يحتجبن، فإنه يكلمهن البر والفاجر‏.‏ فنزلت آية الحجاب، واجتمع نساء النبي صلى الله عليه وسلم في الغيرة عليه فقلت لهن عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن‏.‏ فنزلت هذه الآية‏.‏",
      "text_en": " Narrated `Umar (bin Al-Khattab):                     My Lord agreed with me in three things: -1. I said, \"O Allah's Apostle, I wish we took the station of Abraham as our praying place (for some of our prayers). So came the Divine Inspiration: And take you (people) the station of Abraham as a place of prayer (for some of your prayers e.g. two rak`at of Tawaf of Ka`ba)\". (2.125) -2. And as regards the (verse of) the veiling of the women, I said, 'O Allah's Apostle! I wish you ordered your wives to cover themselves from the men because good and bad ones talk to them.' So the verse of the veiling of the women was revealed. -3. Once the wives of the Prophet made a united front against the Prophet and I said to them, 'It may be if he (the Prophet) divorced you, (all) that his Lord (Allah) will give him instead of you wives better than you.' So this verse (the same as I had said) was revealed.\" (66.5).",
      "chain": [
        "30154",
        "20468",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا هشيم، قال حدثنا سيار  هو أبو الحكم  قال حدثنا يزيد الفقير، قال حدثنا جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي، نصرت بالرعب مسيرة شهر، وجعلت لي الأرض مسجدا وطهورا، وأيما رجل من أمتي أدركته الصلاة فليصل، وأحلت لي الغنائم، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس كافة، وأعطيت الشفاعة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"I have been given five things which were not given to any amongst the Prophets before me. These are: -1. Allah made me victorious by awe (by His frightening my enemies) for a distance of one month's journey. -2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum. Therefore my followers can pray wherever the time of a prayer is due. -3. The booty has been made Halal (lawful) for me (and was not made so for anyone else). -4. Every Prophet used to be sent to his nation exclusively but I have been sent to all mankind. -5. I have been given the right of intercession (on the Day of Resurrection.)",
      "chain": [
        "34207",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "517",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن زرارة، قال أخبرنا هشيم، عن الشيباني، عن عبد الله بن شداد بن الهاد، قال أخبرتني خالتي، ميمونة بنت الحارث قالت كان فراشي حيال مصلى النبي صلى الله عليه وسلم فربما وقع ثوبه على وأنا على فراشي‏.‏",
      "text_en": " Narrated Maimuna bint Al-Harith:                     My bed was beside the praying place (Musalla) of the Prophet and sometimes his garment fell on me while I used to lie in my bed.",
      "chain": [
        "30365",
        "20468",
        "11352",
        "169"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمرو بن عون، قال حدثنا هشيم، عن أبي بشر، عن عكرمة، قال رأيت رجلا عند المقام يكبر في كل خفض ورفع وإذا قام وإذا وضع، فأخبرت ابن عباس  رضى الله عنه  قال أوليس تلك صلاة النبي صلى الله عليه وسلم لا أم لك‏.‏",
      "text_en": " Narrated `Ikrima:                     I saw a person praying at Muqam-Ibrahim (the place of Abraham by the Ka`ba) and he was saying Takbir on every bowing, rising, standing and sitting. I asked Ibn `Abbas (about this prayer). He admonished me saying: \"Isn't that the prayer of the Prophet?\"",
      "chain": [
        "30154",
        "20468",
        "11419",
        "11023"
      ]
    },
    {
      "hadith_no": "823",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن الصباح، قال أخبرنا هشيم، قال أخبرنا خالد الحذاء، عن أبي قلابة، قال أخبرنا مالك بن الحويرث الليثي، أنه رأى النبي صلى الله عليه وسلم يصلي، فإذا كان في وتر من صلاته لم ينهض حتى يستوي قاعدا‏.‏",
      "text_en": " Narrated Malik bin Huwairith Al-Laithi:                     I saw the Prophet praying and in the odd rak`at, he used to sit for a moment before getting up.",
      "chain": [
        "30269",
        "20468",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "953",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، قال حدثنا هشيم، قال أخبرنا عبيد الله بن أبي بكر بن أنس، عن أنس، قال كان رسول الله صلى الله عليه وسلم لا يغدو يوم الفطر حتى يأكل تمرات‏.‏ وقال مرجى بن رجاء حدثني عبيد الله قال حدثني أنس عن النبي صلى الله عليه وسلم ويأكلهن وترا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some dates. Anas also narrated: The Prophet used to eat odd number of dates.",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "1426",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي، سمع هشيما، أخبرنا حصين، عن زيد بن وهب، قال مررت بالربذة فإذا أنا بأبي، ذر  رضى الله عنه  فقلت له ما أنزلك منزلك هذا قال كنت بالشأم، فاختلفت أنا ومعاوية في الذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله‏.‏ قال معاوية نزلت في أهل الكتاب‏.‏ فقلت نزلت فينا وفيهم‏.‏ فكان بيني وبينه في ذاك، وكتب إلى عثمان  رضى الله عنه  يشكوني، فكتب إلى عثمان أن اقدم المدينة‏.‏ فقدمتها فكثر على الناس حتى كأنهم لم يروني قبل ذلك، فذكرت ذاك لعثمان فقال لي إن شئت تنحيت فكنت قريبا‏.‏ فذاك الذي أنزلني هذا المنزل، ولو أمروا على حبشيا لسمعت وأطعت‏.‏",
      "text_en": " Narrated Zaid bin Wahab:                     I passed by a place called Ar-Rabadha and by chance I met Abu Dhar and asked him, \"What has brought you to this place?\" He said, \"I was in Sham and differed with Muawiya on the meaning of (the following verses of the Qur'an): 'They who hoard up gold and silver and spend them not in the way of Allah.' (9.34). Muawiya said, 'This verse is revealed regarding the people of the scriptures.\" I said, It was revealed regarding us and also the people of the scriptures.\" So we had a quarrel and Mu'awiya sent a complaint against me to `Uthman. `Uthman wrote to me to come to Medina, and I came to Medina. Many people came to me as if they had not seen me before. So I told this to `Uthman who said to me, \"You may depart and live nearby if you wish.\" That was the reason for my being here for even if an Ethiopian had been nominated as my ruler, I would have obeyed him .",
      "chain": [
        "5",
        "20468",
        "15097",
        "11341"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا هشيم، أخبرنا منصور، عن عطاء، عن ابن عباس  رضى الله عنهما  قال سئل النبي صلى الله عليه وسلم عمن حلق قبل أن يذبح ونحوه‏.‏ فقال ‏\"‏ لا حرج، لا حرج ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was asked about a person who had his head shaved before slaughtering (his Hadi) (or other similar ceremonies of Hajj). He replied, \"There is no harm, there is no harm.\"",
      "chain": [
        "20174",
        "20468",
        "11067",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1882",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أن رجلا، كان مع النبي صلى الله عليه وسلم فوقصته ناقته، وهو محرم، فمات، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبيه، ولا تمسوه بطيب، ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was in the company of the Prophet and his she-camel crushed his neck while he was in a state of Ihram and he died Allah's Apostle said, \"Wash him with water and Sidr and shroud him in his two garments; neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection, reciting Talbiya.\"",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1916",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، قال أخبرني حصين بن عبد الرحمن، عن الشعبي، عن عدي بن حاتم  رضى الله عنه  قال لما نزلت ‏{‏حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ عمدت إلى عقال أسود وإلى عقال أبيض، فجعلتهما تحت وسادتي، فجعلت أنظر في الليل، فلا يستبين لي، فغدوت على رسول الله صلى الله عليه وسلم فذكرت له ذلك فقال ‏\"‏ إنما ذلك سواد الليل وبياض النهار ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     When the above verses were revealed: 'Until the white thread appears to you, distinct from the black thread,' I took two (hair) strings, one black and the other white, and kept them under my pillow and went on looking at them throughout the night but could not make anything out of it. So, the next morning I went to Allah's Apostle and told him the whole story. He explained to me, \"That verse means the darkness of the night and the whiteness of the dawn.\"",
      "chain": [
        "20219",
        "20468",
        "15097",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن محمد، حدثنا هشيم، أخبرنا العوام، عن إبراهيم بن عبد الرحمن، عن عبد الله بن أبي أوفى  رضى الله عنه  أن رجلا، أقام سلعة، وهو في السوق، فحلف بالله لقد أعطى بها ما لم يعط، ليوقع فيها رجلا من المسلمين، فنزلت ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا ‏}‏",
      "text_en": " Narrated `Abdullah bin Abu `Aufa:                     A man displayed some goods in the market and swore by Allah that he had been offered so much for that, that which was not offered, and he said so, so as to cheat a Muslim. On that occasion the following Verse was revealed: \"Verily! Those who purchase a small gain at the cost of Allah's covenant and their oaths (They shall have no portion in the Hereafter ..etc.)' (3.77)",
      "chain": [
        "30263",
        "20468",
        "11441",
        "11619",
        "5115"
      ]
    },
    {
      "hadith_no": "2197",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني علي بن الهيثم، حدثنا معلى، حدثنا هشيم، أخبرنا حميد، حدثنا أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه نهى عن بيع الثمرة حتى يبدو صلاحها، وعن النخل حتى يزهو‏.‏ قيل وما يزهو قال يحمار أو يصفار‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet forbade the sale of fruits till their benefit is evident; and the sale of date palms till the dates are almost ripe. He was asked what 'are almost ripe' meant. He replied, \"Got red and yellow.\"",
      "chain": [
        "30457",
        "20468",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2443",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، وحميد الطويل، سمعا أنس بن مالك  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Help your brother, whether he is an oppressor or he is an oppressed one.\"",
      "chain": [
        "30203",
        "20468",
        "11436",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3081",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني محمد بن عبد الله بن حوشب الطائفي، حدثنا هشيم، أخبرنا حصين، عن سعد بن عبيدة، عن أبي عبد الرحمن، وكان، عثمانيا فقال لابن عطية وكان علويا إني لأعلم ما الذي جرأ صاحبك على الدماء سمعته يقول بعثني النبي صلى الله عليه وسلم والزبير، فقال ‏\"‏ ائتوا روضة كذا، وتجدون بها امرأة أعطاها حاطب كتابا ‏\"‏‏.‏ فأتينا الروضة فقلنا الكتاب‏.‏ قالت لم يعطني‏.‏ فقلنا لتخرجن أو لأجردنك‏.‏ فأخرجت من حجزتها، فأرسل إلى حاطب فقال لا تعجل، والله ما كفرت ولا ازددت للإسلام إلا حبا، ولم يكن أحد من أصحابك إلا وله بمكة من يدفع الله به عن أهله وماله، ولم يكن لي أحد، فأحببت أن أتخذ عندهم يدا‏.‏ فصدقه النبي صلى الله عليه وسلم‏.‏ قال عمر دعني أضرب عنقه، فإنه قد نافق‏.‏ فقال ‏\"‏ ما يدريك لعل الله اطلع على أهل بدر، فقال اعملوا ما شئتم ‏\"‏‏.‏ فهذا الذي جرأه‏.‏",
      "text_en": " Narrated Sa`d bin 'Ubaida:                     Abu `Abdur-Rahman who was one of the supporters of `Uthman said to Abu Talha who was one of the supporters of `Ali, \"I perfectly know what encouraged your leader (i.e. `Ali) to shed blood. I heard him saying: Once the Prophet sent me and Az-Zubair saying, 'Proceed to such-and-such Ar-Roudah (place) where you will find a lady whom Hatib has given a letter. So when we arrived at Ar-Roudah, we requested the lady to hand over the letter to us. She said, 'Hatib has not given me any letter.' We said to her. 'Take out the letter or else we will strip off your clothes.' So she took it out of her braid. So the Prophet sent for Hatib, (who came) and said, 'Don't hurry in judging me, for, by Allah, I have not become a disbeliever, and my love to Islam is increasing. (The reason for writing this letter was) that there is none of your companions but has relatives in Mecca who look after their families and property, while I have nobody there, so I wanted to do them some favor (so that they might look after my family and property).' The Prophet believed him. `Umar said, 'Allow me to chop off his (i.e. Hatib's) neck as he has done hypocrisy.' The Prophet said, (to `Umar), 'Who knows, perhaps Allah has looked at the warriors of Badr and said (to them), 'Do whatever you like, for I have forgiven you.' \" `Abdur-Rahman added, \"So this is what encouraged him (i.e. `Ali).",
      "chain": [
        "20468",
        "15097",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "3122",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن سنان، حدثنا هشيم، أخبرنا سيار، حدثنا يزيد الفقير، حدثنا جابر بن عبد الله  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحلت لي الغنائم ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"Booty has been made legal for me.\"",
      "chain": [
        "34207",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "3897",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا نعيم بن حماد، حدثنا هشيم، عن حصين، عن عمرو بن ميمون، قال رأيت في الجاهلية قردة اجتمع عليها قردة قد زنت، فرجموها فرجمتها معهم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     During the pre-lslamic period of ignorance I saw a she-monkey surrounded by a number of monkeys. They were all stoning it, because it had committed illegal sexual intercourse. I too, stoned it along with them.",
      "chain": [
        "30238",
        "20468",
        "15097",
        "11382"
      ]
    },
    {
      "hadith_no": "3991",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما قدم النبي صلى الله عليه وسلم المدينة وجد اليهود يصومون عاشوراء، فسئلوا عن ذلك، فقالوا هذا اليوم الذي أظفر الله فيه موسى وبني إسرائيل على فرعون، ونحن نصومه تعظيما له، فقال رسول الله صلى الله عليه وسلم ‏\"‏ نحن أولى بموسى منكم ‏\"‏‏.‏ ثم أمر بصومه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet arrived at Medina he found that the Jews observed fast on the day of 'Ashura'. They were asked the reason for the fast. They replied, \"This is the day when Allah caused Moses and the children of Israel to have victory over Pharaoh, so we fast on this day as a sign of glorifying it.\" Allah's Apostle said, \"We are closer to Moses than you.\" Then he ordered that fasting on this day should be observed.",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3993",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني زياد بن أيوب، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال هم أهل الكتاب، جزءوه أجزاء، فآمنوا ببعضه وكفروا ببعضه‏.‏ ‏{‏يعني قول الله تعالى ‏{‏الذين جعلوا القرآن عضين ‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     They, the people of the Scriptures, divided this Scripture into parts, believing in some portions of it and disbelieving the others. (See 15:91)",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4018",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس، قال سمعت أبا ذر، يقسم قسما إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏ نزلت في الذين برزوا يوم بدر حمزة وعلي وعبيدة بن الحارث وعتبة وشيبة ابنى ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais:                     I heard Abu Dhar swearing that the following Holy verse:-- \"These two opponents (believers and disbelievers) disputing with each other about their Lord,\" (22.19) was revealed concerning those men who fought on the day of Badr, namely, Hamza, `Ali, Ubaida bin Al-Harith, `Utba and Shaiba----the two sons of Rabi`a-- and Al-Walid bin `Utba.",
      "chain": [
        "20184",
        "20468",
        "11454",
        "11313",
        "11046"
      ]
    },
    {
      "hadith_no": "4240",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن هشام أبو عبد الله، حدثنا هشيم، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال كنا مع رسول الله صلى الله عليه وسلم بالحديبية ونحن محرمون، وقد حصرنا المشركون  قال  وكانت لي وفرة فجعلت الهوام تساقط على وجهي، فمر بي النبي صلى الله عليه وسلم فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ قال وأنزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏",
      "text_en": " Narrated Ka`b bin Ujra:                     We were in the company of Allah's Apostle at Al-Hudaibiya in the state of Ihram and the pagans did not allow us to proceed (to the Ka`ba). I had thick hair and lice started falling on my face. The Prophet passed by me and said, \"Are the lice of your head troubling you?\" I replied, Yes.\" (The sub-narrator added, \"Then the following Divine Verse was revealed:-- \"And if anyone of you is ill or has an ailment in his scalp, (necessitating shaving) must pay a ransom (Fida) of either fasting or feeding the poor, Or offering a sacrifice.\" (2.196)",
      "chain": [
        "30276",
        "20468",
        "11419",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4314",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن محمد، حدثنا هشيم، أخبرنا حصين، أخبرنا أبو ظبيان، قال سمعت أسامة بن زيد  رضى الله عنهما  يقول بعثنا رسول الله صلى الله عليه وسلم إلى الحرقة، فصبحنا القوم فهزمناهم ولحقت أنا ورجل من الأنصار رجلا منهم، فلما غشيناه قال لا إله إلا الله‏.‏ فكف الأنصاري، فطعنته برمحي حتى قتلته، فلما قدمنا بلغ النبي صلى الله عليه وسلم فقال ‏\"‏ يا أسامة أقتلته بعد ما قال لا إله إلا الله ‏\"‏ قلت كان متعوذا‏.‏ فما زال يكررها حتى تمنيت أني لم أكن أسلمت قبل ذلك اليوم‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle sent us towards Al-Huruqa, and in the morning we attacked them and defeated them. I and an Ansari man followed a man from among them and when we took him over, he said, \"La ilaha illal-Lah.\" On hearing that, the Ansari man stopped, but I killed him by stabbing him with my spear. When we returned, the Prophet came to know about that and he said, \"O Usama! Did you kill him after he had said \"La ilaha ilal-Lah?\" I said, \"But he said so only to save himself.\" The Prophet kept on repeating that so often that I wished I had not embraced Islam before that day.",
      "chain": [
        "30263",
        "20468",
        "15097",
        "50"
      ]
    },
    {
      "hadith_no": "4593",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي  هو ابن أبي هاشم  سمع هشيما، أخبرنا العوام بن حوشب، عن إبراهيم بن عبد الرحمن، عن عبد الله بن أبي أوفى  رضى الله عنهما  أن رجلا، أقام سلعة في السوق فحلف فيها لقد أعطى بها ما لم يعطه‏.‏ ليوقع فيها رجلا من المسلمين، فنزلت ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Abu `Aufa:                     A man displayed some merchandise in the market and took an oath that he had been offered a certain price for it while in fact he had not, in order to cheat a man from the Muslims. So then was revealed:-- \"Verily! Those who purchase a small gain at the cost of Allah's Covenant and their oaths...\"(3.77)",
      "chain": [
        "30364",
        "20468",
        "11441",
        "11619",
        "5115"
      ]
    },
    {
      "hadith_no": "4690",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، أخبرنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، قال قلت لابن عباس  رضى الله عنهما  سورة الأنفال قال نزلت في بدر‏.‏ الشوكة الحد ‏{‏مردفين‏}‏ فوجا بعد فوج، ردفني وأردفني جاء بعدي ‏{‏ذوقوا‏}‏ باشروا وجربوا وليس هذا من ذوق الفم ‏{‏فيركمه‏}‏ يجمعه‏.‏ ‏{‏شرد‏}‏ فرق ‏{‏وإن جنحوا‏}‏ طلبوا ‏{‏يثخن‏}‏ يغلب‏.‏ وقال مجاهد ‏{‏مكاء‏}‏ إدخال أصابعهم في أفواههم و‏{‏تصدية‏}‏ الصفير ‏{‏ليثبتوك‏}‏ ليحبسوك‏.‏",
      "text_en": "",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "hadith_no": "4752",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما ‏{‏الذين جعلوا القرآن عضين‏}‏ قال هم أهل الكتاب، جزءوه أجزاء، فآمنوا ببعضه وكفروا ببعضه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Those who have made their Scripture into parts are the people of the Scripture who divided it into portions and believed in a part of it and disbelieved the other.",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4769",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  في قوله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال نزلت ورسول الله صلى الله عليه وسلم مختف بمكة، كان إذا صلى بأصحابه رفع صوته بالقرآن فإذا سمعه المشركون سبوا القرآن ومن أنزله، ومن جاء به، فقال الله تعالى لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك‏}‏ أى بقراءتك، فيسمع المشركون، فيسبوا القرآن، ‏{‏ولا تخافت بها‏}‏ عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding): 'Neither say your, prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Apostle was hiding himself in Mecca. When he prayed with his companions, he used to raise his voice with the recitation of Qur'an, and if the pagans happened to hear him, they would abuse the Qur'an, the One who revealed it and the one who brought it. Therefore Allah said to His Prophet : 'Neither say your prayer aloud.' (17.110) i.e. do not recite aloud lest the pagans should hear you, but follow a way between.",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4790",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  أنه كان يقسم فيها إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم‏}‏ نزلت في حمزة وصاحبيه، وعتبة وصاحبيه يوم برزوا في يوم بدر رواه سفيان عن أبي هاشم‏.‏ وقال عثمان عن جرير عن منصور عن أبي هاشم عن أبي مجلز قوله‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     Abu Dharr used to take an oath confirming that the Verse: 'These two opponents (believers, and disbelievers) dispute with each other about their Lord.' (22.19) was Revealed in connection with Hamza and his two companions and `Utbah and his two companions on the day when they ease out of the battle of Badr.",
      "chain": [
        "20219",
        "20468",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4931",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، قال قلت لابن عباس سورة التوبة قال التوبة هي الفاضحة، ما زالت تنزل ومنهم ومنهم، حتى ظنوا أنها لم تبق أحدا منهم إلا ذكر فيها‏.‏ قال قلت سورة الأنفال‏.‏ قال نزلت في بدر‏.‏ قال قلت سورة الحشر‏.‏ قال نزلت في بني النضير‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I asked Ibn `Abbas about Surat Al-Tauba, and he said, \"Surat Al-Tauba? It is exposure (of all the evils of the infidels and the hypocrites). And it continued revealing (that the oft-repeated expression): '...and of them ...and of them.' till they started thinking that none would be left unmentioned therein.\" I said, \"What about) Surat Al-Anfal?\" He replied, \"Surat Al-Anfal was revealed in connection with the Badr Battle.\" I said, \"(What about) Surat Al-Hashr?\" He replied, \"It was revealed in connection with Bani an-Nadir.\"",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "hadith_no": "4965",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن عون، حدثنا هشيم، عن حميد، عن أنس، قال قال عمر  رضى الله عنه  اجتمع نساء النبي صلى الله عليه وسلم في الغيرة عليه فقلت لهن عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن‏.‏ فنزلت هذه الآية‏.‏",
      "text_en": " Narrated `Umar:                     The wives of the Prophet out of their jealousy, backed each other against the Prophet, so I said to them, \"It may be, if he divorced you all, that Allah will give him, instead of you wives better than you.\" So this Verse was revealed. (66.5)",
      "chain": [
        "30154",
        "20468",
        "11279",
        "19",
        "3"
      ]
    },
    {
      "hadith_no": "4990",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن النضر، أخبرنا هشيم، أخبرنا أبو بشر، جعفر بن إياس عن مجاهد، قال قال ابن عباس ‏{‏لتركبن طبقا عن طبق‏}‏ حالا بعد حال، قال هذا نبيكم صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (as regards the Verse):--'You shall surely travel from stage to stage (in this life and in the Hereafter).' (It means) from one state to another. That concerns your Prophet.",
      "chain": [
        "30253",
        "20468",
        "11028"
      ]
    },
    {
      "hadith_no": "5018",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أنه قال في الكوثر هو الخير الذي أعطاه الله إياه‏.‏ قال أبو بشر قلت لسعيد بن جبير فإن الناس يزعمون أنه نهر في الجنة‏.‏ فقال سعيد النهر الذي في الجنة من الخير الذي أعطاه الله إياه‏.‏",
      "text_en": " Narrated Abu Bishr:                     Sa`id bin Jubair said that Ibn `Abbas said about Al-Kauthar. \"That is the good which Allah has bestowed upon His Apostle.\" I said to Sa`id bin Jubair. \"But the people claim that it is a river in Paradise.\" Sa`id said, \"The river in Paradise is part of the good which Allah has bestowed on His Apostle.\"",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5089",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  جمعت المحكم في عهد رسول الله صلى الله عليه وسلم فقلت له وما المحكم قال المفصل‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said, \"I have learnt all the Muhkam Suras during the life time of Allah's Apostle.\" I said to him, 'What is meant by the Muhkam?\" He replied, \"The Mufassal.\"",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5135",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو النعمان، حدثنا هشيم، حدثنا سيار، عن الشعبي، عن جابر بن عبد الله، قال قفلنا مع النبي صلى الله عليه وسلم من غزوة فتعجلت على بعير لي قطوف، فلحقني راكب من خلفي، فنخس بعيري بعنزة كانت معه، فانطلق بعيري كأجود ما أنت راء من الإبل، فإذا النبي صلى الله عليه وسلم فقال ‏\"‏ ما يعجلك ‏\"‏‏.‏ قلت كنت حديث عهد بعرس‏.‏ قال ‏\"‏ بكرا أم ثيبا ‏\"‏‏.‏ قلت ثيب‏.‏ قال ‏\"‏ فهلا جارية تلاعبها وتلاعبك ‏\"‏‏.‏ قال فلما ذهبنا لندخل قال ‏\"‏ أمهلوا حتى تدخلوا ليلا  أى عشاء  لكى تمتشط الشعثة وتستحد المغيبة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While we were returning from a Ghazwa (Holy Battle) with the Prophet, I started driving my camel fast, as it was a lazy camel A rider came behind me and pricked my camel with a spear he had with him, and then my camel started running as fast as the best camel you may see. Behold! The rider was the Prophet himself. He said, 'What makes you in such a hurry?\" I replied, I am newly married \" He said, \"Did you marry a virgin or a matron? I replied, \"A matron.\" He said, \"Why didn't you marry a young girl so that you may play with her and she with you?\" When we were about to enter (Medina), the Prophet said, \"Wait so that you may enter (Medina) at night so that the lady of unkempt hair may comb her hair and the one whose husband has been absent may shave her pubic region.",
      "chain": [
        "20283",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5300",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، عن هشيم، عن سيار، عن الشعبي، عن جابر، قال كنت مع رسول الله صلى الله عليه وسلم في غزوة، فلما قفلنا تعجلت على بعير قطوف فلحقني راكب من خلفي، فالتفت فإذا أنا برسول الله صلى الله عليه وسلم قال ‏\"‏ ما يعجلك ‏\"‏‏.‏ قلت إني حديث عهد بعرس‏.‏ قال ‏\"‏ فبكرا تزوجت أم ثيبا ‏\"‏‏.‏ قلت بل ثيبا‏.‏ قال ‏\"‏ فهلا جارية تلاعبها وتلاعبك ‏\"‏‏.‏ قال فلما قدمنا ذهبنا لندخل فقال ‏\"‏ أمهلوا حتى تدخلوا ليلا  أى عشاء  لكى تمتشط الشعثة وتستحد المغيبة ‏\"‏‏.‏ قال وحدثني الثقة أنه قال في هذا الحديث ‏\"‏ الكيس الكيس يا جابر ‏\"‏‏.‏ يعني الولد‏.‏",
      "text_en": " Narrated Jabir:                     I was with Allah's Apostle in a Ghazwa, and when we returned, I wanted to hurry, while riding a slow camel. A rider came behind me. I looked back and saw that the rider was Allah's Apostle . He said (to me), \"What makes you in such a hurry?\" I replied, \"I am newly married.\" He said, \"Did you marry a virgin or a matron?\" I replied, \"(Not a virgin but) a matron.\" He said, \"Why didn't you marry a young girl with whom you could play and who could play with you?\" Then when we approached (Medina) and were going to enter (it), the Prophet said, \"Wait till you enter (your homes) at night (in the first part of the night) so that the ladies with unkempt hair may comb their hair, and those whose husbands have been absent (for a long time) may shave their pubic hair.\" (The sub-narrator, Hashim said: A reliable narrator told me that the Prophet added in this Hadith: \"(Seek to beget) children! Children, O Jabir!\")",
      "chain": [
        "30175",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5302",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا سيار، عن الشعبي، عن جابر بن عبد الله، قال كنا مع النبي صلى الله عليه وسلم في غزوة، فلما قفلنا كنا قريبا من المدينة تعجلت على بعير لي قطوف، فلحقني راكب من خلفي فنخس بعيري بعنزة كانت معه، فسار بعيري كأحسن ما أنت راء من الإبل، فالتفت فإذا أنا برسول الله صلى الله عليه وسلم فقلت يا رسول الله إني حديث عهد بعرس‏.‏ قال ‏\"‏ أتزوجت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أبكرا أم ثيبا ‏\"‏‏.‏ قال قلت بل ثيبا‏.‏ قال ‏\"‏ فهلا بكرا تلاعبها وتلاعبك ‏\"‏‏.‏ قال فلما قدمنا ذهبنا لندخل، فقال ‏\"‏ أمهلوا حتى تدخلوا ليلا  أى عشاء  لكى تمتشط الشعثة، وتستحد المغيبة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     We were with the Prophet in Ghazwa, and when we returned and approached Medina, I wanted to hurry while riding a slow camel. A rider overtook me and pricked my camel with a spear which he had, whereupon my camel started running as fast as any other fast camel you may see. I looked back, and behold, the rider was Allah's Apostle . I said, \"O Allah's Apostle! I am newly married \" He asked, \"Have you got married?\" I replied, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"(Not a virgin) but a matron\" He said, \"Why didn't you marry a young girl so that you could play with her and she with you?\" When we reached (near Medina) and were going to enter it, the Prophet said, \"Wait till you enter your home early in the night so that the lady whose hair is unkempt may comb her hair and that the lady whose husband has been away may shave her pubic hair.\"",
      "chain": [
        "20184",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5980",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الفضل بن عنبسة، أخبرنا هشيم، أخبرنا أبو بشر، ح وحدثنا قتيبة، حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بت ليلة عند ميمونة بنت الحارث خالتي، وكان رسول الله صلى الله عليه وسلم عندها في ليلتها  قال  فقام رسول الله صلى الله عليه وسلم يصلي من الليل، فقمت عن يساره  قال  فأخذ بذؤابتي فجعلني عن يمينه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I stayed overnight in the house of my aunt Maimuna bint Al-Harith and Allah's Apostle was with her as it was her turn. Allah's Apostle got up to offer the night prayer. I stood on his left but he took hold of my two locks of hair and made me stand on his right.",
      "chain": [
        "30026",
        "30366",
        "20468",
        "11419",
        "30367",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5981",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عمرو بن محمد، حدثنا هشيم، أخبرنا أبو بشر، بهذا، وقال بذؤابتي أو برأسي‏.‏",
      "text_en": " Narrated Abu Bishr:                     (the above Hadith) but he quoted: Ibn `Abbas said, (took hold of) my two braids on my head.\"",
      "chain": [
        "30263",
        "20468"
      ]
    },
    {
      "hadith_no": "6141",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "وقال محمد بن عيسى حدثنا هشيم، أخبرنا حميد الطويل، حدثنا أنس بن مالك، قال كانت الأمة من إماء أهل المدينة لتأخذ بيد رسول الله صلى الله عليه وسلم فتنطلق به حيث شاءت‏.‏",
      "text_en": "     Anas bin Malik said, \"Any of the female slaves of Medina      could take hold of the hand of Allah's Apostle and take him wherever      she wished.\"",
      "chain": [
        "31167",
        "20468",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "6331",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، حدثنا أنس بن مالك  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا سلم عليكم أهل الكتاب فقولوا وعليكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     the Prophet said, \"If the people of the Scripture greet you, then you should say (in reply), 'Wa'alaikum (And on you).' \"",
      "chain": [
        "30203",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6551",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن مسلم، حدثنا هشيم، أخبرنا غير، واحد، منهم مغيرة وفلان ورجل ثالث أيضا عن الشعبي عن وراد كاتب المغيرة بن شعبة أن معاوية كتب إلى المغيرة أن اكتب إلى بحديث سمعته من رسول الله صلى الله عليه وسلم قال فكتب إليه المغيرة أني سمعته يقول عند انصرافه من الصلاة ‏\"‏ لا إله إلا الله، وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير ‏\"‏‏.‏ ثلاث مرات قال وكان ينهى عن قيل وقال وكثرة السؤال، وإضاعة المال، ومنع وهات، وعقوق الأمهات، ووأد البنات‏.‏ وعن هشيم أخبرنا عبد الملك بن عمير قال سمعت ورادا يحدث هذا الحديث عن المغيرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Warrad:                     (the clerk of Al-Mughira bin Shu`ba) Muawiya wrote to Al-Mughira: \"Write to me a narration you have heard from Allah's Apostle.\" So Al-Mughira wrote to him, \"I heard him saying the following after each prayer: 'La ilaha illal-lahu wahdahu la sharika lahu, lahu-l-mulk wa lahuI-hamd, wa huwa 'ala kulli Shai-in qadir.' He also used to forbid idle talk, asking too many questions (in religion), wasting money, preventing what should be given, and asking others for something (except in great need), being undutiful to mothers, and burying one's little daughters (alive).",
      "chain": [
        "30261",
        "20468",
        "11052",
        "11402"
      ]
    },
    {
      "hadith_no": "6621",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا حصين،‏.‏ وحدثني أسيد بن زيد، حدثنا هشيم، عن حصين، قال كنت عند سعيد بن جبير فقال حدثني ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ عرضت على الأمم، فأخذ النبي يمر معه الأمة، والنبي يمر معه النفر، والنبي يمر معه العشرة، والنبي يمر معه الخمسة، والنبي يمر وحده، فنظرت فإذا سواد كثير قلت يا جبريل هؤلاء أمتي قال لا ولكن انظر إلى الأفق‏.‏ فنظرت فإذا سواد كثير‏.‏ قال هؤلاء أمتك، وهؤلاء سبعون ألفا قدامهم، لا حساب عليهم ولا عذاب‏.‏ قلت ولم قال كانوا لا يكتوون، ولا يسترقون، ولا يتطيرون، وعلى ربهم يتوكلون ‏\"‏‏.‏ فقام إليه عكاشة بن محصن فقال ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ اللهم اجعله منهم ‏\"‏‏.‏ ثم قام إليه رجل آخر قال ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"The people were displayed in front of me and I saw one prophet passing by with a large group of his followers, and another prophet passing by with only a small group of people, and another prophet passing by with only ten (persons), and another prophet passing by with only five (persons), and another prophet passed by alone. And then I looked and saw a large multitude of people, so I asked Gabriel, \"Are these people my followers?' He said, 'No, but look towards the horizon.' I looked and saw a very large multitude of people. Gabriel said. 'Those are your followers, and those are seventy thousand (persons) in front of them who will neither have any reckoning of their accounts nor will receive any punishment.' I asked, 'Why?' He said, 'For they used not to treat themselves with branding (cauterization) nor with Ruqya (get oneself treated by the recitation of some Verses of the Qur'an) and not to see evil omen in things, and they used to put their trust (only) in their Lord.\" On hearing that, 'Ukasha bin Mihsan got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet said, \"O Allah, make him one of them.\" Then another man got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet said, 'Ukasha has preceded you.\"",
      "chain": [
        "30156",
        "20356",
        "20468",
        "15097",
        "17"
      ]
    },
    {
      "hadith_no": "6658",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عمرو بن محمد، حدثنا هشيم، أخبرنا أبو بشر، وعطاء بن السائب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنه  قال الكوثر الخير الكثير الذي أعطاه الله إياه‏.‏ قال أبو بشر قلت لسعيد إن أناسا يزعمون أنه نهر في الجنة‏.‏ فقال سعيد النهر الذي في الجنة من الخير الذي أعطاه الله إياه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The word 'Al-Kauthar' means the abundant good which Allah gave to him (the Prophet Muhammad). Abu Bishr said: I said to Sa`id, \"Some people claim that it (Al-Kauthar) is a river in Paradise.\" Sa`id replied, \"The river which is in Paradise is one item of that good which Allah has bestowed upon him (Muhammad).",
      "chain": [
        "30263",
        "20468",
        "11419",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "6956",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا عمرو بن زرارة، حدثنا هشيم، حدثنا حصين، حدثنا أبو ظبيان، قال سمعت أسامة بن زيد بن حارثة  رضى الله عنهما  يحدث قال بعثنا رسول الله صلى الله عليه وسلم إلى الحرقة من جهينة  قال  فصبحنا القوم فهزمناهم  قال  ولحقت أنا ورجل من الأنصار رجلا منهم  قال  فلما غشيناه قال لا إله إلا الله  قال  فكف عنه الأنصاري، فطعنته برمحي حتى قتلته  قال  فلما قدمنا بلغ ذلك النبي صلى الله عليه وسلم قال فقال لي ‏\"‏ يا أسامة أقتلته بعد ما قال لا إله إلا الله ‏\"‏‏.‏ قال قلت يا رسول الله إنما كان متعوذا‏.‏ قال ‏\"‏ أقتلته بعد أن قال لا إله إلا الله ‏\"‏‏.‏ قال فما زال يكررها على حتى تمنيت أني لم أكن أسلمت قبل ذلك اليوم‏.‏",
      "text_en": " Narrated Usama bin Zaid bin Haritha:                     Allah's Apostle sent us (to fight) against Al-Huraqa (one of the sub-tribes) of Juhaina. We reached those people in the morning and defeated them. A man from the Ansar and I chased one of their men and when we attacked him, he said, \"None has the right to be worshipped but Allah.\" The Ansari refrained from killing him but I stabbed him with my spear till I killed him. When we reached (Medina), this news reached the Prophet. He said to me, \"O Usama! You killed him after he had said, 'None has the right to be worshipped but Allah?\"' I said, \"O Allah's Apostle! He said so in order to save himself.\" The Prophet said, \"You killed him after he had said, 'None has the right to be worshipped but Allah.\" The Prophet kept on repeating that statement till I wished I had not been a Muslim before that day.",
      "chain": [
        "30365",
        "20468",
        "15097",
        "50"
      ]
    },
    {
      "hadith_no": "7038",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏ فقال رجل يا رسول الله أنصره إذا كان مظلوما، أفرأيت إذا كان ظالما كيف أنصره قال ‏\"‏ تحجزه أو تمنعه من الظلم، فإن ذلك نصره ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"Help your brother whether he is an oppressor or an oppressed,\" A man said, \"O Allah's Apostle! I will help him if he is oppressed, but if he is an oppressor, how shall I help him?\" The Prophet said, \"By preventing him from oppressing (others), for that is how to help him.\"",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "7290",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا سيار، عن الشعبي، عن جرير بن عبد الله، قال بايعت النبي صلى الله عليه وسلم على السمع والطاعة، فلقنني، فيما استطعت، والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I gave the Pledge of allegiance to the Prophet that I would listen and obey, and he told me to add: 'As much as I can, and will give good advice to every Muslim.'",
      "chain": [
        "20184",
        "20468",
        "11429",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "7524",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد، وهشيم، عن إسماعيل، عن قيس، عن جرير، قال كنا جلوسا عند النبي صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر قال ‏\"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وصلاة قبل غروب الشمس، فافعلوا ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     We were sitting with the Prophet and he looked at the moon on the night of the full-moon and said, \"You people will see your Lord as you see this full moon, and you will have no trouble in seeing Him, so if you can avoid missing (through sleep or business, etc.) a prayer before sunrise (Fajr) and a prayer before sunset (`Asr) you must do so.\" (See Hadith No. 529, Vol. 1)",
      "chain": [
        "30154",
        "20423",
        "20468",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "7561",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا ابن سلام، أخبرنا هشيم، عن حصين، عن عبد الله بن أبي قتادة، عن أبيه، حين ناموا عن الصلاة، قال النبي صلى الله عليه وسلم ‏\"‏ إن الله قبض أرواحكم حين شاء، وردها حين شاء ‏\"‏‏.‏ فقضوا حوائجهم وتوضئوا إلى أن طلعت الشمس وابيضت فقام فصلى‏.‏",
      "text_en": " Narrated Abu Qatada:                     When the people slept till so late that they did not offer the (morning) prayer, the Prophet said, \"Allah captured your souls (made you sleep) when He willed, and returned them (to your bodies) when He willed.\" So the people got up and went to answer the call of nature, performed ablution, till the sun had risen and it had become white, then the Prophet got up and offered the prayer.",
      "chain": [
        "30376",
        "20468",
        "15097",
        "11804"
      ]
    },
    {
      "hadith_no": "7582",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسدد، عن هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال أنزلت ورسول الله صلى الله عليه وسلم متوار بمكة، فكان إذا رفع صوته سمع المشركون فسبوا القرآن ومن أنزله ومن جاء به‏.‏ وقال الله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ لا تجهر بصلاتك حتى يسمع المشركون، ولا تخافت بها عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏ أسمعهم ولا تجهر حتى يأخذوا عنك القرآن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding the Verse):-- 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Apostle was hiding himself in Mecca, and when he raised his voice while reciting the Qur'an, the pagans would hear him and abuse the Qur'an and its Revealer and to the one who brought it. So Allah said:-- 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) That is, 'Do not say your prayer so loudly that the pagans can hear you, nor say it in such a low tone that your companions do not hear you.' But seek a middle course between those (extremes), i.e., let your companions hear, but do not relate the Qur'an loudly, so that they may learn it from you.",
      "chain": [
        "30175",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "7619",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني عمرو بن زرارة، عن هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  في قوله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال نزلت ورسول الله صلى الله عليه وسلم مختف بمكة، فكان إذا صلى بأصحابه رفع صوته بالقرآن، فإذا سمعه المشركون سبوا القرآن ومن أنزله ومن جاء به، فقال الله لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك‏}‏ أى بقراءتك، فيسمع المشركون، فيسبوا القرآن ‏{‏ولا تخافت بها‏}‏ عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     regarding the explanation of the Verse:-- '(O Muhammad!) Neither say your prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Apostle was hiding himself at Mecca. At that time, when he led his companions in prayer, he used to raise his voice while reciting the Qur'an; and if the pagans heard him, they would abuse the Qur'an, its Revealer, and the one who brought it. So Allah said to His Prophet: \"Neither say your prayer aloud. i.e., your recitation (of Qur'an) lest the pagans should hear (it) and abuse the Qur'an\" nor say it in a low tone, \"lest your voice should fail to reach your companions, \"but follow a way between.\" (17.110)",
      "chain": [
        "30365",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "7642",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم متواريا بمكة، وكان يرفع صوته، فإذا سمع المشركون سبوا القرآن ومن جاء به، فقال الله عز وجل لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was hiding himself in Mecca and used to recite the (Qur'an) in a loud voice. When the pagans heard him they would abuse the Qur'an and the one who brought it, so Allah said to His Prophet: 'Neither say your prayer aloud, nor say it in a low tone.' (17.110)",
      "chain": [
        "20219",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 381
}