{
  "id": "20467",
  "name": "Hisham bin Yusuf al-Sana'i هشام بن يوسف الصنعاني أبو عبد الرحمن",
  "full_name": "Hisham bin Yusuf al-Sana'i هشام بن يوسف الصنعاني أبو عبد الرحمن",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "197",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Yemen",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]",
      "Qadhi(Judge)",
      "Fiqh"
    ],
    "tags": [
      "al-Abnawi",
      "Judge",
      "al-Sana'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28487",
      "name": "al-Qasim bin Fyad bin Abd القاسم بن فياض بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28278",
      "name": "'Abdullah bin Bhyr عبد الله بن بحير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28290",
      "name": "'Abdullah bin Sulaiman عبد الله بن سليمان النوفلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28013",
      "name": "Ibrahim bin 'Umar bin Kysan إبراهيم بن عمر بن كيسان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28604",
      "name": "al-Nu'man bin Abi Shayba النعمان بن أبي شيبة عبيد الصنعاني أو",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "296",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني هشام، عن عروة، أنه سئل أتخدمني الحائض أو تدنو مني المرأة وهى جنب فقال عروة كل ذلك على هين، وكل ذلك تخدمني، وليس على أحد في ذلك بأس، أخبرتني عائشة أنها كانت ترجل  تعني  رأس رسول الله صلى الله عليه وسلم وهي حائض، ورسول الله صلى الله عليه وسلم حينئذ مجاور في المسجد، يدني لها رأسه وهى في حجرتها، فترجله وهى حائض‏.‏",
      "text_en": " Narrated `Urwa:                     A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" I replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person to do the same. `Aisha told me that she used to comb the hair of Allah's Apostle while she was in her menses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she would comb his hair, while she used to be in her menses.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "665",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، عن معمر، عن الزهري، قال أخبرني عبيد الله بن عبد الله، قال قالت عائشة لما ثقل النبي صلى الله عليه وسلم واشتد وجعه استأذن أزواجه أن يمرض في بيتي فأذن له، فخرج بين رجلين تخط رجلاه الأرض، وكان بين العباس ورجل آخر‏.‏ قال عبيد الله فذكرت ذلك لابن عباس ما قالت عائشة فقال لي وهل تدري من الرجل الذي لم تسم عائشة قلت لا‏.‏ قال هو علي بن أبي طالب‏.‏",
      "text_en": " Narrated `Aisha:                     \"When the Prophet became seriously ill and his disease became aggravated he asked for permission from his wives to be nursed in my house and he was allowed. He came out with the help of two men and his legs were dragging on the ground. He was between Al-`Abbas and another man.\" 'Ubaidullah said, \"I told Ibn `Abbas what `Aisha had narrated and he said, 'Do you know who was the (second) man whose name `Aisha did not mention'\" I said, 'No.' Ibn `Abbas said, 'He was `Ali Ibn Abi Talib.' \"",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "1077",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني أبو بكر بن أبي مليكة، عن عثمان بن عبد الرحمن التيمي، عن ربيعة بن عبد الله بن الهدير التيمي  قال أبو بكر وكان ربيعة من خيار الناس عما حضر ربيعة من عمر بن الخطاب  رضى الله عنه  قرأ يوم الجمعة على المنبر بسورة النحل حتى إذا جاء السجدة نزل فسجد وسجد الناس، حتى إذا كانت الجمعة القابلة قرأ بها حتى إذا جاء السجدة قال يا أيها الناس إنا نمر بالسجود فمن سجد فقد أصاب، ومن لم يسجد فلا إثم عليه‏.‏ ولم يسجد عمر  رضى الله عنه‏.‏ وزاد نافع عن ابن عمر  رضى الله عنهما إن الله لم يفرض السجود إلا أن نشاء‏.‏",
      "text_en": " Narrated Rabi`a:                     `Umar bin Al-Khattab recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse of Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday `Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O people! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right thing, yet it is no sin for the one who does not prostrate.\" And `Umar did not prostrate (that day). Added Ibn `Umar \"Allah has not made the prostration of recitation compulsory but if we wish we can do it.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11569",
        "11525",
        "20436"
      ]
    },
    {
      "hadith_no": "1320",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني عطاء، أنه سمع جابر بن عبد الله  رضى الله عنهما  يقول قال النبي صلى الله عليه وسلم ‏\"‏ قد توفي اليوم رجل صالح من الحبش فهلم فصلوا عليه ‏\"‏‏.‏ قال فصففنا فصلى النبي صلى الله عليه وسلم عليه ونحن صفوف‏.‏ قال أبو الزبير عن جابر كنت في الصف الثاني‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"Today a pious man from Ethiopia (i.e. An Najashi) has expired, come on to offer the funeral prayer.\" (Jabir said): We lined up in rows and after that the Prophet led the prayer and we were in rows. Jabir added, I was in the second row.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1570",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا ابن جريج، حدثنا محمد بن المنكدر، عن أنس بن مالك  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم بالمدينة أربعا، وبذي الحليفة ركعتين، ثم بات حتى أصبح بذي الحليفة، فلما ركب راحلته واستوت به أهل‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet offered four rak`at in Medina and then two rak`at at Dhul Hulaifa and then passed the night at Dhul-Hulaifa till it was morning and when he mounted his Mount and it stood up, he started to recite Talbiya.",
      "chain": [
        "30351",
        "20467",
        "11070",
        "11048",
        "19"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن ابن جريج، قال أخبرني عطاء، عن أبي صالح الزيات، أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله كل عمل ابن آدم له إلا الصيام، فإنه لي، وأنا أجزي به‏.‏ والصيام جنة، وإذا كان يوم صوم أحدكم، فلا يرفث ولا يصخب، فإن سابه أحد، أو قاتله فليقل إني امرؤ صائم‏.‏ والذي نفس محمد بيده لخلوف فم الصائم أطيب عند الله من ريح المسك، للصائم فرحتان يفرحهما إذا أفطر فرح، وإذا لقي ربه فرح بصومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah said, 'All the deeds of Adam's sons (people) are for them, except fasting which is for Me, and I will give the reward for it.' Fasting is a shield or protection from the fire and from committing sins. If one of you is fasting, he should avoid sexual relation with his wife and quarreling, and if somebody should fight or quarrel with him, he should say, 'I am fasting.' By Him in Whose Hands my soul is' The unpleasant smell coming out from the mouth of a fasting person is better in the sight of Allah than the smell of musk. There are two pleasures for the fasting person, one at the time of breaking his fast, and the other at the time when he will meet his Lord; then he will be pleased because of his fasting.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "2267",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يعلى بن مسلم، وعمرو بن دينار، عن سعيد بن جبير، يزيد أحدهما على صاحبه، وغيرهما قال قد سمعته يحدثه عن سعيد قال قال لي ابن عباس  رضى الله عنهما  حدثني أبى بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فانطلقا فوجدا جدارا يريد أن ينقض ‏\"‏‏.‏ قال سعيد بيده هكذا، ورفع يديه فاستقام، قال يعلى حسبت أن سعيدا قال‏.‏ فمسحه بيده فاستقام ‏{‏قال‏}‏ ‏\"‏لو شئت لاتخذت عليه أجرا ‏\"‏‏.‏ قال سعيد أجرا نأكله‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     Allah's Apostle said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall which was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the wall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or Sa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if you had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to buy food . \"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11568",
        "11081",
        "11050",
        "11168",
        "17"
      ]
    },
    {
      "hadith_no": "2624",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني عبد الله بن عبيد الله بن أبي مليكة، أن بني صهيب، مولى ابن جدعان ادعوا بيتين وحجرة، أن رسول الله صلى الله عليه وسلم أعطى ذلك صهيبا، فقال مروان من يشهد لكما على ذلك قالوا ابن عمر‏.‏ فدعاه فشهد لأعطى رسول الله صلى الله عليه وسلم صهيبا بيتين وحجرة‏.‏ فقضى مروان بشهادته لهم‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr (ra):                      My mother came to me during the lifetime of Allah's Messenger () and she was a Mushrikah (polytheist, idolatress, pagan). I said to Allah's Messenger () (seeking his verdict), \"My mother has come to and she desires to recieve a reward from me, shall I keep good relations with her ?\" The Prophet () said, \"Yes, keep good relation with her.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11090"
      ]
    },
    {
      "hadith_no": "2762",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يعلى، أنه سمع عكرمة، مولى ابن عباس يقول أنبأنا ابن عباس، أن سعد بن عبادة  رضى الله عنهم  أخا بني ساعدة توفيت أمه وهو غائب، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي توفيت وأنا غائب عنها، فهل ينفعها شىء إن تصدقت به عنها قال ‏\"‏ نعم ‏\"‏‏.‏ قال فإني أشهدك أن حائطي المخراف صدقة عليها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That the mother of Sa`d bin Ubada the brother of Bani Saida died in Sa`d's absence, so he came to the Prophet saying, \"O Allah's Apostle! My mother died in my absence, will it benefit her if I give in charity on her behalf?\" The Prophet said, \"Yes.\" Sa`d said, \"I take you as my witness that I give my garden Al-Makhraf in charity on her behalf.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "20372",
        "11023",
        "17",
        "35"
      ]
    },
    {
      "hadith_no": "3298",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام بن يوسف، حدثنا معمر، عن الزهري، عن سالم، عن ابن عمر  رضى الله عنهما  أنه سمع النبي صلى الله عليه وسلم يخطب على المنبر يقول ‏\"‏ اقتلوا الحيات، واقتلوا ذا الطفيتين والأبتر، فإنهما يطمسان البصر، ويستسقطان الحبل ‏\"‏‏.‏ قال عبد الله فبينا أنا أطارد، حية لأقتلها فناداني أبو لبابة لا تقتلها‏.‏ فقلت إن رسول الله صلى الله عليه وسلم قد أمر بقتل الحيات‏.‏ قال إنه نهى بعد ذلك عن ذوات البيوت، وهى العوامر‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That he heard the Prophet delivering a sermon on the pulpit saying, \"Kill snakes and kill Dhu-at- Tufyatain (i.e. a snake with two white lines on its back) and ALBATROSS (i.e. a snake with short or mutilated tail) for they destroy the sight of one's eyes and bring about abortion.\" (`Abdullah bin `Umar further added): Once while I was chasing a snake in order, to kill it, Abu Lubaba called me saying: \"Don't kill it,\" I said. \"Allah's Apostle ordered us to kill snakes.\" He said, \"But later on he prohibited the killing of snakes living in the houses.\" (Az-Zuhri said. \"Such snakes are called Al-Awamir.\")",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3394",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ليلة أسري به ‏\"‏ رأيت موسى وإذا رجل ضرب رجل، كأنه من رجال شنوءة، ورأيت عيسى، فإذا هو رجل ربعة أحمر كأنما خرج من ديماس، وأنا أشبه ولد إبراهيم صلى الله عليه وسلم به، ثم أتيت بإناءين، في أحدهما لبن، وفي الآخر خمر فقال اشرب أيهما شئت‏.‏ فأخذت اللبن فشربته فقيل أخذت الفطرة، أما إنك لو أخذت الخمر غوت أمتك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"On the night of my Ascension to Heaven, I saw (the prophet) Moses who was a thin person with lank hair, looking like one of the men of the tribe of Shanua; and I saw Jesus who was of average height with red face as if he had just come out of a bathroom. And I resemble prophet Abraham more than any of his offspring does. Then I was given two cups, one containing milk and the other wine. Gabriel said, 'Drink whichever you like.' I took the milk and drank it. Gabriel said, 'You have accepted what is natural, (True Religion i.e. Islam) and if you had taken the wine, your followers would have gone astray.' \"",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3797",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن معمر، عن الزهري، عن أنس،‏.‏ وقال عبد الرزاق أخبرنا معمر، عن الزهري، أخبرني أنس، قال لم يكن أحد أشبه بالنبي صلى الله عليه وسلم من الحسن بن علي‏.‏",
      "text_en": " Narrated Anas:                     None resembled the Prophet more than Al-Hasan bin `Ali did.",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "20121",
        "20115",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4022",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "أخبرني إبراهيم بن موسى، حدثنا هشام بن يوسف، عن معمر، عن هشام، عن عروة، قال كان في الزبير ثلاث ضربات بالسيف، إحداهن في عاتقه، قال إن كنت لأدخل أصابعي فيها‏.‏ قال ضرب ثنتين يوم بدر، وواحدة يوم اليرموك‏.‏ قال عروة وقال لي عبد الملك بن مروان حين قتل عبد الله بن الزبير يا عروة، هل تعرف سيف الزبير قلت نعم‏.‏ قال فما فيه قلت فيه فلة فلها يوم بدر‏.‏ قال صدقت‏.‏ بهن فلول من قراع الكتائب ثم رده على عروة‏.‏ قال هشام فأقمناه بيننا ثلاثة آلاف، وأخذه بعضنا، ولوددت أني كنت أخذته‏.‏",
      "text_en": "      Narrated 'Urwa (the son of Az- Zubair):                          Az-Zubair had three scars      caused by the sword, one of which was over his shoulder and I used to      insert my fingers in it. He received two of those wounds on the day of     Badr and one on the day of Al-Yarmuk. When 'Abdullah bin Zubair was      killed, 'Abdul-Malik bin Marwan said to me, \"O 'Urwa, do you recognize     the sword of Az-Zubair?\" I said, \"Yes.\" He said, \"What marks does it      have?\" I replied, \"It has a dent in its sharp edge which was caused in     it on the day of Badr.\" 'Abdul- Malik said, \"You are right! (i.e.      their swords) have dents because of clashing with the regiments of the     enemies Then 'Abdul-Malik returned that sword to me (i.e. Urwa).      (Hisham, 'Urwa's son said, \"We estimated the price of the sword as      three-thousand (Dinars) and after that it was taken by one of us (i.e.     the inheritors) and I wish I could have had it.\")",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11065",
        "10511",
        "10511"
      ]
    },
    {
      "hadith_no": "4135",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن معمر، عن الزهري، عن عمرو بن أبي سفيان الثقفي، عن أبي هريرة  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية عينا، وأمر عليهم عاصم بن ثابت  وهو جد عاصم بن عمر بن الخطاب  فانطلقوا حتى إذا كان بين عسفان ومكة ذكروا لحي من هذيل، يقال لهم بنو لحيان، فتبعوهم بقريب من مائة رام، فاقتصوا آثارهم حتى أتوا منزلا نزلوه فوجدوا فيه نوى تمر تزودوه من المدينة فقالوا هذا تمر يثرب‏.‏ فتبعوا آثارهم حتى لحقوهم، فلما انتهى عاصم وأصحابه لجئوا إلى فدفد، وجاء القوم فأحاطوا بهم، فقالوا لكم العهد والميثاق إن نزلتم إلينا أن لا نقتل منكم رجلا‏.‏ فقال عاصم أما أنا فلا أنزل في ذمة كافر، اللهم أخبر عنا نبيك‏.‏ فقاتلوهم حتى قتلوا عاصما في سبعة نفر بالنبل، وبقي خبيب، وزيد ورجل آخر، فأعطوهم العهد والميثاق، فلما أعطوهم العهد والميثاق نزلوا إليهم، فلما استمكنوا منهم حلوا أوتار قسيهم فربطوهم بها‏.‏ فقال الرجل الثالث الذي معهما هذا أول الغدر‏.‏ فأبى أن يصحبهم فجرروه وعالجوه على أن يصحبهم، فلم يفعل، فقتلوه، وانطلقوا بخبيب وزيد حتى باعوهما بمكة، فاشترى خبيبا بنو الحارث بن عامر بن نوفل، وكان خبيب هو قتل الحارث يوم بدر، فمكث عندهم أسيرا حتى إذا أجمعوا قتله استعار موسى من بعض بنات الحارث أستحد بها فأعارته، قالت فغفلت عن صبي لي فدرج إليه حتى أتاه، فوضعه على فخذه، فلما رأيته فزعت فزعة عرف ذاك مني، وفي يده الموسى فقال أتخشين أن أقتله ما كنت لأفعل ذاك إن شاء الله‏.‏ وكانت تقول ما رأيت أسيرا قط خيرا من خبيب، لقد رأيته يأكل من قطف عنب، وما بمكة يومئذ ثمرة، وإنه لموثق في الحديد، وما كان إلا رزق رزقه الله، فخرجوا به من الحرم، ليقتلوه فقال دعوني أصلي ركعتين‏.‏ ثم انصرف إليهم فقال لولا أن تروا أن ما بي جزع من الموت، لزدت‏.‏ فكان أول من سن الركعتين عند القتل هو، ثم قال اللهم أحصهم عددا ثم قال ما أبالي حين أقتل مسلما على أى شق كان لله مصرعي وذلك في ذات الإله وإن يشأ يبارك على أوصال شلو ممزع ثم قام إليه عقبة بن الحارث فقتله، وبعث قريش إلى عاصم ليؤتوا بشىء من جسده يعرفونه، وكان عاصم قتل عظيما من عظمائهم يوم بدر، فبعث الله عليه مثل الظلة من الدبر، فحمته من رسلهم، فلم يقدروا منه على شىء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet sent a Sariya of spies and appointed `Asim bin Thabit, the grandfather of `Asim bin `Umar bin Al-Khattab, as their leader. So they set out, and when they reached (a place) between 'Usfan and Mecca, they were mentioned to one of the branch tribes of Bani Hudhail called Lihyan. So, about one-hundred archers followed their traces till they (i.e. the archers) came to a journey station where they (i.e. `Asim and his companions) had encamped and found stones of dates they had brought as journey food from Medina. The archers said, \"These are the dates of Medina,\" and followed their traces till they took them over. When `Asim and his companions were not able to go ahead, they went up a high place, and their pursuers encircled them and said, \"You have a covenant and a promise that if you come down to us, we will not kill anyone of you.\" `Asim said, \"As for me, I will never come down on the security of an infidel. O Allah! Inform Your Prophet about us.\" So they fought with them till they killed `Asim along with seven of his companions with arrows, and there remained Khubaib, Zaid and another man to whom they gave a promise and a covenant. So when the infidels gave them the covenant and promise, they came down. When they captured them, they opened the strings of their arrow bows and tied them with it. The third man who was with them said, \"This is the first breach in the covenant,\" and refused to accompany them. They dragged him and tried to make him accompany them, but he refused, and they killed him. Then they proceeded on taking Khubaib and Zaid till they sold them in Mecca. The sons of Al-Harith bin `Amr bin Naufal bought Khubaib. It was Khubaib who had killed Al-Harith bin `Amr on the day of Badr. Khubaib stayed with them for a while as a captive till they decided unanimously to kill him. (At that time) Khubaib borrowed a razor from one of the daughters of Al- Harith to shave his pubic hair. She gave it to him. She said later on, \"I was heedless of a little baby of mine, who moved towards Khubaib, and when it reached him, he put it on his thigh. When I saw it, I got scared so much that Khubaib noticed my distress while he was carrying the razor in his hand. He said 'Are you afraid that I will kill it? Allah willing, I will never do that,' \" Later on she used to say, \"I have never seen a captive better than Khubaib Once I saw him eating from a bunch of grapes although at that time no fruits were available at Mecca, and he was fettered with iron chains, and in fact, it was nothing but food bestowed upon him by Allah.\" So they took him out of the Sanctuary (of Mecca) to kill him. He said, \"Allow me to offer a two-rak`at prayer.\" Then he went to them and said, \"Had I not been afraid that you would think I was afraid of death, I would have prayed for a longer time.\" So it was Khubaib who first set the tradition of praying two rak`at before being executed. He then said, \"O Allah! Count them one by one,\" and added, 'When I am being martyred as a Muslim, I do not care in what way I receive my death for Allah's Sake, because this death is in Allah's Cause. If He wishes, He will bless the cut limbs.\" Then `Uqba bin Al-Harith got up and martyred him. The narrator added: The Quraish (infidels) sent some people to `Asim in order to bring a part of his body so that his death might be known for certain, for `Asim had killed one of their chiefs on the day of Badr. But Allah sent a cloud of wasps which protected his body from their messengers who could not harm his body consequently.",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "11531",
        "13"
      ]
    },
    {
      "hadith_no": "4410",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، حدثنا هشام بن يوسف، أن ابن جريج، أخبرهم عن ابن أبي مليكة، أن عبد الله بن الزبير، أخبرهم أنه، قدم ركب من بني تميم على النبي صلى الله عليه وسلم فقال أبو بكر أمر القعقاع بن معبد بن زرارة‏.‏ قال عمر بل أمر الأقرع بن حابس‏.‏ قال أبو بكر ما أردت إلا خلافي‏.‏ قال عمر ما أردت خلافك‏.‏ فتماريا حتى ارتفعت أصواتهما فنزل في ذلك ‏{‏يا أيها الذين آمنوا لا تقدموا‏}‏ حتى انقضت‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     `Abdullah bin Az-Zubair said that a group of riders belonging to Banu Tamim came to the Prophet, Abu Bakr said (to the Prophet ), \"Appoint Al-Qa'qa bin Mabad bin Zurara as (their) ruler.\" `Umar said (to the Prophet). \"No! But appoint Al-Aqra bin H`Abis.\" Thereupon Abu Bakr said (to `Umar). \"You just wanted to oppose me.\" `Umar replied. \"I did not want to oppose you.\" So both of them argued so much that their voices became louder, and then the following Divine Verses were revealed in that connection:-- \"O you who believe ! Do not be forward in the presence of Allah and His Apostle...\" (till the end of Verse)...(49.1)",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11090",
        "106"
      ]
    },
    {
      "hadith_no": "4773",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يعلى بن مسلم، وعمرو بن دينار، عن سعيد بن جبير، يزيد أحدهما على صاحبه وغيرهما قد سمعته يحدثه عن سعيد قال إنا لعند ابن عباس في بيته، إذ قال سلوني قلت أى أبا عباس  جعلني الله فداك  بالكوفة رجل قاص يقال له نوف، يزعم أنه ليس بموسى بني إسرائيل، أما عمرو فقال لي قال قد كذب عدو الله، وأما يعلى فقال لي قال ابن عباس حدثني أبى بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ موسى رسول الله  عليه السلام  قال ذكر الناس يوما حتى إذا فاضت العيون، ورقت القلوب ولى، فأدركه رجل، فقال أى رسول الله هل في الأرض أحد أعلم منك قال لا، فعتب عليه إذ لم يرد العلم إلى الله قيل بلى قال أى رب فأين قال بمجمع البحرين قال أى رب اجعل لي علما أعلم ذلك به ‏\"‏‏.‏ فقال لي عمرو قال ‏\"‏ حيث يفارقك الحوت ‏\"‏‏.‏ وقال لي يعلى قال ‏\"‏ خذ نونا ميتا حيث ينفخ فيه الروح، فأخذ حوتا فجعله في مكتل فقال لفتاه لا أكلفك إلا أن تخبرني بحيث يفارقك الحوت‏.‏ قال ما كلفت كثيرا فذلك قوله جل ذكره ‏{‏وإذ قال موسى لفتاه‏}‏ يوشع بن نون  ليست عن سعيد  قال فبينما هو في ظل صخرة في مكان ثريان، إذ تضرب الحوت، وموسى نائم، فقال فتاه لا أوقظه حتى إذا استيقظ نسي أن يخبره، وتضرب الحوت، حتى دخل البحر فأمسك الله عنه جرية البحر حتى كأن أثره في حجر  قال لي عمرو هكذا كأن أثره في حجر، وحلق بين إبهاميه واللتين تليانهما  لقد لقينا من سفرنا هذا نصبا قال قد قطع الله عنك النصب  ليست هذه عن سعيد  أخبره، فرجعا فوجدا خضرا  قال لي عثمان بن أبي سليمان  على طنفسة خضراء على كبد البحر  قال سعيد بن جبير  مسجى بثوبه قد جعل طرفه تحت رجليه، وطرفه تحت رأسه، فسلم عليه موسى، فكشف عن وجهه، وقال هل بأرضي من سلام من أنت قال أنا موسى‏.‏ قال موسى بني إسرائيل قال نعم‏.‏ قال فما شأنك قال جئت لتعلمني مما علمت رشدا‏.‏ قال أما يكفيك أن التوراة بيديك، وأن الوحى يأتيك، يا موسى إن لي علما لا ينبغي لك أن تعلمه وإن لك علما لا ينبغي لي أن أعلمه، فأخذ طائر بمنقاره من البحر وقال والله ما علمي وما علمك في جنب علم الله إلا كما أخذ هذا الطائر بمنقاره من البحر، حتى إذا ركبا في السفينة وجدا معابر صغارا تحمل أهل هذا الساحل إلى أهل هذا الساحل الآخر عرفوه، فقالوا عبد الله الصالح  قال قلنا لسعيد خضر قال نعم  لا نحمله بأجر، فخرقها ووتد فيها وتدا‏.‏ قال موسى أخرقتها لتغرق أهلها لقد جئت شيئا إمرا  قال مجاهد منكرا  قال ألم أقل إنك لن تستطيع معي صبرا كانت الأولى نسيانا والوسطى شرطا والثالثة عمدا قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا، لقيا غلاما فقتله  قال يعلى قال سعيد  وجد غلمانا يلعبون، فأخذ غلاما كافرا ظريفا فأضجعه، ثم ذبحه بالسكين‏.‏ قال أقتلت نفسا زكية بغير نفس لم تعمل بالحنث  وكان ابن عباس قرأها زكية زاكية مسلمة كقولك غلاما زكيا  فانطلقا، فوجدا جدارا يريد أن ينقض فأقامه  قال سعيد بيده هكذا  ورفع يده فاستقام  قال يعلى  حسبت أن سعيدا قال فمسحه بيده فاستقام، لو شئت لاتخذت عليه أجرا  قال سعيد أجرا نأكله  وكان وراءهم، وكان أمامهم  قرأها ابن عباس أمامهم ملك  يزعمون عن غير سعيد أنه هدد بن بدد، والغلام المقتول، اسمه يزعمون جيسور ملك يأخذ كل سفينة غصبا، فأردت إذا هي مرت به أن يدعها لعيبها، فإذا جاوزوا أصلحوها فانتفعوا بها ومنهم من يقول سدوها بقارورة ومنهم من يقول بالقار، كان أبواه مؤمنين، وكان كافرا فخشينا أن يرهقهما طغيانا وكفرا، أن يحملهما حبه على أن يتابعاه على دينه فأردنا أن يبدلهما ربهما خيرا منه زكاة لقوله أقتلت نفسا زكية وأقرب رحما هما به أرحم منهما بالأول، الذي قتل خضر وزعم غير سعيد أنهما أبدلا جارية، وأما داود بن أبي عاصم فقال عن غير واحد إنها جارية‏\"‏‏.‏",
      "text_en": " Narrated Ibn Juraij:                     Ya`la bin Muslim and `Amr bin Dinar and some others narrated the narration of Sa`id bin Jubair. Narrated Sa`id: While we were at the house of Ibn `Abbas, Ibn `Abbas said, \"Ask me (any question)\" I said, \"O Abu `Abbas! May Allah let me be sacrificed for you ! There is a man at Kufa who is a storyteller called Nauf; who claims that he (Al-Khadir's companion) is not Moses of Bani Israel.\" As for `Amr, he said to me, \"Ibn `Abbas said, \"(Nauf) the enemy of Allah told a lie.\" But Ya`la said to me, \"Ibn `Abbas said, Ubai bin Ka`b said, Allah's Apostle said, 'Once Moses, Allah's Apostle, preached to the people till their eyes shed tears and their hearts became tender, whereupon he finished his sermon. Then a man came to Moses and asked, 'O Allah's Apostle! Is there anyone on the earth who is more learned than you?' Moses replied, 'No.' So Allah admonished him (Moses), for he did not ascribe all knowledge to Allah. It was said, (on behalf of Allah), 'Yes, (there is a slave of ours who knows more than you ).' Moses said, 'O my Lord! Where is he?' Allah said, 'At the junction of the two seas.' Moses said, 'O my Lord ! Tell I me of a sign whereby I will recognize the place.' \" `Amr said to me, Allah said, \"That place will be where the fish will leave you.\" Ya`la said to me, \"Allah said (to Moses), 'Take a dead fish (and your goal will be) the place where it will become alive.' \" So Moses took a fish and put it in a basket and said to his boy-servant \"I don't want to trouble you, except that you should inform me as soon as this fish leaves you.\" He said (to Moses).\" You have not demanded too much.\" And that is as mentioned by Allah: 'And (remember) when Moses said to his attendant .... ' (18.60) Yusha` bin Noon. (Sa`id did not state that). The Prophet said, \"While the attendant was in the shade of the rock at a wet place, the fish slipped out (alive) while Moses was sleeping. His attend an said (to himself), \"I will not wake him, but when he woke up, he forgot to tell him The fish slipped out and entered the sea. Allah stopped the flow of the sea. where the fish was, so that its trace looked as if it was made on a rock. `Amr forming a hole with his two thumbs an index fingers, said to me, \"Like this, as in its trace was made on a rock.\" Moses said \"We have suffered much fatigue on this journey of ours.\" (This was not narrated by Sa`id). Then they returned back and found Al-Khadir. `Uthman bin Abi Sulaiman said to me, (they found him) on a green carpet in the middle of the sea. Al-Khadir was covered with his garment with one end under his feet and the other end under his head. When Moses greeted, he uncovered his face and said astonishingly, 'Is there such a greeting in my land? Who are you?' Moses said, 'I am Moses.' Al- Khadir said, 'Are you the Moses of Bani Israel?' Moses said, 'Yes.' Al-Khadir said, \"What do you want?' Moses said, ' I came to you so that you may teach me of the truth which you were taught.' Al- Khadir said, 'Is it not sufficient for you that the Torah is in your hands and the Divine Inspiration comes to you, O Moses? Verily, I have a knowledge that you ought not learn, and you have a knowledge which I ought not learn.' At that time a bird took with its beak (some water) from the sea: Al-Khadir then said, 'By Allah, my knowledge and your knowledge besides Allah's Knowledge is like what this bird has taken with its beak from the sea.' Until, when they went on board the boat (18.71). They found a small boat which used to carry the people from this sea-side to the other sea-side. The crew recognized Al-Khadir and said, 'The pious slave of Allah.' (We said to Sa`id \"Was that Khadir?\" He said, \"Yes.\") The boat men said, 'We will not get him on board with fare.' Al-Khadir scuttled the boat and then plugged the hole with a piece o wood. Moses said, 'Have you scuttle it in order to drown these people surely, you have done a dreadful thing. (18.71) (Mujahid said. \"Moses said so protestingly.\") Al-Khadir said, didn't I say that you can have no patience with me?' (18.72) The first inquiry of Moses was done because of forget fullness, the second caused him to be bound with a stipulation, and the third was done he intentionally. Moses said, 'Call me not to account for what I forgot and be not hard upon me for my affair (with you).' (18.73) (Then) they found a boy and Al-Khadir killed him. Ya`la- said: Sa`id said 'They found boys playing and Al-Khadir got hold of a handsome infidel boy laid him down and then slew him with knife. Moses said, 'Have you killed a innocent soul who has killed nobody' (18.74) Then they proceeded and found a wall which was on the point of falling down, and Al-Khadir set it up straight Sa`id moved his hand thus and said 'Al-Khadir raised his hand and the wall became straight. Ya`la said, 'I think Sa`id said, 'Al-Khadir touched the wall with his hand and it became straight (Moses said to Al-Khadir), 'If you had wished, you could have taken wages for it. Sa`id said, 'Wages that we might had eaten.' And there was a king in furor (ahead) of them\" (18.79) And there was in front of them. Ibn `Abbas recited: 'In front of them (was) a king.' It is said on the authority of somebody other than Sa`id that the king was Hudad bin Budad. They say that the boy was called Haisur. 'A king who seized every ship by force. (18.79) So I wished that if that boat passed by him, he would leave it because of its defect and when they have passed they would repair it and get benefit from it. Some people said that they closed that hole with a bottle, and some said with tar. 'His parents were believers, and he (the boy) was a non-believer and we(Khadir) feared lest he would oppress them by obstinate rebellion and disbelief.' (18.80) (i.e. that their love for him would urge them to follow him in his religion, 'so we (Khadir) desired that their Lord should change him for them for one better in righteousness and near to mercy' (18:81). This was in reply to Moses' saying: Have you killed an innocent soul.'? (18.74). 'Near to mercy\" means they will be more merciful to him than they were to the former whom Khadir had killed. Other than Sa`id, said that they were compensated with a girl. Dawud bin Abi `Asim said on the authority of more than one that this next child was a girl.",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11568",
        "11081",
        "11050",
        "11168"
      ]
    },
    {
      "hadith_no": "4809",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني القاسم بن أبي بزة، أنه سأل سعيد بن جبير هل لمن قتل مؤمنا متعمدا من توبة فقرأت عليه ‏{‏ولا يقتلون النفس التي حرم الله إلا بالحق‏}‏‏.‏ فقال سعيد قرأتها على ابن عباس كما قرأتها على‏.‏ فقال هذه مكية نسختها آية مدنية، التي في سورة النساء‏.‏",
      "text_en": " Narrated Al-Qasim bin Abi Bazza:                     That he asked Sa`id bin Jubair, \"Is there any repentance of the one who has murdered a believer intentionally?\" Then I recited to him:-- \"Nor kill such life as Allah has forbidden except for a just cause.\" Sa`id said, \"I recited this very Verse before Ibn `Abbas as you have recited it before me. Ibn `Abbas said, 'This Verse was revealed in Mecca and it has been abrogated by a Verse in Surat-An-Nisa which was later revealed in Medina.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11261"
      ]
    },
    {
      "hadith_no": "4858",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال يعلى إن سعيد بن جبير أخبره عن ابن عباس  رضى الله عنهما  أن ناسا، من أهل الشرك كانوا قد قتلوا وأكثروا وزنوا وأكثروا، فأتوا محمدا صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو إليه لحسن لو تخبرنا أن لما عملنا كفارة‏.‏ فنزل ‏{‏والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون‏}‏ ونزل ‏{‏قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     Some pagans who committed murders in great number and committed illegal sexual intercourse excessively, came to Muhammad and said, \"O Muhammad! Whatever you say and invite people to, is good: but we wish if you could inform us whether we can make an expiration for our (past evil) deeds.\" So the Divine Verses came: 'Those who invoke not with Allah any other god, not kill such life as Allah has forbidden except for just cause, nor commit illegal sexual intercourse.' (25.68) And there was also revealed:-- 'Say: O My slaves who have transgressed against their souls! Despair not of the Mercy of Allah.' (39.53)",
      "chain": [
        "30309",
        "20467",
        "11070",
        "20372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4909",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف فقال في حلفه واللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك‏.‏ فليتصدق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whomever takes an oath in which he mentions Lat and `Uzza (forgetfully), should say: None has the right to be worshipped but Allah, and whoever says to his companion. 'Come along, let us gamble must give alms (as an expiation).",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "4925",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يوسف بن ماهك، قال إني عند عائشة أم المؤمنين قالت لقد أنزل على محمد صلى الله عليه وسلم بمكة، وإني لجارية ألعب ‏{‏بل الساعة موعدهم والساعة أدهى وأمر‏}‏",
      "text_en": " Narrated Yusuf bin Mahik:                     I was in the house of `Aisha, the mother of the Believers. She said, \"This revelation: \"Nay, but the Hour is their appointed time (for their full recompense); and the Hour will be more previous and most bitter.\" (54.46) was revealed to Muhammad at Mecca while I was a playfull little girl.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11264"
      ]
    },
    {
      "hadith_no": "4961",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن ابن جريج، عن عطاء، عن عبيد بن عمير، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يشرب عسلا عند زينب ابنة جحش ويمكث عندها فواطيت أنا وحفصة عن أيتنا دخل عليها فلتقل له أكلت مغافير إني أجد منك ريح مغافير‏.‏ قال ‏\"‏ لا ولكني كنت أشرب عسلا عند زينب ابنة جحش فلن أعود له وقد حلفت لا تخبري بذلك أحدا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to drink honey in the house of Zainab, the daughter of Jahsh, and would stay there with her. So Hafsa and I agreed secretly that, if he come to either of us, she would say to him. \"It seems you have eaten Maghafir (a kind of bad-smelling resin), for I smell in you the smell of Maghafir,\" (We did so) and he replied. \"No, but I was drinking honey in the house of Zainab, the daughter of Jahsh, and I shall never take it again. I have taken an oath as to that, and you should not tell anybody about it.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11029",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "5044",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال وأخبرني يوسف بن ماهك، قال إني عند عائشة أم المؤمنين  رضى الله عنها  إذ جاءها عراقي فقال أى الكفن خير قالت ويحك وما يضرك قال يا أم المؤمنين أريني مصحفك‏.‏ قالت لم قال لعلي أولف القرآن عليه فإنه يقرأ غير مؤلف‏.‏ قالت وما يضرك أيه قرأت قبل، إنما نزل أول ما نزل منه سورة من المفصل فيها ذكر الجنة والنار حتى إذا ثاب الناس إلى الإسلام نزل الحلال والحرام، ولو نزل أول شىء لا تشربوا الخمر‏.‏ لقالوا لا ندع الخمر أبدا‏.‏ ولو نزل‏.‏ لا تزنوا‏.‏ لقالوا لا ندع الزنا أبدا‏.‏ لقد نزل بمكة على محمد صلى الله عليه وسلم وإني لجارية ألعب ‏{‏بل الساعة موعدهم والساعة أدهى وأمر‏}‏ وما نزلت سورة البقرة والنساء إلا وأنا عنده‏.‏ قال فأخرجت له المصحف فأملت عليه آى السور‏.‏",
      "text_en": " Narrated Yusuf bin Mahk:                     While I was with Aisha, the mother of the Believers, a person from Iraq came and asked, \"What type of shroud is the best?\" `Aisha said, \"May Allah be merciful to you! What does it matter?\" He said, \"O mother of the Believers! Show me (the copy of) your Qur'an,\" She said, \"Why?\" He said, \"In order to compile and arrange the Qur'an according to it, for people recite it with its Suras not in proper order.\" `Aisha said, \"What does it matter which part of it you read first? (Be informed) that the first thing that was revealed thereof was a Sura from Al-Mufassal, and in it was mentioned Paradise and the Fire. When the people embraced Islam, the Verses regarding legal and illegal things were revealed. If the first thing to be revealed was: 'Do not drink alcoholic drinks.' people would have said, 'We will never leave alcoholic drinks,' and if there had been revealed, 'Do not commit illegal sexual intercourse, 'they would have said, 'We will never give up illegal sexual intercourse.' While I was a young girl of playing age, the following Verse was revealed in Mecca to Muhammad: 'Nay! But the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter.' (54.46) Sura Al-Baqara (The Cow) and Surat An-Nisa (The Women) were revealed while I was with him.\" Then `Aisha took out the copy of the Qur'an for the man and dictated to him the Verses of the Suras (in their proper order) .",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11264"
      ]
    },
    {
      "hadith_no": "5122",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني عطاء، قال حضرنا مع ابن عباس جنازة ميمونة بسرف، فقال ابن عباس هذه زوجة النبي صلى الله عليه وسلم فإذا رفعتم نعشها فلا تزعزعوها ولا تزلزلوها وارفقوا، فإنه كان عند النبي صلى الله عليه وسلم تسع، كان يقسم لثمان ولا يقسم لواحدة‏.‏",
      "text_en": " Narrated 'Ata:                     We presented ourselves along with Ibn `Abbas at the funeral procession of Maimuna at a place called Sarif. Ibn `Abbas said, \"This is the wife of the Prophet so when you lift her bier, do not Jerk it or shake it much, but walk smoothly because the Prophet had nine wives and he used to observe the night turns with eight of them, and for one of them there was no night turn.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11029"
      ]
    },
    {
      "hadith_no": "5455",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي أمامة بن سهل، عن ابن عباس، عن خالد بن الوليد، قال أتي النبي صلى الله عليه وسلم بضب مشوي، فأهوى إليه ليأكل فقيل له إنه ضب، فأمسك يده، فقال خالد أحرام هو قال ‏\"‏ لا، ولكنه لا يكون بأرض قومي، فأجدني أعافه ‏\"‏‏.‏ فأكل خالد ورسول الله صلى الله عليه وسلم ينظر‏.‏ قال مالك عن ابن شهاب بضب محنوذ‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     \"A roasted mastigure was brought to the Prophet who stretched his hand towards it to eat it. But it was said to him, \"It is a mastigure.\" So he withdrew his hand. Khalid asked, \"Is it unlawful to eat?\" the Prophet said, \"No, but it is not found in the land of my people and that is why I do not like eating it.\" So Khalid started eating (it) while Allah's Apostle was looking at him. An-Nadr said: 'Al-Khazira' (is prepared) from bran while 'Al-Harira' is prepared from milk.",
      "chain": [
        "30026",
        "20467",
        "20115",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "5821",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن يحيى بن عروة بن الزبير، عن عروة، عن عائشة  رضى الله عنها  قالت سأل رسول الله صلى الله عليه وسلم ناس عن الكهان‏.‏ فقال ‏\"‏ ليس بشىء ‏\"‏‏.‏ فقالوا يا رسول الله إنهم يحدثونا أحيانا بشىء فيكون حقا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الحق، يخطفها من الجني، فيقرها في أذن وليه، فيخلطون معها مائة كذبة ‏\"‏‏.‏ قال علي قال عبد الرزاق مرسل، الكلمة من الحق‏.‏ ثم بلغني أنه أسنده بعده‏.‏",
      "text_en": " Narrated `Aisha:                     Some people asked Allah's Apostle about the fore-tellers He said. ' They are nothing\" They said, 'O Allah's Apostle! Sometimes they tell us of a thing which turns out to be true.\" Allah's Apostle said, \"A Jinn snatches that true word and pours it Into the ear of his friend (the fore-teller) (as one puts something into a bottle) The foreteller then mixes with that word one hundred lies.\"",
      "chain": [
        "30026",
        "20467",
        "20115",
        "11013",
        "11545",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5829",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا عدوى، ولا صفر، ولا هامة ‏\"‏‏.‏ فقال أعرابي يا رسول الله فما بال الإبل تكون في الرمل كأنها الظباء، فيخالطها البعير الأجرب فيجربها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن أعدى الأول ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, 'No 'Adha (i.e. no contagious disease is conveyed to     others without Allah's permission); nor (any evil omen m the month of)     Safar; nor Hama\" A bedouin said, \"O Allah's Apostle! What about the      camels which, when on the sand (desert) look like deers, but when a      mangy camel mixes with them they all get infected with mange?\" On that     Allah s Apostle said, \"Then who conveyed the (mange) disease to the      first (mangy)     camel?\"",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6383",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة  رضى الله عنها كان النبي صلى الله عليه وسلم يصلي من الليل إحدى عشرة ركعة، فإذا طلع الفجر صلى ركعتين خفيفتين، ثم اضطجع على شقه الأيمن، حتى يجيء المؤذن فيؤذنه‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet used to pray eleven rak`at in the late part of the night, and when dawn appeared, he would offer two rak`at and then lie on his right side till the Muadhdhin came to inform him (that the morning prayer was due).",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6731",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف فقال في حلفه باللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك‏.‏ فليتصدق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever swears saying in his oath. 'By Al-Lat and Al-`Uzza,' should say, 'None has the right to be worshipped but Allah; and whoever says to his friend, 'Come, let me gamble with you,' should give something in charity.\"",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "6889",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت  رضى الله عنه  قال بايعت رسول الله صلى الله عليه وسلم في رهط، فقال ‏\"‏ أبايعكم على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فأخذ به في الدنيا فهو كفارة له وطهور، ومن ستره الله فذلك إلى الله، إن شاء عذبه وإن شاء غفر له ‏\"‏‏.‏ قال أبو عبد الله إذا تاب السارق بعد ما قطع يده، قبلت شهادته، وكل محدود كذلك إذا تاب قبلت شهادته‏.‏",
      "text_en": " Narrated Ubada bin As-Samit:                     I gave the pledge of allegiance to the Prophet with a group of people, and he said, \"I take your pledge that you will not worship anything besides Allah, will not steal, will not commit infanticide, will not slander others by forging false statements and spreading it, and will not disobey me in anything good. And whoever among you fulfill all these (obligations of the pledge), his reward is with Allah. And whoever commits any of the above crimes and receives his legal punishment in this world, that will be his expiation and purification. But if Allah screens his sin, it will be up to Allah, Who will either punish or forgive him according to His wish.\" Abu `Abdullah said: \"If a thief repents after his hand has been cut off, the his witness well be accepted. Similarly, if any person upon whom any legal punishment has been inflicted, repents, his witness will be accepted.\"",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "7062",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن جابر بن عبد الله، قال إنما جعل النبي صلى الله عليه وسلم الشفعة في كل ما لم يقسم، فإذا وقعت الحدود وصرفت الطرق فلا شفعة‏.‏ وقال بعض الناس الشفعة للجوار‏.‏ ثم عمد إلى ما شدده فأبطله، وقال إن اشترى دارا فخاف أن يأخذ الجار بالشفعة، فاشترى سهما من مائة سهم، ثم اشترى الباقي، وكان للجار الشفعة في السهم الأول، ولا شفعة له في باقي الدار، وله أن يحتال في ذلك‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet has decreed that preemption is valid in all cases where the real estate concerned has not been divided, but if the boundaries are established and the ways are made, then there is no preemption. A man said, \"Preemption is only for the neighbor,\" and then he makes invalid what he has confirmed. He said, \"If someone wants to buy a house and being afraid that the neighbor (of the house) may buy it through preemption, he buys one share out of one hundred shares of the house and then buys the rest of the house, then the neighbor can only have the right of preemption for the first share but not for the rest of the house; and the buyer may play such a trick in this case.\"",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "7116",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، قال كنت غلاما شابا عزبا في عهد النبي صلى الله عليه وسلم وكنت أبيت في المسجد، وكان من رأى مناما قصه على النبي صلى الله عليه وسلم فقلت اللهم إن كان لي عندك خير فأرني مناما يعبره لي رسول الله صلى الله عليه وسلم، فنمت فرأيت ملكين أتياني فانطلقا بي، فلقيهما ملك آخر فقال لي لن تراع، إنك رجل صالح، فانطلقا بي إلى النار، فإذا هي مطوية كطى البئر، وإذا فيها ناس قد عرفت بعضهم، فأخذا بي ذات اليمين، فلما أصبحت ذكرت ذلك لحفصة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I was a young unmarried man during the lifetime of the Prophet. I used to sleep in the mosque. Anyone who had a dream, would narrate it to the Prophet. I said, \"O Allah! If there is any good for me with You, then show me a dream so that Allah's Apostle may interpret it for me.\" So I slept and saw (in a dream) two angels came to me and took me along with them, and they met another angel who said to me, \"Don't be afraid, you are a good man.\" They took me towards the Fire, and behold, it was built inside like a well, and therein I saw people some of whom I recognized, and then the angels took me to the right side. In the morning, I mentioned that dream to Hafsa. Hafsa told me that she had mentioned it to the Prophet and he said, \"`Abdullah is a righteous man if he only prays more at night.\" (Az-Zuhri said, \"After that, `Abdullah used to pray more at night.\")",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7181",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، عن معمر، عن الزهري، عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم أنه قام إلى جنب المنبر فقال ‏\"‏ الفتنة ها هنا الفتنة ها هنا من حيث يطلع قرن الشيطان ‏\"‏‏.‏ أو قال ‏\"‏ قرن الشمس ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet stood up beside the pulpit (and pointed with his finger towards the East) and said, \"Afflictions are there! Afflictions are there, from where the side of the head of Satan comes out,\" or said, \"..the side of the sun..\"",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7321",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي عبيد  اسمه سعد بن عبيد مولى عبد الرحمن بن أزهر  عن أبي هريرة  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يتمنى أحدكم الموت إما محسنا فلعله يزداد، وإما مسيئا فلعله يستعتب ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Ubaid:                     (the Maula of `Abdur-Rahman bin Azhar) Allah's Apostle said, \"None of you should long for death, for if he is a good man, he may increase his good deeds, and if he is an evil-doer, he may stop the evil deeds and repent.\"",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "1985",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو يعقوب البغدادي، ثقة حدثنا هشام بن يوسف، عن ابن جريج، عن عبد الحميد بن جبير بن شيبة، عن صفية بنت شيبة، قالت أخبرتني أم عثمان بنت أبي سفيان، أن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس على النساء الحلق إنما على النساء التقصير ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Shaving is not a duty laid on women; only clipping the hair is incumbent on them.",
      "chain": [
        "20467",
        "11070",
        "11255",
        "2802",
        "17"
      ]
    },
    {
      "hadith_no": "2007",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن معين، حدثنا هشام بن يوسف، عن ابن جريج، أخبرني عبيد الله بن أبي يزيد، أن عبد الرحمن بن طارق، أخبره عن أمه، أن رسول الله صلى الله عليه وسلم كان إذا جاز مكانا من دار يعلى - نسيه عبيد الله - استقبل البيت فدعا ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Tariq:                     AbdurRahman reported on the authority of his mother: When the Messenger of Allah (ﷺ) passed any place from the house of Ya'la,--the narrator Ubaydullah forgot its name--he faced the House (the Ka'bah) and supplicated.",
      "chain": [
        "30020",
        "20467",
        "11070",
        "11258"
      ]
    },
    {
      "hadith_no": "2229",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عبد الرحيم البزاز، حدثنا علي بن بحر القطان، حدثنا هشام بن يوسف، عن معمر، عن عمرو بن مسلم، عن عكرمة، عن ابن عباس، أن امرأة، ثابت بن قيس اختلعت منه فجعل النبي صلى الله عليه وسلم عدتها حيضة ‏.‏ قال أبو داود وهذا الحديث رواه عبد الرزاق عن معمر عن عمرو بن مسلم عن عكرمة عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The wife of Thabit ibn Qays separated herself from him for a compensation. The Prophet (ﷺ) made her waiting period a menstrual course.Abu Dawud said: This tradition has been transmitted by 'Abd al-Razzaq from Ma'mar from 'Amr b. Muslim from 'Ikrimah from the Prophet (ﷺ) in a mursal form (i.e. missing the link of the Companion).",
      "chain": [
        "30272",
        "36596",
        "20467",
        "20115",
        "10953",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2492",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن معين، حدثنا هشام بن يوسف، عن معمر، عن زيد بن أسلم، عن عطاء بن يسار، عن أخت أم سليم الرميصاء، قالت نام النبي صلى الله عليه وسلم فاستيقظ وكانت تغسل رأسها فاستيقظ وهو يضحك فقالت يا رسول الله أتضحك من رأسي قال ‏\"‏ لا ‏\"‏ ‏.‏ وساق هذا الخبر يزيد وينقص ‏.‏",
      "text_en": " Umm Sulaim Al Rumaisa said “The Prophet(ﷺ) slept and awoke while she was washing her head.” He awoke laughing. She asked “Apostle of Allaah(ﷺ) are you laughing at my head?” He replied, No. She then narrated the rest of the tradition enlarging and reducing.Abu Dawud said:                      Al-Rumaisa was the foster sister of Umm Sulaim.",
      "chain": [
        "30020",
        "20467",
        "20115",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "4467",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا موسى بن هارون البردي، حدثنا هشام بن يوسف، عن القاسم بن فياض الأبناوي، عن خلاد بن عبد الرحمن، عن ابن المسيب، عن ابن عباس، أن رجلا، من بكر بن ليث أتى النبي صلى الله عليه وسلم فأقر أنه زنى بامرأة أربع مرات فجلده مائة وكان بكرا ثم سأله البينة على المرأة فقالت كذب والله يا رسول الله فجلده حد الفرية ثمانين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man of Bakr ibn Layth came to the Prophet (ﷺ) and made confession four times that he had committed fornication with a woman, so he had a hundred lashes administered to him. The man had not been married. He then asked him to produce proof against the woman, and she said: I swear by Allah, Messenger of Allah, that he has lied. Then he was given the punishment of eighty lashes of falsehood.",
      "chain": [
        "11222",
        "30218",
        "20467",
        "28487",
        "11002",
        "17"
      ]
    },
    {
      "hadith_no": "1223",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "أنبأنا محمد بن عبد الرحيم البغدادي، أنبأنا علي بن بحر، أنبأنا هشام بن يوسف، عن معمر، عن عمرو بن مسلم، عن عكرمة، عن ابن عباس، أن امرأة، ثابت بن قيس اختلعت من زوجها على عهد النبي صلى الله عليه وسلم فأمرها النبي صلى الله عليه وسلم أن تعتد بحيضة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ واختلف أهل العلم في عدة المختلعة فقال أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إن عدة المختلعة عدة المطلقة ثلاث حيض ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يقول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إن عدة المختلعة حيضة ‏.‏ قال إسحاق وإن ذهب ذاهب إلى هذا فهو مذهب قوي ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     The wife of Thabit bin Qais was granted a Khul from her husband during the time of the Prophet. So the Prophet ordered her to observe an Iddah of a menstruation.",
      "chain": [
        "36596",
        "20467",
        "20115",
        "10953",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد، حدثنا يحيى بن معين، حدثنا هشام بن يوسف، حدثني عبد الله بن بحير، أنه سمع هانئا، مولى عثمان قال كان عثمان إذا وقف على قبر بكى حتى يبل لحيته فقيل له تذكر الجنة والنار فلا تبكي وتبكي من هذا فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن القبر أول منازل الآخرة فإن نجا منه فما بعده أيسر منه وإن لم ينج منه فما بعده أشد منه ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ ما رأيت منظرا قط إلا والقبر أفظع منه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث هشام بن يوسف ‏.‏",
      "text_en": " Hani' the freed slave of 'Uthman said:                     When 'Uthman would stop at a grave he would cry until his beard was soaked (in tears). It was said to him: 'The Paradise and the Fire were mentioned and you did not cry, yet you cry because of this?' So he said: 'Indeed the Messenger of Allah said: \"Indeed the grave isAllah the first stage among the stages of the Hereafter. So if one is saved from it, then what comes after it is easier than it. And if one is not saved from it, then what comes after it is worse than it.\" And the Messenger of Allah said: \"I have not seen any sight except that the grave is more horrible than it.\"",
      "chain": [
        "30480",
        "30020",
        "20467",
        "28278"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو داود، سليمان بن الأشعث قال أخبرنا يحيى بن معين، قال حدثنا هشام بن يوسف، عن عبد الله بن سليمان النوفلي، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحبوا الله لما يغذوكم من نعمه وأحبوني بحب الله وأحبوا أهل بيتي لحبي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"Love Allah for what He nourishes you with of His Blessings, love me due to the love of Allah, and love the people of my house due to love of me.\"",
      "chain": [
        "30020",
        "20467",
        "28290",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "5405",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبد الأعلى بن حماد، قال حدثنا بشر بن السري، قال حدثنا عبد الله بن المبارك، عن معمر، ح وأنبأنا أحمد بن علي بن سعيد، قال حدثنا يحيى بن معين، قال حدثنا هشام بن يوسف، وعبد الرزاق، عن معمر، عن الزهري، عن سالم، عن أبيه، قال بعث النبي صلى الله عليه وسلم خالد بن الوليد إلى بني جذيمة فدعاهم إلى الإسلام فلم يحسنوا أن يقولوا أسلمنا فجعلوا يقولون صبأنا وجعل خالد قتلا وأسرا - قال - فدفع إلى كل رجل أسيره حتى إذا أصبح يومنا أمر خالد بن الوليد أن يقتل كل رجل منا أسيره ‏.‏ قال ابن عمر فقلت والله لا أقتل أسيري ولا يقتل أحد - وقال بشر - من أصحابي أسيره - قال - فقدمنا على النبي صلى الله عليه وسلم فذكر له صنع خالد فقال النبي صلى الله عليه وسلم ورفع يديه ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ قال زكريا في حديثه فذكر وفي حديث بشر فقال ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"The Prophet [SAW] sent Khalid bin Al-Walid to Banu Jadhimah. He called them to Islam, but they could not say Aslamna (we submitted, i.e., became Muslim) so they started to say Saba'na (we changed our religion). Khalid started killing and taking prisoners, and he gave a prisoner to each man. The next day Khalid bin Al-Walid issued orders that each man among us kill his prisoner.\" Ibn 'Umar said: \"I said: 'By Allah, I will not kill my prisoner, and no one (among my companions) will kill his prisoner.' We came to the Prophet [SAW], and he was told of what Khalid had done. The Prophet [SAW] said: 'I disavow what Khalid has done,' twice.\"",
      "chain": [
        "30146",
        "20190",
        "20025",
        "20115",
        "28001",
        "30020",
        "20467",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 43
}