{
  "id": "20463",
  "name": "Mskyn bin Bkyr al-Hrany مسكين بن بكير الحراني أبو عبد الرحمن",
  "full_name": "Mskyn bin Bkyr al-Hrany مسكين بن بكير الحراني أبو عبد الرحمن",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "198",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hiran"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  م  س  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Hirani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20646",
      "name": "Ja'far bin Brqan جعفر بن برقان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20637",
      "name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11676",
      "name": "Thabit bin Ajlan al-Ansari ثابت بن عجلان الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20428",
      "name": "Shu'aib bin Abi Hamza شعيب بن أبي حمزة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10636",
      "name": "Zm'h bin Salah زمعة بن صالح",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30352",
      "name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38644",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30237",
      "name": "'Amr bin Khalid al-Hirani عمرو بن خالد بن فروخ بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30301",
      "name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن أبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30501",
      "name": "al-Hasan bin Ahmed bin Aby الحسن بن أحمد بن أبي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30108",
      "name": "Muhammad bin 'Ubaid bin Maymun al-Taban محمد بن عبيد بن ميمون التبان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38022",
      "name": "Ahmed bin Suliaman أحمد بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4587",
      "hadith_no": "4587",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد، حدثنا النفيلي، حدثنا مسكين، عن شعبة، عن خالد الحذاء، عن مروان الأصفر، عن رجل، من أصحاب النبي صلى الله عليه وسلم وهو ابن عمر أنها قد نسخت ‏{‏وإن تبدوا ما في أنفسكم أو تخفوه‏}‏ الآية‏.‏",
      "text_en": " Narrated Ibn `Umar:                     This Verse:--\"Whether you show what is in your minds or conceal it..\" (2.284) was abrogated.",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30352",
        "20463",
        "20020",
        "11282",
        "11611"
      ]
    },
    {
      "id": "sahih-muslim-309-2",
      "hadith_no": "309",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا الحسن بن أحمد بن أبي شعيب الحراني، حدثنا مسكين، - يعني ابن بكير الحذاء - عن شعبة، عن هشام بن زيد، عن أنس، أن النبي صلى الله عليه وسلم كان يطوف على نسائه بغسل واحد ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) used to have sexual intercourse with his wives with a single bath.",
      "usc_msa_ref": "",
      "chain": [
        "20463",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4449",
      "hadith_no": "4449",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا الحسن بن أبي شعيب الحراني، حدثنا مسكين، - وهو ابن بكير الحراني - أخبرنا الأوزاعي، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي قلابة، عن أنس بن مالك، قال قدم على رسول الله صلى الله عليه وسلم ثمانية نفر من عكل ‏.‏ بنحو حديثهم ‏.‏ وزاد في الحديث ولم يحسمهم ‏.‏",
      "text_en": " Anas b. Malik reported:                      There came to Allah's Messenger (may peace be upon him) eight persons from the tribe of 'Ukl, but with this addition that he did not cauterise (the wounds which hid been inflicted upon them while punishing them).",
      "usc_msa_ref": "",
      "chain": [
        "20463",
        "20024",
        "30025",
        "30388",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-457",
      "hadith_no": "457",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، عن سعيد بن عبد العزيز، عن زياد بن أبي سودة، عن ميمونة، مولاة النبي صلى الله عليه وسلم أنها قالت يا رسول الله أفتنا في بيت المقدس فقال ‏\"‏ ائتوه فصلوا فيه ‏\"‏ ‏.‏ - وكانت البلاد إذ ذاك حربا - فإن لم تأتوه وتصلوا فيه فابعثوا بزيت يسرج في قناديله ‏\"‏ ‏.‏",
      "text_en": " Narrated Maymunah ibn Sa'd:                     I said: Messenger of Allah, tell us the legal injunction about (visiting) Bayt al-Muqaddas (the dome of the Rock at Jerusalem). The Messenger of Allah (ﷺ) said: go and pray there. All the cities at that time were effected by war. If you cannot visit it and pray there, then send some oil to be used in the lamps.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20638",
        "18312"
      ]
    },
    {
      "id": "sunan-abi-daud-1629",
      "hadith_no": "1629",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا مسكين، حدثنا محمد بن المهاجر، عن ربيعة بن يزيد، عن أبي كبشة السلولي، حدثنا سهل ابن الحنظلية، قال قدم على رسول الله عيينة بن حصن والأقرع بن حابس فسألاه فأمر لهما بما سألا وأمر معاوية فكتب لهما بما سألا فأما الأقرع فأخذ كتابه فلفه في عمامته وانطلق وأما عيينة فأخذ كتابه وأتى النبي صلى الله عليه وسلم مكانه فقال يا محمد أتراني حاملا إلى قومي كتابا لا أدري ما فيه كصحيفة المتلمس ‏.‏ فأخبر معاوية بقوله رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وعنده ما يغنيه فإنما يستكثر من النار ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ من جمر جهنم ‏\"‏ ‏.‏ فقالوا يا رسول الله وما يغنيه وقال النفيلي في موضع آخر وما الغنى الذي لا تنبغي معه المسألة قال ‏\"‏ قدر ما يغديه ويعشيه ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ أن يكون له شبع يوم وليلة أو ليلة ويوم ‏\"‏ ‏.‏ وكان حدثنا به مختصرا على هذه الألفاظ التي ذكرت ‏.‏",
      "text_en": " Narrated Sahl ibn Hanzaliyyah:                     Uyaynah ibn Hisn and Aqra' ibn Habis came to the Messenger of Allah (ﷺ). They begged from him. He commanded to give them what they begged. He ordered Mu'awiyah to write a document to give what they begged. Aqra' took his document, wrapped it in his turban, and went away.  As for Uyaynah, he took his document and came to the Prophet (ﷺ) at his home, and said to him: Muhammad, do you see me? I am taking a document to my people, but I do not know what it contains, just like the document of al-Mutalammis. Mu'awiyah informed the Messenger of Allah (ﷺ) of his statement.  Thereupon the Messenger of Allah (ﷺ) said: He who begs (from people) when he has sufficient is simply asking for a large amount of Hell-fire. (An-Nufayl (a transmitter) said elsewhere: \"embers of Hell\".)  They asked: Messenger of Allah, what is a sufficiency? (Elsewhere an-Nufayl said: What is a sufficiency which makes begging unfitting?)  He replied: It is that which would provide a morning and an evening meal. (Elsewhere an-Nufayl said: It is when one has enough for a day and night, or for a night and a day.) He (an-Nufayl) narrated to us this tradition briefly in the words that I have mentioned.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "11414",
        "11669",
        "1824"
      ]
    },
    {
      "id": "sunan-abi-daud-1800",
      "hadith_no": "1800",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، عن الأوزاعي، عن يحيى بن أبي كثير، عن عكرمة، قال سمعت ابن عباس، يقول حدثني عمر بن الخطاب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أتاني الليلة آت من عند ربي عز وجل ‏\"‏ ‏.‏ قال وهو بالعقيق ‏\"‏ وقال صل في هذا الوادي المبارك وقال عمرة في حجة ‏\"‏ ‏.‏ قال أبو داود رواه الوليد بن مسلم وعمر بن عبد الواحد في هذا الحديث عن الأوزاعي ‏\"‏ وقل عمرة في حجة ‏\"‏ ‏.‏ قال أبو داود وكذا رواه علي بن المبارك عن يحيى بن أبي كثير في هذا الحديث وقال ‏\"‏ وقل عمرة في حجة ‏\"‏ ‏.‏",
      "text_en": " Umar bin Al Khattab heard the Apostle of Allaah(ﷺ) say Someone came to me at night from Allaah the Exalted. The narrator said When he was staying at ‘Aqiq said Pray in his blessed valley. Then he said ‘Umrah has been included in Hajj.Abu Dawud said Al Walid bin Musilm and ‘Umar bin Abd Al Wahid narrated in this version from Al Auza’I the words “And say An ‘Umrah included in Hajj”.Abu Dawud said Ali bin Al Mubarak has also narrated similarly from Yahya bin said Abi Kathir in this version “And say An ‘Umrah included in Hajj”.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20024",
        "11449",
        "11023",
        "17",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-2156",
      "hadith_no": "2156",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، حدثنا شعبة، عن يزيد بن خمير، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم كان في غزوة فرأى امرأة مجحا فقال ‏\"‏ لعل صاحبها ألم بها ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فقال ‏\"‏ لقد هممت أن ألعنه لعنة تدخل معه في قبره كيف يورثه وهو لا يحل له وكيف يستخدمه وهو لا يحل له ‏\"‏ ‏.‏",
      "text_en": " Abu Al Darda said “The Apostle of Allaah(ﷺ) was in a battle. He saw a woman who was nearing the time when she was to deliver a child. “He said “Perhaps the master has intercourse with her.”. They(the people) said “Yes”. He said “I am inclined to invoke a curse on him which will enter his grave with him. How can he make it (the child) an heir when it is not lawful for him? How can he take it into his service when that is not lawful for him?”",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20020",
        "10981",
        "10942",
        "37"
      ]
    },
    {
      "id": "sunan-abi-daud-2548",
      "hadith_no": "2548",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا مسكين، - يعني ابن بكير - حدثنا محمد بن مهاجر، عن ربيعة بن يزيد، عن أبي كبشة السلولي، عن سهل ابن الحنظلية، قال ‏:‏ مر رسول الله صلى الله عليه وسلم ببعير قد لحق ظهره ببطنه، فقال ‏:‏ ‏\"‏ اتقوا الله في هذه البهائم المعجمة فاركبوها وكلوها صالحة ‏\"‏ ‏.‏",
      "text_en": " Narrated Sahl ibn al-Hanzaliyyah:                     The Messenger of Allah (ﷺ) came upon an emaciated camel and said: Fear Allah regarding these dumb animals. Ride them when they are in good condition and feed them when they are in good condition.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20637",
        "11414",
        "11669",
        "1824"
      ]
    },
    {
      "id": "sunan-abi-daud-4062",
      "hadith_no": "4062",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، عن الأوزاعي، ح وحدثنا عثمان بن أبي شيبة، عن وكيع، عن الأوزاعي، نحوه عن حسان بن عطية، عن محمد بن المنكدر، عن جابر بن عبد الله، قال أتانا رسول الله صلى الله عليه وسلم فرأى رجلا شعثا قد تفرق شعره فقال ‏\"‏ أما كان يجد هذا ما يسكن به شعره ‏\"‏ ‏.‏ ورأى رجلا آخر وعليه ثياب وسخة فقال ‏\"‏ أما كان هذا يجد ماء يغسل به ثوبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) paid visit to us, and saw a dishevelled man whose hair was disordered. He said: Could this man not find something to make his hair lie down? He saw another man wearing dirty clothes and said: Could this man not find something to wash his garments with.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20024",
        "30203",
        "20032",
        "20024",
        "11413",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2602",
      "hadith_no": "2602",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا مسكين بن بكير، قال حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، عن حكيم بن حزام، قال سألت رسول الله صلى الله عليه وسلم فأعطاني ثم سألته فأعطاني ثم سألته فأعطاني ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ يا حكيم إن هذا المال خضرة حلوة من أخذه بسخاوة نفس بورك له فيه ومن أخذه بإشراف النفس لم يبارك له فيه وكان كالذي يأكل ولا يشبع واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     \"I asked the Messenger of Allah and he gave me, then I asked him and he gave me, then I asked him and he gave me. Then he said: 'O Kahim! This wealth is attractive and sweet. Whoever takes it without being greedy, it will be blessed for him, and whoever takes it with avarice, it will not be blessed for him. He is like one who eats and is not satisfied. And the upper hand is better than the lower hand.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20463",
        "20024",
        "11013",
        "11002",
        "423"
      ]
    },
    {
      "id": "sunan-an-nasai-5097",
      "hadith_no": "5097",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن وهب، قال حدثنا مسكين بن بكير، قال حدثنا شعبة، عن عمرو بن مرة، عن الحسن بن مسلم، عن صفية بنت شيبة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لعن الله الواصلة والمستوصلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safiyyah bint Shaibah, that 'Aishah said:                     \"The Messenger of Allah [SAW] said: 'May Allah curse the woman who affixes hair extensions and the woman who has that done.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20463",
        "20020",
        "11381",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5404",
      "hadith_no": "5404",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا المغيرة بن عبد الرحمن، قال حدثنا مسكين بن بكير، قال حدثنا شعيب بن أبي حمزة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ خرجت امرأتان معهما ولداهما فأخذ الذئب أحدهما فاختصمتا في الولد إلى داود النبي صلى الله عليه وسلم فقضى به للكبرى منهما فمرتا على سليمان عليه السلام فقال كيف قضى بينكما قالت قضى به للكبرى ‏.‏ قال سليمان أقطعه بنصفين لهذه نصف ولهذه نصف ‏.‏ قالت الكبرى نعم اقطعوه ‏.‏ فقالت الصغرى لا تقطعه هو ولدها ‏.‏ فقضى به للتي أبت أن يقطعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Prophet [SAW] said: \"Two women went out with their two children, and the wolf took one of the children from them. They referred their dispute to Prophet Dawud, peace be upon him, and he ruled that (the remaining child) belonged to the older woman. Then they passed by Sulaiman, peace be upon him, and he said: 'How did he judge between you?' She said: 'He ruled that (the child) belongs to the older woman.' Sulaiman said: 'Cut him in half, and give half to one and half to the other.' The older woman said: 'Yes, cut him in half.' The younger woman said: 'Do not cut him, he is her child.' So he ruled that the child belonged to the woman who refused to let him be cut.\"",
      "usc_msa_ref": "",
      "chain": [
        "20182",
        "20463",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    }
  ],
  "total_hadiths": 12
}