{
  "id": "20465",
  "name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
  "full_name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "177",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hiran",
      "Jazira"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "Ally B.'Amir",
      "al-Hirani",
      "la-Jazri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10767",
      "name": "Sa'id bin Sinan al-Barjami سعيد بن سنان البرجمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18655",
      "name": "'Abdul al-Kareem bin Malik عبد الكريم بن مالك الجزري أبو سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20409",
      "name": "Ishaq bin Rashid al-Juzri إسحاق بن راشد الجزري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20379",
      "name": "Yahya bin Ayoub al-Ghafiqi يحيى بن أيوب الغافقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20375",
      "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38640",
      "name": "al-Ma'afa bin Sulaiman al-Jzry المعافى بن سليمان الجزري أبو محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36046",
      "name": "'Ali bin Ma'bd bin Shdad علي بن معبد بن شداد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38430",
      "name": "'Amr bin 'Uthman bin Syar عمرو بن عثمان بن سيار الكلابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30301",
      "name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن أبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38228",
      "name": "Sa'id bin Hafs bin سعيد بن حفص بن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30352",
      "name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4723",
      "hadith_no": "4723",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد، حدثنا أحمد بن أبي شعيب، حدثنا موسى بن أعين، حدثنا إسحاق بن راشد، أن الزهري، حدثه قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك،، وهو أحد الثلاثة الذين تيب عليهم أنه لم يتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط غير غزوتين غزوة العسرة وغزوة بدر‏.‏ قال فأجمعت صدق رسول الله صلى الله عليه وسلم ضحى، وكان قلما يقدم من سفر سافره إلا ضحى وكان يبدأ بالمسجد، فيركع ركعتين، ونهى النبي صلى الله عليه وسلم عن كلامي وكلام صاحبى، ولم ينه عن كلام أحد من المتخلفين غيرنا، فاجتنب الناس كلامنا، فلبثت كذلك حتى طال على الأمر، وما من شىء أهم إلى من أن أموت فلا يصلي على النبي صلى الله عليه وسلم أو يموت رسول الله صلى الله عليه وسلم فأكون من الناس بتلك المنزلة، فلا يكلمني أحد منهم، ولا يصلي على، فأنزل الله توبتنا على نبيه صلى الله عليه وسلم حين بقي الثلث الآخر من الليل، ورسول الله صلى الله عليه وسلم عند أم سلمة، وكانت أم سلمة محسنة في شأني معنية في أمري، فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أم سلمة تيب على كعب ‏\"‏‏.‏ قالت أفلا أرسل إليه فأبشره قال ‏\"‏ إذا يحطمكم الناس فيمنعونكم النوم سائر الليلة ‏\"‏‏.‏ حتى إذا صلى رسول الله صلى الله عليه وسلم صلاة الفجر آذن بتوبة الله علينا، وكان إذا استبشر استنار وجهه حتى كأنه قطعة من القمر، وكنا أيها الثلاثة الذين خلفوا عن الأمر الذي قبل من هؤلاء الذين اعتذروا حين أنزل الله لنا التوبة، فلما ذكر الذين كذبوا رسول الله صلى الله عليه وسلم من المتخلفين، واعتذروا بالباطل، ذكروا بشر ما ذكر به أحد قال الله سبحانه ‏{‏يعتذرون إليكم إذا رجعتم إليهم قل لا تعتذروا لن نؤمن لكم قد نبأنا الله من أخباركم وسيرى الله عملكم ورسوله‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik who was one of the three who were forgiven, saying that he had never remained behind Allah's Apostle in any Ghazwa which he had fought except two Ghazwat Ghazwat- Al-`Usra (Tabuk) and Ghazwat-Badr. He added. \"I decided to tell the truth to Allah's Apostle in the forenoon, and scarcely did he return from a journey he made, except in the forenoon, he would go first to the mosque and offer a two-rak`at prayer. The Prophet forbade others to speak to me or to my two companions, but he did not prohibit speaking to any of those who had remained behind excepting us. So the people avoided speaking to us, and I stayed in that state till I could no longer bear it, and the only thing that worried me was that I might die and the Prophet would not offer the funeral prayer for me, or Allah's Apostle might die and I would be left in that social status among the people that nobody would speak to me or offer the funeral prayer for me. But Allah revealed His Forgiveness for us to the Prophet in the last third of the night while Allah's Apostle was with Um Salama. Um Salama sympathized with me and helped me in my disaster. Allah's Apostle said, 'O Um Salama! Ka`b has been forgiven!' She said, 'Shall I send someone to him to give him the good tidings?' He said, 'If you did so, the people would not let you sleep the rest of the night.' So when the Prophet had offered the Fajr prayer, he announced Allah's Forgiveness for us. His face used to look as bright as a piece of the (full) moon whenever he was pleased. When Allah revealed His Forgiveness for us, we were the three whose case had been deferred while the excuse presented by those who had apologized had been accepted. But when there were mentioned those who had told the Prophet lies and remained behind (the battle of Tabuk) and had given false excuses, they were described with the worse description one may be described with. Allah said: 'They will present their excuses to you (Muslims) when you return to them. Say: Present no excuses; we shall not believe you. Allah has already informed us of the true state of matters concerning you. Allah and His Apostle will observe your actions.\" (9.94)",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30301",
        "20465",
        "20409",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "id": "sahih-muslim-7376",
      "hadith_no": "7376",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، ح وحدثنا ابن نمير، حدثنا أبي ومحمد بن بشر، ح وحدثنا يحيى بن يحيى، أخبرنا موسى بن أعين، ح وحدثني  محمد بن رافع، حدثنا أبو أسامة، كلهم عن إسماعيل بن أبي خالد، ح وحدثني محمد بن، حاتم - واللفظ له - حدثنا يحيى بن سعيد، حدثنا إسماعيل، حدثنا قيس، قال سمعت  مستوردا، أخا بني فهر يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ والله ما الدنيا في الآخرة إلا مثل ما يجعل أحدكم إصبعه هذه - وأشار يحيى بالسبابة - في اليم فلينظر بم يرجع ‏\"‏ ‏.‏ وفي حديثهم جميعا غير يحيى سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏.‏ وفي حديث أبي أسامة عن المستورد بن شداد أخي بني فهر وفي حديثه أيضا قال وأشار إسماعيل بالإبهام ‏.‏",
      "text_en": " This hadith has been narrated through five different chains of transmitters and all of them are narrated on the authority of Mustaurid, brother of Bani Fihr, that Allah's Messenger (may peace be upon him) said:                      By Allah, this world (is so insigni- ficant in comparison) to the Hereafter that if one of you should dip his finger- (and wnile saying this Yahyg pointed with his forefinger) -in the ocean and then he should see as to what has stuck to it. This hadith has been narrated through another chain of transmitters also but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "30212",
        "30399",
        "20465",
        "30375",
        "11418",
        "38487",
        "20031"
      ]
    },
    {
      "id": "sunan-abi-daud-1600",
      "hadith_no": "1600",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا موسى بن أعين، عن عمرو بن الحارث المصري، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال - أحد بني متعان - إلى رسول الله صلى الله عليه وسلم بعشور نحل له وكان سأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب - رضى الله عنه - كتب سفيان بن وهب إلى عمر بن الخطاب يسأله عن ذلك فكتب عمر رضى الله عنه إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشور نحله له فاحم له سلبة وإلا فإنما هو ذباب غيث يأكله من يشاء ‏.‏",
      "text_en": " 'Amr bin Shu'aib, on his father's authority, said that his grandfather reported:                      Hilal, a man from the tribe of Banu Mat'an brought a tenth of honey which he possessed in beehives to the Messenger of Allah (ﷺ). He asked him (the apostle of Allah) to give the wood known as Salabah as a protected (or restricted) land. The Messenger of Allah (ﷺ) gave him that wood as a protected land. When Umar ibn al-Khattab succeeded, Sufyan ibn Wahb wrote to Umar asking him about this wood. Umar ibn al-Khattab wrote to him: If he (Hilal) pays you the tithe on honey what he used to pay to the Messenger of Allah (ﷺ), leave the protected land of Salabah in his possession; otherwise those bees are like those of any wood; anyone can take the honey as he likes.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20465",
        "20377",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-560",
      "hadith_no": "560",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني يزيد بن محمد بن عبد الصمد، قال حدثنا هشام العطار، قال حدثنا إسماعيل، - وهو ابن سماعة - عن موسى بن أعين، عن أبي عمرو الأوزاعي، عن الزهري، عن أبي سلمة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصلاة ركعة فقد أدرك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"Whoever catches up with a Rak'ah of the prayer, then he has caught up with the prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "37544",
        "20465",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1812",
      "hadith_no": "1812",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرني يزيد بن محمد بن عبد الصمد، قال حدثنا هشام العطار، قال حدثني إسماعيل بن عبد الله بن سماعة، عن موسى بن أعين، عن أبي عمرو الأوزاعي، عن حسان بن عطية، قال لما نزل بعنبسة جعل يتضور فقيل له فقال أما إني سمعت أم حبيبة زوج النبي صلى الله عليه وسلم تحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من ركع أربع ركعات قبل الظهر وأربعا بعدها حرم الله عز وجل لحمه على النار ‏\"‏ ‏.‏ فما تركتهن منذ سمعتهن ‏.‏",
      "text_en": " It was narrated that Hassan bin 'Atiyyah said:                     \"When 'Anbasah was dying, he started to groan in pain. The people spoke to him and he said: 'I heard Umm Habibah, the wife of the Prophet (ﷺ) narrating that the Prophet (ﷺ) said: Whoever prays four rak'ahs before Zuhr and four after, Allah, the Mighty and Sublime, will forbid his flesh for the Fire. And I never stopped praying them from the time I heard that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37544",
        "20465",
        "11413"
      ]
    },
    {
      "id": "sunan-an-nasai-2499",
      "hadith_no": "2499",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا أحمد بن أبي شعيب، عن موسى بن أعين، عن عمرو بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال إلى رسول الله صلى الله عليه وسلم بعشور نحل له وسأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب كتب سفيان بن وهب إلى عمر بن الخطاب يسأله فكتب عمر إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشر نحله فاحم له سلبة ذلك وإلا فإنما هو ذباب غيث يأكله من شاء ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father that his grandfather said:                     \"Hilal came to the Messenger of Allah with one-tenth of the honey and asked him to protect a valley for him that was called Salabah. 'The Messenger of Allah protected that valley for him. When 'Umar bin Al-Khattab became the Khalifah, sufyan bin Wahb wrote the 'Umar and asked him (about that), and Umar wrote: 'If the gives me what he used to give to the Messenger of Allah, one-tenth of his honey, I will protect Salahab for him, otherwise they are just bees and anyone who wants to may eat of it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20182",
        "30301",
        "20465",
        "20377",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-3082",
      "hadith_no": "3082",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم عن علي بن معبد، قال حدثنا موسى بن أعين، عن عبد الكريم الجزري، عن سعيد بن جبير، عن ابن عباس، عن الفضل بن العباس، أنه كان رديف النبي صلى الله عليه وسلم فلم يزل يلبي حتى رمى جمرة العقبة ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin 'Abbas that:                     he was riding behind the Prophet and he continued recite the Talbiyah until he stoned Jamratul Aqabah.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "36046",
        "20465",
        "18655",
        "11050",
        "17",
        "135"
      ]
    },
    {
      "id": "sunan-an-nasai-4268",
      "hadith_no": "4268",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرني عمرو بن يحيى بن الحارث، قال حدثنا أحمد بن أبي شعيب، قال حدثنا موسى بن أعين، عن معمر، عن عاصم بن سليمان، عن عامر الشعبي، عن عدي بن حاتم، أنه سأل رسول الله صلى الله عليه وسلم عن الصيد فقال ‏\"‏ إذا أرسلت كلبك فخالطته أكلب لم تسم عليها فلا تأكل فإنك لا تدري أيها قتله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:                     \"If you release your dog and other dogs over with you have not mentioned the name of Allah join him, then do not eat (what they catch), because you do not know which of them killed it (the game),\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "30301",
        "20465",
        "20115",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4275",
      "hadith_no": "4275",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا أحمد بن أبي شعيب، قال حدثنا موسى بن أعين، عن معمر، عن عاصم بن سليمان، عن الشعبي، عن عدي بن حاتم الطائي، أنه سأل رسول الله صلى الله عليه وسلم عن الصيد قال ‏\"‏ إذا أرسلت كلبك فذكرت اسم الله عليه فقتل ولم يأكل فكل وإن أكل منه فلا تأكل فإنما أمسكه عليه ولم يمسك عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim At-Tai that:                     he asked the Messenger of Allah about hunting. He said: \"If you release your dog and mention the name of Allah over him, and he kills (the game), but does not eat any of it, then eat. But if he has eaten form it, then do not eat, for he caught it for himself, and not for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "30301",
        "20465",
        "20115",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4299",
      "hadith_no": "4299",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا أحمد بن أبي شعيب، قال حدثنا موسى بن أعين، عن معمر، عن عاصم بن سليمان، عن عامر الشعبي، عن عدي بن حاتم، أنه سأل رسول الله صلى الله عليه وسلم عن الصيد فقال ‏\"‏ إذا أرسلت سهمك وكلبك وذكرت اسم الله فقتل سهمك فكل ‏\"‏ ‏.‏ قال فإن بات عني ليلة يا رسول الله قال ‏\"‏ إن وجدت سهمك ولم تجد فيه أثر شىء غيره فكل وإن وقع في الماء فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:                     \"When you release your arrow or your dog, mentioned the name of Allah, and when your arrow kills (the game), then eat.\" He said: \"What if it gets away form me for a night, O Messenger of Allah?\" He said: \"If you find your arrow and you do not find the mark of anything else, then eat it. But if it falls into the water, do not eat it.\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "30301",
        "20465",
        "20115",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-5163",
      "hadith_no": "5163",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد بن كثير الحراني، قال حدثنا سعيد بن حفص، قال حدثنا موسى بن أعين، عن عيسى بن يونس، عن الضحاك بن عبد الرحمن، عن عطاء الخراساني، عن سعيد بن المسيب، قال قال عمر لصهيب ما لي أرى عليك خاتم الذهب قال قد رآه من هو خير منك فلم يعبه ‏.‏ قال من هو قال رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"Umar said to Suhaib: 'Why do I see you wearing a ring of gold?' He said: 'One who was better than you saw it and did not criticize it.' He said: 'Who was that?' He said: 'The Messenger of Allah [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "38620",
        "38228",
        "20465",
        "20347",
        "10947",
        "11002"
      ]
    },
    {
      "id": "sunan-ibn-majah-744",
      "hadith_no": "744",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عمرو بن عثمان، حدثنا موسى بن أعين، حدثنا محمد بن إسحاق، عن نافع، عن ابن عمر، وسئل، عن الحيطان، تلقى فيها العذرات فقال ‏\"‏ إذا سقيت مرارا فصلوا فيها ‏\"‏ ‏.‏ يرفعه إلى النبي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar was asked about gardens in which excrement was thrown.:                     He said: \"If it has been watered several times, then perform prayer there,\" and he attributed that to the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "10581",
        "20465",
        "11107",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1860",
      "hadith_no": "1860",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن عبد الملك، حدثنا موسى بن أعين، حدثنا عمرو بن الحارث، عن دراج أبي السمح، عن ابن حجيرة، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا أديت زكاة مالك فقد قضيت ما عليك ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     the Messenger of Allah said: “When you pay Zakat on your wealth, then you have done what is required to you.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20465",
        "20377",
        "19891",
        "13"
      ]
    }
  ],
  "total_hadiths": 13
}