{
  "id": "20461",
  "name": "Mubashir bin Isma'i مبشر بن إسماعيل - أبو إسماعيل الكلبي",
  "full_name": "Mubashir bin Isma'i  مبشر بن إسماعيل - أبو إسماعيل الكلبي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Kalbi",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18178",
      "name": "Hsan bin Nwh al-Nsry حسان بن نوح النصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "27501",
      "name": "Tmam bin Njyh al-'Asady تمام بن نجيح الأسدي الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20646",
      "name": "Ja'far bin Brqan جعفر بن برقان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27042",
      "name": "M'aan bin Rafa'a معان بن رفاعة السلامي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28340",
      "name": "'Abdur Rahman bin al-'Ala' bin al-Lajjaj عبد الرحمن بن العلاء بن اللجلاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20428",
      "name": "Shu'aib bin Abi Hamza شعيب بن أبي حمزة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20179",
      "name": "Muhammad bin Matraf محمد بن مطرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30383",
      "name": "Muhammad bin Mhran محمد بن مهران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38656",
      "name": "Musa bin 'Abdur Rahman موسى بن عبد الرحمن بن زياد الحلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "10724",
      "name": "Nsr bin 'Asim al-Lythy نصر بن عاصم الليثي البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "27539",
      "name": "Muhammad bin Ibrahim bin al-'Ala' محمد بن إبراهيم بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30390",
      "name": "Mukhlad bin Malik bin Jabir al-Jamal مخلد بن مالك بن جابر الجمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38325",
      "name": "'Abdul Hameed bin Sa'id عبد الحميد بن سعيد الثغري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30141",
      "name": "'Abbas bin al-Husain al-Qntry عباس بن الحسين القنطري أبو الفضل",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38373",
      "name": "'Ubaidullah bin Aby عبيد الله بن أبي الوزير",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30244",
      "name": "al-Hasan bin al-Sbah al-Bzar الحسن بن الصباح البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1152",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عباس بن الحسين، حدثنا مبشر، عن الأوزاعي،‏.‏ وحدثني محمد بن مقاتل أبو الحسن، قال أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله، لا تكن مثل فلان، كان يقوم الليل فترك قيام الليل ‏\"‏‏.‏ وقال هشام حدثنا ابن أبي العشرين، حدثنا الأوزاعي، قال حدثني يحيى، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة، مثله‏.‏ وتابعه عمرو بن أبي سلمة عن الأوزاعي،‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then stopped the night prayer.\"",
      "chain": [
        "30141",
        "20461",
        "20024",
        "30118",
        "20025",
        "20024",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "150",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أحمد بن إبراهيم الدورقي، حدثنا مبشر بن إسماعيل، عن الأوزاعي، عن عمير بن هانئ، في هذا الإسناد بمثله غير أنه قال ‏\"‏ أدخله الله الجنة على ما كان من عمل ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Umar b. Hani with the same chain of transmitters with the exception of these words:                      Allah would make him (he who affirms these truths) enter Paradise through one of the eight doors which he would like.",
      "chain": [
        "30494",
        "20461",
        "20024",
        "11415"
      ]
    },
    {
      "hadith_no": "2741",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا الوليد بن مسلم، ح وحدثنا موسى بن عبد الرحمن الأنطاكي، قال حدثنا مبشر، ح وحدثنا محمد بن عوف الطائي، أن الحكم بن نافع، حدثهم - المعنى، - كلهم عن شعيب بن أبي حمزة، عن نافع، عن ابن عمر، قال بعثنا رسول الله صلى الله عليه وسلم في جيش قبل نجد وانبعثت سرية من الجيش فكان سهمان الجيش اثنى عشر بعيرا اثنى عشر بعيرا ونفل أهل السرية بعيرا بعيرا فكانت سهمانهم ثلاثة عشر ثلاثة عشر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) sent us along with an army towards Najd, and he sent a detachment of that army (to face the enemy). The whole army got twelve camels per head as their portion, but he gave the detachment one additional camel (apart from the division made to the army). Thus they got thirteen camels each (as a reward).",
      "chain": [
        "38363",
        "20733",
        "38656",
        "20461",
        "38566",
        "30330",
        "20428",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4765",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا الوليد، ومبشر، - يعني ابن إسماعيل الحلبي عن أبي عمرو، قال - يعني الوليد - حدثنا أبو عمرو، قال حدثني قتادة، عن أبي سعيد الخدري، وأنس بن مالك، عن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ سيكون في أمتي اختلاف وفرقة، قوم يحسنون القيل ويسيئون الفعل ويقرءون القرآن لا يجاوز تراقيهم، يمرقون من الدين مروق السهم من الرمية لا يرجعون حتى يرتد على فوقه هم شر الخلق والخليقة طوبى لمن قتلهم وقتلوه، يدعون إلى كتاب الله وليسوا منه في شىء، من قاتلهم كان أولى بالله منهم ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله ما سيماهم قال ‏:‏ ‏\"‏ التحليق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri ; Anas ibn Malik:                     The Prophet (ﷺ) said: Soon there will appear disagreement and dissension in my people; there will be people who will be good in speech and bad in work. They recite the Qur'an, but it does not pass their collar-bones. They will swerve from the religion as an animal goes through the animal shot at. They will not return to it till the arrow comes back to its notch. They are worst of the people and animals. Happy is the one who kills them and they kill him. They call to the book of Allah, but they have nothing to do with it. He who fights against them will be nearer to Allah than them (the rest of the people). The people asked: What is their sign? He replied: They shave the head.",
      "chain": [
        "38662",
        "20733",
        "20461",
        "20733",
        "20024",
        "11019",
        "38",
        "19"
      ]
    },
    {
      "hadith_no": "979",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا الحسن بن الصباح البغدادي، حدثنا مبشر بن إسماعيل الحلبي، عن عبد الرحمن بن العلاء، عن أبيه، عن ابن عمر، عن عائشة، قالت ما أغبط أحدا بهون موت بعد الذي رأيت من شدة موت رسول الله صلى الله عليه وسلم ‏.‏ قال سألت أبا زرعة عن هذا الحديث وقلت له من عبد الرحمن بن العلاء فقال هو ابن العلاء بن اللجلاج ‏.‏ وإنما عرفه من هذا الوجه ‏.‏",
      "text_en": " Aishah narrated:                     \"I was not envious of anyone whose death was easy after I saw the severity the death of the Messenger of Allah.\"",
      "chain": [
        "30244",
        "20461",
        "18",
        "53"
      ]
    },
    {
      "hadith_no": "981",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا مبشر بن إسماعيل الحلبي، عن تمام بن نجيح، عن الحسن، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من حافظين رفعا إلى الله ما حفظا من ليل أو نهار فيجد الله في أول الصحيفة وفي آخر الصحيفة خيرا إلا قال الله تعالى أشهدكم أني قد غفرت لعبدي ما بين طرفى الصحيفة ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     The Messenger of Allah said: \"There is nothing that the two Guardian Angels  raise to Allah that they have preserved in a day or night, and Allah finds good in the beginning of the scroll and in the end of the scroll, except that Allah Most High says: 'Bear witness that I have forgiven my servant for what is included in the scroll.'\"",
      "chain": [
        "30249",
        "20461",
        "27501",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن إبراهيم الدمشقي، حدثنا مبشر بن إسماعيل الحلبي، عن معان بن رفاعة، عن عبد الوهاب بن بخت المكي، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نضر الله عبدا سمع مقالتي فوعاها ثم بلغها عني فرب حامل فقه غير فقيه ورب حامل فقه إلى من هو أفقه منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah said: 'May Allah cause to flourish a slave (of His) who hears my words and understands them, then he conveys them from me. There are those who have knowledge but no understanding, and there may be those who convey knowledge to those who may have more understanding of it than they do.'\"",
      "chain": [
        "11213",
        "20461",
        "27042",
        "19"
      ]
    }
  ],
  "total_hadiths": 7
}