{
  "id": "20470",
  "name": "Yahya bin Salah al-Wahadi يحيى بن صالح الوحاظي أبو زكريا",
  "full_name": "Yahya bin Salah al-Wahadi يحيى بن صالح الوحاظي أبو زكريا",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "212",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  ت  ق  -  صدوق ]",
      "Fiqh"
    ],
    "tags": [
      "al-Damashqi",
      "al-Himsi",
      "Hafiz",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17118",
      "name": "al-Hasan bin Ayoub الحسن بن أيوب بن عبد الله الحضرمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20710",
      "name": "Sa'id bin Basahyr al-Azdi سعيد بن بشير الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27012",
      "name": "Salmah bin Khultum al-Kndy سلمة بن كلثوم الكندي الشامي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20637",
      "name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20004",
      "name": "Imam Muhammad محمد بن الحسن الشيباني",
      "grade": "Succ. (Taba' Tabi') [Hanafi]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28038",
      "name": "Ishaq bin Yahya bin 'Alqama إسحاق بن يحيى بن علقمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "23258",
      "name": "Yazid bin S'aid bin Dhy يزيد بن سعيد بن ذي",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20445",
      "name": "'Ubaidullah bin 'Amr bin Abi Walid عبيد الله بن عمرو بن أبي الوليد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30568",
      "name": "Musa bin Qrysh bin Naf' موسى بن قريش بن نافع التميمي البخاري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30498",
      "name": "Ibrahim bin Sa'id al-Juhari إبراهيم بن سعيد الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30226",
      "name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38032",
      "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30572",
      "name": "Yazid bin Abd Rbh يزيد بن عبد ربه الزبيدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36056",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Hakam محمد بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30516",
      "name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30347",
      "name": "'Abdullah bin Hmad عبد الله بن حماد بن أيوب",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38588",
      "name": "Muhammad bin Muslim bin al-Wara محمد بن مسلم بن عثمان - بن وارة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38039",
      "name": "Ahmed bin Abd al-Whab أحمد بن عبد الوهاب بن نجدة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38437",
      "name": "'Imran bin Bakar al-Kula'i عمران بن بكار الكلاعي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38467",
      "name": "abu Umayya, Muhammad bin Ibrahim محمد بن إبراهيم أبو أمية الطرسوسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "361",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن سعيد بن الحارث، قال سألنا جابر بن عبد الله عن الصلاة، في الثوب الواحد فقال خرجت مع النبي صلى الله عليه وسلم في بعض أسفاره، فجئت ليلة لبعض أمري، فوجدته يصلي وعلى ثوب واحد، فاشتملت به وصليت إلى جانبه، فلما انصرف قال ‏\"‏ ما السرى يا جابر ‏\"‏‏.‏ فأخبرته بحاجتي، فلما فرغت قال ‏\"‏ ما هذا الاشتمال الذي رأيت ‏\"‏‏.‏ قلت كان ثوب‏.‏ يعني ضاق‏.‏ قال ‏\"‏ فإن كان واسعا فالتحف به، وإن كان ضيقا فاتزر به ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     I asked Jabir bin `Abdullah about praying in a single garment. He said, \"I traveled with the Prophet during some of his journeys, and I came to him at night for some purpose and I found him praying. At that time, I was wearing a single garment with which I covered my shoulders and prayed by his side. When he finished the prayer, he asked, 'O Jabir! What has brought you here?' I told him what I wanted. When I finished, he asked, 'O Jabir! What is this garment which I have seen and with which you covered your shoulders?' I replied, 'It is a (tight) garment.' He said, 'If the garment is large enough, wrap it round the body (covering the shoulders) and if it is tight (too short) then use it as an Izar (tie it around your waist only.)' \"",
      "chain": [
        "20470",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك، قال صلى بنا النبي صلى الله عليه وسلم صلاة ثم رقي المنبر، فقال في الصلاة وفي الركوع ‏\"‏ إني لأراكم من ورائي كما أراكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet led us in a prayer and then got up on the pulpit and said, \"In your prayer and bowing, I certainly see you from my back as I see you (while looking at you.)\"",
      "chain": [
        "20470",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "825",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن سعيد بن الحارث، قال صلى لنا أبو سعيد فجهر بالتكبير حين رفع رأسه من السجود، وحين سجد، وحين رفع، وحين قام من الركعتين وقال هكذا رأيت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     Abu Sa`id led us in the prayer and said the Takbir aloud on arising from the prostration, and on prostrating, on rising again, and on getting up from the second rak`a. Abu Sa`id said, \"I saw the Prophet doing the same.\"",
      "chain": [
        "20470",
        "20169",
        "11167"
      ]
    },
    {
      "hadith_no": "1045",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يحيى بن صالح، قال حدثنا معاوية بن سلام بن أبي سلام الحبشي الدمشقي، قال حدثنا يحيى بن أبي كثير، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف الزهري، عن عبد الله بن عمرو  رضى الله عنهما  قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     \"When the sun eclipsed in the lifetime of Allah's Apostle an announcement was made that a prayer was to be offered in congregation.\"",
      "chain": [
        "30021",
        "20470",
        "20401",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1838",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد، قال حدثنا يحيى بن صالح، حدثنا معاوية بن سلام، حدثنا يحيى بن أبي كثير، عن عكرمة، قال قال ابن عباس  رضى الله عنهما  قد أحصر رسول الله صلى الله عليه وسلم فحلق رأسه وجامع نساءه، ونحر هديه، حتى اعتمر عاما قابلا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle was prevented from performing (`Umra) Therefore, he shaved his head and had sexual relations with his wives and slaughtered his Hadi and performed Umra in the following year.",
      "chain": [
        "30213",
        "20470",
        "20401",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2312",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا إسحاق، حدثنا يحيى بن صالح، حدثنا معاوية  هو ابن سلام  عن يحيى، قال سمعت عقبة بن عبد الغافر، أنه سمع أبا سعيد الخدري  رضى الله عنه  قال جاء بلال إلى النبي صلى الله عليه وسلم بتمر برني فقال له النبي صلى الله عليه وسلم ‏\"‏ من أين هذا ‏\"‏‏.‏ قال بلال كان عندنا تمر ردي، فبعت منه صاعين بصاع، لنطعم النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم عند ذلك ‏\"‏ أوه أوه عين الربا عين الربا، لا تفعل، ولكن إذا أردت أن تشتري فبع التمر ببيع آخر ثم اشتره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id al-Khudri:                     Once Bilal brought Barni (i.e. a kind of dates) to the Prophet and the Prophet asked him, \"From where have you brought these?\" Bilal replied, \"I had some inferior type of dates and exchanged two Sas of it for one Sa of Barni dates in order to give it to the Prophet; to eat.\" Thereupon the Prophet said, \"Beware! Beware! This is definitely Riba (usury)! This is definitely Riba (Usury)! Don't do so, but if you want to buy (a superior kind of dates) sell the inferior dates for money and then buy the superior kind of dates with that money.\"",
      "chain": [
        "30313",
        "20470",
        "20401",
        "11449",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "2790",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آمن بالله وبرسوله وأقام الصلاة وصام رمضان، كان حقا على الله أن يدخله الجنة جاهد في سبيل الله، أو جلس في أرضه التي ولد فيها ‏\"‏‏.‏ فقالوا يا رسول الله أفلا نبشر الناس‏.‏ قال ‏\"‏ إن في الجنة مائة درجة أعدها الله للمجاهدين في سبيل الله، ما بين الدرجتين كما بين السماء والأرض، فإذا سألتم الله فاسألوه الفردوس، فإنه أوسط الجنة وأعلى الجنة، أراه فوقه عرش الرحمن، ومنه تفجر أنهار الجنة ‏\"‏‏.‏ قال محمد بن فليح عن أبيه ‏\"‏ وفوقه عرش الرحمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and His Apostle, offer prayer perfectly and fasts the month of Ramadan, will rightfully be granted Paradise by Allah, no matter whether he fights in Allah's Cause or remains in the land where he is born.\" The people said, \"O Allah's Apostle ! Shall we acquaint the people with the is good news?\" He said, \"Paradise has one-hundred grades which Allah has reserved for the Mujahidin who fight in His Cause, and the distance between each of two grades is like the distance between the Heaven and the Earth. So, when you ask Allah (for something), ask for Al-firdaus which is the best and highest part of Paradise.\" (i.e. The sub-narrator added, \"I think the Prophet also said, 'Above it (i.e. Al-Firdaus) is the Throne of Beneficent (i.e. Allah), and from it originate the rivers of Paradise.\")",
      "chain": [
        "20470",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "4222",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا يحيى بن صالح، قال حدثنا معاوية  هو ابن سلام  عن يحيى، عن أبي قلابة، أن ثابت بن الضحاك، أخبره أنه، بايع النبي صلى الله عليه وسلم تحت الشجرة‏.‏",
      "text_en": " Narrated Abu Qilaba:                     that Thabit bin Ad-Dahhak had informed him that he was one of those who had given the Pledge of allegiance (of Al-Hudaibiya) beneath the Tree.",
      "chain": [
        "30312",
        "20470",
        "20401",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "5681",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم دخل على رجل من الأنصار ومعه صاحب له، فسلم النبي صلى الله عليه وسلم وصاحبه، فرد الرجل فقال يا رسول الله بأبي أنت وأمي‏.‏ وهى ساعة حارة، وهو يحول في حائط له  يعني الماء  فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات في شنة وإلا كرعنا ‏\"‏‏.‏ والرجل يحول الماء في حائط فقال الرجل يا رسول الله عندي ماء بات في شنة‏.‏ فانطلق إلى العريش فسكب في قدح ماء، ثم حلب عليه من داجن له، فشرب النبي صلى الله عليه وسلم ثم أعاد، فشرب الرجل الذي جاء معه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and one of his companions entered upon an Ansari man. The Prophet and his companion greeted (the man) and he replied, \"O Allah's Apostle! Let my father and mother be sacrificed for you! It is hot,\" while he was watering his garden. The Prophet asked him, \"If you have water kept overnight in a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was watering the garden The man said, \"O Allah's Apostle! I have water kept overnight in a water-skin. He went to the shade and poured some water into a bowl and milked some milk from a domestic goat in it. The Prophet drank and then gave the bowl to the man who had come along with him to drink.",
      "chain": [
        "20470",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "6708",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق يعني ابن إبراهيم، حدثنا يحيى بن صالح، حدثنا معاوية، عن يحيى، عن عكرمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من استلج في أهله بيمين فهو أعظم إثما، ليبر ‏\"‏‏.‏ يعني الكفارة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Anyone who takes an oath through which his family may be harmed, and insists on keeping it, he surely commits a sin greater (than that of dissolving his oath). He should rather compensate for that oath by making expiation.\"",
      "chain": [
        "30123",
        "20470",
        "27",
        "20031",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "6775",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح بن سليمان، حدثنا سعيد بن الحارث، أنه سمع ابن عمر  رضى الله عنهما  يقول أولم ينهوا عن النذر إن النبي صلى الله عليه وسلم قال ‏\"‏ إن النذر لا يقدم شيئا، ولا يؤخر، وإنما يستخرج بالنذر من البخيل ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     that he heard Ibn `Umar saying, \"Weren't people forbidden to make vows?\" The Prophet said, 'A vow neither hastens nor delays anything, but by the making of vows, some of the wealth of a miser is taken out.\"",
      "chain": [
        "20470",
        "20169",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يحيى بن صالح، حدثنا معاوية، عن يحيى، - وهو ابن أبي كثير - عن يحيى بن أبي إسحاق، أن عبد الرحمن بن أبي بكرة، أخبره أن أبا بكرة قال نهانا رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abd al-Rabman b. Abu Bakra said:                      Allah's Messenger (may peace be upon him) prohibited us. The rest of the hadith is the same.",
      "chain": [
        "30313",
        "20470",
        "27",
        "11449",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "4167",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن صالح الوحاظي، حدثنا معاوية، ح وحدثني محمد بن سهل التميمي، وعبد الله بن عبد الرحمن الدارمي، - واللفظ لهما - جميعا عن يحيى بن حسان، حدثنا معاوية، - وهو ابن سلام - أخبرني يحيى، - وهو ابن أبي كثير - قال سمعت عقبة بن عبد الغافر، يقول سمعت أبا سعيد، يقول جاء بلال بتمر برني فقال له رسول الله صلى الله عليه وسلم ‏\"‏ من أين هذا ‏\"‏ ‏.‏ فقال بلال تمر كان عندنا رديء فبعت منه صاعين بصاع لمطعم النبي صلى الله عليه وسلم ‏.‏ فقال رسول الله عند ذلك ‏\"‏ أوه عين الربا لا تفعل ولكن إذا أردت أن تشتري التمر فبعه ببيع آخر ثم اشتر به ‏\"‏ ‏.‏ لم يذكر ابن سهل في حديثه عند ذلك ‏.‏",
      "text_en": " Abd Sa'id reported:                      Bilal (Allah be pleased with him) came with fine quality of dates. Allah's Messenger (may peace be upon him) said to him: From where (you have brought them)? Bilal said: We had inferior quality of dates and I exchanged two sa's (of inferior quality) with one sa (of fine quality) as food for Allah's Apostle (may peace be upon him), whereupon Allah's Messenger (may peace be upon him) said: Woe! it is in fact usury; therefore, don't do that. But when you intend to buy dates (of superior quality), sell (the inferior quality) in a separate bargain and then buy (the superior quality). And in the hadith transmitted by Ibn Sahl there is no mention of\" whereupon\".",
      "chain": [
        "30313",
        "20470",
        "27",
        "20300",
        "20401",
        "11449",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "5472",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه موسى بن قريش بن نافع التميمي، حدثنا يحيى بن صالح الوحاظي، حدثنا سليمان بن بلال، بهذا الإسناد وقال ‏\"‏ نعم الأدم ‏\"‏ ‏.‏ ولم يشك ‏.‏",
      "text_en": " This hadith has been reported on the authority of Sulaiman b. Bilal with the same chain of transmitters and he is reported to have said:                     \" The best condiment.\" And he did not doubt (about this word).",
      "chain": [
        "30568",
        "20470",
        "20160"
      ]
    },
    {
      "hadith_no": "2281",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن عبد الحميد البهراني، حدثني يحيى بن صالح، حدثنا إسماعيل بن عياش، حدثني عمرو بن مهاجر، عن أبيه، عن أسماء بنت يزيد بن السكن الأنصارية، أنها طلقت على عهد رسول الله صلى الله عليه وسلم ولم يكن للمطلقة عدة فأنزل الله عز وجل حين طلقت أسماء بالعدة للطلاق فكانت أول من أنزلت فيها العدة للمطلقات ‏.‏",
      "text_en": " Amr ibn Muhajir reported on the authority of his father:                      Asma', daughter of Yazid ibn as-Sakan al-Ansariyyah, was divorced in the time of the Messenger of Allah (ﷺ). No waiting period was prescribed for a divorced woman (at that time). When Asma' was divorced, Allah, the Exalted, sent down the injunction of waiting period for divorce. She is the first of the divorced women about whom the verse relating to waiting period was sent down.",
      "chain": [
        "20470",
        "20736",
        "17532",
        "17066",
        "84"
      ]
    },
    {
      "hadith_no": "2632",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا يحيى بن صالح، حدثنا محمد بن المهاجر، عن العباس، عن أبي سلام الحبشي، قال بعث إلى عمر بن عبد العزيز فحملت على البريد ‏.‏ قال فلما دخل عليه قال يا أمير المؤمنين لقد شق على مركبي البريد ‏.‏ فقال يا أبا سلام ما أردت أن أشق عليك ولكن بلغني عنك حديث تحدثه عن ثوبان عن النبي صلى الله عليه وسلم في الحوض فأحببت أن تشافهني به ‏.‏ قال أبو سلام حدثني ثوبان عن النبي صلى الله عليه وسلم قال ‏\"‏ حوضي من عدن إلى عمان البلقاء ماؤه أشد بياضا من اللبن وأحلى من العسل وأكاويبه عدد نجوم السماء من شرب منه شربة لم يظمأ بعدها أبدا أول الناس ورودا عليه فقراء المهاجرين الشعث رءوسا الدنس ثيابا الذين لا ينكحون المتنعمات ولا تفتح لهم السدد ‏\"‏ ‏.‏ قال عمر لكني نكحت المتنعمات وفتح لي السدد ونكحت فاطمة بنت عبد الملك لا جرم أني لا أغسل رأسي حتى يشعث ولا أغسل ثوبي الذي يلي جسدي حتى يتسخ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث عن معدان بن أبي طلحة عن ثوبان عن النبي صلى الله عليه وسلم ‏.‏ وأبو سلام الحبشي اسمه ممطور وهو شامي ثقة ‏.‏",
      "text_en": " Al-'Abbas narrated from Abu Sallam Al-Habashi who said:                     \"'Umar bin 'Abdul-'Aziz summoned me so I got a ride on a mule.\" [He said:] \"When he entered upon him, he said: 'O Commander of the Beleivers! My riding mule was troublesome for me.' So he said: 'O Abu Sallam!I did not want to trouble you, but a Hadith which you narrated-from Thawban, from the Prophet (s.a.w) about the Hawd-was conveyed to me,and I wanted you to narrate it directly to me.\"'Abu Sallam said: \"Thawban narrated to me from The Messenger of Allah (s.a.w) who said 'My Hawd (is as large as) from 'Adan to 'Amman of Al-Balqa', its water is whiter than milk and sweeter than honey. Its cups are as numerous as the stars, whoever drinks one drink from it, he will never be thirsty after that again. The first people to arrive at it are the poor among the Muhajirin with disheveled heads, dirty clothes, those whom the women of favor would not marry, nor would the doors be open for them.' 'Umar said: 'But I have married a women of favor and the doors are open for me. I married Fatimah bint 'Abdul-Malik. I shall certainly not wash my head until it is disheveled, nor wash my garment which touches my body until it becomes dirty.\"",
      "chain": [
        "34188",
        "20470",
        "100",
        "10968"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن بن سلمة حدثنا أبو حاتم، حدثنا يحيى بن صالح، وابن، نفيل وغيرهما قالوا حدثنا زهير، فذكر نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "38473",
        "20470"
      ]
    },
    {
      "hadith_no": "1632",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا يحيى بن صالح، حدثنا سلمة بن كلثوم، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  صلى على جنازة ثم أتى قبر الميت فحثى عليه من قبل رأسه ثلاثا ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)offeredthe funeral prayer, then he came to the grave of the deceasedandscattered three handfuls of earth from the side of (thedeceased’s)head.",
      "chain": [
        "20470",
        "27012",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2193",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يحيى بن صالح الوحاظي، حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، عن عكرمة، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "11222",
        "20470",
        "20401",
        "11449",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "3430",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا العباس بن الوليد الخلال الدمشقي، حدثنا يحيى بن صالح، حدثني سليمان بن عطاء الجزري، حدثني مسلمة بن عبد الله الجهني، عن عمه أبي مشجعة، عن أبي الدرداء، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ سيد طعام أهل الدنيا وأهل الجنة اللحم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                     “The best food of the people of this world and the people ofParadise is meat.’”",
      "chain": [
        "20470",
        "28229",
        "17541",
        "37"
      ]
    },
    {
      "hadith_no": "3431",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا يحيى بن صالح، حدثنا سليمان بن عطاء الجزري، حدثنا مسلمة بن عبد الله الجهني، عن عمه أبي مشجعة، عن أبي الدرداء، قال ما دعي رسول الله  صلى الله عليه وسلم  إلى لحم قط إلا أجاب ولا أهدي له لحم قط إلا قبله ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      “The Messenger of Allah (ﷺ)wasnever invited to eat meat but he would respond, and he was neveroffered meat as a gift but he would accept it.”",
      "chain": [
        "20470",
        "28229",
        "17541",
        "37"
      ]
    }
  ],
  "total_hadiths": 21
}