{
  "id": "20501",
  "name": "Aflah bin Sa'id al-Ansari أفلح بن سعيد الأنصاري",
  "full_name": "Aflah bin Sa'id al-Ansari أفلح بن سعيد الأنصاري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "156",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  س  -  صدوق ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11864",
      "name": "'Abdullah bin Rafa'i عبد الله بن رافع المخزومي أبو رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12025",
      "name": "Bryd'h bin Sufyan بريدة بن سفيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20537",
      "name": "Hmad bin Khalid al-Khyat حماد بن خالد الخياط القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6115",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني أبو معن الرقاشي، وأبو بكر بن نافع وعبد بن حميد قالوا حدثنا أبو عامر - وهو عبد الملك بن عمرو - حدثنا أفلح بن سعيد، حدثنا عبد الله بن رافع، قال كانت أم سلمة تحدث أنها سمعت النبي صلى الله عليه وسلم يقول على المنبر وهي تمتشط ‏\"‏ أيها الناس ‏\"‏ ‏.‏ فقالت لماشطتها كفي رأسي ‏.‏ بنحو حديث بكير عن القاسم بن عباس ‏.‏",
      "text_en": " Umm Salama reported that she heard Allah's Apostle (may peace be upon him) saying this as he was sitting on the pulpit and she was getting her hair combed. (He uttered these words):                     \" O people.\" And she said to one who was combing: Leave my head; the rest of the hadith is the same.",
      "chain": [
        "30432",
        "20443",
        "20501",
        "11864"
      ]
    },
    {
      "hadith_no": "7374",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا ابن نمير، حدثنا زيد، - يعني ابن حباب - حدثنا أفلح بن سعيد، حدثنا  عبد الله بن رافع، مولى أم سلمة قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك إن طالت بك مدة أن ترى قوما في أيديهم مثل أذناب البقر يغدون في غضب الله ويروحون في سخط الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      If you survive for a time you would certainly see people who would have whips in their hands like the tail of an ox. They would get up in the morning under the wrath of Allah and they would get into the evening with the anger of Allah.",
      "chain": [
        "30212",
        "20650",
        "20501",
        "11864",
        "13"
      ]
    },
    {
      "hadith_no": "7375",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبيد الله بن سعيد، وأبو بكر بن نافع وعبد بن حميد قالوا حدثنا أبو عامر العقدي حدثنا أفلح بن سعيد، حدثني عبد الله بن رافع، مولى أم سلمة قال سمعت  أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن طالت بك مدة أوشكت أن ترى قوما يغدون في سخط الله ويروحون في لعنته في أيديهم مثل أذناب البقر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      If you live for a time, you would certainly see people get up (in the morning) in the wrath of Allah and getting into the evening under the curse of Allah, and there would be in their hands (whips) like the tail of an ox.",
      "chain": [
        "30359",
        "20443",
        "20501",
        "11864",
        "13"
      ]
    },
    {
      "hadith_no": "800",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال حدثنا زيد بن الحباب، قال حدثنا أفلح بن سعيد، قال حدثنا بريدة بن سفيان بن فروة الأسلمي، عن غلام، لجده يقال له مسعود فقال مر بي رسول الله صلى الله عليه وسلم وأبو بكر فقال لي أبو بكر يا مسعود ائت أبا تميم - يعني مولاه - فقل له يحملنا على بعير ويبعث إلينا بزاد ودليل يدلنا ‏.‏ فجئت إلى مولاى فأخبرته فبعث معي ببعير ووطب من لبن فجعلت آخذ بهم في إخفاء الطريق وحضرت الصلاة فقام رسول الله صلى الله عليه وسلم يصلي وقام أبو بكر عن يمينه وقد عرفت الإسلام وأنا معهما فجئت فقمت خلفهما فدفع رسول الله صلى الله عليه وسلم في صدر أبي بكر فقمنا خلفه ‏.‏ قال أبو عبد الرحمن بريدة هذا ليس بالقوي في الحديث ‏.‏",
      "text_en": " Buraidah bin Sufyin bin Farwah Al-Aslami narrated that a slave of his grandfather who was called Mas'Od said:                      \"The Messenger of Allah (ﷺ) and Abu Bakr passed by me and Abu Bakr said to me: '0 Mas'ud, go to Abu Tamim' - meaning the man from whom he had been freed - 'and tell him to give us a camel so that wecould ride, and let him send us some food and a guide to show us the way.' So I went to my former master and told him the same, and he sent with me a camel and vessels of milk, and I brought them via a secret route. Then the time for prayer came and the Messenger of Allah (ﷺ) stood up and prayed, and Abu Bakr stood to his right. I had come to know about Islam and I was with them, so I came and stood behind them. So the Messenger of Allah (ﷺ) pushed Abu Bakr on the chest (to make him move backward) and we stood behind him.\" Abu 'Abdur-Rahman (An-Nasai)said: (This) Buraidah is not a reliable narrator of Hadith.",
      "chain": [
        "30149",
        "20650",
        "20501",
        "12025"
      ]
    }
  ],
  "total_hadiths": 4
}