{
  "id": "20509",
  "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
  "full_name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": [
        "100 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "174",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خت  م  4  -  صدوق له أوهام ]",
      "Fiqh"
    ],
    "tags": [
      "Ally Quraish",
      "Client",
      "al-Madni",
      "Baghdad"
    ]
  },
  "parents": [
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "32252",
      "name": "Muhammad bin 'AR bin Abi al-Zanad محمد بن عبد الرحمن بن أبي الزناد",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4499",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي، حدثنا يحيى، وزاد، قالت عائشة لددناه في مرضه فجعل يشير إلينا أن لا تلدوني فقلنا كراهية المريض للدواء‏.‏ فلما أفاق قال ‏\"‏ ألم أنهكم أن تلدوني ‏\"‏‏.‏ قلنا كراهية المريض للدواء‏.‏ فقال ‏\"‏ لا يبقى أحد في البيت إلا لد  وأنا أنظر  إلا العباس، فإنه لم يشهدكم ‏\"‏‏.‏ رواه ابن أبي الزناد عن هشام عن أبيه عن عائشة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     We poured medicine in one side of the Prophet's mouth during his illness and he started pointing to us, meaning to say, \"Don't pour medicine in my mouth.\" We said, \"(He says so) because a patient dislikes medicines.\" When he improved and felt a little better, he said, \"Didn't I forbid you to pour medicine in my mouth ?\" We said, \" ( We thought it was because of) the dislike, patients have for medicines. He said, \"Let everyone present in the house be given medicine by pouring it in his mouth while I am looking at him, except `Abbas as he has not witnessed you (doing the same to me).",
      "chain": [
        "30026",
        "20031",
        "20509"
      ]
    },
    {
      "hadith_no": "30",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا الأصمعي، عن ابن أبي الزناد، عن أبيه، قال أدركت بالمدينة مائة كلهم مأمون ‏.‏ ما يؤخذ عنهم الحديث يقال ليس من أهله ‏.‏",
      "text_en": "",
      "chain": [
        "30395",
        "20556",
        "20509",
        "11061"
      ]
    },
    {
      "hadith_no": "161",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا عبد الرحمن بن أبي الزناد، قال ذكره أبي عن عروة بن الزبير، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم كان يمسح على الخفين ‏.‏ وقال غير محمد على ظهر الخفين ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Messenger of Allah (ﷺ) wiped over the socks.Another version adds: \"On the back (upper part) of the socks.\"",
      "chain": [
        "30269",
        "20509",
        "10511",
        "166"
      ]
    },
    {
      "hadith_no": "744",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل بن ربيعة بن الحارث بن عبد المطلب، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، - رضى الله عنه - عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حذو منكبيه ويصنع مثل ذلك إذا قضى قراءته وأراد أن يركع ويصنعه إذا رفع من الركوع ولا يرفع يديه في شىء من صلاته وهو قاعد وإذا قام من السجدتين رفع يديه كذلك وكبر ‏.‏ قال أبو داود في حديث أبي حميد الساعدي حين وصف صلاة النبي صلى الله عليه وسلم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When the Messenger of Allah (ﷺ) stood for offering the obligatory prayer, he uttered the takbir (Allah is most great) and raised his hands opposite to his shoulders; and he did like that when he finished recitation (of the Qur'an) and was about to bow; and he did like that when he rose after bowing; and he did not raise his hands in his prayer while he was in his sitting position. When he stood up from his prostrations (at the end of two rak'ahs), he raised his hands likewise and uttered the takbir (Allah is most great) and raised his hands so as to bring them up to his shoulders, as he uttered the takbir in the beginning of the prayer.",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "761",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن داود الهاشمي، أخبرنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل بن ربيعة بن الحارث بن عبد المطلب، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حذو منكبيه ويصنع مثل ذلك إذا قضى قراءته وإذا أراد أن يركع ويصنعه إذا رفع من الركوع ولا يرفع يديه في شىء من صلاته وهو قاعد وإذا قام من السجدتين رفع يديه كذلك وكبر ودعا نحو حديث عبد العزيز في الدعاء يزيد وينقص الشىء ولم يذكر ‏\"‏ والخير كله في يديك والشر ليس إليك ‏\"‏ ‏.‏ وزاد فيه ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وأخرت وما أسررت وأعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏",
      "text_en": " ‘Ali b. Ali Talib said:                      When the Messenger of Allah (ﷺ) stood up for (offering) obligatory prayer, he uttered the takbir (Allah is most great) and raised his hands opposite to his shoulders, and he did so when he finished the recitation (of the Qur’an) and when he was about to bow; and he did like that when he raised (his head) after bowing. He did not raise his hands in prayer when he was sitting. When he stood at the end of two rak’ahs, he raised his hands in a similar way and uttered the takbir and supplicated in a more or less the same manner as narrated by ‘Abd al-‘Aziz in his version. This version does not mention the words “All good is in Thy Hands and evil does not pertain to Thee.” And this adds: He said when he finished the prayer: “O Allah, forgive me my former and latter sins, my open and secret sins; Thou art my deity; there is no God but Thee.",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "915",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا عبد الرحمن، - يعني ابن أبي الزناد - قال سمعت هشاما، يحدث عن أبيه، عن عائشة، بهذا الخبر قال وأخذ كرديا كان لأبي جهم فقيل يا رسول الله الخميصة كانت خيرا من الكردي ‏.‏",
      "text_en": " The above-mentioned tradition has also been narrated by ‘A’ishah through a different chain of transmitters. This version adds:                      He (the prophet) took a kind of sheet of cloth known as kurdi which belongs to Abu Jahm. The people told him; Messenger of Allah, the (former) sheet of cloth was better than this kind of kurdi sheet.",
      "chain": [
        "30150",
        "20286",
        "20509",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1327",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن جعفر الوركاني، حدثنا ابن أبي الزناد، عن عمرو بن أبي عمرو، مولى المطلب عن عكرمة، عن ابن عباس، قال ‏:‏ كانت قراءة النبي صلى الله عليه وسلم على قدر ما يسمعه من في الحجرة وهو في البيت ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet's (ﷺ) recitation was loud enough for one who was in the inner chamber to hear it when he was in the house.",
      "chain": [
        "30513",
        "20509",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا عبد الرحمن، - يعني ابن أبي الزناد - عن هشام بن عروة، عن أبيه، قال قالت عائشة يا ابن أختي كان رسول الله صلى الله عليه وسلم لا يفضل بعضنا على بعض في القسم من مكثه عندنا وكان قل يوم إلا وهو يطوف علينا جميعا فيدنو من كل امرأة من غير مسيس حتى يبلغ إلى التي هو يومها فيبيت عندها ولقد قالت سودة بنت زمعة حين أسنت وفرقت أن يفارقها رسول الله صلى الله عليه وسلم يا رسول الله يومي لعائشة ‏.‏ فقبل ذلك رسول الله صلى الله عليه وسلم منها قالت نقول في ذلك أنزل الله تعالى وفي أشباهها أراه قال ‏{‏ وإن امرأة خافت من بعلها نشوزا ‏}‏ ‏.‏",
      "text_en": " Narrated Hisham b. 'Urwah:                     On the authority of his father that 'Aishah said: O my nephew, the Messenger of Allah (ﷺ) did not prefer one of us to the other in respect of his division of the time of his staying with us. It was very rare that he did not visit us any day (i.e. he visited all of us every day). He would come near each of his wives without having intercourse with her until he reached the one who had her day and passed his night with her. When Saudah daughter of Zam'ah became old and feared that the Messenger of Allah (ﷺ) would divorce her, she said: Messenger of Allah, I give to 'Aishah the day you visit me. The Messenger of Allah (ﷺ) accepted it from her. She said: We thing that Allah, the Exalted, revealed about this or similar matter the Qur'anic verse: \"If a wife fears cruelty or desertion on her husband's part....\" [4:128]",
      "chain": [
        "30184",
        "20509",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2292",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن داود، حدثنا ابن وهب، حدثنا عبد الرحمن بن أبي الزناد، عن هشام بن عروة، عن أبيه، قال لقد عابت ذلك عائشة - رضى الله عنها - أشد العيب يعني حديث فاطمة بنت قيس وقالت إن فاطمة كانت في مكان وحش فخيف على ناحيتها فلذلك رخص لها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Urwah said:                      Aisha (Allah be pleased with her) severely objected to the tradition of Fatimah daughter of Qays. She said: Fatimah lived in a desolate house and she feared for her loneliness there. Hence the Messenger of Allah (ﷺ) accorded permission to her (to leave the place).",
      "chain": [
        "30584",
        "20029",
        "20509",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2395",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عوف، حدثنا سعيد بن أبي مريم، حدثنا ابن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر بن الزبير، عن عباد بن عبد الله، عن عائشة، بهذه القصة قال فأتي بعرق فيه عشرون صاعا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Aishah through a different chain of narrators. This version adds:                      A huge basket containing twenty sa's (of dates) was brought.",
      "chain": [
        "38566",
        "30232",
        "20509",
        "448",
        "11215"
      ]
    },
    {
      "hadith_no": "2507",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن خارجة بن زيد، عن زيد بن ثابت، قال ‏:‏ كنت إلى جنب رسول الله صلى الله عليه وسلم فغشيته السكينة فوقعت فخذ رسول الله صلى الله عليه وسلم على فخذي، فما وجدت ثقل شىء أثقل من فخذ رسول الله صلى الله عليه وسلم ثم سري عنه فقال ‏:‏ ‏\"‏ اكتب ‏\"‏ ‏.‏ فكتبت في كتف ‏:‏ لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله ‏.‏ إلى آخر الآية، فقام ابن أم مكتوم - وكان رجلا أعمى - لما سمع فضيلة المجاهدين فقال ‏:‏ يا رسول الله فكيف بمن لا يستطيع الجهاد من المؤمنين فلما قضى كلامه غشيت رسول الله صلى الله عليه وسلم السكينة فوقعت فخذه على فخذي ووجدت من ثقلها في المرة الثانية كما وجدت في المرة الأولى ثم سري عن رسول الله صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ اقرأ يا زيد ‏\"‏ ‏.‏ فقرأت ‏{‏ لا يستوي القاعدون من المؤمنين ‏}‏ فقال رسول الله صلى الله عليه وسلم ‏{‏ غير أولي الضرر ‏}‏ الآية كلها ‏.‏ قال زيد ‏:‏ فأنزلها الله وحدها فألحقتها، والذي نفسي بيده لكأني أنظر إلى ملحقها عند صدع في كتف ‏.‏",
      "text_en": " Zaid bin Thabit said “I was beside the Apostle of Allaah(ﷺ) when the divinely-inspired calmness overtook him and the thigh of the Apostle of Allaah(ﷺ) fell on my thigh. I did not find any weightier than the thigh of the Apostle of Allaah(ﷺ). He then regained his composure and said “Write down. I wrote on a shoulder. Not equal are thise believers who sit (at home), other than those who have a (disabling) hurt, and those who strive in the way of Allaah. When Ibn Umm Makhtum who was blind heard the excellence of the warriors. He stood up and said “Apostle of Allaah(ﷺ) how is it for those believers who are unable to fight (in the path of Allaah)? When he finished his question his divinely-inspired calmness overtook him, and his thigh fell on my thigh and I found its weight the second time as I found the first time.” When the Apostle of Allaah(ﷺ) regained his composure, he said “Apostle of Allaah(ﷺ) said “Other than those who have a (disabling hurt). Zaid said “Allaah, the exalted, revealed it alone and I appended it.” By Him in Whose hands is my life, I am seeing, as it were the place where I put it (i.e., the verse) at the crack in the shoulder.”",
      "chain": [
        "30116",
        "20509",
        "11061",
        "49"
      ]
    },
    {
      "hadith_no": "2757",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن الصباح البزاز، قال حدثنا عبد الرحمن بن أبي الزناد، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الإمام جنة يقاتل به ‏\"‏ ‏.‏",
      "text_en": " Abu Hurarirah reported the Apostle of Allaah(ﷺ) as saying “A Muslim ruler is shield by which a battle is fought.”",
      "chain": [
        "30269",
        "20509",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3576",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن حمزة بن أبي يحيى الرملي، حدثنا زيد بن أبي الزرقاء، حدثنا ابن أبي الزناد، عن أبيه، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، قال ‏{‏ ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ‏}‏ إلى قوله ‏{‏ الفاسقون ‏}‏ هؤلاء الآيات الثلاث نزلت في اليهود خاصة في قريظة والنضير ‏.‏",
      "text_en": " Ibn 'Abbas said:                      \"If any do fail to judge (by the light of) what Allah has revealed, they are (no better than) unbelievers\" up to \"wrongdoers.\" These three verses were revealed about the Jews, particularly about Quraizah and al-Nadir.",
      "chain": [
        "30101",
        "28194",
        "20509",
        "11061",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3645",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا ابن أبي الزناد، عن أبيه، عن خارجة، - يعني ابن زيد بن ثابت - قال قال زيد بن ثابت أمرني رسول الله صلى الله عليه وسلم فتعلمت له كتاب يهود وقال ‏\"‏ إني والله ما آمن يهود على كتابي ‏\"‏ ‏.‏ فتعلمته فلم يمر بي إلا نصف شهر حتى حذقته فكنت أكتب له إذا كتب وأقرأ له إذا كتب إليه ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Messenger of Allah (ﷺ) ordered me (to learn the writing of the Jews), so I learnt for him the writing of the Jews. He said: I swear by Allah, I do not trust Jews in respect of writing for me. So I learnt it, and only a fortnight passed that . I mastered it. I would write for him when he wrote (to them), and read to him when something was written to him.",
      "chain": [
        "30184",
        "20509",
        "11061",
        "11006"
      ]
    },
    {
      "hadith_no": "3975",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا ابن أبي الزناد، ح وحدثنا محمد بن سليمان الأنباري، حدثنا حجاج بن محمد، عن ابن أبي الزناد، - وهو أشبع - عن أبيه، عن خارجة بن زيد بن ثابت، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ ‏{‏ غير أولي الضرر ‏}‏ ولم يقل سعيد كان يقرأ ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Prophet (ﷺ) used to read: \"Not equal are those believers who sit (at home) and receive no hurt (ghayru ulid-darari) but the narrator Sa'id did not say the words \"used to read\"",
      "chain": [
        "30116",
        "20509",
        "31160",
        "20381",
        "20509",
        "11061",
        "11006",
        "49"
      ]
    },
    {
      "hadith_no": "4133",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا ابن أبي الزناد، عن موسى بن عقبة، عن أبي الزبير، عن جابر، قال كنا مع النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ أكثروا من النعال فإن الرجل لا يزال راكبا ما انتعل ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     We were with the Prophet (ﷺ) on a journey. He said: Make a general practice of wearing sandals, for a man keeps riding as long as he wears sandals.",
      "chain": [
        "30269",
        "20509",
        "11106",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4163",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني ابن أبي الزناد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان له شعر فليكرمه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: He who has hair should honour it.",
      "chain": [
        "30584",
        "20029",
        "20509",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4187",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا ابن نفيل، حدثنا عبد الرحمن بن أبي الزناد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان شعر رسول الله صلى الله عليه وسلم فوق الوفرة ودون الجمة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The hair of the Messenger of Allah (ﷺ) were above wafrah and below jummah.",
      "chain": [
        "20509",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4503",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، قال حدثنا محمد بن إسحاق، فحدثني محمد بن جعفر بن الزبير، قال سمعت زياد بن ضميرة الضمري، ح وحدثنا وهب بن بيان، وأحمد بن سعيد الهمداني، قالا حدثنا ابن وهب، أخبرني عبد الرحمن بن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر، أنه سمع زياد بن سعد بن ضميرة السلمي، - وهذا حديث وهب وهو أتم - يحدث عروة بن الزبير عن أبيه - قال موسى - وجده وكانا شهدا مع رسول الله صلى الله عليه وسلم حنينا - ثم رجعنا إلى حديث وهب - أن محلم بن جثامة الليثي قتل رجلا من أشجع في الإسلام وذلك أول غير قضى به رسول الله صلى الله عليه وسلم فتكلم عيينة في قتل الأشجعي لأنه من غطفان وتكلم الأقرع بن حابس دون محلم لأنه من خندف فارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة لا والله حتى أدخل على نسائه من الحرب والحزن ما أدخل على نسائي ‏.‏ قال ثم ارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة مثل ذلك أيضا إلى أن قام رجل من بني ليث يقال له مكيتل عليه شكة وفي يده درقة فقال يا رسول الله إني لم أجد لما فعل هذا في غرة الإسلام مثلا إلا غنما وردت فرمي أولها فنفر آخرها اسنن اليوم وغير غدا فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمسون في فورنا هذا وخمسون إذا رجعنا إلى المدينة ‏\"‏ ‏.‏ وذلك في بعض أسفاره ومحلم رجل طويل آدم وهو في طرف الناس فلم يزالوا حتى تخلص فجلس بين يدى رسول الله صلى الله عليه وسلم وعيناه تدمعان فقال يا رسول الله إني قد فعلت الذي بلغك وإني أتوب إلى الله تبارك وتعالى فاستغفر الله عز وجل لي يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته بسلاحك في غرة الإسلام اللهم لا تغفر لمحلم ‏\"‏ ‏.‏ بصوت عال زاد أبو سلمة فقام وإنه ليتلقى دموعه بطرف ردائه قال ابن إسحاق فزعم قومه أن رسول الله صلى الله عليه وسلم استغفر له بعد ذلك ‏.‏ قال أبو داود قال النضر بن شميل الغير الدية ‏.‏",
      "text_en": " Narrated Ziyad ibn Sa'd ibn Dumayrah as-Sulami:                     On the authority of his father (Sa'd) and his grandfather (Dumayrah) (according to Musa's version) who were present in the battle of Hunayn with the Messenger of Allah (ﷺ): After the advent of Islam, Muhallam ibn Jaththamah al-Laythi killed a man of Ashja'. That was the first blood-money decided by the Messenger of Allah (ﷺ) (for payment). Uyaynah spoke about the killing of al-Ashja'i, for he belonged to Ghatafan, and al-Aqra' ibn Habis spoke on behalf of Muhallam, for he belonged to Khunduf. The voices rose high, and the dispute and noise grew.  So the Messenger of Allah (ﷺ) said: Do you not accept blood-money, Uyaynah?  Uyaynah then said: No, I swear by Allah, until I cause his women to suffer the same fighting and grief as he caused my women to suffer. Again the voices rose high, and the dispute and noise grew.  The Messenger of Allah (ﷺ) said: Do you not accept the blood-money Uyaynah? Uyaynah gave the same reply as before, and a man of Banu Layth called Mukaytil stood up. He had a weapon and a skin shield in his hand.  He said: I do not find in the beginning of Islam any illustration for what he has done except the one that \"some sheep came on, and those in the front were shot; hence those in the rear ran away\". (The other example is that) \"make a law today and change it.\"  The Messenger of Allah (ﷺ) said: Fifty (camels) here immediately and fifty when we return to Medina. This happened during some of his journeys. Muhallam was a tall man of dark complexion. He was with the people. They continued (to make effort for him) until he was released. He sat before the Messenger of Allah (ﷺ), with his eyes flowing.  He said: Messenger of Allah! I have done (the act) of which you have been informed. I repent to Allah, the Exalted, so ask Allah's forgiveness for me. Messenger of Allah!  The Messenger of Allah (ﷺ) then said: Did you kill him with your weapon at the beginning of Islam. O Allah! do not forgive Muhallam. He said these words loudly.  AbuSalamah added: He (Muhallam) then got up while he was wiping his tears with the end of his garment.  Ibn Ishaq said: His people alleged that the Messenger of Allah (ﷺ) asked forgiveness for him after that.Abu Dawud said: Al-Nadr b. Shumail said: al-ghiyar means blood-wit.",
      "chain": [
        "20040",
        "20022",
        "11107",
        "36063",
        "30296",
        "20029",
        "20509",
        "448",
        "20173"
      ]
    },
    {
      "hadith_no": "5015",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن سليمان المصيصي، لوين حدثنا ابن أبي الزناد، عن أبيه، عن عروة، وهشام، عن عروة، عن عائشة، رضى الله عنها قالت كان رسول الله صلى الله عليه وسلم يضع لحسان منبرا في المسجد فيقوم عليه يهجو من قال في رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن روح القدس مع حسان ما نافح عن رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to setup a pulpit in the mosque for Hassan who would stand on it and satirise those who spoke against the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) would say: The spirit of holiness (i.e. Gabriel) is with Hassan so long as he speaks in defence of the Messenger of Allah (ﷺ).",
      "chain": [
        "20509",
        "11061",
        "10511",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "39",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن سعيد، هو الجوهري حدثنا سعد بن عبد الحميد بن جعفر، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن صالح، مولى التوأمة عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأت فخلل بين أصابع يديك ورجليك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     Allah's Messenger said: \"When performing Wudu go between the fingers of your hands and (toes of) your feet.\"",
      "chain": [
        "30498",
        "32010",
        "20509",
        "11106",
        "12184",
        "17"
      ]
    },
    {
      "hadith_no": "98",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، قال حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن عروة بن الزبير، عن المغيرة بن شعبة، قال رأيت النبي صلى الله عليه وسلم يمسح على الخفين على ظاهرهما ‏.‏ قال أبو عيسى حديث المغيرة حديث حسن وهو حديث عبد الرحمن بن أبي الزناد عن أبيه عن عروة عن المغيرة ولا نعلم أحدا يذكر عن عروة عن المغيرة ‏\"‏ على ظاهرهما ‏\"‏ ‏.‏ غيره ‏.‏ وهو قول غير واحد من أهل العلم وبه يقول سفيان الثوري وأحمد ‏.‏ قال محمد وكان مالك بن أنس يشير بعبد الرحمن بن أبي الزناد ‏.‏",
      "text_en": " AI-Mughirah bin Shu'bah narrated:                     \"I saw the Prophet wiping over the Khuff: on the tops of them.\"",
      "chain": [
        "20387",
        "20509",
        "11061",
        "10511",
        "166"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبد الرحمن بن أبي الزناد، عن عبد الرحمن بن الحارث بن عياش بن أبي ربيعة، عن حكيم بن حكيم، وهو ابن عباد بن حنيف أخبرني نافع بن جبير بن مطعم، قال أخبرني ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ أمني جبريل عليه السلام عند البيت مرتين فصلى الظهر في الأولى منهما حين كان الفىء مثل الشراك ثم صلى العصر حين كان كل شيء مثل ظله ثم صلى المغرب حين وجبت الشمس وأفطر الصائم ثم صلى العشاء حين غاب الشفق ثم صلى الفجر حين برق الفجر وحرم الطعام على الصائم ‏.‏ وصلى المرة الثانية الظهر حين كان ظل كل شيء مثله لوقت العصر بالأمس ثم صلى العصر حين كان ظل كل شيء مثليه ثم صلى المغرب لوقته الأول ثم صلى العشاء الآخرة حين ذهب ثلث الليل ثم صلى الصبح حين أسفرت الأرض ثم التفت إلى جبريل فقال يا محمد هذا وقت الأنبياء من قبلك ‏.‏ والوقت فيما بين هذين الوقتين ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وبريدة وأبي موسى وأبي مسعود الأنصاري وأبي سعيد وجابر وعمرو بن حزم والبراء وأنس ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"Jibril (peace be upon him] led me (in Salat) twice at the House. So he prayed Zuhr the first time when the shadow was similar to (the length of) the strap a sandal. Then he prayed Asr when everything was similar (to the length of) its shadow. Then he prayed Maghrib when the sun had set and the fasting person breaks fast. Then he prayed Isha when the twilight had vanished. Then he prayed Fajr when Fajr (dawn) began, and when eating is prohibited for the fasting person. The second time he prayed Zuhr when the shadow of everything was similar to (the length of) it, at the time of Asr the day before. Then he prayed Asr when the shadow of everything was about twice as long as it. Then he prayed Maghrib at the same time as he did the first time. Then he prayed Isha, the later one, when a third of the night had gone. Then he prayed Subh when the land glowed. The Jibril turned towards me and said: \"O Muhammad! These are the times of the Prophets before you, and the (best) time is what is between these two times.\"",
      "chain": [
        "30480",
        "20509",
        "20701",
        "19803",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسلم بن عمرو بن مسلم أبو عمرو الحذاء المدني، حدثني عبد الله بن نافع الصائغ، عن ابن أبي الزناد، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يأمر بإخراج الزكاة قبل الغدو للصلاة يوم الفطر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وهو الذي يستحبه أهل العلم أن يخرج الرجل صدقة الفطر قبل الغدو إلى الصلاة ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.",
      "chain": [
        "30411",
        "20509",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "830",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا عبد الله بن يعقوب المدني، عن ابن أبي الزناد، عن أبيه، عن خارجة بن زيد بن ثابت، عن أبيه، أنه رأى النبي صلى الله عليه وسلم تجرد لإهلاله واغتسل ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد استحب قوم من أهل العلم الاغتسال عند الإحرام وبه يقول الشافعي ‏.‏",
      "text_en": " Zaid bin Thabit narrated from his father :                     who said that he saw the Prophet disrobing for his Ihlal and to perform Ghusl.",
      "chain": [
        "20509",
        "11061",
        "11006",
        "49"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا ابن أبي الزناد، عن أبيه، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، أن النبي صلى الله عليه وسلم تنفل سيفه ذا الفقار يوم بدر وهو الذي رأى فيه الرؤيا يوم أحد ‏.‏ هذا حديث حسن غريب إنما نعرفه من هذا الوجه من حديث ابن أبي الزناد ‏.‏ وقد اختلف أهل العلم في النفل من الخمس فقال مالك بن أنس لم يبلغني أن رسول الله صلى الله عليه وسلم نفل في مغازيه كلها وقد بلغني أنه نفل في بعضها وإنما ذلك على وجه الاجتهاد من الإمام في أول المغنم وآخره ‏.‏ قال ابن منصور قلت لأحمد إن النبي صلى الله عليه وسلم نفل إذا فصل بالربع بعد الخمس وإذا قفل بالثلث بعد الخمس فقال يخرج الخمس ثم ينفل مما بقي ولا يجاوز هذا ‏.‏ قال أبو عيسى وهذا الحديث على ما قال ابن المسيب النفل من الخمس ‏.‏ قال إسحاق كما قال ‏.‏",
      "text_en": " Another chain from Ibn 'Abbas that the Prophet (ﷺ) took his sword Dhul-Fiqar on the Day of Badr, and it is the one that he saw in the dream on the Day of Uhud.This Hadith is Hasan Gharib. We only know it from this route through the report of Ibn Abi Az-Zinad.The people of knowledge differ over giving the Nafl from the Khumus. Malik bin Anas said:                      \"It has not reached me that the Messenger of Allah (ﷺ) gave the Nafl during every expedition, but it has been conveyed to me that he gave the Nafl in some of them. That is according to the discretion of the Imam during the beginning of the division of the spoils or the end of it.\"Ibn Mansur said: \"I said to Ahmad: 'The Prophet (ﷺ) gave the Nafl when he divided the fourth, after the Khumus, and when he was returning (he gave) the third from the Khumus.' So he said: 'The Khumus is taken, and then the Nafl is given from what remains, nothing beyond this.''\"[Abu 'Eisa said:] This Hadith is (understood) as Ibn Musayyab said: \"The Nafl is from te Khumus.\" Ishaq said as he said.",
      "chain": [
        "30480",
        "20509",
        "11061",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1755",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا هناد، حدثنا عبد الرحمن بن أبي الزناد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء واحد وكان له شعر فوق الجمة ودون الوفرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد روي من غير وجه عن عائشة أنها قالت كنت أغتسل أنا ورسول الله صلى الله عليه وسلم من إناء واحد ‏.‏ ولم يذكروا فيه هذا الحرف وكان له شعر فوق الجمة ودون الوفرة ‏.‏ وعبد الرحمن بن أبي الزناد ثقة كان مالك بن أنس يوثقه ويأمر بالكتابة عنه ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"I and the Messenger of Allah (ﷺ) would perform Ghusl using (water from) the same vessel. He had hair reaching above his shoulders and below his earlobes.\"This Hadith is Hasan Sahih Gharib.[Abu 'Eisa said:] It has been reported from other routes that 'Aishah said: \"I and the Messenger of Allah (ﷺ) would perform Ghusl using (water from) the same vessel.\" And the following statement is not mentioned in it: \"He had hair reaching above his shoulders [and below his earlobes'.\"It was only mentioned by 'Abdur-Rahman bin Abi Az-Zinad, and he is trustworthy, a Hafiz, and Malik bin Anas stated that he was trustworthy and ordered recording (Ahadith) from him.",
      "chain": [
        "30480",
        "20509",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2715",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عبد الرحمن بن أبي الزناد، عن أبيه، عن خارجة بن زيد بن ثابت، عن أبيه، زيد بن ثابت قال أمرني رسول الله صلى الله عليه وسلم أن أتعلم له كلمات كتاب يهود ‏.‏ قال ‏\"‏ إني والله ما آمن يهود على كتاب ‏\"‏ ‏.‏ قال فما مر بي نصف شهر حتى تعلمته له قال فلما تعلمته كان إذا كتب إلى يهود كتبت إليهم وإذا كتبوا إليه قرأت له كتابهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير هذا الوجه عن زيد بن ثابت رواه الأعمش عن ثابت بن عبيد الأنصاري عن زيد بن ثابت قال أمرني رسول الله صلى الله عليه وسلم أن أتعلم السريانية ‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     \"The Messenger of Allah (ﷺ) ordered me to learn some statements from writings of the Jews for him, and he said: 'For indeed by Allah! I do no trust the Jews with my letters.'\" He said: \"Half a month did not pass before I learned it, when he (ﷺ) wanted to write to the Jews I would write it to them, and when they wrote to him I would read their letters to him.\"",
      "chain": [
        "20387",
        "20509",
        "11061",
        "11006"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، وعلي بن حجر المعنى، واحد، قالا حدثنا ابن أبي الزناد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يضع لحسان منبرا في المسجد يقوم عليه قائما يفاخر عن رسول الله صلى الله عليه وسلم - أو قال ينافح عن رسول الله صلى الله عليه وسلم - ويقول رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يؤيد حسان بروح القدس ما يفاخر أو ينافح عن رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The Messenger of Allah (ﷺ) had a Minbar placed in the Masjid for Hassan to stand to boast (poetically) about the Messenger of Allah (ﷺ)\" - or she said: \"to defend the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) said: 'Indeed Allah has aided Hassan with the holy spirit (Jibril) as he boasts about - or - defends the Messenger of Allah (ﷺ).'\"",
      "chain": [
        "35016",
        "20387",
        "20509",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3083",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا إسماعيل بن موسى، وعلي بن حجر، قالا حدثنا ابن أبي الزناد، عن أبيه، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم مثله ‏.‏ وفي الباب عن أبي هريرة والبراء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب وهو حديث ابن أبي الزناد ‏.‏",
      "text_en": "",
      "chain": [
        "35016",
        "20387",
        "20509",
        "11061",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3498",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إسماعيل بن أبي أويس، حدثني ابن أبي الزناد، عن أبي الزناد، عن عروة بن الزبير، عن نيار بن مكرم الأسلمي، قال لما نزلت ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض وهم من بعد غلبهم سيغلبون * في بضع سنين ‏)‏ فكانت فارس يوم نزلت هذه الآية قاهرين للروم وكان المسلمون يحبون ظهور الروم عليهم لأنهم وإياهم أهل كتاب وفي ذلك قول الله تعالى ‏:‏ ‏(‏يومئذ يفرح المؤمنون * بنصر الله ينصر من يشاء وهو العزيز الرحيم ‏)‏ فكانت قريش تحب ظهور فارس لأنهم وإياهم ليسوا بأهل كتاب ولا إيمان ببعث فلما أنزل الله تعالى هذه الآية خرج أبو بكر الصديق رضى الله عنه يصيح في نواحي مكة ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض وهم من بعد غلبهم سيغلبون * في بضع سنين ‏)‏ قال ناس من قريش لأبي بكر فذلك بيننا وبينكم زعم صاحبكم أن الروم ستغلب فارسا في بضع سنين أفلا نراهنك على ذلك قال بلى ‏.‏ وذلك قبل تحريم الرهان فارتهن أبو بكر والمشركون وتواضعوا الرهان وقالوا لأبي بكر كم تجعل البضع ثلاث سنين إلى تسع سنين فسم بيننا وبينك وسطا تنتهي إليه ‏.‏ قال فسموا بينهم ست سنين قال فمضت الست سنين قبل أن يظهروا فأخذ المشركون رهن أبي بكر فلما دخلت السنة السابعة ظهرت الروم على فارس فعاب المسلمون على أبي بكر تسمية ست سنين لأن الله تعالى قال ‏:‏ ‏(‏في بضع سنين ‏)‏ قال وأسلم عند ذلك ناس كثير ‏.‏ قال هذا حديث صحيح حسن غريب من حديث نيار بن مكرم لا نعرفه إلا من حديث عبد الرحمن بن أبي الزناد ‏.‏",
      "text_en": " Narrated Niyar bin Mukram Al-Aslami:                     \"When (the following) was revealed: 'Alif Lam Mim. The Romans have been defeated. In the nearest land, and they, after their defeat, will be victorious in Bid' years (30:1-4).' - on the day that these Ayat were revealed, the Persians had defeated the Romans, and the Muslims had wanted the Romans to be victorious over them, because they were the people of the Book. So Allah said about that: 'And on that day, the believers will rejoice - with the help of Allah. He helps whom He wills, and He is the Almighty, the Most Merciful (30:4 & 5). The Quraish wanted the Persians to be victorious since they were not people of the Book, nor did they believe in the Resurrection. So when Allah revealed these Ayat, Abu Bakr As-Siddiq, may Allah be pleased with him, went out, proclaiming throughout Makkah: 'Alif Lam Mim. The Romans have been defeated. In the nearest land, and they, after their defeat, will be victorious, in Bid' years (30:1-4).' Some of the Quraish said: 'Then this is (a bet) between us and you. Your companion claims that the Romans will defeat the Persians in Bid' years, so why have have a bet on that between us and you?' Abu Bakr said: 'Yes.' This was before betting has been forbidden. So Abu Bakr and the idolaters made a bet, and they said to Abu Bakr: 'What do you think - Bid' means something between three and nine years, so let us agree on the middle.' So they agreed on six years; Then six years passed without the Romans being victorious. The idolaters took what they won in the bet from Abu Bakr. When the seventh year came and the Romans were finally victorious over the Persians, the Muslims rebuked Abu Bakr for agreeing to six years. He said: 'Because Allah said: 'In Bid' years.' At that time, many people became Muslims.\"",
      "chain": [
        "34188",
        "30103",
        "20509",
        "11061",
        "10511",
        "5318"
      ]
    },
    {
      "hadith_no": "3388",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، - وهو الطيالسي حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن أبان بن عثمان، قال سمعت عثمان بن عفان، رضى الله عنه يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يقول في صباح كل يوم ومساء كل ليلة بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم ثلاث مرات فيضره شيء ‏\"‏ ‏.‏ وكان أبان قد أصابه طرف فالج فجعل الرجل ينظر إليه فقال له أبان ما تنظر أما إن الحديث كما حدثتك ولكني لم أقله يومئذ ليمضي الله على قدره ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Aban bin Uthman said:                      “I heard Uthman bin Affan [may Allah be pleased with him] saying:‘The Messenger of Allah said: “There is no worshipper who says, in the morning of every day, and the evening of every night: ‘In the Name of Allah, who with His Name, nothing in the earth or the heavens can cause harm, and He is the Hearing, the Knowing (Bismillah, Alladhi La Yadurru Ma`a Ismihi Shai'un Fil-Ardi Wa La Fis-Sama', Wa Huwas-Sami`ul Alim)’ – three times, (except that) nothing shall harm him.”And Aban had been stricken with a type of semi-paralysis, so a man began to look at him, so Aban said to him, “What are you looking at? Indeed the Hadith is as I reported it to you, but I did not say it one day, so Allah brought about His decree upon me.”",
      "chain": [
        "30160",
        "20547",
        "20509",
        "11061",
        "10582",
        "4"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة رفع يديه حذو منكبيه ويصنع ذلك أيضا إذا قضى قراءته وأراد أن يركع ويصنعها إذا رفع رأسه من الركوع ولا يرفع يديه في شيء من صلاته وهو قاعد وإذا قام من سجدتين رفع يديه كذلك فكبر ويقول حين يفتتح الصلاة بعد التكبير ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت سبحانك أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك وأنا بك وإليك ولا منجا منك ولا ملجأ إلا إليك أستغفرك وأتوب إليك ‏\"‏ ‏.‏ ثم يقرأ فإذا ركع كان كلامه في ركوعه أن يقول ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت وأنت ربي خشع سمعي وبصري ومخي وعظمي لله رب العالمين ‏\"‏ ‏.‏ فإذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يتبعها ‏\"‏ اللهم ربنا ولك الحمد ملء السموات والأرض وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ وإذا سجد قال في سجوده ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت وأنت ربي سجد وجهي للذي خلقه وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند الشافعي وبعض أصحابنا ‏.‏ قال أبو عيسى وأحمد لا يراه وقال بعض أهل العلم من أهل الكوفة وغيرهم يقول هذا في صلاة التطوع ولا يقوله في المكتوبة ‏.‏ سمعت أبا إسماعيل الترمذي محمد بن إسماعيل بن يوسف يقول سمعت سليمان بن داود الهاشمي يقول وذكر هذا الحديث فقال هذا عندنا مثل حديث الزهري عن سالم عن أبيه ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that :                     when the Messenger of Allah would stand for the obligatory prayer, he would raise his hands to the level of his shoulder, and he would do this [also] when he finished his recitation and intended to bow, and he would do it when he raised his head from Ruku, and he would not raise his hands in any of his prayers while he was seated. When he would rise from the two prostrations, he would likewise raise his hands, and say the Takbir, and when he opened his Salat after the Takbir, he would say: “I have directed my face towards the One who has created the heavens and the earth, as a Hanif, and I am not of the idolaters. Indeed, my Salat, my sacrifice, my living, my dying, is for Allah, the Lord of all that exists, without partner, and with this have I been ordered and I am of the Muslims. O Allah, You are the King, there is none worthy of worship except You. Glorified are You, You are My Lord, and I am Your slave, I have wronged myself and I admit to my sin, so forgive me all my sins, verily, there is none who forgives sins but You, and guide me to the best of manners, none guides to the best of them except You, and turn away from me the evil of them, none can turn away from me the evil of them, none turns away from me the evil of them except You, I am here in Your obedience and aiding Your cause, and I am reliant upon You and ever-turning towards You, [and] there is no refuge from You nor hiding place from You except (going) to You, I seek Your forgiveness, and I repent to you (Wajjahtu Wajhi Lilladhi Fataras-Samawati Wal-Arda Hanifan Wa Ma Ana Min Al-Mushrikin, Inna Salati Wa Nusuki Wa Mahyaya Wa Mamati Lillahi Rabbil-Alamin, La Sharika Lahu Wa Bidhalika Umirtu Wa Ana Min Al-Muslimin. Allahumma Antal-Maliku La Ilaha Illa Anta Subhanaka, Anta Rabbi, Wa Ana Abduka Zalamtu Nafsi Wa’taraftu Bidhanbi Faghfirli Dhanbi Jami’an, Innahu La Yaghfir udh-Dhunuba Illa Ant. Wahdini Li-Ahsanil-Akhlaqi La Yahdi Li-Ahsaniha Illa Ant. Wasrif Anni Sayyi’aha Illa Ant. Labaika Wa Sa’daika Wa Ana Bika Wa Ilaika, [Wa] La Manja Minka Wa La Milja Illa Ilaik, Astaghfiruka Wa Atubu Ilaik).” Then he would recite, then when he would bow, his speech in his Ruku, would be to say: “O Allah, to You have I bowed, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord. My hearing, my sight, my brain and my bones are humbled to Allah, the Lord of the Worlds all that exists (Allahumma Laka Raka’tu Wa Bika Amantu Wa Laka Aslamtu Wa Anta Rabbi, Khasha’a Sam’I Wa Basari Wa Mukhkhi Wa Azmi Lillahi, Rabbil-Alamin).” Then, when he raised his head from Ruku he would say: “Allah hears the one who praises him (Sami Allahu Liman Hamidah).” Then he would follow it with: “O Allah, our Lord, to You is praise filling the heavens and the earth and filling whatever You wish of things afterward (Allahumma Rabban Lakal-Hamdu Mil’as-Samawati Wal-Ardi Wa Mil’a Ma Shi’ta Min Shai’in Ba’d).” Then, when he would prostrated he would say in his prostration: “O Allah, to You have I prostrated, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord, my face has prostrated to the One that created it, and grated its hearing and sight, Blessed is Allah, the Best of Creators (Allahumma Laka Sajadtu Wa Bika Amantu Wa Laka Aslamtu, Wa Anta Rabbi, Sajada WAjhi Lilladhi Khalaqahu Wa Shaqqa Sam’ahu Wa Basarahu, Tabarak Allahu Ahsanul-Khaliqin).” When he was finished with his Salat, we would say: “O Allah, forgive me what I have done, before and after, and what I have hidden, and what I have done openly, and You are my Deity, there is none worthy of worship except You (Allahummaghfirli Ma Qaddamtu Wa Ma Akhkhartu Wa Ma Asrartu Wa Ma A’lantu, Wa Anta Ilahi, La Ilaha Illa Ant).”",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "114",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا أبي عثمان بن خالد، عن عبد الرحمن بن أبي الزناد، عن أبيه، عن الأعرج، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لكل نبي رفيق في الجنة ورفيقي فيها عثمان بن عفان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"Every Prophet will have a friend in Paradise, and my friend there will be 'Uthman bin 'Affan.\"",
      "chain": [
        "32032",
        "20509",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "115",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا أبي عثمان بن خالد، عن عبد الرحمن بن أبي الزناد، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  لقي عثمان عند باب المسجد فقال ‏\"‏ يا عثمان هذا جبريل أخبرني أن الله قد زوجك أم كلثوم بمثل صداق رقية على مثل صحبتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet met 'Uthman at the door of the mosque and said: \"O 'Uthman! Jibril has told me that Allah married you to Umm Kulthum for a dowry like that of Ruqayyah, provided that you treat her as you treated Ruqayyah.\"",
      "chain": [
        "32032",
        "20509",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبيد الله بن عبد المجيد، حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الهرة لا تقطع الصلاة لأنها من متاع البيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"Cats do not invalidate the prayer, because they are one of the things that are useful in the house.\"",
      "chain": [
        "30160",
        "20509",
        "11061",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "483",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا سعد بن عبد الحميد بن جعفر، عن ابن أبي الزناد، عن موسى بن عقبة، عن صالح، مولى التوأمة عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء واجعل الماء بين أصابع يديك ورجليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     'The Messenger of Allah said: 'When you get up for prayer, perform ablution properly and make the water run between your toes and your fingers.'\"",
      "chain": [
        "30498",
        "32010",
        "20509",
        "11106",
        "12184",
        "17"
      ]
    },
    {
      "hadith_no": "913",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا سليمان بن داود أبو أيوب الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، قال كان النبي  صلى الله عليه وسلم  إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حتى يكونا حذو منكبيه وإذا أراد أن يركع فعل مثل ذلك وإذا رفع رأسه من الركوع فعل مثل ذلك وإذا قام من السجدتين فعل مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abu Talib said:                      “When the Prophet (ﷺ)stood up to offer a prescribed prayer, he said Allahu Akbar andraisedhis hands until they were parallel to his shoulders. When hewanted tobow he did likewise; when he raised his head from bowing hedidlikewise; and when he stood up after the two prostrations he didlikewise.”*",
      "chain": [
        "30437",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "2110",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد العزيز بن عبد الله، حدثنا ابن أبي الزناد، عن هشام بن عروة، عن أبيه، قال دخلت على مروان فقلت له امرأة من أهلك طلقت فمررت عليها وهي تنتقل فقالت أمرتنا فاطمة بنت قيس وأخبرتنا أن رسول الله  صلى الله عليه وسلم  أمرها أن تنتقل ‏.‏ فقال مروان هي أمرتهم بذلك ‏.‏ قال عروة فقلت أما والله لقد عابت ذلك عائشة وقالت إن فاطمة كانت في مسكن وحش فخيف عليها فلذلك أرخص لها رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated from Hisham bin 'Urwah that his father said:                     \"I entered upon Marwan and said to him: 'A women from your family has been divorced. I passed by her and she was moving. She said: 'Fatimah bint Qais told us to do that, and she told us that the Messenger of Allah (ﷺ) told her to move.' Marwan said: 'She told them to do that.\"' 'Urwah said: \"l said: 'By Allah, 'Aishah did not like that, and said: 'Fatimah was living in a deserted house and it was feared for her (safety and well being), so the Messenger of Allah (ﷺ) granted a concession to her.'\"",
      "chain": [
        "11222",
        "30105",
        "20509",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2322",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا محمد بن ميمون المدني، عن عبد الرحمن بن أبي الزناد، عن أبيه، عن الأعرج، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم بارك لأمتي في بكورها يوم الخميس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     \"O Allah, bless my nation early in the morning of Thursday.' \"",
      "chain": [
        "32032",
        "30108",
        "20509",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2915",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، حدثنا ابن الصلت، عن ابن أبي الزناد، عن أبيه، عن عبيد الله بن عبد الله، عن ابن عباس، أن رسول الله صلى الله عليه وسلم تنفل سيفه ذا الفقار يوم بدر ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)acquiredhis sword Dhulfiqar, from the spoils of war on the Day ofbadr.",
      "chain": [
        "30216",
        "20509",
        "11061",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3672",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا عبد الله بن نافع، عن ابن أبي الزناد، ح وحدثنا علي بن أبي الخصيب، حدثنا وكيع، عن عبد الله بن سعيد بن أبي هند، جميعا عن محمد بن عبد الله بن عمرو بن عثمان، عن أمه، فاطمة بنت الحسين عن ابن عباس، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تديموا النظر إلى المجذومين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “Do notkeep looking at those who have leprosy.”",
      "chain": [
        "30285",
        "30411",
        "20509",
        "20032",
        "11184",
        "22187",
        "17"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا ابن أبي فديك، عن عبد الرحمن بن أبي الزناد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان لرسول الله  صلى الله عليه وسلم  شعر دون الجمة وفوق الوفرة.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ) hadhair that came between his earlobes and his shoulders.”",
      "chain": [
        "30285",
        "20172",
        "20509",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3869",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا ابن أبي الزناد، عن أبيه، عن أبان بن عثمان، قال سمعت عثمان بن عفان، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من عبد يقول في صباح كل يوم ومساء كل ليلة بسم الله الذي لا يضر مع اسمه شىء في الأرض ولا في السماء وهو السميع العليم ثلاث مرات - فيضره شىء ‏\"‏ ‏.‏ قال وكان أبان قد أصابه طرف من الفالج فجعل الرجل ينظر إليه فقال له أبان ما تنظر إلى أما إن الحديث كما قد حدثتك ولكني لم أقله يومئذ ليمضي الله على قدره ‏.‏",
      "text_en": " 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah (saas) say: \"There is no person who says, in the morning and evening of every day: Bismillahil-ladhi la yadurru ma'a ismihi shay'un fil-ardi wa la fis-sama'i wa Huwas-Sami'ul-'Alim (In the name of Allah with Whose Name nothing on earth or in heaven harms, and He is the All-Seeing, All-Knowing), three times, and is then harmed by anything.'\" (Hasan)He (one of the narrators) said: \"Aban had been stricken with paralysis on one side of his body, and a man started looking at him. Aban said: 'Why are you looking at me? The Hadith is as I have narrated it to you, but I did not say it that day, so that the decree of Allah might be implemented.'\"",
      "chain": [
        "30160",
        "20547",
        "20509",
        "11061",
        "10582",
        "4"
      ]
    }
  ],
  "total_hadiths": 44
}