{
  "id": "20506",
  "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
  "full_name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "167",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Asbahi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20436",
      "name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11104",
      "name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11101",
      "name": "Sharhbayl bin Sa'd شرحبيل بن سعد أبو سعد الخطمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11155",
      "name": "Thur bin Zayd al-Dayli ثور بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20436",
      "name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30278",
      "name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20466",
      "name": "al-Nadr bin Muhammad bin Musa النضر بن محمد بن موسى الجرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20384",
      "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25024",
      "name": "Isma'il bin Sbyh إسماعيل بن صبيح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30523",
      "name": "Mansur bin Abi Mazahim منصور بن أبي مزاحم بشير التركي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "401",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثناه عبد بن حميد، قال حدثني يعقوب، - يعني ابن إبراهيم بن سعد - حدثنا أبو أويس، عن الزهري، كرواية مالك بإسناده وقال ثم قرأ هذه الآية حتى أنجزها ‏.‏",
      "text_en": " This hadith has also been narrated by Abd b. Humaid Ya'qub, i. e. son of Ibrahim b. Sa'd, Abu Uwais, Zuhri, like the one narrated by Malik with the same chain of transmission and said:                      He recited this verse till he completed it.",
      "chain": [
        "20184",
        "20506"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أحمد بن جعفر المعقري، حدثنا النضر بن محمد، حدثنا أبو أويس، أخبرني العلاء، قال سمعت من أبي ومن أبي السائب، وكانا، جليسى أبي هريرة قالا قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاة لم يقرأ فيها بفاتحة الكتاب فهى خداج ‏\"‏ ‏.‏ يقولها ثلاثا بمثل حديثهم ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who said his prayer, but did not recite the opening chapter of al-Kitab, his prayer is incomplete. He repeated it thrice.",
      "chain": [
        "30414",
        "28603",
        "20506",
        "10606",
        "13"
      ]
    },
    {
      "hadith_no": "3062",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا العباس بن محمد بن حاتم، وغيره، قال العباس حدثنا الحسين بن محمد، أخبرنا أبو أويس، حدثنا كثير بن عبد الله بن عمرو بن عوف المزني، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم أقطع بلال بن الحارث المزني معادن القبلية جلسيها وغوريها - وقال غير العباس جلسها وغورها - وحيث يصلح الزرع من قدس ولم يعطه حق مسلم وكتب له النبي صلى الله عليه وسلم ‏\"‏ بسم الله الرحمن الرحيم هذا ما أعطى محمد رسول الله بلال بن الحارث المزني أعطاه معادن القبلية جلسيها وغوريها ‏\"‏ ‏.‏ وقال غير العباس ‏\"‏ جلسها وغورها ‏\"‏ ‏.‏ ‏\"‏ وحيث يصلح الزرع من قدس ولم يعطه حق مسلم ‏\"‏ ‏.‏ قال أبو أويس وحدثني ثور بن زيد مولى بني الديل بن بكر بن كنانة عن عكرمة عن ابن عباس مثله ‏.‏",
      "text_en": " Narrated Amr ibn Awf al-Muzani:                     The Prophet (ﷺ) assigned as a fief to Bilal ibn al-Muzani the mines of al-Qabaliyyah both  which lay on the upper side and which lay on the lower side, and (the land) which was suitable for cultivation at Quds. He did not give him (the land which involved) the right of a Muslim. The Prophet (ﷺ) wrote a document for him. It goes: \"In the name of Allah, the Compassionate, the Merciful. This is what the Messenger of Allah (ﷺ) assigned to Bilal ibn Harith al-Muzani. He gave him the mines of al-Qabaliyyah, both which lay on the upper side and which lay on the lower side, and (the land) which is suitable for cultivation at Quds. He did not give him the right of any Muslim.\"Abu Uwais said: A similar tradition has been narrated to me by Thawr b. Zaid, client of Banu al-Dail b. Bakr b. Kinahah from 'Ikrimah on the authority of Ibn 'Abbas.",
      "chain": [
        "100",
        "20506"
      ]
    },
    {
      "hadith_no": "2630",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا إسماعيل بن أبي أويس، حدثني كثير بن عبد الله بن عمرو بن عوف بن زيد بن ملحة، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الدين ليأرز إلى الحجاز كما تأرز الحية إلى جحرها وليعقلن الدين من الحجاز معقل الأروية من رأس الجبل إن الدين بدأ غريبا ويرجع غريبا فطوبى للغرباء الذين يصلحون ما أفسد الناس من بعدي من سنتي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Kathir bin 'Abdullah bin 'Amr bin 'Awf bin Zaid bin Milhah narrated from his father, from his grandfather:                     that the Messenger of Allah (ﷺ) said: \"Indeed the religion with creep into the Hijaz just like a snake creeps into its hole, and the religion will cling to the Hijaz just like the female mountain goat cling to the peak of a mountain. Indeed the religion began as something strange and it will return to being strange. So Tuba is for the strangers who correct what the people have corrupted from my Sunnah after me.\"",
      "chain": [
        "30025",
        "30103",
        "20506"
      ]
    },
    {
      "hadith_no": "635",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمر بن هياج، حدثنا إسماعيل بن صبيح، حدثنا أبو أويس، عن شرحبيل بن سعد، عن جابر بن عبد الله، قال سئل النبي  صلى الله عليه وسلم  عن الجنب هل ينام أو يأكل أو يشرب قال ‏\"‏ نعم إذا توضأ وضوءه للصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Prophet was asked about whether a person who is sexually impure can sleep, or eat, or drink. He said: 'yes, if he does ablution as for the prayer.'\"",
      "chain": [
        "35139",
        "25024",
        "20506",
        "11101",
        "34"
      ]
    },
    {
      "hadith_no": "3724",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا إسماعيل بن عبد الله، حدثنا محمد بن نعيم بن عبد الله المجمر، عن أبيه، عن ابن طخفة الغفاري، عن أبي ذر، قال مر بي النبي  صلى الله عليه وسلم  وأنا مضطجع على بطني فركضني برجله وقال ‏\"‏ يا جنيدب إنما هذه ضجعة أهل النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Prophet(ﷺ) passed by me and I was lying on my stomach. He nudged me with his foot and said: 'O Junaidib! This is how the people of Hell lie.'\"\"",
      "chain": [
        "32048",
        "30103",
        "20506",
        "23"
      ]
    }
  ],
  "total_hadiths": 6
}