{
  "id": "20500",
  "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
  "full_name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "153",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خت  م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Laithi",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11864",
      "name": "'Abdullah bin Rafa'i عبد الله بن رافع المخزومي أبو رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-4047",
      "hadith_no": "4047",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني أبو الطاهر، حدثنا عبد الله بن وهب، أخبرني أسامة بن زيد الليثي، عن نافع، عن عبد الله بن عمر، قال لما افتتحت خيبر سألت يهود رسول الله صلى الله عليه وسلم أن يقرهم فيها على أن يعملوا على نصف ما خرج منها من الثمر والزرع ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقركم فيها على ذلك ما شئنا ‏\"‏ ‏.‏ ثم ساق الحديث بنحو حديث ابن نمير وابن مسهر عن عبيد الله وزاد فيه وكان الثمر يقسم على السهمان من نصف خيبر فيأخذ رسول الله صلى الله عليه وسلم الخمس ‏.‏",
      "text_en": " 'Abdullah b. Umar (Allah be pleased with them) reported that when Khaibar had been conquered, the Jews asked Allah's Messenger (may peace be upon him) to let them continue (cultivation in those lands) on half of the share of yield in fruits and crop, whereupon Allah's Messenger (may peace be upon him) said:                      I will allow you to continue here, so long as we would desire. The rest of the hadith is the same, but with this addition:\" The fruit would be distributed equal to the half of Khaibar. And out of hall of the produce of the land, Allah's Apostle (may peace be be upon him) got the fifth part.\"",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20500",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4293",
      "hadith_no": "4293",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثنا أبو كامل الجحدري، حدثنا حماد يعني ابن زيد، ح وحدثني زهير بن، حرب حدثنا إسماعيل، - يعني ابن علية - كلاهما عن أيوب، ح وحدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني يونس، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة بن زيد الليثي، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا هشام، - يعني ابن سعد - كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث عبيد الله وقالوا جميعا ‏\"‏ له شىء يوصي فيه ‏\"‏ ‏.‏ إلا في حديث أيوب فإنه قال ‏\"‏ يريد أن يوصي فيه ‏\"‏ ‏.‏ كرواية يحيى عن عبيد الله ‏.‏",
      "text_en": " A hadith like this have been narrated on the authority of Nafi', who based his narrations of the words of Ibn 'Umar but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20022",
        "30022",
        "20208",
        "11015",
        "20029",
        "20475",
        "30492",
        "20029",
        "20500",
        "30375",
        "20172"
      ]
    },
    {
      "id": "sunan-abi-daud-394",
      "hadith_no": "394",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن أسامة بن زيد الليثي، أن ابن شهاب، أخبره أن عمر بن عبد العزيز كان قاعدا على المنبر فأخر العصر شيئا فقال له عروة بن الزبير أما إن جبريل صلى الله عليه وسلم قد أخبر محمدا صلى الله عليه وسلم بوقت الصلاة فقال له عمر اعلم ما تقول ‏.‏ فقال عروة سمعت بشير بن أبي مسعود يقول سمعت أبا مسعود الأنصاري يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ نزل جبريل صلى الله عليه وسلم فأخبرني بوقت الصلاة فصليت معه ثم صليت معه ثم صليت معه ثم صليت معه ثم صليت معه ‏\"‏ ‏.‏ يحسب بأصابعه خمس صلوات فرأيت رسول الله صلى الله عليه وسلم صلى الظهر حين تزول الشمس وربما أخرها حين يشتد الحر ورأيته يصلي العصر والشمس مرتفعة بيضاء قبل أن تدخلها الصفرة فينصرف الرجل من الصلاة فيأتي ذا الحليفة قبل غروب الشمس ويصلي المغرب حين تسقط الشمس ويصلي العشاء حين يسود الأفق وربما أخرها حتى يجتمع الناس وصلى الصبح مرة بغلس ثم صلى مرة أخرى فأسفر بها ثم كانت صلاته بعد ذلك التغليس حتى مات ولم يعد إلى أن يسفر ‏.‏ قال أبو داود وروى هذا الحديث عن الزهري معمر ومالك وابن عيينة وشعيب بن أبي حمزة والليث بن سعد وغيرهم لم يذكروا الوقت الذي صلى فيه ولم يفسروه وكذلك أيضا رواه هشام بن عروة وحبيب بن أبي مرزوق عن عروة نحو رواية معمر وأصحابه إلا أن حبيبا لم يذكر بشيرا وروى وهب بن كيسان عن جابر عن النبي صلى الله عليه وسلم وقت المغرب قال ثم جاءه للمغرب حين غابت الشمس - يعني من الغد - وقتا واحدا ‏.‏ قال أبو داود وكذلك روي عن أبي هريرة عن النبي صلى الله عليه وسلم قال ثم صلى بي المغرب يعني من الغد وقتا واحدا وكذلك روي عن عبد الله بن عمرو بن العاص من حديث حسان بن عطية عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\tIbn Shihab said:                      'Umar b. 'Abdul 'Aziz was sitting on the pulpit and he somewhat postponed the afternoon prayer. 'Urwah b. al-Zubair said to him: \"Gabriel informed Muhammed (ﷺ) of the time of prayer\". So 'Umar said to him: \"Be sure of what you are saying\". 'Urwah then replied: \"I heard Bashir b. Abu Mas'ud say that he heard Abu Mas'ud al-Ansari say that he heard the Messenger of Allah (ﷺ)\tsay: 'Gabriel came down and informed me of the time of prayer, and I prayed along with him, then prayed along with him, then I prayed along with him,  then I prayed along with him, then I prayed along with him, reckoning with his fingers five times of the prayer.' I saw the Messenger of Allah (ﷺ) offering the Duhr prayer when the sun had passed the meridian. Sometimes he would delay it when it was sever heat ; and I witnessed that he prayer the 'Asr prayer when the sun was high and bright before the yellowness had overcome it; then a man could go off after the prayer and reach Dhu'l-Hulaifah before the sunset, and he would pray Maghrib when the sun had set ; and he would pray the 'Isha prayer when darkness prevailed over the horizon; sometime he would delay it until the people assembled; and once he prayer the fair prayer in the darkness of dawn and at another time he prayed it when it became fairly light; but later on he continued to pray in the darkness of dawn until his death; he never prayed it again in the light of the dawn.\"Abu Dawud said: This tradition has been transmitted from al-Zuhri by Ma'mar, Malik, Ibn 'Uyainah, Shu'aib b. Abi Hamzah, and al-Laith b. Sa'd and others; but they did not mention the time in which he (the Prophet) had prayer, nor did they explain it. And similarly it has been narrated by Hisham b. 'Urwah and Habib b. Abu Mazruq from 'Urwah like the report of Ma'mar and his companions. But Habib did not make a mention of Bashir. And Wahb b. Kaisan reported on the authority of Jabir from the Prophet (ﷺ) the time of the Maghrib prayer. He said: \"Next day he (Gabriel) came to him at the time of the Maghrib prayer when the sun had already set. (He came both days) at the same time.\"Abu Dawud said: Similarly, this tradition has been transmitted by Abu Hurairah from the Prophet (ﷺ). He said: \"Then he (Gabriel) led me in the sunset prayer next day at the same time.\"Similarly, this tradition has been narrated through a different chain by 'Abd Allah b. 'Amr b. al-'As, through a chain from Hassan b. 'Atiyyah, from 'Amr b. Shu'aib, from his father, on the authority from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20500",
        "11013",
        "11010"
      ]
    },
    {
      "id": "sunan-abi-daud-3008",
      "hadith_no": "3008",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرني ابن وهب، أخبرني أسامة بن زيد الليثي، عن نافع، عن عبد الله بن عمر، قال لما افتتحت خيبر سألت يهود رسول الله صلى الله عليه وسلم أن يقرهم على أن يعملوا على النصف مما خرج منها فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقركم فيها على ذلك ما شئنا ‏\"‏ ‏.‏ فكانوا على ذلك وكان التمر يقسم على السهمان من نصف خيبر ويأخذ رسول الله صلى الله عليه وسلم الخمس وكان رسول الله صلى الله عليه وسلم أطعم كل امرأة من أزواجه من الخمس مائة وسق تمرا وعشرين وسقا شعيرا فلما أراد عمر إخراج اليهود أرسل إلى أزواج النبي صلى الله عليه وسلم فقال لهن من أحب منكن أن أقسم لها نخلا بخرصها مائة وسق فيكون لها أصلها وأرضها وماؤها ومن الزرع مزرعة خرص عشرين وسقا فعلنا ومن أحب أن نعزل الذي لها في الخمس كما هو فعلنا ‏.‏",
      "text_en": " ‘Abd Allah bin ‘Umar reported that ‘Umar said “When Khaibar was conquered, the Jews asked the Apostle of Allaah(ﷺ) to confirm that they would do all the cultivation and have half the produce. The Apostle of Allaah(ﷺ) said “I shall confirm you on that condition as long as we wish. So they were confirmed on that (condition). The dates from half the produce of Khaibar were divided into a number of portions. The Apostle of Allaah(ﷺ) would take the fifth. The Apostle of Allaah(ﷺ) used to contribute from the fifth one hundred wasqs of dates and twenty wasqs of wheat to each of his wives. When ‘Umar intended to expel the Jews from Khaibar he sent a message to the wives of the Prophet (ﷺ) and said to them “If any of you wishes that I divide the palm trees for her by their assessment that amounts one hundred wasqs (of dates) and to her belongs their root, their land and their water and (likewise) twenty wasqs from the produce of the cultivated land by assessment, I shall (do that). And if any of you wishes that we take out her portion from the fifth, we shall do (that).",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20500",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3135",
      "hadith_no": "3135",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، ح وحدثنا سليمان بن داود المهري، أخبرنا ابن وهب، - وهذا لفظه - أخبرني أسامة بن زيد الليثي، أن ابن شهاب، أخبره أن أنس بن مالك حدثهم أن شهداء أحد لم يغسلوا ودفنوا بدمائهم ولم يصل عليهم ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The martyrs of Uhud were not washed, and they were buried with their blood. No prayer was offered over them.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "30584",
        "20029",
        "20500",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4845",
      "hadith_no": "4845",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، قال أخبرني أسامة بن زيد الليثي، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل أن يفرق بين اثنين إلا بإذنهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: It is not lawful for a man to separate two persons except with their permission.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20500",
        "19934",
        "19911",
        "29"
      ]
    }
  ],
  "total_hadiths": 6
}