{
  "id": "20514",
  "name": "'Ayyad bin 'Abdullah عياض بن عبد الله بن عبد الرحمن",
  "full_name": "'Ayyad bin 'Abdullah عياض بن عبد الله بن عبد الرحمن",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  د  س  ق  -  لين الحديث ]"
    ],
    "tags": [
      "B.Fihr",
      "al-Madni",
      "Egypt"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11826",
      "name": "Ibrahim bin 'Ubaid bin Rifa'a إبراهيم بن عبيد بن رفاعة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11223",
      "name": "Mkhrmh bin Sulaiman al-Asady مخرمة بن سليمان الأسدي الوالبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-350-2",
      "hadith_no": "350",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، أخبرني عياض بن عبد الله، عن أبي الزبير، عن جابر بن عبد الله، عن أم كلثوم، عن عائشة، زوج النبي صلى الله عليه وسلم قالت إن رجلا سأل رسول الله صلى الله عليه وسلم عن الرجل يجامع أهله ثم يكسل هل عليهما الغسل وعائشة جالسة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأفعل ذلك أنا وهذه ثم نغتسل ‏\"‏ ‏.‏",
      "text_en": " 'A'isha the wife of the Apostle of Allah (may peace be upon him) reported. A person asked the Messenger of Allah (may peace be upon him) about one who has sexual intercourse with his wife and parts away (without orgasm) whether bathing is obligatory for him. 'A'isha was sitting by him. The Messenger of Allah (may peace be upon him) said:                      I and she (the Mother of the Faithful) do it and then take a bath.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "20029",
        "20514",
        "11263",
        "34",
        "10500"
      ]
    },
    {
      "id": "sahih-muslim-1826",
      "hadith_no": "1826",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عياض بن عبد الله الفهري، عن مخرمة بن سليمان، بهذا الإسناد وزاد ثم عمد إلى شجب من ماء فتسوك وتوضأ وأسبغ الوضوء ولم يهرق من الماء إلا قليلا ثم حركني فقمت ‏.‏ وسائر الحديث نحو حديث مالك ‏.‏",
      "text_en": " Ibn Abbas reported:                      I slept (one night) in the house of Maimuna, the wife of the Apostle of Allah (may peace be upon him), and the Apostle of Allah (may peace be upon him) was with her that night. He (after sleeping for half of the night got up and) then performed ablution and then stood up and observed prayer. I too stood on his left side. He took hold of me and made me stand on his right side. He (the Holy Prophet) observed thirteen rak'ahs on that night. The Messenger of Allah (may peace be upon him) then slept and snored and it was a habit with him to snore while sleeping. The Mu'adhdbin then came to him (to inform him about the prayer). He then went out and observed prayer without performing ablution. ('Amr said: Bukair b. Ashajj had narrated it to me )",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20514",
        "11223"
      ]
    },
    {
      "id": "sahih-muslim-2318",
      "hadith_no": "2318",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، أخبرني عياض بن عبد الله، عن أبي الزبير، عن جابر بن عبد الله، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ ليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس ذود من الإبل صدقة وليس فيما دون خمسة أوسق من التمر صدقة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is payable on less than five fiqiyas of silver, and on less than five heads of camels, and less than five wasqs of dates.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "20029",
        "20514",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-7140",
      "hadith_no": "7140",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عياض، - وهو ابن عبد الله الفهري - حدثني إبراهيم بن عبيد بن رفاعة، عن محمد بن كعب القرظي، عن  أبي صرمة، عن أبي أيوب الأنصاري، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لو أنكم لم تكن لكم ذنوب يغفرها الله لكم لجاء الله بقوم لهم ذنوب يغفرها لهم ‏\"‏ ‏.‏",
      "text_en": " Abu Ayyub Ansari reported that Allah's Messenger (may peace be upon him) said:                      If you were not to commit sins, Allah would have swept you out of existence and would have replaced you by another people who have committed sin, and then asked forgiveness from Allah, and He would have granted them pardon.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20514",
        "11826",
        "11221",
        "33"
      ]
    },
    {
      "id": "sunan-abi-daud-1290",
      "hadith_no": "1290",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا ابن وهب، حدثني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى ثماني ركعات يسلم من كل ركعتين ‏.‏ قال أبو داود قال أحمد بن صالح إن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى فذكر مثله ‏.‏ قال ابن السرح إن أم هانئ قالت دخل على رسول الله صلى الله عليه وسلم ولم يذكر سبحة الضحى بمعناه ‏.‏",
      "text_en": " Narrated Umm Hani ibn AbuTalib:                     The Messenger of Allah (ﷺ) prayed on the day of the Conquest (of Mecca) eight rak'ahs saluting after every two rak'ahs.Abu Dawud said: Ahmad b. Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Mecca, and he narrated something similar. Ibn al-Sarh reported that Umm Hani said: The Messenger of Allah (ﷺ) entered upon me. This version does not mention the prayer in the forenoon.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30485",
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    },
    {
      "id": "sunan-abi-daud-2250",
      "hadith_no": "2250",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن عياض بن عبد الله الفهري، وغيره، عن ابن شهاب، عن سهل بن سعد، في هذا الخبر قال فطلقها ثلاث تطليقات عند رسول الله صلى الله عليه وسلم فأنفذه رسول الله صلى الله عليه وسلم وكان ما صنع عند النبي صلى الله عليه وسلم سنة ‏.‏ قال سهل حضرت هذا عند رسول الله صلى الله عليه وسلم فمضت السنة بعد في المتلاعنين أن يفرق بينهما ثم لا يجتمعان أبدا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Sahl bin Sa’d Al Sa’idi through a different chain of narrators. This version has “He divorced her three times before the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) implemented it and what is done before the Prophet (ﷺ) is sunnah(model behavior of the Prophet).Sahl said “I attended this before the Messenger of Allah(ﷺ). Afterwards the sunnah about those who invoked curses on each other was established that they (the spouses) were separated from each other and they would never be united.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20514",
        "11013",
        "399"
      ]
    },
    {
      "id": "sunan-abi-daud-2763",
      "hadith_no": "2763",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال حدثتني أم هانئ بنت أبي طالب، أنها أجارت رجلا من المشركين يوم الفتح فأتت النبي صلى الله عليه وسلم فذكرت له ذلك فقال ‏\"‏ قد أجرنا من أجرت وأمنا من أمنت ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “Umm Hani daughter of Abu Talib told me that in the year of the conquest she gave protection to a man from the polytheists. She came to the Prophet (ﷺ) and mentioned it to him. He said “We have given security to those to whom you have given it.”",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20514",
        "11223",
        "11211",
        "17",
        "198"
      ]
    },
    {
      "id": "sunan-ibn-majah-1384",
      "hadith_no": "1384",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد بن رمح، أنبأنا ابن وهب، عن عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله  صلى الله عليه وسلم  يوم الفتح صلى سبحة الضحى ثماني ركعات سلم من كل ركعتين ‏.‏",
      "text_en": " It wasnarrated from Umm Hani’ bint Abu Talib that on the day of theConquest (of Makkah) the Messenger of Allah (ﷺ) prayed voluntaryDuha with eight Rak’ah, saying the Salam after each two Rak’ah.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    }
  ],
  "total_hadiths": 8
}