{
  "id": "20523",
  "name": "Abu Bakr bin Nafi' al-'Adwi, The Client أبو بكر بن نافع العدوي",
  "full_name": "Abu Bakr bin Nafi' al-'Adwi, The Client أبو بكر بن نافع العدوي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  ت  كن  -  صدوق ]"
    ],
    "tags": [
      "B.'Adi",
      "Client",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2957",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن بشار، وأبو بكر بن نافع قال ابن نافع أخبرنا غندر، حدثنا شعبة، قال سمعت أبا بشر، يحدث عن سعيد بن جبير، أنه سمع ابن عباس، - رضى الله عنهما - يحدث أن رجلا أتى النبي صلى الله عليه وسلم وهو محرم فوقع من ناقته فأقعصته فأمر النبي صلى الله عليه وسلم أن يغسل بماء وسدر وأن يكفن في ثوبين ولا يمس طيبا خارج رأسه ‏.‏ قال شعبة ثم حدثني به بعد ذلك خارج رأسه ووجهه فإنه يبعث يوم القيامة ملبدا ‏.‏",
      "text_en": " Sa'id b. Jubair heard Ibn 'Abbas (Allah be pleased with them) as saying:                      A person came to Allah's Apostle (may peace be upon him) while he was in the state of lhram. He fell down from his camel and broke his neck. Thereupon Allah's Apostle (may peace be upon him) commanded to bathe him with water (mixed with the leaves of) the lote (tree), and shroud him in two (pieces of) cloth and not to apply perfume (to him), keeping his head out (of the shroud). Shu'ba said: He then narrated to me after this (the words)\" keeping his head out,\" his face out, for he would be raised on the Day of Resurrection pronouncing Talbiya.",
      "chain": [
        "30160",
        "20523",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5151",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن بشار، وأبو بكر بن نافع قال ابن نافع أخبرنا غندر، حدثنا  شعبة، عن أبي بشر، عن سعيد بن جبير، قال سمعت ابن عباس، يقول أهدت خالتي أم حفيد إلى رسول الله صلى الله عليه وسلم سمنا وأقطا وأضبا فأكل من السمن والأقط وترك الضب تقذرا وأكل على مائدة رسول الله صلى الله عليه وسلم ولو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Sa'id b. Jubair reported that he heard Ibn 'Abbas says:                      The sister of my mother Umm Hufaid presented to Allah's Messenger (may peace be upon him) clarified butter (ghee), cheese and some lizards. He ate out of the clarified butter and cheese, but lett the lizard finding no liking for it. But it was eaten on the table of Allah's Messenger (may peace be upon him). Had it been forbidden (haram), it could not be eaten on the table of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30160",
        "20523",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثناه يحيى بن يحيى، حدثنا هشيم، ح وحدثنا إسحاق بن إبراهيم، أخبرنا  عبد الوهاب الثقفي، ح وحدثنا أبو بكر بن نافع، حدثنا غندر، حدثنا شعبة، ح وحدثنا  عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن سفيان، ح وحدثنا إسحاق، بن إبراهيم أخبرنا جرير، عن منصور، كل هؤلاء عن خالد الحذاء، بإسناد حديث ابن علية ومعنى حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Khalid al-Hadhdha' through different chains o transmitters.",
      "chain": [
        "30399",
        "20468",
        "30123",
        "20259",
        "20523",
        "20278",
        "20020",
        "30025",
        "30388",
        "20005",
        "30123",
        "4057"
      ]
    },
    {
      "hadith_no": "5890",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن حاتم، وأبو بكر بن نافع قالوا حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبيه، عن عباية بن رفاعة، حدثني  رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم فابردوها عنكم بالماء ‏\"‏ ‏.‏ ولم يذكر أبو بكر ‏\"‏ عنكم ‏\"‏ ‏.‏ وقال قال أخبرني رافع بن خديج ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The fever is due to the intense heat of Hell, so cool it down in your (bodies) with water. Aba Bakr has made no mention of the word\" from you\" ('ankum), but he said that Rafi' b. Khadij had informed him of it.",
      "chain": [
        "30201",
        "30170",
        "38487",
        "20523",
        "20033",
        "20005",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "6412",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، وأبو بكر بن نافع قال ابن نافع حدثنا غندر، حدثنا  شعبة، عن عدي، - وهو ابن ثابت - عن البراء، قال رأيت رسول الله صلى الله عليه وسلم واضعا الحسن بن علي على عاتقه وهو يقول ‏\"‏ اللهم إني أحبه فأحبه ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20523",
        "20278",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "6533",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن نافع، حدثنا بهز، حدثنا حماد، أخبرنا ثابت، عن أنس، قال أتى على رسول الله صلى الله عليه وسلم وأنا ألعب مع الغلمان - قال - فسلم علينا فبعثني إلى حاجة فأبطأت على أمي فلما جئت قالت ما حبسك قلت بعثني رسول الله صلى الله عليه وسلم لحاجة ‏.‏ قالت ما حاجته قلت إنها سر ‏.‏ قالت لا تحدثن بسر رسول الله صلى الله عليه وسلم أحدا ‏.‏ قال أنس والله لو حدثت به أحدا لحدثتك يا ثابت ‏.‏",
      "text_en": " Anas reported:                      Allah's Messenger (may peace be upon him) came to me as I was playing with playmates. He greeted and sent me on an errand and I made delay in going to my mother. When I came to her she said: What detained you? I said: Allah's Messenger (may peace be upon him) sent me on an errand. She said: What was the purpose? I said: It is something secret. Therupon she said: Do not then divulge the secret of Allah's Messenger (may peace be upon him) to anyone. Anas said: By Allah, if I were to divulge it to anyone, then, O Thabit, I would have divulged it to you.",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6543",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنيه زهير بن حرب، حدثنا عبد الرحمن، ح وحدثني أبو بكر بن نافع، حدثنا  غندر، ح وحدثنا ابن بشار، حدثنا محمد بن جعفر، وعبد الرحمن، كلهم عن شعبة، بهذا الإسناد مثله ‏.‏",
      "text_en": "",
      "chain": [
        "20033",
        "20523",
        "20278",
        "30160",
        "20173"
      ]
    },
    {
      "hadith_no": "6637",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، ح وحدثني أبو بكر بن نافع، حدثنا  غندر، عن شعبة، ح وحدثني حجاج بن الشاعر، حدثنا أبو الوليد، حدثنا أبو عوانة، كلاهما عن أبي بشر، بهذا الإسناد ‏.‏ مثله غير أن في حديث شعبة قال أبو هريرة فلا أدري مرتين أو ثلاثة ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Huraira through another chain of transmitters (but with this variation) that Abu Huraira said:                      I do not know whether he (the Holy Prophet) said (these words:\" Then next\" ) twice or thrice.",
      "chain": [
        "30160",
        "20173",
        "20523",
        "20278",
        "20020",
        "38834",
        "20296"
      ]
    },
    {
      "hadith_no": "6723",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ، أخبرني أبي ح، وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - كلهم عن شعبة، عن الأعمش، ح وحدثني أبو بكر بن نافع، حدثنا عبد الرحمن، ح وحدثنا ابن، نمير حدثنا مصعب بن المقدام، كلاهما عن سفيان، عن الأعمش، بإسناد جرير مثل حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'mash through other chains of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20276",
        "30126",
        "20173",
        "20020",
        "11060",
        "20523",
        "10530",
        "30212",
        "20608",
        "20012"
      ]
    },
    {
      "hadith_no": "6816",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن نافع، حدثنا بهز، حدثنا حماد، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Humaid with the same chain of transmitters.",
      "chain": [
        "20523",
        "20214"
      ]
    },
    {
      "hadith_no": "7063",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عقبة بن مكرم العمي، وأبو بكر بن نافع قالا حدثنا غندر، حدثنا شعبة، عن خالد، قال سمعت عبد الله بن الحارث، يحدث عن عبد الله بن عمر، أنه أمر رجلا إذا أخذ مضجعه قال ‏\"‏ اللهم خلقت نفسي وأنت توفاها لك مماتها ومحياها إن أحييتها فاحفظها وإن أمتها فاغفر لها اللهم إني أسألك العافية ‏\"‏ ‏.‏ فقال له رجل أسمعت هذا من عمر فقال من خير من عمر من رسول الله صلى الله عليه وسلم ‏.‏ قال ابن نافع في روايته عن عبد الله بن الحارث ‏.‏ ولم يذكر سمعت ‏.‏",
      "text_en": " Abdullah b. 'Umar commanded a person that as he went to bed, he should say:                     \" O Allah, Thou created my being and it is for Thee to take it to its ultimate goal. And its death and life is due to Thee, and if Thou givest it life, safeguard it; and if Thou bringst death, grant it pardon. O Allah, I beg of Thee safety.\" A person said to him: Did you hear it from Umar? Thereupon he said: (I have heard from one) who is better than Umar, viz. from Allah's Messenger (may peace be upon him). Ibn Nafi, reported this on the authority of Abdullah b. Harith but he did not make mention of this\" that he heard it himself\".",
      "chain": [
        "30441",
        "20523",
        "20278",
        "20020",
        "11282",
        "912",
        "18"
      ]
    },
    {
      "hadith_no": "7209",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، ح وحدثني أبو بكر بن نافع، حدثنا غندر، كلاهما عن شعبة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30022",
        "20031",
        "20523"
      ]
    },
    {
      "hadith_no": "7399",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وأبو بكر بن نافع قالوا حدثنا  عبد الرحمن، - يعنون ابن مهدي - عن سفيان، عن أبيه، عن خيثمة، عن البراء بن عازب، ‏{‏ يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة‏}‏ قال نزلت في عذاب القبر ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that this verse:                     \" Allah keeps steadfast those who believe with firm word in th;s world and the Hereafter,\" was revealed in con- nection with the torment of the grave.",
      "chain": [
        "30201",
        "30170",
        "20523",
        "10530",
        "20012",
        "20016",
        "11332",
        "400"
      ]
    },
    {
      "hadith_no": "7414",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن نافع، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن الأعمش، بهذا الإسناد ‏.‏ مثله وقال عن النبي صلى الله عليه وسلم ولم يقل سمعت ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of A'mash but with a slight variation of wording.",
      "chain": [
        "20523",
        "20033",
        "20012"
      ]
    },
    {
      "hadith_no": "7447",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثني أبو بكر، بن نافع حدثنا غندر، حدثنا شعبة، عن عدي بن ثابت، عن عبد الله بن يزيد، عن حذيفة، أنه قال أخبرني رسول الله صلى الله عليه وسلم بما هو كائن إلى أن تقوم الساعة فما منه شىء إلا قد سألته إلا أني لم أسأله ما يخرج أهل المدينة من المدينة",
      "text_en": " Hudhaifa reported:                      Allah's Messenger (may peace be upon him) informed me of what is going to happen before the approach of the Last Hour. And there is nothing that I did not ask him in this connection except this that I did not ask him as to what would turn the people of Medina out from Medina.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "20523",
        "20278",
        "20020",
        "11372",
        "1945",
        "145"
      ]
    },
    {
      "hadith_no": "7694",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثني محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا محمد بن جعفر، ح وحدثني أبو بكر بن نافع، أخبرنا غندر، قال شعبة حدثنا عن خالد الحذاء، عن عبد، الرحمن بن أبي بكرة عن أبيه، عن النبي صلى الله عليه وسلم أنه ذكر عنده رجل فقال رجل يا رسول الله ما من رجل بعد رسول الله صلى الله عليه وسلم أفضل منه في كذا وكذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ويحك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا يقول ذلك ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان أحدكم مادحا أخاه لا محالة فليقل أحسب فلانا إن كان يرى أنه كذلك ولا أزكي على الله أحدا ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman b. Abu Bakra reported on the authority of his father that a person was mentioned in the presence of Allah's Apostle (may peace be upon him), and a person said:                      Allah's Messenger, no person is more excellent than he after Allah's Messenger (may peace be upon him). Thereupon Allah's Apostle (may peace be upon him) said: Woe be to thee, you have broken the neck of your friend, and he said this twice. Then Allah's Messenger (may peace be upon him) said: If anyone has to praise his brother at all, he should say: I think him to be so and so, and even on this he should say: I do not consider anyone purer than Allah (considers). This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording.",
      "chain": [
        "30452",
        "20173",
        "20523",
        "20278",
        "20020",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "813",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز بن أسد، قال حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ استووا استووا استووا فوالذي نفسي بيده إني لأراكم من خلفي كما أراكم من بين يدى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Prophet (ﷺ) used to say:                      \"Make your rows straight, make your rows straight, make your rows straight. By the One in Whose Hand is my soul! I can see you behind me as I can see you in front of me.\"",
      "chain": [
        "20523",
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3160",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز، قال حدثنا حماد، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤتى بالرجل من أهل الجنة فيقول الله عز وجل يا ابن آدم كيف وجدت منزلك فيقول أى رب خير منزل ‏.‏ فيقول سل وتمن فيقول أسألك أن تردني إلى الدنيا فأقتل في سبيلك عشر مرات لما يرى من فضل الشهادة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Messenger of Allah (ﷺ) said: 'A man from among the people of Paradise will be brought and Allah, the Mighty and Sublime, will say: \"O son of Adam, how do you find your place (in Paradise)?\" He would say: \"O Lord, it is the best place.\" He will say: \"Ask and wish (for whatever you want).\" He would say: \"I ask You to send me back to the world so that I may be killed in Your cause ten time\" - because of what be sees of the virtue of martyrdom.'\"",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3373",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز بن أسد، قال حدثنا حماد، قال حدثنا ثابت، عن أنس، أن عبد الرحمن بن عوف، جاء وعليه ردع من زعفران فقال رسول الله صلى الله عليه وسلم ‏\"‏ مهيم ‏\"‏ ‏.‏ قال تزوجت امرأة ‏.‏ قال ‏\"‏ وما أصدقت ‏\"‏ ‏.‏ قال وزن نواة من ذهب ‏.‏ قال ‏\"‏ أولم ولو بشاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that 'Abdur-Rahman bin 'Awf came with a trace of saffron on him, and the Messenger of Allah said:                      \"What's this for?\" He said: \"I have married a woman.\" He said: \"What dowry did you give?\" He said: \"The weight of a Nawah (five Dirhams) of gold.\" He said: \"Give a Walimah (wedding feast) even if it is with one sheep.\"",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3436",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز، قال حدثنا حماد بن سلمة، قال حدثنا ثابت، عن أنس، قال كان لرسول الله صلى الله عليه وسلم جار فارسي طيب المرقة فأتى رسول الله صلى الله عليه وسلم ذات يوم وعنده عائشة فأومأ إليه بيده أن تعال وأومأ رسول الله صلى الله عليه وسلم إلى عائشة أى وهذه فأومأ إليه الآخر هكذا بيده أن لا مرتين أو ثلاثا ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Messenger of Allah had a Persian neighbor who was good at making soup. He came to the Messenger of Allah one day when 'Aishah was with him, and gestured to him with his hand to come. The Messenger of Allah gestured toward 'Aishah -meaning: 'What about her?'- and the man gestured to him like this, meaning, 'No,' two or three times.\"",
      "chain": [
        "20523",
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3602",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز، قال حدثنا حماد، قال حدثنا ثابت، عن أنس، قال لما نزلت هذه الآية ‏{‏ لن تنالوا البر حتى تنفقوا مما تحبون ‏}‏ قال أبو طلحة إن ربنا ليسألنا عن أموالنا فأشهدك يا رسول الله أني قد جعلت أرضي لله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها في قرابتك في حسان بن ثابت وأبى بن كعب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"When this Verse was revealed -'By no means shall you attain Al Birr (piety, righteousness--here it means Allah's reward, i.e. Paradise), unless you spend (in Allah's cause) of that which you love'- Abu Talha said: 'Our Lord will ask us about our wealth. I adjure you, O Messenger of Allah! I am giving my land to Allah.' The Messenger of Allah said: 'Make it for your relatives, Hassan bin Thabit and Ubayy bin Ka'b.'\"",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5034",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا أبو بكر بن نافع قال حدثنا عمر بن علي عن معن بن محمد عن سعيد عن أبي هريرة قال  قال رسول الله صلى الله عليه وسلم إن هذا الدين يسر ولن يشاد الدين أحد إلا غلبه فسددوا وقاربوا وأبشروا ويسروا واستعينوا بالغدوة والروحة وشيء من الدلجة",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Indeed, this religion is easy, and no one will ever overburden himself in religion, except that it will overcome him. So seek what is appropriate, and come as close as you can, and receive the glad tidings (that you will be rewarded), and take it easy; and gain strength by worshipping in the mornings, afternoons, and during the last hours of the nights.'\"",
      "chain": [
        "20523",
        "20265",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "5285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز بن أسد، قال حدثنا حماد، قال حدثنا ثابت، أنهم سألوا أنسا عن خاتم، رسول الله صلى الله عليه وسلم قال كأني أنظر إلى وبيص خاتمه من فضة ‏.‏ ورفع إصبعه اليسرى الخنصر ‏.‏",
      "text_en": " Thabit narrated that :                     They asked Anas about the ring of the Messenger of Allah [SAW] and he said: \"It is as if I can see the shining of his silver ring, and he raised his right little finger.\"",
      "chain": [
        "20523",
        "20214",
        "20022"
      ]
    }
  ],
  "total_hadiths": 23
}