{
  "id": "20524",
  "name": "'Abdullah bin al-Harith bin 'Abdul Malik عبد الله بن الحارث بن عبد الملك",
  "full_name": "'Abdullah bin al-Harith bin 'Abdul Malik عبد الله بن الحارث بن عبد الملك",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22058",
      "name": "al-Zubair bin Sa'id bin Sulaiman الزبير بن سعيد بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11558",
      "name": "Syf bin Sulaiman سيف بن سليمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20504",
      "name": "al-Dahhak bin 'Uthman bin 'Abdullah الضحاك بن عثمان بن عبد الله بن خالد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "23023",
      "name": "Talha bin 'Amr bin 'Uthman طلحة بن عمرو بن عثمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28459",
      "name": "'Anbasa bin 'Abdur Rahman bin 'Uayna عنبسة بن عبد الرحمن بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38137",
      "name": "Hamd bin Yahya bin Han'i حامد بن يحيى بن هانئ",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "32048",
      "name": "Y'aqub bin Hmyd bin Kasb يعقوب بن حميد بن كاسب المدني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34159",
      "name": "'Amr bin al-Hbab عمرو بن الحباب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الله بن الحارث المخزومي، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ غلظ القلوب والجفاء في المشرق والإيمان في أهل الحجاز ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Jabir b. Abdullah that the Messenger of Allah (may peace and, blessings be upon him) observed:                      The callousness of heart and sternness is in the East and faith is among the people of the Hijaz.",
      "chain": [
        "30123",
        "20524",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3926",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عبد الله بن الحارث المخزومي، حدثنا الضحاك، بن عثمان عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي هريرة، أنه قال لمروان أحللت بيع الربا ‏.‏ فقال مروان ما فعلت ‏.‏ فقال أبو هريرة أحللت بيع الصكاك وقد نهى رسول الله صلى الله عليه وسلم عن بيع الطعام حتى يستوفى ‏.‏ قال فخطب مروان الناس فنهى عن بيعها ‏.‏ قال سليمان فنظرت إلى حرس يأخذونها من أيدي الناس ‏.‏",
      "text_en": " Abu Huraira (Allah be please with him) is reported to have said to Marwan:                      Have you made lawful the transactions involving interest? Thereupon Marwan said: I have not done that. Thereupon Abu Huraira (may peace be upon him) said: You have made lawful the transactions with the help of documents only, whereas Allah's Messenger (may peace be upon him) forbade the transaction of foodgrains until full possession is taken of them. Marwan then addressed the people and forbade them to enter into such transactions (as are done with the help of documents). Sulaiman said: I saw the sentinels snatching (these documents) from the people.",
      "chain": [
        "30123",
        "20524",
        "20504",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "5299",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الله بن الحارث المخزومي، عن حنظلة بن أبي سفيان، عن سالم بن عبد الله، قال سمعت ابن عمر، يحدث أن عمر، خرج فرأى حلة إستبرق تباع في السوق فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله اشترها فالبسها يوم الجمعة وحين يقدم عليك الوفد ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما يلبس هذا من لا خلاق له ‏\"‏ ‏.‏ ثم أتي رسول الله صلى الله عليه وسلم بثلاث حلل منها فكسا عمر حلة وكسا عليا حلة وكسا أسامة حلة فأتاه فقال يا رسول الله قلت فيها ما قلت ثم بعثت إلى ‏.‏ فقال ‏\"‏ بعها واقض بها حاجتك أو شققها خمرا بين نسائك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar narrated that:                     'Umar went out and saw a Hullah of Al-Istabraq being offered for sale in the marketplace. He went to the Messenger of Allah [SAW] and said: \"O Messenger of Allah, buy this and wear it on Fridays, and when the delegations come to you.\" The Messenger of Allah [SAW] said: \"This is only worn by the one who has no share (in the Hereafter).\" Then three Hullahs (of the same fabric) were brought to the Messenger of Allah [SAW] and he gave one to 'Umar, one to 'Ali and one to Usamah. He ('Umar) came to him and said: \"O Messenger of Allah, you said what you said about it, then you sent one to me!\" He said: \"Sell it and spend the money on your needs, or cut it into pieces for your womenfolk to use as head covers.\"",
      "chain": [
        "30123",
        "20524",
        "11243",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1936",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد الله بن الحارث المخزومي، عن طلحة، عن عطاء، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ انكحوا فإني مكاثر بكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah said: “Marry, for I will boast of your great numbers.”",
      "chain": [
        "32048",
        "20524",
        "11356",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "2370",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو إسحاق الهروي، إبراهيم بن عبد الله بن حاتم حدثنا عبد الله بن الحارث المخزومي، حدثنا سيف بن سليمان المكي، أخبرني قيس بن سعد، عن عمرو بن دينار، عن ابن عباس، قال قضى رسول الله صلى الله عليه وسلم بالشاهد واليمين ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     “The Messenger of Allah (ﷺ) passed judgement on the basis of a witness along with an oath by the claimant.",
      "chain": [
        "20524",
        "11558",
        "172",
        "11081",
        "17"
      ]
    }
  ],
  "total_hadiths": 5
}