{
  "id": "20547",
  "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
  "full_name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "204",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Iran",
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خت  م  4  -  ثقة حافظ ]"
    ],
    "tags": [
      "Client",
      "Ally B.Asad",
      "al-Basri",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20534",
      "name": "Habib bin Abi Habib حبيب بن أبي حبيب الجرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20220",
      "name": "Harb bin Shadaad al-Yashkari حرب بن شداد اليشكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24180",
      "name": "Sulaiman bin Qrm سليمان بن قرم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10690",
      "name": "Salah bin Rastum, Abu 'Amir al-Khazaz صالح بن رستم المزني أبو عامر الخزاز",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20718",
      "name": "'Imran bin Da'ud al-'Ami Abu al-'Awwam عمران بن داود العمي أبو العوام القطان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11564",
      "name": "Ma'ruf bin Kharbudh معروف بن خربوذ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20635",
      "name": "Muhammad bin Muslim bin Abi al-Wadah محمد بن مسلم بن أبي الوضاح",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30136",
      "name": "Zayd bin Akhzm زيد بن أخزم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30161",
      "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37987",
      "name": "Yonus bin Habib bin Abd يونس بن حبيب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "74",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن الحلواني، قال حدثنا نعيم بن حماد، قال أبو إسحاق إبراهيم بن محمد بن سفيان وحدثنا محمد بن يحيى، قال حدثنا نعيم بن حماد، حدثنا أبو داود الطيالسي، عن شعبة، عن يونس بن عبيد، قال كان عمرو بن عبيد يكذب في الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "30238",
        "11222",
        "30238",
        "20547",
        "20020",
        "11075",
        "24341"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو داود الطيالسي، عن شعبة، عن سماك، عن جابر بن سمرة، ‏.‏ أن النبي صلى الله عليه وسلم كان يقرأ في الظهر ب ‏{‏ سبح اسم ربك الأعلى‏}‏ وفي الصبح بأطول من ذلك ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the noon prayer:\" Glorify the name of thy Most High Lord in the morning prayer longer than this\" (lxxxvii.)",
      "chain": [
        "30201",
        "20547",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2964",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الطيالسي، حدثنا حبيب بن يزيد، عن عمرو بن هرم، عن سعيد بن جبير، وعكرمة، عن ابن عباس، رضى الله عنهما أن ضباعة، أرادت الحج فأمرها النبي صلى الله عليه وسلم أن تشترط ففعلت ذلك عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with him) reported that Duba'a intended to perform Hajj. and the Apostle of Allah (may peace be upon him) commanded her (to enter into the state of Ihram) with condition. She did it in compliance with the com- mand of Allah's Apostle (may peace be upon him).",
      "chain": [
        "30524",
        "20547",
        "20534",
        "10708",
        "11050",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3210",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وأبو داود الطيالسي عن شعبة، عن يحيى بن الحصين، عن جدته، أنها سمعت النبي صلى الله عليه وسلم في حجة الوداع دعا للمحلقين ثلاثا وللمقصرين مرة ‏.‏ ولم يقل وكيع في حجة الوداع ‏.‏",
      "text_en": " Yahya b. al-Husain reported on the authority of his grandfather that Allah's Apostle (may peace be upon him) invoked blessing on the occasion of the Farewell Pilgrimage three times for those who got their heads shaved and once for those who got their hair clipped. In the narration transmitted by Waki' there is no mention of the Farewell Pilgrimage.",
      "chain": [
        "30201",
        "20032",
        "20547",
        "20020",
        "19143"
      ]
    },
    {
      "hadith_no": "6597",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا أبو داود الطيالسي، حدثنا حرب بن شداد، عن يحيى، حدثني أبو سلمة، حدثني ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ مثل حديث هؤلاء عن ابن عمر ‏.‏",
      "text_en": " Abu Ayyub reported Allah's Messenger (may peace be upon him) as saying:                      The tribes of Ansar, Muzaina and Juhaina and Ghifar and Ashja' and those from Banu 'Abdullah, they are my friends amongst the people and Allah and His Messenger are their protectors.",
      "chain": [
        "20547",
        "20220",
        "11449",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "7431",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا أبو داود الطيالسي، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ تكون فتنة النائم فيها خير من اليقظان واليقظان فيها خير من القائم والقائم فيها خير من الساعي فمن وجد ملجأ أو معاذا فليستعذ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      There would be turmoil and the one who would sleep would be better than who would be awake and the one who would be awake would be better than one who would stand and one who would stand would be better than one who would run. So he who finds refuge or shelter should take that refuge or shelter.",
      "chain": [
        "30313",
        "20547",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "82",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو داود، - يعني الطيالسي - حدثنا شعبة، عن عاصم، عن أبي حاجب، عن الحكم بن عمرو، وهو الأقرع أن النبي صلى الله عليه وسلم نهى أن يتوضأ الرجل بفضل طهور المرأة ‏.‏",
      "text_en": " Narrated Hakam ibn Amr:                     The Prophet (ﷺ) forbade that the male should perform ablution with the water left over by the female.",
      "chain": [
        "30160",
        "20547",
        "20020",
        "11080"
      ]
    },
    {
      "hadith_no": "1391",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حفص أبو عبد الرحمن القطان، خال عيسى بن شاذان أخبرنا أبو داود، أخبرنا الحريش بن سليم، عن طلحة بن مصرف، عن خيثمة، عن عبد الله بن عمرو، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ القرآن في شهر ‏\"‏ ‏.‏ قال إن بي قوة ‏.‏ قال ‏\"‏ اقرأه في ثلاث ‏\"‏ ‏.‏ قال أبو علي سمعت أبا داود يقول سمعت أحمد - يعني ابن حنبل - يقول عيسى بن شاذان كيس ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKhaithamah reported that 'Abd Allah b. 'Amr said:                      The Messenger of Allah (ﷺ) said to me: Recite the Qur'an in one month. I said: I have (more) energy. He said: Recite it in three daysAbu 'Ali said: I heard Abu Dawud say: I heard Ahmad b. Hanbal say: The narrator 'Isa b. Shadhan is a sane person.",
      "chain": [
        "34197",
        "20547",
        "25050",
        "11356",
        "11332",
        "29"
      ]
    },
    {
      "hadith_no": "1432",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن المثنى، حدثنا أبو داود، حدثنا أبان بن يزيد، عن قتادة، عن أبي سعيد، - من أزد شنوءة - عن أبي هريرة، قال أوصاني خليلي صلى الله عليه وسلم بثلاث لا أدعهن في سفر ولا حضر ركعتى الضحى وصوم ثلاثة أيام من الشهر وأن لا أنام إلا على وتر ‏.‏",
      "text_en": " Abu Hurairah said:                      My friend (i.e. the Prophet) instructed me to observe three practices that I do not leave while traveling nor while resident, to pray two rak'ahs in the forenoon, to fast three days every month and not to sleep but after observing the with.",
      "chain": [
        "30170",
        "20547",
        "20205",
        "11019",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "3523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، هو الطيالسي حدثنا ابن أبي ذئب، عن أبي المعتمر، عن عمر بن خلدة، قال أتينا أبا هريرة في صاحب لنا أفلس فقال لأقضين فيكم بقضاء رسول الله صلى الله عليه وسلم ‏\"‏ من أفلس أو مات فوجد رجل متاعه بعينه فهو أحق به ‏\"‏ ‏.‏",
      "text_en": " Umar ibn Khaldah said:                      We came to AbuHurayrah who had become insolvent. He said: I shall decide between you on the basis of the decision of the Messenger of Allah (ﷺ): If anyone becomes insolvent or dies and the man (the seller) finds his very property with him, he is more entitled to it (than others).",
      "chain": [
        "30160",
        "20547",
        "20177"
      ]
    },
    {
      "hadith_no": "4772",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الطيالسي، وسليمان بن داود، - يعني أبا أيوب الهاشمي - عن إبراهيم بن سعد، عن أبيه، عن أبي عبيدة بن محمد بن عمار بن ياسر، عن طلحة بن عبد الله بن عوف، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من قتل دون ماله فهو شهيد، ومن قتل دون أهله أو دون دمه أو دون دينه فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd:                     The Prophet (ﷺ) said: He who is killed while protecting his property is a martyr, and he who is killed while defending his family, or his blood, or his religion is a martyr.",
      "chain": [
        "30524",
        "20547",
        "30584",
        "20150",
        "11063",
        "19954",
        "11043",
        "11"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا خارجة بن مصعب، عن يونس بن عبيد، عن الحسن، عن عتى بن ضمرة السعدي، عن أبى بن كعب، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن للوضوء شيطانا يقال له الولهان فاتقوا وسواس الماء ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وعبد الله بن مغفل ‏.‏ قال أبو عيسى حديث أبى بن كعب حديث غريب وليس إسناده بالقوي والصحيح عند أهل الحديث لأنا لا نعلم أحدا أسنده غير خارجة ‏.‏ وقد روي هذا الحديث من غير وجه عن الحسن قوله ولا يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء ‏.‏ وخارجة ليس بالقوي عند أصحابنا وضعفه ابن المبارك ‏.‏",
      "text_en": " Ubayy bin Ka'b narrated that :                     the Prophet said: \"Indeed there is a Shaitan for Wudu' who is called \"AI-Walahan.\" So beware of having misgivings about water.\"",
      "chain": [
        "30160",
        "20547",
        "28147",
        "11075",
        "11016",
        "39"
      ]
    },
    {
      "hadith_no": "158",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، قال أنبأنا شعبة، عن مهاجر أبي الحسن، عن زيد بن وهب، عن أبي ذر، أن رسول الله صلى الله عليه وسلم كان في سفر ومعه بلال فأراد بلال أن يقيم فقال ‏\"‏ أبرد ‏\"‏ ‏.‏ ثم أراد أن يقيم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبرد في الظهر ‏\"‏ ‏.‏ قال حتى رأينا فىء التلول ثم أقام فصلى فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن شدة الحر من فيح جهنم فأبردوا عن الصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"Allah's Messenger was on a journey and Bilal was with him. So he wanted to call for the prayer, but he (the Prophet) said: 'Let it get cooler.' Then he wanted to call for the prayer, so Allah's Messenger said: 'Let it get to the cooler time of Zuhr.'\" He (i.e., Abu Dharr) said: \"Until we saw the shadows of the hillocks, then he commanded that the Iqamah be called and then led the people in prayer. Allah's Messenger said: 'The severity of heat is from the raging of Hell, so wait until it becomes cooler for the (Zuhr) prayer.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، وأبو النضر، عن محمد بن طلحة بن مصرف، عن زبيد، عن مرة الهمداني، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الوسطى صلاة العصر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     Allah's Messenger said: \"Salatul-Wusta is the Asr prayer.\"",
      "chain": [
        "30277",
        "20547",
        "20390",
        "20604",
        "11335",
        "9759",
        "16"
      ]
    },
    {
      "hadith_no": "266",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، حدثنا عبد العزيز بن عبد الله بن أبي سلمة الماجشون، حدثني عمي، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، قال كان رسول الله صلى الله عليه وسلم إذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ملء السموات وملء الأرض وملء ما بينهما وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وابن عباس وابن أبي أوفى وأبي جحيفة وأبي سعيد ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وبه يقول الشافعي قال يقول هذا في المكتوبة والتطوع ‏.‏ وقال بعض أهل الكوفة يقول هذا في صلاة التطوع ولا يقولها في صلاة المكتوبة ‏.‏ قال أبو عيسى وإنما يقال الماجشوني لأنه من ولد الماجشون ‏.‏",
      "text_en": " Ali bin Abi Talib narrated:                     \"When Allah's Messenger would raise his head from bowing he would say: (Sami Allahi liman hamidal. Rabba na lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'a ma bainahuma wa mil'a ma shi'ia min shay'in ba'd) 'Allah listens to those who praise Him. O our Lord! And to You is the praise that fills the heavens and fills the earth, and fills what is between them, and fills whatever there is beyond that You will.' He said: There are narrations on this topic from Ibn Umar, Ibn Abbas, Ibn Abi Awfa, Abu Juhaifa, and Abu Sa'eed.",
      "chain": [
        "30277",
        "20547",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، - هو الطيالسي حدثنا شعبة، أخبرنا سعد بن إبراهيم، قال سمعت أبا عبيدة بن عبد الله بن مسعود، يحدث عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا جلس في الركعتين الأوليين كأنه على الرضف ‏.‏ قال شعبة ثم حرك سعد شفتيه بشيء فأقول حتى يقوم فيقول حتى يقوم ‏.‏ قال أبو عيسى هذا حديث حسن إلا أن أبا عبيدة لم يسمع من أبيه ‏.‏ والعمل على هذا عند أهل العلم يختارون أن لا يطيل الرجل القعود في الركعتين الأوليين ولا يزيد على التشهد شيئا ‏.‏ وقالوا إن زاد على التشهد فعليه سجدتا السهو ‏.‏ هكذا روي عن الشعبي وغيره ‏.‏",
      "text_en": " Ubaidullah bin Abdullah bin Mas'ud narrated from his father (Abdullah bin Mas'ud) that he said:                     \"When Allah's Messenger sat for the first two Rak'ah it was as if he was on hot stones.\" Shu'bah (one of the narrators) said: \"Then Sa'd's lips moved (saying) something. So I said: 'Until he stood?' He said: 'Until he stood.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11063",
        "15681",
        "16"
      ]
    },
    {
      "hadith_no": "409",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي البصري حدثنا أبو داود الطيالسي، حدثنا زهير بن معاوية، عن أبي الزبير، عن جابر، قال كنا مع النبي صلى الله عليه وسلم في سفر فأصابنا مطر فقال النبي صلى الله عليه وسلم ‏\"‏ من شاء فليصل في رحله ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وسمرة وأبي المليح عن أبيه وعبد الرحمن بن سمرة ‏.‏ قال أبو عيسى حديث جابر حديث حسن صحيح ‏.‏ وقد رخص أهل العلم في القعود عن الجماعة والجمعة في المطر والطين وبه يقول أحمد وإسحاق ‏.‏ قال أبو عيسى سمعت أبا زرعة يقول روى عفان بن مسلم عن عمرو بن علي حديثا ‏.‏ وقال أبو زرعة لم نر بالبصرة أحفظ من هؤلاء الثلاثة علي بن المديني وابن الشاذكوني وعمرو بن علي ‏.‏ وأبو المليح اسمه عامر ويقال زيد بن أسامة بن عمير الهذلي ‏.‏",
      "text_en": " Jabir narrated:                     \"We were with the Prophet (S) on a journey when it started to rain on us, so the Prophet (S) said: 'Whoever wishes, let him perform Salat in his place.'\"",
      "chain": [
        "30286",
        "20547",
        "20321",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، ومحمود بن غيلان، وأحمد بن إبراهيم الدورقي، وغير، واحد، قالوا حدثنا أبو داود الطيالسي، حدثنا محمد بن مسلم بن مهران، سمع جده، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ رحم الله امرأ صلى قبل العصر أربعا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب حسن ‏.‏",
      "text_en": " Ibn Umar narrated that :                     The Prophet (S) said: \"May Allah have mercy upon a man who prays four before Al-Asr.\"",
      "chain": [
        "30221",
        "30277",
        "30494",
        "20547",
        "167",
        "18"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو داود الطيالسي، حدثنا محمد بن مسلم بن أبي الوضاح، هو أبو سعيد المؤدب عن عبد الكريم الجزري، عن مجاهد، عن عبد الله بن السائب، أن رسول الله صلى الله عليه وسلم كان يصلي أربعا بعد أن تزول الشمس قبل الظهر وقال ‏\"‏ إنها ساعة تفتح فيها أبواب السماء وأحب أن يصعد لي فيها عمل صالح ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي أيوب ‏.‏ قال أبو عيسى حديث عبد الله بن السائب حديث حسن غريب ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يصلي أربع ركعات بعد الزوال لا يسلم إلا في آخرهن ‏.‏",
      "text_en": " Abdullah bin As-Sa'ib narrated:                     \"Allah's Messenger would pray four (Rak'ah) after the Zawal of the sun before Az-Zuhr. He said: 'It is an hour in which the gates of the heavens are opened, and I love that a righteous deed should be raised up for me in it.'\"",
      "chain": [
        "20547",
        "167",
        "18655",
        "11028",
        "2065"
      ]
    },
    {
      "hadith_no": "504",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا أبو داود الطيالسي، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن أنس، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال وفي الباب عن سلمة بن الأكوع وجابر والزبير بن العوام ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ وهو الذي أجمع عليه أكثر أهل العلم أن وقت الجمعة إذا زالت الشمس كوقت الظهر ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ ورأى بعضهم أن صلاة الجمعة إذا صليت قبل الزوال أنها تجوز أيضا ‏.‏ وقال أحمد ومن صلاها قبل الزوال فإنه لم ير عليه إعادة ‏.‏",
      "text_en": " (Another chain) from Anas, :                     from the Prophet, similarly.",
      "chain": [
        "30221",
        "20547",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "517",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا جرير بن حازم، عن ثابت، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم يكلم بالحاجة إذا نزل عن المنبر ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث جرير بن حازم ‏.‏ قال وسمعت محمدا يقول وهم جرير بن حازم في هذا الحديث والصحيح ما روي عن ثابت عن أنس قال أقيمت الصلاة فأخذ رجل بيد النبي صلى الله عليه وسلم فما زال يكلمه حتى نعس بعض القوم ‏.‏ قال محمد والحديث هو هذا ‏.‏ وجرير بن حازم ربما يهم في الشىء وهو صدوق ‏.‏ قال محمد وهم جرير بن حازم في حديث ثابت عن أنس عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني ‏\"‏ ‏.‏ قال محمد ويروى عن حماد بن زيد قال كنا عند ثابت البناني فحدث حجاج الصواف عن يحيى بن أبي كثير عن عبد الله بن أبي قتادة عن أبيه عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني ‏\"‏ ‏.‏ فوهم جرير فظن أن ثابتا حدثهم عن أنس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"Allah's Messenger would talk as necessary after descending from the Minbar.\"",
      "chain": [
        "30160",
        "20547",
        "11272",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "537",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، قال أنبأنا شعبة، عن عدي بن ثابت، قال سمعت سعيد بن جبير، يحدث عن ابن عباس، أن النبي صلى الله عليه وسلم خرج يوم الفطر فصلى ركعتين ثم لم يصل قبلها ولا بعدها ‏.‏ قال وفي الباب عن عبد الله بن عمر وعبد الله بن عمرو وأبي سعيد ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وبه يقول الشافعي وأحمد وإسحاق ‏.‏ وقد رأى طائفة من أهل العلم الصلاة بعد صلاة العيدين وقبلها من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet went out on the day of Al-Fitr, so he prayed two Rak'ah, then he did not pray before it nor after it.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "643",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، أخبرنا شعبة، أخبرني خبيب بن عبد الرحمن، قال سمعت عبد الرحمن بن مسعود بن نيار، يقول جاء سهل بن أبي حثمة إلى مجلسنا فحدث أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ إذا خرصتم فخذوا ودعوا الثلث فإن لم تدعوا الثلث فدعوا الربع ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعتاب بن أسيد وابن عباس ‏.‏ قال أبو عيسى والعمل على حديث سهل بن أبي حثمة عند أكثر أهل العلم في الخرص وبحديث سهل بن أبي حثمة يقول أحمد وإسحاق ‏.‏ والخرص إذا أدركت الثمار من الرطب والعنب مما فيه الزكاة بعث السلطان خارصا يخرص عليهم ‏.‏ والخرص أن ينظر من يبصر ذلك فيقول يخرج من هذا من الزبيب كذا وكذا ومن التمر كذا وكذا فيحصى عليهم وينظر مبلغ العشر من ذلك فيثبت عليهم ثم يخلي بينهم وبين الثمار فيصنعون ما أحبوا فإذا أدركت الثمار أخذ منهم العشر ‏.‏ هكذا فسره بعض أهل العلم وبهذا يقول مالك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abdur-Rahman bin Mas'ud bin Niyar said:                     \"Sahl bin Abi Hathmah came to a gathering of ours, and he narrated that the Messenger of Allah would say: \"When you make an assessment, then take it and leave a third, if you do not leave a third, then leave a quarter.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11159",
        "12301"
      ]
    },
    {
      "hadith_no": "652",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر، محمد بن بشار حدثنا أبو داود الطيالسي، حدثنا سفيان بن سعيد، ح وحدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان، عن سعد بن إبراهيم، عن ريحان بن يزيد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وحبشي بن جنادة وقبيصة بن مخارق ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن ‏.‏ وقد روى شعبة عن سعد بن إبراهيم هذا الحديث بهذا الإسناد ولم يرفعه ‏.‏ وقد روي في غير هذا الحديث عن النبي صلى الله عليه وسلم ‏\"‏ لا تحل المسألة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ وإذا كان الرجل قويا محتاجا ولم يكن عنده شيء فتصدق عليه أجزأ عن المتصدق عند أهل العلم ووجه هذا الحديث عند بعض أهل العلم على المسألة ‏.‏",
      "text_en": " Abdullah bin Amr narrated that :                     the Prophet said: \"Charity is not lawful for the rich nor for the physically fit.\"",
      "chain": [
        "20547",
        "20012",
        "30277",
        "20121",
        "20005",
        "11063",
        "29"
      ]
    },
    {
      "hadith_no": "703",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا أبو داود الطيالسي، حدثنا هشام الدستوائي، عن قتادة، عن أنس بن مالك، عن زيد بن ثابت، قال تسحرنا مع النبي صلى الله عليه وسلم ثم قمنا إلى الصلاة ‏.‏ قال قلت كم كان قدر ذلك قال قدر خمسين آية ‏.‏",
      "text_en": " Anas (bin Malik) narrated that :                     Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"",
      "chain": [
        "30221",
        "20547",
        "20295",
        "11019",
        "19",
        "49"
      ]
    },
    {
      "hadith_no": "914",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن موسى الجرشي البصري، حدثنا أبو داود الطيالسي، حدثنا همام، عن قتادة، عن خلاس بن عمرو، عن علي، قال نهى رسول الله صلى الله عليه وسلم أن تحلق المرأة رأسها ‏.‏",
      "text_en": " Ali narrated:                     \"The Messenger of Allah prohibited that a woman should shave her head.\"",
      "chain": [
        "20547",
        "20297",
        "11019",
        "11283",
        "5"
      ]
    },
    {
      "hadith_no": "1059",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، وهارون بن عبد الله البزاز، قالا حدثنا أبو داود الطيالسي، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن أبي الأسود الديلي، قال قدمت المدينة فجلست إلى عمر بن الخطاب فمروا بجنازة فأثنوا عليها خيرا فقال عمر وجبت ‏.‏ فقلت لعمر وما وجبت قال أقول كما قال رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من مسلم يشهد له ثلاثة إلا وجبت له الجنة ‏\"‏ ‏.‏ قال قلنا واثنان قال ‏\"‏ واثنان ‏\"‏ ‏.‏ قال ولم نسأل رسول الله صلى الله عليه وسلم عن الواحد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو الأسود الديلي اسمه ظالم بن عمرو بن سفيان ‏.‏",
      "text_en": " Abu Al-Aswad Ad-Dill narrated:                     \"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"",
      "chain": [
        "30221",
        "20547",
        "20424",
        "11432",
        "11114"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو داود الطيالسي، حدثنا زائدة بن قدامة، عن السدي، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، قال خطب علي فقال يا أيها الناس أقيموا الحدود على أرقائكم من أحصن منهم ومن لم يحصن وإن أمة لرسول الله صلى الله عليه وسلم زنت فأمرني أن أجلدها فإذا هي حديثة عهد بنفاس فخشيت إن أنا جلدتها أن أقتلها - أو قال تموت - فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ أحسنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والسدي اسمه إسماعيل بن عبد الرحمن وهو من التابعين قد سمع من أنس بن مالك ورأى حسين بن علي بن أبي طالب رضى الله عنه ‏.‏",
      "text_en": " Narrated Abu 'Abdur-Rahman As-Sulami:                     \"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"",
      "chain": [
        "30115",
        "20547",
        "20320",
        "10743",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "1468",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن أبي بشر، قال سمعت سعيد بن جبير، يحدث عن عدي بن حاتم، قال قلت يا رسول الله أرمي الصيد فأجد فيه من الغد سهمي قال ‏\"‏ إذا علمت أن سهمك قتله ولم تر فيه أثر سبع فكل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وروى شعبة هذا الحديث عن أبي بشر وعبد الملك بن ميسرة عن سعيد بن جبير عن عدي بن حاتم وكلا الحديثين صحيح ‏.‏ وفي الباب عن أبي ثعلبة الخشني ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim:                     \"I said: 'O Messenger of Allah! I shoot some game and then find my arrow in it the next day.' He said: 'If you know that your arrow killed it, and you dont see any marks of predators, then eat it.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11419",
        "11050",
        "212"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، عن شعبة، أخبرني سماك بن حرب، قال سمعت قبيصة بن هلب، يحدث عن أبيه، قال سألت النبي صلى الله عليه وسلم عن طعام النصارى فقال ‏\"‏ لا يتخلجن في صدرك طعام ضارعت فيه النصرانية ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Qabisah bin Hulb:                     From his father, who said: \"I asked the Prophet (ﷺ) about the food of the Christians. He (ﷺ) said: 'Do not allow food to put uneasiness in your chest similar to the doubts of Christianity about it.\"[Abu 'Eisa said:] This Hadith is Hasan",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10770"
      ]
    },
    {
      "hadith_no": "1577",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، عن عمران القطان، عن قتادة، عن يزيد بن عبد الله، هو ابن الشخير عن عياض بن حمار، أنه أهدى للنبي صلى الله عليه وسلم هدية له أو ناقة فقال النبي صلى الله عليه وسلم ‏\"‏ أسلمت ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإني نهيت عن زبد المشركين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى قوله ‏\"‏ إني نهيت عن زبد المشركين ‏\"‏ ‏.‏ يعني هداياهم وقد روي عن النبي صلى الله عليه وسلم أنه كان يقبل من المشركين هداياهم وذكر في هذا الحديث الكراهية واحتمل أن يكون هذا بعد ما كان يقبل منهم ثم نهى عن هداياهم ‏.‏",
      "text_en": " Narrated 'Iyad bin Himar:                     That he gave the Prophet (ﷺ) a gift or a camel, so the Prophet (ﷺ) said: \"Have you accepted Islam?\" He said: \"No.\" He said: \"Then I have been prohibited from the Zabd (gift) of the idolaters.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of his saying: \"I haven been prohibited from the Zabd (gifts) of the idolaters\" is their gifts.It has been reported about the Messenger (ﷺ) that he used to accept the gifts of the idolaters while a dislike for that is mentioned in this Hadith.And the implication is that this was after he used to accept from them, and then he later forbade their gifts.",
      "chain": [
        "30160",
        "20547",
        "20718",
        "11019",
        "11318",
        "5217"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، قال أخبرني أبو الفيض، قال سمعت سليم بن عامر، يقول كان بين معاوية وبين أهل الروم عهد وكان يسير في بلادهم حتى إذا انقضى العهد أغار عليهم فإذا رجل على دابة أو على فرس وهو يقول الله أكبر وفاء لا غدر ‏.‏ وإذا هو عمرو بن عبسة فسأله معاوية عن ذلك فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كان بينه وبين قوم عهد فلا يحلن عهدا ولا يشدنه حتى يمضي أمده أو ينبذ إليهم على سواء ‏\"‏ ‏.‏ قال فرجع معاوية بالناس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Al-Faid:                     \"I heard Sulaim bin 'Amir saying: 'There was a treaty between Mu'awiyah and the people of Rome. He was making an expedition into their lands so that when the period of the treaty was expires he would attack them. So when a man upon an animal' - or - 'upon a horse said: \"Allahu Akbar! Fulfillment not betrayal!\" - and it turned out to be 'Amr bin 'Abasah - Mu'awiyah asked him about that. He said: \"I heard the Messenger of Allah (ﷺ) said: 'Whoever has a treaty between himself and a people, then let him not violate the treaty nor try to change it until its time has passed, or , in retribution for a similar offense.'\" He said: \"So Mu'awiyah returned with the people.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10915"
      ]
    },
    {
      "hadith_no": "1676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وهب بن جرير، وأبو داود الطيالسي قالا حدثنا شعبة، عن أبي إسحاق، قال كنت إلى جنب زيد بن أرقم فقيل له كم غزا النبي صلى الله عليه وسلم من غزوة قال تسع عشرة ‏.‏ فقلت كم غزوت أنت معه قال سبع عشرة ‏.‏ قلت أيتهن كان أول قال ذات العشيراء أو العسيراء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Ishaq:                     \"I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30277",
        "20298",
        "20547",
        "20020",
        "11049"
      ]
    },
    {
      "hadith_no": "1685",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، قال أنبأنا شعبة، عن قتادة، حدثنا أنس بن مالك، قال ركب النبي صلى الله عليه وسلم فرسا لأبي طلحة يقال له مندوب فقال ‏\"‏ ما كان من فزع وإن وجدناه لبحرا ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن عمرو بن العاص ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، وابن أبي عدي، وأبو داود قالوا حدثنا شعبة، عن قتادة، عن أنس بن مالك، قال كان فزع بالمدينة فاستعار رسول الله صلى الله عليه وسلم فرسا لنا يقال له مندوب فقال ‏\"‏ ما رأينا من فزع وإن وجدناه لبحرا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30160",
        "20173",
        "20276",
        "20547",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1717",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن الأسود بن قيس، قال سمعت نبيحا العنزي، يحدث عن جابر، قال لما كان يوم أحد جاءت عمتي بأبي لتدفنه في مقابرنا فنادى منادي رسول الله صلى الله عليه وسلم ردوا القتلى إلى مضاجعهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال أبو عيسى ونبيح ثقة ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "1757",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد، حدثنا أبو داود، - هو الطيالسي عن عباد بن منصور، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ اكتحلوا بالإثمد فإنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏ وزعم أن النبي صلى الله عليه وسلم كانت له مكحلة يكتحل بها كل ليلة ثلاثة في هذه وثلاثة في هذه ‏.‏ وقد روي من غير وجه عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ عليكم بالإثمد فإنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏ قال وفي الباب عن جابر وابن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن لا نعرفه على هذا اللفظ إلا من حديث عباد بن منصور ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Prophet (ﷺ) said: \"Use Ithmid for Kohl, for it clears the vision and grows the hair (eye-lashes).\" And he claimed that the Prophet (ﷺ) had a Kohl holder with which he would apply Kohl every night, three in this (eye) and three in this.Another chain with similar meaning.He said: There are narrations on this topic from Jabir and Ibn 'Umar[Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it with this wording except from the narration of 'Abbas bin Mansur.",
      "chain": [
        "38495",
        "20547",
        "19848",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1772",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا همام، عن قتادة، قال قلت لأنس بن مالك كيف كان نعل رسول الله صلى الله عليه وسلم قال لهما قبالان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Qatadah:                     \"I asked Anas bin Malik: 'How were the sandals of the Messenger of Allah (ﷺ) ? He said: 'They had two straps.'\"",
      "chain": [
        "30160",
        "20547",
        "20297",
        "11019"
      ]
    },
    {
      "hadith_no": "1789",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن هشام بن زيد بن أنس، قال سمعت أنسا، يقول أنفجنا أرنبا بمر الظهران فسعى أصحاب النبي صلى الله عليه وسلم خلفها فأدركتها فأخذتها فأتيت بها أبا طلحة فذبحها بمروة فبعث معي بفخذها أو بوركها إلى النبي صلى الله عليه وسلم فأكله ‏.‏ قال قلت أكله قال قبله ‏.‏ قال أبو عيسى وفي الباب عن جابر وعمار ومحمد بن صفوان ويقال محمد بن صيفي ‏.‏ وهذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم لا يرون بأكل الأرنب بأسا ‏.‏ وقد كره بعض أهل العلم أكل الأرنب وقالوا إنها تدمي ‏.‏",
      "text_en": " Narrated Hisham b. Zaid:                     \"I heard Anas saying: 'Once we provoked a rabbit at Marr Az-Zahran. So the Companions of the Messenger of Allah (ﷺ) rushed after it, and I caught up to it and captured it. I brought it to Abu Talhah who slaughtered it with Marwah. He sent me with its legs - or its thighs - to the Prophet (ﷺ) so he could eat it.'\" He (Hisham) said: \"I said: 'He ate it?' He said:'He accepted it.'\"[Abu 'Eisa said:] There are narrations on this topic from Jubair, 'Ammar, Muhammad bin Safwan, and they say: Muhammad bin Saifi.This Hadith is Hasan Sahih. This is acted upon according to the people of knowledge. They saw no harm in eating rabbit. Some of the people of knowledge disliked eating rabbit, they said that it menstruates.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "1807",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن سماك بن حرب، سمع جابر بن سمرة، يقول نزل رسول الله صلى الله عليه وسلم على أبي أيوب وكان إذا أكل طعاما بعث إليه بفضله فبعث إليه يوما بطعام ولم يأكل منه النبي صلى الله عليه وسلم فلما أتى أبو أيوب النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ فيه ثوم ‏\"‏ ‏.‏ فقال يا رسول الله أحرام هو قال ‏\"‏ لا ولكني أكرهه من أجل ريحه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"The Messenger of Allah (ﷺ) was staying with Abu Ayyub. When he ate some food, he would send what was left to him. So one day he sent him some food but the Prophet (ﷺ) did not eat from it. So Abu Ayyub went to the Prophet (ﷺ) and mentioned that to him. The Prophet (ﷺ) said: 'It contained garlic.' So he said: 'O Messenger of Allah! Is it unlawful?' He said: 'No, I dislike it because of its odor.'\"He said: This Hadith is Hasan Sahih.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1868",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو داود الطيالسي، حدثنا شعبة، عن عمرو بن مرة، قال سمعت زاذان، يقول سألت ابن عمر عما نهى عنه رسول الله صلى الله عليه وسلم من الأوعية أخبرناه بلغتكم وفسره لنا بلغتنا ‏.‏ فقال نهى رسول الله صلى الله عليه وسلم عن الحنتمة وهي الجرة ونهى عن الدباء وهي القرعة ونهى عن النقير وهو أصل النخل ينقر نقرا أو ينسح نسحا ونهى عن المزفت وهي المقير وأمر أن ينبذ في الأسقية ‏.‏ قال وفي الباب عن عمر وعلي وابن عباس وأبي سعيد وأبي هريرة وعبد الرحمن بن يعمر وسمرة وأنس وعائشة وعمران بن حصين وعائذ بن عمرو والحكم الغفاري وميمونة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Zadhan:                     \"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "20547",
        "20020",
        "11381",
        "10911"
      ]
    },
    {
      "hadith_no": "2048",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، قال كتب به إلى منصور وقرأته عليه سمع أبا عثمان مولى المغيرة بن شعبة عن أبي هريرة قال سمعت أبا القاسم صلى الله عليه وسلم يقول ‏\"‏ لا تنزع الرحمة إلا من شقي ‏\"‏ ‏.‏ قال وأبو عثمان الذي روى عن أبي هريرة لا يعرف اسمه ويقال هو والد موسى بن أبي عثمان الذي روى عنه أبو الزناد وقد روى أبو الزناد عن موسى بن أبي عثمان عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم غير حديث ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Abu Hurairah narrated that Abul- Qasim said:                     \"Mercy is  not removed  (from anyone) except from a wicked one.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "13"
      ]
    },
    {
      "hadith_no": "2103",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن الأعمش، قال سمعت أبا وائل، يحدث عن مسروق، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خياركم أحاسنكم أخلاقا ‏\"‏ ‏.‏ ولم يكن النبي صلى الله عليه وسلم فاحشا ولا متفحشا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah bin 'Amr said; \"The Messenger of Allah said:                     \"The best of you are those best in conduct.' And the Prophet was not one who was obscene, nor one who uttered obscenities.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11060",
        "11353",
        "11018",
        "29"
      ]
    },
    {
      "hadith_no": "2148",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن أبي إسحاق، قال سمعت أبا عبد الله الجدلي، يقول سألت عائشة عن خلق، رسول الله صلى الله عليه وسلم فقالت لم يكن فاحشا ولا متفحشا ولا صخابا في الأسواق ولا يجزي بالسيئة السيئة ولكن يعفو ويصفح ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو عبد الله الجدلي اسمه عبد بن عبد ويقال عبد الرحمن بن عبد ‏.‏",
      "text_en": " Abu Abdullah Al-Jadali narrated:                     \"I asked 'Aishah about the character of the Messenger of Allah. She said: 'He was not obscene, nor uttering obscenities, nor screaming in the markets, he would not return an evil with an evil, but rather he was pardoning and forgiving.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11049",
        "19307",
        "53"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عباس العنبري، حدثنا أبو داود الطيالسي، عن عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الظلم ظلمات يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن عمرو وعائشة وأبي موسى وأبي هريرة وجابر ‏.‏ وهذا حديث حسن غريب من حديث ابن عمر ‏.‏",
      "text_en": " Ibn 'Umar narrated that Prophet said:                     \"Oppression shall be darkness on the Day of Judgment.\"",
      "chain": [
        "30437",
        "20547",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "2171",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا فليح بن سليمان، عن أيوب بن عبد الرحمن، عن يعقوب، عن أم المنذر الأنصارية، في حديثه قالت دخل علينا رسول الله صلى الله عليه وسلم فذكر نحو حديث يونس بن محمد إلا أنه قال ‏\"‏ أنفع لك ‏\"‏ ‏.‏ وقال محمد بن بشار وحدثنيه أيوب بن عبد الرحمن ‏.‏ هذا حديث جيد غريب ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20443",
        "20547",
        "20169",
        "20184"
      ]
    },
    {
      "hadith_no": "2179",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، عن شعبة، عن الأعمش، قال سمعت أبا صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل نفسه بحديدة فحديدته في يده يتوجأ بها في بطنه في نار جهنم خالدا مخلدا فيها أبدا ومن قتل نفسه بسم فسمه في يده يتحساه في نار جهنم خالدا مخلدا فيها أبدا ومن تردى من جبل فقتل نفسه فهو يتردى في نار جهنم خالدا مخلدا فيها أبدا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated (that the the Messenger of Allah (s.a.w)) said:                     \"Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "2182",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، عن شعبة، عن سماك، أنه سمع علقمة بن وائل، عن أبيه، أنه شهد النبي صلى الله عليه وسلم وسأله سويد بن طارق أو طارق بن سويد عن الخمر فنهاه عنه فقال إننا نتداوى بها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ليست بدواء ولكنها داء ‏\"‏ ‏.‏",
      "text_en": " Simak narrated that he heard 'Alqamah bin Wa'il narrate from his father, that he witnessed the Prophet (s.a.w) being asked by Suwaid bin Tariq -or Tariq bin Suwaid- about Khamr, and he forbade it. So he said:                     \"We use it as a treatment.\" So the Messenger of Allah (S.A.W) said: \"It is certainly not a treatment, rather, it is a disease.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "2295",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن منصور، عن ربعي بن حراش، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يؤمن عبد حتى يؤمن بأربع يشهد أن لا إله إلا الله وأني محمد رسول الله بعثني بالحق ويؤمن بالموت وبالبعث بعد الموت ويؤمن بالقدر ‏\"‏ ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah (s.a.w) said:                     'A slave (of Allah) shall not believe until he believes in four: The testimony of La Ilaha Illallah, and that I am the Messenger of Allah whom He sent with the Truth, and he believes in the death, and he believes in the Resurrection after death, and he believes in Al-Qadar.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا أبو داود الطيالسي، حدثنا عبد الواحد بن سليم، قال قدمت مكة فلقيت عطاء بن أبي رباح فقلت له يا أبا محمد إن أهل البصرة يقولون في القدر ‏.‏ قال يا بنى أتقرأ القرآن قلت نعم ‏.‏ قال فاقرإ الزخرف ‏.‏ قال فقرأت ‏:‏ ‏(‏حم* والكتاب المبين * إنا جعلناه قرآنا عربيا لعلكم تعقلون * وإنه في أم الكتاب لدينا لعلي حكيم ‏)‏ فقال أتدري ما أم الكتاب قلت الله ورسوله أعلم ‏.‏ قال فإنه كتاب كتبه الله قبل أن يخلق السموات وقبل أن يخلق الأرض فيه إن فرعون من أهل النار وفيه ‏:‏ ‏(‏تبت يدا أبي لهب وتب ‏)‏ قال عطاء فلقيت الوليد بن عبادة بن الصامت صاحب رسول الله صلى الله عليه وسلم فسألته ما كان وصية أبيك عند الموت قال دعاني أبي فقال لي يا بنى اتق الله واعلم أنك لن تتقي الله حتى تؤمن بالله وتؤمن بالقدر كله خيره وشره فإن مت على غير هذا دخلت النار إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول ما خلق الله القلم فقال اكتب ‏.‏ فقال ما أكتب قال اكتب القدر ما كان وما هو كائن إلى الأبد ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Abdul-Wahid bin sulaim narrated:                     \"I arrived in Makkah and met 'Ata bin Abi Rabab. I said to him: 'O Abu Muhammad! The people of Al-Basrah speak about Al-Qadar.' He said: 'O my son! Do you recite the Quran?' I said: 'Yes.' He said: 'Then recite Az-Zukhruf to me.'\" He said: 'So I recited: Ha Mim. By the manifest Book, Verily, We have  made it a Quran in Arabic that you may be able to understand. And verily, it is in the Mother of Book with Us, indeed exalted, full of wisdom. Then he said: 'Do you know what Mother of Books is?' I said: 'Allah and His Messenger know better.' He said:'It is a book that Allah wrote before He created the Heavens, and before  He created the earth. In it, it is  (written): Fir'awn is among the inhabitants of the Fire, and in it is: Perish the two hands of Abu Lahab, and perish he!'Ata said: 'I met Al-Walid the son of Ubadah bin As-samit the Companion of the Messenger of Allah (s.a.w) and asked him:'What was your father's admonition when he died?\" He said:\"He called me and said: 'O my son ! Have Taqwa of Allah, and know that you will never have Taqwa of Allah until you believe in Allah, and you believe in Al-Qadar-all of it-its good and its bad. If you die upon other than  this you shall  enter  the Fire. Indeed  I heard the Messenger of Allah (s.a.w)  saying: \"Verily the first of what Allah created was the Pen. So He said: 'Write Al-Qadar, what it is , and what shall be, until  the end.'\"",
      "chain": [
        "30221",
        "20547"
      ]
    }
  ],
  "total_hadiths": 187
}