{
  "id": "20546",
  "name": "Sulaym bin Aghdar سليم بن أخضر",
  "full_name": "Sulaym bin Aghdar سليم بن أخضر",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "180",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19838",
      "name": "Ash'th bin 'Abdul Malik أشعث بن عبد الملك الحمراني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20193",
      "name": "Sulaiman bin Harb سليمان بن حرب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30559",
      "name": "Fdyl bin Husayn bin Talha فضيل بن حسين بن طلحة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30423",
      "name": "Ahmed bin 'Ubda bin Musa أحمد بن عبدة بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30430",
      "name": "Hameed bin Musa'da bin al-Mubarak حميد بن مسعدة بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30451",
      "name": "Muhammad bin 'Ubaid bin Hsab محمد بن عبيد بن حساب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36523",
      "name": "Ishaq bin Abi Isra'il Kamjar إسحاق بن أبي إسرائيل كامجر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1333",
      "hadith_no": "1333",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني عمرو الناقد، حدثنا عيسى بن يونس، ح قال وحدثنا أبو كامل، حدثنا يزيد، - يعني ابن زريع - ح قال وحدثنا أحمد بن عبدة، حدثنا سليم بن أخضر، كلهم عن التيمي، بهذا الإسناد ‏.‏ غير أنهم لم يقولوا خلف أبي القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated by Tamimi with the same chain of transmitters except for this that they made no mention of:                     \" Behind Abu'l-Qasim\" (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20347",
        "20304",
        "30423",
        "20546"
      ]
    },
    {
      "id": "sahih-muslim-3111",
      "hadith_no": "3111",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو كامل الجحدري، حدثنا سليم بن أخضر، حدثنا عبيد الله بن عمر، عن نافع، أن ابن عمر، رمل من الحجر إلى الحجر وذكر أن رسول الله صلى الله عليه وسلم فعله ‏.‏",
      "text_en": " Nafi' reported that Ibn Umar (Allah he pleased with them) walked swiftly from stone to stone, and stated that Allah's Messenger (may peace be upon him) did like this.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20546",
        "11201",
        "11014"
      ]
    },
    {
      "id": "sahih-muslim-4311",
      "hadith_no": "4311",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا سليم بن أخضر، عن ابن عون، عن نافع، عن ابن عمر، قال أصاب عمر أرضا بخيبر فأتى النبي صلى الله عليه وسلم يستأمره فيها فقال يا رسول الله إني أصبت أرضا بخيبر لم أصب مالا قط هو أنفس عندي منه فما تأمرني به قال ‏\"‏ إن شئت حبست أصلها وتصدقت بها ‏\"‏ ‏.‏ قال فتصدق بها عمر أنه لا يباع أصلها ولا يبتاع ولا يورث ولا يوهب ‏.‏ قال فتصدق عمر في الفقراء وفي القربى وفي الرقاب وفي سبيل الله وابن السبيل والضيف لا جناح على من وليها أن يأكل منها بالمعروف أو يطعم صديقا غير متمول فيه ‏.‏ قال فحدثت بهذا الحديث محمدا فلما بلغت هذا المكان غير متمول فيه ‏.‏ قال محمد غير متأثل مالا ‏.‏ قال ابن عون وأنبأني من قرأ هذا الكتاب أن فيه غير متأثل مالا ‏.‏",
      "text_en": " Ibn Umar reported:                      Umar acquired a land at Khaibar. He came to Allah's Apostle (may peace be upon him) and sought his advice in regard to it. He said: Allah's Messenger, I have acquired land in Khaibar. I have never acquired property more valuable for me than this, so what do you command me to do with it? Thereupon he (Allah's Apostle) said: If you like, you may keep the corpus intact and give its produce as Sadaqa. So 'Umar gave it as Sadaqa declaring that property must not be sold or inherited or given away as gift. And Umar devoted it to the poor, to the nearest kin, and to the emancipation of slaves, aired in the way of Allah and guests. There is no sin for one, who administers it if he eats something from it in a reasonable manner, or if he feeds his friends and does not hoard up goods (for himself). He (the narrator) said: I narrated this hadith to Muhammad, but as I reached the (words)\" without hoarding (for himself) out of it.\" he (Muhammad' said:\" without storing the property with a view to becoming rich.\" Ibn 'Aun said: He who read this book (pertaining to Waqf) informed me that in it (the words are)\" without storing the property with a view to becoming rich.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20546",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4616",
      "hadith_no": "4616",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، حدثنا سليم بن أخضر، عن ابن عون، قال كتبت إلى نافع أسأله عن الدعاء، قبل القتال قال فكتب إلى إنما كان ذلك في أول الإسلام قد أغار رسول الله صلى الله عليه وسلم على بني المصطلق وهم غارون وأنعامهم تسقى على الماء فقتل مقاتلتهم وسبى سبيهم وأصاب يومئذ - قال يحيى أحسبه قال - جويرية - أو قال البتة - ابنة الحارث وحدثني هذا الحديث عبد الله بن عمر وكان في ذاك الجيش.",
      "text_en": " Ibn 'Aun reported:                      I wrote to Nafi' inquiring from him whether it was necessary to extend (to the disbelievers) an invitation to accept (Islam) before meeting them in fight. He wrote (in reply) to me that it was necessary in the early days of Islam. The Messenger of Allah (may peace be upon him) made a raid upon Banu Mustaliq while they were unaware and their cattle were having a drink at the water. He killed those who fought and imprisoned others. On that very day, he captured Juwairiya bint al-Harith. Nafi' said that this tradition was related to him by Abdullah b. Umar who (himself) was among the raiding troops.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20546",
        "11071"
      ]
    },
    {
      "id": "sahih-muslim-4685",
      "hadith_no": "4685",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو كامل فضيل بن حسين كلاهما عن سليم، قال يحيى أخبرنا سليم بن أخضر، عن عبيد الله بن عمر، حدثنا نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قسم في النفل للفرس سهمين وللرجل سهما ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Umar that the Messenger of Allah (may peace be upon him) allowed two shares from the spoils to the horseman and one share to the footman.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20234",
        "20031",
        "20546",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-373",
      "hadith_no": "373",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، ح حدثنا محمد بن عبيد بن حساب البصري، حدثنا سليم، - يعني ابن أخضر المعنى والإخبار في حديث سليم - قالا حدثنا عمرو بن ميمون بن مهران سمعت سليمان بن يسار يقول سمعت عائشة تقول إنها كانت تغسل المني من ثوب رسول الله صلى الله عليه وسلم ‏.‏ قالت ثم أرى فيه بقعة أو بقعا ‏.‏",
      "text_en": " Sulaiman b. Yasar reported:                      I heard 'Aishah say that she would wash semen from the clothe of the Messenger of Allah (ﷺ). She added: Then I would see a mark or marks (after washing).",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "30213",
        "20546",
        "11439",
        "11005"
      ]
    },
    {
      "id": "sunan-abi-daud-1891",
      "hadith_no": "1891",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو كامل، حدثنا سليم بن أخضر، حدثنا عبيد الله، عن نافع، أن ابن عمر، رمل من الحجر إلى الحجر وذكر أن رسول الله صلى الله عليه وسلم فعل ذلك ‏.‏",
      "text_en": " Nafi’ said Ibn ‘Umar walked proudly (ramal) from the corner (Black Stone) to the corner (Black Stone) and mentioned that the Apostle of Allaah (ﷺ) had done so.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20546",
        "11201",
        "11014"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1554",
      "hadith_no": "1554",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، وحميد بن مسعدة، قالا حدثنا سليم بن أخضر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قسم في النفل للفرس بسهمين وللرجل بسهم ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "30430",
        "20546",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1554-2",
      "hadith_no": "1554",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سليم بن أخضر، نحوه ‏.‏ وفي الباب عن مجمع بن جارية، وابن، عباس وابن أبي عمرة عن أبيه، ‏.‏ وهذا حديث ابن عمر حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري والأوزاعي ومالك بن أنس وابن المبارك والشافعي وأحمد وإسحاق قالوا للفارس ثلاثة أسهم سهم له وسهمان لفرسه وللراجل سهم ‏.‏",
      "text_en": " Another chain with similar meaning.There are narrations on this topic from Mujammi' bin Jariyah, Ibn 'Abbas, and Ibn Abi 'Amrah from his father. This Hadith of Ibn 'Umar is a Hasan Sahih Hadith. This is acted upon according to most of the people of knowledge among the Companions of the Prophet (ﷺ) and others.This is the view of Sufyan At-Thawri, Al-Awzai', Malik bin Anas, Ibn Al-Mubarak, Ash-Shafi'i, Ahmad and Ishaq. They said that the horsemen gets three shares, one share is for him and two shares for his horse. The foot soldiers get one share.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20546"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3494",
      "hadith_no": "3494",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا سليم بن أخضر، عن حاتم بن أبي صغيرة، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20546",
        "11274"
      ]
    },
    {
      "id": "sunan-an-nasai-968",
      "hadith_no": "968",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سليم، - وهو ابن أخضر - عن التيمي، قال حدثني بكر بن عبد الله المزني، عن أبي رافع، قال صليت خلف أبي هريرة صلاة العشاء - يعني العتمة - فقرأ سورة ‏{‏ إذا السماء انشقت ‏}‏ فسجد فيها فلما فرغ قلت يا أبا هريرة هذه - يعني سجدة - ما كنا نسجدها ‏.‏ قال سجد بها أبو القاسم صلى الله عليه وسلم وأنا خلفه فلا أزال أسجد بها حتى ألقى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Rafi' said:                     \"I prayed Isha' prayer- meaning Al-'Atamah behind Abu Hurairah and he recited: 'When the heaven is split asunder' and prostrated during it. When he had finished praying, I said: 'O Abu Hurairah, (this is) a prostration that we are not used to.' He said: 'Abu Al-Qasim (ﷺ) did this prostration and I was (praying) behind him, and I will continue to do this prostration until I meet Abu Al-Qasim.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20546",
        "11289",
        "11267",
        "479"
      ]
    }
  ],
  "total_hadiths": 11
}