{
  "id": "20542",
  "name": "Salm bin Nwh bin Aby سالم بن نوح بن أبي",
  "full_name": "Salm bin Nwh bin Aby سالم بن نوح بن أبي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  د  ت  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Basri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq/Delusion] [ بخ  م  د  ت  س  -  صدوق له أوهام ]",
        "ar": "Narrator[Grade:Sadooq/Delusion] [ بخ  م  د  ت  س  -  صدوق له أوهام ]",
        "ckb": "Narrator[Grade:Sadooq/Delusion] [ بخ  م  د  ت  س  -  صدوق له أوهام ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Basri",
        "ar": "al-Basri",
        "ckb": "al-Basri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "10706",
      "name": "'Umar bin 'Amir al-Slmy عمر بن عامر السلمي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "28424",
      "name": "'Umar bin Jabir al-Yemami عمر بن جابر اليمامي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "20265",
      "name": "'Umar bin 'Ali bin Ata'a bin Maqaddam عمر بن علي بن عطاء بن مقدم",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30478",
      "name": "Muhammad bin Yazid Abu Hisham al-Rafa'i محمد بن يزيد أبو هشام الرفاعي",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30441",
      "name": "'Uqba bin Mukaram bin Aflah al-''Ami عقبة بن مكرم",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "34285",
      "name": "Yazid bin Sinan bin Yazid يزيد بن سنان بن يزيد أبو خالد القزاز",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1563",
      "hadith_no": "1563",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا سالم بن نوح، ح وحدثنا حسن بن عيسى، حدثنا ابن المبارك، جميعا عن الجريري، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Abu Sa'id al-Khudri by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2159",
      "hadith_no": "2159",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا سالم بن نوح، أخبرنا الجريري، عن حيان بن، عمير عن عبد الرحمن بن سمرة، قال بينما أنا أترمى، بأسهم لي على عهد رسول الله صلى الله عليه وسلم إذ خسفت الشمس ‏.‏ ثم ذكر نحو حديثهما ‏.‏",
      "text_en": " 'Abd al-Rahman b. Samura reported:                      I was shooting some of my arrows during the lifetime of the Messenger of Allah (may peace be upon him) that the sun eclipsed. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10679",
        "955"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2607",
      "hadith_no": "2607",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عمرو الناقد، حدثنا يزيد بن هارون، أخبرنا همام، ح وحدثنا ابن المثنى، حدثنا سالم بن نوح، حدثنا عمر بن عامر، كلاهما عن قتادة، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Qatada too.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20472",
        "20297",
        "20542"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2672",
      "hadith_no": "2672",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، عن التيمي، ح وحدثناه محمد بن المثنى، حدثنا ابن مهدي، حدثنا شعبة، وقال ابن المثنى، حدثنا أبو عامر، حدثنا هشام، وقال ابن المثنى، حدثنا سالم بن نوح، حدثنا عمر يعني ابن عامر، ح وحدثنا أبو بكر بن أبي شيبة حدثنا محمد بن بشر، عن سعيد، كلهم عن قتادة، بهذا الإسناد ‏.‏ نحو حديث همام غير أن في حديث التيمي وعمر بن عامر وهشام لثمان عشرة خلت وفي حديث سعيد في ثنتى عشرة ‏.‏ وشعبة لسبع عشرة أو تسع عشرة ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Qatada with the same chain of transmitters by different narrators (except this difference) that in the hadith transmitted by Taimi and Umar b. Amir and Hisham (the date of setting out is) 18th, and in the hadith transmitted by Sa'id it is the 12th, and in the one transmitted by Shu'ba it is the 17th or 19th.",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20031",
        "11289",
        "30170",
        "20033",
        "20020",
        "20443",
        "20295",
        "20542",
        "30201",
        "20352"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5487",
      "hadith_no": "5487",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني محمد بن المثنى، حدثنا سالم بن نوح العطار، عن الجريري، عن أبي عثمان، عن عبد الرحمن بن أبي بكر، قال نزل علينا أضياف لنا - قال - وكان أبي يتحدث إلى رسول الله صلى الله عليه وسلم من الليل - قال - فانطلق وقال يا عبد الرحمن افرغ من أضيافك ‏.‏ قال فلما أمسيت جئنا بقراهم - قال - فأبوا فقالوا حتى يجيء أبو منزلنا فيطعم معنا - قال - فقلت لهم إنه رجل حديد وإنكم إن لم تفعلوا خفت أن يصيبني منه أذى - قال - فأبوا فلما جاء لم يبدأ بشىء أول منهم فقال أفرغتم من أضيافكم قال قالوا لا والله ما فرغنا ‏.‏ قال ألم آمر عبد الرحمن قال وتنحيت عنه فقال يا عبد الرحمن ‏.‏ قال فتنحيت - قال - فقال يا غنثر أقسمت عليك إن كنت تسمع صوتي إلا جئت - قال - فجئت فقلت والله ما لي ذنب هؤلاء أضيافك فسلهم قد أتيتهم بقراهم فأبوا أن يطعموا حتى تجيء - قال - فقال ما لكم ألا تقبلوا عنا قراكم - قال - فقال أبو بكر فوالله لا أطعمه الليلة - قال - فقالوا فوالله لا نطعمه حتى تطعمه ‏.‏ قال فما رأيت كالشر كالليلة قط ويلكم ما لكم أن لا تقبلوا عنا قراكم قال ثم قال أما الأولى فمن الشيطان هلموا قراكم - قال - فجيء بالطعام فسمى فأكل وأكلوا - قال - فلما أصبح غدا على النبي صلى الله عليه وسلم فقال يا رسول الله بروا وحنثت - قال - فأخبره فقال ‏\"‏ بل أنت أبرهم وأخيرهم ‏\"‏ ‏.‏ قال ولم تبلغني كفارة ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abd Bakr reported:                      There came to our house some guests. It was a common practice with my father to (go) and talk to Allah's Messenger (may peace be upon him) during the night. While going he said: 'Abd al-Rahman, entertain the guests. When it was evening we served the food to them, but they refused saying: So long as the owner of the house does not come and join us, we would not take the meal. I said to them: He ('Abd Bakr) is a stern person, and if you would not do that (if you do not take the food). I fear, I may be harmed by him, but they refused. As he (my father) came, the first thing he asked was: Have you served the guests? They (the peopleof the household) said: We have not served them sofar. He said: Did I not command 'Abd al-Rahman (to do this)? He ('Abd al-Rahman) said: I slunk away and kept myself away by that time. He again said: O stupid fellow, I ask you on oath that In case you hear my voice you come to me. I came and said: By Allah, there is no fault of mine. These are your guests; you may ask them. I provided them with food but they refused to eat until you came. He said to them: Why is it that you did not accept our food? By Allah, I shall not even take food tonight (as you have not taken). They said: By Allah, we would not take until you join us. Thereupon he Abu Bakr) said: I have never seen a more unfortunate night than this. Woe be to thee! that you do not accept from us food prepared for you. He again said: What I did first (that is the taking of vow for not eating the food) was prompted by the Satan. Bring the food. The food was brought, and he ate by reciting the name of Allah and they also ate, and when it was morning he came to Allah's Apostle (may peace be upon him) and said: Allah's Messenger, their oath (that of the guests) came to be true, but mine was not true, and after that he informed him of the whole incident. He said: Your oath came to be the most true and you are the best of them. He (the narrator) said. I do not know whether he made an atonement for it.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "11113",
        "107"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5869",
      "hadith_no": "5869",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثناه محمد بن المثنى، حدثنا سالم بن نوح، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، كلاهما عن الجريري، عن أبي العلاء، عن عثمان بن أبي العاص، أنه أتى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثله ولم يذكر في حديث سالم بن نوح ثلاثا ‏.‏",
      "text_en": " 'Uthman b. Abu al-'As reported that he came to Allah's Apostle (may peace be upon him) and he narrated like this. In the hadith transmitted on the authority of Salam b. Nuh there is no mention of three times,",
      "usc_msa_ref": "",
      "chain": [
        "20542",
        "30201",
        "11286",
        "3210"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6506",
      "hadith_no": "6506",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثناه محمد بن بشار، حدثنا سالم بن نوح، حدثنا عمر بن عامر، عن قتادة، عن أنس، أن أكيدر، دومة الجندل أهدى لرسول الله صلى الله عليه وسلم ‏.‏ حلة فذكر نحوه ولم يذكر فيه وكان ينهى عن الحرير ‏.‏",
      "text_en": " Anas reported the king of Dumat al-Jandal presented to Allah's Messenger (may peace be upon him) the garment and lie made no mention (of the fact) that he prohibited the use of silk.",
      "usc_msa_ref": "",
      "chain": [
        "20542",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7014",
      "hadith_no": "7014",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا سالم بن نوح العطار، عن سعيد، بن أبي عروبة عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith had been transmitted on the authority of Anas through another chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20542",
        "11073",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7530",
      "hadith_no": "7530",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا سالم بن نوح، عن الجريري، عن أبي نضرة، عن  أبي سعيد، قال لقيه رسول الله صلى الله عليه وسلم وأبو بكر وعمر في بعض طرق المدينة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتشهد أني رسول الله ‏\"‏ ‏.‏ فقال هو أتشهد أني رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ آمنت بالله وملائكته وكتبه ما ترى ‏\"‏ ‏.‏ قال أرى عرشا على الماء ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ترى عرش إبليس على البحر وما ترى ‏\"‏ ‏.‏ قال أرى صادقين وكاذبا أو كاذبين وصادقا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لبس عليه دعوه ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) met him (Ibn Sayyad) and so did Abu Bakr and 'Umar on some of the roads of Medina. Allah's Messenger (may peace be upon him) said:                      Do you bear testimony to the fact that I am the Messenger of Allah? Thereupon he said: Do you bear testimony to the fact that I am the messenger of Allah? Thereupon Allah's Messenger (may peace be upon him) said: I affirm my faith in Allah and in His Angels and in His Books, and what do you see? He said: I see the throne over water. Whereupon Allah's Messenger (may peace be upon him) said: You see the throne of Iblis upon the water, and what else do you see? He said: I see two truthfuls and a liar or two liars and one truthful. Thereupon Allah's Messenger (may peace be upon him) said: Leave him He has been confounded.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7534",
      "hadith_no": "7534",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا سالم بن نوح، أخبرني الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال خرجنا حجاجا أو عمارا ومعنا ابن صائد - قال - فنزلنا منزلا فتفرق الناس وبقيت أنا وهو فاستوحشت منه وحشة شديدة مما يقال عليه - قال - وجاء بمتاعه فوضعه مع متاعي ‏.‏ فقلت إن الحر شديد فلو وضعته تحت تلك الشجرة - قال - ففعل - قال - فرفعت لنا غنم فانطلق فجاء بعس فقال اشرب أبا سعيد ‏.‏ فقلت إن الحر شديد واللبن حار ‏.‏ ما بي إلا أني أكره أن أشرب عن يده - أو قال آخذ عن يده - فقال أبا سعيد لقد هممت أن آخذ حبلا فأعلقه بشجرة ثم أختنق مما يقول لي الناس يا أبا سعيد من خفي عليه حديث رسول الله صلى الله عليه وسلم ما خفي عليكم معشر الأنصار ألست من أعلم الناس بحديث رسول الله صلى الله عليه وسلم أليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ هو كافر ‏\"‏ ‏.‏ وأنا مسلم أوليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ هو عقيم لا يولد له ‏\"‏ ‏.‏ وقد تركت ولدي بالمدينة أو ليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل المدينة ولا مكة ‏\"‏ ‏.‏ وقد أقبلت من المدينة وأنا أريد مكة قال أبو سعيد الخدري حتى كدت أن أعذره ‏.‏ ثم قال أما والله إني لأعرفه وأعرف مولده وأين هو الآن ‏.‏ قال قلت له تبا لك سائر اليوم ‏.‏",
      "text_en": " Abu Sa'id Khudri reported:                      We came back after having pewrformed Pilgrimage or 'Umra and lbn Sa'id was along with us. And w, e encamped at a place and the people dispersed and I and he were left behind. I felt terribly frightend from him as it was said about him that he was the Dajjal. He brought his goods and placed them by my luggage and I said: It is intense heat. Would you not place that under that tree? And he did that. Then ther appeared before us a flock of sheep. He went and brought a cup of milk and said: Abu Sa'id, drink that. I said it is intense heat and the milk is also hot (whereas the fact was) that I did not like to drink from his hands or to opr to take it from his hand and he said: Abu Sa'id, I think that I should take a rope and suspend it by the tree and then coimmit sucide because of the talks of the people, and he furtlier said. Abu Sa'id he who is ingnoran of the saying of Allah's Messenger (may peace be upon him) (he is to be pardoned), but O people of Ansar, is this hadith of Allah's Messengern (may peace be upon him) concealed from you whereas you have the best konowledge of t this hadith of Allah's Messenger (may peace be upon him) amongst people? Did Allalt's Messenger (may peace be upon him) not say that he (Dajjal) would be a non believer whereas I am a believer? did Allah's Messenger (may peace be upon him) not say he would be barren and no child would be born to hirn, whereas I have left my children in Medina? Did Allh's Messenger (may peace upon him) not say: He would not get into Medina and Mecca whereas I have been coming from Medina and now I intend to go to Mecca? Abu Sa'id said: I was about to accept the excuse put forward by him. that he said: I know the place where he would be born and where he is now. So I said to him: May your whole dayb be spent",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-3271",
      "hadith_no": "3271",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن المثنى، حدثنا سالم بن نوح، وعبد الأعلى، عن الجريري، عن أبي عثمان، عن عبد الرحمن بن أبي بكر، بهذا الحديث نحوه زاد عن سالم، في حديثه قال ‏:‏ ولم يبلغني كفارة ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Abd al-Rahman b. Abi Bakr through a different chain of narrators. This version adds on the authority of Salim:                      \"Expiation (for breaking the oath) has not reached me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "20246",
        "11286",
        "11113",
        "107"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5041",
      "hadith_no": "5041",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا سالم، - يعني ابن نوح - عن عمر بن جابر الحنفي، عن وعلة بن عبد الرحمن بن وثاب، عن عبد الرحمن بن علي، - يعني ابن شيبان - عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من بات على ظهر بيت ليس له حجار فقد برئت منه الذمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn Shayban:                     The Prophet (ﷺ) said: If anyone spends the night on the roof of a house with no stone palisade, Allah's responsibility to guard him no longer applies.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "28424"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-674",
      "hadith_no": "674",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا عقبة بن مكرم البصري، حدثنا سالم بن نوح، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعث مناديا في فجاج مكة ‏\"‏ ألا إن صدقة الفطر واجبة على كل مسلم ذكر أو أنثى حر أو عبد صغير أو كبير مدان من قمح أو سواه صاع من طعام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى عمر بن هارون هذا الحديث عن ابن جريج وقال عن العباس بن ميناء عن النبي صلى الله عليه وسلم فذكر بعض هذا الحديث ‏.‏حدثنا جارود حدثنا عمر بن هارون هذا الحديث",
      "text_en": " Amr bin Shu'aib narrated from his grandfather that :                     the Prophet sent a caller in the roads of Makkah proclaiming \"Sadaqatul-Fitr is required upon every Muslim, male or female, free or slave, young or old; it is two Mudd of wheat or its equivalent of a Sa of food.\"",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20542",
        "11070",
        "19934",
        "19911"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-4493",
      "hadith_no": "4493",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثني سالم بن نوح، قال أنبأنا يونس، عن محمد بن سيرين، عن أنس بن مالك، قال نهينا أن يبيع، حاضر لباد وإن كان أخاه أو أباه ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"It was forbidden to us for a town-dweller to sell for a desert-dweller, even if he was his father or brother.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "20475",
        "11035",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 14,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [9th Generation]",
    "ar": "تابع التابعين [الجيل التاسع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
  }
}