{
  "id": "20550",
  "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
  "full_name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "164",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ل  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Khuza'i",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11299",
      "name": "Ghalib bin Khataf al-Qatan غالب بن خطاف القطان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11296",
      "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10667",
      "name": "Asma' bin 'Ubaid bin Makhariq أسماء بن عبيد بن مخارق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11524",
      "name": "'Uthman bin 'Abdullah bin Muhab عثمان بن عبد الله بن موهب التيمي الأعرج",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11596",
      "name": "Shu'iab bin al-Habhab al-Azdi شعيب بن الحبحاب الأزدي المعولي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34079",
      "name": "Zuhyr bin N'ym al-Baby زهير بن نعيم البابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20193",
      "name": "Sulaiman bin Harb سليمان بن حرب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5116",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الرحمن بن مهدي، حدثنا سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب، قال النبي صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏ تابعه الحارث بن عبيد وسعيد بن زيد عن أبي عمران ولم يرفعه حماد بن سلمة وأبان‏.‏ وقال غندر عن شعبة عن أبي عمران سمعت جندبا قوله‏.‏ وقال ابن عون عن أبي عمران عن عبد الله بن الصامت عن عمر قوله، وجندب أصح وأكثر‏.‏",
      "text_en": " Narrated Jundub:                     The Prophet said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but when you have any difference of opinion (as regards its interpretation and meaning) then you should stop reciting it (for the time being)'",
      "chain": [
        "30153",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "6450",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا سلام بن أبي مطيع، عن هشام، عن أبيه، عن خالته، أن النبي صلى الله عليه وسلم كان يتعوذ ‏\"‏ اللهم إني أعوذ بك من فتنة النار ومن عذاب النار، وأعوذ بك من فتنة القبر، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة الغنى، وأعوذ بك من فتنة الفقر، وأعوذ بك من فتنة المسيح الدجال ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to seek refuge with Allah (by saying), \"O Allah! I seek refuge with You from the affliction of the Fire and from the punishment in the Fire, and seek refuge with You from the affliction of the grave, and I seek refuge with You from the affliction of wealth, and I seek refuge with You from the affliction of poverty, and seek refuge with You from the affliction of Al-Masih Ad-Dajjal.\"",
      "chain": [
        "20040",
        "20550",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "7451",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرحمن بن مهدي، عن سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Allah's Apostle said, \"Recite (and study) the Qur'an as long as you are in agreement as to its interpretation and meanings, but when you have differences regarding its interpretation and meanings, then you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)",
      "chain": [
        "30021",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "64",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني إبراهيم بن خالد اليشكري، قال سمعت أبا الوليد، يقول سمعت سلام بن أبي مطيع، يقول سمعت جابرا الجعفي، يقول عندي خمسون ألف حديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30536",
        "20296",
        "20550"
      ]
    },
    {
      "hadith_no": "78",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج، حدثنا سليمان بن حرب، قال سمعت سلام بن أبي مطيع، يقول بلغ أيوب أني آتي عمرا فأقبل على يوما فقال أرأيت رجلا لا تأمنه على دينه كيف تأمنه على الحديث",
      "text_en": "",
      "chain": [
        "20219",
        "20193",
        "20550"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسن بن عيسى، حدثنا ابن المبارك، أخبرنا سلام بن أبي مطيع، عن أيوب، عن أبي قلابة، عن عبد الله بن يزيد، - رضيع عائشة - عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من ميت يصلي عليه أمة من المسلمين يبلغون مائة كلهم يشفعون له إلا شفعوا فيه ‏\"‏ ‏.‏ قال فحدثت به شعيب بن الحبحاب فقال حدثني به أنس بن مالك عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'A'isha reported Allah's Apostle (may peace be upon him) saying:                      If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.",
      "chain": [
        "20025",
        "20550",
        "11015",
        "11047",
        "10699",
        "53"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الفضل بن سهل الأعرج البغدادي، وغير، واحد، قالوا حدثنا يونس بن محمد، عن سلام بن أبي مطيع، عن قتادة، عن الحسن، عن سمرة بن جندب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحسب المال والكرم التقوى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث سمرة ‏.‏ لا نعرفه إلا من هذا الوجه من حديث سلام بن أبي مطيع وهو ثقة ‏.‏",
      "text_en": " Narrated Al-Hasan:                     from Samurah that the Prophet (ﷺ) said: \"Al-Hasab is wealth and Al-Karam is Taqwa.\"",
      "chain": [
        "30264",
        "20393",
        "20550",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "4993",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا هشام بن عبد الملك، قال حدثنا سلام بن أبي مطيع، قال سمعت معمرا، عن الزهري، عن عامر بن سعد، عن سعد، أن رسول الله صلى الله عليه وسلم قسم قسما فأعطى ناسا ومنع آخرين فقلت يا رسول الله أعطيت فلانا ومنعت فلانا وهو مؤمن ‏.‏ قال ‏\"‏ لا تقل مؤمن وقل مسلم ‏\"‏ ‏.‏ قال ابن شهاب ‏{‏ قالت الأعراب آمنا ‏}‏ ‏.‏",
      "text_en": " It was narrated from Sa'd that :                     The Messenger of Allah [SAW] distributed (some spoils of war) and gave to some people but withheld from others. I said: \"O Messenger of Allah, you gave to so-and-so and so-and-so, and you withheld from so-and-so, who is a beliver.\" He said: \"Do not say 'a believer,' say 'a Muslim.'\" Ibn Shihab (one of the narrators) said: The Bedouins say: \"We believe\".",
      "chain": [
        "38433",
        "20550",
        "20115",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا يونس بن محمد، حدثنا سلام بن أبي مطيع، عن عثمان بن موهب، قال دخلت على أم سلمة ‏.‏ قال فأخرجت إلى شعرا من شعر رسول الله  صلى الله عليه وسلم  مخضوبا بالحناء والكتم ‏.‏",
      "text_en": " It wasnarrated that ‘Uthman bin Mawhab said:                      “I entered upon UmmSalamah and she brought out for me a hair of the Messenger of Allah(ﷺ), which was dyed with henna and Katam.”",
      "chain": [
        "20436",
        "20393",
        "20550",
        "18716"
      ]
    }
  ],
  "total_hadiths": 9
}