{
  "id": "20565",
  "name": "Muhammad bin Swa'a محمد بن سواء",
  "full_name": "Muhammad bin Swa'a محمد بن سواء",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "180",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  خد  ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Sadusi",
      "al-'Anbari",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11586",
      "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14087",
      "name": "al-Hakam bin Frwkh الحكم بن فروخ",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20444",
      "name": "'Ubaidullah bin al-Akhns عبيد الله بن الأخنس النخعي أبو مالك",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "34193",
      "name": "Muhammad bin Tha'lbah bin Swa'a محمد بن ثعلبة بن سواء",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30132",
      "name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30457",
      "name": "Ma'la bin Asad al-'Ami معلى بن أسد العمي أبو الهيثم البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30135",
      "name": "Ziyad bin Yahya al-Hasani زياد بن يحيى الحساني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38091",
      "name": "Azhar bin Mrwan al-Rqashy أزهر بن مروان الرقاشي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30155",
      "name": "'Amr bin 'Isa al-Db'y عمرو بن عيسى الضبعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34170",
      "name": "'Imran bin Musa عمران بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "34092",
      "name": "S'hyl bin Khlad al-Bdy سهيل بن خلاد العبدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30121",
      "name": "Ahmed bin al-Miqdam أحمد بن المقدام",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3730",
      "hadith_no": "3730",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا سعيد، وقال، لي خليفة حدثنا محمد بن سواء، وكهمس بن المنهال، قالا حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  قال صعد النبي صلى الله عليه وسلم إلى أحد ومعه أبو بكر وعمر وعثمان فرجف بهم، فضربه برجله، قال ‏\"‏ اثبت أحد فما عليك إلا نبي أو صديق أو شهيدان ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet ascended the mountain of Uhud and he was accompanied by Abu Bakr, `Umar and `Uthman. The mountain shook beneath them. The Prophet hit it with his foot and said, \"O Uhud ! Be firm, for on you there is none but a Prophet, a Siddiq and a martyr (i.e. and two martyrs).",
      "usc_msa_ref": "35",
      "chain": [
        "30175",
        "20304",
        "11168",
        "30132",
        "20565",
        "20275",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6101",
      "hadith_no": "6101",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن عيسى، حدثنا محمد بن سواء، حدثنا روح بن القاسم، عن محمد بن المنكدر، عن عروة، عن عائشة، أن رجلا، استأذن على النبي صلى الله عليه وسلم فلما رآه قال ‏\"‏ بئس أخو العشيرة، وبئس ابن العشيرة ‏\"‏‏.‏ فلما جلس تطلق النبي صلى الله عليه وسلم في وجهه وانبسط إليه، فلما انطلق الرجل قالت له عائشة يا رسول الله حين رأيت الرجل قلت له كذا وكذا، ثم تطلقت في وجهه وانبسطت إليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة متى عهدتني فحاشا، إن شر الناس عند الله منزلة يوم القيامة من تركه الناس اتقاء شره ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          A man asked permission to enter upon the Prophet. When the Prophet saw     him, he said, \"What an evil brother of his tribe! And what an evil son     of his tribe!\" When that man sat down, the Prophet behaved with him in     a nice and polite manner and was completely at ease with him. When      that person had left, 'Aisha said (to the Prophet). \"O Allah's      Apostle! When you saw that man, you said so-and-so about him, then you     showed him a kind and polite behavior, and you enjoyed his company?\"      Allah's Apostle said, \"O 'Aisha! Have you ever seen me speaking a bad      and dirty language? (Remember that) the worst people in Allah's sight      on the Day of Resurrection will be those whom the people leave      (undisturbed) to be away from their evil (deeds).\"",
      "usc_msa_ref": "59",
      "chain": [
        "30155",
        "20565",
        "11586",
        "11048",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3514",
      "hadith_no": "3514",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا عبد الأعلى، ح وحدثني أبو الخطاب، زياد بن يحيى حدثنا محمد بن سواء، قالا جميعا حدثنا سعيد، عن مطر، ويعلى بن حكيم، عن نافع، عن نبيه بن وهب، عن أبان بن عثمان، عن عثمان بن عفان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " Uthman b. 'Affan reported that Allah's Messenger (may peace be upon him) had said:                      A Muhrim should neither marry himself, nor should he be got married to anyone, nor should he make the proposal of marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20246",
        "30135",
        "20565",
        "11168",
        "11567",
        "11014",
        "10582",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-780",
      "hadith_no": "780",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا محمد بن سواء، حدثنا سعيد بن أبي عروبة، عن أيوب، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دعي أحدكم إلى طعام فليجب فإن كان صائما فليصل ‏\"‏ ‏.‏ يعني الدعاء ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Prophet said: \"When one of you is invited to eat then let him respond, if he is fasting then let him pray.\" Meaning: supplicate.",
      "usc_msa_ref": "",
      "chain": [
        "38091",
        "20565",
        "11073",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2130-2",
      "hadith_no": "2130",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Wala' And Gifts - كتاب الولاء والهبة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "31",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا محمد بن سواء، حدثنا أبو معشر، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تهادوا فإن الهدية تذهب وحر الصدر ولا تحقرن جارة لجارتها ولو شق فرسن شاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وأبو معشر اسمه نجيح مولى بني هاشم وقد تكلم فيه بعض أهل العلم من قبل حفظه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"Give gifts, for indeed the gift removes bad feelings from the chest. And let the neighbor not look down upon (the gift of) her neighbor, even if it be the lower shanks of sheep.\" [Abu 'Eisa said:] This Hadith is Gharib from this route. Abu Ma'shar's name is Najih, the freed slave of Banu Hisham. Some of the people of knowledge criticized him due to his poor memory.",
      "usc_msa_ref": "",
      "chain": [
        "38091",
        "20565",
        "10765",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-445",
      "hadith_no": "445",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا محمد بن سواء، عن شعبة، عن معمر، عن الزهري، عن عروة بن الزبير، عن بسرة بنت صفوان، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أفضى أحدكم بيده إلى فرجه فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Busrah bint Safwan that the Prophet (ﷺ) said:                      \"If any one of you touches his private part with his hand, let him perform Wudu'.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20565",
        "20020",
        "20115",
        "11013",
        "10511",
        "861"
      ]
    },
    {
      "id": "sunan-an-nasai-1993",
      "hadith_no": "1993",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن سواء أبو الخطاب، قال حدثنا أبو بكار الحكم بن فروخ، قال صلى بنا أبو المليح على جنازة فظننا أنه قد كبر فأقبل علينا بوجهه فقال أقيموا صفوفكم ولتحسن شفاعتكم قال أبو المليح حدثني عبد الله - وهو ابن سليط - عن إحدى أمهات المؤمنين وهي ميمونة زوج النبي صلى الله عليه وسلم قالت أخبرني النبي صلى الله عليه وسلم قال ‏\"‏ ما من ميت يصلي عليه أمة من الناس إلا شفعوا فيه ‏\"‏ ‏.‏ فسألت أبا المليح عن الأمة فقال أربعون ‏.‏",
      "text_en": " Abu Bakkar Al-Hakam bin Farrukh said:                     \"Abu Al-Malih led us in offering the funeral prayer and we thought that he had said the Takbir, but he turned to us and said: 'Make you rows straight and intercede properly.' Abu Al-Malih said: Abdullah - meaning Ibn Salit-narrated to me that one of the Mothers of the believes, Maimunah the wife of the Prophet, said: The Prophet told me: There is no deceased person for whom a group of people offers the funeral prayer, but their intercession for him will be accepted.' I asked Abu Al-Malih about the (number of that) group and he said: 'Forty.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20565"
      ]
    },
    {
      "id": "sunan-an-nasai-3271",
      "hadith_no": "3271",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمرو بن علي، عن محمد بن سواء، قال حدثنا سعيد، عن قتادة، ويعلى بن حكيم، عن عكرمة، عن ابن عباس، قال تزوج رسول الله صلى الله عليه وسلم ميمونة بنت الحارث وهو محرم وفي حديث يعلى بسرف ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah married Maimunah bint Al-Harith when he was a Muhrim.\" According to the Hadith of Ya'la (one of the narrators): \"In Sarif.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20565",
        "11168",
        "11019",
        "11567",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3306",
      "hadith_no": "3306",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن الصباح بن عبد الله، قال حدثنا محمد بن سواء، قال حدثنا سعيد، عن قتادة، عن جابر بن زيد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أريد على بنت حمزة فقال ‏\"‏ إنها ابنة أخي من الرضاعة وإنه يحرم من الرضاع ما يحرم من النسب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the daughter of Hamzah was suggested to Messenger of Allah (as a potential wife). He said:                      \"She is the daughter of my brother through breast-feeding, and what becomes unlawful (for marriage) through breast-feeding is the same as that which becomes unlawful through lineage.\"",
      "usc_msa_ref": "",
      "chain": [
        "20565",
        "11168",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3308",
      "hadith_no": "3308",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن الصباح بن عبد الله، قال حدثنا محمد بن سواء، قال حدثنا سعيد، عن قتادة، وأيوب، عن صالح أبي الخليل، عن عبد الله بن الحارث بن نوفل، عن أم الفضل، أن نبي الله صلى الله عليه وسلم سئل عن الرضاع فقال ‏\"‏ لا تحرم الإملاجة ولا الإملاجتان ‏\"‏ ‏.‏ وقال قتادة ‏\"‏ المصة والمصتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Fadl that the Prophet of Allah was asked about breast-feeding and said:                      \"Suckling (Al-Imlajah) once or twice does not make (marriage) prohibited.\" And (one of the narrators) Qatadah said (in his narration): \"Suckling (Al-Massah) once or twice does not make (marriage) prohibited.\"",
      "usc_msa_ref": "",
      "chain": [
        "20565",
        "11168",
        "11019",
        "11015",
        "11291",
        "912"
      ]
    },
    {
      "id": "sunan-an-nasai-3504",
      "hadith_no": "3504",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبد الله بن الصباح، قال حدثنا محمد بن سواء، قال أنبأنا سعيد، عن أيوب، عن نافع، عن صفية بنت أبي عبيد، عن بعض، أزواج النبي صلى الله عليه وسلم وعن أم سلمة أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت أكثر من ثلاثة أيام إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safiyyah bint Abi 'Ubaid from one of the wives of the Prophet, and from Umm Salamah, that the Prophet said:                      \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30142",
        "20565",
        "11168",
        "11015",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sunan-ibn-majah-589",
      "hadith_no": "589",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا محمد بن سواء، حدثنا سعيد بن أبي عروبة، عن أيوب، عن نافع، عن ابن عمر، أنه رأى سعد بن مالك وهو يمسح على الخفين فقال إنكم لتفعلون ذلك فاجتمعنا عند عمر فقال سعد لعمر أفت ابن أخي في المسح على الخفين ‏.‏ فقال عمر كنا ونحن مع رسول الله  صلى الله عليه وسلم  نمسح على خفافنا لم نر بذلك بأسا ‏.‏ فقال ابن عمر وإن جاء من الغائط قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     He saw Sa'd bin Malik wiping over his leather socks and said: \"Is it you doing this?\" They both went to 'Umar and Sa'd said to 'Umar: \"Give my brother's son a verdict regarding wiping over leather socks.\" 'Umar said: \"We used to wipe over our leather socks when we were with the Messenger of Allah and we do not see anything wrong with that.\" Ibn 'Umar said: \"Even if that is after one has defecated?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20565",
        "11073",
        "11015",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 12
}