{
  "id": "20568",
  "name": "Muslimh bin 'Alqama al-Mazny مسلمة بن علقمة المازني",
  "full_name": "Muslimh bin 'Alqama al-Mazny مسلمة بن علقمة المازني",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  صد  ت  س  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Maazni",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24026",
      "name": "Iyas bin Dghfl إياس بن دغفل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14422",
      "name": "Yazid bin Aban al-Raqqashi يزيد بن أبان الرقاشي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "39466",
      "name": "Sulaiman bin Da'ud al-Shadhkuni سليمان بن داود الشاذكوني",
      "grade": "3rd Century AH"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30128",
      "name": "Hamd bin 'Umar bin Hafs حامد بن عمر بن حفص",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30158",
      "name": "Qays bin Hafs قيس بن حفص",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34055",
      "name": "al-Hasan bin Qz'h الحسن بن قزعة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30450",
      "name": "Ibn Abi al-Shuwarab محمد بن عبد الملك بن أبي الشوارب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-6614",
      "hadith_no": "6614",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا مسلمة بن علقمة المازني، إمام مسجد داود حدثنا داود، عن الشعبي، عن أبي هريرة، قال ثلاث خصال سمعتهن من، رسول الله صلى الله عليه وسلم في بني تميم لا أزال أحبهم بعد وساق الحديث بهذا المعنى غير أنه قال ‏\"‏ هم أشد الناس قتالا في الملاحم ‏\"‏ ‏.‏ ولم يذكر الدجال ‏.‏",
      "text_en": " Abu Huraira reported:                      There are some distinguishing features of Banu Tamim which I heard from Allah's Messenger (may peace be upon him) and my love for them is never on the decline after that and the words are: They are the bravest amongst people in the battlefield and there is no mention of (the word)\" Dajjal\".",
      "usc_msa_ref": "",
      "chain": [
        "30128",
        "20568",
        "11052",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1241",
      "hadith_no": "1241",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن قزعة البصري، أنبأنا مسلمة بن علقمة، أنبأنا داود بن علي، عن عامر، عن مسروق، عن عائشة، قالت آلى رسول الله صلى الله عليه وسلم من نسائه وحرم فجعل الحرام حلالا وجعل في اليمين كفارة ‏.‏ قال وفي الباب عن أنس وأبي موسى ‏.‏ قال أبو عيسى حديث مسلمة بن علقمة عن داود رواه علي بن مسهر وغيره عن داود عن الشعبي أن النبي صلى الله عليه وسلم ‏.‏ مرسلا ‏.‏ وليس فيه عن مسروق عن عائشة وهذا أصح من حديث مسلمة بن علقمة ‏.‏ والإيلاء هو أن يحلف الرجل أن لا يقرب امرأته أربعة أشهر فأكثر ‏.‏ واختلف أهل العلم فيه إذا مضت أربعة أشهر فقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر يوقف فإما أن يفيء وإما أن يطلق ‏.‏ وهو قول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر فهي تطليقة بائنة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "13020",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3516",
      "hadith_no": "3516",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة، - بصري - حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن عامر الشعبي، في قول الله عز وجل ‏:‏ ‏(‏ ما كان محمد أبا أحد من رجالكم ‏)‏ قال ما كان ليعيش له فيكم ولد ذكر ‏.‏",
      "text_en": " Narrated Dawud bin Abi Hind:                     from Ash-Sha'bi regarding the saying of Allah [the Mighty and Sublime]: 'Muhammad is not the father of any one of your men (33:40)' he said: \"No male children of his would live among them.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11585"
      ]
    },
    {
      "id": "sunan-an-nasai-1997",
      "hadith_no": "1997",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحسن بن قزعة، قال حدثنا مسلمة بن علقمة، قال أنبأنا داود، عن عامر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تبع جنازة فصلى عليها ثم انصرف فله قيراط من الأجر ومن تبعها فصلى عليها ثم قعد حتى يفرغ من دفنها فله قيراطان من الأجر كل واحد منهما أعظم من أحد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever follows a funeral and offers the funeral prayer then leaves, will have one Qirat reward. And whoever follows it and offers the funeral prayer then stays until the burial is completed will have two Qirat of reward, both of which are greater than Uhud.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11052",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1388",
      "hadith_no": "1388",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير الحضرمي، عن أبي ذر، قال صمنا مع رسول الله  صلى الله عليه وسلم  رمضان فلم يقم بنا شيئا منه حتى بقي سبع ليال فقام بنا ليلة السابعة حتى مضى نحو من ثلث الليل ثم كانت الليلة السادسة التي تليها فلم يقمها حتى كانت الخامسة التي تليها ثم قام بنا حتى مضى نحو من شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف فإنه يعدل قيام ليلة ‏\"‏ ‏.‏ ثم كانت الرابعة التي تليها فلم يقمها حتى كانت الثالثة التي تليها ‏.‏ قال فجمع نساءه وأهله واجتمع الناس ‏.‏ قال فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قيل وما الفلاح قال السحور ‏.‏ قال ثم لم يقم بنا شيئا من بقية الشهر ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “We fasted Ramadan with theMessengerof Allah (ﷺ) and he did not lead us in praying Qiyam(prayers atnight) during any part of it, until there were sevennights left. Heled us in praying Qiyam on the seventh night untilapproximately onethird of the night had passed. Then on the sixthnight which followedit he did not lead us in prayer. Then he led usin praying Qiyam onthe fifth night which followed it until almosthalf the night hadpassed. I said: ‘O Messenger of Allah, would thatwe had offeredvoluntary prayers throughout the whole night.’ He said:‘Whoeverstands with the Imam until he finishes, it is equivalent tospendingthe whole night in prayer.’ Then on the fourth night whichfollowedit, he did not lead us in prayer, until the third night thatfollowedit, when he gathered his wives and family, and he peoplegathered,and he led us in prayer until we feared that we would misstheFalah.” It was asked: “What is the Falah?” He said: “Suhur.”Hesaid: “Then he did not lead us in prayer at night for the restof themonth.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20568",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2150",
      "hadith_no": "2150",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا الحسن بن قزعة، حدثنا مسلمة بن علقمة، حدثنا داود بن أبي هند، عن عامر، عن مسروق، عن عائشة، قالت آلى رسول الله  صلى الله عليه وسلم  من نسائه وحرم فجعل الحرام حلالا ‏.‏ وجعل في اليمين كفارة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah swore to keep away from his wives and declared them as unlawful for him, so he made something permissible forbidden, and he offered expiation for having sworn to do so.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11585",
        "11052",
        "11018",
        "53"
      ]
    }
  ],
  "total_hadiths": 6
}