{
  "id": "20564",
  "name": "al-Qasim bin al-Fadl bin Ma'dan القاسم بن الفضل بن معدان",
  "full_name": "al-Qasim bin al-Fadl bin Ma'dan القاسم بن الفضل بن معدان",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "167",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11216",
      "name": "Muhammad bin Ziyad محمد بن زياد القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10673",
      "name": "Thmamh bin Hzn ثمامة بن حزن",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "28213",
      "name": "Sa'id bin al-Mahlab سعيد بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19079",
      "name": "al-Nadr bin Shyban al-Hdany النضر بن شيبان الحداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11442",
      "name": "Muhammad bin 'Ali b. al-Hussain al-Baqir محمد بن علي بن الحسين بن علي ,الباقر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14434",
      "name": "Yusuf bin Sa'd al-Jumahi يوسف بن سعد الجمحي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20214",
      "name": "Bahz bin Asad al-'Ami",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20351",
      "name": "Qabaysa bin 'Uqba bin Muhammad قبيصة بن عقبة بن محمد بن سفيان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34120",
      "name": "'Abdullah bin Mua'wiya عبد الله بن معاوية بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20656",
      "name": "Shayban bin Farroukh شيبان بن فروخ / أبي شيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا القاسم، - وهو ابن الفضل الحداني - حدثنا أبو نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تمرق مارقة عند فرقة من المسلمين يقتلها أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that the Messenger of Allah (may peace be upon him) said:                      A group would secede itself (from the Ummah) when there would be dissension among the Muslims. Out of the two groups who would be nearer the truth would kill them.",
      "chain": [
        "20656",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا القاسم، - يعني ابن الفضل - حدثنا ثمامة بن، حزن القشيري قال لقيت عائشة فسألتها عن النبيذ، فحدثتني أن وفد عبد القيس قدموا على النبي صلى الله عليه وسلم فسألوا النبي صلى الله عليه وسلم عن النبيذ فنهاهم أن ينتبذوا في الدباء والنقير والمزفت والحنتم ‏.‏",
      "text_en": " Thumama b. Hazn Al-Qushairi reported:                      I met 'A'isha and asked her (about the utensils in which) Nabidh (may be prepared). She narrated to me that a group of 'Abd al-Qais came to Allah's Apostle (may peace be upon him) and asked: Allah's Apostle (may peace be upon him) about Nabidh. He (the Holy Prophet) forbade them to prepare Nabidh in varnished jar, hollow stumps and gourd and green pitcher.",
      "chain": [
        "20656",
        "20564",
        "10673"
      ]
    },
    {
      "hadith_no": "5349",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا القاسم، - يعني ابن الفضل الحداني - حدثنا  ثمامة، - يعني ابن حزن القشيري - قال لقيت عائشة فسألتها عن النبيذ، فدعت عائشة جارية حبشية فقالت سل هذه فإنها كانت تنبذ لرسول الله صلى الله عليه وسلم فقالت الحبشية كنت أنبذ له في سقاء من الليل وأوكيه وأعلقه فإذا أصبح شرب منه ‏.‏",
      "text_en": " Thumama (i. e. Ibn Hazn al-Qushairi) reported:                      I met 'A'isha and asked her about Nabidh (that was served to the Holy Prophet). 'A'isha called an Abyssinian maid (servant) and said: Ask her (about it) for it was he, who prepared the Nabidh for the Messenger of Allah (may peace be upon him). The Abyssinian (maid-servant) said: I prepared Nabidh for him in a waterskin in the night and tied its mouth and then suspended it; and when it was morning he (the Holy Prophet) drank from it.",
      "chain": [
        "20656",
        "20564",
        "10673"
      ]
    },
    {
      "hadith_no": "7426",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا القاسم بن الفضل، الحداني عن محمد بن زياد، عن عبد الله بن الزبير، أن عائشة، قالت عبث رسول الله صلى الله عليه وسلم في منامه فقلنا يا رسول الله صنعت شيئا في منامك لم تكن تفعله ‏.‏ فقال ‏\"‏ العجب إن ناسا من أمتي يؤمون بالبيت برجل من قريش قد لجأ بالبيت حتى إذا كانوا بالبيداء خسف بهم ‏\"‏ ‏.‏ فقلنا يا رسول الله إن الطريق قد يجمع الناس ‏.‏ قال ‏\"‏ نعم فيهم المستبصر والمجبور وابن السبيل يهلكون مهلكا واحدا ويصدرون مصادر شتى يبعثهم الله على نياتهم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) was startled in the state of sleep. We said:                      Allah's Messenger, you have done something in the state of your sleep which you never did before, Thereupon he said: Strange it is that some, people of my Ummah would attack the House (Ka'ba) (for killing) a person who would belong to the tribe of the Quraish and he would try to seek protection in the House. And when they would reach the plain ground they would be sunk. We said: Allah's Messenger, all sorts of people throng the path. Thereupon he said: Yes, there would be amongst them people who would come with definite designs and those who would come under duress and there would be travellers also, but they would all be destroyed through one (stroke) of destruction. though they would be raised in different states (on the Day of Resurrection). Allah would, however, raise them according to their intention.",
      "chain": [
        "30201",
        "20393",
        "20564",
        "11216",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "4667",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا القاسم بن الفضل، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تمرق مارقة عند فرقة من المسلمين يقتلها أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id reported the Messenger of Allah (May peace be upon him) as saying:                      In the event of the dissension among Muslims an emerging sect will emerge ; one of the two parties that is nearer to the truth will kill it.",
      "chain": [
        "20285",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2181",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن القاسم بن الفضل، حدثنا أبو نضرة العبدي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لا تقوم الساعة حتى تكلم السباع الإنس وحتى تكلم الرجل عذبة سوطه وشراك نعله وتخبره فخذه بما أحدث أهله من بعده ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث القاسم بن الفضل ‏.‏ والقاسم بن الفضل ثقة مأمون عند أهل الحديث وثقه يحيى بن سعيد القطان وعبد الرحمن بن مهدي ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (s.a.w) said:                     \"By the One in Whose Hand is my soul! The Hour will not be established until predators speak to people and until the tip of a man's whip and the straps on his sandal speak to him, and his thigh informs him of what occurred with his family after him.\"",
      "chain": [
        "35047",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3673",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، حدثنا القاسم بن الفضل الحداني، عن يوسف بن سعد، قال قام رجل إلى الحسن بن علي بعد ما بايع معاوية فقال سودت وجوه المؤمنين ‏.‏ أو يا مسود وجوه المؤمنين ‏.‏ فقال لا تؤنبني رحمك الله فإن النبي صلى الله عليه وسلم أري بني أمية على منبره فساءه ذلك فنزلت ‏:‏ ‏(‏ إنا أعطيناك الكوثر ‏)‏ يا محمد يعني نهرا في الجنة ونزلت ‏:‏ ‏(‏ إنا أنزلناه في ليلة القدر * وما أدراك ما ليلة القدر * ليلة القدر خير من ألف شهر ‏)‏ يملكها بعدك بنو أمية يا محمد ‏.‏ قال القاسم فعددناها فإذا هي ألف شهر لا يزيد يوم ولا ينقص ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث القاسم بن الفضل ‏.‏ وقد قيل عن القاسم بن الفضل عن يوسف بن مازن ‏.‏ والقاسم بن الفضل الحداني هو ثقة وثقه يحيى بن سعيد وعبد الرحمن بن مهدي ويوسف بن سعد رجل مجهول ولا نعرف هذا الحديث على هذا اللفظ إلا من هذا الوجه ‏.‏",
      "text_en": " Al-Qasim bin Al-Fadl Al-Huddani narrated from Yusuf bin Sa’d, who said:                     “A man stood up in front of Al-Hasan bin Ali, after he pledged to Mu’awiyah, so he said: ‘You have made fools of the believers.’ – or: ‘O you who has made fools of the believers’ – So he said: ‘Do not scold me so, may Allah have mercy upon you, for indeed the Prophet had a dream in which he saw Banu Umayyah upon his Minbar. That distressed him, so (the following) was revealed: Verily We have granted you Al-Kauthar (O Muhammad) meaning a river in Paradise, and (the following) was revealed: ‘Verily We have sent it down on the Night of Al-Qadr. And what will make you know what the Night of Al-Qadr is? The Night of Al-Qadr is better than a thousand months, in which Banu Umayyah rules after you O Muhammad.” Al-Qasim said: “So we counted them, and found that they were one-thousand months, not a day more nor less.”",
      "chain": [
        "30277",
        "20547",
        "20564",
        "14434"
      ]
    },
    {
      "hadith_no": "2209",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن شميل، قال أنبأنا القاسم بن الفضل، قال حدثنا النضر بن شيبان، عن أبي سلمة، فذكر مثله وقال ‏\"‏ من صامه وقامه إيمانا واحتسابا ‏\"‏ ‏.‏",
      "text_en": " A similar report was narrated from Abu Salamah and he said:                     \"Whoever fasts it and spends its nights in prayer out of faith and in the hope of reward.\" (Daif)",
      "chain": [
        "30123",
        "20291",
        "20564",
        "19079"
      ]
    },
    {
      "hadith_no": "2210",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا أبو هشام، قال حدثنا القاسم بن الفضل، قال حدثنا النضر بن شيبان، قال قلت لأبي سلمة بن عبد الرحمن حدثني بشىء، سمعته من، أبيك سمعه أبوك، من رسول الله صلى الله عليه وسلم ليس بين أبيك وبين رسول الله صلى الله عليه وسلم أحد في شهر رمضان ‏.‏ قال نعم حدثني أبي قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله تبارك وتعالى فرض صيام رمضان عليكم وسننت لكم قيامه فمن صامه وقامه إيمانا واحتسابا خرج من ذنوبه كيوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " An-Nadr bin Shaiban said:                     \"I said to Abu Salamah bin 'Abdur-Rahman: 'Tell me of something that you heard from your father, that he heard from the Messenger of Allah, with no one in between your father and Messenge of Allah concerning the month of Ramadan. He said: 'Yes; my father said: The Messenger of Allah said: Allah, may He be blessed and exalted, enjoined the fast of Ramadan upon you, and I have made it Sunnah for you to spend its nights in prayer. Whoever fasts it and spends its nights in prayer out of faith and in the hope of reward, he will emerge from his sins as on the day his mother bore him.\"' (Daif)",
      "chain": [
        "20564",
        "19079"
      ]
    },
    {
      "hadith_no": "5638",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن القاسم بن الفضل، قال حدثنا ثمامة بن حزن القشيري، قال لقيت عائشة فسألتها عن النبيذ، فقالت قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فسألوه فيما ينبذون فنهى النبي صلى الله عليه وسلم أن ينبذوا في الدباء والنقير والمقير والحنتم ‏.‏",
      "text_en": " Thumamah bin Hazn Al-Qushairi said:                     \"I met 'Aishah and asked her about Nabidh. She said: 'The delegation of 'Abdul-Qais came to the Messenger of Allah [SAW] and asked him in which vessels they should soak (fruits - to make Nabidh). The Prophet [SAW] forbade them to soak (fruits) in Ad-Dubba' (gourds), An-Naqir, Al-Muqayyar, and Al-Hantam.'\"",
      "chain": [
        "20025",
        "20564",
        "10673"
      ]
    },
    {
      "hadith_no": "1389",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، وعبيد الله بن موسى، عن نصر بن علي الجهضمي، عن النضر بن شيبان، ح وحدثنا يحيى بن حكيم، حدثنا أبو داود، حدثنا نصر بن علي الجهضمي، والقاسم بن الفضل الحداني، كلاهما عن النضر بن شيبان، قال لقيت أبا سلمة بن عبد الرحمن فقلت حدثني بحديث، سمعته من، أبيك يذكره في شهر رمضان ‏.‏ قال نعم ‏.‏ حدثني أبي أن رسول الله  صلى الله عليه وسلم  ذكر شهر رمضان فقال ‏\"‏ شهر كتب الله عليكم صيامه وسننت لكم قيامه فمن صامه وقامه إيمانا واحتسابا خرج من ذنوبه كيوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Nadr bin Shaiban said:                      “I met Abu Salamah bin‘Abdur-Rahman and said: ‘Tell me a Hadith that you heard fromyourfather, in which mention is made of the month of Ramadan.’ Hesaid:‘Yes, my father narrated to me that the Messenger of Allah(ﷺ)mentioned the month of Ramadan and said: “A month which Allahhasenjoined upon you to fast, and in which I have established Qiyam(prayers at night) as Sunnah for you. So whoever fasts it and spendsits nights in prayer out of faith and in hope of reward; he willemerge from his sins as on the day his mother bore him.”",
      "chain": [
        "38409",
        "20032",
        "20340",
        "30395",
        "19079",
        "34280",
        "20547",
        "30395",
        "20564",
        "19079"
      ]
    },
    {
      "hadith_no": "3014",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن القاسم بن الفضل الحداني، عن أبي جعفر، عن أم سلمة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الحج جهاد كل ضعيف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “Hajj is the Jihad of every weak person.”",
      "chain": [
        "30201",
        "20032",
        "20564",
        "56"
      ]
    }
  ],
  "total_hadiths": 12
}