{
  "id": "20572",
  "name": "Nwh bin Qays bin نوح بن قيس بن",
  "full_name": "Nwh bin Qays bin نوح بن قيس بن",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "184",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-5285",
      "hadith_no": "5285",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا نصر بن علي الجهضمي، أخبرنا نوح بن قيس، حدثنا ابن عون، عن محمد، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال لوفد عبد القيس ‏\"‏ أنهاكم عن الدباء والحنتم والنقير والمقير - والحنتم المزادة المجبوبة - ولكن اشرب في سقائك وأوكه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Apostle (may peace be upon him) said to the group of Abd al-Qais:                      I forbid you (to prepare Nabidh) in gourd. and green pitcher, hollow stump and varnished jar and the waterskin having its upper end cut, but (prepare it) in your small waterskin, and tie its mouth",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20572",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5603",
      "hadith_no": "5603",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا نوح بن قيس، عن أخيه، خالد بن قيسعن قتادة، عن أنس، أن النبي صلى الله عليه وسلم أراد أن يكتب إلى كسرى وقيصر والنجاشي‏.‏ فقيل إنهم لا يقبلون كتابا إلا بخاتم ‏.‏ فصاغ رسول الله صلى الله عليه وسلم خاتماحلقة فضة ونقش فيه محمد رسول الله ‏.‏",
      "text_en": " Anas reported that when Allah's Apostle (may peace be upon him) decided to write to the Kisri (the King of Persia), Caesar (Emperor of Rome), and the Negus (the Emperor of Abyssinia), it was said to him that they would not accept the letter without the seal over it; so Allah's Messenger (may peace be upon him) got a seal made, the ring of which was made of silver and there was engraved on it. (Mubammad. the Messenger of Allab).",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20572",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2935",
      "hadith_no": "2935",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا نوح بن قيس، عن يزيد بن كعب، عن عمرو بن مالك، عن أبي الجوزاء، عن ابن عباس، قال السجل كاتب كان للنبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Prophet (ﷺ) has a secretary named Sijill.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3693",
      "hadith_no": "3693",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا وهب بن بقية، عن نوح بن قيس، حدثنا عبد الله بن عون، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال لوفد عبد القيس ‏\"‏ أنهاكم عن النقير والمقير والحنتم والدباء والمزادة المجبوبة ولكن اشرب في سقائك وأوكه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah (ﷺ) said to the deputation of 'Abd al-Qais: I forbid you the use of hollow stumps, vessels smeared with pitch, green harrs, pumpkins, and a skin cut off at the top, but drink from your skin and tie it with string.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20572",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2141",
      "hadith_no": "2141",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا نوح بن قيس، عن عبد الله بن عمران، عن عاصم الأحول، عن عبد الله بن سرجس المزني، أن النبي صلى الله عليه وسلم قال ‏\"‏ السمت الحسن والتؤدة والاقتصاد جزء من أربعة وعشرين جزءا من النبوة ‏\"‏ ‏.‏ وفي الباب عن ابن عباس ‏.‏ وهذا حديث حسن غريب ‏.‏",
      "text_en": " Abdullah bin Sarjis Al-Muzam narrated that the Messenger of Allah said:                     \"Taking the good route is a part of the twenty-four parts of Prophethood.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20572",
        "11080"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2142",
      "hadith_no": "2142",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، حدثنا نوح بن قيس، عن عبد الله بن عمران، عن عبد الله بن سرجس، عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عن عاصم والصحيح حديث نصر بن علي ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20572",
        "3245"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2651-2",
      "hadith_no": "2651",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا نوح بن قيس، عن أبي هارون العبدي، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ يأتيكم رجال من قبل المشرق يتعلمون فإذا جاءوكم فاستوصوا بهم خيرا ‏\"‏ ‏.‏ قال فكان أبو سعيد إذا رآنا قال مرحبا بوصية رسول الله صلى الله عليه وسلم ‏.‏ قال هذا حديث لا نعرفه إلا من حديث أبي هارون عن أبي سعيد الخدري ‏.‏",
      "text_en": " Narrated Abu Harun [Al-'Abdi]:                     from Abu Sa'eed Al-Khudri that the Prophet (ﷺ) said: \"Men will come to you from the direction of the east to learn. So when they come to you then exhort them to good.\" He said: \"When Abu Sa'eed saw us he would say: 'Welcome with the exhortation of the Messenger of Allah, may the peace and blessings of Allah be upon him and his family.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20572",
        "18767",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3413",
      "hadith_no": "3413",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا نوح بن قيس الحداني، عن عمرو بن مالك، عن أبي الجوزاء، عن ابن عباس، قال كانت امرأة تصلي خلف رسول الله صلى الله عليه وسلم - حسناء من أحسن الناس فكان بعض القوم يتقدم حتى يكون في الصف الأول لئلا يراها ويستأخر بعضهم حتى يكون في الصف المؤخر فإذا ركع نظر من تحت إبطيه فأنزل الله ‏:‏ ‏(‏ ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين ‏)‏ ‏.‏ قال أبو عيسى وروى جعفر بن سليمان هذا الحديث عن عمرو بن مالك عن أبي الجوزاء نحوه ولم يذكر فيه عن ابن عباس وهذا أشبه أن يكون أصح من حديث نوح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"There was a woman who performed Salat behind the Messenger of Allah (ﷺ) who was the most beautiful among the people. Some of the people would go forward to the first line so as not to see her. Others would go back to the last line so when he would bow, he could look at her from under his armpit. So Allah revealed: Indeed We know those who try to come forward among you, and We know those who try to go back (15:24).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-459",
      "hadith_no": "459",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا قتيبة، قال حدثنا نوح بن قيس، عن خالد بن قيس، عن قتادة، عن أنس، قال سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله كم افترض الله عز وجل على عباده من الصلوات قال ‏\"‏ افترض الله على عباده صلوات خمسا ‏\"‏ ‏.‏ قال يا رسول الله هل قبلهن أو بعدهن شيئا قال ‏\"‏ افترض الله على عباده صلوات خمسا ‏\"‏ ‏.‏ فحلف الرجل لا يزيد عليه شيئا ولا ينقص منه شيئا قال رسول الله صلى الله عليه وسلم ‏\"‏ إن صدق ليدخلن الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"A man asked the Messenger of Allah (ﷺ): 'O Messenger of Allah, how many prayers has Allah enjoined upon His slaves?' He said: 'Allah has enjoined upon His slaves (five) prayers.' He said: 'O Messenger of Allah, is there anything before them or after them?' He said: 'Allah has enjoined upon His salves (five) prayers.' The man swore that he would not do anything more or less than that. The Messenger of Allah (ﷺ) said: 'If he is speaking the truth he will most certainly enter Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20572",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-870",
      "hadith_no": "870",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا نوح، - يعني ابن قيس - عن ابن مالك، - وهو عمرو - عن أبي الجوزاء، عن ابن عباس، قال كانت امرأة تصلي خلف رسول الله صلى الله عليه وسلم حسناء من أحسن الناس - قال - فكان بعض القوم يتقدم في الصف الأول لئلا يراها ويستأخر بعضهم حتى يكون في الصف المؤخر فإذا ركع نظر من تحت إبطه فأنزل الله عز وجل ‏{‏ ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                      \"There was a woman who used to pray behind the Messenger of Allah (ﷺ) who was beautiful, one of the most beautiful of people. Some of the people used to go to the front row to avoid seeing her, and some used to go tothe back row so that when they bowed they could see her from beneath their armpits. Then Allah revealed the words: 'To Us areknown those of you who hasten forward and those who lag behind.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1099",
      "hadith_no": "1099",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حميد بن مسعدة، وأبو بكر بن خلاد قالا حدثنا نوح بن قيس، حدثنا عمرو بن مالك، عن أبي الجوزاء، عن ابن عباس، قال كانت امرأة تصلي خلف النبي  صلى الله عليه وسلم  حسناء من أحسن الناس فكان بعض القوم يستقدم في الصف الأول لئلا يراها ويستأخر بعضهم حتى يكون في الصف المؤخر فإذا ركع قال هكذا ينظر من تحت إبطه فأنزل الله ‏{ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين}‏ في شأنها ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A woman used to perform prayerbehind the Prophet (ﷺ), and she was one of the most beautiful ofpeople. Some of the people used to go into the first row so that theywould not see her, and some of them used to lag behind so that theywould be in the last row, and when they bowed, they would do likethisso that they could see her from beneath their armpits. ThenAllahrevealed: “And indeed, We know the first generations of youwho hadpassed away, and indeed, We know the present generations ofyou(mankind), and also those who will some afterwards.” [15:24]concerning her matter.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "30357",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1182",
      "hadith_no": "1182",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا نوح بن قيس، عن أخيه، عن قتادة، عن الحسن، عن سمرة بن جندب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من ترك الجمعة متعمدا فليتصدق بدينار فإن لم يجد فبنصف دينار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Samurah bin Jundab that the Prophet (ﷺ) said:                     “Whoever abandons Friday deliberately, let him give a Dinar incharity, and if he cannot afford that, then (let him give) half aDinar.”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20572",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "id": "sunan-ibn-majah-4194",
      "hadith_no": "4194",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا نوح بن قيس، حدثنا عبد الله بن معقل، عن يزيد الرقاشي، عن أنس بن مالك، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أمتي على خمس طبقات فأربعون سنة أهل بر وتقوى ثم الذين يلونهم إلى عشرين ومائة سنة أهل تراحم وتواصل ثم الذين يلونهم إلى ستين ومائة سنة أهل تدابر وتقاطع ثم الهرج الهرج النجا النجا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                      “My nation will pass through five stages. For forty years(theywill be) people of righteousness and piety. Then those whofollowthem, for the next one hundred and twenty years, will bepeople whoshow mercy to one another and uphold ties with oneanother. Then thosewho follow them for the next one hundred andsixty years will bepeople who will turn their backs on one anotherand sever ties withone another. Then there will be Harj after Harj(killing). Seekdeliverance, seek deliverance.”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20572",
        "18580",
        "14422",
        "19"
      ]
    }
  ],
  "total_hadiths": 13
}