{
  "id": "20574",
  "name": "Yahya bin Hmad bin Aby يحيى بن حماد بن أبي زياد الشيباني",
  "full_name": "Yahya bin Hmad bin Aby يحيى بن حماد بن أبي زياد الشيباني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "215",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  خد  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20216",
      "name": "Jawayriyya bin Asma' bin 'Ubaid جويرية بن أسماء بن عبيد الضبعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30496",
      "name": "Ibrahim bin Dinar al-Bghdady إبراهيم بن دينار البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30131",
      "name": "al-Hasan bin Mdrk bin Bashyr الحسن بن مدرك بن بشير",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30289",
      "name": "Ahmed bin Ishaq bin al-Husain أحمد بن إسحاق بن الحصين",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38198",
      "name": "Hameedd bin Zanjuya حميد بن مخلد بن قتيبة - بن زنجويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38247",
      "name": "Sulaiman bin Syf bin Yahya سليمان بن سيف بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30172",
      "name": "Muhammad bin Ma'mar bin Rabi' محمد بن معمر بن ربعي القيسي البحراني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-333",
      "hadith_no": "333",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا الحسن بن مدرك، قال حدثنا يحيى بن حماد، قال أخبرنا أبو عوانة  اسمه الوضاح  من كتابه قال أخبرنا سليمان الشيباني، عن عبد الله بن شداد، قال سمعت خالتي، ميمونة  زوج النبي صلى الله عليه وسلم أنها كانت تكون حائضا لا تصلي، وهى مفترشة بحذاء مسجد رسول الله صلى الله عليه وسلم وهو يصلي على خمرته، إذا سجد أصابني بعض ثوبه‏.‏",
      "text_en": " Narrated Maimuna:                     (the wife of the Prophet) During my menses, I never prayed, but used to sit on the mat beside the mosque of Allah's Apostle. He used to offer the prayer on his sheet and in prostration some of his clothes used to touch me.\"",
      "usc_msa_ref": "329",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11352",
        "169"
      ]
    },
    {
      "id": "sahih-bukhari-3923",
      "hadith_no": "3923",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن حماد، حدثنا أبو عوانة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال كنا نسلم على النبي صلى الله عليه وسلم وهو يصلي فيرد علينا، فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا، فقلنا يا رسول الله إنا كنا نسلم عليك فترد علينا قال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏ فقلت لإبراهيم كيف تصنع أنت قال أرد في نفسي‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to greet the Prophet while he used to be in prayers, and he used to reply to our greetings. But when we came back from Najashi (the King of Ethiopia) we greeted him (while he was praying) and he did not reply to us. We said, \"O Allah's Apostle! We used to greet you in the past and you used to reply to us.\" He said, \"Verily The Mind is occupied and busy with more important matter during the prayer.\" (So one cannot return One's greetings.)",
      "usc_msa_ref": "215",
      "chain": [
        "20574",
        "20469",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-3996",
      "hadith_no": "3996",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني الحسن بن مدرك، حدثنا يحيى بن حماد، أخبرنا أبو عوانة، عن عاصم الأحول، عن أبي عثمان، عن سلمان، قال فترة بين عيسى ومحمد صلى الله عليه وسلم ستمائة سنة‏.‏",
      "text_en": " Narrated Salman:                     The interval between Jesus and Muhammad was six hundred years.",
      "usc_msa_ref": "284",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11080",
        "11113"
      ]
    },
    {
      "id": "sahih-bukhari-4079",
      "hadith_no": "4079",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني الحسن بن مدرك، حدثنا يحيى بن حماد، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، قال قلت لابن عباس سورة الحشر‏.‏ قال قل سورة النضير‏.‏ تابعه هشيم عن أبي بشر‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I mentioned to Ibn `Abbas Surat-Hashr. He said, \"Call it Surat-an-Nadir.\"",
      "usc_msa_ref": "363",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-4932",
      "hadith_no": "4932",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن مدرك، حدثنا يحيى بن حماد، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد، قال قلت لابن عباس  رضى الله عنهما  سورة الحشر قال قل سورة النضير‏.‏",
      "text_en": " Narrated Sa`id:                     I asked Ibn `Abbas about Surat Al-Hashr. He replied, \"Say Surat An-Nadir.\"",
      "usc_msa_ref": "405",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11419",
        "11168"
      ]
    },
    {
      "id": "sahih-bukhari-4981",
      "hadith_no": "4981",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "قال يحيى بن حماد أخبرنا أبو عوانة، عن مغيرة، عن إبراهيم، عن علقمة، عن عبد الله،‏.‏ وقال ابن إسحاق عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله،‏.‏ حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن الأسود، قال قال عبد الله بينا نحن مع رسول الله صلى الله عليه وسلم في غار إذ نزلت عليه والمرسلات فتلقيناها من فيه وإن فاه لرطب بها إذ خرجت حية فقال رسول الله صلى الله عليه وسلم ‏\"‏ عليكم اقتلوها ‏\"‏‏.‏ قال فابتدرناها فسبقتنا  قال  فقال ‏\"‏ وقيت شركم، كما وقيتم شرها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were with Allah's Apostle in a cave, Surat \"Wal Mursalat\" was revealed to him and we received it directly from his mouth as soon as he had received the revelation. Suddenly a snake came out and Allah's Apostle said, \"Get at it and kill it!\" We ran to kill it but it outstripped us. Allah's Apostle said, \"It has escaped your evil, as you too, have escaped its.\"",
      "usc_msa_ref": "454",
      "chain": [
        "20574",
        "20469",
        "11072",
        "11051",
        "11017",
        "11107",
        "11056",
        "11054",
        "30367",
        "20028",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "id": "sahih-bukhari-5698",
      "hadith_no": "5698",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا الحسن بن مدرك، قال حدثني يحيى بن حماد، أخبرنا أبو عوانة، عن عاصم الأحول، قال رأيت قدح النبي صلى الله عليه وسلم عند أنس بن مالك، وكان قد انصدع فسلسله بفضة قال وهو قدح جيد عريض من نضار‏.‏ قال قال أنس لقد سقيت رسول الله صلى الله عليه وسلم في هذا القدح أكثر من كذا وكذا‏.‏ قال وقال ابن سيرين إنه كان فيه حلقة من حديد فأراد أنس أن يجعل مكانها حلقة من ذهب أو فضة فقال له أبو طلحة لا تغيرن شيئا صنعه رسول الله صلى الله عليه وسلم فتركه‏.‏",
      "text_en": " Narrated `Asim al-Ahwal:                     I saw the drinking bowl of the Prophet with Anas bin Malik, and it had been broken, and he had mended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas said, \"I gave water to the Prophet in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: Around that bowl there was an iron ring, and Anas wanted to replace it with a silver or gold ring, but Abu Talha said to him, \"Do not change a thing that Allah's Apostle has made.\" So Anas left it as it was.",
      "usc_msa_ref": "",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11080"
      ]
    },
    {
      "id": "sahih-bukhari-6510",
      "hadith_no": "6510",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن حماد، حدثنا أبو عوانة، عن بيان، عن قيس بن أبي حازم، عن مرداس الأسلمي، قال قال النبي صلى الله عليه وسلم ‏\"‏ يذهب الصالحون الأول فالأول، ويبقى حفالة كحفالة الشعير أو التمر، لا يباليهم الله بالة ‏\"‏‏.‏ قال أبو عبد الله يقال حفالة وحثالة‏.‏",
      "text_en": " Narrated Mirdas Al-Aslami:                     The Prophet said, \"The righteous (pious people will depart (die) in succession one after the other, and there will remain (on the earth) useless people like the useless husk of barley seeds or bad dates.",
      "usc_msa_ref": "442",
      "chain": [
        "20574",
        "20469",
        "11326",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-6655",
      "hadith_no": "6655",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن حماد، حدثنا أبو عوانة، عن سليمان، عن شقيق، عن عبد الله، عن النبي صلى الله عليه وسلم ‏\"‏ أنا فرطكم، على الحوض ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20574",
        "20469",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-275",
      "hadith_no": "275",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، وإبراهيم بن دينار، جميعا عن يحيى بن حماد، - قال ابن المثنى حدثني يحيى بن حماد، - أخبرنا شعبة، عن أبان بن تغلب، عن فضيل الفقيمي، عن إبراهيم النخعي، عن علقمة، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏ قال رجل إن الرجل يحب أن يكون ثوبه حسنا ونعله حسنة ‏.‏ قال ‏\"‏ إن الله جميل يحب الجمال الكبر بطر الحق وغمط الناس ‏\"‏ ‏.‏",
      "text_en": " It Is narrated on the authority of Abdullah b. Mas'ud that the Apostle of Allah (may peace be upon him), observed:                      He who has in his heart the weight of a mustard seed of pride shall not enter Paradise. A person (amongst his hearers) said: Verily a person loves that his dress should be fine, and his shoes should be fine. He (the Holy Prophet) remarked: Verily, Allah is Graceful and He loves Grace. Pride is disdaining the truth (out of self-conceit) and contempt for the people.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "30496",
        "20574",
        "20574",
        "20020",
        "20577",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-4007",
      "hadith_no": "4007",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن حماد، حدثنا أبو عوانة، عن سليمان، حدثنا أبو سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من كانت له أرض فليهبها أو ليعرها ‏\"‏ ‏.‏",
      "text_en": "  Jabir (Allah he pleased with him) reported:                      I heard Allah's Apostle (may peace be upon him) as saying: He who has (surplus) land should donate it (to others), or lend it.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20574",
        "20469",
        "11060",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4038",
      "hadith_no": "4038",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن حماد، أخبرنا أبو عوانة، عن سليمان، الشيباني عن عبد الله بن السائب، قال دخلنا على عبد الله بن معقل فسألناه عن المزارعة، فقال زعم ثابت أن رسول الله صلى الله عليه وسلم نهى عن المزارعة وأمر بالمؤاجرة وقال ‏\"‏ لا بأس بها ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. al-Sa'ib reported:                      We visited 'Abdullah b. Ma'qil and asked him about sharing of crops, whereupon he said: Thabit alleged that Allah's Messenger (may peace be upon him) forbade Muzara'a and commanded leasing it out on rent (for money) and said: There is no harm in it.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20574",
        "20469",
        "11352",
        "2065"
      ]
    },
    {
      "id": "sahih-muslim-4554",
      "hadith_no": "4554",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن علية - عن ابن أبي عروبة، عن عبد الله الداناج، ح وحدثنا إسحاق، بن إبراهيم الحنظلي - واللفظ له - أخبرنا يحيى بن حماد، حدثنا عبد العزيز بن المختار، حدثنا عبد الله بن فيروز، مولى ابن عامر الداناج حدثنا حضين بن المنذر أبو ساسان، قال شهدت عثمان بن عفان وأتي بالوليد قد صلى الصبح ركعتين ثم قال أزيدكم فشهد عليه رجلان أحدهما حمران أنه شرب الخمر وشهد آخر أنه رآه يتقيأ فقال عثمان إنه لم يتقيأ حتى شربها فقال يا علي قم فاجلده ‏.‏ فقال علي قم يا حسن فاجلده ‏.‏ فقال الحسن ول حارها من تولى قارها - فكأنه وجد عليه - فقال يا عبد الله بن جعفر قم فاجلده ‏.‏ فجلده وعلي يعد حتى بلغ أربعين فقال أمسك ‏.‏ ثم قال جلد النبي صلى الله عليه وسلم أربعين وجلد أبو بكر أربعين وعمر ثمانين وكل سنة وهذا أحب إلى ‏.‏ زاد علي بن حجر في روايته قال إسماعيل وقد سمعت حديث الداناج منه فلم أحفظه ‏.‏",
      "text_en": " Hudain b. al-Mundhir Abu Sasan reported:                      I saw that Walid was brought to Uthmin b. 'Affan as he had prayed two rak'ahs of the dawn prayer, and then he said: I make an increase for you. And two men bore witness against him. One of them was Humran who said that he had drunk wine. The second one gave witness that he had seen him vomiting. Uthman said: He would not have vomited (wine) unless he had drunk it. He said: 'Ali, stand up and lash him. 'Ali said: Hasan, stand up and lash him. Thereupon Hasan said: Let him suffer the heat (of Caliphate) who has enjoyed its coolness. ('Ali felt annoyed at this remark) and he said: 'Abdullah b. Ja'far, stand up and flog him, and he began to flog him and 'Ali counted the stripes until these were forty. He (Hadrat 'Ali) said: Stop now, and then said: Allah's Apostle (may peace be upon him) gave forty stripes, and Abu Bakr also gave forty stripes, and Umar gave eighty stripes, and all these fall under the category of the Sunnab, but this one (forty stripes) is dearer to me.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20387",
        "20208",
        "11073",
        "30123",
        "20574",
        "20252"
      ]
    },
    {
      "id": "sahih-muslim-6132",
      "hadith_no": "6132",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا يحيى بن حماد، حدثنا شعبة، عن قتادة، عن سالم، بن أبي الجعد عن معدان، عن ثوبان، عن النبي صلى الله عليه وسلم حديث الحوض فقلت ليحيى بن حماد هذا حديث سمعته من أبي عوانة فقال وسمعته أيضا من شعبة فقلت انظر لي فيه فنظر لي فيه فحدثني به ‏.‏",
      "text_en": " Thaubin reported this hadith pertaining to the Cistern. Muhammad b. Bashshar said:                      I said to Yahya b. Hammad: This is the hadith that I heard from Abu 'Awana and he said: I also heard it from Shu'ba. I said: Narrate that to me and he narrated that to me.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20574",
        "20020",
        "11019",
        "11342",
        "130"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1324",
      "hadith_no": "1324",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يحيى بن حماد، عن أبي عوانة، عن عبد الأعلى الثعلبي، عن بلال بن مرداس الفزاري، عن خيثمة، وهو البصري عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من ابتغى القضاء وسأل فيه شفعاء وكل إلى نفسه ومن أكره عليه أنزل الله عليه ملكا يسدده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وهو أصح من حديث إسرائيل عن عبد الأعلى ‏.‏",
      "text_en": " Anas narrated that the Prophet (ﷺ) said:                      \"Whoever seeks to be a judge, and asks others to intercede for him with it, then he will be left on his own. And whoever is coerced into it, Allah sends an angel down to him so that he can be correct.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20574",
        "20469",
        "28070",
        "11332",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2130",
      "hadith_no": "2130",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن المثنى، وعبد الله بن عبد الرحمن، قالا حدثنا يحيى بن حماد، حدثنا شعبة، عن أبان بن تغلب، عن فضيل بن عمرو، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ولا يدخل النار يعني من كان في قلبه مثقال ذرة من إيمان ‏\"‏ ‏.‏ قال فقال له رجل إنه يعجبني أن يكون ثوبي حسنا ونعلي حسنة ‏.‏ قال ‏\"‏ إن الله يحب الجمال ولكن الكبر من بطر الحق وغمص الناس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقال بعض أهل العلم في تفسير هذا الحديث ‏\"‏ لا يدخل النار من كان في قلبه مثقال ذرة من إيمان ‏\"‏ ‏.‏ إنما معناه لا يخلد في النار ‏.‏ وهكذا روي عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم قال ‏\"‏ يخرج من النار من كان في قلبه مثقال ذرة من إيمان ‏\"‏ ‏.‏ وقد فسر غير واحد من التابعين هذه الآية ‏:‏ ‏(‏ربنا إنك من تدخل النار فقد أخزيته ‏)‏ ‏.‏ فقال من تخلد في النار فقد أخزيته ‏.‏",
      "text_en": " Abdullah narrated:                      \"The Messenger of Allah said:'Whoever has a speck of pride (arrogance) in his heart, shall not be admitted into Paradise. And whoever has a speck of faith in his heart, shall not be admitted in to the Fire.'\" Ha said: \"So a man said to him: 'I like for my clothes to be nice, and my sandals to be nice?' So he said: 'Indeed Allah loves beauty. But pride is refusing the truth and betelling the people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30025",
        "20574",
        "20020",
        "20577",
        "10810",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4259",
      "hadith_no": "4259",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، ومحمد بن بشار، واللفظ، لابن يعقوب قالا حدثنا يحيى بن حماد، حدثنا عبد العزيز بن المختار، حدثنا خالد الحذاء، عن أبي عثمان النهدي، عن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم استعمله على جيش ذات السلاسل ‏.‏ قال فأتيته فقلت يا رسول الله أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قلت من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Amr bin Al-'As:                     that the Messenger of Allah (ﷺ) appointed him as a leader of the army of Dhatis-Salasil. He said: \"So I went to him and said: 'O Messenger of Allah! Who is the most beloved to you among the people?' He said: ''Aishah.' I said: 'From the men?' He said: 'Her father.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30160",
        "20574",
        "20252",
        "11282",
        "11113",
        "28"
      ]
    },
    {
      "id": "sunan-an-nasai-2225",
      "hadith_no": "2225",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن حماد، قال حدثنا أبو عوانة، عن سليمان، عن حبيب بن أبي ثابت، والحكم، عن ميمون بن أبي شبيب، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصوم جنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muadh bin Jabal said:                     \"The Messenger of Allah said: 'Fasting is a shield.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20574",
        "20469",
        "11060",
        "11331",
        "11069",
        "10834",
        "32"
      ]
    },
    {
      "id": "sunan-an-nasai-2389",
      "hadith_no": "2389",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا يحيى بن حماد، قال حدثنا أبو عوانة، عن مغيرة، عن مجاهد، قال قال لي عبد الله بن عمرو أنكحني أبي امرأة ذات حسب فكان يأتيها فيسألها عن بعلها، فقالت نعم الرجل من رجل لم يطأ لنا فراشا ولم يفتش لنا كنفا منذ أتيناه ‏.‏ فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ ائتني به ‏\"‏ ‏.‏ فأتيته معه فقال ‏\"‏ كيف تصوم ‏\"‏ ‏.‏ قلت كل يوم ‏.‏ قال ‏\"‏ صم من كل جمعة ثلاثة أيام ‏\"‏ ‏.‏ قلت إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ صم يومين وأفطر يوما ‏\"‏ ‏.‏ قال إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ صم أفضل الصيام صيام داود عليه السلام صوم يوم وفطر يوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muhajid said:                     \"Abdullah bin 'Amr said to me: My father got me married to a woman from a noble family, and he used to come to her and ask her about her husband. She said: What a wonderful man he is! He never comes to my bed. And he has never approached me since he married me. He mentioned that to the Prophet and he said: Bring him to me. So he brought him with him and (the Prophet) said: How do you fast? I said: \"Every day.\" He said: \"Fast three days of every month.\" I said: \"I am able to do better than that.\" He said: \"Fast for two days, and break your fast for one day.\" He said; \"I am able to do better than that\". He said: \"Observe the best of fasts, the fast of Dawud, peace be upon him: Fasting for one day and breaking the fast for one day.\" 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20574",
        "20469",
        "11072",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-2541",
      "hadith_no": "2541",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يحيى بن حماد، قال أنبأنا أبو عوانة، عن فراس، عن عامر، عن مسروق، عن عائشة، رضى الله عنها أن أزواج، النبي صلى الله عليه وسلم اجتمعن عنده فقلن أيتنا بك أسرع لحوقا فقال ‏\"‏ أطولكن يدا ‏\"‏ ‏.‏ فأخذن قصبة فجعلن يذرعنها فكانت سودة أسرعهن به لحوقا فكانت أطولهن يدا فكان ذلك من كثرة الصدقة ‏.‏",
      "text_en": " It was narrated from 'Aishah, may Allah be pleased with her, that the wives of the Prophet \"gathered around him and said:                     \"Which of us will be the first to following you (in death)?\" He said: \"The one of you who has the longest arms.\" They took a stick and started to measure their arms. But Sawdah was the first one to follow him. She was the one who had the longest arms, because she used to give in charity a great deal.",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20574",
        "20469",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4074",
      "hadith_no": "4074",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، عن يحيى بن حماد، قال حدثنا أبو عوانة، عن سليمان، عن عمرو بن مرة، عن أبي البختري، عن أبي برزة، قال تغيظ أبو بكر على رجل فقال لو أمرتني لفعلت ‏.‏ قال أما والله ما كانت لبشر بعد محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah said:                     \"Abu Bakr became infuriated with a man.\" He said: \"If you tell me to, I will do it.\" He said: \"By Allah, that is not for any human being after Muhammad [SAW].\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20574",
        "20469",
        "11060",
        "11381",
        "11347",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4729",
      "hadith_no": "4729",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا يحيى بن حماد، عن أبي عوانة، عن إسماعيل بن سالم، عن علقمة بن وائل، أن أباه، حدثهم أن النبي صلى الله عليه وسلم أتي برجل قد قتل رجلا فدفعه إلى ولي المقتول يقتله فقال النبي صلى الله عليه وسلم لجلسائه ‏\"‏ القاتل والمقتول في النار ‏\"‏ ‏.‏ قال فاتبعه رجل فأخبره فلما أخبره تركه ‏.‏ قال فلقد رأيته يجر نسعته حين تركه يذهب ‏.‏ فذكرت ذلك لحبيب فقال حدثني سعيد بن أشوع قال وذكر أن النبي صلى الله عليه وسلم أمر الرجل بالعفو ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Wa'il that:                     his father told them that a man who had killed another man was brought to the Prophet and he handed him over to their of the victim to kill him. Then the Prophet said to those who were sitting with him: \"The killer and the slain will both be in Fire. \"A man went after him and told him that, and when he told him that, he left him (let him go). He (the narrator) said: \"I saw him dragging his string when he let him go. I mentioned that the Habib and he said: 'Sa'eed bin Ashwa' told me that the Prophet commanded the man to forgive him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20574",
        "20469",
        "30415",
        "10801"
      ]
    },
    {
      "id": "sunan-an-nasai-4980",
      "hadith_no": "4980",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا الحسن بن مدرك، قال حدثنا يحيى بن حماد، قال حدثنا أبو عوانة، عن عمر، - وهو ابن أبي سلمة - عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا سرق العبد فبعه ولو بنش ‏\"‏ ‏.‏ قال أبو عبد الرحمن عمر بن أبي سلمة ليس بالقوي في الحديث ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"If a slave steals, then sell him, even for half price.\" (Hasan)Abu 'Abdur-Rahman (An-Nasai) said: 'Umar bin Abi Salamah is not strong in Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30131",
        "20574",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5108",
      "hadith_no": "5108",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا يحيى بن حماد، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن العريان بن الهيثم، عن قبيصة بن جابر، عن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يلعن المتنمصات والمتفلجات والموتشمات اللاتي يغيرن خلق الله عز وجل ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I heard the Messenger of Allah [SAW] cursing Al-Mutanammisat, women who have their teeth separated, and women who have tattoos done, those who change the creation of Allah, the Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20574",
        "20469",
        "11368",
        "15367",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-1834",
      "hadith_no": "1834",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يحيى بن حماد، حدثنا أبو عوانة، عن سليمان، عن أبي صالح، عن أبي سعيد، قال نهى رسول الله  صلى الله عليه وسلم  النساء أن يصمن إلا بإذن أزواجهن ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)forbade women from fasting without the permission of their husbands.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20574",
        "20469",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-2062",
      "hadith_no": "2062",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، والحسن بن مدرك الطحان، قالا حدثنا يحيى بن حماد، حدثنا أبو عوانة، عن داود بن عبد الله الأودي، عن عبد الرحمن المسلي، عن الأشعث بن قيس، قال ضفت عمر ليلة فلما كان في جوف الليل قام إلى امرأته يضربها فحجزت بينهما فلما أوى إلى فراشه قال لي يا أشعث احفظ عني شيئا سمعته من رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يسأل الرجل فيم يضرب امرأته ولا تنم إلا على وتر ‏\"‏ ‏.‏ ونسيت الثالثة ‏.‏",
      "text_en": " It was narrated that Ash'ath bin Qais said:                     \"I was a guest (at the home) of 'Umar one night, and in the middle of the night he went and hit his wife, and I separated them. When he went to bed he said to me: 'O Ash'ath, learn from me something that I heard from the Messenger of Allah\" A man should not be asked why he beats his wife, and do not go to sleep until you have prayed the Witr.\"' And I forgot the third thing.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30131",
        "20574",
        "20469",
        "15333",
        "485"
      ]
    }
  ],
  "total_hadiths": 26
}