{
  "id": "20578",
  "name": "al-Ahwas bin Jawab الأحوص بن جواب",
  "full_name": "al-Ahwas bin Jawab الأحوص بن جواب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "211",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20654",
      "name": "S'yr bin al-Khms al-Tmymy Abu سعير بن الخمس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20595",
      "name": "'Ammar bin Razayq عمار بن رزيق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30437",
      "name": "'Abbas bin 'Abdul 'Azeem al-'Anbari عباس بن عبد العظيم العنبري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-358",
      "hadith_no": "358",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، ح وحدثني محمد بن عمرو بن جبلة بن أبي رواد، وأبو بكر بن إسحاق قالا حدثنا أبو الجواب، عن عمار بن رزيق، كلاهما عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " The same hadith has been transmitted by Muhammad b. 'Amr, Abu Baker b. Ishaq, Abu'l-Jawwab, A'mash and Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "20020",
        "30452",
        "11108",
        "20578",
        "20595",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4008",
      "hadith_no": "4008",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا أبو الجواب، حدثنا عمار بن رزيق، عن الأعمش، بهذا الإسناد غير أنه قال ‏\"‏ فليزرعها أو فليزرعها رجلا ‏\"‏ ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of A'mash with the same chain of transmitters, but with a slight change of words.",
      "usc_msa_ref": "",
      "chain": [
        "20578",
        "20595"
      ]
    },
    {
      "id": "sahih-muslim-5431",
      "hadith_no": "5431",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة بن أبي رواد، حدثنا أبو الجواب، حدثنا عمار، - وهو ابن رزيق - عن الأعمش، عن أبي سفيان، عن جابر، ح",
      "text_en": " This hadith has been transmitted on the authority of Jabir also.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20578",
        "20595",
        "11060",
        "116"
      ]
    },
    {
      "id": "sahih-muslim-6889",
      "hadith_no": "6889",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثنيه بشر، بن خالد أخبرنا محمد، - يعني ابن جعفر - كلاهما عن شعبة، ح وحدثنا ابن نمير، حدثنا  أبو الجواب، حدثنا سليمان بن قرم، جميعا عن سليمان، عن أبي وائل، عن عبد الله، عن  النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of 'Abdullah.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20276",
        "20173",
        "20020",
        "30212",
        "20578",
        "24180",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-992",
      "hadith_no": "992",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا الفضل بن سهل، قال حدثني أبو الجواب، قال حدثنا عمار بن رزيق، عن أبي إسحاق، عن إبراهيم بن مهاجر، عن مجاهد، عن ابن عمر، قال رمقت رسول الله صلى الله عليه وسلم عشرين مرة يقرأ في الركعتين بعد المغرب وفي الركعتين قبل الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"I watched the Messenger of Allah (ﷺ)- twenty times- reciting in the two rak'ahs after maghrib 'Say: O you disbelievers' and 'Say: He is Allah, (the) One.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30264",
        "20578",
        "20595",
        "11049",
        "10739",
        "11028",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3549",
      "hadith_no": "3549",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني أبو بكر بن إسحاق الصاغاني، قال حدثنا أبو الجواب، قال حدثنا عمار، - هو ابن رزيق - عن أبي إسحاق، عن الشعبي، عن فاطمة بنت قيس، قالت طلقني زوجي فأردت النقلة فأتيت رسول الله صلى الله عليه وسلم فقال ‏\"‏ انتقلي إلى بيت ابن عمك عمرو ابن أم مكتوم فاعتدي فيه ‏\"‏ ‏.‏ فحصبه الأسود وقال ويلك لم تفتي بمثل هذا ‏.‏ قال عمر إن جئت بشاهدين يشهدان أنهما سمعاه من رسول الله صلى الله عليه وسلم وإلا لم نترك كتاب الله لقول امرأة ‏{‏ لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة ‏}‏ ‏.‏",
      "text_en": " It was narrated that Fatimah bint Qais said:                      \"My husband divorced me and I wanted to move, so I went to the Messenger of Allah and he said: 'Move to the house of your paternal cousin 'Amr bin Umm Maktum, and observe your 'Iddah there.'\" Al-Aswad hit him (Ash-Sha'bi) with a pebble and said: \"Woe be to you! Why do you issue such a Fatwa? 'Umar said: 'If you bring two witnesses who will testify that they heard that from the Messenger of Allah (we will believe you), otherwise, we will not leave the Book of Allah for the word of a woman.' 'And turn them not out of their (husband's) homes nor shall they (themselves) leave, except in case they are guilty of some open Fahishah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20578",
        "20595",
        "11049",
        "11052",
        "224"
      ]
    },
    {
      "id": "sunan-an-nasai-4772",
      "hadith_no": "4772",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني أبو بكر بن إسحاق، قال حدثنا أبو الجواب، قال حدثنا عمار، عن محمد بن عبد الرحمن بن أبي ليلى، عن الحكم، عن محمد بن مسلم، عن صفوان بن يعلى، أن أباه، غزا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فاستأجر أجيرا فقاتل رجلا فعض الرجل ذراعه فلما أوجعه نترها فأندر ثنيته فرفع ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ يعمد أحدكم فيعض أخاه كما يعض الفحل ‏\"‏ ‏.‏ فأبطل ثنيته ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la that:                     his father wen on the campaign of Tabuk with the Messenger of Allah, and he hired a man who fought with another man. The man bit his forearm, and when it hurt him, he pulled it away, and the man's front tooth fell out. The matter was referred to the Messenger of Allah who said: \"Would one of you deliberately bit his brother as a stallion bites?\" And he judged it to be invalid.",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20578",
        "25",
        "11069",
        "167",
        "11248"
      ]
    },
    {
      "id": "sunan-an-nasai-4900",
      "hadith_no": "4900",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا أبو الجواب، قال حدثنا عمار بن رزيق، عن محمد بن عبد الرحمن بن أبي ليلى، عن إسماعيل بن أمية، عن محمد بن مسلم، عن عروة، عن عائشة، قالت سرقت امرأة من قريش من بني مخزوم فأتي بها النبي صلى الله عليه وسلم فقالوا من يكلمه فيها قالوا أسامة بن زيد ‏.‏ فأتاه فكلمه فزبره وقال ‏\"‏ إن بني إسرائيل كانوا إذا سرق فيهم الشريف تركوه وإذا سرق الوضيع قطعوه والذي نفسي بيده لو أن فاطمة بنت محمد سرقت لقطعتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"A woman of Quraish, from banu Makhzum, stole, and she was brought to the Prophet. They said: 'Who will speak to him concerning her?' They said: 'Usamah bin Zaid.' So he came to the Prophet and spoke to him. But he rebuked him, and he said; 'Among the Children of Israel, if a noble person stole, they would let him go. But if a low-class person stole, they would cut off his hand. By the One in whose hand is the soul of Muhammad, if Fatimah bint Muhammad were to steal, I would cut off her hand.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20578",
        "20595",
        "11417",
        "167",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 8
}