{
  "id": "20584",
  "name": "Khlf bin Khlyfh خلف بن خليفة",
  "full_name": "Khlf bin Khlyfh خلف بن خليفة",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "181",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Wasit",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ بخ  م  4  -  صحابي ]"
    ],
    "tags": [
      "al-Ashja'i",
      "Client",
      "al-Kufa",
      "Wasit",
      "Baghdad"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:No Doubt] [ بخ  م  4  -  صحابي ]",
        "ar": "Narrator[Grade:No Doubt] [ بخ  م  4  -  صحابي ]",
        "ckb": "Narrator[Grade:No Doubt] [ بخ  م  4  -  صحابي ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      },
      {
        "en": "Wasit",
        "ar": "واسط",
        "ckb": "واسیت"
      },
      {
        "en": "Baghdad",
        "ar": "بغداد",
        "ckb": "بەغداد"
      }
    ],
    "tags_display": [
      {
        "en": "al-Ashja'i",
        "ar": "al-Ashja'i",
        "ckb": "al-Ashja'i"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      },
      {
        "en": "Wasit",
        "ar": "Wasit",
        "ckb": "Wasit"
      },
      {
        "en": "Baghdad",
        "ar": "Baghdad",
        "ckb": "Baghdad"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18204",
      "name": "Hafs bin Akhi Anas حفص بن أخي أنس",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')",
      "grade_display": {
        "en": "Follower (Tabi')",
        "ar": "تابعي",
        "ckb": "شوێنكەوتوو (تابعی)"
      }
    },
    {
      "id": "10845",
      "name": "Yazid bin Kysan al-Yshkry يزيد بن كيسان اليشكري أبو إسماعيل",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30250",
      "name": "Surayj bin al-Nu'man al-Juhari سريج بن النعمان الجوهري اللؤلؤي",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30252",
      "name": "Sa'id bin Sulaiman al-Dabi سعيد بن سليمان - سعدويه الضبي",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30357",
      "name": "'Abdur Rahman bin 'Abdul Malik bin Shayb عبد الرحمن بن عبد الملك بن شيبة",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-250-2",
      "hadith_no": "250",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا خلف، - يعني ابن خليفة - عن أبي مالك الأشجعي، عن أبي حازم، قال كنت خلف أبي هريرة وهو يتوضأ للصلاة فكان يمد يده حتى تبلغ إبطه فقلت له يا أبا هريرة ما هذا الوضوء فقال يا بني فروخ أنتم ها هنا لو علمت أنكم ها هنا ما توضأت هذا الوضوء سمعت خليلي صلى الله عليه وسلم يقول ‏\"‏ تبلغ الحلية من المؤمن حيث يبلغ الوضوء ‏\"‏ ‏.‏",
      "text_en": " Abu Hazim reported:                      I was (standing) behind Abu Huraira and he was performing the ablution for prayer. He extended the (washing) of his hand that it went up to his armpit. I said to him: O Abu Huraira, what is this ablution? He said: O of the tribe of Faruukh, you are here; if I knew that you were here, I would have never performed ablution like this; I have heard my Friend (may peace be upon him) say. In a believer adornment would reach the places where ablution reaches.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "10766",
        "11349",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-475-2",
      "hadith_no": "475",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن عون بن أبي عون، حدثنا خلف بن خليفة الأشجعي أبو أحمد، عن الوليد بن سريع، مولى آل عمرو بن حريث عن عمرو بن حريث، قال صليت خلف النبي صلى الله عليه وسلم الفجر فسمعته يقرأ ‏{‏ فلا أقسم بالخنس * الجوار الكنس‏}‏ وكان لا يحني رجل منا ظهره حتى يستتم ساجدا ‏.‏",
      "text_en": " 'Amr b. Huraith reported:                      I said the dawn prayer behind the Apostle of (may peace be upon him) and heard him reciting: 'Nay. I call to witness the stars, running their courses and setting\" (al-Qur'an, lxxxi. 15-16) and Done of us bent his back till he completed prostration.",
      "usc_msa_ref": "",
      "chain": [
        "20584",
        "10837",
        "5202"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5434",
      "hadith_no": "5434",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خلف بن خليفة، عن يزيد بن كيسان، عن  أبي حازم، عن أبي هريرة، قال خرج رسول الله صلى الله عليه وسلم ذات يوم أو ليلة فإذا هو بأبي بكر وعمر فقال ‏\"‏ ما أخرجكما من بيوتكما هذه الساعة ‏\"‏ ‏.‏ قالا الجوع يا رسول الله ‏.‏ قال ‏\"‏ وأنا والذي نفسي بيده لأخرجني الذي أخرجكما قوموا ‏\"‏ ‏.‏ فقاموا معه فأتى رجلا من الأنصار فإذا هو ليس في بيته فلما رأته المرأة قالت مرحبا وأهلا ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أين فلان ‏\"‏ ‏.‏ قالت ذهب يستعذب لنا من الماء ‏.‏ إذ جاء الأنصاري فنظر إلى رسول الله صلى الله عليه وسلم وصاحبيه ثم قال الحمد لله ما أحد اليوم أكرم أضيافا مني - قال - فانطلق فجاءهم بعذق فيه بسر وتمر ورطب فقال كلوا من هذه ‏.‏ وأخذ المدية فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إياك والحلوب ‏\"‏ ‏.‏ فذبح لهم فأكلوا من الشاة ومن ذلك العذق وشربوا فلما أن شبعوا ورووا قال رسول الله صلى الله عليه وسلم لأبي بكر وعمر ‏\"‏ والذي نفسي بيده لتسألن عن هذا النعيم يوم القيامة أخرجكم من بيوتكم الجوع ثم لم ترجعوا حتى أصابكم هذا النعيم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) went out (of his house) one day or one night, and there he found Abu Bakr and 'Umar also. He said:                      What has brought you out of your houses at this hour? They said: Allah's Messenger, it is hunger. Thereupon he said: By Him in Whose Hand is my life, what has brought you out has brought me out too; get up. They got up along with him. and (all of them) came to the house of an Ansari, but he was not at home. When his wife saw him she said: Most welcome, and Allah's Messenger (may peace be Upon him) said to her: Where is so and so? She said: He has gone to get some fresh water for us. When the Ansari came and he saw Allah's Messenger (may peace be upon him) and his two Companions, he said: Praise be to Allah, no one has more honourable guests today than I (have). He then went out and brought them a bunch of ripe dates, dry dates and fresh dates, and said: Eat some of them. He then took hold of his long knife (for slaughtering a goat or a sheep). Allah's Messenger (may peace be upon him) said to him: Beware of killing a milch animal. He slaughtered a sheep for them and after they had eaten of it and of the bunch and drank, and when they had taken their fill and had been fully satisfied with the drink, Allah's Messenger (may peace be upon him) said to Abu Bakr and Umar: By Him in Whose Hand is my life, you will certainly be questioned about this bounty on the Day of judgment. Hunger brought you out of your house, then you did not return until this bounty came to you.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20584",
        "10845",
        "11172",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7346",
      "hadith_no": "7346",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا خلف بن خليفة، حدثنا يزيد بن كيسان، عن أبي، حازم عن أبي هريرة، قال كنا مع رسول الله صلى الله عليه وسلم إذ سمع وجبة فقال النبي صلى الله عليه وسلم ‏\"‏ تدرون ما هذا ‏\"‏ ‏.‏ قال قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذا حجر رمي به في النار منذ سبعين خريفا فهو يهوي في النار الآن حتى انتهى إلى قعرها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      We were in the company of Allah's Messenger (may peace be upon him) that we heard a terrible sound. Thereupon Allah's Apostle (may peace be upon him) said: Do you know what (sound) is this? We said: Allah and His Messenger know best. Thereupon he said: That is a stone which was thrown seventy years before in Hell and it has'been constantly slipping down and now it has reached its base.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20584",
        "10845",
        "11172",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1495",
      "hadith_no": "1495",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الرحمن بن عبيد الله الحلبي، حدثنا خلف بن خليفة، عن حفص، - يعني ابن أخي أنس - عن أنس، أنه كان مع رسول الله صلى الله عليه وسلم جالسا ورجل يصلي ثم دعا اللهم إني أسألك بأن لك الحمد لا إله إلا أنت المنان بديع السموات والأرض يا ذا الجلال والإكرام يا حى يا قيوم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لقد دعا الله باسمه العظيم الذي إذا دعي به أجاب وإذا سئل به أعطى ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I was sitting with the Messenger of Allah (ﷺ) and a man was offering prayer. He then made supplication: O Allah, I ask Thee by virtue of the fact that praise is due to Thee, there is no deity but Thou, Who showest favour and beneficence, the Originator of the Heavens and the earth, O Lord of Majesty and Splendour, O Living One, O Eternal One. The Prophet (ﷺ) then said: He has supplicated Allah using His Greatest Name, when supplicated by this name, He answers, and when asked by this name He gives.",
      "usc_msa_ref": "",
      "chain": [
        "20584",
        "19"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3573",
      "hadith_no": "3573",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن حسان السمتي، حدثنا خلف بن خليفة، عن أبي هاشم، عن ابن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة واحد في الجنة واثنان في النار فأما الذي في الجنة فرجل عرف الحق فقضى به ورجل عرف الحق فجار في الحكم فهو في النار ورجل قضى للناس على جهل فهو في النار ‏\"‏ ‏.‏ قال أبو داود وهذا أصح شىء فيه يعني حديث ابن بريدة ‏\"‏ القضاة ثلاثة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: Judges are of three types, one of whom will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgment accordingly; but a man who knows what is right and acts tyrannically in his judgment will go to Hell; and a man who gives judgment for people when he is ignorant will go to Hell.Abu Dawud said: On this subject this is the soundest tradition, that is, the tradition of Ibn Buraidah: Judges are of three types.",
      "usc_msa_ref": "",
      "chain": [
        "36628",
        "20584",
        "11454",
        "11432",
        "3131"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1734",
      "hadith_no": "1734",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن حجر، حدثنا خلف بن خليفة، عن حميد الأعرج، عن عبد الله بن الحارث، عن ابن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ كان على موسى يوم كلمه ربه كساء صوف وجبة صوف وكمة صوف وسراويل صوف وكانت نعلاه من جلد حمار ميت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث حميد الأعرج ‏.‏ وحميد هو ابن علي الكوفي ‏.‏ قال سمعت محمدا يقول حميد بن علي الأعرج منكر الحديث وحميد بن قيس الأعرج المكي صاحب مجاهد ثقة ‏.‏ والكمة القلنسوة الصغيرة ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     That the Prophet (ﷺ) said: \"On the day of His Lord spoke to him, Musa was wearing a wool Kisa', a wool Jubbah, a wool Kummah, wool pants, and his sandals were made of the skin of a dead donkey.\"[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except from the the narration of Humaid Al-A'raj. And Humaid - Ibn 'Ali Al-A'raj - I Heard Muhammad saying: \"Humaid bin 'Ali Al-A'raj is Munkar in Hadith.\" While Humaid ibn Qais Al-A'raj Al-Makki, the companion of Mujahid is trustworthy. The Kummah is a small cap.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20584",
        "912",
        "16"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-150",
      "hadith_no": "150",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن خلف، - وهو ابن خليفة - عن أبي مالك الأشجعي، عن أبي حازم، قال كنت خلف أبي هريرة وهو يتوضأ للصلاة وكان يغسل يديه حتى يبلغ إبطيه فقلت يا أبا هريرة ما هذا الوضوء فقال لي يا بني فروخ أنتم ها هنا لو علمت أنكم ها هنا ما توضأت هذا الوضوء سمعت خليلي صلى الله عليه وسلم يقول ‏\"‏ تبلغ حلية المؤمن حيث يبلغ الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hazim said:                      \"I was behind Abu Hurairah when he performed Wudu' for Salah. He washed his hand up to the armpit, and I said: 'O Abu Hurairah! What is this Wudu'?' He said to me: 'O Banu Farrukh! You are here! If I had known that you were here I would not have performed Wudu' like this. I heard my close friend (i.e., the Prophet (ﷺ)) says: \"The jewelry of the believer will reach as far as his Wudu reached.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "10766",
        "11349"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1080",
      "hadith_no": "1080",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، عن خلف، - وهو ابن خليفة - عن أبي مالك الأشجعي، عن أبيه، قال صليت خلف رسول الله صلى الله عليه وسلم فلم يقنت وصليت خلف أبي بكر فلم يقنت وصليت خلف عمر فلم يقنت وصليت خلف عثمان فلم يقنت وصليت خلف علي فلم يقنت ثم قال يا بنى إنها بدعة ‏.‏",
      "text_en": " It was narrated from Abu Malik Al-Ashja'i that his father said:                     \"I prayed behind the Messenger of Allah (ﷺ) and he did not say the Qunut, and I prayed behind Abu Bakr and he did not say the Qunut, and I prayed behind Umar and he did not say the Qunut, and I prayed behind Uthman and he did not say the Qunut, and I prayed behind Ali and he did not say the Qunut.\" Then he said: \"O my son, this is an innovation.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "10766",
        "5098"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1300",
      "hadith_no": "1300",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة، قال حدثنا خلف بن خليفة، عن حفص بن أخي، أنس عن أنس بن مالك، قال كنت مع رسول الله صلى الله عليه وسلم جالسا - يعني - ورجل قائم يصلي فلما ركع وسجد وتشهد دعا فقال في دعائه اللهم إني أسألك بأن لك الحمد لا إله إلا أنت المنان بديع السموات والأرض يا ذا الجلال والإكرام يا حى يا قيوم إني أسألك ‏.‏ فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ تدرون بما دعا ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ والذي نفسي بيده لقد دعا الله باسمه العظيم الذي إذا دعي به أجاب وإذا سئل به أعطى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"I was sitting with the Messenger of Allah (ﷺ) and a man was standing and praying. When he bowed, prostrated and recited the tashahhud, he supplicated, and in his supplication he said: \"Allahumma inni as'aluka bi-anna lakal-hamd, lailaha illa ant, al-mannanu badi'us-samawati wal-ard, ya dhal-jalali wal-ikram! Ya hayyu ya qayyum! Inni as'aluka. (O Allah, indeed I ask You since all praise is due to You, there is none worthy of worship but You, the Bestower, the Creator of the heavens and earth, O Possessor of majesty and honor, O Ever-living, O-Eternal, I ask of You.)' The Prophet (ﷺ) said: 'Do you know what he has supplicated with?' They said: \"Allah (SWT) and His Messenger know best.\" He said: 'By the One in Whose Hand is my soul, he called upon Allah by His greatest Name, which, if He is called by it, He responds, and if He is asked by it, He gives.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2857",
      "hadith_no": "2857",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن معاوية، قال حدثنا خلف، - يعني ابن خليفة - عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن رجلا، كان حاجا مع رسول الله صلى الله عليه وسلم وأنه لفظه بعيره فمات فقال رسول الله صلى الله عليه وسلم ‏\"‏ يغسل ويكفن في ثوبين ولا يغطى رأسه ووجهه فإنه يقوم يوم القيامة ملبيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     a man was performing Hajj with the Messenger of Allah and his she-camel threw him and he died. The Messenger of Allah said: \"Wash him and shroud him in two garments, and do not cover his head of his face, for he will be raised on the Day of Resurrection reciting Talbiyah.\".",
      "usc_msa_ref": "",
      "chain": [
        "20584",
        "11419",
        "11050",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5105",
      "hadith_no": "5105",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، قال حدثنا خلف، - يعني ابن خليفة - عن عطاء بن السائب، عن الشعبي، قال لعن رسول الله صلى الله عليه وسلم آكل الربا وموكله وشاهده وكاتبه والواشمة والموتشمة ونهى عن النوح ولم يقل لعن صاحب ‏.‏",
      "text_en": " It was narrated that from 'Ata' bin As-Sa'ib, from Ash-Sha'bi who said:                     \"The Messenger of Allah [SAW] cursed the one who consumes Riba, the one who pays it, the one who witnesses it and the one who writes it down; the woman who does tattoos and the woman who has that done; and forbade wailing (in mourning), but he did not say that its doer is cursed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "11068",
        "11052"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5665",
      "hadith_no": "5665",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا قتيبة، وعلي بن حجر، قالا حدثنا خلف، - يعني ابن خليفة - عن منصور بن زاذان، عن الحكم بن عتيبة، عن أبي وائل، عن مسروق، قال القاضي إذا أكل الهدية فقد أكل السحت وإذا قبل الرشوة بلغت به الكفر ‏.‏ وقال مسروق من شرب الخمر فقد كفر وكفره أن ليس له صلاة ‏.‏",
      "text_en": " It was narrated that Masruq said:                     \"If a judge accepts a gift he has consumed something unlawful, and if he accepts a bribe, that takes him to the level of Kufr.\" Masruq said: \"Whoever drinks Khamr, he has committed (an act of) Kufr, and his Kufr is that his Salah does not count.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20387",
        "20584",
        "11444",
        "11069",
        "11353",
        "11018"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-2315-2",
      "hadith_no": "2315",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا خلف بن خليفة، حدثنا أبو هاشم، قال لولا حديث ابن بريدة عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة اثنان في النار وواحد في الجنة رجل علم الحق فقضى به فهو في الجنة ورجل قضى للناس على جهل فهو في النار ورجل جار في الحكم فهو في النار ‏\"‏ ‏.‏ لقلنا إن القاضي إذا اجتهد فهو في الجنة ‏.‏",
      "text_en": " Abu Hashim said:                     “Were it not for the Hadith of Ibn Buraidah from his father, from the Prophet (ﷺ) who said: 'Judges are of three types, two of whom will be in Hell and one will be in Paradise. The man who knows the truth and rules in accordance with it, will be in Paradise. The man who passes judgment on the people in ignorance will be in Hell' - we would have said that if the judge does his best he will be in Paradise.”",
      "usc_msa_ref": "",
      "chain": [
        "38108",
        "20584",
        "11454"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3301",
      "hadith_no": "3301",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خلف بن خليفة، ح وحدثنا عبد الرحمن بن إبراهيم، أنبأنا مروان بن معاوية، جميعا عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  أتى رجلا من الأنصار فأخذ الشفرة ليذبح لرسول الله  صلى الله عليه وسلم  فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ إياك والحلوب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)came toa man from among the Ansar who had picked up a knife toslaughter ananimal for the Messenger of Allah (ﷺ). The Messenger ofAllah (ﷺ)said to him:                      “Avoid those that are lactating.” (i.e. thosefromwhich milk is received).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20584",
        "30285",
        "20201",
        "10845",
        "11172",
        "13"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 15,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [9th Generation]",
    "ar": "تابع التابعين [الجيل التاسع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
  }
}