{
  "id": "20587",
  "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
  "full_name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Khurasan"
    },
    "death": {
      "date_hijri": "178",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Wasit",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خت  م  4  -  صدوق يخطئ ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Nakha'i",
      "Judge",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "35070",
      "name": "'Abdur Rahman bin Sharayk عبد الرحمن بن شريك بن عبد الله",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18002",
      "name": "Ibrahim bin Jryr bin Abd إبراهيم بن جرير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10763",
      "name": "Rakayn bin al-Rabi' bin 'Amila ركين بن الربيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10758",
      "name": "Rashid bin Kaysan al-Absi راشد بن كيسان العبسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10778",
      "name": "'Asim bin Kulayb bin Shahab عاصم بن كليب بن شهاب بن المجنون",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10830",
      "name": "al-Mqdam bin Shryh bin Han'i المقدام بن شريح بن هانئ بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11379",
      "name": "'Ammara bin al-Q'aqa' bin Shabrma عمارة بن القعقاع بن شبرمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10802",
      "name": "'Ammar bin Mua'wiya bin Aslam al-Dahni عمار بن معاوية الدهني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20384",
      "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20630",
      "name": "Ishaq bin 'Isa bin Njyh إسحاق بن عيسى بن نجيح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20357",
      "name": "Malik bin Isma'il, Abu Ghasan al-Nahdi مالك بن إسماعيل أبو غسان النهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30269",
      "name": "Muhammad bin al-Sabah محمد بن الصباح البزاز الدولابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35130",
      "name": "Muhammad bin al-Tfyl bin Malik محمد بن الطفيل بن مالك النخعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35125",
      "name": "Muhammad bin Sulaiman bin Habib محمد بن سليمان بن حبيب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35070",
      "name": "'Abdur Rahman bin Sharayk عبد الرحمن بن شريك بن عبد الله",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-708",
      "hadith_no": "708",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا خالد بن مخلد، قال حدثنا سليمان بن بلال، قال حدثنا شريك بن عبد الله، قال سمعت أنس بن مالك، يقول ما صليت وراء إمام قط أخف صلاة ولا أتم من النبي صلى الله عليه وسلم، وإن كان ليسمع بكاء الصبي فيخفف مخافة أن تفتن أمه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I never prayed behind any Imam a prayer lighter and more perfect than that behind the Prophet and he used to cut short the prayer whenever he heard the cries of a child lest he should put the child's mother to trial.",
      "usc_msa_ref": "676",
      "chain": [
        "30463",
        "20160",
        "20587",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1014",
      "hadith_no": "1014",
      "source": "Sahih Bukhari",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا إسماعيل بن جعفر، عن شريك، عن أنس بن مالك، أن رجلا، دخل المسجد يوم جمعة من باب كان نحو دار القضاء، ورسول الله صلى الله عليه وسلم قائم يخطب، فاستقبل رسول الله صلى الله عليه وسلم قائما ثم قال يا رسول الله هلكت الأموال وانقطعت السبل، فادع الله يغيثنا فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم أغثنا، اللهم أغثنا، اللهم أغثنا ‏\"‏‏.‏ قال أنس ولا والله ما نرى في السماء من سحاب، ولا قزعة، وما بيننا وبين سلع من بيت ولا دار‏.‏ قال فطلعت من ورائه سحابة مثل الترس، فلما توسطت السماء انتشرت ثم أمطرت، فلا والله ما رأينا الشمس ستا، ثم دخل رجل من ذلك الباب في الجمعة ورسول الله صلى الله عليه وسلم قائم يخطب، فاستقبله قائما فقال يا رسول الله هلكت الأموال وانقطعت السبل، فادع الله يمسكها عنا‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم حوالينا ولا علينا، اللهم على الآكام والظراب وبطون الأودية ومنابت الشجر ‏\"‏‏.‏ قال فأقلعت وخرجنا نمشي في الشمس‏.‏ قال شريك سألت أنس بن مالك أهو الرجل الأول فقال ما أدري‏.‏",
      "text_en": " Narrated Sharik:                     Anas bin Malik said, \"A person entered the Mosque on a Friday through the gate facing the Daril- Qada' and Allah's Apostle was standing delivering the Khutba (sermon). The man stood in front of Allah's Apostle and said, 'O Allah's Apostle, livestock are dying and the roads are cut off; please pray to Allah for rain.' So Allah's Apostle (p.b.u.h) raised both his hands and said, 'O Allah! Bless us with rain. O Allah! Bless us with rain. O Allah! Bless us with rain!\" Anas added, \"By Allah, there were no clouds in the sky and there was no house or building between us and the mountain of Sila'. Then a big cloud like a shield appeared from behind it (i.e. Silas Mountain) and when it came in the middle of the sky, it spread and then rained. By Allah! We could not see the sun for a week. The next Friday, a person entered through the same gate and Allah's Apostle was delivering the Friday Khutba and the man stood in front of him and said, 'O Allah's Apostle! The livestock are dying and the roads are cut off; Please pray to Allah to withhold rain.' \" Anas added, \"Allah's Apostle raised both his hands and said, 'O Allah! Round about us and not on us. O Allah!' On the plateaus, on the mountains, on the hills, in the valleys and on the places where trees grow.' \" Anas added, \"The rain stopped and we came out, walking in the sun.\" Sharik asked Anas whether it was the same person who had asked for rain the previous Friday. Anas replied that he did not know.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20155",
        "20587",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1016",
      "hadith_no": "1016",
      "source": "Sahih Bukhari",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن شريك بن عبد الله، عن أنس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال هلكت المواشي وتقطعت السبل‏.‏ فدعا، فمطرنا من الجمعة إلى الجمعة، ثم جاء فقال تهدمت البيوت وتقطعت السبل، وهلكت المواشي فادع الله يمسكها‏.‏ فقام صلى الله عليه وسلم فقال ‏\"‏ اللهم على الآكام والظراب والأودية ومنابت الشجر ‏\"‏‏.‏ فانجابت عن المدينة انجياب الثوب‏.‏",
      "text_en": " Narrated Anas:                     A man came to the Prophet (p.b.u.h) and said, \"Livestock are destroyed and the roads are cut off.\" So Allah's Apostle invoked Allah for rain and it rained from that Friday till the next Friday. The same person came again and said, \"Houses have collapsed, roads are cut off, and the livestock are destroyed. Please pray to Allah to withhold the rain.\" Allah's Apostle (stood up and) said, \"O Allah! (Let it rain) on the plateaus, on the hills, in the valleys and over the places where trees grow.\" So the clouds cleared away from Medina as clothes are taken off .",
      "usc_msa_ref": "129",
      "chain": [
        "20164",
        "20001",
        "20587",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-7186",
      "hadith_no": "7186",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، عن شريك بن عبد الله، عن سعيد بن المسيب، عن أبي موسى الأشعري، قال خرج النبي صلى الله عليه وسلم إلى حائط من حوائط المدينة لحاجته، وخرجت في إثره، فلما دخل الحائط جلست على بابه وقلت لأكونن اليوم بواب النبي صلى الله عليه وسلم ولم يأمرني فذهب النبي صلى الله عليه وسلم وقضى حاجته، وجلس على قف البئر، فكشف عن ساقيه ودلاهما في البئر، فجاء أبو بكر يستأذن عليه ليدخل فقلت كما أنت حتى أستأذن لك، فوقف فجئت إلى النبي صلى الله عليه وسلم فقلت يا نبي الله أبو بكر يستأذن عليك‏.‏ قال ‏\"‏ ائذن له، وبشره بالجنة ‏\"‏‏.‏ فدخل فجاء عن يمين النبي صلى الله عليه وسلم فكشف عن ساقيه ودلاهما في البئر، فجاء عمر فقلت كما أنت حتى أستأذن لك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ائذن له، وبشره بالجنة ‏\"‏‏.‏ فجاء عن يسار النبي صلى الله عليه وسلم فكشف عن ساقيه فدلاهما في البئر، فامتلأ القف فلم يكن فيه مجلس، ثم جاء عثمان فقلت كما أنت حتى أستأذن لك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ائذن له، وبشره بالجنة، معها بلاء يصيبه ‏\"‏‏.‏ فدخل فلم يجد معهم مجلسا، فتحول حتى جاء مقابلهم على شفة البئر، فكشف عن ساقيه ثم دلاهما في البئر‏.‏ فجعلت أتمنى أخا لي وأدعو الله أن يأتي‏.‏ قال ابن المسيب فتأولت ذلك قبورهم اجتمعت ها هنا وانفرد عثمان‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet went out to one of the gardens of Medina for some business and I went out to follow him. When he entered the garden, I sat at its gate and said to myself, \"To day I will be the gatekeeper of the Prophet though he has not ordered me.\" The Prophet went and finished his need and went to sit on the constructed edge of the well and uncovered his legs and hung them in the well. In the meantime Abu Bakr came and asked permission to enter. I said (to him), \"Wait till I get you permission.\" Abu Bakr waited outside and I went to the Prophet and said, \"O Allah's Prophet! Abu Bakr asks your permission to enter.\" He said, \"Admit him, and give him the glad tidings of entering Paradise.\" So Abu Bakr entered and sat on the right side of the Prophet and uncovered his legs and hung them in the well. Then `Umar came and I said (to him), \"Wait till I get you permission.\" The Prophet said, \"Admit him and give him the glad tidings of entering Paradise.\" So `Umar entered and sat on the left side of the Prophet and uncovered his legs and hung them in the well so that one side of the well became fully occupied and there remained no place for any-one to sit. Then `Uthman came and I said (to him), \"Wait till I get permission for you.\" The Prophet said, \"Admit him and give him the glad tidings of entering Paradise with a calamity which will befall him.\" When he entered, he could not find any place to sit with them so he went to the other edge of the well opposite them and uncovered his legs and hung them in the well. I wished that a brother of mine would come, so I invoked Allah for his coming. (Ibn Al-Musaiyab said, \"I interpreted that (narration) as indicating their graves. The first three are together and the grave of `Uthman is separate from theirs.\")",
      "usc_msa_ref": "217",
      "chain": [
        "30232",
        "20173",
        "20587",
        "11002",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-7611",
      "hadith_no": "7611",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني سليمان، عن شريك بن عبد الله، أنه قال سمعت ابن مالك، يقول ليلة أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام، فقال أولهم أيهم هو فقال أوسطهم هو خيرهم‏.‏ فقال آخرهم خذوا خيرهم‏.‏ فكانت تلك الليلة، فلم يرهم حتى أتوه ليلة أخرى فيما يرى قلبه، وتنام عينه ولا ينام قلبه وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم، فلم يكلموه حتى احتملوه فوضعوه عند بئر زمزم فتولاه منهم جبريل فشق جبريل ما بين نحره إلى لبته حتى فرغ من صدره وجوفه، فغسله من ماء زمزم بيده، حتى أنقى جوفه، ثم أتي بطست من ذهب فيه تور من ذهب محشوا إيمانا وحكمة، فحشا به صدره ولغاديده  يعني عروق حلقه  ثم أطبقه ثم عرج به إلى السماء الدنيا فضرب بابا من أبوابها فناداه أهل السماء من هذا فقال جبريل‏.‏ قالوا ومن معك قال معي محمد‏.‏ قال وقد بعث قال نعم‏.‏ قالوا فمرحبا به وأهلا‏.‏ فيستبشر به أهل السماء، لا يعلم أهل السماء بما يريد الله به في الأرض حتى يعلمهم، فوجد في السماء الدنيا آدم فقال له جبريل هذا أبوك فسلم عليه‏.‏ فسلم عليه ورد عليه آدم وقال مرحبا وأهلا بابني، نعم الابن أنت‏.‏ فإذا هو في السماء الدنيا بنهرين يطردان فقال ما هذان النهران يا جبريل قال هذا النيل والفرات عنصرهما‏.‏ ثم مضى به في السماء فإذا هو بنهر آخر عليه قصر من لؤلؤ وزبرجد فضرب يده فإذا هو مسك قال ما هذا يا جبريل قال هذا الكوثر الذي خبأ لك ربك‏.‏ ثم عرج إلى السماء الثانية فقالت الملائكة له مثل ما قالت له الأولى من هذا قال جبريل‏.‏ قالوا ومن معك قال محمد صلى الله عليه وسلم‏.‏ قالوا وقد بعث إليه قال نعم‏.‏ قالوا مرحبا به وأهلا‏.‏ ثم عرج به إلى السماء الثالثة وقالوا له مثل ما قالت الأولى والثانية، ثم عرج به إلى الرابعة فقالوا له مثل ذلك، ثم عرج به إلى السماء الخامسة فقالوا مثل ذلك، ثم عرج به إلى السماء السادسة فقالوا له مثل ذلك، ثم عرج به إلى السماء السابعة فقالوا له مثل ذلك، كل سماء فيها أنبياء قد سماهم فأوعيت منهم إدريس في الثانية، وهارون في الرابعة، وآخر في الخامسة لم أحفظ اسمه، وإبراهيم في السادسة، وموسى في السابعة بتفضيل كلام الله، فقال موسى رب لم أظن أن يرفع على أحد‏.‏ ثم علا به فوق ذلك بما لا يعلمه إلا الله، حتى جاء سدرة المنتهى ودنا الجبار رب العزة فتدلى حتى كان منه قاب قوسين أو أدنى فأوحى الله فيما أوحى إليه خمسين صلاة على أمتك كل يوم وليلة‏.‏ ثم هبط حتى بلغ موسى فاحتبسه موسى فقال يا محمد ماذا عهد إليك ربك قال عهد إلى خمسين صلاة كل يوم وليلة‏.‏ قال إن أمتك لا تستطيع ذلك فارجع فليخفف عنك ربك وعنهم‏.‏ فالتفت النبي صلى الله عليه وسلم إلى جبريل كأنه يستشيره في ذلك، فأشار إليه جبريل أن نعم إن شئت‏.‏ فعلا به إلى الجبار فقال وهو مكانه يا رب خفف عنا، فإن أمتي لا تستطيع هذا‏.‏ فوضع عنه عشر صلوات ثم رجع إلى موسى فاحتبسه، فلم يزل يردده موسى إلى ربه حتى صارت إلى خمس صلوات، ثم احتبسه موسى عند الخمس فقال يا محمد والله لقد راودت بني إسرائيل قومي على أدنى من هذا فضعفوا فتركوه فأمتك أضعف أجسادا وقلوبا وأبدانا وأبصارا وأسماعا، فارجع فليخفف عنك ربك، كل ذلك يلتفت النبي صلى الله عليه وسلم إلى جبريل ليشير عليه ولا يكره ذلك جبريل، فرفعه عند الخامسة فقال يا رب إن أمتي ضعفاء أجسادهم وقلوبهم وأسماعهم وأبدانهم فخفف عنا فقال الجبار يا محمد‏.‏ قال لبيك وسعديك‏.‏ قال إنه لا يبدل القول لدى، كما فرضت عليك في أم الكتاب  قال  فكل حسنة بعشر أمثالها، فهى خمسون في أم الكتاب وهى خمس عليك‏.‏ فرجع إلى موسى فقال كيف فعلت فقال خفف عنا أعطانا بكل حسنة عشر أمثالها‏.‏ قال موسى قد والله راودت بني إسرائيل على أدنى من ذلك فتركوه، ارجع إلى ربك فليخفف عنك أيضا‏.‏ قال رسول الله صلى الله عليه وسلم يا موسى قد والله استحييت من ربي مما اختلفت إليه‏.‏ قال فاهبط باسم الله‏.‏ قال واستيقظ وهو في مسجد الحرام‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The night Allah's Apostle was taken for a journey from the sacred mosque (of Mecca) Al-Ka`ba: Three persons came to him (in a dreamy while he was sleeping in the Sacred Mosque before the Divine Inspiration was revealed to Him. One of them said, \"Which of them is he?\" The middle (second) angel said, \"He is the best of them.\" The last (third) angle said, \"Take the best of them.\" Only that much happened on that night and he did not see them till they came on another night, i.e. after The Divine Inspiration was revealed to him. (Fath-ul-Bari Page 258, Vol. 17) and he saw them, his eyes were asleep but his heart was not----and so is the case with the prophets: their eyes sleep while their hearts do not sleep. So those angels did not talk to him till they carried him and placed him beside the well of Zamzam. From among them Gabriel took charge of him. Gabriel cut open (the part of his body) between his throat and the middle of his chest (heart) and took all the material out of his chest and `Abdomen and then washed it with Zamzam water with his own hands till he cleansed the inside of his body, and then a gold tray containing a gold bowl full of belief and wisdom was brought and then Gabriel stuffed his chest and throat blood vessels with it and then closed it (the chest). He then ascended with him to the heaven of the world and knocked on one of its doors. The dwellers of the Heaven asked, 'Who is it?' He said, \"Gabriel.\" They said, \"Who is accompanying you?\" He said, \"Muhammad.\" They said, \"Has he been called?\" He said, \"Yes\" They said, \"He is welcomed.\" So the dwellers of the Heaven became pleased with his arrival, and they did not know what Allah would do to the Prophet on earth unless Allah informed them. The Prophet met Adam over the nearest Heaven. Gabriel said to the Prophet, \"He is your father; greet him.\" The Prophet greeted him and Adam returned his greeting and said, \"Welcome, O my Son! O what a good son you are!\" Behold, he saw two flowing rivers, while he was in the nearest sky. He asked, \"What are these two rivers, O Gabriel?\" Gabriel said, \"These are the sources of the Nile and the Euphrates.\" Then Gabriel took him around that Heaven and behold, he saw another river at the bank of which there was a palace built of pearls and emerald. He put his hand into the river and found its mud like musk Adhfar. He asked, \"What is this, O Gabriel?\" Gabriel said, \"This is the Kauthar which your Lord has kept for you.\" Then Gabriel ascended (with him) to the second Heaven and the angels asked the same questions as those on the first Heaven, i.e., \"Who is it?\" Gabriel replied, \"Gabriel\". They asked, \"Who is accompanying you?\" He said, \"Muhammad.\" They asked, \"Has he been sent for?\" He said, \"Yes.\" Then they said, \"He is welcomed.'' Then he (Gabriel) ascended with the Prophet to the third Heaven, and the angels said the same as the angels of the first and the second Heavens had said. Then he ascended with him to the fourth Heaven and they said the same; and then he ascended with him to the fifth Heaven and they said the same; and then he ascended with him to the sixth Heaven and they said the same; then he ascended with him to the seventh Heaven and they said the same. On each Heaven there were prophets whose names he had mentioned and of whom I remember Idris on the second Heaven, Aaron on the fourth Heavens another prophet whose name I don't remember, on the fifth Heaven, Abraham on the sixth Heaven, and Moses on the seventh Heaven because of his privilege of talking to Allah directly. Moses said (to Allah), \"O Lord! I thought that none would be raised up above me.\" But Gabriel ascended with him (the Prophet) for a distance above that, the distance of which only Allah knows, till he reached the Lote Tree (beyond which none may pass) and then the Irresistible, the Lord of Honor and Majesty approached and came closer till he (Gabriel) was about two bow lengths or (even) nearer. (It is said that it was Gabriel who approached and came closer to the Prophet. (Fate Al-Bari Page 263, 264, Vol. 17). Among the things which Allah revealed to him then, was: \"Fifty prayers were enjoined on his followers in a day and a night.\" Then the Prophet descended till he met Moses, and then Moses stopped him and asked, \"O Muhammad ! What did your Lord en join upon you?\" The Prophet replied,\" He enjoined upon me to perform fifty prayers in a day and a night.\" Moses said, \"Your followers cannot do that; Go back so that your Lord may reduce it for you and for them.\" So the Prophet turned to Gabriel as if he wanted to consult him about that issue. Gabriel told him of his opinion, saying, \"Yes, if you wish.\" So Gabriel ascended with him to the Irresistible and said while he was in his place, \"O Lord, please lighten our burden as my followers cannot do that.\" So Allah deducted for him ten prayers where upon he returned to Moses who stopped him again and kept on sending him back to his Lord till the enjoined prayers were reduced to only five prayers. Then Moses stopped him when the prayers had been reduced to five and said, \"O Muhammad! By Allah, I tried to persuade my nation, Bani Israel to do less than this, but they could not do it and gave it up. However, your followers are weaker in body, heart, sight and hearing, so return to your Lord so that He may lighten your burden.\" The Prophet turned towards Gabriel for advice and Gabriel did not disapprove of that. So he ascended with him for the fifth time. The Prophet said, \"O Lord, my followers are weak in their bodies, hearts, hearing and constitution, so lighten our burden.\" On that the Irresistible said, \"O Muhammad!\" the Prophet replied, \"Labbaik and Sa`daik.\" Allah said, \"The Word that comes from Me does not change, so it will be as I enjoined on you in the Mother of the Book.\" Allah added, \"Every good deed will be rewarded as ten times so it is fifty (prayers) in the Mother of the Book (in reward) but you are to perform only five (in practice).\" The Prophet returned to Moses who asked, \"What have you done?\" He said, \"He has lightened our burden: He has given us for every good deed a tenfold reward.\" Moses said, \"By Allah! I tried to make Bani Israel observe less than that, but they gave it up. So go back to your Lord that He may lighten your burden further.\" Allah's Apostle said, \"O Moses! By Allah, I feel shy of returning too many times to my Lord.\" On that Gabriel said, \"Descend in Allah's Name.\" The Prophet then woke while he was in the Sacred Mosque (at Mecca).",
      "usc_msa_ref": "",
      "chain": [
        "30105",
        "20160",
        "20587"
      ]
    },
    {
      "id": "sahih-muslim-457-3",
      "hadith_no": "457",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، وابن، عيينة ح وحدثني زهير بن حرب، حدثنا ابن عيينة، عن زياد بن علاقة، عن قطبة بن مالك، سمع النبي صلى الله عليه وسلم يقرأ في الفجر ‏{‏ والنخل باسقات لها طلع نضيد‏}‏",
      "text_en": " Qutba b. Malik reported that he had heard the Messenger of Allah (may peace be upon him) reciting in the morning prayer this:                     \" And the tall palm trees having flower spikes piled one above another\" (l. 10).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "20005",
        "30022",
        "20005",
        "11339"
      ]
    },
    {
      "id": "sahih-muslim-3376",
      "hadith_no": "3376",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن حكيم الأودي، أخبرنا شريك، عن عمار الدهني، عن أبي الزبير، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم دخل يوم فتح مكة وعليه عمامة سوداء ‏.‏",
      "text_en": "  Jabir b. Abdullah reported that Allah's Apostle (may peace be upon him) entered on the day of Victory of Mecca wearing a black turban on his head.",
      "usc_msa_ref": "",
      "chain": [
        "30471",
        "20587",
        "10802",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4041",
      "hadith_no": "4041",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا الثقفي، عن أيوب، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم جميعا عن وكيع، عن سفيان، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن جريج، ح وحدثني علي بن حجر، حدثنا الفضل بن موسى، عن شريك، عن شعبة، كلهم عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Ibn Abbas (Allah be pleased with them).",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "11015",
        "30201",
        "30123",
        "20032",
        "20012",
        "30490",
        "20023",
        "11070",
        "20387",
        "20452",
        "20587",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5958",
      "hadith_no": "5958",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا  شريك بن عبد الله، وهشيم بن بشير، عن يعلى بن عطاء، عن عمرو بن الشريد، عن أبيه، قال كان في وفد ثقيف رجل مجذوم فأرسل إليه النبي صلى الله عليه وسلم ‏\"‏ إنا قد بايعناك فارجع ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Sharid reported on the authority of his father that there was in the delegation of Thaqif a leper. Allah's Apostle (may peace be upon him) sent a message to him:                      We have accepted your allegiance, so you may go.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "30201",
        "20587",
        "20468",
        "10986",
        "10952"
      ]
    },
    {
      "id": "sahih-muslim-6025",
      "hadith_no": "6025",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثني أبو جعفر، محمد بن الصباح وعلي بن حجر السعدي جميعا عن شريك، قال ابن حجر أخبرنا شريك، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، عن  النبي صلى الله عليه وسلم قال ‏\"‏ أشعر كلمة تكلمت بها العرب كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest word spoken by an Arab (pre-Islamic) in poetry is this verse of Labid:\" Behold! apart from Allah everything is vain.\"",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11858",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6666",
      "hadith_no": "6666",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن عمارة، وابن، شبرمة عن أبي، زرعة عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث جرير وزاد فقال ‏\"‏ نعم وأبيك لتنبأن ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      A person came to Allah's Apostle (may peace be upon him). The rest of the hadith is the same as transmitted by jarir but with this addition: By your father, you would get the information.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-45",
      "hadith_no": "45",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا أسود بن عامر، حدثنا شريك، وهذا، لفظه ح وحدثنا محمد بن عبد الله، - يعني المخرمي - حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن المغيرة، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا أتى الخلاء أتيته بماء في تور أو ركوة فاستنجى ‏.‏ قال أبو داود في حديث وكيع ثم مسح يده على الأرض ثم أتيته بإناء آخر فتوضأ ‏.‏ قال أبو داود وحديث الأسود بن عامر أتم ‏.‏",
      "text_en": " Narrated Abu Hurayrah :                     When the Prophet (sal Allaahu alayhi wa sallam ) went to the privy, I took to him water in a small vessel  or a skin, and he cleansed himself. He then wiped his hand on the ground. I then took to him another vessel  and he performed ablution.Abu Dawud said : The tradition is transmitted by al-Aswad b. 'Amir is more perfect.",
      "usc_msa_ref": "",
      "chain": [
        "38072",
        "20380",
        "20587",
        "30271",
        "20032",
        "11858",
        "18002",
        "166",
        "30554",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-84",
      "hadith_no": "84",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، وسليمان بن داود العتكي، قالا حدثنا شريك، عن أبي فزارة، عن أبي زيد، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال له ليلة الجن ‏\"‏ ما في إداوتك ‏\"‏ ‏.‏ قال نبيذ ‏.‏ قال ‏\"‏ تمرة طيبة وماء طهور ‏\"‏ ‏.‏ قال أبو داود وقال سليمان بن داود عن أبي زيد أو زيد كذا قال شريك ولم يذكر هناد ليلة الجن ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     AbuZayd quoted Abdullah ibn Mas'ud as saying that on the night when the jinn listened to the Qur'an the Prophet (ﷺ) said: What is in your skin vessel? He said: I have some nabidh. He (the Holy Prophet) said: It consists of fresh dates and pure water. Sulayman ibn Dawud reported the same version of this tradition on the authority of AbuZayd or Zayd. But Sharik said that Hammad did not mention the words \"night of the jinn\".",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "30584",
        "20587",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-171",
      "hadith_no": "171",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا شريك، عن عمرو بن عامر البجلي، - قال محمد هو أبو أسد بن عمرو - قال سألت أنس بن مالك عن الوضوء، فقال كان النبي صلى الله عليه وسلم يتوضأ لكل صلاة وكنا نصلي الصلوات بوضوء واحد ‏.‏",
      "text_en": " Abu Asad b. ‘Amr said:                      I asked Anas b. Malik about ablution. He replied: The Prophet (ﷺ) performed ablution for each prayer and we offered (many) prayers with the same ablution.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20587",
        "15406",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-204",
      "hadith_no": "204",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد بن السري، وإبراهيم بن أبي معاوية، عن أبي معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثني شريك، وجرير، وابن، إدريس عن الأعمش، عن شقيق، قال قال عبد الله كنا لا نتوضأ من موطئ ولا نكف شعرا ولا ثوبا ‏.‏ قال أبو داود قال إبراهيم بن أبي معاوية فيه عن الأعمش عن شقيق عن مسروق أو حدثه عنه قال قال عبد الله وقال هناد عن شقيق أو حدثه عنه ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We would not wash our feet after treading on something unclean, nor would we hold our hair and garments (during prayer).Abu Dawud said: The tradition has been reported by Ibrahim b. Abi Mu'awiyah through a different chain of narrators: A'mash - Shaqiq - Masruq - 'Abd Allah (b. Mas'ud). And Hannad reported from Shaqiq, or reported on his authority saying: 'Abd Allah (b. Mas'ud) said.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "30203",
        "20587",
        "4057",
        "20102",
        "11060",
        "11353",
        "30002",
        "11060"
      ]
    },
    {
      "id": "sunan-abi-daud-257",
      "hadith_no": "257",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رافع، حدثنا يحيى بن آدم، حدثنا شريك، عن قيس بن وهب، عن رجل، من بني سواءة بن عامر عن عائشة، فيما يفيض بين الرجل والمرأة من الماء قالت كان رسول الله صلى الله عليه وسلم يأخذ كفا من ماء يصب على الماء ثم يأخذ كفا من ماء ثم يصبه عليه ‏.‏",
      "text_en": " On being asked about (washing) the fluid that flows between man and woman ‘A’ishah said:                      The Messenger of Allah (May peace be upon him) used to take a handful of water and pour it on the fluid. Again, he would take a handful of water and pour it over the fluid.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "20587",
        "10815"
      ]
    },
    {
      "id": "sunan-abi-daud-266",
      "hadith_no": "266",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن خصيف، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وقع الرجل بأهله وهي حائض فليتصدق بنصف دينار ‏\"‏ ‏.‏ قال أبو داود وكذا قال علي بن بذيمة عن مقسم عن النبي صلى الله عليه وسلم مرسلا وروى الأوزاعي عن يزيد بن أبي مالك عن عبد الحميد بن عبد الرحمن عن النبي صلى الله عليه وسلم قال ‏\"‏ آمره أن يتصدق بخمسى دينار ‏\"‏ ‏.‏ وهذا معضل ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet (May peace be upon him) as saying; when a man has intercourse with his wife while she is menstruating, he must give half a dinar in alms.Abu Dawud said; ‘Ali b. Budhaimah reported similarly on the authority of Miqsam from the Prophet (May peace be upon him). Al-Awza’I narrated from Yazid b. Abi Malik, from ‘Abd al-Hamid b. ‘Abd al-Rahman from the Prophet (May peace be upon him); He ordered him to give two fifth of a dinar in alms. But this is a chain where two narrators (Miqsam and Ibn ‘Abbas) are missing.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20587",
        "19908",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-297",
      "hadith_no": "297",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، قال أنبأنا ح، وأخبرنا عثمان بن أبي شيبة، حدثنا شريك، عن أبي اليقظان، عن عدي بن ثابت، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم في المستحاضة ‏\"‏ تدع الصلاة أيام أقرائها ثم تغتسل وتصلي والوضوء عند كل صلاة ‏\"‏ ‏.‏ قال أبو داود زاد عثمان ‏\"‏ وتصوم وتصلي ‏\"‏ ‏.‏",
      "text_en": " Narrated Grandfather of Adi ibn Thabit ?:                     The Prophet (ﷺ) said about the woman having a prolonged flow of blood: She should abandon prayer during her menstrual period: then she should take a bath and pray. She should perform ablution for every prayer.Abu Dawud said: 'Uthman added: She should keep fast and pray.",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "30203",
        "20587",
        "11372"
      ]
    },
    {
      "id": "sunan-abi-daud-460",
      "hadith_no": "460",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسحاق أبو بكر، - يعني الصاغاني - حدثنا أبو بدر، شجاع بن الوليد حدثنا شريك، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، - قال أبو بدر - أراه قد رفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ إن الحصاة لتناشد الذي يخرجها من المسجد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported (Abu Bakr said that in his opinion he narrated this tradition from the Prophet):                      The gravels adjure the person when removes them from the mosque.",
      "usc_msa_ref": "",
      "chain": [
        "11107",
        "20328",
        "20587",
        "11371",
        "11161",
        "13",
        "36577"
      ]
    },
    {
      "id": "sunan-abi-daud-728",
      "hadith_no": "728",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي صلى الله عليه وسلم حين افتتح الصلاة رفع يديه حيال أذنيه - قال - ثم أتيتهم فرأيتهم يرفعون أيديهم إلى صدورهم في افتتاح الصلاة وعليهم برانس وأكسية ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I witnessed the Prophet (ﷺ) raise his hands in front of his ears when he began to pray. I then came back and saw them (the people) raising their hands up to their chest when they began to pray. They wore long caps and blankets.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "id": "sunan-abi-daud-729",
      "hadith_no": "729",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن شريك، عن عاصم بن كليب، عن علقمة بن وائل، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم في الشتاء فرأيت أصحابه يرفعون أيديهم في ثيابهم في الصلاة ‏.‏",
      "text_en": " Wa’il b. Hujr said:                      I came to the Prophet(ﷺ) during winter; I saw his companions raise their hands in their clothes in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20587",
        "10778",
        "10801",
        "3045"
      ]
    },
    {
      "id": "sunan-abi-daud-750",
      "hadith_no": "750",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن البراء، أن رسول الله صلى الله عليه وسلم كان إذا افتتح الصلاة رفع يديه إلى قريب من أذنيه ثم لا يعود ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     When the Messenger of Allah (ﷺ) began prayer, he raised his hands up to his ears, then he did not repeat.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20587",
        "10844",
        "11196",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-774",
      "hadith_no": "774",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال عطس شاب من الأنصار خلف رسول الله صلى الله عليه وسلم وهو في الصلاة فقال الحمد لله حمدا كثيرا طيبا مباركا فيه حتى يرضى ربنا وبعد ما يرضى من أمر الدنيا والآخرة فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من القائل الكلمة ‏\"‏ ‏.‏ قال فسكت الشاب ثم قال ‏\"‏ من القائل الكلمة فإنه لم يقل بأسا ‏\"‏ ‏.‏ فقال يا رسول الله أنا قلتها لم أرد بها إلا خيرا ‏.‏ قال ‏\"‏ ما تناهت دون عرش الرحمن تبارك وتعالى ‏\"‏ ‏.‏",
      "text_en": " Rabi’ah said:                      A young man from the Ansar sneezed behind the Messenger of Allah (ﷺ) while he was praying. He then said: Praise be to Allah, much, good, blessed, till our Lord is pleased (with us) in the affairs relating to this world and to the other world. When the Messenger of Allah (ﷺ) finished his prayer, he said: Who was the speaker of these words (in prayer)? The young man kept silence. He again asked: Who was the speaker of these words? He did not say wrong. He said: Messenger of Allah, I said these (words). I did not intend by them but good. He said: These words did not stay below the Throne of the Compassionate (Allah).",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20472",
        "20587",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-abi-daud-896",
      "hadith_no": "896",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا شريك، عن أبي إسحاق، قال وصف لنا البراء بن عازب فوضع يديه واعتمد على ركبتيه ورفع عجيزته وقال هكذا كان رسول الله صلى الله عليه وسلم يسجد ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     Al-Bara' described to us (the nature of prostration). He placed his hands (palms), reclined on his knees, and raised his hips; he said: This is how the Messenger of Allah (ﷺ) used to prostrate himself.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20587",
        "11049",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-969",
      "hadith_no": "969",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال كنا لا ندري ما نقول إذا جلسنا في الصلاة وكان رسول الله صلى الله عليه وسلم قد علم فذكر نحوه ‏.‏  قال شريك وحدثنا جامع، - يعني ابن شداد - عن أبي وائل، عن عبد الله، بمثله قال وكان يعلمنا كلمات ولم يكن يعلمناهن كما يعلمنا التشهد ‏\"‏ اللهم ألف بين قلوبنا وأصلح ذات بيننا واهدنا سبل السلام ونجنا من الظلمات إلى النور وجنبنا الفواحش ما ظهر منها وما بطن وبارك لنا في أسماعنا وأبصارنا وقلوبنا وأزواجنا وذرياتنا وتب علينا إنك أنت التواب الرحيم واجعلنا شاكرين لنعمتك مثنين بها قابليها وأتمها علينا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We did not know what we should say when we sat during prayer. The Messenger of Allah (ﷺ) was taught (by Allah). He then narrated the tradition to the same effect. Sharik reported from Jami', from AbuWa'il on the authority of Abdullah ibn Mas'ud something similar.  He said: He used to teach us also some other words, but he did not teach them as he taught us the tashahhud: O Allah, join our hearts, mend our social relationship, guide us to the path of peace, bring us from darkness to light, save us from obscenities, outward or inward, and bless our ears, our eyes, our hearts, our wives, our children, and relent toward us; Thou art the Relenting, the Merciful. And make us grateful for Thy blessing and make us praise it while accepting it and give it to us in full.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-996",
      "hadith_no": "996",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، ح وحدثنا أحمد بن يونس، حدثنا زائدة، ح وحدثنا مسدد، حدثنا أبو الأحوص، ح وحدثنا محمد بن عبيد المحاربي، وزياد بن أيوب، قالا حدثنا عمر بن عبيد الطنافسي، ح وحدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، ح وحدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا إسرائيل، كلهم عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، وقال، إسرائيل عن أبي الأحوص، والأسود، عن عبد الله، أن النبي صلى الله عليه وسلم كان يسلم عن يمينه وعن شماله حتى يرى بياض خده ‏\"‏ السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ حديث سفيان وحديث إسرائيل لم يفسره ‏.‏ قال أبو داود ورواه زهير عن أبي إسحاق ويحيى بن آدم عن إسرائيل عن أبي إسحاق عن عبد الرحمن بن الأسود عن أبيه وعلقمة عن عبد الله ‏.‏ قال أبو داود شعبة كان ينكر هذا الحديث - حديث أبي إسحاق - أن يكون مرفوعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) used to give the salutation to his left and right sides until the whiteness of his cheek was seen, (saying: \"Peace be upon you, and mercy of Allah\" twice.  AbuDawud said: This is a version of the tradition reported by AbuSufyan. The version of Isra'il did not explain it. AbuDawud said: This tradition has been narrated by Zubayr from AbuIshaq and Yahya ibn Adam from Isra'il from AbuIshaq from AbdurRahman ibn al-Aswad from his father from Alqamah on the authority of Abdullah ibn Mas'ud. AbuDawud said: Shu'bah used to reject this tradition, the tradition narrated by AbuIshaq as coming from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "30184",
        "20320",
        "30175",
        "20327",
        "35135",
        "30249",
        "20346",
        "20411",
        "20587"
      ]
    },
    {
      "id": "sunan-abi-daud-1232",
      "hadith_no": "1232",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبي، حدثنا شريك، عن ابن الأصبهاني، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام بمكة سبع عشرة يصلي ركعتين ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) stayed in Mecca seventeen days and prayed two rak'ahs (at each time of prayer).",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20587",
        "11364",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1245",
      "hadith_no": "1245",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، عن خصيف، بإسناده ومعناه ‏.‏ قال فكبر نبي الله صلى الله عليه وسلم وكبر الصفان جميعا ‏.‏ قال أبو داود رواه الثوري بهذا المعنى عن خصيف وصلى عبد الرحمن بن سمرة هكذا إلا أن الطائفة التي صلى بهم ركعة ثم سلم مضوا إلى مقام أصحابهم وجاء هؤلاء فصلوا لأنفسهم ركعة ثم رجعوا إلى مقام أولئك فصلوا لأنفسهم ركعة ‏.‏ قال أبو داود حدثنا بذلك مسلم بن إبراهيم حدثنا عبد الصمد بن حبيب قال أخبرني أبي أنهم غزوا مع عبد الرحمن بن سمرة كابل فصلى بنا صلاة الخوف ‏.‏",
      "text_en": " This tradition has been transmitted by Kushaif with a different chain of narrators and to the same effect. This version adds:                      The Prophet of Allah (ﷺ) uttered takbir and both rows uttered takbir together.Abu Dawud said: This tradition has been narrated by al-Thawri to the same effect on the authority of Khusaif. 'Abd al-Rahman b. Samurah also prayed in like manner. But the section which he (the Prophet) led in one rak'ah and then uttered the salutation and went and took the place of their companions. They came and prayed one rak'ah by themselves. Then they returned to their place and they prayed (one rak'ah) by themselves.Abu Dawud said: Muslim b. Ibrahim reported from 'Abd al-Samad b. Habib on the authority of his father that they had fought a battle at Kabul along with 'Abd al-Rahman b. Samurah. He led us in prayer in time of danger.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587"
      ]
    },
    {
      "id": "sunan-abi-daud-1580",
      "hadith_no": "1580",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن عثمان بن أبي زرعة، عن أبي ليلى الكندي، عن سويد بن غفلة، قال أتانا مصدق النبي صلى الله عليه وسلم فأخذت بيده وقرأت في عهده ‏\"‏ لا يجمع بين مفترق ولا يفرق بين مجتمع خشية الصدقة ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ راضع لبن ‏\"‏ ‏.‏",
      "text_en": " Suwaid bin Ghaflah reported The collector of the Prophet (ﷺ) came to us. I caught hold of his hand and read in the document that the goods were not to be combined nor were they to be separated for fear of zakat. There is no mention of milch animals in this tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20587",
        "21619",
        "11174"
      ]
    },
    {
      "id": "sunan-abi-daud-1903",
      "hadith_no": "1903",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق بن يوسف، أخبرنا شريك، عن إسماعيل بن أبي خالد، قال سمعت عبد الله بن أبي أوفى، بهذا الحديث زاد ثم أتى الصفا والمروة فسعى بينهما سبعا ثم حلق رأسه ‏.‏",
      "text_en": " Isma’il bin Abi Khalid said I heard ‘Abd Allaah bin Abi Aufa narrated this tradition. His version added “He then came to Al Safa’ and Al Marwah and ran between them seven times and then shaved his head.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11418",
        "5115"
      ]
    },
    {
      "id": "sunan-abi-daud-1930",
      "hadith_no": "1930",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا إسحاق، - يعني ابن يوسف - عن شريك، عن أبي إسحاق، عن سعيد بن جبير، وعبد الله بن مالك، قالا صلينا مع ابن عمر بالمزدلفة المغرب والعشاء بإقامة واحدة فذكر معنى حديث ابن كثير ‏.‏",
      "text_en": " Sa’id bin Jubair and ‘Abd Allah bin Malik said “We offered the sunset and the night prayers at Al Muzdalifah along with ibn ‘Umar with one iqamah.” The narrator then narrated the rest of the tradition as reported by Ibn Kathir.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20411",
        "20587",
        "11049",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-2128",
      "hadith_no": "2128",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن الصباح البزار، حدثنا شريك، عن منصور، عن طلحة، عن خيثمة، عن عائشة، قالت أمرني رسول الله صلى الله عليه وسلم أن أدخل امرأة على زوجها قبل أن يعطيها شيئا ‏.‏ قال أبو داود خيثمة لم يسمع من عائشة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) commanded me to send a woman to her husband before he gave something to her.Abu Dawud said: The narrator Khaithamah did not hear (any tradition) from 'Aishah.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20587",
        "11067",
        "11356",
        "11332",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2140",
      "hadith_no": "2140",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا إسحاق بن يوسف، عن شريك، عن حصين، عن الشعبي، عن قيس بن سعد، قال أتيت الحيرة فرأيتهم يسجدون لمرزبان لهم فقلت رسول الله أحق أن يسجد له قال فأتيت النبي صلى الله عليه وسلم فقلت إني أتيت الحيرة فرأيتهم يسجدون لمرزبان لهم فأنت يا رسول الله أحق أن نسجد لك ‏.‏ قال ‏\"‏ أرأيت لو مررت بقبري أكنت تسجد له ‏\"‏ ‏.‏ قال قلت لا ‏.‏ قال ‏\"‏ فلا تفعلوا لو كنت آمرا أحدا أن يسجد لأحد لأمرت النساء أن يسجدن لأزواجهن لما جعل الله لهم عليهن من الحق ‏\"‏ ‏.‏",
      "text_en": " Narrated Qays ibn Sa'd:                     I went to al-Hirah and saw them (the people) prostrating themselves before a satrap of theirs, so I said: The Messenger of Allah (ﷺ) has most right to have prostration made before him. When I came to the Prophet (ﷺ), I said: I went to al-Hirah and saw them prostrating themselves before a satrap of theirs, but you have most right, Messenger of Allah, to have (people) prostrating themselves before you. He said: Tell me , if you were to pass my grave, would you prostrate yourself before it? I said: No. He then said: Do not do so. If I were to command anyone to make prostration before another I would command women to prostrate themselves before their husbands, because of the special right over them given to husbands by Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20411",
        "20587",
        "15097",
        "11052",
        "172"
      ]
    },
    {
      "id": "sunan-abi-daud-2149",
      "hadith_no": "2149",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، أخبرنا شريك، عن أبي ربيعة الإيادي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم لعلي ‏\"‏ يا علي لا تتبع النظرة النظرة فإن لك الأولى وليست لك الآخرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: to Ali: Do not give a second look, Ali, (because) while you are not to blame for the first, you have no right to the second.",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2157",
      "hadith_no": "2157",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا شريك، عن قيس بن وهب، عن أبي الوداك، عن أبي سعيد الخدري، ورفعه، أنه قال في سبايا أوطاس ‏\"‏ لا توطأ حامل حتى تضع ولا غير ذات حمل حتى تحيض حيضة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id Al Khudri traced to Prophet (ﷺ) the following statement regarding the captives taken at Atwas. There must be no intercourse with pregnant woman till she gives birth to her child or with the one who is not pregnant till she has had one menstrual period.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20587",
        "10815",
        "10752",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-2364",
      "hadith_no": "2364",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا شريك، ح وحدثنا مسدد، حدثنا يحيى، عن سفيان، عن عاصم بن عبيد الله، عن عبيد الله بن عامر بن ربيعة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يستاك وهو صائم ‏.‏ زاد مسدد ما لا أعد ولا أحصي ‏.‏",
      "text_en": " Narrated Amir ibn Rabi'ah:                     I have seen the Messenger of Allah (ﷺ) using a tooth-stick while he was fasting. Musaddad added in his version: \"more often than I could count.\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20587",
        "30175",
        "20031",
        "20012",
        "19808"
      ]
    },
    {
      "id": "sunan-abi-daud-2478",
      "hadith_no": "2478",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا شريك، عن المقدام بن شريح، عن أبيه، قال سألت عائشة - رضى الله عنها - عن البداوة، فقالت كان رسول الله صلى الله عليه وسلم يبدو إلى هذه التلاع وإنه أراد البداوة مرة فأرسل إلى ناقة محرمة من إبل الصدقة فقال لي ‏\"‏ يا عائشة ارفقي فإن الرفق لم يكن في شىء قط إلا زانه ولا نزع من شىء قط إلا شانه ‏\"‏ ‏.‏",
      "text_en": " Miqdan bin Shuraih reported on the authority of his father. I asked A’ishah about settling in the desert (to worship Allaah in loneliness). She said “The Apostle of Allaah(ﷺ) would go out (from Madina) to these torrential streams. Once he intended to go out to the desert (for worshipping Allaah). He sent me a She-Camel from the Camels of sadaqah that was not used as a mount. He said to me “A’ishah be lenient, for leniency makes a thing  decorated and when it is removed from a thing it makes it defective.",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20587",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2592",
      "hadith_no": "2592",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق بن إبراهيم المروزي، - وهو ابن راهويه - حدثنا يحيى بن آدم، حدثنا شريك، عن عمار الدهني، عن أبي الزبير، عن جابر، يرفعه إلى النبي صلى الله عليه وسلم أنه كان لواؤه يوم دخل مكة أبيض ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     When the Prophet (ﷺ) entered Mecca his banner was white.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20364",
        "20587",
        "10802",
        "11263"
      ]
    },
    {
      "id": "sunan-abi-daud-2790",
      "hadith_no": "2790",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شريك، عن أبي الحسناء، عن الحكم، عن حنش، قال رأيت عليا يضحي بكبشين فقلت ما هذا فقال إن رسول الله صلى الله عليه وسلم أوصاني أن أضحي عنه فأنا أضحي عنه ‏.‏",
      "text_en": " Narrated Hanash:                     I saw Ali sacrificing two rams; so I asked him: What is this? He replied. The Messenger of Allah (ﷺ) enjoined upon me to sacrifice on his behalf, so that is what I am doing.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20587",
        "11069",
        "15113"
      ]
    },
    {
      "id": "sunan-abi-daud-2904",
      "hadith_no": "2904",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسين بن أسود العجلي، حدثنا يحيى بن آدم، حدثنا شريك، عن جبريل بن أحمر أبي بكر، عن ابن بريدة، عن أبيه، قال مات رجل من خزاعة فأتي النبي صلى الله عليه وسلم بميراثه فقال ‏\"‏ التمسوا له وارثا أو ذا رحم ‏\"‏ ‏.‏ فلم يجدوا له وارثا ولا ذا رحم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعطوه الكبر من خزاعة ‏\"‏ ‏.‏ قال يحيى قد سمعته مرة يقول في هذا الحديث ‏\"‏ انظروا أكبر رجل من خزاعة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A man of Khuza'ah died and his estate was brought to the Prophet (ﷺ). He said: Look for his heir or some relative. But they found neither heir nor relative. The Messenger of Allah (ﷺ) said: Give it to the leading man of Khuza'ah. The narrator Yahya said: Sometimes I heard him (al-Husayn ibn Aswad) say in this tradition: Look for the greatest man of Khuza'ah.",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3040",
      "hadith_no": "3040",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا عبد الرحمن بن هانئ أبو نعيم النخعي، أخبرنا شريك، عن إبراهيم بن مهاجر، عن زياد بن حدير، قال قال علي لئن بقيت لنصارى بني تغلب لأقتلن المقاتلة ولأسبين الذرية فإني كتبت الكتاب بينهم وبين النبي صلى الله عليه وسلم على أن لا ينصروا أبناءهم ‏.‏ قال أبو داود هذا حديث منكر بلغني عن أحمد أنه كان ينكر هذا الحديث إنكارا شديدا وهو عند بعض الناس شبه المتروك وأنكروا هذا الحديث على عبد الرحمن بن هانئ قال أبو علي ولم يقرأه أبو داود في العرضة الثانية ‏.‏",
      "text_en": " ‘Ali said “If I survive for the Christians of Banu Taghlib I shall kill fighters and captivate children for I had written a document between them and the Prophet(ﷺ) to the effect that they would not make their children Christian.Abu Dawud said “This is rejected (munkar) tradition and it has reached me from Ahmad (bin Hanbal) that he used to reject this tradition seriously.Abu ‘Ali said “Abu Dawud did not present this (tradition) in this second reading.”",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20587",
        "10739",
        "18306"
      ]
    },
    {
      "id": "sunan-abi-daud-3285",
      "hadith_no": "3285",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا شريك، عن سماك، عن عكرمة، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ والله لأغزون قريشا، والله لأغزون قريشا، والله لأغزون قريشا ‏\"‏ ‏.‏ ثم قال ‏:‏ ‏\"‏ إن شاء الله ‏\"‏ ‏.‏ قال أبو داود ‏:‏ وقد أسند هذا الحديث غير واحد عن شريك عن سماك عن عكرمة عن ابن عباس أسنده عن النبي صلى الله عليه وسلم وقال الوليد بن مسلم عن شريك ‏:‏ ثم لم يغزهم ‏.‏",
      "text_en": " Narrated Ikrimah ibn AbuJahl:                     The Prophet (ﷺ) said: I swear by Allah, I shall fight against the Quraysh; I swear by Allah, I shall fight against the Quraysh; I swear by Allah, I shall fight against the Quraysh. He then said: \"If Allah wills.\"Abu Dawud said: A number of persons have narrated this tradition from Sharik, from Simak, from 'Ikrimah, from Ibn 'Abbas who reported from the Prophet (ﷺ): \"But he did not fight against them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20587",
        "10770",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-3295",
      "hadith_no": "3295",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا أبو النضر، حدثنا شريك، عن محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، قال ‏:‏ جاء رجل إلى النبي صلى الله عليه وسلم فقال ‏:‏ يا رسول الله إن أختي نذرت - يعني - أن تحج ماشية ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ إن الله لا يصنع بشقاء أختك شيئا، فلتحج راكبة ولتكفر عن يمينها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man came to Prophet (ﷺ) and said: Messenger of Allah, my sister has taken a vow to perform hajj on foot. The Prophet (ﷺ) said: Allah gets no good from the affliction your sister imposed on herself, so let her perform hajj riding and make atonement for her oath.",
      "usc_msa_ref": "",
      "chain": [
        "20390",
        "20587",
        "10818",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3344",
      "hadith_no": "3344",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وقتيبة بن سعيد، عن شريك، عن سماك، عن عكرمة، رفعه - قال عثمان وحدثنا وكيع، عن شريك، عن سماك، عن عكرمة، - عن ابن عباس، عن النبي صلى الله عليه وسلم مثله قال اشترى من عير تبيعا وليس عنده ثمنه فأربح فيه فباعه فتصدق بالربح على أرامل بني عبد المطلب وقال لا أشتري بعدها شيئا إلا وعندي ثمنه ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Ibn 'Abbas though a different chain of narrators. This version says:                      \"He (the Prophet) purchased a calf from a caravan, but he had no money with him. He then sold it with some profit and gave the profit in charity to the poor and widows of Banu 'Abd al-Muttalib. He then said: I shall not buy anything after this but only when I have money with me.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30367",
        "20587",
        "10770",
        "4",
        "20032",
        "11858",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3403",
      "hadith_no": "3403",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا شريك، عن أبي إسحاق، عن عطاء، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من زرع في أرض قوم بغير إذنهم فليس له من الزرع شىء وله نفقته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     The Prophet (ﷺ) said: If anyone sows in other people's land without their permission, he has no right to any of the crop, but he may have what it cost him.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20587",
        "11049",
        "11029",
        "1986"
      ]
    },
    {
      "id": "sunan-abi-daud-3535",
      "hadith_no": "3535",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، وأحمد بن إبراهيم، قالا حدثنا طلق بن غنام، عن شريك، - قال ابن العلاء وقيس - عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Pay the deposit to him who deposited it with you, and do not betray him who betrayed you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30494",
        "30197",
        "20587",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3582",
      "hadith_no": "3582",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن عون، قال أخبرنا شريك، عن سماك، عن حنش، عن علي، عليه السلام قال بعثني رسول الله صلى الله عليه وسلم إلى اليمن قاضيا فقلت يا رسول الله ترسلني وأنا حديث السن ولا علم لي بالقضاء فقال ‏\"‏ إن الله سيهدي قلبك ويثبت لسانك فإذا جلس بين يديك الخصمان فلا تقضين حتى تسمع من الآخر كما سمعت من الأول فإنه أحرى أن يتبين لك القضاء ‏\"‏ ‏.‏ قال فما زلت قاضيا أو ما شككت في قضاء بعد ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) sent me to the Yemen as judge, and I asked: Messenger of Allah, are you sending me when I am young and have no knowledge of the duties of a judge? He replied: Allah will guide your heart and keep your tongue true. When two litigants sit in front of you, do not decide till you hear what the other has to say as you heard what the first had to say; for it is best that you should have a clear idea of the best decision. He said: I had been a judge (for long); or he said (the narrator is doubtful): I have no doubts about a decision afterwards.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20587",
        "10770",
        "15113"
      ]
    },
    {
      "id": "sunan-abi-daud-3889",
      "hadith_no": "3889",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا سليمان بن داود، حدثنا شريك، ح وحدثنا العباس العنبري، حدثنا يزيد بن هارون، أخبرنا شريك، عن العباس بن ذريح، عن الشعبي، - قال العباس - عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا رقية إلا من عين أو حمة أو دم يرقأ ‏\"‏ ‏.‏ لم يذكر العباس العين وهذا لفظ سليمان بن داود ‏.‏",
      "text_en": " Anas reported the Prophet (ﷺ) as saying :                      No spell is to be used except for the evil eye, or sting of  poisonous insects, or bleeding. The narrator al-‘Abhas did mention the words “evil eye”. The is the version of Sulaiman b. Dawud.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20587",
        "30437",
        "20472",
        "11858",
        "11052",
        "100",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4465",
      "hadith_no": "4465",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن يونس، أن شريكا، وأبا الأحوص، وأبا، بكر بن عياش حدثوهم عن عاصم، عن أبي رزين، عن ابن عباس، قال ليس على الذي يأتي البهيمة حد ‏.‏ قال أبو داود كذا قال عطاء وقال الحكم أرى أن يجلد ولا يبلغ به الحد ‏.‏ وقال الحسن هو بمنزلة الزاني ‏.‏ قال أبو داود حديث عاصم يضعف حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " 'Asim reported from Abu Razin on the authority of Ibn 'Abbas saying:                      There is no prescribed punishment for one who has sexual intercourse with an animal.Abu Dawud said: 'Ata is also so. Al Hakam said: I think he should be flogged, but the number should not reach the one of the prescribed punishment. Al-Hasan said: He is like a fornicator.Abu Dawud said: THe tradition of 'Asim proves the tradition of 'Amr b. Abi 'Amr as weak.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20587",
        "20327",
        "11080",
        "10826",
        "17",
        "11029"
      ]
    },
    {
      "id": "sunan-abi-daud-4486",
      "hadith_no": "4486",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا شريك، عن أبي حصين، عن عمير بن سعيد، عن علي، رضى الله عنه قال لا أدي - أو ما كنت لأدي - من أقمت عليه حدا إلا شارب الخمر فإن رسول الله صلى الله عليه وسلم لم يسن فيه شيئا إنما هو شىء قلناه نحن ‏.‏",
      "text_en": " ’Ali said:                      I shall not pay blood-money or (he said) : I am not going to pay blood-money for him on whom I inflicted the prescribed punishment except for the one who drank wine, for the Messenger of Allah (ﷺ) did not prescribe anything definite. It is a thing which we have decided (by agreement) ourselves.",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11371",
        "11646",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-4580",
      "hadith_no": "4580",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سنان العوقي، حدثنا شريك، عن مغيرة، عن إبراهيم، وجابر، عن الشعبي، قال الغرة خمسمائة درهم ‏.‏ قال أبو داود قال ربيعة الغرة خمسون دينارا ‏.‏",
      "text_en": " Narrated Al-Sha'bi:                     The price of a male or a female slave is five hundred dirhams.Abu Dawud said: Rabi'ah said: The price of a male or a female slave is fifty dinars.",
      "usc_msa_ref": "",
      "chain": [
        "30166",
        "20587",
        "11072",
        "11051",
        "34",
        "11052",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-4793",
      "hadith_no": "4793",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عباس العنبري، حدثنا أسود بن عامر، حدثنا شريك، عن الأعمش، عن مجاهد، عن عائشة، في هذه القصة قالت فقال تعني النبي صلى الله عليه وسلم ‏\"‏ يا عائشة إن من شرار الناس الذين يكرمون اتقاء ألسنتهم ‏\"‏ ‏.‏",
      "text_en": " THE TRADITION MENTIONED ABOVE HAS BEEN TRANSMITTED BY ‘A’ISHAH THROUGH A DIFFERENT CHAIN OF NARRATORS. THIS VERSION HAS:                      THE PROPHET (MAY PEACE BE UPON HIM) SAID: ‘A’ISHAH! THERE ARE SOME BAD PEOPLE WHO ARE RESPECTED FOR FEAR OF THEIR TONGUES.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20380",
        "20587",
        "11060",
        "11028"
      ]
    },
    {
      "id": "sunan-abi-daud-4825",
      "hadith_no": "4825",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن جعفر الوركاني، وهناد، أن شريكا، أخبرهم عن سماك، عن جابر بن سمرة، قال كنا إذا أتينا النبي صلى الله عليه وسلم جلس أحدنا حيث ينتهي ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     When we came to the Prophet (ﷺ), each one would sit down where there was room.",
      "usc_msa_ref": "",
      "chain": [
        "30513",
        "30480",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-abi-daud-4873",
      "hadith_no": "4873",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن الركين بن الربيع، عن نعيم بن حنظلة، عن عمار، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان له وجهان في الدنيا كان له يوم القيامة لسانان من نار ‏\"‏ ‏.‏",
      "text_en": " Narrated Ammar:                     The Prophet (ﷺ) said: He who is two-faced in this world will have two tongues of fire on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "10763",
        "15950",
        "25"
      ]
    },
    {
      "id": "sunan-abi-daud-5002",
      "hadith_no": "5002",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن مهدي، حدثنا شريك، عن عاصم، عن أنس، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا ذا الأذنين ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) addressed me as: O you with the two ears.",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11080",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-5249",
      "hadith_no": "5249",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الحميد بن بيان السكري، عن إسحاق بن يوسف، عن شريك، عن أبي إسحاق، عن القاسم بن عبد الرحمن، عن أبيه، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوا الحيات كلهن فمن خاف ثأرهن فليس مني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: Kill all the snakes, and he who fears their revenge does not belong to me.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11049",
        "19896",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-12",
      "hadith_no": "12",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن المقدام بن شريح، عن أبيه، عن عائشة، قالت من حدثكم أن النبي صلى الله عليه وسلم كان يبول قائما فلا تصدقوه ما كان يبول إلا قاعدا ‏.‏ قال وفي الباب عن عمر وبريدة وعبد الرحمن بن حسنة ‏.‏ قال أبو عيسى حديث عائشة أحسن شيء في هذا الباب وأصح ‏.‏ وحديث عمر إنما روي من حديث عبد الكريم بن أبي المخارق عن نافع عن ابن عمر عن عمر قال رآني النبي صلى الله عليه وسلم وأنا أبول قائما فقال ‏\"‏ يا عمر لا تبل قائما ‏\"‏ ‏.‏ فما بلت قائما بعد ‏.‏ قال أبو عيسى وإنما رفع هذا الحديث عبد الكريم بن أبي المخارق وهو ضعيف عند أهل الحديث ضعفه أيوب السختياني وتكلم فيه ‏.‏ وروى عبيد الله عن نافع عن ابن عمر قال قال عمر رضى الله عنه ما بلت قائما منذ أسلمت ‏.‏ وهذا أصح من حديث عبد الكريم وحديث بريدة في هذا غير محفوظ ‏.‏ ومعنى النهى عن البول قائما على التأديب لا على التحريم ‏.‏ وقد روي عن عبد الله بن مسعود قال إن من الجفاء أن تبول وأنت قائم ‏.‏",
      "text_en": " Aishah said:                     \"Whoever narrated to you that the Prophet would urinate while standing; then do not believe him. He would not urinate except while squatting.\" [He said:] There are narrations on this topic from Umar, Buraidah, [and Abdur-Rahman bin Hasanah].",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-45",
      "hadith_no": "45",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا شريك، عن ثابت بن أبي صفية، قال قلت لأبي جعفر حدثك جابر، أن النبي صلى الله عليه وسلم توضأ مرة مرة ومرتين مرتين وثلاثا ثلاثا قال نعم ‏.‏",
      "text_en": " Thabit bin Abi Safiyyah said, :                     \"I asked Abu Ja'far: 'Did Jabir narrate to you that: \"The Prophet performed Wudu one time each, and two times, and three times?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "15054"
      ]
    },
    {
      "id": "jami-al-tirmidhi-88",
      "hadith_no": "88",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا شريك، عن أبي فزارة، عن أبي زيد، عن عبد الله بن مسعود، قال سألني النبي صلى الله عليه وسلم ‏\"‏ ما في إداوتك ‏\"‏ ‏.‏ فقلت نبيذ ‏.‏ فقال ‏\"‏ تمرة طيبة وماء طهور ‏\"‏ ‏.‏ قال فتوضأ منه ‏.‏ قال أبو عيسى وإنما روي هذا الحديث عن أبي زيد عن عبد الله عن النبي صلى الله عليه وسلم ‏.‏ وأبو زيد رجل مجهول عند أهل الحديث لا يعرف له رواية غير هذا الحديث ‏.‏ وقد رأى بعض أهل العلم الوضوء بالنبيذ منهم سفيان الثوري وغيره ‏.‏ وقال بعض أهل العلم لا يتوضأ بالنبيذ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال إسحاق إن ابتلي رجل بهذا فتوضأ بالنبيذ وتيمم أحب إلى ‏.‏ قال أبو عيسى وقول من يقول لا يتوضأ بالنبيذ أقرب إلى الكتاب وأشبه لأن الله تعالى قال‏:‏ ‏\"‏فإن لم تجدوا ماء فتيمموا صعيدا طيبا ‏\"‏‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"The Prophet asked me: \"What is in your Idawah (water skin)?\" I said: \"Nabidh.\" He said: \"Dates are wholesome and water is pure.\" He said: \"So he performed Wudu with it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20587",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-107",
      "hadith_no": "107",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن أبي إسحاق، عن الأسود، عن عائشة، أن النبي صلى الله عليه وسلم كان لا يتوضأ بعد الغسل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال أبو عيسى وهذا قول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين أن لا يتوضأ بعد الغسل ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet would not perform Wudu after the Ghusl.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-112",
      "hadith_no": "112",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن أبي الجحاف، عن عكرمة، عن ابن عباس، قال إنما الماء من الماء في الاحتلام ‏.‏ قال أبو عيسى سمعت الجارود يقول سمعت وكيعا يقول لم نجد هذا الحديث إلا عند شريك ‏.‏ قال أبو عيسى وأبو الجحاف اسمه داود بن أبي عوف ‏.‏ ويروى عن سفيان الثوري قال حدثنا أبو الجحاف وكان مرضيا ‏.‏ قال أبو عيسى وفي الباب عن عثمان بن عفان وعلي بن أبي طالب والزبير وطلحة وأبي أيوب وأبي سعيد عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ الماء من الماء ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                     \"Water is for water' is only about the wet dream.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "18265",
        "11023",
        "17",
        "38130",
        "20012"
      ]
    },
    {
      "id": "jami-al-tirmidhi-126",
      "hadith_no": "126",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا شريك، عن أبي اليقظان، عن عدي بن ثابت، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم أنه قال في المستحاضة ‏\"‏ تدع الصلاة أيام أقرائها التي كانت تحيض فيها ثم تغتسل وتتوضأ عند كل صلاة وتصوم وتصلي ‏\"‏ ‏.‏",
      "text_en": " Adiyy bin Thabit narrated from his father, that :                     the Prophet said about the Mustahadah that she should: \"Leave the Salat for the days of her period which she menstruates in, then perform Ghusl, and perform Wudu for every Salat, and observe Saum and perform Salat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20587",
        "11372"
      ]
    },
    {
      "id": "jami-al-tirmidhi-127",
      "hadith_no": "127",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث قد تفرد به شريك عن أبي اليقظان ‏.‏ قال وسألت محمدا عن هذا الحديث فقلت عدي بن ثابت عن أبيه عن جده جد عدي ما اسمه فلم يعرف محمد اسمه وذكرت لمحمد قول يحيى بن معين أن اسمه دينار فلم يعبأ به ‏.‏ وقال أحمد وإسحاق في المستحاضة إن اغتسلت لكل صلاة هو أحوط لها وإن توضأت لكل صلاة أجزأها وإن جمعت بين الصلاتين بغسل واحد أجزأها ‏.‏",
      "text_en": " A similar narration as no. 120. :                     Abu Eisa said: Sharik is alone in narrating this Hadith from Abu Al Yaqzan.[He said:] I asked Muhammad (ibn Isma'il AI-Bukhari) about this Hadlth. I said: \"Adiyy bin Thabit from his father, from his grandfather; what is the name of Adiyy's grandfather?\" But Muhammad did not know his name. And I mentioned to Muhammad that Yahya bin Ma'in said his name is Dinar, and he did not contradict him.Ahmad and 1shaq said ahout the Mustahadah: If she performs Ghusl for every prayer that is more prudent for her, and if she performs Wudu for each prayer, then that is acceptable from her, and if she combines between two prayers with (one) Ghusl then that is acceptable.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11035"
      ]
    },
    {
      "id": "jami-al-tirmidhi-136",
      "hadith_no": "136",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن خصيف، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الرجل يقع على امرأته وهي حائض قال ‏\"‏ يتصدق بنصف دينار ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said about a man who had sexual intercourse with his wife while she is menstruating: \"He should give half a Dinar in charity.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "19908",
        "11725",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-462",
      "hadith_no": "462",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يقرأ في الوتر ب ‏(‏سبح اسم ربك الأعلى ‏)‏ و ‏(‏قل يا أيها الكافرون ‏)‏ و ‏(‏قل هو الله أحد ‏)‏ في ركعة ركعة ‏.‏ قال وفي الباب عن علي وعائشة وعبد الرحمن بن أبزى عن أبى بن كعب ويروى عن عبد الرحمن بن أبزى عن النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى وقد روي عن النبي صلى الله عليه وسلم أنه قرأ في الوتر في الركعة الثالثة بالمعوذتين و ‏(‏قل هو الله أحد ‏)‏ ‏.‏ والذي اختاره أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم أن يقرأ ب ‏(‏سبح اسم ربك الأعلى ‏)‏ و ‏(‏قل يا أيها الكافرون ‏)‏ و ‏(‏قل هو الله أحد ‏)‏ ‏.‏ يقرأ في كل ركعة من ذلك بسورة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"Allah's Messenger would recite during Al-Witr: \"Glorify the Name of your Lord the Most High' and, 'Say: O you disbelievers!' and, 'Say: Allah is One,' in each Rak'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-520",
      "hadith_no": "520",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن مخول بن راشد، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يقرأ يوم الجمعة في صلاة الفجر * ‏(‏تنزيل ‏)‏ السجدة و ‏(‏هل أتى على الإنسان ‏)‏ ‏.‏ قال وفي الباب عن سعد وابن مسعود وأبي هريرة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد رواه سفيان الثوري وشعبة وغير واحد عن مخول ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11390",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-530",
      "hadith_no": "530",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا شريك، عن أبي إسحاق، عن الحارث، عن علي بن أبي طالب، قال من السنة أن تخرج، إلى العيد ماشيا وأن تأكل شيئا قبل أن تخرج ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا الحديث عند أكثر أهل العلم يستحبون أن يخرج الرجل إلى العيد ماشيا وأن يأكل شيئا قبل أن يخرج لصلاة الفطر ‏.‏ قال أبو عيسى ويستحب أن لا يركب إلا من عذر ‏.‏",
      "text_en": " Ali bin Abi Talib narrated:                     \"It is from the SUnnah to leave for the Eid walking, and to eat something before leaving.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11049",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-609",
      "hadith_no": "609",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن شريك، عن عبد الله بن عيسى، عن ابن جبر، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يجزئ في الوضوء رطلان من ماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث شريك على هذا اللفظ ‏.‏ وروى شعبة عن عبد الله بن عبد الله بن جبر عن أنس بن مالك أن النبي صلى الله عليه وسلم كان يتوضأ بالمكوك ويغتسل بخمسة مكاكي ‏.‏ وروي عن سفيان الثوري عن عبد الله بن عيسى عن عبد الله بن جبر عن أنس أن النبي صلى الله عليه وسلم كان يتوضأ بالمد ويغتسل بالصاع ‏.‏ وهذا أصح من حديث شريك ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20587",
        "11361",
        "11185",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-650",
      "hadith_no": "650",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة، وعلي بن حجر، - قال قتيبة حدثنا شريك، وقال، علي أخبرنا شريك، والمعنى، واحد، عن حكيم بن جبير، عن محمد بن عبد الرحمن بن يزيد، عن أبيه، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الناس وله ما يغنيه جاء يوم القيامة ومسألته في وجهه خموش أو خدوش أو كدوح ‏\"‏ ‏.‏ قيل يا رسول الله وما يغنيه قال ‏\"‏ خمسون درهما أو قيمتها من الذهب ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن ‏.‏ وقد تكلم شعبة في حكيم بن جبير من أجل هذا الحديث ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     the Messenger of Allah said: \"Whoever begs from the people while he has what he needs, he will come on the Day of Judgment and his begging with be scratches or lacerations, or bite marks on his face.\" They said: \"O Messenger of Allah! 'How much is it that one needs?' He said: 'Fifty Dirham, or their value in gold.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20387",
        "30367",
        "20587",
        "5",
        "20587",
        "19866",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-659",
      "hadith_no": "659",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن أحمد بن مدويه، حدثنا الأسود بن عامر، عن شريك، عن أبي حمزة، عن الشعبي، عن فاطمة بنت قيس، قالت سألت أو سئل النبي صلى الله عليه وسلم عن الزكاة فقال ‏\"‏ إن في المال لحقا سوى الزكاة ‏\"‏ ‏.‏ ثم تلا هذه الآية التي في البقرة ‏(‏ ليس البر أن تولوا وجوهكم ‏)‏ الآية ‏.‏",
      "text_en": " Fatimah bint Qais narrated that :                     she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is in Al-Baqarah: 'It is not Al-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)",
      "usc_msa_ref": "",
      "chain": [
        "20380",
        "20587",
        "20458",
        "11052",
        "224"
      ]
    },
    {
      "id": "jami-al-tirmidhi-660",
      "hadith_no": "660",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن الطفيل، عن شريك، عن أبي حمزة، عن عامر الشعبي، عن فاطمة بنت قيس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في المال حقا سوى الزكاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إسناده ليس بذاك ‏.‏ وأبو حمزة ميمون الأعور يضعف ‏.‏ وروى بيان وإسماعيل بن سالم عن الشعبي هذا الحديث قوله وهذا أصح ‏.‏",
      "text_en": " Fatimah bint Qais narrated that :                     the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20587",
        "20458",
        "11052",
        "224"
      ]
    },
    {
      "id": "jami-al-tirmidhi-784",
      "hadith_no": "784",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن حبيب بن زيد، عن ليلى، عن مولاتها، عن النبي صلى الله عليه وسلم قال ‏\"‏ الصائم إذا أكل عنده المفاطير صلت عليه الملائكة ‏\"‏ ‏.‏ قال أبو عيسى وروى شعبة هذا الحديث عن حبيب بن زيد عن ليلى عن جدته أم عمارة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Laila narrated from the one who freed her (Umm Amarah) that:                     The Prophet said: \"When those who are not fasting eat in the presence of the fasting person, the angels send Salat upon him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "20700"
      ]
    },
    {
      "id": "jami-al-tirmidhi-866",
      "hadith_no": "866",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "يحيى بن يمان، عن شريك، عن أبي إسحاق، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من طاف بالبيت خمسين مرة خرج من ذنوبه كيوم ولدته أمه ‏\"‏ ‏.‏ قال وفي الباب عن أنس وابن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث غريب ‏.‏ سألت محمدا عن هذا الحديث فقال إنما يروى هذا عن ابن عباس قوله ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"Whoever performed Tawaf around the House fifty time, he will be as free of his sins as the day his mother bore him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20617",
        "20587",
        "11049",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-945",
      "hadith_no": "945",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن جابر، وهو ابن يزيد الجعفي عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت حضت فأمرني رسول الله صلى الله عليه وسلم أن أقضي المناسك كلها إلا الطواف بالبيت ‏.‏ قال أبو عيسى العمل على هذا الحديث عند أهل العلم أن الحائض تقضي المناسك كلها ما خلا الطواف بالبيت ‏.‏ وقد روي هذا الحديث عن عائشة من غير هذا الوجه أيضا ‏.‏",
      "text_en": " Aishah narrated:                     \"I got my menses do the Prophet ordered me to carry out all the rites except for Tawaf around the House.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "34",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1101",
      "hadith_no": "1101",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك بن عبد الله، عن أبي إسحاق، ح وحدثنا قتيبة، حدثنا أبو عوانة، عن أبي إسحاق، ح وحدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن إسرائيل، عن أبي إسحاق، ح وحدثنا عبد الله بن أبي زياد، حدثنا زيد بن حباب، عن يونس بن أبي إسحاق، عن أبي إسحاق، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نكاح إلا بولي ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وابن عباس وأبي هريرة وعمران بن حصين وأنس ‏.‏",
      "text_en": " Abu Musa narrated that :                     the Messenger of Allah said: \"There is no marriage except with a Wali.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "30367",
        "20469",
        "11049",
        "30160",
        "20033",
        "20311",
        "11049",
        "20650",
        "10846",
        "11049"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1264",
      "hadith_no": "1264",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا طلق بن غنام، عن شريك، وقيس، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا إذا كان للرجل على آخر شيء فذهب به فوقع له عنده شيء فليس له أن يحبس عنه بقدر ما ذهب له عليه ‏.‏ ورخص فيه بعض أهل العلم من التابعين ‏.‏ وهو قول الثوري وقال إن كان له عليه دراهم فوقع له عنده دنانير فليس له أن يحبس بمكان دراهمه إلا أن يقع عنده له دراهم فله حينئذ أن يحبس من دراهمه بقدر ما له عليه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"Fulfill the trust for the one who entrusted you, and do not cheat the one who cheated you.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge followed this Hadith, they said that when something belonging to a man is with another and he leaves (with it), then he has something that belongs to him, he may not withhold from him an equivalent to what the other took of his.Some of the people of knowledge among the Tabi'in allowed that. This is the view of Sufyan Ath-Thawri, he said: \"If one man has some Dirham that belong to another, and the second has some Dinar belonging to the first, he may not withhold any in place of his Dirham, unless it so happens that he has some Dirham of his, then in that case he can withhold some of his Dirham equal to what he is owed by the first.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30197",
        "20587",
        "11046",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1322-2",
      "hadith_no": "1322",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثني الحسن بن بشر، حدثنا شريك، عن الأعمش، عن سعد بن عبيدة، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة قاضيان في النار وقاض في الجنة رجل قضى بغير الحق فعلم ذاك فذاك في النار وقاض لا يعلم فأهلك حقوق الناس فهو في النار وقاض قضى بالحق فذلك في الجنة ‏\"‏ ‏.‏",
      "text_en": " [Ibn Buraidah narrated from his father that the Prophet (ﷺ) said:                      \"The judges are three: Two judges that are in the Fire, and a judge that is in Paradise. A man who judges without the truth, and he knows that. This one is in the Fire. One who judges while not knowing, ruining the rights of the people. So he is in the Fire. A judge who judges with the truth, that is the one in Paradise.\"] (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "30188",
        "20587",
        "11060",
        "11344",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1366",
      "hadith_no": "1366",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا شريك بن عبد الله النخعي، عن أبي إسحاق، عن عطاء، عن رافع بن خديج، أن النبي صلى الله عليه وسلم قال ‏\"‏ من زرع في أرض قوم بغير إذنهم فليس له من الزرع شيء وله نفقته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث أبي إسحاق إلا من هذا الوجه من حديث شريك بن عبد الله ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم وهو قول أحمد وإسحاق ‏.‏ وسألت محمد بن إسماعيل عن هذا الحديث فقال هو حديث حسن ‏.‏ وقال لا أعرفه من حديث أبي إسحاق إلا من رواية شريك ‏.‏  قال محمد حدثنا معقل بن مالك البصري، حدثنا عقبة بن الأصم، عن عطاء، عن رافع بن خديج، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20587",
        "11049",
        "11029",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1385",
      "hadith_no": "1385",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمود بن غيلان، أخبرنا الفضل بن موسى الشيباني، أخبرنا شريك، عن شعبة، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لم يحرم المزارعة ولكن أمر أن يرفق بعضهم ببعض ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وحديث رافع فيه اضطراب يروى هذا الحديث عن رافع بن خديج عن عمومته ويروى عنه عن ظهير بن رافع وهو أحد عمومته وقد روي هذا الحديث عنه على روايات مختلفة ‏.‏ وفي الباب عن زيد بن ثابت وجابر رضى الله عنهما ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "20587",
        "20020",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1437",
      "hadith_no": "1437",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا هناد، حدثنا شريك، عن سماك بن حرب، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم رجم يهوديا ويهودية ‏.‏ قال وفي الباب عن ابن عمر والبراء وجابر وابن أبي أوفى وعبد الله بن الحارث بن جزء وابن عباس ‏.‏ قال أبو عيسى حديث جابر بن سمرة حديث حسن غريب ‏.‏ والعمل على هذا عند أكثر أهل العلم قالوا إذا اختصم أهل الكتاب وترافعوا إلى حكام المسلمين حكموا بينهم بالكتاب والسنة وبأحكام المسلمين وهو قول أحمد وإسحاق ‏.‏ وقال بعضهم لا يقام عليهم الحد في الزنا ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     That the Prophet (ﷺ) stoned a Jew and a Jewess.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1466",
      "hadith_no": "1466",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا شريك، عن الحجاج، عن القاسم بن أبي بزة، عن سليمان اليشكري، عن جابر بن عبد الله، قال نهينا عن صيد، كلب المجوس ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ والعمل على هذا عند أكثر أهل العلم لا يرخصون في صيد كلب المجوس ‏.‏ والقاسم بن أبي بزة هو القاسم بن نافع المكي ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"We have been forbidden from the game caught by a Zoroastrian's dog.\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20032",
        "20587",
        "20381",
        "11261",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1495",
      "hadith_no": "1495",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن عبيد المحاربي الكوفي، حدثنا شريك، عن أبي الحسناء، عن الحكم، عن حنش، عن علي، أنه كان يضحي بكبشين أحدهما عن النبي صلى الله عليه وسلم والآخر عن نفسه، فقيل له فقال أمرني به يعني النبي صلى الله عليه وسلم - فلا أدعه أبدا ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث شريك ‏.‏ وقد رخص بعض أهل العلم أن يضحى عن الميت ولم ير بعضهم أن يضحى عنه ‏.‏ وقال عبد الله بن المبارك أحب إلى أن يتصدق عنه ولا يضحى عنه وإن ضحى فلا يأكل منها شيئا ويتصدق بها كلها ‏.‏ قال محمد قال علي بن المديني وقد رواه غير شريك ‏.‏ قلت له أبو الحسناء ما اسمه فلم يعرفه ‏.‏ قال مسلم اسمه الحسن ‏.‏",
      "text_en": " Narrated Hanash:                     That 'Ali used to slaughter two male sheep, one for the Prophet (ﷺ) and the other for himself. When this was mentioned to him, he said: \"He ordered me to\" - meaning the Prophet (ﷺ) - \"So I will never leave it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20587",
        "11069",
        "15113",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1498",
      "hadith_no": "1498",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا يزيد بن هارون، أخبرنا شريك بن عبد الله، عن أبي إسحاق، عن شريح بن النعمان الصائدي، وهو الهمداني عن علي بن أبي طالب، قال أمرنا رسول الله صلى الله عليه وسلم أن نستشرف العين والأذن وأن لا نضحي بمقابلة ولا مدابرة ولا شرقاء ولا خرقاء ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib:                     \"The Messenger of Allah (ﷺ) ordered that we check the eyes and ears, and not to slaughter the Muqabalah, nor the Mudabarah, nor the Sharqa', nor the Kharqa'\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20472",
        "20587",
        "11049",
        "19869",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1503",
      "hadith_no": "1503",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن سلمة بن كهيل، عن حجية بن عدي، عن علي، قال البقرة عن سبعة، ‏.‏ قلت فإن ولدت قال اذبح ولدها معها ‏.‏ قلت فالعرجاء قال إذا بلغت المنسك ‏.‏ قلت فمكسورة القرن قال لا بأس أمرنا أو أمرنا رسول الله صلى الله عليه وسلم أن نستشرف العينين والأذنين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال أبو عيسى وقد رواه سفيان الثوري عن سلمة بن كهيل ‏.‏",
      "text_en": " Narrated Hujayyah bin 'Adi:                     \"Ali said: 'A cow is for seven.' I said: \"And if it gives birth?' He said: 'Then slaughter its offspring with it.' I said: 'What if it is lame?' He said: 'When it has reached the place of ritual.' I said: 'What if it has a broken horn?' He said: 'There is no harm, we were ordered' - or - 'The Messenger of Allah (ﷺ) ordered us, to check the two eyes and the two ears.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11350",
        "18167",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1830",
      "hadith_no": "1830",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا شريك، عن علي بن الأقمر، عن أبي جحيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنا فلا آكل متكئا ‏\"‏ ‏.‏ قال وفي الباب عن علي وعبد الله بن عمرو وعبد الله بن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث علي بن الأقمر ‏.‏ وروى زكريا بن أبي زائدة وسفيان الثوري وغير واحد عن علي بن الأقمر هذا الحديث وروى شعبة عن سفيان الثوري هذا الحديث عن علي بن الأقمر ‏.‏",
      "text_en": " Narrated Abu Juhaidah:                     That the Messenger of Allah (ﷺ) said: \"As for me, I do not eat while reclining.\"He said: There are narrations on this topic from 'Ali, 'Abdullah bin 'Amr, and 'Abdullah bin Al-'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of 'Ali bin Al-Aqmar. Zakariyya bin Abi Za'idah,  Sufyan bin Sa'eed, and other reported this Hadith from 'Ali bin Al-Aqmar. And Shu'bah reported this Hadith from Sufyan Ath-Thawri from 'Ali bin Al-Aqmar.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20587",
        "11375",
        "4047"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2046",
      "hadith_no": "2046",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا يزيد بن هارون، عن شريك، عن ليث، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من لم يرحم صغيرنا ويوقر كبيرنا ويأمر بالمعروف وينه عن المنكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وحديث محمد بن إسحاق عن عمرو بن شعيب حديث حسن صحيح وقد روي عن عبد الله بن عمرو من غير هذا الوجه أيضا ‏.‏ - قال بعض أهل العلم معنى قول النبي صلى الله عليه وسلم ‏\"‏ ليس منا ‏\"‏ ‏.‏ يقول ليس من سنتنا يقول ليس من أدبنا ‏.‏ وقال علي بن المديني قال يحيى بن سعيد كان سفيان الثوري ينكر هذا التفسير ليس منا يقول ليس مثلنا ‏.‏",
      "text_en": " Ibn Abbas narrated that the Messenger of Allah said:                     \" He is not one of us who does not have mercy upon our young, respect our elders, and command good and forbid evil.\"",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20472",
        "20587",
        "20023",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2123",
      "hadith_no": "2123",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، عن شريك، عن عاصم الأحول، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قال له ‏\"‏ يا ذا الأذنين ‏\"‏ ‏.‏ قال محمود قال أبو أسامة يعني مازحه ‏.‏ وهذا الحديث حديث صحيح غريب ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah said:                     \"O possessor of two ears!\" Mahmud said: \"Abu Usamah said: 'He only meant it as a joke.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20318",
        "20587",
        "11080",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2220-2",
      "hadith_no": "2220",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر، حدثنا الفضل بن موسى، عن شريك بن عبد الله، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏ قال أبو عيسى يقال الكذاب المختار بن أبي عبيد والمبير الحجاج بن يوسف ‏.‏ حدثنا أبو داود سليمان بن سلم البلخي أخبرنا النضر بن شميل عن هشام بن حسان قال أحصوا ما قتل الحجاج صبرا فبلغ مائة ألف وعشرين ألف قتيل ‏.‏\t قال أبو عيسى وفي الباب عن أسماء بنت أبي بكر ‏.‏ حدثنا عبد الرحمن بن واقد، حدثنا شريك، نحوه بهذا الإسناد ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏ وشريك يقول عبد الله بن عصم وإسرائيل يقول عبد الله بن عصمة ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah(s.a.w) said:                     \"In Thaqif there will be a great liar and destroyer.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20452",
        "20587",
        "15290",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2671",
      "hadith_no": "2671",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن أبي إسحاق، عن حارثة بن مضرب، قال أتينا خبابا نعوده وقد اكتوى سبع كيات فقال لقد تطاول مرضي ولولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تمنوا الموت ‏\"‏ ‏.‏ لتمنيت وقال ‏\"‏ يؤجر الرجل في نفقته كلها إلا التراب أو قال في البناء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Harithah bin Mudarrib said:                     \"We went to visit Khabbab who had himself cauterised in seven places on his body. He said: 'I have been ill for so long, and if it was not that I heard the Messenger of Allah (s.a.w) saying: \"None of you should wish for death\" then I would have wished for it, and he said: \"A man is rewarded for [all of] his spending except for the dust\" - or he said - \"in the dust.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "19801"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2721",
      "hadith_no": "2721",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عباس العنبري، حدثنا يزيد بن هارون، أخبرنا شريك، عن محمد بن جحادة، عن عطاء، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في الجنة مائة درجة ما بين كل درجتين مائة عام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"In Paradise, there are a hundred levels, between every two levels is  (the distance of) a hundred years.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20472",
        "20587",
        "18897",
        "11029",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2794",
      "hadith_no": "2794",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عباس بن محمد الدوري البغدادي، حدثنا يحيى بن أبي بكير، حدثنا شريك، عن عاصم، هو ابن بهدلة عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أوقد على النار ألف سنة حتى احمرت ثم أوقد عليها ألف سنة حتى ابيضت ثم أوقد عليها ألف سنة حتى اسودت فهي سوداء مظلمة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"The Fire was kindled for one thousand years until it reddened, then it was kindled for one thousand years until it whitened, then it was kindled for one thousand years until it became blackened, so it is dark black.\"",
      "usc_msa_ref": "",
      "chain": [
        "20365",
        "20587",
        "11358",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2795",
      "hadith_no": "2795",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن شريك، عن عاصم، عن أبي صالح، أو رجل آخر عن أبي هريرة، نحوه ولم يرفعه ‏.‏ قال أبو عيسى حديث أبي هريرة في هذا موقوف أصح ولا أعلم أحدا رفعه غير يحيى بن أبي بكير عن شريك ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20587",
        "11080",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2660-2",
      "hadith_no": "2660",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري ابن بنت السدي، حدثنا شريك بن عبد الله، عن منصور بن المعتمر، عن ربعي بن حراش، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكذبوا على فإنه من كذب على يلج في النار ‏\"‏ ‏.‏ وفي الباب عن أبي بكر وعمر وعثمان والزبير وسعيد بن زيد وعبد الله بن عمرو وأنس وجابر وابن عباس وأبي سعيد وعمرو بن عبسة وعقبة بن عامر ومعاوية وبريدة وأبي موسى الغافقي وأبي أمامة وعبد الله بن عمر والمنقع وأوس الثقفي ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ قال عبد الرحمن بن مهدي منصور بن المعتمر أثبت أهل الكوفة ‏.‏ وقال وكيع لم يكذب ربعي بن حراش في الإسلام كذبة",
      "text_en": " Narrated 'Ali bin Abi Talib:                     that the Messenger of Allah (ﷺ) said: \"Do not lie upon me, for indeed whoever lies upon me, he will be admitted into the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2725-2",
      "hadith_no": "2725",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن سماك بن حرب، عن جابر بن سمرة، قال كنا إذا أتينا النبي صلى الله عليه وسلم جلس أحدنا حيث ينتهي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقد رواه زهير بن معاوية عن سماك أيضا ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"When we went to the Prophet (ﷺ), each of us would sit wherever he wound up at.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2972",
      "hadith_no": "2972",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن أبي اليقظان، عن عدي بن ثابت، عن أبيه، عن جده، رفعه قال ‏\"‏ العطاس والنعاس والتثاؤب في الصلاة والحيض والقىء والرعاف من الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث شريك عن أبي اليقظان ‏.‏ قال وسألت محمد بن إسماعيل عن عدي بن ثابت عن أبيه عن جده قلت له ما اسم جد عدي قال لا أدري ‏.‏ وذكر عن يحيى بن معين قال اسمه دينار ‏.‏",
      "text_en": " Narrated Abu Yaqzan:                     from 'Adi - and he is Ibn Thabit - from his father, from his grandfather - [from the Prophet (ﷺ)]: \"Sneezing, dozing and yawning during Salat, and menstruation, regurgitation and nosebleeds are from Ash-Shaitan.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11372"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3004",
      "hadith_no": "3004",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن أبي ربيعة، عن ابن بريدة، عن أبيه، رفعه قال ‏\"‏ يا علي لا تتبع النظرة النظرة فإن لك الأولى وليست لك الآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏",
      "text_en": " Narrated Ibn Buraidah:                     from his father (from the Prophet (ﷺ)) who said: \"O 'Ali! Do not follow a look with a look, the first is for you, but the next is not for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11432"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3066",
      "hadith_no": "3066",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن سعد بن إبراهيم بن سعد بن إبراهيم بن عبد الرحمن بن عوف، حدثني عمي، يعقوب بن إبراهيم بن سعد حدثنا شريك، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم أمر بتسمية المولود يوم سابعه ووضع الأذى عنه والعق ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3085",
      "hadith_no": "3085",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن المقدام بن شريح، عن أبيه، عن عائشة، قال قيل لها هل كان النبي صلى الله عليه وسلم يتمثل بشيء من الشعر قالت كان يتمثل بشعر ابن رواحة ويتمثل ويقول ‏\"‏ ويأتيك بالأخبار من لم تزود ‏\"‏ ‏.‏ وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Miqdam bin Shuraih:                     from his father, that 'Aishah was asked: \"Did the Prophet (ﷺ) used to say any poetry?\" She said: \"He would say parables with the poetry of Ibn Rawahah, saying: 'News shall come to you from where you did not expect it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3086",
      "hadith_no": "3086",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أشعر كلمة تكلمت بها العرب كلمة لبيد ألا كل شيء ما خلا الله باطل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه الثوري وغيره عن عبد الملك بن عمير ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3087",
      "hadith_no": "3087",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن سماك، عن جابر بن سمرة، قال جالست النبي صلى الله عليه وسلم أكثر من مائة مرة فكان أصحابه يتناشدون الشعر ويتذاكرون أشياء من أمر الجاهلية وهو ساكت فربما تبسم معهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه زهير عن سماك أيضا ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3322",
      "hadith_no": "3322",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يزيد بن هارون، أخبرنا شريك، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما وقعت بنو إسرائيل في المعاصي نهتهم علماؤهم فلم ينتهوا فجالسوهم في مجالسهم وواكلوهم وشاربوهم فضرب الله قلوب بعضهم ببعض ولعنهم على لسان داود وعيسى ابن مريم ذلك بما عصوا وكانوا يعتدون ‏\"‏ ‏.‏ قال فجلس رسول الله صلى الله عليه وسلم وكان متكئا فقال ‏\"‏ لا والذي نفسي بيده حتى تأطروهم على الحق أطرا ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن قال يزيد وكان سفيان الثوري لا يقول فيه عن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن غريب وقد روي هذا الحديث عن محمد بن مسلم بن أبي الوضاح عن علي بن بذيمة عن أبي عبيدة عن عبد الله عن النبي صلى الله عليه وسلم نحوه وبعضهم يقول عن أبي عبيدة عن النبي صلى الله عليه وسلم مرسل ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     \"The Messenger of Allah (ﷺ) said: 'When the Children of Isra'il fell into disobedience, their scholars forbade them from it. But they did not stop, so they sat with them in their gatherings, and participated in eating and drinking with them. So Allah pitted their hearts against each other, and cursed them upon the tongue of Dawud and 'Eisa bin Mariam. That was because they disobeyed and were ever transgressing.'\" He said: \"The Messenger of Allah (ﷺ) sat up after he had been reclining, and he said: 'No, by the One in Whose Hand is my soul! Not until you incline them to the truth.'\" 'Abdullah bin 'Abdur-Rahman said: \"Yazid said: 'Sufyan Ath-Thawri would not say in it: \"From 'Abdullah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20472",
        "20587",
        "19929",
        "10",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3988",
      "hadith_no": "3988",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن سعيد، حدثنا شريك، عن سماك، عن أبي ظبيان، عن ابن عباس، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال بم أعرف أنك نبي قال ‏\"‏ إن دعوت هذا العذق من هذه النخلة أتشهد أني رسول الله ‏\"‏ ‏.‏ فدعاه رسول الله صلى الله عليه وسلم فجعل ينزل من النخلة حتى سقط إلى النبي صلى الله عليه وسلم ثم قال ‏\"‏ ارجع ‏\"‏ ‏.‏ فعاد فأسلم الأعرابي ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"A Bedouin came to the Messenger of Allah (ﷺ) and said: 'How shall I know that you are a Prophet?' He said: 'If I were to call this date cluster from this palm tree, would you bear witness that I am the Messenger of Allah?' So the Messenger of Allah (ﷺ) called it and they started to fall from the tree, until they fell towards the Prophet (ﷺ), then he said: 'Go back,' and it went back. So the Bedouin accepted Islam.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20587",
        "10770",
        "19301",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4084",
      "hadith_no": "4084",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري ابن بنت السدي، حدثنا شريك، عن أبي ربيعة، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أمرني بحب أربعة وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قيل يا رسول الله سمهم لنا ‏.‏ قال ‏\"‏ علي منهم يقول ذلك ثلاثا وأبو ذر والمقداد وسلمان أمرني بحبهم وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏",
      "text_en": " Narrated Buraidah:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah has ordered me to love four, and He informed me that He loves them.\" It was said: \"O Messenger of Allah! Name them for us.\" He said: \"'Ali is among them,\" saying that three times, \"And Abu Dharr, Al-Miqdad, and Salman. And He ordered me to love them, and He informed me that He loves them.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4085",
      "hadith_no": "4085",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن أبي إسحاق، عن حبشي بن جنادة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ علي مني وأنا من علي ولا يؤدي عني إلا أنا أو علي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Hubshi bin Junadah:                     that the Messenger of Allah (ﷺ) said: \"'Ali is from me and I am from 'Ali. And none should represent me except myself or 'Ali.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11049",
        "4112"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4089",
      "hadith_no": "4089",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا محمد بن عمر بن الرومي، حدثنا شريك، عن سلمة بن كهيل، عن سويد بن غفلة، عن الصنابحي، عن علي، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا دار الحكمة وعلي بابها ‏\"‏ ‏.‏ قال هذا حديث غريب منكر ‏.‏ وروى بعضهم هذا الحديث عن شريك ولم يذكروا فيه عن الصنابحي ولا نعرف هذا الحديث عن واحد من الثقات عن شريك ‏.‏ وفي الباب عن ابن عباس ‏.‏",
      "text_en": " Narrated 'Ali:                     that the Messenger of Allah (ﷺ) said: \"I am the house of wisdom, and 'Ali is its door.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11350",
        "11174",
        "5144",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4095",
      "hadith_no": "4095",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا شريك، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم قال لعلي ‏\"‏ أنت مني بمنزلة هارون من موسى إلا أنه لا نبي بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وفي الباب عن سعد وزيد بن أرقم وأبي هريرة وأم سلمة ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Prophet (ﷺ) said to 'Ali: \"You are to me in the position that Harun was to Musa, except that there is no Prophet after me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20587",
        "12246",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4182",
      "hadith_no": "4182",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا إسحاق بن عيسى، عن شريك، عن أبي اليقظان، عن زاذان، عن حذيفة، قال قالوا يا رسول الله لو استخلفت ‏.‏ قال ‏\"‏ إن استخلفت عليكم فعصيتموه عذبتم ولكن ما حدثكم حذيفة فصدقوه وما أقرأكم عبد الله فاقرءوه ‏\"‏ ‏.‏ قال عبد الله فقلت لإسحاق بن عيسى يقولون هذا عن أبي وائل ‏.‏ قال لا عن زاذان إن شاء الله ‏.‏ قال هذا حديث حسن وهو حديث شريك ‏.‏",
      "text_en": " Narrated Hudhaifah:                     that they said: \"O Messenger of Allah, if you were to appoint someone as a successor.\" He said: \"If I were to appoint a successor over you, and you were to disobey him, you would be punished. But whatever Hudhaifah narrates to you, then believe him, and whatever 'Abdullah teaches you to recite, then recite it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20587",
        "10911",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4199",
      "hadith_no": "4199",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، عن شريك، عن عاصم الأحول، عن أنس، قال ربما قال لي النبي صلى الله عليه وسلم ‏\"‏ يا ذا الأذنين ‏\"‏ ‏.‏ قال أبو أسامة يعني يمازحه ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Prophet (ﷺ) said to him: \"O possessor of two ears!\" (One of the narrators) Abu Usamah said: 'He only meant it as a joke.'",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20318",
        "20587",
        "11080",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4324",
      "hadith_no": "4324",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الفضل بن موسى، عن شريك، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"In Thaqif there is a liar and a destroyer.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20452",
        "20587",
        "15290",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4325",
      "hadith_no": "4325",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الرحمن بن واقد أبو مسلم، حدثنا شريك، بهذا الإسناد نحوه ‏.‏ وعبد الله بن عصم يكنى أبا علوان وهو كوفي ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏ وشريك يقول عبد الله بن عصم وإسرائيل يروي عن هذا الشيخ ويقول عبد الله بن عصمة ‏.‏ وفي الباب عن أسماء بنت أبي بكر ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20587"
      ]
    },
    {
      "id": "sunan-an-nasai-29",
      "hadith_no": "29",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن المقدام بن شريح، عن أبيه، عن عائشة، قالت من حدثكم أن رسول الله صلى الله عليه وسلم بال قائما فلا تصدقوه ما كان يبول إلا جالسا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Whoever tells you that the Messenger of Allah (ﷺ) urinated standing up, do not believe him, for he would not urinate except while squatting.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-50",
      "hadith_no": "50",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن أبي زرعة، عن أبي هريرة، أن النبي صلى الله عليه وسلم توضأ فلما استنجى دلك يده بالأرض ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) performed Wudu', and when he had performed Istinja' he rubbed his hand on the ground.",
      "usc_msa_ref": "",
      "chain": [
        "30271",
        "20032",
        "20587",
        "18002",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-664",
      "hadith_no": "664",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن سلمة بن كهيل، عن سعيد بن جبير، عن ابن عمر، قال كنا معه بجمع فأذن ثم أقام فصلى بنا المغرب ثم قال الصلاة ‏.‏ فصلى بنا العشاء ركعتين فقلت ما هذه الصلاة قال هكذا صليت مع رسول الله صلى الله عليه وسلم في هذا المكان ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jubair said concerning Ibn 'Umar:                      \"We were with him (Ibn 'Umar) in Jam' (Muzdalifah), and he called the Adhan, then the Iqamah, then he led us in praying Maghrib. Then he said: 'The prayer,' and he led us in praying 'Isha', two Rak'ahs. I said: 'What is this prayer?' He said: 'This is how I prayed with the Messenger of Allah (ﷺ) in this place.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11350",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-916",
      "hadith_no": "916",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، في قوله عز وجل ‏{‏ سبعا من المثاني ‏}‏ قال السبع الطول ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     Concerning the words of Allah, the Mighty and Sublime: \"Seven of Al-Mathani (seven repeatedly-recited): \"The seven long ones.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "11050"
      ]
    },
    {
      "id": "sunan-an-nasai-1089",
      "hadith_no": "1089",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا الحسين بن عيسى القومسي البسطامي، قال حدثنا يزيد، - وهو ابن هارون - قال أنبأنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم إذا سجد وضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I saw the Messenger of Allah (ﷺ) when he prostrated, he lowered his knees before his hands, and when he came up he raised his hands before his knees.\"",
      "usc_msa_ref": "",
      "chain": [
        "20472",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "id": "sunan-an-nasai-1104",
      "hadith_no": "1104",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا علي بن حجر المروزي، قال أنبأنا شريك، عن أبي إسحاق، قال وصف لنا البراء السجود فوضع يديه بالأرض ورفع عجيزته وقال هكذا رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " It was narrated that Abu Ishaq said:                     \"Al-Bara' described the prostration to us. He places his hands on the ground and raised his posterior and said: 'This is what I saw the Messenger of Allah (ﷺ) doing.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049"
      ]
    },
    {
      "id": "sunan-an-nasai-1154",
      "hadith_no": "1154",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا يزيد بن هارون، قال أنبأنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم إذا سجد وضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ قال أبو عبد الرحمن لم يقل هذا عن شريك غير يزيد بن هارون والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     'I saw the Messenger of Allah (ﷺ) when he prostrated, place his knees on the ground before his hands, and when he got up, he lifted his hands before his knees.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20472",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "id": "sunan-an-nasai-1291",
      "hadith_no": "1291",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا شريك، عن عثمان بن موهب، عن موسى بن طلحة، عن أبيه، أن رجلا، أتى نبي الله صلى الله عليه وسلم فقال كيف نصلي عليك يا نبي الله قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Musa bin Talha, from his father, that:                     A man came to the Prophet of Allah (ﷺ) and said: \"How should we send blessings upon you, O Prophet of Allah?' He said: 'Say: Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "18716",
        "579",
        "6"
      ]
    },
    {
      "id": "sunan-an-nasai-1306",
      "hadith_no": "1306",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا شريك، عن أبي هاشم الواسطي، عن أبي مجلز، عن قيس بن عباد، قال صلى عمار بن ياسر بالقوم صلاة أخفها فكأنهم أنكروها فقال ألم أتم الركوع والسجود قالوا بلى ‏.‏ قال أما إني دعوت فيها بدعاء كان النبي صلى الله عليه وسلم يدعو به ‏\"‏ اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي وأسألك خشيتك في الغيب والشهادة وكلمة الإخلاص في الرضا والغضب وأسألك نعيما لا ينفد وقرة عين لا تنقطع وأسألك الرضاء بالقضاء وبرد العيش بعد الموت ولذة النظر إلى وجهك والشوق إلى لقائك وأعوذ بك من ضراء مضرة وفتنة مضلة اللهم زينا بزينة الإيمان واجعلنا هداة مهتدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin 'Ubad said:                     \"Ammar bin Yasir led the people in prayer and he made the prayer short. It was as if they disliked that, so he said: 'Did I not do bowing and prostration properly?' They said: 'Yes.' He said: 'And I said a supplication that the Prophet (ﷺ) used to say:Allahumma bi 'ilmikal-ghaiba wa qudratika 'alal-khalqi ahini ma 'alimtal-hayata khairan li, wa tawaffani idha 'alimtal-wafata khairan li. Allahumma as'aluka khashyataka fil-ghaibi wash-shahadati wa as'aluka kalimatul-aqua fir-rida'i wal ghadab, wa as'alukal-qasda fil faqr wal-ghina, wa as'aluka na'iman la yanfadu wa as'aluka qurrata ainan la tanqati'u wa as'alukar-rida'i ba'dal-qada'i wa as'aluka bardal 'aishi ba'dal-mawti, wa as'aluka ladhatan-nazari ila wajhika wash-shawqa ila liqa'ika fi fitnatin mudillatin, Allahumma zayyina dizinatil-imani waj'alna hudatan muhtadin (O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know that living is good for me and cause me to die when You know that death is better for me. O Allah, cause me to fear You in secret and in public. I ask You to make me true in speech in times of pleasure and of anger. I ask You to make me moderate in times of wealth and poverty. And I ask You for everlasting delight and joy that will never cease. I ask You to make me pleased with that which You have decreed and for an easy life after death. I ask You for the sweetness of looking upon Your face and a longing to meet You in a manner that does not entail a calamity that will bring about harm or a trial that will cause deviation. O Allah, beautify us with the adornment of faith and make us among those who guide and are rightly guided.\"",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11313",
        "11609"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-51",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن سماك، عن جابر بن سمرة، قال جالست النبي صلى الله عليه وسلم فما رأيته يخطب إلا قائما ويجلس ثم يقوم فيخطب الخطبة الآخرة ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I sat with the Prophet (ﷺ) and I did not see him deliver the khutbah except standing, and he sat, then he stood up and delivered the second khutbah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-56",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن زبيد، عن عبد الرحمن بن أبي ليلى، قال قال عمر صلاة الجمعة ركعتان وصلاة الفطر ركعتان وصلاة الأضحى ركعتان وصلاة السفر ركعتان تمام غير قصر على لسان محمد صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن عبد الرحمن بن أبي ليلى لم يسمع من عمر ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Laila that 'Umar said:                     \"Jumu'ah prayer is two rak'ahs, the prayer of Al-Fitr is two rak'ahs, the prayer of Al-Adha is two rak'ahs, the prayer when traveling is two rak'ahs, complete and not shortened, on the tongue of Muhammad (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11335",
        "11196"
      ]
    },
    {
      "id": "sunan-an-nasai-1518",
      "hadith_no": "1518",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل بن جعفر، قال حدثنا شريك بن عبد الله، عن أنس بن مالك، أن رجلا، دخل المسجد ورسول الله صلى الله عليه وسلم قائم يخطب فاستقبل رسول الله صلى الله عليه وسلم قائما وقال يا رسول الله هلكت الأموال وانقطعت السبل فادع الله أن يغيثنا ‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم أغثنا اللهم أغثنا ‏\"‏ ‏.‏ قال أنس ولا والله ما نرى في السماء من سحابة ولا قزعة وما بيننا وبين سلع من بيت ولا دار فطلعت سحابة مثل الترس فلما توسطت السماء انتشرت وأمطرت ‏.‏ قال أنس ولا والله ما رأينا الشمس سبتا ‏.‏ قال ثم دخل رجل من ذلك الباب في الجمعة المقبلة ورسول الله صلى الله عليه وسلم قائم يخطب فاستقبله قائما فقال يا رسول الله صلى الله وسلم عليك هلكت الأموال وانقطعت السبل فادع الله أن يمسكها عنا ‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه فقال ‏\"‏ اللهم حوالينا ولا علينا اللهم على الآكام والظراب وبطون الأودية ومنابت الشجر ‏\"‏ ‏.‏ قال فأقلعت وخرجنا نمشي في الشمس ‏.‏ قال شريك سألت أنسا أهو الرجل الأول قال لا ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     A man entered the masjid when the Messenger of Allah (ﷺ) was standing and delivering the Khutbah. He turned to face the Messenger of Allah (ﷺ) standing and said: 'O Messenger of Allah, our wealth has been destroyed and the routes have been cut off. Pray to Allah (SWT) to send us rain.' The Messenger of Allah (ﷺ) raised his hands then said: \"O Allah, send us rain.\" Anas said: \"By Allah, we had not seen even a wisp of a cloud in the sky and there were no houses or buildings between us and (the mountain of ) Sal'. Then a cloud like a shield appeared, and when it reached the middle of the sky it spread and it began to rain.\" Anas said: \"By Allah, we did not see the sun for a week. Then a man entered through that door on the following Friday, when the Messenger of Allah (ﷺ) was standing and delivering the Khutbah. He turned to face him standing and said: 'O Messenger of Allah (ﷺ), may Allah (SWT) send blessings upon you. Our wealth has been destroyed and the routes have been cut off. Pray to Allah (SWT) to withold (the rain) from us.' The Messenger of Allah (ﷺ) raised his hands and said: 'O Allah, around us and not on us.; O Allah, on the hills and mountains, the bottoms of the valleys and where the trees grow.' Then it stopped raining and we went out walking in the sun.\" Sharik said: 'I asked Anas: 'Was he the same man?' He said: 'No.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "20587",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-2323",
      "hadith_no": "2323",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يزيد، أنبأنا شريك، عن طلحة بن يحيى بن طلحة، عن مجاهد، عن عائشة، قالت دار على رسول الله صلى الله عليه وسلم دورة قال ‏\"‏ أعندك شىء ‏\"‏ ‏.‏ قالت ليس عندي شىء ‏.‏ قال ‏\"‏ فأنا صائم ‏\"‏ ‏.‏ قالت ثم دار على الثانية وقد أهدي لنا حيس فجئت به فأكل فعجبت منه فقلت يا رسول الله دخلت على وأنت صائم ثم أكلت حيسا ‏.‏ قال ‏\"‏ نعم يا عائشة إنما منزلة من صام في غير رمضان - أو غير قضاء رمضان أو في التطوع - بمنزلة رجل أخرج صدقة ماله فجاد منها بما شاء فأمضاه وبخل منها بما بقي فأمسكه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah passed by my door. He said: 'Do you have anything (to eat)?' I said 'I do not have anything.' He said 'Then he passed by my door a second time and we had been given some Hais. I brought it to him and he ate, and I was surprised. I said: 'O Messenger of Allah, you were fasting, then you ate Hais.' He said: 'Yes, O 'Aishah. The one who observes a fast other than in Ramadan, or making up a missed Ramadan, fast, is like a man who allocated some of is wealth to give in charity; if he wishes he may go ahead and give it, and if he wishes he may keep it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20472",
        "20587",
        "11863",
        "11028",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2413",
      "hadith_no": "2413",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج، عن شريك، عن الحر بن صياح، قال سمعت ابن عمر، يقول كان النبي صلى الله عليه وسلم يصوم ثلاثة أيام من كل شهر ‏.‏",
      "text_en": " It was narrated that Al-Hurr bin Sayyah said:                     \"I heard Ibn 'Umar say\" \"The Prophet used to fast three days of each month.",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "20587",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2414",
      "hadith_no": "2414",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الحسن بن محمد الزعفراني، قال حدثنا سعيد بن سليمان، عن شريك، عن الحر بن صياح، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يصوم ثلاثة أيام من كل شهر يوم الاثنين من أول الشهر والخميس الذي يليه ثم الخميس الذي يليه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah used to fast three days of each month: Monday at the beginning of the month, the following Thursday, then the Thursday after that.",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "30252",
        "20587",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2571",
      "hadith_no": "2571",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، قال حدثنا شريك، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس المسكين الذي ترده التمرة والتمرتان واللقمة واللقمتان إن المسكين المتعفف اقرءوا إن شئتم ‏{‏ لا يسألون الناس إلحافا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the messenger of Allah said:                     \"The poor man (Miskin) is not the one who leaves if you give him a date or two, or a morsel or two. Rather the poor man is the one who refrains from asking. Recite if you wish: \"They do not beg of people at all.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "20587",
        "11020",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2703",
      "hadith_no": "2703",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن أبي إسحاق، عن الأسود، عن عائشة، قالت كنت أرى وبيص الطيب في مفرق رسول الله صلى الله عليه وسلم بعد ثلاث ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     'I used to see the glistening of the perfume in the parting of the Messenger of Allah after three (days)",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2866",
      "hadith_no": "2866",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا يحيى بن آدم، قال حدثنا شريك، عن عمار الدهني، عن أبي الزبير، عن جابر، رضى الله عنه أن النبي صلى الله عليه وسلم دخل مكة ولواؤه أبيض ‏.‏",
      "text_en": " It was narrated from Jabir that:                     the Prophet enter Makkah and his standard was white.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20364",
        "20587",
        "10802",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3383",
      "hadith_no": "3383",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن أبي إسحاق، عن عامر بن سعد، قال دخلت على قرظة بن كعب وأبي مسعود الأنصاري في عرس وإذا جوار يغنين فقلت أنتما صاحبا رسول الله صلى الله عليه وسلم ومن أهل بدر يفعل هذا عندكم ‏.‏ فقالا اجلس إن شئت فاسمع معنا وإن شئت اذهب قد رخص لنا في اللهو عند العرس ‏.‏",
      "text_en": " It was narrated that 'Amir bin Sa'd said:                      \"I entered upon Qurazah bin Ka'b and Abu Mas'ud Al-Ansari during a wedding and there were some young girls singing. I said: 'You are two of the Companions of the Messenger of Allah who were present at Badr, and this is being done in your presence!' They said: 'Sit down if you want and listen with us, or if you want you can go away. We were granted a concession allowing entertainment at weddings.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "10554"
      ]
    },
    {
      "id": "sunan-an-nasai-3932",
      "hadith_no": "3932",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن أبي إسحاق، عن عبد الرحمن بن الأسود، قال كان عماى يزرعان بالثلث والربع وأبي شريكهما وعلقمة والأسود يعلمان فلا يغيران‏.‏‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Al-Aswad said:                      \"Two of my paternal uncles used to cultivate (land) in return for one-third or one-quarter of the crop, and my father was their partner. 'Alqamah and Al-Aswad knew about that and did not change anything.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "11056"
      ]
    },
    {
      "id": "sunan-an-nasai-3936",
      "hadith_no": "3936",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن طارق، عن سعيد بن المسيب، قال لا بأس بإجارة الأرض البيضاء بالذهب والفضة‏.‏‏ وقال إذا دفع رجل إلى رجل مالا قراضا فأراد أن يكتب عليه بذلك كتابا كتب هذا كتاب كتبه فلان بن فلان طوعا منه في صحة منه وجواز أمره لفلان بن فلان أنك دفعت إلى مستهل شهر كذا من سنة كذا عشرة آلاف درهم وضحا جيادا وزن سبعة قراضا على تقوى الله في السر والعلانية وأداء الأمانة على أن أشتري بها ما شئت منها كل ما أرى أن أشتريه وأن أصرفها وما شئت منها فيما أرى أن أصرفها فيه من صنوف التجارات وأخرج بما شئت منها حيث شئت وأبيع ما أرى أن أبيعه مما أشتريه بنقد رأيت أم بنسيئة وبعين رأيت أم بعرض على أن أعمل في جميع ذلك كله برأيي وأوكل في ذلك من رأيت وكل ما رزق الله في ذلك من فضل وربح بعد رأس المال الذي دفعته المذكور إلى المسمى مبلغه في هذا الكتاب فهو بيني وبينك نصفين لك منه النصف بحظ رأس مالك ولي فيه النصف تاما بعملي فيه وما كان فيه من وضيعة فعلى رأس المال فقبضت منك هذه العشرة آلاف درهم الوضح الجياد مستهل شهر كذا في سنة كذا وصارت لك في يدي قراضا على الشروط المشترطة في هذا الكتاب أقر فلان وفلان وإذا أراد أن يطلق له أن يشتري ويبيع بالنسيئة كتب وقد نهيتني أن أشتري وأبيع بالنسيئة‏.‏‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                      \"There is nothing wrong with renting uncultivated land for gold and silver.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11355",
        "11002"
      ]
    },
    {
      "id": "sunan-an-nasai-3965",
      "hadith_no": "3965",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن عاصم، عن عبد الله بن عامر بن ربيعة، عن عائشة، قالت فقدته من الليل وساق الحديث ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I noticed that he was not there one night\" and he quoted the rest of the Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11080",
        "709",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3991",
      "hadith_no": "3991",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا سريع بن عبد الله الواسطي الخصي، قال حدثنا إسحاق بن يوسف الأزرق، عن شريك، عن عاصم، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أول ما يحاسب به العبد الصلاة وأول ما يقضى بين الناس في الدماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] said: 'The first thing concerning which a person will be brought to account will be the Salah, and the first thing concerning which scores will be settled among the people, will be bloodshed.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11080",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-4056",
      "hadith_no": "4056",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن أبي إسحاق، عن عامر، عن جرير، قال أيما عبد أبق من مواليه ولحق بالعدو فقد أحل بنفسه ‏.‏",
      "text_en": " It was narrated that Jarir said:                     \"Any slave who runs away from his masters and joins the enemy, he has made it permissible to shed his blood.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "11052",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-4126",
      "hadith_no": "4126",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا أبو أحمد الزبيري، قال حدثنا شريك، عن الأعمش، عن أبي الضحى، عن مسروق، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض لا يؤخذ الرجل بجناية أبيه ولا جناية أخيه ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب مرسل ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another). No man is to be punished for the sins of his father, or for the sins of his brother.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20355",
        "20587",
        "11060",
        "11392",
        "11018",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4244",
      "hadith_no": "4244",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر النيسابوري، قال حدثنا الحسين بن محمد، قال حدثنا شريك، عن الأعمش، عن عمارة بن عمير، عن الأسود، عن عائشة، قالت سئل النبي صلى الله عليه وسلم عن جلود الميتة فقال ‏\"‏ دباغها طهورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Prophet was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"",
      "usc_msa_ref": "",
      "chain": [
        "38181",
        "20587",
        "11060",
        "11378",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4245",
      "hadith_no": "4245",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا شريك، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت سئل رسول الله صلى الله عليه وسلم عن جلود الميتة فقال ‏\"‏ دباغها ذكاتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4246",
      "hadith_no": "4246",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا أيوب بن محمد الوزان، قال حدثنا حجاج بن محمد، قال حدثنا شريك، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ذكاة الميتة دباغها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                     \"The dead animal is purified by tanning it.\"",
      "usc_msa_ref": "",
      "chain": [
        "38120",
        "20381",
        "20587",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4251",
      "hadith_no": "4251",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن هلال الوزان، عن عبد الله بن عكيم، قال كتب رسول الله صلى الله عليه وسلم إلى جهينة ‏\"‏ أن لا تنتفعوا من الميتة بإهاب ولا عصب ‏\"‏ ‏.‏ قال أبو عبد الرحمن أصح ما في هذا الباب في جلود الميتة إذا دبغت حديث الزهري عن عبيد الله بن عبد الله عن ابن عباس عن ميمونة والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Ukaim said:                     \"The Messenger of Allah wrote to Juhainah: 'Do not make use of the skin and sinew of dead animals.\"' (Hasan)Abu 'Abdur-Rahman )An-Nasa'i) said: The most correct about this topic, regarding the skins of the dead animal when it is tanned, is the narration of Az-Zuhri, from 'Ubaidullah bin 'Abdullah, from Ibn 'Abbas, from Maimunah, and Allah knows best.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "22977",
        "10786"
      ]
    },
    {
      "id": "sunan-an-nasai-4363",
      "hadith_no": "4363",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن عثمان الأحلافي، عن سعيد بن المسيب، قال من أراد أن يضحي، فدخلت أيام العشر فلا يأخذ من شعره ولا أظفاره ‏.‏ فذكرته لعكرمة فقال ألا يعتزل النساء والطيب ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"Whoever wants to offer a sacrifice when dhul-Hijjah begins, let him not remove anything fro his hair or nails,\" I (the Narrator) mentioned that to 'Ikrimah, and he said: \"Sho8uld he not also keep away from women and perfume?\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11002"
      ]
    },
    {
      "id": "sunan-an-nasai-4948",
      "hadith_no": "4948",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن منصور، عن عطاء، ومجاهد، عن أيمن بن أم أيمن، يرفعه قال ‏\"‏ لا تقطع اليد إلا في ثمن المجن ‏\"‏ ‏.‏ وثمنه يومئذ دينار ‏.‏",
      "text_en": " It was narrated that Ayman bin Umm Ayman who attributed it to the Prophet said:                     \"The (hand of) a thief is not to be cut off except for the price of a shield, and in those days the price of a shield was a Dinar.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11067",
        "11029",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-5203",
      "hadith_no": "5203",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا ‏{‏ ابن، ‏}‏ وهب عن سليمان، - هو ابن بلال - عن شريك، - هو ابن أبي نمر - عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، قال شريك وأخبرني أبو سلمة، أن النبي صلى الله عليه وسلم كان يلبس خاتمه في يمينه ‏.‏",
      "text_en": " Ibn Wahab narrated from Sulaiman - and he is Ibn Bilal - from Sharik - and he is Ibn Abi Namr - from Ibrahim Ibn 'Abdullah bin Hunain, from his father, from 'Ali; Sharik said:                      \"And Abu Salamah informed me\" -That the Prophet [SAW] used to wear his ring on his right hand.",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "20160",
        "11858",
        "11150",
        "11181",
        "5",
        "20587",
        "10567"
      ]
    },
    {
      "id": "sunan-an-nasai-5345",
      "hadith_no": "5345",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا الفضل بن دكين، عن شريك، عن عمار الدهني، عن أبي الزبير، عن جابر، قال دخل النبي صلى الله عليه وسلم يوم الفتح وعليه عمامة سوداء ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Prophet [SAW] entered (Makkah) on the Day of the Conquest wearing a black turban.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20348",
        "20587",
        "10802",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-5574",
      "hadith_no": "5574",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أخبرنا عبد الله، عن شريك، عن مغيرة، عن إبراهيم، والشعبي، قالا السكر خمر ‏.‏",
      "text_en": " It was narrated from Al-Mughirah that Ibrahim and Al-Sha'bi said:                     \"Strong drink is Khamr.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20587",
        "11072",
        "11051",
        "11052"
      ]
    },
    {
      "id": "sunan-an-nasai-5678",
      "hadith_no": "5678",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن إسماعيل، قال حدثنا يزيد، قال أنبأنا شريك، عن سماك بن حرب، عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والنقير والمزفت ‏.‏ خالفه أبو عوانة ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah, from his father, that:                     The Messenger of Allah [SAW] forbade Ad-Dubba', Al-Hantam, An-Naqir, and Al-Muzaffat.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20472",
        "20587",
        "10770",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5738",
      "hadith_no": "5738",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا يحيى بن آدم، قال حدثنا شريك، عن أبي إسحاق، عن يحيى بن عبيد البهراني، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان ينقع له الزبيب فيشربه يومه والغد وبعد الغد ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     Raisins would be soaked for the Messenger of Allah [SAW] and he would drink it that day, the following day, and the day after that.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20364",
        "20587",
        "11049",
        "10841",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1",
      "hadith_no": "1",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة قال: حدثنا شريك عن الأعمش عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم: «ما أمرتكم به فخذوه وما نهيتكم عنه فانتهوا».",
      "text_en": " Abu Hurairah narrated that:                     The Prophet said: \"Whatever I have commanded you do it, and whatever I have forbidden you, refrain from it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11060",
        "11161"
      ]
    },
    {
      "id": "sunan-ibn-majah-31",
      "hadith_no": "31",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وعبد الله بن عامر بن زرارة، وإسماعيل بن موسى، قالوا حدثنا شريك، عن سماك، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Abdullah bin Mas'ud that his father said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever tells lies about me deliberately, let him take his place in Hell.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30547",
        "30467",
        "35016",
        "20587",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-32",
      "hadith_no": "32",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، وإسماعيل بن موسى، قالا حدثنا شريك، عن منصور، عن ربعي بن حراش، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تكذبوا على فإن الكذب على يولج النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from that 'Ali said:                     \"The Messenger of Allah (ﷺ) said: 'Do not tell lies about me, for telling lies about me leads to Hell (Fire).\"",
      "usc_msa_ref": "",
      "chain": [
        "30467",
        "35016",
        "20587",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-85",
      "hadith_no": "85",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك، عن منصور، عن ربعي، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يؤمن عبد حتى يؤمن بأربع بالله وحده لا شريك له وأني رسول الله وبالبعث بعد الموت والقدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah (ﷺ) said: 'No slave truly believes until he believes in four things: in Allah alone with no partner; that I am the Messenger of Allah; in the resurrection after death; and in the Divine Decree (Qadar).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30467",
        "20587",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-154",
      "hadith_no": "154",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن موسى، وسويد بن سعيد، قالا حدثنا شريك، عن أبي ربيعة الإيادي، عن ابن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله أمرني بحب أربعة وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قيل يا رسول الله من هم قال ‏\"‏ علي منهم ‏\"‏ ‏.‏ يقول ذلك ثلاثا ‏\"‏ وأبو ذر وسلمان والمقداد ‏\"‏ ‏.‏",
      "text_en": " Ibn Buraidah narrated that his father said:                     \"The Messenger of Allah said: 'Allah has commanded me to love four people, and He told me that He also loves them.' He was asked: 'O Messenger of Allah, who are they?' He said: ''Ali is one of them,' and he said that three times, 'and Abu Dharr, Salman and Miqdad.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "30547",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-305",
      "hadith_no": "305",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن المقدام بن شريح بن هانئ، عن أبيه، عن عائشة، قال قلت أخبريني بأى، شىء كان النبي  صلى الله عليه وسلم  يبدأ إذا دخل عليك قالت كان إذا دخل يبدأ بالسواك ‏.‏",
      "text_en": " It was narrated from Miqdam bin Shuraih bin Hani' that his father said:                     \"I said to 'Aishah: 'Tell me, what was the first thing that the Messenger of Allah did when he entered upon you?' She said: 'The first thing he would do would be to use the tooth stick.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-324",
      "hadith_no": "324",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، وهشيم، ووكيع، عن الأعمش، عن أبي وائل، عن حذيفة، أن رسول الله  صلى الله عليه وسلم  أتى سباطة قوم فبال عليها قائما ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Messenger of Allah came to the garbage dump of some people and he urinated on it standing up.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "20468",
        "20032",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-384",
      "hadith_no": "384",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شريك، عن جابر، عن زيد العمي، عن أبي الصديق الناجي، عن عائشة، أن النبي  صلى الله عليه وسلم  كان يغسل مقعدته ثلاثا ‏.‏ قال ابن عمر فعلناه فوجدناه دواء وطهورا ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Prophet used to wash his private parts three times. Ibn 'Umar said: \"We did that and we found it to be healing and a means of purification.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20587",
        "34",
        "14135",
        "11268",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-388",
      "hadith_no": "388",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن بن سلمة حدثنا أبو حاتم، حدثنا سعيد بن سليمان الواسطي، عن شريك، نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "30252",
        "20587"
      ]
    },
    {
      "id": "sunan-ibn-majah-410",
      "hadith_no": "410",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن الحسن الأسدي، حدثنا شريك، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، قال كان رسول الله  صلى الله عليه وسلم  وأزواجه يغتسلون من إناء واحد ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah and his wives used to take a bath from a single vessel.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20004",
        "20587",
        "12246",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-422",
      "hadith_no": "422",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا الهيثم بن جميل، حدثنا شريك، عن عبد الله بن محمد بن عقيل، عن الربيع بنت معوذ، قالت أتيت النبي  صلى الله عليه وسلم  بميضأة فقال ‏\"‏ اسكبي ‏\"‏ ‏.‏ فسكبت فغسل وجهه وذراعيه وأخذ ماء جديدا فمسح به رأسه مقدمه ومؤخره وغسل قدميه ثلاثا ثلاثا ‏.‏",
      "text_en": " It was narrated that Rubai' bint Mu'awwidh said:                     \"I brought a basin of water to the Prophet and he said: 'Pour it,' so I poured it and he washed his face and forearms, then he took fresh water and wiped his head, front and back, and then he washed his feet. He washed each part three times.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20391",
        "20587",
        "12246",
        "617"
      ]
    },
    {
      "id": "sunan-ibn-majah-438",
      "hadith_no": "438",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن خالد بن علقمة، عن عبد خير، عن علي، أن رسول الله  صلى الله عليه وسلم  توضأ فمضمض ثلاثا واستنشق ثلاثا من كف واحد ‏.‏",
      "text_en": " It was narrated from 'Ali that:                     The Messenger of Allah performed ablution and he rinsed his mouth three times, and sniffed water up into his nose three times from one handful.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "19874",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-444",
      "hadith_no": "444",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك بن عبد الله النخعي، عن ثابت بن أبي صفية الثمالي، قال سألت أبا جعفر قلت له حدثت عن جابر بن عبد الله، أن النبي  صلى الله عليه وسلم  توضأ مرة مرة قال نعم ‏.‏ قلت ومرتين مرتين وثلاثا ثلاثا قال نعم ‏.‏",
      "text_en": " It was narrated that Thabit bin Abi Safiyyah Ath-Thumali said:                     \"I asked Abu Ja'far: Was it narrated to you from Jabir bin 'Abdullah that the Prophet performed ablution washing each part once?' He said: 'Yes.' I said: 'And each part twice, and each part thrice?' He said: 'Yes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30467",
        "20587",
        "12618",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-475",
      "hadith_no": "475",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، حدثنا عبد الله بن محمد بن عقيل، عن الربيع، أن النبي  صلى الله عليه وسلم  توضأ فمسح ظاهر أذنيه وباطنهما ‏.‏",
      "text_en": " It was narrated from Rubai' that:                     The prophet performed ablution and wiped his ears inside and out.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "12246"
      ]
    },
    {
      "id": "sunan-ibn-majah-549",
      "hadith_no": "549",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا شريك، عن عمرو بن عامر، عن أنس بن مالك، قال كان رسول الله  صلى الله عليه وسلم  يتوضأ لكل صلاة وكنا نحن نصلي الصلوات كلها بوضوء واحد ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah used to perform ablution for every prayer, and we used to perform all of the prayers with one ablution.\"",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20587",
        "15406",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-562",
      "hadith_no": "562",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، حدثنا شريك، عن طريف بن شهاب، قال سمعت أبا نضرة، يحدث عن جابر بن عبد الله، قال انتهينا إلى غدير فإذا فيه جيفة حمار ‏.‏ قال فكففنا عنه حتى انتهى إلينا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ إن الماء لا ينجسه شىء ‏\"‏ ‏.‏ فاستقينا وأروينا وحملنا ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"We came to a pond in which there was the carcass of a donkey, so we refrained from using the water until the Messenger of Allah came to us and said: 'Water is not made impure by anything.' Then we drank from it and gave it to our animals to drink, and we carried some with us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "20587",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-576",
      "hadith_no": "576",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن عبد الله بن عيسى، عن موسى بن عبد الله بن يزيد، عن امرأة، من بني عبد الأشهل قالت سألت النبي  صلى الله عليه وسلم  فقلت إن بيني وبين المسجد طريقا قذرة ‏.‏ قال ‏\"‏ فبعدها طريق أنظف منها ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فهذه بهذه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that a woman from (the tribe of) Banu 'Abdul-Ashhal said:                     \"I said to the prophet: 'Between the mosque and I there is a filthy path.' He said: 'After that is there a cleaner path?' I said: 'Yes.' He said: 'This is (a remedy) for that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11361",
        "10832"
      ]
    },
    {
      "id": "sunan-ibn-majah-623",
      "hadith_no": "623",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن حريث، عن الشعبي، عن مسروق، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  يغتسل من الجنابة ثم يستدفئ بي قبل أن أغتسل ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah used to have a bath to cleanse himself from sexual impurity, then he would warm himself with me before I had the bath.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "24077",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-668",
      "hadith_no": "668",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسماعيل بن موسى، قالا حدثنا شريك، عن أبي اليقظان، عن عدي بن ثابت، عن أبيه، عن جده، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ المستحاضة تدع الصلاة أيام أقرائها ثم تغتسل وتتوضأ لكل صلاة وتصوم وتصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Thabit, from his father, from his grandfather, that:                     The Prophet said: \"The woman who experiences irregular non-menstrual bleeding should leave prayer during the days of her period, then she should take a bath, and perform ablution for each prayer, and she should fast and perform the prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "35016",
        "20587",
        "11372"
      ]
    },
    {
      "id": "sunan-ibn-majah-670",
      "hadith_no": "670",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا شريك، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش أنها استحيضت على عهد رسول الله  صلى الله عليه وسلم  فأتت رسول الله  صلى الله عليه وسلم  فقالت إني استحضت حيضة منكرة شديدة ‏.‏ قال لها ‏\"‏ احتشي كرسفا ‏\"‏ ‏.‏ قالت له إنه أشد من ذلك إني أثج ثجا ‏.‏ قال ‏\"‏ تلجمي وتحيضي في كل شهر في علم الله ستة أيام أو سبعة أيام ثم اغتسلي غسلا فصلي وصومي ثلاثة وعشرين أو أربعة وعشرين وأخري الظهر وقدمي العصر واغتسلي لهما غسلا وأخري المغرب وعجلي العشاء واغتسلي لهما غسلا وهذا أحب الأمرين إلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamnah bint Jahsh that:                     She experienced prolonged non-menstrual bleeding during the time of the Messenger of Allah. She came to the Messenger of Allah and said: \"I am suffering prolonged and painful bleeding.\" He said: \"Fill it with a pad of cloth.\" She said: \"It is worse than that, it is flowing copiously.\" He said: \"Then bind yourself with a cloth and observe your menses for six or seven days, in the knowledge of Allah, then have a bath and perform prayer and fast for twenty-three or twenty-four days. Delay Zuhr and bring 'Asr forward, and take (one) bath for both, and delay Maghrib and bring 'Isha' forward, and have (one) bath for both. That is what I prefer of the two matters.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20587",
        "12246",
        "11827",
        "578",
        "72"
      ]
    },
    {
      "id": "sunan-ibn-majah-680-2",
      "hadith_no": "680",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن بيان، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال كنا نصلي مع رسول الله  صلى الله عليه وسلم  صلاة الظهر بالهاجرة فقال لنا ‏\"‏ أبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     We were praying Zuhr with the Messenger of Allah at the time of intense heat (i.e., midday when the sun has just passed its zenith) and he said to us, \"Wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11326",
        "11046",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-713",
      "hadith_no": "713",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شريك، عن سماك بن حرب، عن جابر بن سمرة، قال كان بلال لا يؤخر الأذان عن الوقت وربما أخر الإقامة شيئا ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"Bilal did not delay the Adhan from its proper time, but he sometimes delayed the Iqamah a little.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30002",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-ibn-majah-865",
      "hadith_no": "865",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، وسفيان بن عيينة، عن زياد بن علاقة، عن قطبة بن مالك، سمع النبي  صلى الله عليه وسلم  يقرأ في الصبح ‏{والنخل باسقات لها طلع نضيد }‏ ‏.‏",
      "text_en": " It wasnarrated from Qutbah bin Malik that he heard the Prophet (ﷺ)recite:                      “And tall date palms, with ranged clusters” [50:10] intheSubh.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "20005",
        "11339"
      ]
    },
    {
      "id": "sunan-ibn-majah-928",
      "hadith_no": "928",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن موسى السدي، حدثنا شريك، عن أبي عمر، قال سمعت أبا جحيفة، يقول ذكرت الجدود عند رسول الله  صلى الله عليه وسلم  وهو في الصلاة فقال رجل جد فلان في الخيل ‏.‏ وقال آخر جد فلان في الإبل ‏.‏ وقال آخر جد فلان في الغنم ‏.‏ وقال آخر جد فلان في الرقيق ‏.‏ فلما قضى رسول الله  صلى الله عليه وسلم  صلاته ورفع رأسه من آخر الركعة قال ‏\"‏ اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏ وطول رسول الله  صلى الله عليه وسلم  صوته بالجد ليعلموا أنه ليس كما يقولون ‏.‏",
      "text_en": " It wasnarrated that Abu ‘Umar said:                      “I heard Abu Juhaifah say: Goodfortune was mentioned in the presence of the Messenger of Allah (ﷺ)while he was performing prayer. A man said: ‘so-and-so’s fortuneis inhorses.’ Another man said: ‘So-and-so’s fortune is incamels.’ Anotherman said: ‘So-and-so’s fortune is in sheep.’Another man said: ‘So-and-so’s fortune is in slaves.’ While theMessenger of Allah (ﷺ) wasfinishing his prayer, he raised his headat the end of the last Rak’ahand said: ‘Allahumma Rabbanalakal-hamd mil’ as-samawati wa mil’ al-ard wa mil’ ma shi’tamin shai’in ba’du. Allahumma la mani’ limaa’taita wa lamu’ti lima mana’ta, wa la yanfa’u dhal-jaddi minkal-jadd(Allahhears those who praise Him. O Allah! O our Lord! To You is thepraiseas much as fills the heavens, as much as fills the earth and asmuchas You will after that. O Allah, there is none who can withholdwhatYou give, and none who can give what You withhold, and the goodfortune of any fortunate person is to no avail against You).’ TheMessenger of Allah (ﷺ) elongated the word Jadd (fortune) so thatthey would know that it was not as they had said.”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "4047"
      ]
    },
    {
      "id": "sunan-ibn-majah-932",
      "hadith_no": "932",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أنبأنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي  صلى الله عليه وسلم  إذا سجد وضع ركبتيه قبل يديه وإذا قام من السجود رفع يديه قبل ركبتيه ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I saw the Prophet (ﷺ)whenhe prostrated and put his knees on the ground before his hands,andwhen he stood up after prostrating, he took his hands off thegroundbefore his knees.”",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20472",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "id": "sunan-ibn-majah-1022",
      "hadith_no": "1022",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن شريك، عن أبي اليقظان، عن عدي بن ثابت، عن أبيه، عن جده، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ البزاق والمخاط والحيض والنعاس في الصلاة من الشيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Adi bin Thabit, from his father, from hisgrandfather, that the Prophet (ﷺ) said:                      “Spitting, blowing one’snose, menstruating and drowsiness during the prayer are from Satan.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20348",
        "20587",
        "11372"
      ]
    },
    {
      "id": "sunan-ibn-majah-1116",
      "hadith_no": "1116",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن زبيد، عن عبد الرحمن بن أبي ليلى، عن عمر، قال صلاة السفر ركعتان والجمعة ركعتان والعيد ركعتان تمام غير قصر على لسان محمد  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that ‘Umar said:                      “The prayer while traveling is twoRak’ah, and Friday is two Rak’ah, and ‘Eid is two Rak’ah.They arecomplete and are not shortened, as told by Muhammad (ﷺ).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11335",
        "11196",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-1201",
      "hadith_no": "1201",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الخليل بن عمرو أبو عمرو، حدثنا شريك، عن أبي إسحاق، عن الحارث، عن علي، قال كان النبي  صلى الله عليه وسلم  يصلي الركعتين عند الإقامة ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Prophet (ﷺ) used to performtwoRak’ah at the time of the Iqamah.”",
      "usc_msa_ref": "",
      "chain": [
        "36552",
        "20587",
        "11049",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1234",
      "hadith_no": "1234",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن أبي إسحاق، عن بريد بن أبي مريم، عن أبي الحوراء، عن الحسن بن علي، قال علمني جدي رسول الله  صلى الله عليه وسلم  كلمات أقولهن في قنوت الوتر ‏\"‏ اللهم عافني فيمن عافيت وتولني فيمن توليت واهدني فيمن هديت وقني شر ما قضيت وبارك لي فيما أعطيت إنك تقضي ولا يقضى عليك إنه لا يذل من واليت سبحانك ربنا تباركت وتعاليت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Al-Hasan bin ‘Ali said:                      “My grandfather, theMessenger of Allah (ﷺ), taught me some words to say in Qunut ofWitr: Allahumma ‘afini fiman ‘afait, wa tawallani fimantawallait,wahdini fiman hadait, wa qini sharra ma qadait, wa barikli fimaa’tait. Innaka taqdi wa la yuqda ‘alaik, innahu layudhillu manwalait. Subhanaka rabbana tabarakta wa ta’alait (OAllah, pardon mealong with those whom You have pardoned, be an allyto me along withthose whom You are an ally to, guide me along withthose whom You haveguided, protect me from the evil that You havedecreed, and bless forme that which You have bestowed. For verilyYou decree and none candecree over You. He whom You support cannever be humiliated. Glory isto You, our Lord, You are Blessed andExalted).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11049",
        "19840",
        "30"
      ]
    },
    {
      "id": "sunan-ibn-majah-1250",
      "hadith_no": "1250",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن جابر، عن عامر، عن ابن عباس، وابن، عمر قالا سن رسول الله  صلى الله عليه وسلم  صلاة السفر ركعتين وهما تمام غير قصر والوتر في السفر سنة ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas and Ibn ‘Umar said:                      “The Messenger ofAllah (ﷺ) prescribed two Rak’ah of prayer when traveling; theyarecomplete and are not shortened. And Witr when traveling isSunnah.”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "34",
        "11052",
        "17",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1361",
      "hadith_no": "1361",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا شريك، عن مغيرة، عن عامر، قال شهد عياض الأشعري عيدا بالأنبار فقال مالي لا أراكم تقلسون كما كان يقلس عند رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that ‘Amir said:                      “Iyad Al-Ash’ari was in Anbar at thetime of ‘Eid, and he said: ‘Why is it that I do not see youengaged inTaqlis as was done in the presence of the Messenger ofAllah (ﷺ)?’”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20587",
        "11072",
        "11052"
      ]
    },
    {
      "id": "sunan-ibn-majah-1394",
      "hadith_no": "1394",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن محمد الطلحي، حدثنا ثابت بن موسى أبو يزيد، عن شريك، عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كثرت صلاته بالليل حسن وجهه بالنهار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ) said:‘Whoever prays a great deal at night, his face will be handsomeduringthe day.’”",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1464",
      "hadith_no": "1464",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا أبو الوليد، حدثنا شريك، عن عبد الله بن عصم أبي علوان، عن ابن عباس، قال أمر نبيكم  صلى الله عليه وسلم  بخمسين صلاة فنازل ربكم أن يجعلها خمس صلوات ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “Your Prophet (ﷺ) wasenjoinedto do fifty prayers but he returned to your Lord to make(i.e.,reduce) them to five prayers.”",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "20296",
        "20587",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1593",
      "hadith_no": "1593",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك بن عبد الله، عن سماك بن حرب، عن جابر بن سمرة، أن رجلا، من أصحاب النبي  صلى الله عليه وسلم  جرح فآذته الجراحة فدب إلى مشاقصه فذبح به نفسه فلم يصل عليه النبي  صلى الله عليه وسلم  ‏.‏ قال وكان ذلك أدبا منه ‏.‏",
      "text_en": " It wasnarrated from Jabir bin Samurah that a man from among theCompanionsof the Prophet (ﷺ) was wounded, and the wound caused hima greatdeal of pain. He went and took a spearhead, and slaughteredhimselfwith it. The Prophet (ﷺ) did not offer the funeral prayerfor him,and that was as an admonition for others.",
      "usc_msa_ref": "",
      "chain": [
        "30467",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-ibn-majah-1613",
      "hadith_no": "1613",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك بن عبد الله، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن عائشة، قالت فقدته - تعني النبي  صلى الله عليه وسلم  - فإذا هو بالبقيع فقال ‏\"‏ السلام عليكم دار قوم مؤمنين أنتم لنا فرط وإنا بكم لاحقون اللهم لا تحرمنا أجرهم ولا تفتنا بعدهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I could not find him, meaning theProphet (ﷺ), and he was in Al-Baqi’. He said: “As-salamu‘alaykumdara qawmin mu’minin. Antum lana faratun wa inna bikumlahiqun.Allahumma la tahrimna ajrahum wa la taftinna ba’dahum.(Peace be uponyou, O abode of believing people. You have gone aheadof us and verilywe will join you soon. O Allah, do not deprive us oftheir reward anddo not put us to trial after them).”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "19808",
        "709",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1622",
      "hadith_no": "1622",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن موسى السدي، حدثنا شريك، عن أبي اليقظان، عن زاذان، عن جرير بن عبد الله البجلي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللحد لنا والشق لغيرنا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jarir bin ‘Abdullah Al-Bajali said:                      “TheMessengerof Allah (ﷺ) said: ‘The niche-grave is for us and theditch-graveis for others.’”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "10911",
        "4057"
      ]
    },
    {
      "id": "sunan-ibn-majah-1771",
      "hadith_no": "1771",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن طلحة بن يحيى، عن مجاهد، عن عائشة، قالت دخل على رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ هل عندكم شىء ‏\"‏ ‏.‏ فنقول لا ‏.‏ فيقول ‏\"‏ إني صائم ‏\"‏ ‏.‏ فيقيم على صومه ثم يهدى لنا شىء فيفطر ‏.‏ قالت وربما صام وأفطر ‏.‏ قلت كيف ذا قالت إنما مثل هذا مثل الذي يخرج بصدقة فيعطي بعضها ويمسك بعضا ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)wouldenter upon me and say: ‘Do you have anything (any food)?’ If wesaid: ‘No,’ he would say: ‘Then I am fasting.’ So he wouldcontinuefasting, then it we were given some food, he would break hisfast.”She said: “Sometimes he would fast and (then) break fast(i.e.,combine fasting and breaking fast in one day).” I said: “Howis that?”She said: “Like the one who goes out with charity(i.e., something togive in charity),and he gives some away and keepssome.”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11863",
        "11028",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1861",
      "hadith_no": "1861",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا يحيى بن آدم، عن شريك، عن أبي حمزة، عن الشعبي، عن فاطمة بنت قيس، أنها سمعته - تعني النبي،  صلى الله عليه وسلم  - يقول ‏\"‏ ليس في المال حق سوى الزكاة ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais narrated that:                     she heard him, meaning the Prophet say: “There is nothing due on wealth other then Zakat.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20364",
        "20587",
        "20458",
        "11052",
        "224"
      ]
    },
    {
      "id": "sunan-ibn-majah-1873",
      "hadith_no": "1873",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا شريك، عن عثمان الثقفي، عن أبي ليلى الكندي، عن سويد بن غفلة، قال جاءنا مصدق النبي  صلى الله عليه وسلم  فأخذت بيده وقرأت في عهده لا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة ‏.‏ فأتاه رجل بناقة عظيمة ململمة فأبى أن يأخذها فأتاه بأخرى دونها فأخذها وقال أى أرض تقلني وأى سماء تظلني إذا أتيت رسول الله  صلى الله عليه وسلم  وقد أخذت خيار إبل رجل مسلم ‏.‏",
      "text_en": " It was narrated that:                     Suwaid bin Ghafalah said: ”The Zakah collector of the Prophet came to us, and I took him by the hand and read in his order: 'Do not gather separate herds and do not separate herd for fear of Sadaqah'. A man brought him a huge, fat she-camel, but he refused to accept it. So he brought him another of lower quality and he accepted it. He said: 'What land would shelter me, if I came to the Messenger of Allah having taken the nest of a Muslim man's camels?' ”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20587",
        "11174"
      ]
    },
    {
      "id": "sunan-ibn-majah-2052",
      "hadith_no": "2052",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن العباس بن ذريح، عن البهي، عن عائشة، قالت عثر أسامة بعتبة الباب فشج في وجهه فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أميطي عنه الأذى ‏\"‏ ‏.‏ فتقذرته فجعل يمص عنه الدم ويمجه عن وجهه ثم قال ‏\"‏ لو كان أسامة جارية لحليته وكسوته حتى أنفقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Usamah stumbled at the threshold of the door and cut his face. The Messenger of Allah said: 'Remove the harm (the blood) from him,' but I was repulsed by that. He started to suck the blood and remove it from his face, then he said: 'If Usamah were a girl, I would have adorned him and dressed him until I married him off.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2069",
      "hadith_no": "2069",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا الهيثم بن جميل، حدثنا شريك، عن منصور، - أظنه - عن طلحة، عن خيثمة، عن عائشة، أن رسول الله  صلى الله عليه وسلم  أمرها أن تدخل على رجل امرأته قبل أن يعطيها شيئا ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     the Messenger of Allah told her to take a woman to her husband before he had given her anything (i.e. bridal-money). (Da' if)",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20391",
        "20587",
        "11356",
        "11332",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2333-2",
      "hadith_no": "2333",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك بن عبد الله، عن قيس بن وهب، عن رجل، من بني سواءة قال قلت لعائشة أخبريني عن خلق، رسول الله صلى الله عليه وسلم ‏.‏ قالت أوما تقرأ القرآن ‏{وإنك لعلى خلق عظيم}‏ قالت كان رسول الله صلى الله عليه وسلم مع أصحابه فصنعت له طعاما وصنعت حفصة له طعاما ‏.‏ قالت فسبقتني حفصة فقلت للجارية انطلقي فأكفئي قصعتها فلحقتها وقد هوت أن تضع بين يدى رسول الله صلى الله عليه وسلم فأكفأتها فانكسرت القصعة وانتشر الطعام ‏.‏ قالت فجمعها رسول الله صلى الله عليه وسلم وما فيها من الطعام على النطع فأكلوا ثم بعث بقصعتي فدفعها إلى حفصة فقال ‏\"‏ خذوا ظرفا مكان ظرفكم ‏\"‏ ‏.‏ قالت فما رأيت ذلك في وجه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that a man from Banu Suwa'ah said:                     'I said to 'Aishah: Tell me about the character of the Messenger of Allah (ﷺ).' She said: 'Have you not read the Qur'an: “And verily, you (O Mohammed {SAW}) are on an exalted (standard of) character?” She said: 'The Messenger of Allah (ﷺ) was with his Companions, and I made some food for him, and Hafsah made some food for him, but Hafash got there before me. So I said to the slave girl: “Overturn her bowl.” She went and caught up with her, and she was about to put (the bowl) in front of the Messenger of Allah (ﷺ). She overturned it and the bowl broke, scattering the food. The Messenger of Allah (ﷺ) gathered the pieces and the food on the leather mat and they ate. Then he sent for my bowl and gave it to Hafsah, and said: “Take this pot in place of your pot, and eat what is in it.” And I did not see any expression of anger on the face of the Messenger of Allah (ﷺ).' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "10815"
      ]
    },
    {
      "id": "sunan-ibn-majah-2482",
      "hadith_no": "2482",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا تميم بن المنتصر الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن هشام بن عروة، عن عمر بن عبد الله بن عمر يعني، عن أبيه، عن جده، عمر أنه تصدق بفرس على عهد رسول الله صلى الله عليه وسلم فأبصر صاحبها يبيعها بكسر فأتى النبي صلى الله عليه وسلم فسأله عن ذلك فقال ‏\"‏ لا تبتع صدقتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar, meaning, from his father, his grandfather 'Umar, that :                     he gave a horse in charity at the time of the Messenger of Allah (ﷺ), then he saw its owner selling it for a low price. He went to the Prophet (ﷺ) and asked him about that, and he said: “Do not buy what you gave in charity.”",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11065",
        "10511",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-2560",
      "hadith_no": "2560",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك، عن أبي إسحاق، عن عطاء، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من زرع في أرض قوم بغير إذنهم فليس له من الزرع شىء وترد عليه نفقته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi` bin Khadij said:                     “The Messenger of Allah (ﷺ) said: 'Whoever cultivates people`s land without their permission, he has no right to any produce, but he should be recompensed for his expenditure.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30467",
        "20587",
        "11049",
        "11029",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-2654",
      "hadith_no": "2654",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن سماك بن حرب، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم رجم يهوديا ويهودية ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah that :                     the Prophet (ﷺ) stoned a Jewish man and a Jewish woman.",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-ibn-majah-2666",
      "hadith_no": "2666",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن أبي حصين، عن عمير بن سعيد، ح وحدثنا عبد الله بن محمد الزهري، حدثنا سفيان بن عيينة، حدثنا مطرف، سمعته عن عمير بن سعيد، قال قال علي بن أبي طالب ما كنت أدي من أقمت عليه الحد إلا شارب الخمر فإن رسول الله صلى الله عليه وسلم لم يسن فيه شيئا إنما هو شىء جعلناه نحن ‏.‏",
      "text_en": " Ali bin Abi Talib said:                     “I would not pay the blood money (Diyah) for those on whom I carried out the legal punishment, except for the wine-drinker. The Messenger of Allah did not institute anything in that case, rather it is something that we would do.”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11371",
        "11646",
        "20005",
        "11646"
      ]
    },
    {
      "id": "sunan-ibn-majah-2715",
      "hadith_no": "2715",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا سعيد بن يحيى بن الأزهر الواسطي، حدثنا إسحاق بن يوسف الأزرق، عن شريك، عن عاصم، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أول ما يقضى بين الناس يوم القيامة في الدماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah that the Messenger of Allah (ﷺ) said:                     The first matter concerning which judgment will be passed among the people on the Day of Resurrection will be bloodshed.”",
      "usc_msa_ref": "",
      "chain": [
        "30254",
        "20411",
        "20587",
        "11080",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2810",
      "hadith_no": "2810",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن عمارة بن القعقاع، وابن، شبرمة عن أبي زرعة، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله نبئني بأحق الناس مني بحسن الصحبة فقال ‏\"‏ نعم وأبيك لتنبأن أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أبوك ‏\"‏ ‏.‏ قال نبئني يا رسول الله عن مالي كيف أتصدق فيه قال ‏\"‏ نعم والله لتنبأن أن تصدق وأنت صحيح شحيح تأمل العيش وتخاف الفقر ولا تمهل حتى إذا بلغت نفسك هاهنا قلت مالي لفلان ومالي لفلان وهو لهم وإن كرهت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     “A man came to the Prophet (ﷺ) and said: “O Messenger of Allah (ﷺ), tell me, which of the people has most right to my good companionship?' He said: 'Yes, by your father, you will certainly be told.' He said: 'Your mother,' He said: 'Then who?' He said: Then your mother.' He said: 'Then who?' He said: Then your mother.' He said: 'Then who?' He said: Then your father.' He said: 'Tell me, O Messenger of Allah (ﷺ) about my wealth- how should I give in charity?' He said: 'Yes, by Allah (SWT) you will certainly be told. You should give in charity when you are still healthy and greedy for wealth, hoping for a long life and fearing poverty. Do not tarry until your soul reaches here and you say: “My wealth of for so-and-so,” and “My wealth of for so-and-so,” and it will be for them even though you dislike that.'”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2829",
      "hadith_no": "2829",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الرحمن بن عبد الوهاب، حدثنا سلم بن قتيبة، عن شريك، عن ليث، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم ورث جدة سدسا ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)gave agrandmother one sixth of the inheritance.",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "20023",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3040",
      "hadith_no": "3040",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن أبي إسحاق، عن الأسود، عن عائشة، قالت كأني أرى وبيص الطيب في مفرق رسول الله  صلى الله عليه وسلم  بعد ثلاثة وهو محرم ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “It is as if I can see the tracesofperfume in the parting (of hair) of the Messenger of Allah (ﷺ)after three days, and he was a Muhrim.”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3330",
      "hadith_no": "3330",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عبد الله، حدثنا وكيع، عن شريك، عن حجاج بن أرطاة، عن القاسم بن أبي بزة، عن سليمان اليشكري، عن جابر بن عبد الله، قال نهينا عن صيد، كلبهم وطائرهم يعني المجوس ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “We were forbidden (toeat) the game caught by their dogs and birds – meaning theZoroastrians.”",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20587",
        "20580",
        "11261",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3371",
      "hadith_no": "3371",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن الأزهر النيسابوري، حدثنا الهيثم بن جميل، حدثنا شريك، عن هشام بن عروة، عن أبيه، عن ابن عمر، قال من يأكل الغراب وقد سماه رسول الله  صلى الله عليه وسلم  ‏\"‏ فاسقا ‏\"‏ ‏.‏ والله ما هو من الطيبات ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “Who eats crows? The MessengerofAllah (ﷺ) called them vermin, By Allah, they are not from amongthegood and permissible things.”",
      "usc_msa_ref": "",
      "chain": [
        "38001",
        "20391",
        "20587",
        "11065",
        "10511",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3413",
      "hadith_no": "3413",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن عبد الرحمن المحاربي، حدثنا شريك، عن عبد الكريم، عن عكرمة، عن ابن عباس، قال لم يكن رسول الله  صلى الله عليه وسلم  ينفخ في طعام ولا شراب ولا يتنفس في الإناء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)never blew onto his food or drink, and he did not breathe into thevessel.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20587",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3531",
      "hadith_no": "3531",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الحميد بن بيان الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن سماك، عن القاسم بن مخيمرة، عن ابن بريدة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كنت نهيتكم عن الأوعية فانتبذوا فيه واجتنبوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father that the Prophet(ﷺ)said:                      “I used to forbid you to use certain vessels, but now makeNabidh in them, but avoid all intoxicants.”",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "10770",
        "10812",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3556",
      "hadith_no": "3556",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن عبد الرحمن المحاربي، عن شريك، عن عبد الكريم، عن عكرمة، عن ابن عباس، قال لم يكن رسول الله  صلى الله عليه وسلم  ينفخ في الشراب ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)didnot blow into his drinks.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20587",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3705",
      "hadith_no": "3705",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا شريك، عن عبد الملك بن عمير، عن حصين بن قبيصة، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا سفيان بن سهل لا تسبل فإن الله لا يحب المسبلين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Mughirah bin Shu’bah that the Messenger of Allah(ﷺ) said:                      “O Sufyan bin Sahl, do not let your garment hang, forAllah does not like those who let their garments hang below theankles.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20587",
        "11368",
        "15100",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-3730",
      "hadith_no": "3730",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، عن شريك بن عبد الله القاضي، عن أبي إسحاق، عن البراء، قال ما رأيت أجمل من رسول الله  صلى الله عليه وسلم  مترجلا في حلة حمراء ‏.‏",
      "text_en": " It wasnarrated that Bara’ said:                      “I never saw anyone more handsomethenthe Messenger of Allah (ﷺ), with his hair combed, wearing a redtwo-piece suit.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11049",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-3761",
      "hadith_no": "3761",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عمر بن الوليد الكندي، حدثنا يحيى بن آدم، عن شريك، عن عبيد الله، عن نافع، عن ابن عمر، قال كان شيب رسول الله  صلى الله عليه وسلم  نحو عشرين شعرة ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The white hair of the Prophet(ﷺ) numbered approximately twenty.”",
      "usc_msa_ref": "",
      "chain": [
        "35140",
        "20364",
        "20587",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3657-2",
      "hadith_no": "3657",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك بن عبد الله، عن منصور، عن عبيد الله بن علي، عن ابن سلامة السلمي، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ أوصي امرأ بأمه أوصي امرأ بأمه أوصي امرأ بأمه - ثلاثا - أوصي امرأ بأبيه أوصي امرءا بمولاه الذي يليه وإن كان عليه منه أذى يؤذيه ‏\"‏ ‏.‏",
      "text_en": " Ibn Salamah As-Sulami narrated that the Prophet (ﷺ) said:                      \"I enjoin each one to honor his mother,I enjoin each one to honor his mother,I enjoin each one to honor his mother(three times), I enjoin each one to honor his guardian who is taking care of him, even if he is causing him some annoyance.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11067"
      ]
    },
    {
      "id": "sunan-ibn-majah-3746-2",
      "hadith_no": "3746",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، عن شريك، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that the Messenger of Allah(ﷺ) said:                     \"One who is consulted is entrusted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20380",
        "20587",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "id": "sunan-ibn-majah-3764-2",
      "hadith_no": "3764",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك، عن محمد بن عمرو، عن أبي سلمة بن عبد الرحمن، عن عائشة، أن النبي  صلى الله عليه وسلم  نظر إلى إنسان يتبع طائرا فقال ‏\"‏ شيطان يتبع شيطانا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet(ﷺ) looked at a man who was chasing a bird and said:                     \"A devil chasing a devil.\"",
      "usc_msa_ref": "",
      "chain": [
        "30467",
        "20587",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-4076",
      "hadith_no": "4076",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شريك، عن أبي إسحاق، عن محمد بن سعد، عن سعد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa’d that the Messenger of Allah (ﷺ) said:                     “Verbally abusing a Muslim is Fusuq (disobedience) and fightinghimis Kufr.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20587",
        "11049",
        "30008",
        "9"
      ]
    }
  ],
  "total_hadiths": 208
}