{
  "id": "20583",
  "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
  "full_name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": [
        "80 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "158",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  4  -  صدوق ]"
    ],
    "tags": [
      "B.Taym",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15694",
      "name": "Abu al-Mukhtar al-Ta'iy Qyl أبو المختار الطائي قيل",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20433",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن مسلم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "31310",
      "name": "Slym bin 'Isa al-Mqra'a Mwla سليم بن عيسى",
      "grade": "3rd Century AH"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20351",
      "name": "Qabaysa bin 'Uqba bin Muhammad قبيصة بن عقبة بن محمد بن سفيان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "56",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن حمزة الزيات، قال سمع مرة الهمداني، من الحارث شيئا فقال له اقعد بالباب ‏.‏ قال فدخل مرة وأخذ سيفه - قال - وأحس الحارث بالشر فذهب ‏.‏",
      "text_en": "",
      "chain": [
        "30367",
        "20028",
        "20583"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا حمزة الزيات، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن - أو فاعلهن - ثلاث وثلاثون تسبيحة وثلاث وثلاثون تحميدة وأربع وثلاثون تكبيرة في دبر كل صلاة ‏\"‏ ‏.‏  حدثني محمد بن حاتم، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم، بهذا الإسناد مثله ‏.‏",
      "text_en": " Ka'b b. 'Ujra reported Allah's Messenger (may peace be upon him) as saying:                      There are certain ejaculations, the repeaters of which or the performers of which at the end of every prayer will never be caused disappointment:\" Glory be to Allah\" thirty-three times,\" Praise be to Allah\" thirty-three times, and\" Allah is most Great\" thirty-four times.",
      "chain": [
        "30395",
        "20355",
        "20583",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1941",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا الوليد بن عقبة، حدثنا حمزة الزيات، عن حبيب بن أبي ثابت، عن عطاء، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يقدم ضعفاء أهله بغلس ويأمرهم يعني لا يرمون الجمرة حتى تطلع الشمس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) used to send ahead the weak members of his family in darkness (to Mina), and command them not to throw pebbles at jamrahs until the sun rose.",
      "chain": [
        "30203",
        "20583",
        "11331",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3984",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، عن حمزة الزيات، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم إذا دعا بدأ بنفسه وقال ‏\"‏ رحمة الله علينا وعلى موسى لو صبر لرأى من صاحبه العجب ولكنه قال ‏{‏ إن سألتك عن شىء بعدها فلا تصاحبني قد بلغت من لدني ‏}‏ ‏\"‏ ‏.‏ طولها حمزة ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     :When the Messenger of Allah (ﷺ) prayed, he began with himself and said: May the mercy of Allah be upon us and upon Moses. If he had patience, he would have seen marvels from his Companion. But he said: \"(Moses) said: If ever I ask thee about anything after this, keep me not in they company: then wouldst thou have received (full) excuse from my side\". Hamzah lengthened it.",
      "chain": [
        "30309",
        "20347",
        "20583",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "2717",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن فضيل، عن حمزة الزيات، عن زياد الطائي، عن أبي هريرة، قال قلنا يا رسول الله ما لنا إذا كنا عندك رقت قلوبنا وزهدنا في الدنيا وكنا من أهل الآخرة فإذا خرجنا من عندك فآنسنا أهالينا وشممنا أولادنا أنكرنا أنفسنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو أنكم تكونون إذا خرجتم من عندي كنتم على حالكم ذلك لزارتكم الملائكة في بيوتكم ولو لم تذنبوا لجاء الله بخلق جديد كى يذنبوا فيغفر لهم ‏\"‏ ‏.‏ قال قلت يا رسول الله مم خلق الخلق قال ‏\"‏ من الماء ‏\"‏ ‏.‏ قلنا الجنة ما بناؤها قال ‏\"‏ لبنة من فضة ولبنة من ذهب وملاطها المسك الأذفر وحصباؤها اللؤلؤ والياقوت وتربتها الزعفران من يدخلها ينعم ولا يبأس ويخلد ولا يموت لا تبلى ثيابهم ولا يفنى شبابهم ‏\"‏ ‏.‏ ثم قال ‏\"‏ ثلاثة لا ترد دعوتهم الإمام العادل والصائم حين يفطر ودعوة المظلوم يرفعها فوق الغمام وتفتح لها أبواب السماء ويقول الرب عز وجل وعزتي لأنصرنك ولو بعد حين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بذاك القوي وليس هو عندي بمتصل وقد روي هذا الحديث بإسناد آخر عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"We said: 'O Messenger of Allah! What is wrong with us that when we are with you our hearts are softened and we feel free of desire for this world, and we are of the people of the Hereafter. But when we depart from you and socialize with our families and our children, we do not recognize ourselves(i.e., we are changed persons)?' So the Messenger of Allah (s.a.w) said: 'If you were to be in that condition  when you depart from me, the angels would have surely visited you in your houses. And if you did not sin, Allah would surely have brought  anew creation that they may sin, so that then He may forgive them.'\"He said: \"I said: 'O Messenger of Allah! From what was the creation created?' He said: 'From water.' We said: 'Paradise, what is it constructed of?' He said,'Bricks of silver and bricks of gold. Its mortar is musk of a strong fragrance, and its pebbles are pearls and rubies, and its earth is saffron. Whoever enters it shall live and shall not suffer, and shall feel joy and shall not die, nor shall their clothes wear out, nor shall their youth come to an end.' Then he said: 'Three persons , their supplication is not rejected: The just ruler, the fasting person when he breaks his fast, and the supplication of the wronged person. It is raised up above the clouds, and the gates of Heaven are opened up for it, and the Lord, Blessed and Exalted says: I shall surely come to your aid, even if after a time.'\"",
      "chain": [
        "30216",
        "20356",
        "20583",
        "13"
      ]
    },
    {
      "hadith_no": "3153",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، قال سمعت حمزة الزيات، عن أبي المختار الطائي، عن ابن أخي الحارث الأعور، عن الحارث، قال مررت في المسجد فإذا الناس يخوضون في الأحاديث فدخلت على علي فقلت يا أمير المؤمنين ألا ترى أن الناس قد خاضوا في الأحاديث ‏.‏ قال وقد فعلوها قلت نعم ‏.‏ قال أما إني قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ألا إنها ستكون فتنة ‏\"‏ ‏.‏ فقلت ما المخرج منها يا رسول الله قال ‏\"‏ كتاب الله فيه نبأ ما كان قبلكم وخبر ما بعدكم وحكم ما بينكم هو الفصل ليس بالهزل من تركه من جبار قصمه الله ومن ابتغى الهدى في غيره أضله الله وهو حبل الله المتين وهو الذكر الحكيم وهو الصراط المستقيم هو الذي لا تزيغ به الأهواء ولا تلتبس به الألسنة ولا يشبع منه العلماء ولا يخلق على كثرة الرد ولا تنقضي عجائبه هو الذي لم تنته الجن إذ سمعته حتى قالوا ‏(‏إنا سمعنا قرآنا عجبا * يهدي إلى الرشد ‏)‏ من قال به صدق ومن عمل به أجر ومن حكم به عدل ومن دعا إليه هدي إلى صراط مستقيم ‏\"‏ ‏.‏ خذها إليك يا أعور ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من هذا الوجه وإسناده مجهول ‏.‏ وفي الحارث مقال ‏.‏",
      "text_en": " Narrated Al-Harith Al-A'war:                     \"I passed by the Masjid when the people were absorbed in story-telling. So I entered upon 'Ali and said: 'O Commander of the believers! Do you not see the people are becoming engrossed in story-telling?' He said: 'They have been consumed with it?' I said: \"Yes.' He said: 'As for me, I heard the Messenger of Allah (ﷺ) saying: \"Indeed there comes a Fitnah\" So I said: \"What is the way out from it O Messenger of Allah?\" He said: \"Allah's book. In it is news for what happened before you, and information about what comes after you, and judgement for what happens between you. It is the Criterion (between right and wrong) without jest. Whoever among the oppressive abandons it, Allah crushes him, and whoever seeks guidance from other than it, then Allah leaves him to stray. It is the firm rope of Allah, it is the wise remembrance, it is the straight path, and it is the one that the desires can not distort, nor can the tongues twist it, nor can the scholars ever have enough of it, and it shall not become dull from reciting it much, and the amazement of it does not diminish. It is the one that when the Jinns hear it, they did not hesitate to say about it: 'Verily, we have heard a wonderful Recitation (this Qur'an)! 'It guides to the Right Path, and we have believed therein.' Whoever speaks according to it then he has said the truth, and whoever acts according to it he is rewarded, and whoever judges by it he has judged justly, and whoever invites to it then he guides to the straight path.\" Take this O A'war!'.\"",
      "chain": [
        "30553",
        "20315",
        "20583",
        "15694"
      ]
    },
    {
      "hadith_no": "3385",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا أبو قطن، عن حمزة الزيات، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان إذا ذكر أحدا فدعا له بدأ بنفسه ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح وأبو قطن اسمه عمرو بن الهيثم ‏.‏",
      "text_en": " Ibn Abbas narrated from Ubayy bin Ka’b that, :                     whenever the Messenger of Allah would mention someone and supplicate for him, he would begin with himself.",
      "chain": [
        "20563",
        "20583",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "3480",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن حمزة الزيات، عن حبيب بن أبي ثابت، عن عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم عافني في جسدي وعافني في بصري واجعله الوارث مني لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم والحمد لله رب العالمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال سمعت محمدا يقول حبيب بن أبي ثابت لم يسمع من عروة بن الزبير شيئا وحبيب بن أبي ثابت هو حبيب بن قيس بن دينار وقد أدرك عمر وابن عباس والله أعلم ‏.‏",
      "text_en": " Aishah narrated that the Messenger of Allah used to say:                     “O Allah, grant me health in my body, and grant me health in my sight, and make it the inheritor from me, there is none has the right to be worshipped but Allah, the Forbearing, the Generous, Glory is to Allah, the Lord of the Magnificent Throne, and all praise is due to Allah, the Lord of all that exists (Allahumma Afini Fi Jasadi, Wa Afani Fi Basari, Waj’alhul-Waritha Minni, La Ilaha Illallah, Al-Halimul-Karim. Subhan Allah,  Rabbil-Arshil-Azim, Wal-Hamdulillah, Rabbil-Alamin)”",
      "chain": [
        "30216",
        "20609",
        "20583",
        "11331",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3238",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن حفص الأبلي، حدثنا يحيى بن يمان، عن حمزة بن حبيب الزيات، عن حمران بن أعين، عن أبي الطفيل، عن أبي سعيد، قال حج النبي  صلى الله عليه وسلم  وأصحابه مشاة من المدينة إلى مكة وقال ‏\"‏ اربطوا أوساطكم بأزركم ‏\"‏ ‏.‏ ومشى خلط الهرولة ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Prophet (ﷺ) and hisCompanions performed Hajj walking from Al-Madinah to Makkah. He said:‘Tie your lower garments around your waists,’ and he alternatedbetween walking and jogging.”",
      "chain": [
        "20617",
        "20583",
        "15108",
        "3660",
        "38"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا الحسين بن علي، عن حمزة الزيات، عن أبي إسحاق، عن الأغر أبي مسلم، أنه شهد على أبي هريرة وأبي سعيد أنهما شهدا على رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا قال العبد لا إله إلا الله والله أكبر ‏.‏ قال يقول الله عز وجل صدق عبدي لا إله إلا أنا وأنا أكبر ‏.‏ وإذا قال العبد لا إله إلا الله وحده ‏.‏ قال صدق عبدي لا إله إلا أنا وحدي ‏.‏ وإذا قال لا إله إلا الله لا شريك له ‏.‏ قال صدق عبدي لا إله إلا أنا ولا شريك لي ‏.‏ وإذا قال لا إله إلا الله له الملك وله الحمد ‏.‏ قال صدق عبدي لا إله إلا أنا لي الملك ولي الحمد ‏.‏ وإذا قال لا إله إلا الله ولا حول ولا قوة إلا بالله ‏.‏ قال صدق عبدي لا إله إلا أنا ولا حول ولا قوة إلا بي ‏\"‏ ‏.‏ قال أبو إسحاق ثم قال الأغر شيئا لم أفهمه ‏.‏ قال فقلت لأبي جعفر ما قال فقال من رزقهن عند موته لم تمسه النار ‏.‏",
      "text_en": " It was narrated from Abu Hurairah and Abu Saeed bore witness that the Messenger of Allah(ﷺ) said:                     \"If a person says: 'La ilaha illallahu wa Allahu Akbar (None has the right to be worshipped but Allah and Allah is the Most Great),'Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, and I am the Most Great.' If a person says: La ilaha Illallah wahdahu (There is none worthy of worship except Allah alone), Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, alone.' If he says, La ilaha illallahu la sharikalahu (There is none worthy of worship except Allah with no partner or associate),' Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, with no partner or associate.' If he says: 'La illah illallah, lahul mulku wa lahul hamdu (There is none worthy of worship except Allah, all dominion is His and all praise is to Him),' Allah says: 'My slave has spoken the truth; there is none of worthy of worship except I, all dominion Mine and all praise is due to Me.' If he says: ' La illaha illallah, la hawla wa la quwwata illa billah (There is none worthy of worship and there is no power and no strength except with Allah),' Allah says: 'My slave has spoken then truth; there is none worthy of worship except I, and tehre is no power and no strength except with Me.' One of the narrators Abu Ishaq said: \"Then Agharr (another narrator) said something that I did not understand. I said to Abu Jafar: 'What did he say?' He said: 'Whoever is blessed with (the ability to say) them (these words) at the time of death, the Fire will not touch him.'\"",
      "chain": [
        "20436",
        "20315",
        "20583",
        "11049"
      ]
    }
  ],
  "total_hadiths": 10
}