{
  "id": "20588",
  "name": "Suh'aib bin Safwan bin al-Rabi' شعيب بن صفوان بن الربيع",
  "full_name": "Suh'aib bin Safwan bin al-Rabi' شعيب بن صفوان بن الربيع",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  تم  س  -  مقبول ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19886",
      "name": "Yonus bin Khbab يونس بن خباب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "36527",
      "name": "Isma'il bin Ibrahim al-Tarjumani إسماعيل بن إبراهيم أبو إبراهيم الترجماني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-2186",
      "hadith_no": "2186",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر، أخبرنا شعيب بن صفوان أبو يحيى، عن عبد الملك بن، عمير عن أبي بردة بن أبي موسى، عن أبي موسى، قال لما أصيب عمر أقبل صهيب من منزله حتى دخل على عمر فقام بحياله يبكي فقال عمر علام تبكي أعلى تبكي قال إي والله لعليك أبكي يا أمير المؤمنين ‏.‏ قال والله لقد علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبكى عليه يعذب ‏\"‏ ‏.‏ قال فذكرت ذلك لموسى بن طلحة فقال كانت عائشة تقول إنما كان أولئك اليهود ‏.‏",
      "text_en": " Abu Musa reported that when 'Umar was wounded, there came Suhaib from his house and went to 'Umar and stood by his side, and began to wail. Upon this 'Umar said:                      What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (may peace be upon him) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20588",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-7555",
      "hadith_no": "7555",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا علي بن حجر، حدثنا شعيب بن صفوان، عن عبد الملك بن عمير، عن ربعي، بن حراش عن عقبة بن عمرو أبي مسعود الأنصاري، قال انطلقت معه إلى حذيفة بن اليمان فقال له عقبة حدثني ما سمعت من رسول الله صلى الله عليه وسلم في الدجال ‏.‏ قال ‏\"‏ إن الدجال يخرج وإن معه ماء ونارا فأما الذي يراه الناس ماء فنار تحرق وأما الذي يراه الناس نارا فماء بارد عذب فمن أدرك ذلك منكم فليقع في الذي يراه نارا فإنه ماء عذب طيب ‏\"‏ ‏.‏   فقال عقبة وأنا قد، سمعته تصديقا، لحذيفة ‏.‏",
      "text_en": " 'Uqba b. 'Amr Abu Mas'ud al-Ansari reported:                      I went to Hudhaifa b. Yaman and said to him: Narrate what you have heard from Allah's Messenger (may peace be upon him) pertaining to the Dajjal. He said that the Dajjal would appear and there would be along with him water ant fire and what the people would see as water that would be fire and that would burn and what would appear as fire that would be water and any one of you who would see that should plunge in that which he sees as fire for it would be sweet, pure water, and 'Uqba said: I also heard it, testifying Hudhaifa.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20588",
        "11368",
        "11334"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3488",
      "hadith_no": "3488",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، حدثنا شعيب بن صفوان، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20588",
        "11368",
        "579",
        "13"
      ]
    }
  ],
  "total_hadiths": 3
}