{
  "id": "20587",
  "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
  "full_name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Khurasan"
    },
    "death": {
      "date_hijri": "178",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Wasit",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خت  م  4  -  صدوق يخطئ ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Nakha'i",
      "Judge",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "35070",
      "name": "'Abdur Rahman bin Sharayk عبد الرحمن بن شريك بن عبد الله",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18002",
      "name": "Ibrahim bin Jryr bin Abd إبراهيم بن جرير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10763",
      "name": "Rakayn bin al-Rabi' bin 'Amila ركين بن الربيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10758",
      "name": "Rashid bin Kaysan al-Absi راشد بن كيسان العبسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10778",
      "name": "'Asim bin Kulayb bin Shahab عاصم بن كليب بن شهاب بن المجنون",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10830",
      "name": "al-Mqdam bin Shryh bin Han'i المقدام بن شريح بن هانئ بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11379",
      "name": "'Ammara bin al-Q'aqa' bin Shabrma عمارة بن القعقاع بن شبرمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10802",
      "name": "'Ammar bin Mua'wiya bin Aslam al-Dahni عمار بن معاوية الدهني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20384",
      "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20630",
      "name": "Ishaq bin 'Isa bin Njyh إسحاق بن عيسى بن نجيح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20357",
      "name": "Malik bin Isma'il, Abu Ghasan al-Nahdi مالك بن إسماعيل أبو غسان النهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30269",
      "name": "Muhammad bin al-Sabah محمد بن الصباح البزاز الدولابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35130",
      "name": "Muhammad bin al-Tfyl bin Malik محمد بن الطفيل بن مالك النخعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35125",
      "name": "Muhammad bin Sulaiman bin Habib محمد بن سليمان بن حبيب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35070",
      "name": "'Abdur Rahman bin Sharayk عبد الرحمن بن شريك بن عبد الله",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "708",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا خالد بن مخلد، قال حدثنا سليمان بن بلال، قال حدثنا شريك بن عبد الله، قال سمعت أنس بن مالك، يقول ما صليت وراء إمام قط أخف صلاة ولا أتم من النبي صلى الله عليه وسلم، وإن كان ليسمع بكاء الصبي فيخفف مخافة أن تفتن أمه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I never prayed behind any Imam a prayer lighter and more perfect than that behind the Prophet and he used to cut short the prayer whenever he heard the cries of a child lest he should put the child's mother to trial.",
      "chain": [
        "30463",
        "20160",
        "20587",
        "19"
      ]
    },
    {
      "hadith_no": "1014",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا إسماعيل بن جعفر، عن شريك، عن أنس بن مالك، أن رجلا، دخل المسجد يوم جمعة من باب كان نحو دار القضاء، ورسول الله صلى الله عليه وسلم قائم يخطب، فاستقبل رسول الله صلى الله عليه وسلم قائما ثم قال يا رسول الله هلكت الأموال وانقطعت السبل، فادع الله يغيثنا فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم أغثنا، اللهم أغثنا، اللهم أغثنا ‏\"‏‏.‏ قال أنس ولا والله ما نرى في السماء من سحاب، ولا قزعة، وما بيننا وبين سلع من بيت ولا دار‏.‏ قال فطلعت من ورائه سحابة مثل الترس، فلما توسطت السماء انتشرت ثم أمطرت، فلا والله ما رأينا الشمس ستا، ثم دخل رجل من ذلك الباب في الجمعة ورسول الله صلى الله عليه وسلم قائم يخطب، فاستقبله قائما فقال يا رسول الله هلكت الأموال وانقطعت السبل، فادع الله يمسكها عنا‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم حوالينا ولا علينا، اللهم على الآكام والظراب وبطون الأودية ومنابت الشجر ‏\"‏‏.‏ قال فأقلعت وخرجنا نمشي في الشمس‏.‏ قال شريك سألت أنس بن مالك أهو الرجل الأول فقال ما أدري‏.‏",
      "text_en": " Narrated Sharik:                     Anas bin Malik said, \"A person entered the Mosque on a Friday through the gate facing the Daril- Qada' and Allah's Apostle was standing delivering the Khutba (sermon). The man stood in front of Allah's Apostle and said, 'O Allah's Apostle, livestock are dying and the roads are cut off; please pray to Allah for rain.' So Allah's Apostle (p.b.u.h) raised both his hands and said, 'O Allah! Bless us with rain. O Allah! Bless us with rain. O Allah! Bless us with rain!\" Anas added, \"By Allah, there were no clouds in the sky and there was no house or building between us and the mountain of Sila'. Then a big cloud like a shield appeared from behind it (i.e. Silas Mountain) and when it came in the middle of the sky, it spread and then rained. By Allah! We could not see the sun for a week. The next Friday, a person entered through the same gate and Allah's Apostle was delivering the Friday Khutba and the man stood in front of him and said, 'O Allah's Apostle! The livestock are dying and the roads are cut off; Please pray to Allah to withhold rain.' \" Anas added, \"Allah's Apostle raised both his hands and said, 'O Allah! Round about us and not on us. O Allah!' On the plateaus, on the mountains, on the hills, in the valleys and on the places where trees grow.' \" Anas added, \"The rain stopped and we came out, walking in the sun.\" Sharik asked Anas whether it was the same person who had asked for rain the previous Friday. Anas replied that he did not know.",
      "chain": [
        "30367",
        "20155",
        "20587",
        "19"
      ]
    },
    {
      "hadith_no": "1016",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن شريك بن عبد الله، عن أنس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال هلكت المواشي وتقطعت السبل‏.‏ فدعا، فمطرنا من الجمعة إلى الجمعة، ثم جاء فقال تهدمت البيوت وتقطعت السبل، وهلكت المواشي فادع الله يمسكها‏.‏ فقام صلى الله عليه وسلم فقال ‏\"‏ اللهم على الآكام والظراب والأودية ومنابت الشجر ‏\"‏‏.‏ فانجابت عن المدينة انجياب الثوب‏.‏",
      "text_en": " Narrated Anas:                     A man came to the Prophet (p.b.u.h) and said, \"Livestock are destroyed and the roads are cut off.\" So Allah's Apostle invoked Allah for rain and it rained from that Friday till the next Friday. The same person came again and said, \"Houses have collapsed, roads are cut off, and the livestock are destroyed. Please pray to Allah to withhold the rain.\" Allah's Apostle (stood up and) said, \"O Allah! (Let it rain) on the plateaus, on the hills, in the valleys and over the places where trees grow.\" So the clouds cleared away from Medina as clothes are taken off .",
      "chain": [
        "20164",
        "20001",
        "20587",
        "19"
      ]
    },
    {
      "hadith_no": "7186",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، عن شريك بن عبد الله، عن سعيد بن المسيب، عن أبي موسى الأشعري، قال خرج النبي صلى الله عليه وسلم إلى حائط من حوائط المدينة لحاجته، وخرجت في إثره، فلما دخل الحائط جلست على بابه وقلت لأكونن اليوم بواب النبي صلى الله عليه وسلم ولم يأمرني فذهب النبي صلى الله عليه وسلم وقضى حاجته، وجلس على قف البئر، فكشف عن ساقيه ودلاهما في البئر، فجاء أبو بكر يستأذن عليه ليدخل فقلت كما أنت حتى أستأذن لك، فوقف فجئت إلى النبي صلى الله عليه وسلم فقلت يا نبي الله أبو بكر يستأذن عليك‏.‏ قال ‏\"‏ ائذن له، وبشره بالجنة ‏\"‏‏.‏ فدخل فجاء عن يمين النبي صلى الله عليه وسلم فكشف عن ساقيه ودلاهما في البئر، فجاء عمر فقلت كما أنت حتى أستأذن لك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ائذن له، وبشره بالجنة ‏\"‏‏.‏ فجاء عن يسار النبي صلى الله عليه وسلم فكشف عن ساقيه فدلاهما في البئر، فامتلأ القف فلم يكن فيه مجلس، ثم جاء عثمان فقلت كما أنت حتى أستأذن لك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ائذن له، وبشره بالجنة، معها بلاء يصيبه ‏\"‏‏.‏ فدخل فلم يجد معهم مجلسا، فتحول حتى جاء مقابلهم على شفة البئر، فكشف عن ساقيه ثم دلاهما في البئر‏.‏ فجعلت أتمنى أخا لي وأدعو الله أن يأتي‏.‏ قال ابن المسيب فتأولت ذلك قبورهم اجتمعت ها هنا وانفرد عثمان‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet went out to one of the gardens of Medina for some business and I went out to follow him. When he entered the garden, I sat at its gate and said to myself, \"To day I will be the gatekeeper of the Prophet though he has not ordered me.\" The Prophet went and finished his need and went to sit on the constructed edge of the well and uncovered his legs and hung them in the well. In the meantime Abu Bakr came and asked permission to enter. I said (to him), \"Wait till I get you permission.\" Abu Bakr waited outside and I went to the Prophet and said, \"O Allah's Prophet! Abu Bakr asks your permission to enter.\" He said, \"Admit him, and give him the glad tidings of entering Paradise.\" So Abu Bakr entered and sat on the right side of the Prophet and uncovered his legs and hung them in the well. Then `Umar came and I said (to him), \"Wait till I get you permission.\" The Prophet said, \"Admit him and give him the glad tidings of entering Paradise.\" So `Umar entered and sat on the left side of the Prophet and uncovered his legs and hung them in the well so that one side of the well became fully occupied and there remained no place for any-one to sit. Then `Uthman came and I said (to him), \"Wait till I get permission for you.\" The Prophet said, \"Admit him and give him the glad tidings of entering Paradise with a calamity which will befall him.\" When he entered, he could not find any place to sit with them so he went to the other edge of the well opposite them and uncovered his legs and hung them in the well. I wished that a brother of mine would come, so I invoked Allah for his coming. (Ibn Al-Musaiyab said, \"I interpreted that (narration) as indicating their graves. The first three are together and the grave of `Uthman is separate from theirs.\")",
      "chain": [
        "30232",
        "20173",
        "20587",
        "11002",
        "41"
      ]
    },
    {
      "hadith_no": "7611",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني سليمان، عن شريك بن عبد الله، أنه قال سمعت ابن مالك، يقول ليلة أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام، فقال أولهم أيهم هو فقال أوسطهم هو خيرهم‏.‏ فقال آخرهم خذوا خيرهم‏.‏ فكانت تلك الليلة، فلم يرهم حتى أتوه ليلة أخرى فيما يرى قلبه، وتنام عينه ولا ينام قلبه وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم، فلم يكلموه حتى احتملوه فوضعوه عند بئر زمزم فتولاه منهم جبريل فشق جبريل ما بين نحره إلى لبته حتى فرغ من صدره وجوفه، فغسله من ماء زمزم بيده، حتى أنقى جوفه، ثم أتي بطست من ذهب فيه تور من ذهب محشوا إيمانا وحكمة، فحشا به صدره ولغاديده  يعني عروق حلقه  ثم أطبقه ثم عرج به إلى السماء الدنيا فضرب بابا من أبوابها فناداه أهل السماء من هذا فقال جبريل‏.‏ قالوا ومن معك قال معي محمد‏.‏ قال وقد بعث قال نعم‏.‏ قالوا فمرحبا به وأهلا‏.‏ فيستبشر به أهل السماء، لا يعلم أهل السماء بما يريد الله به في الأرض حتى يعلمهم، فوجد في السماء الدنيا آدم فقال له جبريل هذا أبوك فسلم عليه‏.‏ فسلم عليه ورد عليه آدم وقال مرحبا وأهلا بابني، نعم الابن أنت‏.‏ فإذا هو في السماء الدنيا بنهرين يطردان فقال ما هذان النهران يا جبريل قال هذا النيل والفرات عنصرهما‏.‏ ثم مضى به في السماء فإذا هو بنهر آخر عليه قصر من لؤلؤ وزبرجد فضرب يده فإذا هو مسك قال ما هذا يا جبريل قال هذا الكوثر الذي خبأ لك ربك‏.‏ ثم عرج إلى السماء الثانية فقالت الملائكة له مثل ما قالت له الأولى من هذا قال جبريل‏.‏ قالوا ومن معك قال محمد صلى الله عليه وسلم‏.‏ قالوا وقد بعث إليه قال نعم‏.‏ قالوا مرحبا به وأهلا‏.‏ ثم عرج به إلى السماء الثالثة وقالوا له مثل ما قالت الأولى والثانية، ثم عرج به إلى الرابعة فقالوا له مثل ذلك، ثم عرج به إلى السماء الخامسة فقالوا مثل ذلك، ثم عرج به إلى السماء السادسة فقالوا له مثل ذلك، ثم عرج به إلى السماء السابعة فقالوا له مثل ذلك، كل سماء فيها أنبياء قد سماهم فأوعيت منهم إدريس في الثانية، وهارون في الرابعة، وآخر في الخامسة لم أحفظ اسمه، وإبراهيم في السادسة، وموسى في السابعة بتفضيل كلام الله، فقال موسى رب لم أظن أن يرفع على أحد‏.‏ ثم علا به فوق ذلك بما لا يعلمه إلا الله، حتى جاء سدرة المنتهى ودنا الجبار رب العزة فتدلى حتى كان منه قاب قوسين أو أدنى فأوحى الله فيما أوحى إليه خمسين صلاة على أمتك كل يوم وليلة‏.‏ ثم هبط حتى بلغ موسى فاحتبسه موسى فقال يا محمد ماذا عهد إليك ربك قال عهد إلى خمسين صلاة كل يوم وليلة‏.‏ قال إن أمتك لا تستطيع ذلك فارجع فليخفف عنك ربك وعنهم‏.‏ فالتفت النبي صلى الله عليه وسلم إلى جبريل كأنه يستشيره في ذلك، فأشار إليه جبريل أن نعم إن شئت‏.‏ فعلا به إلى الجبار فقال وهو مكانه يا رب خفف عنا، فإن أمتي لا تستطيع هذا‏.‏ فوضع عنه عشر صلوات ثم رجع إلى موسى فاحتبسه، فلم يزل يردده موسى إلى ربه حتى صارت إلى خمس صلوات، ثم احتبسه موسى عند الخمس فقال يا محمد والله لقد راودت بني إسرائيل قومي على أدنى من هذا فضعفوا فتركوه فأمتك أضعف أجسادا وقلوبا وأبدانا وأبصارا وأسماعا، فارجع فليخفف عنك ربك، كل ذلك يلتفت النبي صلى الله عليه وسلم إلى جبريل ليشير عليه ولا يكره ذلك جبريل، فرفعه عند الخامسة فقال يا رب إن أمتي ضعفاء أجسادهم وقلوبهم وأسماعهم وأبدانهم فخفف عنا فقال الجبار يا محمد‏.‏ قال لبيك وسعديك‏.‏ قال إنه لا يبدل القول لدى، كما فرضت عليك في أم الكتاب  قال  فكل حسنة بعشر أمثالها، فهى خمسون في أم الكتاب وهى خمس عليك‏.‏ فرجع إلى موسى فقال كيف فعلت فقال خفف عنا أعطانا بكل حسنة عشر أمثالها‏.‏ قال موسى قد والله راودت بني إسرائيل على أدنى من ذلك فتركوه، ارجع إلى ربك فليخفف عنك أيضا‏.‏ قال رسول الله صلى الله عليه وسلم يا موسى قد والله استحييت من ربي مما اختلفت إليه‏.‏ قال فاهبط باسم الله‏.‏ قال واستيقظ وهو في مسجد الحرام‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The night Allah's Apostle was taken for a journey from the sacred mosque (of Mecca) Al-Ka`ba: Three persons came to him (in a dreamy while he was sleeping in the Sacred Mosque before the Divine Inspiration was revealed to Him. One of them said, \"Which of them is he?\" The middle (second) angel said, \"He is the best of them.\" The last (third) angle said, \"Take the best of them.\" Only that much happened on that night and he did not see them till they came on another night, i.e. after The Divine Inspiration was revealed to him. (Fath-ul-Bari Page 258, Vol. 17) and he saw them, his eyes were asleep but his heart was not----and so is the case with the prophets: their eyes sleep while their hearts do not sleep. So those angels did not talk to him till they carried him and placed him beside the well of Zamzam. From among them Gabriel took charge of him. Gabriel cut open (the part of his body) between his throat and the middle of his chest (heart) and took all the material out of his chest and `Abdomen and then washed it with Zamzam water with his own hands till he cleansed the inside of his body, and then a gold tray containing a gold bowl full of belief and wisdom was brought and then Gabriel stuffed his chest and throat blood vessels with it and then closed it (the chest). He then ascended with him to the heaven of the world and knocked on one of its doors. The dwellers of the Heaven asked, 'Who is it?' He said, \"Gabriel.\" They said, \"Who is accompanying you?\" He said, \"Muhammad.\" They said, \"Has he been called?\" He said, \"Yes\" They said, \"He is welcomed.\" So the dwellers of the Heaven became pleased with his arrival, and they did not know what Allah would do to the Prophet on earth unless Allah informed them. The Prophet met Adam over the nearest Heaven. Gabriel said to the Prophet, \"He is your father; greet him.\" The Prophet greeted him and Adam returned his greeting and said, \"Welcome, O my Son! O what a good son you are!\" Behold, he saw two flowing rivers, while he was in the nearest sky. He asked, \"What are these two rivers, O Gabriel?\" Gabriel said, \"These are the sources of the Nile and the Euphrates.\" Then Gabriel took him around that Heaven and behold, he saw another river at the bank of which there was a palace built of pearls and emerald. He put his hand into the river and found its mud like musk Adhfar. He asked, \"What is this, O Gabriel?\" Gabriel said, \"This is the Kauthar which your Lord has kept for you.\" Then Gabriel ascended (with him) to the second Heaven and the angels asked the same questions as those on the first Heaven, i.e., \"Who is it?\" Gabriel replied, \"Gabriel\". They asked, \"Who is accompanying you?\" He said, \"Muhammad.\" They asked, \"Has he been sent for?\" He said, \"Yes.\" Then they said, \"He is welcomed.'' Then he (Gabriel) ascended with the Prophet to the third Heaven, and the angels said the same as the angels of the first and the second Heavens had said. Then he ascended with him to the fourth Heaven and they said the same; and then he ascended with him to the fifth Heaven and they said the same; and then he ascended with him to the sixth Heaven and they said the same; then he ascended with him to the seventh Heaven and they said the same. On each Heaven there were prophets whose names he had mentioned and of whom I remember Idris on the second Heaven, Aaron on the fourth Heavens another prophet whose name I don't remember, on the fifth Heaven, Abraham on the sixth Heaven, and Moses on the seventh Heaven because of his privilege of talking to Allah directly. Moses said (to Allah), \"O Lord! I thought that none would be raised up above me.\" But Gabriel ascended with him (the Prophet) for a distance above that, the distance of which only Allah knows, till he reached the Lote Tree (beyond which none may pass) and then the Irresistible, the Lord of Honor and Majesty approached and came closer till he (Gabriel) was about two bow lengths or (even) nearer. (It is said that it was Gabriel who approached and came closer to the Prophet. (Fate Al-Bari Page 263, 264, Vol. 17). Among the things which Allah revealed to him then, was: \"Fifty prayers were enjoined on his followers in a day and a night.\" Then the Prophet descended till he met Moses, and then Moses stopped him and asked, \"O Muhammad ! What did your Lord en join upon you?\" The Prophet replied,\" He enjoined upon me to perform fifty prayers in a day and a night.\" Moses said, \"Your followers cannot do that; Go back so that your Lord may reduce it for you and for them.\" So the Prophet turned to Gabriel as if he wanted to consult him about that issue. Gabriel told him of his opinion, saying, \"Yes, if you wish.\" So Gabriel ascended with him to the Irresistible and said while he was in his place, \"O Lord, please lighten our burden as my followers cannot do that.\" So Allah deducted for him ten prayers where upon he returned to Moses who stopped him again and kept on sending him back to his Lord till the enjoined prayers were reduced to only five prayers. Then Moses stopped him when the prayers had been reduced to five and said, \"O Muhammad! By Allah, I tried to persuade my nation, Bani Israel to do less than this, but they could not do it and gave it up. However, your followers are weaker in body, heart, sight and hearing, so return to your Lord so that He may lighten your burden.\" The Prophet turned towards Gabriel for advice and Gabriel did not disapprove of that. So he ascended with him for the fifth time. The Prophet said, \"O Lord, my followers are weak in their bodies, hearts, hearing and constitution, so lighten our burden.\" On that the Irresistible said, \"O Muhammad!\" the Prophet replied, \"Labbaik and Sa`daik.\" Allah said, \"The Word that comes from Me does not change, so it will be as I enjoined on you in the Mother of the Book.\" Allah added, \"Every good deed will be rewarded as ten times so it is fifty (prayers) in the Mother of the Book (in reward) but you are to perform only five (in practice).\" The Prophet returned to Moses who asked, \"What have you done?\" He said, \"He has lightened our burden: He has given us for every good deed a tenfold reward.\" Moses said, \"By Allah! I tried to make Bani Israel observe less than that, but they gave it up. So go back to your Lord that He may lighten your burden further.\" Allah's Apostle said, \"O Moses! By Allah, I feel shy of returning too many times to my Lord.\" On that Gabriel said, \"Descend in Allah's Name.\" The Prophet then woke while he was in the Sacred Mosque (at Mecca).",
      "chain": [
        "30105",
        "20160",
        "20587"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، وابن، عيينة ح وحدثني زهير بن حرب، حدثنا ابن عيينة، عن زياد بن علاقة، عن قطبة بن مالك، سمع النبي صلى الله عليه وسلم يقرأ في الفجر ‏{‏ والنخل باسقات لها طلع نضيد‏}‏",
      "text_en": " Qutba b. Malik reported that he had heard the Messenger of Allah (may peace be upon him) reciting in the morning prayer this:                     \" And the tall palm trees having flower spikes piled one above another\" (l. 10).",
      "chain": [
        "30201",
        "20587",
        "20005",
        "30022",
        "20005",
        "11339"
      ]
    },
    {
      "hadith_no": "3376",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن حكيم الأودي، أخبرنا شريك، عن عمار الدهني، عن أبي الزبير، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم دخل يوم فتح مكة وعليه عمامة سوداء ‏.‏",
      "text_en": "  Jabir b. Abdullah reported that Allah's Apostle (may peace be upon him) entered on the day of Victory of Mecca wearing a black turban on his head.",
      "chain": [
        "30471",
        "20587",
        "10802",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4041",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا الثقفي، عن أيوب، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم جميعا عن وكيع، عن سفيان، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن جريج، ح وحدثني علي بن حجر، حدثنا الفضل بن موسى، عن شريك، عن شعبة، كلهم عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Ibn Abbas (Allah be pleased with them).",
      "chain": [
        "30421",
        "11015",
        "30201",
        "30123",
        "20032",
        "20012",
        "30490",
        "20023",
        "11070",
        "20387",
        "20452",
        "20587",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "5958",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا  شريك بن عبد الله، وهشيم بن بشير، عن يعلى بن عطاء، عن عمرو بن الشريد، عن أبيه، قال كان في وفد ثقيف رجل مجذوم فأرسل إليه النبي صلى الله عليه وسلم ‏\"‏ إنا قد بايعناك فارجع ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Sharid reported on the authority of his father that there was in the delegation of Thaqif a leper. Allah's Apostle (may peace be upon him) sent a message to him:                      We have accepted your allegiance, so you may go.",
      "chain": [
        "30399",
        "20468",
        "30201",
        "20587",
        "20468",
        "10986",
        "10952"
      ]
    },
    {
      "hadith_no": "6025",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثني أبو جعفر، محمد بن الصباح وعلي بن حجر السعدي جميعا عن شريك، قال ابن حجر أخبرنا شريك، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، عن  النبي صلى الله عليه وسلم قال ‏\"‏ أشعر كلمة تكلمت بها العرب كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest word spoken by an Arab (pre-Islamic) in poetry is this verse of Labid:\" Behold! apart from Allah everything is vain.\"",
      "chain": [
        "20587",
        "11858",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6666",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن عمارة، وابن، شبرمة عن أبي، زرعة عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث جرير وزاد فقال ‏\"‏ نعم وأبيك لتنبأن ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      A person came to Allah's Apostle (may peace be upon him). The rest of the hadith is the same as transmitted by jarir but with this addition: By your father, you would get the information.",
      "chain": [
        "30201",
        "20587",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا أسود بن عامر، حدثنا شريك، وهذا، لفظه ح وحدثنا محمد بن عبد الله، - يعني المخرمي - حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن المغيرة، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا أتى الخلاء أتيته بماء في تور أو ركوة فاستنجى ‏.‏ قال أبو داود في حديث وكيع ثم مسح يده على الأرض ثم أتيته بإناء آخر فتوضأ ‏.‏ قال أبو داود وحديث الأسود بن عامر أتم ‏.‏",
      "text_en": " Narrated Abu Hurayrah :                     When the Prophet (sal Allaahu alayhi wa sallam ) went to the privy, I took to him water in a small vessel  or a skin, and he cleansed himself. He then wiped his hand on the ground. I then took to him another vessel  and he performed ablution.Abu Dawud said : The tradition is transmitted by al-Aswad b. 'Amir is more perfect.",
      "chain": [
        "38072",
        "20380",
        "20587",
        "30271",
        "20032",
        "11858",
        "18002",
        "166",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "84",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، وسليمان بن داود العتكي، قالا حدثنا شريك، عن أبي فزارة، عن أبي زيد، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال له ليلة الجن ‏\"‏ ما في إداوتك ‏\"‏ ‏.‏ قال نبيذ ‏.‏ قال ‏\"‏ تمرة طيبة وماء طهور ‏\"‏ ‏.‏ قال أبو داود وقال سليمان بن داود عن أبي زيد أو زيد كذا قال شريك ولم يذكر هناد ليلة الجن ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     AbuZayd quoted Abdullah ibn Mas'ud as saying that on the night when the jinn listened to the Qur'an the Prophet (ﷺ) said: What is in your skin vessel? He said: I have some nabidh. He (the Holy Prophet) said: It consists of fresh dates and pure water. Sulayman ibn Dawud reported the same version of this tradition on the authority of AbuZayd or Zayd. But Sharik said that Hammad did not mention the words \"night of the jinn\".",
      "chain": [
        "30480",
        "30584",
        "20587",
        "16"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا شريك، عن عمرو بن عامر البجلي، - قال محمد هو أبو أسد بن عمرو - قال سألت أنس بن مالك عن الوضوء، فقال كان النبي صلى الله عليه وسلم يتوضأ لكل صلاة وكنا نصلي الصلوات بوضوء واحد ‏.‏",
      "text_en": " Abu Asad b. ‘Amr said:                      I asked Anas b. Malik about ablution. He replied: The Prophet (ﷺ) performed ablution for each prayer and we offered (many) prayers with the same ablution.",
      "chain": [
        "31167",
        "20587",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "204",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد بن السري، وإبراهيم بن أبي معاوية، عن أبي معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثني شريك، وجرير، وابن، إدريس عن الأعمش، عن شقيق، قال قال عبد الله كنا لا نتوضأ من موطئ ولا نكف شعرا ولا ثوبا ‏.‏ قال أبو داود قال إبراهيم بن أبي معاوية فيه عن الأعمش عن شقيق عن مسروق أو حدثه عنه قال قال عبد الله وقال هناد عن شقيق أو حدثه عنه ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We would not wash our feet after treading on something unclean, nor would we hold our hair and garments (during prayer).Abu Dawud said: The tradition has been reported by Ibrahim b. Abi Mu'awiyah through a different chain of narrators: A'mash - Shaqiq - Masruq - 'Abd Allah (b. Mas'ud). And Hannad reported from Shaqiq, or reported on his authority saying: 'Abd Allah (b. Mas'ud) said.",
      "chain": [
        "30480",
        "20354",
        "30203",
        "20587",
        "4057",
        "20102",
        "11060",
        "11353",
        "30002",
        "11060"
      ]
    },
    {
      "hadith_no": "257",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رافع، حدثنا يحيى بن آدم، حدثنا شريك، عن قيس بن وهب، عن رجل، من بني سواءة بن عامر عن عائشة، فيما يفيض بين الرجل والمرأة من الماء قالت كان رسول الله صلى الله عليه وسلم يأخذ كفا من ماء يصب على الماء ثم يأخذ كفا من ماء ثم يصبه عليه ‏.‏",
      "text_en": " On being asked about (washing) the fluid that flows between man and woman ‘A’ishah said:                      The Messenger of Allah (May peace be upon him) used to take a handful of water and pour it on the fluid. Again, he would take a handful of water and pour it over the fluid.",
      "chain": [
        "30375",
        "20364",
        "20587",
        "10815"
      ]
    },
    {
      "hadith_no": "266",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن خصيف، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وقع الرجل بأهله وهي حائض فليتصدق بنصف دينار ‏\"‏ ‏.‏ قال أبو داود وكذا قال علي بن بذيمة عن مقسم عن النبي صلى الله عليه وسلم مرسلا وروى الأوزاعي عن يزيد بن أبي مالك عن عبد الحميد بن عبد الرحمن عن النبي صلى الله عليه وسلم قال ‏\"‏ آمره أن يتصدق بخمسى دينار ‏\"‏ ‏.‏ وهذا معضل ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet (May peace be upon him) as saying; when a man has intercourse with his wife while she is menstruating, he must give half a dinar in alms.Abu Dawud said; ‘Ali b. Budhaimah reported similarly on the authority of Miqsam from the Prophet (May peace be upon him). Al-Awza’I narrated from Yazid b. Abi Malik, from ‘Abd al-Hamid b. ‘Abd al-Rahman from the Prophet (May peace be upon him); He ordered him to give two fifth of a dinar in alms. But this is a chain where two narrators (Miqsam and Ibn ‘Abbas) are missing.",
      "chain": [
        "30269",
        "20587",
        "19908",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "297",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، قال أنبأنا ح، وأخبرنا عثمان بن أبي شيبة، حدثنا شريك، عن أبي اليقظان، عن عدي بن ثابت، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم في المستحاضة ‏\"‏ تدع الصلاة أيام أقرائها ثم تغتسل وتصلي والوضوء عند كل صلاة ‏\"‏ ‏.‏ قال أبو داود زاد عثمان ‏\"‏ وتصوم وتصلي ‏\"‏ ‏.‏",
      "text_en": " Narrated Grandfather of Adi ibn Thabit ?:                     The Prophet (ﷺ) said about the woman having a prolonged flow of blood: She should abandon prayer during her menstrual period: then she should take a bath and pray. She should perform ablution for every prayer.Abu Dawud said: 'Uthman added: She should keep fast and pray.",
      "chain": [
        "20173",
        "30203",
        "20587",
        "11372"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسحاق أبو بكر، - يعني الصاغاني - حدثنا أبو بدر، شجاع بن الوليد حدثنا شريك، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، - قال أبو بدر - أراه قد رفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ إن الحصاة لتناشد الذي يخرجها من المسجد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported (Abu Bakr said that in his opinion he narrated this tradition from the Prophet):                      The gravels adjure the person when removes them from the mosque.",
      "chain": [
        "11107",
        "20328",
        "20587",
        "11371",
        "11161",
        "13",
        "36577"
      ]
    },
    {
      "hadith_no": "728",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي صلى الله عليه وسلم حين افتتح الصلاة رفع يديه حيال أذنيه - قال - ثم أتيتهم فرأيتهم يرفعون أيديهم إلى صدورهم في افتتاح الصلاة وعليهم برانس وأكسية ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I witnessed the Prophet (ﷺ) raise his hands in front of his ears when he began to pray. I then came back and saw them (the people) raising their hands up to their chest when they began to pray. They wore long caps and blankets.",
      "chain": [
        "30203",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن شريك، عن عاصم بن كليب، عن علقمة بن وائل، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم في الشتاء فرأيت أصحابه يرفعون أيديهم في ثيابهم في الصلاة ‏.‏",
      "text_en": " Wa’il b. Hujr said:                      I came to the Prophet(ﷺ) during winter; I saw his companions raise their hands in their clothes in prayer.",
      "chain": [
        "31160",
        "20032",
        "20587",
        "10778",
        "10801",
        "3045"
      ]
    },
    {
      "hadith_no": "750",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن البراء، أن رسول الله صلى الله عليه وسلم كان إذا افتتح الصلاة رفع يديه إلى قريب من أذنيه ثم لا يعود ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     When the Messenger of Allah (ﷺ) began prayer, he raised his hands up to his ears, then he did not repeat.",
      "chain": [
        "30269",
        "20587",
        "10844",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "774",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال عطس شاب من الأنصار خلف رسول الله صلى الله عليه وسلم وهو في الصلاة فقال الحمد لله حمدا كثيرا طيبا مباركا فيه حتى يرضى ربنا وبعد ما يرضى من أمر الدنيا والآخرة فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من القائل الكلمة ‏\"‏ ‏.‏ قال فسكت الشاب ثم قال ‏\"‏ من القائل الكلمة فإنه لم يقل بأسا ‏\"‏ ‏.‏ فقال يا رسول الله أنا قلتها لم أرد بها إلا خيرا ‏.‏ قال ‏\"‏ ما تناهت دون عرش الرحمن تبارك وتعالى ‏\"‏ ‏.‏",
      "text_en": " Rabi’ah said:                      A young man from the Ansar sneezed behind the Messenger of Allah (ﷺ) while he was praying. He then said: Praise be to Allah, much, good, blessed, till our Lord is pleased (with us) in the affairs relating to this world and to the other world. When the Messenger of Allah (ﷺ) finished his prayer, he said: Who was the speaker of these words (in prayer)? The young man kept silence. He again asked: Who was the speaker of these words? He did not say wrong. He said: Messenger of Allah, I said these (words). I did not intend by them but good. He said: These words did not stay below the Throne of the Compassionate (Allah).",
      "chain": [
        "30437",
        "20472",
        "20587",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "hadith_no": "896",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا شريك، عن أبي إسحاق، قال وصف لنا البراء بن عازب فوضع يديه واعتمد على ركبتيه ورفع عجيزته وقال هكذا كان رسول الله صلى الله عليه وسلم يسجد ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     Al-Bara' described to us (the nature of prostration). He placed his hands (palms), reclined on his knees, and raised his hips; he said: This is how the Messenger of Allah (ﷺ) used to prostrate himself.",
      "chain": [
        "30335",
        "20587",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "969",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال كنا لا ندري ما نقول إذا جلسنا في الصلاة وكان رسول الله صلى الله عليه وسلم قد علم فذكر نحوه ‏.‏  قال شريك وحدثنا جامع، - يعني ابن شداد - عن أبي وائل، عن عبد الله، بمثله قال وكان يعلمنا كلمات ولم يكن يعلمناهن كما يعلمنا التشهد ‏\"‏ اللهم ألف بين قلوبنا وأصلح ذات بيننا واهدنا سبل السلام ونجنا من الظلمات إلى النور وجنبنا الفواحش ما ظهر منها وما بطن وبارك لنا في أسماعنا وأبصارنا وقلوبنا وأزواجنا وذرياتنا وتب علينا إنك أنت التواب الرحيم واجعلنا شاكرين لنعمتك مثنين بها قابليها وأتمها علينا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We did not know what we should say when we sat during prayer. The Messenger of Allah (ﷺ) was taught (by Allah). He then narrated the tradition to the same effect. Sharik reported from Jami', from AbuWa'il on the authority of Abdullah ibn Mas'ud something similar.  He said: He used to teach us also some other words, but he did not teach them as he taught us the tashahhud: O Allah, join our hearts, mend our social relationship, guide us to the path of peace, bring us from darkness to light, save us from obscenities, outward or inward, and bless our ears, our eyes, our hearts, our wives, our children, and relent toward us; Thou art the Relenting, the Merciful. And make us grateful for Thy blessing and make us praise it while accepting it and give it to us in full.",
      "chain": [
        "20411",
        "20587",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "996",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، ح وحدثنا أحمد بن يونس، حدثنا زائدة، ح وحدثنا مسدد، حدثنا أبو الأحوص، ح وحدثنا محمد بن عبيد المحاربي، وزياد بن أيوب، قالا حدثنا عمر بن عبيد الطنافسي، ح وحدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، ح وحدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا إسرائيل، كلهم عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، وقال، إسرائيل عن أبي الأحوص، والأسود، عن عبد الله، أن النبي صلى الله عليه وسلم كان يسلم عن يمينه وعن شماله حتى يرى بياض خده ‏\"‏ السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ حديث سفيان وحديث إسرائيل لم يفسره ‏.‏ قال أبو داود ورواه زهير عن أبي إسحاق ويحيى بن آدم عن إسرائيل عن أبي إسحاق عن عبد الرحمن بن الأسود عن أبيه وعلقمة عن عبد الله ‏.‏ قال أبو داود شعبة كان ينكر هذا الحديث - حديث أبي إسحاق - أن يكون مرفوعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) used to give the salutation to his left and right sides until the whiteness of his cheek was seen, (saying: \"Peace be upon you, and mercy of Allah\" twice.  AbuDawud said: This is a version of the tradition reported by AbuSufyan. The version of Isra'il did not explain it. AbuDawud said: This tradition has been narrated by Zubayr from AbuIshaq and Yahya ibn Adam from Isra'il from AbuIshaq from AbdurRahman ibn al-Aswad from his father from Alqamah on the authority of Abdullah ibn Mas'ud. AbuDawud said: Shu'bah used to reject this tradition, the tradition narrated by AbuIshaq as coming from the Prophet (ﷺ).",
      "chain": [
        "28531",
        "20012",
        "30184",
        "20320",
        "30175",
        "20327",
        "35135",
        "30249",
        "20346",
        "20411",
        "20587"
      ]
    },
    {
      "hadith_no": "1232",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبي، حدثنا شريك، عن ابن الأصبهاني، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام بمكة سبع عشرة يصلي ركعتين ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) stayed in Mecca seventeen days and prayed two rak'ahs (at each time of prayer).",
      "chain": [
        "30395",
        "20264",
        "20587",
        "11364",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1245",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، عن خصيف، بإسناده ومعناه ‏.‏ قال فكبر نبي الله صلى الله عليه وسلم وكبر الصفان جميعا ‏.‏ قال أبو داود رواه الثوري بهذا المعنى عن خصيف وصلى عبد الرحمن بن سمرة هكذا إلا أن الطائفة التي صلى بهم ركعة ثم سلم مضوا إلى مقام أصحابهم وجاء هؤلاء فصلوا لأنفسهم ركعة ثم رجعوا إلى مقام أولئك فصلوا لأنفسهم ركعة ‏.‏ قال أبو داود حدثنا بذلك مسلم بن إبراهيم حدثنا عبد الصمد بن حبيب قال أخبرني أبي أنهم غزوا مع عبد الرحمن بن سمرة كابل فصلى بنا صلاة الخوف ‏.‏",
      "text_en": " This tradition has been transmitted by Kushaif with a different chain of narrators and to the same effect. This version adds:                      The Prophet of Allah (ﷺ) uttered takbir and both rows uttered takbir together.Abu Dawud said: This tradition has been narrated by al-Thawri to the same effect on the authority of Khusaif. 'Abd al-Rahman b. Samurah also prayed in like manner. But the section which he (the Prophet) led in one rak'ah and then uttered the salutation and went and took the place of their companions. They came and prayed one rak'ah by themselves. Then they returned to their place and they prayed (one rak'ah) by themselves.Abu Dawud said: Muslim b. Ibrahim reported from 'Abd al-Samad b. Habib on the authority of his father that they had fought a battle at Kabul along with 'Abd al-Rahman b. Samurah. He led us in prayer in time of danger.",
      "chain": [
        "20411",
        "20587"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن عثمان بن أبي زرعة، عن أبي ليلى الكندي، عن سويد بن غفلة، قال أتانا مصدق النبي صلى الله عليه وسلم فأخذت بيده وقرأت في عهده ‏\"‏ لا يجمع بين مفترق ولا يفرق بين مجتمع خشية الصدقة ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ راضع لبن ‏\"‏ ‏.‏",
      "text_en": " Suwaid bin Ghaflah reported The collector of the Prophet (ﷺ) came to us. I caught hold of his hand and read in the document that the goods were not to be combined nor were they to be separated for fear of zakat. There is no mention of milch animals in this tradition.",
      "chain": [
        "30269",
        "20587",
        "21619",
        "11174"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق بن يوسف، أخبرنا شريك، عن إسماعيل بن أبي خالد، قال سمعت عبد الله بن أبي أوفى، بهذا الحديث زاد ثم أتى الصفا والمروة فسعى بينهما سبعا ثم حلق رأسه ‏.‏",
      "text_en": " Isma’il bin Abi Khalid said I heard ‘Abd Allaah bin Abi Aufa narrated this tradition. His version added “He then came to Al Safa’ and Al Marwah and ran between them seven times and then shaved his head.",
      "chain": [
        "20411",
        "20587",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "1930",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا إسحاق، - يعني ابن يوسف - عن شريك، عن أبي إسحاق، عن سعيد بن جبير، وعبد الله بن مالك، قالا صلينا مع ابن عمر بالمزدلفة المغرب والعشاء بإقامة واحدة فذكر معنى حديث ابن كثير ‏.‏",
      "text_en": " Sa’id bin Jubair and ‘Abd Allah bin Malik said “We offered the sunset and the night prayers at Al Muzdalifah along with ibn ‘Umar with one iqamah.” The narrator then narrated the rest of the tradition as reported by Ibn Kathir.",
      "chain": [
        "31160",
        "20411",
        "20587",
        "11049",
        "11050"
      ]
    },
    {
      "hadith_no": "2128",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن الصباح البزار، حدثنا شريك، عن منصور، عن طلحة، عن خيثمة، عن عائشة، قالت أمرني رسول الله صلى الله عليه وسلم أن أدخل امرأة على زوجها قبل أن يعطيها شيئا ‏.‏ قال أبو داود خيثمة لم يسمع من عائشة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) commanded me to send a woman to her husband before he gave something to her.Abu Dawud said: The narrator Khaithamah did not hear (any tradition) from 'Aishah.",
      "chain": [
        "30269",
        "20587",
        "11067",
        "11356",
        "11332",
        "53"
      ]
    },
    {
      "hadith_no": "2140",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا إسحاق بن يوسف، عن شريك، عن حصين، عن الشعبي، عن قيس بن سعد، قال أتيت الحيرة فرأيتهم يسجدون لمرزبان لهم فقلت رسول الله أحق أن يسجد له قال فأتيت النبي صلى الله عليه وسلم فقلت إني أتيت الحيرة فرأيتهم يسجدون لمرزبان لهم فأنت يا رسول الله أحق أن نسجد لك ‏.‏ قال ‏\"‏ أرأيت لو مررت بقبري أكنت تسجد له ‏\"‏ ‏.‏ قال قلت لا ‏.‏ قال ‏\"‏ فلا تفعلوا لو كنت آمرا أحدا أن يسجد لأحد لأمرت النساء أن يسجدن لأزواجهن لما جعل الله لهم عليهن من الحق ‏\"‏ ‏.‏",
      "text_en": " Narrated Qays ibn Sa'd:                     I went to al-Hirah and saw them (the people) prostrating themselves before a satrap of theirs, so I said: The Messenger of Allah (ﷺ) has most right to have prostration made before him. When I came to the Prophet (ﷺ), I said: I went to al-Hirah and saw them prostrating themselves before a satrap of theirs, but you have most right, Messenger of Allah, to have (people) prostrating themselves before you. He said: Tell me , if you were to pass my grave, would you prostrate yourself before it? I said: No. He then said: Do not do so. If I were to command anyone to make prostration before another I would command women to prostrate themselves before their husbands, because of the special right over them given to husbands by Allah.",
      "chain": [
        "30154",
        "20411",
        "20587",
        "15097",
        "11052",
        "172"
      ]
    },
    {
      "hadith_no": "2149",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، أخبرنا شريك، عن أبي ربيعة الإيادي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم لعلي ‏\"‏ يا علي لا تتبع النظرة النظرة فإن لك الأولى وليست لك الآخرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: to Ali: Do not give a second look, Ali, (because) while you are not to blame for the first, you have no right to the second.",
      "chain": [
        "35016",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2157",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا شريك، عن قيس بن وهب، عن أبي الوداك، عن أبي سعيد الخدري، ورفعه، أنه قال في سبايا أوطاس ‏\"‏ لا توطأ حامل حتى تضع ولا غير ذات حمل حتى تحيض حيضة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id Al Khudri traced to Prophet (ﷺ) the following statement regarding the captives taken at Atwas. There must be no intercourse with pregnant woman till she gives birth to her child or with the one who is not pregnant till she has had one menstrual period.",
      "chain": [
        "30154",
        "20587",
        "10815",
        "10752",
        "38"
      ]
    },
    {
      "hadith_no": "2364",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا شريك، ح وحدثنا مسدد، حدثنا يحيى، عن سفيان، عن عاصم بن عبيد الله، عن عبيد الله بن عامر بن ربيعة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يستاك وهو صائم ‏.‏ زاد مسدد ما لا أعد ولا أحصي ‏.‏",
      "text_en": " Narrated Amir ibn Rabi'ah:                     I have seen the Messenger of Allah (ﷺ) using a tooth-stick while he was fasting. Musaddad added in his version: \"more often than I could count.\"",
      "chain": [
        "30269",
        "20587",
        "30175",
        "20031",
        "20012",
        "19808"
      ]
    },
    {
      "hadith_no": "2478",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا شريك، عن المقدام بن شريح، عن أبيه، قال سألت عائشة - رضى الله عنها - عن البداوة، فقالت كان رسول الله صلى الله عليه وسلم يبدو إلى هذه التلاع وإنه أراد البداوة مرة فأرسل إلى ناقة محرمة من إبل الصدقة فقال لي ‏\"‏ يا عائشة ارفقي فإن الرفق لم يكن في شىء قط إلا زانه ولا نزع من شىء قط إلا شانه ‏\"‏ ‏.‏",
      "text_en": " Miqdan bin Shuraih reported on the authority of his father. I asked A’ishah about settling in the desert (to worship Allaah in loneliness). She said “The Apostle of Allaah(ﷺ) would go out (from Madina) to these torrential streams. Once he intended to go out to the desert (for worshipping Allaah). He sent me a She-Camel from the Camels of sadaqah that was not used as a mount. He said to me “A’ishah be lenient, for leniency makes a thing  decorated and when it is removed from a thing it makes it defective.",
      "chain": [
        "20436",
        "20587",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "2592",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق بن إبراهيم المروزي، - وهو ابن راهويه - حدثنا يحيى بن آدم، حدثنا شريك، عن عمار الدهني، عن أبي الزبير، عن جابر، يرفعه إلى النبي صلى الله عليه وسلم أنه كان لواؤه يوم دخل مكة أبيض ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     When the Prophet (ﷺ) entered Mecca his banner was white.",
      "chain": [
        "30123",
        "20364",
        "20587",
        "10802",
        "11263"
      ]
    },
    {
      "hadith_no": "2790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شريك، عن أبي الحسناء، عن الحكم، عن حنش، قال رأيت عليا يضحي بكبشين فقلت ما هذا فقال إن رسول الله صلى الله عليه وسلم أوصاني أن أضحي عنه فأنا أضحي عنه ‏.‏",
      "text_en": " Narrated Hanash:                     I saw Ali sacrificing two rams; so I asked him: What is this? He replied. The Messenger of Allah (ﷺ) enjoined upon me to sacrifice on his behalf, so that is what I am doing.",
      "chain": [
        "30203",
        "20587",
        "11069",
        "15113"
      ]
    },
    {
      "hadith_no": "2904",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسين بن أسود العجلي، حدثنا يحيى بن آدم، حدثنا شريك، عن جبريل بن أحمر أبي بكر، عن ابن بريدة، عن أبيه، قال مات رجل من خزاعة فأتي النبي صلى الله عليه وسلم بميراثه فقال ‏\"‏ التمسوا له وارثا أو ذا رحم ‏\"‏ ‏.‏ فلم يجدوا له وارثا ولا ذا رحم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعطوه الكبر من خزاعة ‏\"‏ ‏.‏ قال يحيى قد سمعته مرة يقول في هذا الحديث ‏\"‏ انظروا أكبر رجل من خزاعة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A man of Khuza'ah died and his estate was brought to the Prophet (ﷺ). He said: Look for his heir or some relative. But they found neither heir nor relative. The Messenger of Allah (ﷺ) said: Give it to the leading man of Khuza'ah. The narrator Yahya said: Sometimes I heard him (al-Husayn ibn Aswad) say in this tradition: Look for the greatest man of Khuza'ah.",
      "chain": [
        "20364",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3040",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا عبد الرحمن بن هانئ أبو نعيم النخعي، أخبرنا شريك، عن إبراهيم بن مهاجر، عن زياد بن حدير، قال قال علي لئن بقيت لنصارى بني تغلب لأقتلن المقاتلة ولأسبين الذرية فإني كتبت الكتاب بينهم وبين النبي صلى الله عليه وسلم على أن لا ينصروا أبناءهم ‏.‏ قال أبو داود هذا حديث منكر بلغني عن أحمد أنه كان ينكر هذا الحديث إنكارا شديدا وهو عند بعض الناس شبه المتروك وأنكروا هذا الحديث على عبد الرحمن بن هانئ قال أبو علي ولم يقرأه أبو داود في العرضة الثانية ‏.‏",
      "text_en": " ‘Ali said “If I survive for the Christians of Banu Taghlib I shall kill fighters and captivate children for I had written a document between them and the Prophet(ﷺ) to the effect that they would not make their children Christian.Abu Dawud said “This is rejected (munkar) tradition and it has reached me from Ahmad (bin Hanbal) that he used to reject this tradition seriously.Abu ‘Ali said “Abu Dawud did not present this (tradition) in this second reading.”",
      "chain": [
        "30437",
        "20587",
        "10739",
        "18306"
      ]
    },
    {
      "hadith_no": "3285",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا شريك، عن سماك، عن عكرمة، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ والله لأغزون قريشا، والله لأغزون قريشا، والله لأغزون قريشا ‏\"‏ ‏.‏ ثم قال ‏:‏ ‏\"‏ إن شاء الله ‏\"‏ ‏.‏ قال أبو داود ‏:‏ وقد أسند هذا الحديث غير واحد عن شريك عن سماك عن عكرمة عن ابن عباس أسنده عن النبي صلى الله عليه وسلم وقال الوليد بن مسلم عن شريك ‏:‏ ثم لم يغزهم ‏.‏",
      "text_en": " Narrated Ikrimah ibn AbuJahl:                     The Prophet (ﷺ) said: I swear by Allah, I shall fight against the Quraysh; I swear by Allah, I shall fight against the Quraysh; I swear by Allah, I shall fight against the Quraysh. He then said: \"If Allah wills.\"Abu Dawud said: A number of persons have narrated this tradition from Sharik, from Simak, from 'Ikrimah, from Ibn 'Abbas who reported from the Prophet (ﷺ): \"But he did not fight against them.\"",
      "chain": [
        "30367",
        "20587",
        "10770",
        "11023"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا أبو النضر، حدثنا شريك، عن محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، قال ‏:‏ جاء رجل إلى النبي صلى الله عليه وسلم فقال ‏:‏ يا رسول الله إن أختي نذرت - يعني - أن تحج ماشية ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ إن الله لا يصنع بشقاء أختك شيئا، فلتحج راكبة ولتكفر عن يمينها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man came to Prophet (ﷺ) and said: Messenger of Allah, my sister has taken a vow to perform hajj on foot. The Prophet (ﷺ) said: Allah gets no good from the affliction your sister imposed on herself, so let her perform hajj riding and make atonement for her oath.",
      "chain": [
        "20390",
        "20587",
        "10818",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "3344",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وقتيبة بن سعيد، عن شريك، عن سماك، عن عكرمة، رفعه - قال عثمان وحدثنا وكيع، عن شريك، عن سماك، عن عكرمة، - عن ابن عباس، عن النبي صلى الله عليه وسلم مثله قال اشترى من عير تبيعا وليس عنده ثمنه فأربح فيه فباعه فتصدق بالربح على أرامل بني عبد المطلب وقال لا أشتري بعدها شيئا إلا وعندي ثمنه ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Ibn 'Abbas though a different chain of narrators. This version says:                      \"He (the Prophet) purchased a calf from a caravan, but he had no money with him. He then sold it with some profit and gave the profit in charity to the poor and widows of Banu 'Abd al-Muttalib. He then said: I shall not buy anything after this but only when I have money with me.",
      "chain": [
        "30203",
        "30367",
        "20587",
        "10770",
        "4",
        "20032",
        "11858",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3403",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا شريك، عن أبي إسحاق، عن عطاء، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من زرع في أرض قوم بغير إذنهم فليس له من الزرع شىء وله نفقته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     The Prophet (ﷺ) said: If anyone sows in other people's land without their permission, he has no right to any of the crop, but he may have what it cost him.",
      "chain": [
        "30367",
        "20587",
        "11049",
        "11029",
        "1986"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، وأحمد بن إبراهيم، قالا حدثنا طلق بن غنام، عن شريك، - قال ابن العلاء وقيس - عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Pay the deposit to him who deposited it with you, and do not betray him who betrayed you.",
      "chain": [
        "30216",
        "30494",
        "30197",
        "20587",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن عون، قال أخبرنا شريك، عن سماك، عن حنش، عن علي، عليه السلام قال بعثني رسول الله صلى الله عليه وسلم إلى اليمن قاضيا فقلت يا رسول الله ترسلني وأنا حديث السن ولا علم لي بالقضاء فقال ‏\"‏ إن الله سيهدي قلبك ويثبت لسانك فإذا جلس بين يديك الخصمان فلا تقضين حتى تسمع من الآخر كما سمعت من الأول فإنه أحرى أن يتبين لك القضاء ‏\"‏ ‏.‏ قال فما زلت قاضيا أو ما شككت في قضاء بعد ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) sent me to the Yemen as judge, and I asked: Messenger of Allah, are you sending me when I am young and have no knowledge of the duties of a judge? He replied: Allah will guide your heart and keep your tongue true. When two litigants sit in front of you, do not decide till you hear what the other has to say as you heard what the first had to say; for it is best that you should have a clear idea of the best decision. He said: I had been a judge (for long); or he said (the narrator is doubtful): I have no doubts about a decision afterwards.",
      "chain": [
        "30154",
        "20587",
        "10770",
        "15113"
      ]
    },
    {
      "hadith_no": "3889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا سليمان بن داود، حدثنا شريك، ح وحدثنا العباس العنبري، حدثنا يزيد بن هارون، أخبرنا شريك، عن العباس بن ذريح، عن الشعبي، - قال العباس - عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا رقية إلا من عين أو حمة أو دم يرقأ ‏\"‏ ‏.‏ لم يذكر العباس العين وهذا لفظ سليمان بن داود ‏.‏",
      "text_en": " Anas reported the Prophet (ﷺ) as saying :                      No spell is to be used except for the evil eye, or sting of  poisonous insects, or bleeding. The narrator al-‘Abhas did mention the words “evil eye”. The is the version of Sulaiman b. Dawud.",
      "chain": [
        "30584",
        "20587",
        "30437",
        "20472",
        "11858",
        "11052",
        "100",
        "19"
      ]
    },
    {
      "hadith_no": "4465",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن يونس، أن شريكا، وأبا الأحوص، وأبا، بكر بن عياش حدثوهم عن عاصم، عن أبي رزين، عن ابن عباس، قال ليس على الذي يأتي البهيمة حد ‏.‏ قال أبو داود كذا قال عطاء وقال الحكم أرى أن يجلد ولا يبلغ به الحد ‏.‏ وقال الحسن هو بمنزلة الزاني ‏.‏ قال أبو داود حديث عاصم يضعف حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " 'Asim reported from Abu Razin on the authority of Ibn 'Abbas saying:                      There is no prescribed punishment for one who has sexual intercourse with an animal.Abu Dawud said: 'Ata is also so. Al Hakam said: I think he should be flogged, but the number should not reach the one of the prescribed punishment. Al-Hasan said: He is like a fornicator.Abu Dawud said: THe tradition of 'Asim proves the tradition of 'Amr b. Abi 'Amr as weak.",
      "chain": [
        "30184",
        "20587",
        "20327",
        "11080",
        "10826",
        "17",
        "11029"
      ]
    },
    {
      "hadith_no": "4486",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا شريك، عن أبي حصين، عن عمير بن سعيد، عن علي، رضى الله عنه قال لا أدي - أو ما كنت لأدي - من أقمت عليه حدا إلا شارب الخمر فإن رسول الله صلى الله عليه وسلم لم يسن فيه شيئا إنما هو شىء قلناه نحن ‏.‏",
      "text_en": " ’Ali said:                      I shall not pay blood-money or (he said) : I am not going to pay blood-money for him on whom I inflicted the prescribed punishment except for the one who drank wine, for the Messenger of Allah (ﷺ) did not prescribe anything definite. It is a thing which we have decided (by agreement) ourselves.",
      "chain": [
        "35016",
        "20587",
        "11371",
        "11646",
        "5"
      ]
    }
  ],
  "total_hadiths": 208
}