{
  "id": "20598",
  "name": "Fdyl bin Mrzwq al-Aghr al-Rqashy فضيل بن مرزوق الأغر الرقاشي",
  "full_name": "Fdyl bin Mrzwq al-Aghr al-Rqashy فضيل بن مرزوق الأغر الرقاشي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ي  م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15373",
      "name": "Atyh bin Sa'd bin Jnad'h عطية بن سعد بن جنادة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "25322",
      "name": "Maysara bin Habib al-Nahdi ميسرة بن حبيب النهدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10775",
      "name": "Shqyq bin 'Uqba al-Bdy شقيق بن عقبة العبدي الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19461",
      "name": "Jblh bint Msfh جبلة بنت مصفح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38350",
      "name": "Abd al-Ghfar bin al-Hakam عبد الغفار بن الحكم الأموي مولاهم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20315",
      "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25262",
      "name": "Muhammad bin Rabi'ya al-Klaby محمد بن ربيعة الكلابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25330",
      "name": "N'ym bin Mysrh نعيم بن ميسرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2393",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا فضيل بن مرزوق، حدثني عدي بن ثابت، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيها الناس إن الله طيب لا يقبل إلا طيبا وإن الله أمر المؤمنين بما أمر به المرسلين فقال ‏{‏ يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم‏}‏ وقال ‏{‏ يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم‏}‏ ‏\"‏ ‏.‏ ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء يا رب يا رب ومطعمه حرام ومشربه حرام وملبسه حرام وغذي بالحرام فأنى يستجاب لذلك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      0 people, Allah is Good and He therefore, accepts only that which is good. And Allah commanded the believers as He commanded the Messengers by saying:\" O Messengers, eat of the good things, and do good deeds; verily I am aware of what you do\" (xxiii. 51). And He said: ' 0 those who believe, eat of the good things that We gave you\" (ii. 172) He then made a mention of a person who travels widely, his hair dishevelled and covered with dust. He lifts his hand towards the sky (and thus makes the supplication):\" O Lord,0 Lord,\" whereas his diet is unlawful, his drink is unlawful, and his clothes are unlawful and his nourishment is unlawful. How can then his supplication be accepted?",
      "chain": [
        "30216",
        "20318",
        "20598",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3978",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا فضيل بن مرزوق، عن عطية بن سعد العوفي، قال قرأت على عبد الله بن عمر ‏{‏ الله الذي خلقكم من ضعف ‏}‏ فقال ‏{‏ من ضعف ‏}‏ قرأتها على رسول الله صلى الله عليه وسلم كما قرأتها على فأخذ على كما أخذت عليك ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Atiyyah ibn Sa'd al-Awfi said: I recited to Abdullah ibn Umar the verse: \"It is Allah Who created you in a state of (helplessness) weakness (min da'f).\"  He said: (Read) min du'f. I recited it to the Messenger of Allah (ﷺ) as you recited it to me, and he gripped me as I gripped you.",
      "chain": [
        "30352",
        "20321",
        "20598",
        "15373"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا محمد بن ربيعة، عن فضيل بن مرزوق، عن عطية العوفي، عن أبي سعيد الخدري، قال كان نبي الله صلى الله عليه وسلم يصلي الضحى حتى نقول لا يدع ويدعها حتى نقول لا يصلي ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated:                     \"The Prophet would pray Ad-Duha until we would say: 'He will not leave it.' And he would leave it until we would say: 'He will not pray it.'\"",
      "chain": [
        "30249",
        "25262",
        "20598",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "1329",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن المنذر الكوفي، حدثنا محمد بن فضيل، عن فضيل بن مرزوق، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحب الناس إلى الله يوم القيامة وأدناهم منه مجلسا إمام عادل وأبغض الناس إلى الله وأبعدهم منه مجلسا إمام جائر ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن أبي أوفى ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Sa'eed narrated that the Messenger of Allah (ﷺ) said:                      \"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam.\"",
      "chain": [
        "20356",
        "20598",
        "38"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن فضيل بن مرزوق، عن عطية، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أول زمرة يدخلون الجنة يوم القيامة ضوء وجوههم على مثل ضوء القمر ليلة البدر والزمرة الثانية على مثل أحسن كوكب دري في السماء لكل رجل منهم زوجتان على كل زوجة سبعون حلة يرى مخ ساقها من ورائها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Prophet (s.a.w) said:                     \"Indeed the first batch to enter Paradise will appear like the moon of a night that is full. The second will appear like the color of the most beautiful (brightest) star in the sky. Each man among them shall have two wives, each wife wearing seventy bracelets, with the marrow of their shins being visible from behind them.\"",
      "chain": [
        "35047",
        "20598",
        "38"
      ]
    },
    {
      "hadith_no": "2756",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن فضيل بن مرزوق، عن عطية، عن أبي سعيد، يرفعه قال ‏\"‏ إذا كان يوم القيامة أتي بالموت كالكبش الأملح فيوقف بين الجنة والنار فيذبح وهم ينظرون فلو أن أحدا مات فرحا لمات أهل الجنة ولو أن أحدا مات حزنا لمات أهل النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Attiyah narrated from Abu Sa'eed in Marfu' form:                     \"When it is the Day of Resurrection, Death shall be brought as a mixed black-white ram. It shall be stood between Paradise and the Fire, and then slaughtered while they watch. If anyone were to die of joy, then surely the people of Paradise and the Fire, and then slaughtered while they watch. If anyone were to die of joy, then surely the people of Paradise would die, and if anyone were to die of grief, then surely the people of the Fire would die.\"",
      "chain": [
        "35047",
        "20598"
      ]
    },
    {
      "hadith_no": "3187",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا نعيم بن ميسرة النحوي، عن فضيل بن مرزوق، عن عطية العوفي، عن ابن عمر، أنه قرأ على النبي صلى الله عليه وسلم ‏(‏خلقكم من ضعف ‏)‏ فقال من ضعف ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that he recited the following to the Prophet (ﷺ): \"Who created you in the weakness (Min Da'f)\" So he said: \"Min Du'f\"",
      "chain": [
        "38495",
        "25330",
        "20598",
        "15373",
        "18"
      ]
    },
    {
      "hadith_no": "3188",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يزيد بن هارون، عن فضيل بن مرزوق، عن عطية، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث فضيل بن مرزوق ‏.‏",
      "text_en": "",
      "chain": [
        "30553",
        "20472",
        "20598",
        "18"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا أبو نعيم، حدثنا فضيل بن مرزوق، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أيها الناس إن الله طيب ولا يقبل إلا طيبا وإن الله أمر المؤمنين بما أمر به المرسلين فقال ‏:‏ ‏(‏يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم ‏)‏ وقال أيها الذين آمنوا كلوا من طيبات ما رزقناكم ‏)‏ ‏\"‏ ‏.‏ قال وذكر الرجل يطيل السفر أشعث أغبر يمد يده إلى السماء يا رب يا رب ومطعمه حرام ومشربه حرام وملبسه حرام وغذي بالحرام فأنى يستجاب لذلك ‏.‏ قال أبو عيسى هذا حديث حسن غريب وإنما نعرفه من حديث فضيل بن مرزوق وأبو حازم هو الأشجعي اسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"O you people! Indeed Allah is Tayyib (good) and he does not accept but what is good. And indeed Allah ordered the believers with what He ordered the Messengers. He (ﷺ) said: 'O you Messengers! Eat of the good things and do righteous deeds. Verily I am well acquainted with what you do (23:51).' And He said: 'O you who believe! Eat from the good things We have provided you (2:172).' He said: \"And he mentioned a man: 'Who is undertaking a long journey, whose hair is dishevelled and he is covered with dust. He raises his hands to the heavens and says: \"O Lord! O Lord!\" Yet his food is from the unlawful, his drink is from the unlawful, his clothing is from the unlawful, and he was nourished by the unlawful. So how can that be accepted?'\"",
      "chain": [
        "30553",
        "20348",
        "20598",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4151",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، عن فضيل بن مرزوق، عن عدي بن ثابت، عن البراء، أن النبي صلى الله عليه وسلم أبصر حسنا وحسينا فقال ‏\"‏ اللهم إني أحبهما فأحبهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Bara:                     that the Prophet (ﷺ) saw Hasan and Husain, so he said: \"O Allah, I love them, so love them.\"",
      "chain": [
        "30277",
        "20318",
        "20598",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "619",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا ابن فضيل، جميعا عن فضيل بن مرزوق، عن عطية، عن أبي سعيد، أن رجلا، سأله عن الغسل، من الجنابة فقال ثلاثا ‏.‏ فقال الرجل إن شعري كثير ‏.‏ فقال رسول الله  صلى الله عليه وسلم  كان أكثر شعرا منك وأطيب ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     A man asked him about having a bath to cleanse oneself from sexual impurity. He said to pour water three times. The man said: \"But I have a lot of hair.\" He said: \"The Messenger of Allah had more hair than you and he was cleaner.\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "30216",
        "20356",
        "20598",
        "38"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن سعيد بن يزيد بن إبراهيم التستري، حدثنا الفضل بن الموفق أبو الجهم، حدثنا فضيل بن مرزوق، عن عطية، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من خرج من بيته إلى الصلاة فقال اللهم إني أسألك بحق السائلين عليك وأسألك بحق ممشاى هذا فإني لم أخرج أشرا ولا بطرا ولا رياء ولا سمعة وخرجت اتقاء سخطك وابتغاء مرضاتك فأسألك أن تعيذني من النار وأن تغفر لي ذنوبي إنه لا يغفر الذنوب إلا أنت - أقبل الله عليه بوجهه واستغفر له سبعون ألف ملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah said: 'Whoever leaves his house for the prayer and says: 'Allahumma inni asa'luka bi-haqqis-sa'ilina 'alaika, wa as'aluka bi-haqqi mamshaya hadha, fa inni lam akhruj asharan wa la batran, wa la riya'an, wa la sum'atan, wa kharajtu-ttiqa'a sukhtika wabtigha'a mardatika, fa as'aluka an tu'idhani minan-nari wa an taghfira li dhunubi, Innahu la yaghfirudh-dhunuba illa Anta. (O Allah, I ask You by the right that those who ask of You have over You, and I ask by virtue of this walking of mine, for I am not going out because of pride or vanity, or to show off or make a reputation, rather I am going out because I fear Your wrath and seek Your pleasure. So I ask You to protect me from the Fire and to forgive me my sins, for no one can forgive sins except You),' Allah will turn His Face towards him and seventy thousand angels will pray for his forgiveness.\"",
      "chain": [
        "34204",
        "25235",
        "20598",
        "38"
      ]
    }
  ],
  "total_hadiths": 12
}