{
  "id": "20593",
  "name": "'Ali bin Salah bin Salah علي بن صالح بن صالح بن حي",
  "full_name": "'Ali bin Salah bin Salah علي بن صالح بن صالح بن حي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": [
        "100 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "151",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufa"
    ]
  },
  "parents": [
    {
      "id": "11431",
      "name": "Salah bin Salah bin Hay صالح بن صالح بن حي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11431",
      "name": "Salah bin Salah bin Hay صالح بن صالح بن حي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19866",
      "name": "Hkym bin Jbyr al-Asady حكيم بن جبير",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "25322",
      "name": "Maysara bin Habib al-Nahdi ميسرة بن حبيب النهدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "25198",
      "name": "'Ali bin Qadim al-Khuza'i علي بن قادم الخزاعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20609",
      "name": "Mua'wiya bin Hisham al-Qsar معاوية بن هشام القصار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28220",
      "name": "Salmah bin 'Abdul Malik سلمة بن عبد الملك العوصي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30463",
      "name": "Khalid bin Mukhallad al-Qatwani خالد بن مخلد القطواني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4195",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن علي بن صالح، عن سلمة بن كهيل، عن أبي، سلمة عن أبي هريرة، قال استقرض رسول الله صلى الله عليه وسلم سنا فأعطى سنا فوقه وقال ‏\"‏ خياركم محاسنكم قضاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      Allah's Messenger (may peace be upon him) took a camel on loan, and then returned him (the lender) the camel of a more mature age and said: Good among you are those who are good in clearing off the debt.",
      "chain": [
        "30216",
        "20032",
        "20593",
        "11350",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "933",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مخلد بن خالد الشعيري، حدثنا ابن نمير، حدثنا علي بن صالح، عن سلمة بن كهيل، عن حجر بن عنبس، عن وائل بن حجر، أنه صلى خلف رسول الله صلى الله عليه وسلم فجهر بآمين وسلم عن يمينه وعن شماله حتى رأيت بياض خده ‏.‏",
      "text_en": " Wail b, hujr said that he prayed behind the Messenger of Allah (ﷺ),and he said Amin loudly and saluted at his right and left sides until I saw the whiteness of his cheek.",
      "chain": [
        "30567",
        "30212",
        "20593",
        "11350",
        "15084",
        "3045"
      ]
    },
    {
      "hadith_no": "4494",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا عبيد الله، - يعني ابن موسى - عن علي بن صالح، عن سماك بن حرب، عن عكرمة، عن ابن عباس، قال كان قريظة والنضير - وكان النضير أشرف من قريظة - فكان إذا قتل رجل من قريظة رجلا من النضير قتل به وإذا قتل رجل من النضير رجلا من قريظة فودي بمائة وسق من تمر فلما بعث النبي صلى الله عليه وسلم قتل رجل من النضير رجلا من قريظة فقالوا ادفعوه إلينا نقتله ‏.‏ فقالوا بيننا وبينكم النبي صلى الله عليه وسلم فأتوه فنزلت ‏{‏ وإن حكمت فاحكم بينهم بالقسط ‏}‏ والقسط النفس بالنفس ثم نزلت ‏{‏ أفحكم الجاهلية يبغون ‏}‏ ‏.‏ قال أبو داود قريظة والنضير جميعا من ولد هارون النبي عليه السلام ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     Qurayzah and Nadir (were two Jewish tribes). An-Nadir were nobler than Qurayzah. When a man of Qurayzah killed a man of an-Nadir, he would be killed. But if a man of an-Nadir killed a man of Qurayzah, a hundred wasq of dates would be paid as blood-money. When Prophethood was bestowed upon the Prophet (ﷺ), a man of an-Nadir killed a man of Qurayzah.  They said: Give him to us, we shall kill him.  They replied: We have the Prophet (ﷺ) between you and us. So they came to him.  Thereupon the following verse was revealed: \"If thou judge, judge in equity between them.\" \"In equity\" means life for a life.  The following verse was then revealed: \"Do they seek of a judgment of (the days) ignorance?\"Abu Dawud said: Quraizah and al-Nadir were the descendants of Harun the Prophet (peace be upon him)",
      "chain": [
        "30216",
        "20340",
        "20593",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1316",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن علي بن صالح، عن سلمة بن كهيل، عن أبي سلمة، عن أبي هريرة، قال استقرض رسول الله صلى الله عليه وسلم سنا فأعطاه سنا خيرا من سنه وقال ‏\"‏ خياركم أحاسنكم قضاء ‏\"‏ ‏.‏ قال وفي الباب عن أبي رافع ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وقد رواه شعبة وسفيان عن سلمة ‏.‏ والعمل على هذا عند بعض أهل العلم لم يروا باستقراض السن بأسا من الإبل ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وكره بعضهم ذلك ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) took a camel of a particular age on loan. He gave back to him a camel of a better age than the one he was given. He said: 'The best among you is the best in repaying.'\"He said: There is something on this topic from Abu Rafi'.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. Shu'bah and Sufyan reported it from Salamah.This is acted upon according to some of the people of knowledge, they saw no harm is taking a camel of a particular age as a loan. This is the view of Ash-Shafi'i, Ahmad, and Ishaq. But some of them disliked that.",
      "chain": [
        "30216",
        "20032",
        "20593",
        "11350",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4086",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يوسف بن موسى القطان البغدادي، حدثنا علي بن قادم، حدثنا علي بن صالح بن حى، عن حكيم بن جبير، عن جميع بن عمير التيمي، عن ابن عمر، قال آخى رسول الله صلى الله عليه وسلم بين أصحابه فجاء علي تدمع عيناه فقال يا رسول الله آخيت بين أصحابك ولم تؤاخ بيني وبين أحد ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أنت أخي في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وفي الباب عن زيد بن أبي أوفى ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) made bonds of brotherhood among his Companions. So 'Ali came crying saying: \"O Messenger of Allah! You have made a bond of brotherhood among your Companions, but you have not made a bond of brotherhood with me and anyone.\" So the Messenger of Allah (ﷺ) said to him: \"I am your brother, in this life and the next.\"",
      "chain": [
        "30224",
        "25198",
        "20593",
        "19866",
        "19864",
        "18"
      ]
    },
    {
      "hadith_no": "309",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا خالد، - يعني ابن مخلد - قال حدثنا علي، - وهو ابن صالح - عن أبي إسحاق، عن عمرو بن ميمون، قال حدثنا عبد الله، في بيت المال قال كان رسول الله صلى الله عليه وسلم يصلي عند البيت وملأ من قريش جلوس وقد نحروا جزورا فقال بعضهم أيكم يأخذ هذا الفرث بدمه ثم يمهله حتى يضع وجهه ساجدا فيضعه - يعني - على ظهره قال عبد الله فانبعث أشقاها فأخذ الفرث فذهب به ثم أمهله فلما خر ساجدا وضعه على ظهره فأخبرت فاطمة بنت رسول الله صلى الله عليه وسلم وهي جارية فجاءت تسعى فأخذته من ظهره فلما فرغ من صلاته قال ‏\"‏ اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاث مرات ‏\"‏ اللهم عليك بأبي جهل بن هشام وشيبة بن ربيعة وعتبة بن ربيعة وعقبة بن أبي معيط ‏\"‏ ‏.‏ حتى عد سبعة من قريش ‏.‏ قال عبد الله فوالذي أنزل عليه الكتاب لقد رأيتهم صرعى يوم بدر في قليب واحد ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                      \"Abdullah told us: 'The Messenger of Allah (ﷺ) was praying at the House (the Ka'bah) and a group of the nobles of Quraish were sitting there. They had just slaughtered a camel and one of them said: \"Which of you will take these stomach contents with the blood and wait until he prostrates, then put them on his back?\" 'Abdullah said: 'The one who was most doomed got up and took the stomach contents, then went and waited until he prostrated himself, and put it on his back. Fatimah, the daughter of the Messenger of Allah (ﷺ), who was a young girl, was told about that, and she came running and took it off his back. When he had finished praying he said: \"O Allah! Punish the Quraish,\" three times, \"O Allah, punish Abu Jahl bin Hisham, Shaibah bin Rabi'ah, 'Utbah bin Rabi'ah, 'Uqbah bin Abi Mu'ait\" until he had listed seven men from Quraish.' 'Abdullah said: 'By the One Who revealed the Book to him, I saw them dead on the day of Badr (their corpses) in a single dry well.'\"",
      "chain": [
        "30185",
        "30463",
        "20593",
        "11049",
        "11382"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا زيد بن أخزم، عن ابن داود، - يعني عبد الله بن داود الخريبي - عن علي بن صالح، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال كأني أنظر إلى بياض خده عن يمينه ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ وعن يساره ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Prophet (ﷺ) said: \"It is as if I can see the whiteness of his cheek, saying to his right: As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah) and to his left: As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah).\" (Sahih",
      "chain": [
        "30136",
        "20593",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "3006",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم الأودي، قال حدثنا خالد بن مخلد، قال حدثنا علي بن صالح، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن سعيد بن جبير، قال كنت مع ابن عباس بعرفات فقال ما لي لا أسمع الناس يلبون قلت يخافون من معاوية ‏.‏ فخرج ابن عباس من فسطاطه فقال لبيك اللهم لبيك لبيك فإنهم قد تركوا السنة من بغض علي ‏.‏",
      "text_en": " It was narrated that Saeed bin Jubair said:                     \"I was with Ibn Abbas in Arafat and he said: 'Why do I not hear the people reciting Talbiyah?' I said: They are afraid of Muawiyah.' So Ibn Abbas went out of his tent and said: \"Labbaik Allahumma Labbaik, Labbaik! They are only forsaking the Sunnah out of hatred for Ali.'\"",
      "chain": [
        "30185",
        "30463",
        "20593",
        "25322",
        "11656",
        "11050"
      ]
    },
    {
      "hadith_no": "4693",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، عن وكيع، قال حدثني علي بن صالح، عن سلمة بن كهيل، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ خياركم أحسنكم قضاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"The best of you is the one who is best in repaying.\"",
      "chain": [
        "30123",
        "20032",
        "20593",
        "11350",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4732",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا عبيد الله بن موسى، قال أنبأنا علي، - وهو ابن صالح - عن سماك، عن عكرمة، عن ابن عباس، قال كان قريظة والنضير وكان النضير أشرف من قريظة وكان إذا قتل رجل من قريظة رجلا من النضير قتل به وإذا قتل رجل من النضير رجلا من قريظة أدى مائة وسق من تمر فلما بعث النبي صلى الله عليه وسلم قتل رجل من النضير رجلا من قريظة فقالوا ادفعوه إلينا نقتله ‏.‏ فقالوا بيننا وبينكم النبي صلى الله عليه وسلم ‏.‏ فأتوه فنزلت ‏{‏ وإن حكمت فاحكم بينهم بالقسط ‏}‏ والقسط النفس بالنفس ثم نزلت ‏{‏ أفحكم الجاهلية يبغون ‏}‏ ‏.‏",
      "text_en": " It was narrated from Simak, from 'Ikrimah, that Ibn 'Abbas said:                     \"There were (the two tribes of) Quraizah and An-Nadir, and An-Nadir was nobler than Quraiaah. If a man of Quraizah Killed a man of An-Nadir, he would be killed in return, but if a man of An-Nadir killed a man of Quraizah, he would pay a Diyah of one hundred Wasqs of dates.  When An-Nadir killed a man of Quraizah, and they said: 'Hand him over to us and we will kill him.' They said: 'Between us and you (as judge) is the Prophet.' So they came to him, then the following was revealed: \"And if you judge, judge with justice between them.\"[3] Al-Qisl (justice) means a soul for a soul. Then the following was revealed: \"Do they then seek the judgment of (the days of) Ignorance?\"[4]",
      "chain": [
        "30475",
        "20340",
        "20593",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4946",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا عبد الله بن داود، عن علي بن صالح، عن منصور، عن الحكم، عن مجاهد، وعطاء، عن أيمن، قال لم تقطع اليد في عهد رسول الله صلى الله عليه وسلم إلا في ثمن المجن وثمنه يومئذ دينار ‏.‏",
      "text_en": " It was narrated that Ayman said:                     \"The hand of a thief was not be cut off during the time of the Messenger of Allah except for the price of a shield, which in those days was a Dinar.\" (Daif)",
      "chain": [
        "30160",
        "20330",
        "20593",
        "11067",
        "11069",
        "11028",
        "11029"
      ]
    },
    {
      "hadith_no": "2194",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن علي بن صالح، عن أشعث بن أبي الشعثاء، عن معاوية بن سويد بن مقرن، عن البراء بن عازب، قال أمرنا رسول الله  صلى الله عليه وسلم  بإبرار المقسم ‏.‏",
      "text_en": " It was narrated that Bara' bin 'Azib said:                     'The Messenger of Allah (ﷺ) commanded us to help fulfill the oath.\"",
      "chain": [
        "38409",
        "20032",
        "20593",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "3923",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر، حدثنا معاوية بن هشام، حدثنا علي بن صالح، عن سماك، عن قابوس، قال قالت أم الفضل يا رسول الله رأيت كأن في بيتي عضوا من أعضائك قال ‏\"‏ خيرا رأيت تلد فاطمة غلاما فترضعيه ‏\"‏ ‏.‏ فولدت حسينا أو حسنا فأرضعته بلبن قثم قالت فجئت به إلى النبي  صلى الله عليه وسلم  فوضعته في حجره فبال فضربت كتفه فقال النبي  صلى الله عليه وسلم  ‏\"‏ أوجعت ابني رحمك الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Qabus said:                      “Umm Fadl said: ‘O Messenger ofAllah!It is as if I saw (in a dream) one of your limbs in my house.’Hesaid: ‘What you have seen is good. Fatimah will give birth to a boyand you will breastfeed him.’ Fatimah gave birth to Husain orHasan,and I breastfed him with the milk of Qutham.’ She said: ‘Ibrought himto the Prophet (ﷺ) and placed him in his lap, and heurinated, so Istruck him on the shoulder.” The Prophet (ﷺ) said:“You have hurt myson, may Allah have mercy on you.”",
      "chain": [
        "20436",
        "20609",
        "20593",
        "10770",
        "15453"
      ]
    },
    {
      "hadith_no": "4220",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا علي بن صالح، عن يزيد بن أبي زياد، عن إبراهيم، عن علقمة، عن عبد الله، قال بينما نحن عند رسول الله  صلى الله عليه وسلم  إذ أقبل فتية من بني هاشم فلما رآهم النبي  صلى الله عليه وسلم  اغرورقت عيناه وتغير لونه قال فقلت ما نزال نرى في وجهك شيئا نكرهه ‏.‏ فقال ‏\"‏ إنا أهل بيت اختار الله لنا الآخرة على الدنيا وإن أهل بيتي سيلقون بعدي بلاء وتشريدا وتطريدا حتى يأتي قوم من قبل المشرق معهم رايات سود فيسألون الخير فلا يعطونه فيقاتلون فينصرون فيعطون ما سألوا فلا يقبلونه حتى يدفعوها إلى رجل من أهل بيتي فيملؤها قسطا كما ملؤوها جورا فمن أدرك ذلك منكم فليأتهم ولو حبوا على الثلج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"While we were with theMessenger of Allah (ﷺ), some youngsters from Banu Hashim camealong.When the Prophet (ﷺ) saw them, his eyes filled with tearsand hiscolor changed. I said: 'We still see something in your facethat wedo not like (to see).' He said: 'We are members of aHousehold forwhom Allah has chosen the Hereafter over this world.The people of myHousehold will face calamity, expulsion and exileafter I am gone,until some people will come from the east carryingblack banners. Theywill ask for something good but will not be givenit. Then they willfight and will be victorious, then they will begiven what theywanted, but they will not accept it and will giveleadership to a manfrom my family. Then they will fill it withjustice just as it wasfilled with injustice. Whoever among you livesto see that, let him goto them even if he has to crawl over snow.'\"",
      "chain": [
        "30203",
        "20609",
        "20593",
        "10844",
        "11051",
        "11017",
        "16"
      ]
    }
  ],
  "total_hadiths": 14
}