{
  "id": "20595",
  "name": "'Ammar bin Razayq عمار بن رزيق",
  "full_name": "'Ammar bin Razayq عمار بن رزيق",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "159",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  س  ق  -  لا بأس به ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Dabi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11361",
      "name": "'Abdullah bin 'Isa bin 'Abdur Rahman عبد الله بن عيسى بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20578",
      "name": "al-Ahwas bin Jawab الأحوص بن جواب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20329",
      "name": "Abthr bin al-Qasim al-Zbydy Abu عبثر بن القاسم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20609",
      "name": "Mua'wiya bin Hisham al-Qsar معاوية بن هشام القصار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-358",
      "hadith_no": "358",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، ح وحدثني محمد بن عمرو بن جبلة بن أبي رواد، وأبو بكر بن إسحاق قالا حدثنا أبو الجواب، عن عمار بن رزيق، كلاهما عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " The same hadith has been transmitted by Muhammad b. 'Amr, Abu Baker b. Ishaq, Abu'l-Jawwab, A'mash and Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "20020",
        "30452",
        "11108",
        "20578",
        "20595",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1763",
      "hadith_no": "1763",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا يحيى بن آدم، حدثنا عمار بن رزيق، عن أبي إسحاق، عن الأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل حتى يكون آخر صلاته الوتر ‏.‏",
      "text_en": " Masruq is reported to have asked 'A'isha about the action (most pleasing to) the Messenger of Allah (may peace be upon him). She said:                      He (the Holy Prophet) loved (that action) which one keeps on doing regularly. I said (to 'A'isha): When did he pray (at night)? She replied: When he heard the cock crow, he got up and observed prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20364",
        "20595",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1913",
      "hadith_no": "1913",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا حسن بن الربيع، وأحمد بن جواس الحنفي، قالا حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما جبريل قاعد عند النبي صلى الله عليه وسلم سمع نقيضا من فوقه فرفع رأسه فقال هذا باب من السماء فتح اليوم لم يفتح قط إلا اليوم فنزل منه ملك فقال هذا ملك نزل إلى الأرض لم ينزل قط إلا اليوم فسلم وقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لن تقرأ بحرف منهما إلا أعطيته ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid reported:                      I met Abu Mas'ud near the House (Ka'ba) and said to him: A hadith has been conveyed to me on your authority about the two (concluding verses of Surah al-Baqara. He said: Yes. The Messenger of Allah (may peace be upon him) (in fact) said: Anyone who recites the two verses at the end of Surah al-Baqara at night, they would suffice for him.",
      "usc_msa_ref": "",
      "chain": [
        "30461",
        "20327",
        "20595",
        "11361",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3782",
      "hadith_no": "3782",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا عمار بن، رزيق عن أبي إسحاق، عن الشعبي، عن فاطمة بنت قيس، قالت طلقني زوجي ثلاثا فأردت النقلة فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ انتقلي إلى بيت ابن عمك عمرو بن أم مكتوم فاعتدي عنده ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported:                      My husband divorced me with three pronouncements. I decided to move (from his house to another place). So I came to Allah's Messenger (may peace be upon him), and he said: Move to the house of your cousin 'Amr b. Umm Maktum and spend your period of 'Idda there.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20364",
        "20595",
        "11049",
        "11052",
        "224"
      ]
    },
    {
      "id": "sahih-muslim-3783",
      "hadith_no": "3783",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه محمد بن عمرو بن جبلة، حدثنا أبو أحمد، حدثنا عمار بن رزيق، عن أبي إسحاق، قال كنت مع الأسود بن يزيد جالسا في المسجد الأعظم ومعنا الشعبي فحدث الشعبي بحديث فاطمة بنت قيس أن رسول الله صلى الله عليه وسلم لم يجعل لها سكنى ولا نفقة ثم أخذ الأسود كفا من حصى فحصبه به ‏.‏ فقال ويلك تحدث بمثل هذا قال عمر لا نترك كتاب الله وسنة نبينا صلى الله عليه وسلم لقول امرأة لا ندري لعلها حفظت أو نسيت لها السكنى والنفقة قال الله عز وجل ‏{‏ لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة‏}‏ ‏.‏",
      "text_en": " Abu Ishaq reported:                      I was with al-Aswad b. Yazid sitting in the great mosque, and there was with us al-Sha'bi, and he narrated the narration of Fatima bint Qais (Allah be pleased with her) that Allah's Messenger (may peace be upon him) did not make any provision for lodging and maintenance allowance for her. Al-Aswad caught hold of some pebbles in his fist and he threw them towards him saying: Woe be to thee, you narrate like it, whereas Umar said: We cannot abandon the Book of Allah and the Sunnah of our Apostle (may peace be upon him) for the words of a woman. We do not know whether she remembers that or she forgets. For her, there is a provision of lodging and maintenance allowance. Allah, the Exalted and Majestic, said:\" Turn them not from their houses nor should they themselves go forth unless they commit an open indecency\" (lxv. 1).",
      "usc_msa_ref": "",
      "chain": [
        "38562",
        "20355",
        "20595",
        "11049"
      ]
    },
    {
      "id": "sahih-muslim-4008",
      "hadith_no": "4008",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا أبو الجواب، حدثنا عمار بن رزيق، عن الأعمش، بهذا الإسناد غير أنه قال ‏\"‏ فليزرعها أو فليزرعها رجلا ‏\"‏ ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of A'mash with the same chain of transmitters, but with a slight change of words.",
      "usc_msa_ref": "",
      "chain": [
        "20578",
        "20595"
      ]
    },
    {
      "id": "sahih-muslim-4240",
      "hadith_no": "4240",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، حدثنا يحيى، - يعني ابن آدم - حدثنا عمار، - وهو ابن رزيق - عن أبي إسحاق، عن البراء، بمثله غير أنه قال آخر سورة أنزلت كاملة ‏.‏",
      "text_en": " Aba Ishaq reported this hadith on the authority of al-Bara' (Allah be pleased with him) with a slight variation of words, viz. the last sura that was revealed complete.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20364",
        "20595",
        "11049"
      ]
    },
    {
      "id": "sahih-muslim-5431",
      "hadith_no": "5431",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة بن أبي رواد، حدثنا أبو الجواب، حدثنا عمار، - وهو ابن رزيق - عن الأعمش، عن أبي سفيان، عن جابر، ح",
      "text_en": " This hadith has been transmitted on the authority of Jabir also.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20578",
        "20595",
        "11060",
        "116"
      ]
    },
    {
      "id": "sahih-muslim-7287",
      "hadith_no": "7287",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا ابن المثنى، وابن، بشار قالا حدثنا عبد الرحمن، - يعنيان ابن مهدي - عن سفيان، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، عن عمار بن رزيق، كلاهما عن منصور، بإسناد جرير ‏.‏ مثل حديثه غير أن في حديث سفيان ‏\"‏ وقد وكل به قرينه من الجن وقرينه من الملائكة ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mansiir with the same chain of transmitters but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20005",
        "30201",
        "20364",
        "20595"
      ]
    },
    {
      "id": "sunan-abi-daud-1911",
      "hadith_no": "1911",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا زهير بن حرب، حدثنا الأحوص بن جواب الضبي، حدثنا عمار بن رزيق، عن سليمان الأعمش، عن الحكم، عن مقسم، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم الظهر يوم التروية والفجر يوم عرفة بمنى ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) offered the noon prayer on the 8th of Dhul-Hijjah (Yawm at-Tarwiyah) and dawn prayer on the 9th of Dhul-Hijjah (Yawm al-Arafah) in Mina.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20595",
        "11060",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2175",
      "hadith_no": "2175",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، حدثنا عمار بن رزيق، عن عبد الله بن عيسى، عن عكرمة، عن يحيى بن يعمر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من خبب امرأة على زوجها أو عبدا على سيده ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Anyone who incites a woman against her husband or a slave against his master is not one of us.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20595",
        "11361",
        "11023",
        "11316",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2291",
      "hadith_no": "2291",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبو أحمد، حدثنا عمار بن رزيق، عن أبي إسحاق، قال كنت في المسجد الجامع مع الأسود فقال أتت فاطمة بنت قيس عمر بن الخطاب - رضى الله عنه - فقال ما كنا لندع كتاب ربنا وسنة نبينا صلى الله عليه وسلم لقول امرأة لا ندري أحفظت ذلك أم لا ‏.‏",
      "text_en": " Abu Ishaq said “I was with Al Aswad in the congregational mosque. He said “Fathimah daughter of Qais came to ‘Umar bin Al Khattab(may Allaah be pleased with him). (When she narrated the tradition about her divorce) he said “We are not to leave the Book of our Lord and the Sunnah of our Prophet (ﷺ) for the statement of a woman, we do not know whether she remembered it or not.”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20355",
        "20595",
        "11049"
      ]
    },
    {
      "id": "sunan-abi-daud-5052",
      "hadith_no": "5052",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا الأحوص، - يعني ابن جواب - حدثنا عمار بن رزيق، عن أبي إسحاق، عن الحارث، وأبي، ميسرة عن علي، رحمه الله عن رسول الله صلى الله عليه وسلم أنه كان يقول عند مضجعه ‏\"‏ اللهم إني أعوذ بوجهك الكريم وكلماتك التامة من شر ما أنت آخذ بناصيته اللهم أنت تكشف المغرم والمأثم اللهم لا يهزم جندك ولا يخلف وعدك ولا ينفع ذا الجد منك الجد سبحانك وبحمدك ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) used to say when he lay down: O Allah, I seek refuge in Thy noble Person and in Thy perfect Words from the evil of what Thou seizest by its forelock; O Allah! Thou removest debt and sin; O Allah! thy troop's not routed, Thy promise is not broken and the riches of the rich do not avail against Thee. Glory and praise be unto  Thee!.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20595",
        "11049",
        "11644"
      ]
    },
    {
      "id": "sunan-abi-daud-5170",
      "hadith_no": "5170",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، عن عمار بن رزيق، عن عبد الله بن عيسى، عن عكرمة، عن يحيى بن يعمر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خبب زوجة امرئ أو مملوكه فليس منا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone corrupts (instigates) the wife of a man or his slave (against him), he is not from us.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20595",
        "11361",
        "11023",
        "11316",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-136",
      "hadith_no": "136",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا العباس بن محمد الدوري، قال حدثنا الأحوص بن جواب، حدثنا عمار بن رزيق، عن منصور، ح وأنبأنا أحمد بن حرب، قال حدثنا قاسم، - وهو ابن يزيد الجرمي - قال حدثنا سفيان، قال حدثنا منصور، عن مجاهد، عن الحكم بن سفيان، قال رأيت رسول الله صلى الله عليه وسلم توضأ ونضح فرجه ‏.‏ قال أحمد فنضح فرجه ‏.‏",
      "text_en": " It was narrated that Al-Hakam bin Sufyan said:                      \"I saw the Messenger of Allah (ﷺ) performing Wudu' and sprinkling his private area (with water).\"",
      "usc_msa_ref": "",
      "chain": [
        "20595",
        "11067",
        "38011",
        "20005",
        "11067",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-912",
      "hadith_no": "912",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا يحيى بن آدم، قال حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما رسول الله صلى الله عليه وسلم وعنده جبريل عليه السلام إذ سمع نقيضا فوقه فرفع جبريل عليه السلام بصره إلى السماء فقال هذا باب قد فتح من السماء ما فتح قط ‏.‏ قال فنزل منه ملك فأتى النبي صلى الله عليه وسلم فقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لم تقرأ حرفا منهما إلا أعطيته ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"When Jibril was with the Messenger of Allah (ﷺ), he heard a sound from above like a door opening. Jibril, peace be upon him, looked up toward the sky and said: 'This is a gate in Heaven that has been opened, but it was never opened before.\" He said: \"An Angel came down from it and came to the Prophet (ﷺ) and said: 'Receive the glad tidings of two lights that have been given to you and were never given to any prophet before you: The Opening of the Book (Al-Fatihah) and the last verses of Surat Al-Baqarah. You will never recite a single letter of them but you will be granted it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30271",
        "20364",
        "20327",
        "20595",
        "11361",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-992",
      "hadith_no": "992",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا الفضل بن سهل، قال حدثني أبو الجواب، قال حدثنا عمار بن رزيق، عن أبي إسحاق، عن إبراهيم بن مهاجر، عن مجاهد، عن ابن عمر، قال رمقت رسول الله صلى الله عليه وسلم عشرين مرة يقرأ في الركعتين بعد المغرب وفي الركعتين قبل الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"I watched the Messenger of Allah (ﷺ)- twenty times- reciting in the two rak'ahs after maghrib 'Say: O you disbelievers' and 'Say: He is Allah, (the) One.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30264",
        "20578",
        "20595",
        "11049",
        "10739",
        "11028",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3549",
      "hadith_no": "3549",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني أبو بكر بن إسحاق الصاغاني، قال حدثنا أبو الجواب، قال حدثنا عمار، - هو ابن رزيق - عن أبي إسحاق، عن الشعبي، عن فاطمة بنت قيس، قالت طلقني زوجي فأردت النقلة فأتيت رسول الله صلى الله عليه وسلم فقال ‏\"‏ انتقلي إلى بيت ابن عمك عمرو ابن أم مكتوم فاعتدي فيه ‏\"‏ ‏.‏ فحصبه الأسود وقال ويلك لم تفتي بمثل هذا ‏.‏ قال عمر إن جئت بشاهدين يشهدان أنهما سمعاه من رسول الله صلى الله عليه وسلم وإلا لم نترك كتاب الله لقول امرأة ‏{‏ لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة ‏}‏ ‏.‏",
      "text_en": " It was narrated that Fatimah bint Qais said:                      \"My husband divorced me and I wanted to move, so I went to the Messenger of Allah and he said: 'Move to the house of your paternal cousin 'Amr bin Umm Maktum, and observe your 'Iddah there.'\" Al-Aswad hit him (Ash-Sha'bi) with a pebble and said: \"Woe be to you! Why do you issue such a Fatwa? 'Umar said: 'If you bring two witnesses who will testify that they heard that from the Messenger of Allah (we will believe you), otherwise, we will not leave the Book of Allah for the word of a woman.' 'And turn them not out of their (husband's) homes nor shall they (themselves) leave, except in case they are guilty of some open Fahishah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20578",
        "20595",
        "11049",
        "11052",
        "224"
      ]
    },
    {
      "id": "sunan-an-nasai-4430",
      "hadith_no": "4430",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا العباس بن عبد العظيم العنبري، عن الأحوص بن جواب، عن عمار بن رزيق، عن أبي إسحاق، عن الزبير بن عدي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن لحوم الأضاحي بعد ثلاث وعن النبيذ إلا في سقاء وعن زيارة القبور فكلوا من لحوم الأضاحي ما بدا لكم وتزودوا وادخروا ومن أراد زيارة القبور فإنها تذكر الآخرة واشربوا واتقوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his fhater said:                     \"The Messenger of Allah said: \"I used to forbid you (from eating) the meat of sacrificial animals after three days, and to (make) Nadidh except in a water skin, and to visit graves. But now eat whatever you want of the meat, or take some with you (when traveling) or store it: and whoever wants to visit graves, it will remind him of the Hereafter; and drink, but beware of any kind of intoxicant.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20595",
        "11049",
        "11336",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4900",
      "hadith_no": "4900",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا أبو الجواب، قال حدثنا عمار بن رزيق، عن محمد بن عبد الرحمن بن أبي ليلى، عن إسماعيل بن أمية، عن محمد بن مسلم، عن عروة، عن عائشة، قالت سرقت امرأة من قريش من بني مخزوم فأتي بها النبي صلى الله عليه وسلم فقالوا من يكلمه فيها قالوا أسامة بن زيد ‏.‏ فأتاه فكلمه فزبره وقال ‏\"‏ إن بني إسرائيل كانوا إذا سرق فيهم الشريف تركوه وإذا سرق الوضيع قطعوه والذي نفسي بيده لو أن فاطمة بنت محمد سرقت لقطعتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"A woman of Quraish, from banu Makhzum, stole, and she was brought to the Prophet. They said: 'Who will speak to him concerning her?' They said: 'Usamah bin Zaid.' So he came to the Prophet and spoke to him. But he rebuked him, and he said; 'Among the Children of Israel, if a noble person stole, they would let him go. But if a low-class person stole, they would cut off his hand. By the One in whose hand is the soul of Muhammad, if Fatimah bint Muhammad were to steal, I would cut off her hand.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20578",
        "20595",
        "11417",
        "167",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5168",
      "hadith_no": "5168",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى بن آدم، قال حدثنا عمار بن رزيق، عن أبي إسحاق، عن صعصعة بن صوحان، عن علي، قال نهاني رسول الله صلى الله عليه وسلم عن حلقة الذهب والقسي والميثرة والجعة ‏.‏ قال أبو عبد الرحمن الذي قبله أشبه بالصواب ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me (to wear) gold rings and Al-Qassi, Al-Mitharah, and Al-Ji'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20595",
        "11049",
        "466",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5611",
      "hadith_no": "5611",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى بن آدم، قال حدثنا عمار بن رزيق، عن أبي إسحاق، عن صعصعة بن صوحان، عن علي، كرم الله وجهه قال نهاني النبي صلى الله عليه وسلم عن حلقة الذهب والقسي والميثرة والجعة ‏.‏",
      "text_en": " It was narrated that 'Ali - may Allah honor his face - said:                     \"The Prophet [SAW] forbade to me to use gold rings, Al-Qassi, Al-Mitharah and Al-Ji'ah (a barley drink).\"",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20595",
        "11049",
        "466"
      ]
    },
    {
      "id": "sunan-an-nasai-5651",
      "hadith_no": "5651",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا العباس بن عبد العظيم، عن الأحوص بن جواب، عن عمار بن رزيق، أنه حدثهم عن أبي إسحاق، عن الزبير بن عدي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن لحوم الأضاحي فتزودوا وادخروا ومن أراد زيارة القبور فإنها تذكر الآخرة واشربوا واتقوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'I used to forbid you (to store) the sacrificial meat, but now eat it and store it; and whosoever wants to visit graves (may do so), for they are a reminder of the Hereafter; and drink but avoid all intoxicants.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20595",
        "11049",
        "11336",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3184",
      "hadith_no": "3184",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، عن عمار بن رزيق، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت ادلج النبي  صلى الله عليه وسلم  ليلة النفر من البطحاء ادلاجا ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) set out beforedaybreak, on the night of departure, from Batha’.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20609",
        "20595",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3635",
      "hadith_no": "3635",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا معاوية بن هشام، حدثنا عمار بن رزيق، عن عبد الله بن عيسى، عن أمية بن هند، عن عبد الله بن عامر بن ربيعة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ العين حق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from hisfather,that the Prophet (ﷺ) said:                      “The evil eye is real.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20609",
        "20595",
        "11361",
        "13501",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-3791",
      "hadith_no": "3791",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، عن عمار بن رزيق، عن أبي إسحاق، عن الأغر أبي مسلم، عن أبي هريرة، وأبي، سعيد يشهدان به على النبي  صلى الله عليه وسلم  قال ‏\"‏ ما جلس قوم مجلسا يذكرون الله فيه إلا حفتهم الملائكة وتغشتهم الرحمة وتنزلت عليهم السكينة وذكرهم الله فيمن عنده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah and Abu Sa'eed bore witness that the Prophet(ﷺ) said:                     \"No people sit in a gathering remembering Allah, But the angels surround them, mercy covers them, tranquility descends upon them and Allah remembers them before those who are with Him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20364",
        "20595",
        "11049",
        "13"
      ]
    }
  ],
  "total_hadiths": 26
}