{
  "id": "20597",
  "name": "'Amr bin Muhammad al-Anqazi عمرو بن محمد العنقزي",
  "full_name": "'Amr bin Muhammad al-Anqazi عمرو بن محمد العنقزي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "199",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "Ally B.Umayya",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11607",
      "name": "'Isa bin Thman عيسى بن طهمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20739",
      "name": "'Abdul 'Aziz bin Abi Ruwad عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "3107",
      "name": "'Abdullah bin Budayl al-Khuza'i ( عبد الله بن بديل بن ورقاء الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25211",
      "name": "'Amr bin Thabit عمرو بن ثابت/بن أبي المقدام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35073",
      "name": "Abd al-Rhym bin Mtrf عبد الرحيم بن مطرف بن أنيس بن قدامة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34011",
      "name": "Ahmed bin Muhammad bin Yahya أحمد بن محمد بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30468",
      "name": "'Abdullah bin 'Umar عبد الله بن عمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36587",
      "name": "'Abdur Rahman bin Muhammad عبد الرحمن بن محمد بن سلام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38366",
      "name": "Abd'h bin Abd al-Rhym عبدة بن عبد الرحيم بن حسان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35027",
      "name": "al-Hasan bin Hammad al-Dabi الحسن بن حماد الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38181",
      "name": "al-Husain bin Mnswr bin Ja'far الحسين بن منصور بن جعفر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35098",
      "name": "'Ali bin Muhammad bin Aby علي بن محمد بن أبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38409",
      "name": "'Ali bin Muhammad bin Ishaq al-Tanafasi علي بن محمد بن إسحاق الطنافسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2475",
      "hadith_no": "2475",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن عمر بن محمد، عن أبان بن صالح القرشي، حدثنا عمرو بن محمد، - يعني العنقزي - عن عبد الله بن بديل، بإسناده نحوه قال فبينما هو معتكف إذ كبر الناس فقال ما هذا يا عبد الله قال سبى هوازن أعتقهم النبي صلى الله عليه وسلم قال وتلك الجارية ‏.‏ فأرسلها معهم ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The tradition mentioned above (No. 2468) has also been transmitted by Abdullah ibn Budayl through a different chain of narrators in a similar way. This version adds: While he (Umar) was observing i'tikaf (in the sacred mosque), the people uttered (loudly):  \"Allah is most great.\" He said: What is this, Abdullah?  He said: These are the captives of the Hawazin whom the Messenger of Allah (ﷺ) has set free. He said: This slave-girl too? He sent her along with them.",
      "usc_msa_ref": "",
      "chain": [
        "19897",
        "20597"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1833",
      "hadith_no": "1833",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسين بن علي بن الأسود البغدادي، حدثنا عمرو بن محمد العنقزي، حدثنا إسرائيل، عن صالح بن رستم أبي عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحقرن أحدكم شيئا من المعروف وإن لم يجد فليلق أخاه بوجه طليق وإن اشتريت لحما أو طبخت قدرا فأكثر مرقته واغرف لجارك منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه شعبة عن أبي عمران الجوني ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Messenger of Allah (ﷺ) said: \"Let one of you not consider any good to be insignificant. If he has nothing, then let him meet his brother with a smiling face. If you buy some meat or cook something in a pot, then increase its broth, and serve some of it to you neighbor.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported it from Abu 'Imran Al-Jawni.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20597",
        "20311",
        "17514",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2055",
      "hadith_no": "2055",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عمرو بن محمد العنقزي، قال حدثنا ابن إدريس، عن عبيد الله، عن نافع، عن ابن عمر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ هذا الذي تحرك له العرش وفتحت له أبواب السماء وشهده سبعون ألفا من الملائكة لقد ضم ضمة ثم فرج عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah said:                     Thos is the one at whose death the Throne shook, the gates of heaven were opened of him and seventy thousand angles attended his funeral. It squeezed him once then released him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20597",
        "20102",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-257",
      "hadith_no": "257",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا عمرو بن محمد العنقزي، أنبأنا سفيان، عن أبي هارون العبدي، قال كنا إذا أتينا أبا سعيد الخدري قال مرحبا بوصية رسول الله  صلى الله عليه وسلم  ‏.‏ إن رسول الله  صلى الله عليه وسلم  قال لنا ‏\"‏ إن الناس لكم تبع وإنهم سيأتونكم من أقطار الأرض يتفقهون في الدين فإذا جاءوكم فاستوصوا بهم خيرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Harun Al-'Abdi said:                     \"When we came to Abu Sa'eed Al-Khudri, he would say: 'Welcome, in accordance with the injunction of the Messenger of Allah, for the Messenger of Allah said to us: \"The people will follow you; they will come to you from all parts of the earth seeking to understand the religion. So when they come to you, take care of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20597",
        "20012",
        "18767"
      ]
    },
    {
      "id": "sunan-ibn-majah-1894",
      "hadith_no": "1894",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن محمد بن يحيى بن سعيد القطان، حدثنا عمرو بن محمد العنقزي، حدثنا أسباط بن نصر، عن السدي، عن عدي بن ثابت، عن البراء بن عازب، في قوله سبحانه ‏{‏ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون}‏ ‏.‏ قال نزلت في الأنصار كانت الأنصار تخرج إذا كان جداد النخل من حيطانها أقناء البسر فيعلقونه على حبل بين أسطوانتين في مسجد رسول الله  صلى الله عليه وسلم  فيأكل منه فقراء المهاجرين فيعمد أحدهم فيدخل قنو الحشف يظن أنه جائز في كثرة ما يوضع من الأقناء فنزل فيمن فعل ذلك ‏{ولا تيمموا الخبيث منه تنفقون}‏ ‏.‏ يقول لا تعمدوا للحشف منه تنفقون ‏.‏ ‏{ولستم بآخذيه إلا أن تغمضوا فيه }‏ يقول لو أهدي لكم ما قبلتموه إلا على استحياء من صاحبه غيظا أنه بعث إليكم ما لم يكن لكم فيه حاجة واعلموا أن الله غني عن صدقاتكم ‏.‏",
      "text_en": " It was narrated that:                     Bara bin Azib said concerning the Verse: “And of that which We have priduced from the earth for you, and don not aim at that which is bad to spend from it. ” [Al-Baqarah 2:267] “This was revealed concerning the Ansar. At the time of the new date-palm harvest, they would take a bunch of dates that were beginning to ripen and hang it on a rope between two of the pillars in the mosque of the Messenger of Allah (ﷺ), and the poor emigrants would eat from it.” One of them deliberately mixed a bunch containing rotten and shriveled dates, and thought this was permissible because of the large number of dates that had been put there. So the following was revealed about the one who did that: '… and do not aim at that which is bad to spend from it'. Meaning do not seek out the rotten and shriveled dates to give in charity: '…(thought) you would not accept it save if you close your eyes and tolerate therein.' Meaning, if you were given this as a gift you would only accept it because you felt embarrassed, and you would get angry that he had sent something of which you have no need. And know that Allah has no need of your charity.”",
      "usc_msa_ref": "",
      "chain": [
        "34011",
        "20597",
        "20643",
        "10743",
        "11372",
        "400"
      ]
    }
  ],
  "total_hadiths": 5
}