{
  "id": "20609",
  "name": "Mua'wiya bin Hisham al-Qsar معاوية بن هشام القصار",
  "full_name": "Mua'wiya bin Hisham al-Qsar معاوية بن هشام القصار",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "204",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "Client",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20593",
      "name": "'Ali bin Salah bin Salah علي بن صالح بن صالح بن حي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20595",
      "name": "'Ammar bin Razayq عمار بن رزيق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25316",
      "name": "al-Mnhal bin Khlyfh المنهال بن خليفة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38269",
      "name": "Sh'yb bin Ayoub bin شعيب بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30475",
      "name": "al-Qasim bin Zakaria bin Dinar القاسم بن زكريا بن دينار القرشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30149",
      "name": "'Abdah bin 'Abdullah al-Saffar عبدة بن عبد الله الصفار",
      "grade": "3rd Century AH"
    },
    {
      "id": "30126",
      "name": "Bashr bin Khalid al-'Askary بشر بن خالد العسكري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38022",
      "name": "Ahmed bin Suliaman أحمد بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "505",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء حدثنا معاوية بن هشام، عن سفيان، عن مختار بن فلفل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أكثر الأنبياء تبعا يوم القيامة وأنا أول من يقرع باب الجنة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) said: Amongst the apostles I would have the largest following on the Day of Resurrec tion, and I would be the first to knock at the door of Paradise.",
      "chain": [
        "30216",
        "20609",
        "20012",
        "19"
      ]
    },
    {
      "hadith_no": "1394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا شيبان، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Shaiban with the same chain of transmitters",
      "chain": [
        "30201",
        "20609"
      ]
    },
    {
      "hadith_no": "4526",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا سريج بن يونس، حدثنا يحيى بن زكرياء بن أبي زائدة، ح وحدثنا أبو بكر بن أبي شيبة حدثنا معاوية بن هشام، حدثنا سفيان، كلاهما عن داود، بهذا الإسناد ‏.‏ بعض هذا الحديث ‏.‏ غير أن في حديث سفيان فاعترف بالزنى ثلاث مرات ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Dawud with the same chain of transmitters but with this variation that in the hadith narrated by Sufyan (the words are):                     \" He made a confession of having committed adultery, thrice.\"",
      "chain": [
        "30251",
        "30201",
        "20609"
      ]
    },
    {
      "hadith_no": "6777",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، عن هشام بن سعد، عن  زيد بن أسلم، وأبي، حازم عن أم الدرداء، عن أبي الدرداء، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن اللعانين لا يكونون شهداء ولا شفعاء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Umm Darda' reported on the authority of Abu Darda' as saying:                      I heard Allah's Messenger (may peace be upon him) as saying: The invoker of curse would neither be witness nor intercessor on the Day of Resurrection.",
      "chain": [
        "30201",
        "20609",
        "20519",
        "11163",
        "11172",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "44",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا معاوية بن هشام، عن يونس بن الحارث، عن إبراهيم بن أبي ميمونة، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ نزلت هذه الآية في أهل قباء ‏{‏ فيه رجال يحبون أن يتطهروا ‏}‏ قال كانوا يستنجون بالماء فنزلت فيهم هذه الآية ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The following verse was revealed in connection with the people of Quba': \"In it are men who love to be purified\" (ix.108). He (AbuHurayrah) said: They used to cleanse themselves with water after easing. So the verse was revealed in connection with them.",
      "chain": [
        "30216",
        "20609",
        "23500",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "676",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا سفيان، عن أسامة بن زيد، عن عثمان بن عروة، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله وملائكته يصلون على ميامن الصفوف ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: Allah and His angels bless those who are on the right flanks of the rows.",
      "chain": [
        "30203",
        "20609",
        "20012",
        "50",
        "11526",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا معاوية بن هشام، عن سفيان، عن أبي مالك، عن أبي حازم، عن أبي هريرة، قال - أراه رفعه - قال ‏\"‏ لا غرار في تسليم ولا صلاة ‏\"‏ ‏.‏ قال أبو داود ورواه ابن فضيل على لفظ ابن مهدي ولم يرفعه ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet(ﷺ) as saying :                      There is no loss in salutation and in prayer.Abu Dawud said: According to the version of Ibn Mahdi, this tradition has been narrated by Ibn Fudail as a statement of Abu Hurairah and not as a saying of the Prophet(ﷺ)",
      "chain": [
        "30216",
        "20609",
        "20012",
        "10766",
        "11349",
        "13",
        "30002"
      ]
    },
    {
      "hadith_no": "1617",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، أخبرنا إسماعيل، ليس فيه ذكر الحنطة ‏.‏ قال أبو داود وقد ذكر معاوية بن هشام في هذا الحديث عن الثوري، عن زيد بن أسلم، عن عياض، عن أبي سعيد، ‏\"‏ نصف صاع من بر ‏\"‏ ‏.‏ وهو وهم من معاوية بن هشام أو ممن رواه عنه ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Abu Sa’id through a different chain of narrators.This version adds :                      “Half a sa’ of wheat “. But this is a misunderstanding on the part of muawayah b. Hisham and of those who narrated from him.",
      "chain": [
        "30175",
        "20609",
        "20012",
        "11163"
      ]
    },
    {
      "hadith_no": "2095",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، عن سفيان، عن إسماعيل بن أمية، حدثني الثقة، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ آمروا النساء في بناتهن ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: Consult women about (the marriage of) their daughters.",
      "chain": [
        "30203",
        "20609",
        "20012",
        "11417",
        "18"
      ]
    },
    {
      "hadith_no": "3304",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا شعيب بن أيوب، حدثنا معاوية بن هشام، عن سفيان، عن أبيه، عن عكرمة، عن عقبة بن عامر الجهني، أنه قال للنبي صلى الله عليه وسلم ‏:‏ إن أختي نذرت أن تمشي إلى البيت ‏.‏ فقال ‏:‏ ‏\"‏ إن الله لا يصنع بمشى أختك إلى البيت شيئا ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir al-Juhani:                     Uqbah said to the Prophet (ﷺ): My sister has taken a vow that she will walk to the House of Allah (the Ka'bah). Thereupon he said: Allah will not do anything of the walking of your sister to the House of Allah (i.e. the Ka'bah).",
      "chain": [
        "20609",
        "20012",
        "20016",
        "11023",
        "189"
      ]
    },
    {
      "hadith_no": "3557",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا سفيان، عن حبيب، - يعني ابن أبي ثابت - عن حميد الأعرج، عن طارق المكي، عن جابر بن عبد الله، قال قضى رسول الله صلى الله عليه وسلم في امرأة من الأنصار أعطاها ابنها حديقة من نخل فماتت فقال ابنها إنما أعطيتها حياتها ‏.‏ وله إخوة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي لها حياتها وموتها ‏\"‏ ‏.‏ قال كنت تصدقت بها عليها ‏.‏ قال ‏\"‏ ذلك أبعد لك ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah  (ﷺ) decided a case of a woman from the Ansar to whom an orchard of date-palms was given by her son. She then died. Her son said: I gave it to her for her life, and she has brothers. Thereupon the Messenger of Allah (ﷺ) said: It belongs to her during her life and after death. He then said: I gave a sadaqah (charity to her. He replied: It is more unexpected from you.",
      "chain": [
        "30203",
        "20609",
        "20012",
        "11331",
        "34"
      ]
    },
    {
      "hadith_no": "3820",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا سفيان، عن محارب بن دثار، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ نعم الإدام الخل ‏\"‏ ‏.‏",
      "text_en": " Jabir reported the Prophet (ﷺ) as saying:                      What a good condiment vinegar is!",
      "chain": [
        "30203",
        "20609",
        "20012",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "4190",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا معاوية بن هشام، وسفيان بن عقبة السوائي، - هو أخو قبيصة - وحميد بن خوار عن سفيان الثوري، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم ولي شعر طويل فلما رآني رسول الله صلى الله عليه وسلم قال ‏\"‏ ذباب ذباب ‏\"‏ ‏.‏ قال فرجعت فجززته ثم أتيته من الغد فقال ‏\"‏ إني لم أعنك وهذا أحسن ‏\"‏ ‏.‏",
      "text_en": " Narrated Wa'il  ibn Hujr:                     I came to the Prophet (ﷺ) and I had long hair. When the Messenger of Allah (ﷺ) saw me, he said: Evil, evil! He said: I then returned and cut them off. I then came to him in the morning. He said (to me): I did not intend to do evil to you. This is much better.",
      "chain": [
        "30216",
        "20609",
        "20586",
        "20012",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "4900",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا معاوية بن هشام، عن عمران بن أنس المكي، عن عطاء، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اذكروا محاسن موتاكم وكفوا عن مساويهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: Make a mention of the virtues of your dead, and refrain from (mentioning) their evils.",
      "chain": [
        "30216",
        "20609",
        "23046",
        "11029",
        "18"
      ]
    },
    {
      "hadith_no": "746",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، ومعاوية بن هشام، قالا حدثنا سفيان، عن منصور، عن خيثمة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصوم من الشهر السبت والأحد والاثنين ومن الشهر الآخر الثلاثاء والأربعاء والخميس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروى عبد الرحمن بن مهدي هذا الحديث عن سفيان ولم يرفعه ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"",
      "chain": [
        "30277",
        "20355",
        "20609",
        "20012",
        "11067",
        "11332",
        "53"
      ]
    },
    {
      "hadith_no": "1019",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن عمران بن أنس المكي، عن عطاء، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اذكروا محاسن موتاكم وكفوا عن مساويهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ سمعت محمدا يقول عمران بن أنس المكي منكر الحديث وروى بعضهم عن عطاء عن عائشة ‏.‏ قال وعمران بن أبي أنس مصري أقدم وأثبت من عمران بن أنس المكي ‏.‏",
      "text_en": " Ibn Umar narrated that:                     The Messenger of Allah said: \"Mention good things about your dead, and refrain from (mentioning) their evil.\"",
      "chain": [
        "30216",
        "20609",
        "23046",
        "11029",
        "18"
      ]
    },
    {
      "hadith_no": "1842",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي البصري، قال حدثنا معاوية بن هشام، عن سفيان، عن محارب بن دثار، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ نعم الإدام الخل ‏\"‏ ‏.‏ هذا أصح من حديث مبارك بن سعيد ‏.‏",
      "text_en": " Narrated Jabir:                     That the Prophet (ﷺ) said: \"What an excellent condiment vinegar is.\"There are narrations on this topic from 'Aishah and Umm Hani', and this is more correct than the narration of Mubarak bin Sa'eed (no. 1839).",
      "chain": [
        "30149",
        "20609",
        "20012",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "1843",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي، حدثنا معاوية بن هشام، عن سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم كان يأكل البطيخ بالرطب ‏.‏ قال وفي الباب عن أنس ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ورواه بعضهم عن هشام بن عروة عن أبيه عن النبي صلى الله عليه وسلم مرسل ولم يذكر فيه عن عائشة وقد روى يزيد بن رومان عن عروة عن عائشة هذا الحديث ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The Prophet (ﷺ) would eat melon with fresh dates.\"He said: There is something on about this from Anas.[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of them reported it form Hisham bin 'Urwah from his father in Mursal form from the Prophet (ﷺ), without mentioning \"from 'Aishah\" in it, And Yazid bin Ruman reported this Hadith from 'Urwah, from 'Aishah.",
      "chain": [
        "30149",
        "20609",
        "20012",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2195",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي، حدثنا معاوية بن هشام، عن سفيان، عن عاصم، عن عبد الله بن الحارث، عن أنس، أن رسول الله صلى الله عليه وسلم رخص في الرقية من الحمة والعين والنملة ‏.‏",
      "text_en": " Anas narrated that :                     the Messenger of Allah (s.a.w) permitted Ruqyah for the scorpion sting, the(evil) eye, and An-Namlah.",
      "chain": [
        "30149",
        "20609",
        "20012",
        "11080",
        "912",
        "19"
      ]
    },
    {
      "hadith_no": "2381",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن شيبان، عن فراس، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرائي يرائي الله به ومن يسمع يسمع الله به ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ من لا يرحم الناس لا يرحمه الله ‏\"‏ ‏.‏ وفي الباب عن جندب وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Sa'eed narrated that the Messenger of Allah (S.a.w) said:                     \"Whoever wants to be seen, Allah will show him, And whoever wants to be heard of, Allah will make him heard off.\" And he narrated that the Messenger of Allah (s.a.w) said: \"He who shows no mercy to the people, Allah shows him no mercy.\"",
      "chain": [
        "30216",
        "20609",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "3298",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا معاوية بن هشام، حدثنا سفيان الثوري، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏ ‏.‏ فقلت يا رسول الله أقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏ ‏.‏ فقرأت سورة النساء حتى إذا بلغت ‏:‏ ‏(‏جئنا بك على هؤلاء شهيدا ‏)‏ قال فرأيت عينى النبي صلى الله عليه وسلم تهملان ‏.‏ قال أبو عيسى هذا أصح من حديث أبي الأحوص ‏.‏",
      "text_en": " Narrated Ibrahim:                     from 'Abidah that 'Abdullah said: \"The Messenger of Allah (ﷺ) said to me: 'Recite for me.' I said: 'O Messenger of Allah! Shall I recite for you while it is to you whom it was revealed?' He said: 'I love to hear it from other than me.'\" So I recited Surat An-Nisa until I reached: \"...And We bring you (Muhammad) as a witness against these people? (4:41)\" He said: \"So I saw the eyes of the Prophet (ﷺ) overflowing with tears.\"",
      "chain": [
        "30277",
        "20609",
        "20012",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "3342",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن سفيان، عن أبي إسحاق، عن ناجية بن كعب، عن علي، أن أبا جهل، قال للنبي صلى الله عليه وسلم إنا لا نكذبك ولكن نكذب بما جئت به فأنزل الله ‏:‏ ‏(‏ إنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون ‏)‏ ‏.‏",
      "text_en": " Narrated 'Ali:                     \"Abu Jahl said to the Prophet (ﷺ): 'We do not deny you, but we deny what you came with.' So Allah Most High revealed: It is not you that they deny but is Allah's Ayat which the wrong-doers reject (6:33).\"",
      "chain": [
        "30216",
        "20609",
        "20012",
        "11049",
        "19064",
        "5"
      ]
    },
    {
      "hadith_no": "3383",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن العلاء أبو كريب، حدثنا معاوية بن هشام، حدثنا يونس بن الحارث، عن إبراهيم بن أبي ميمون، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ نزلت هذه الآية في أهل قباء ‏:‏ ‏(‏فيه رجال يحبون أن يتطهروا والله يحب المطهرين ‏)‏ ‏\"‏ ‏.‏ قال كانوا يستنجون بالماء فنزلت هذه الآية فيهم ‏.‏ قال هذا حديث غريب من هذا الوجه ‏.‏ قال وفي الباب عن أبي أيوب وأنس بن مالك ومحمد بن عبد الله بن سلام ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"This Ayah was revealed about the people of Quba: In it are men who love to purify themselves. And Allah loves those who make themselves pure (9:108).\" He said: \"They used water to perform Istinja so this Ayah was revealed about them.\"",
      "chain": [
        "30216",
        "20609",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3609",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن شيبان، عن أبي إسحاق، عن عكرمة، عن ابن عباس، قال قال أبو بكر رضى الله عنه يا رسول الله قد شبت ‏.‏ قال ‏\"‏ شيبتني هود والواقعة والمرسلات و عم يتساءلون وإذا الشمس كورت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث ابن عباس إلا من هذا الوجه ‏.‏ وروى علي بن صالح هذا الحديث عن أبي إسحاق عن أبي جحيفة نحو هذا ‏.‏ وروي عن أبي إسحاق عن أبي ميسرة شيء من هذا مرسلا ‏.‏",
      "text_en": " Abu Ishaq narrated from Ikrimah, from Ibn Abbas who said:                     “Abu Bakr [may Allah be pleased with him] said: ‘O Messenger of Allah! You have become gray.’ He said: ‘I have gone gray from (Surat) Hud, Al-Waqiah, Al-Mursalat and Amma Yatasa’lim and Idhash Shamsu Kuwwirat.’”",
      "chain": [
        "30216",
        "20609",
        "20240",
        "11049",
        "11023",
        "17",
        "20436"
      ]
    },
    {
      "hadith_no": "3480",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن حمزة الزيات، عن حبيب بن أبي ثابت، عن عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم عافني في جسدي وعافني في بصري واجعله الوارث مني لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم والحمد لله رب العالمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال سمعت محمدا يقول حبيب بن أبي ثابت لم يسمع من عروة بن الزبير شيئا وحبيب بن أبي ثابت هو حبيب بن قيس بن دينار وقد أدرك عمر وابن عباس والله أعلم ‏.‏",
      "text_en": " Aishah narrated that the Messenger of Allah used to say:                     “O Allah, grant me health in my body, and grant me health in my sight, and make it the inheritor from me, there is none has the right to be worshipped but Allah, the Forbearing, the Generous, Glory is to Allah, the Lord of the Magnificent Throne, and all praise is due to Allah, the Lord of all that exists (Allahumma Afini Fi Jasadi, Wa Afani Fi Basari, Waj’alhul-Waritha Minni, La Ilaha Illallah, Al-Halimul-Karim. Subhan Allah,  Rabbil-Arshil-Azim, Wal-Hamdulillah, Rabbil-Alamin)”",
      "chain": [
        "30216",
        "20609",
        "20583",
        "11331",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1704",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا معاوية بن هشام، قال حدثنا سفيان، عن حبيب بن أبي ثابت، عن محمد بن علي، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم أنه قام من الليل فاستن ثم صلى ركعتين ثم نام ثم قام فاستن ثم توضأ فصلى ركعتين حتى صلى ستا ثم أوتر بثلاث وصلى ركعتين ‏.‏",
      "text_en": " Sufyan narrated from Habib bin Abi Thabit, from Muhammad bin Ali, from his father, from his grandfather, that:                     The Prophet (ﷺ) got up at night and cleaned his teeth, then he prayed two rak'ahs, then he slept. Then he got up and cleaned his teeth, then he performed wudu and prayed two rak'ahs, until he had prayed six. Then he prayed witr with three rak'ahs, and prayed two rak'ahs.",
      "chain": [
        "30375",
        "20609",
        "20012",
        "11331",
        "11442",
        "11045"
      ]
    },
    {
      "hadith_no": "4089",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا معاوية بن هشام، قال حدثنا سفيان، عن عبد الله بن الحسن، عن إبراهيم بن محمد بن طلحة، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "chain": [
        "38022",
        "20609",
        "20012",
        "19809",
        "11827",
        "29"
      ]
    },
    {
      "hadith_no": "4834",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا معاوية بن هشام، عن سفيان، عن أشعث بن أبي الشعثاء، عن الأسود بن هلال، عن ثعلبة بن زهدم، قال انتهى قوم من بني ثعلبة إلى النبي صلى الله عليه وسلم وهو يخطب فقال رجل يا رسول الله هؤلاء بنو ثعلبة بن يربوع قتلوا فلانا رجلا من أصحاب النبي صلى الله عليه وسلم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تجني نفس على أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tha'1abah bin Zahdam said:                      \"Some people from Banu Tha'labah came to the Prophet (ﷺ) when he was delivering a speech and a man said: 'O Messenger of Allah, these areBanu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet (ﷺ). The Prophet (ﷺ) said: 'No soul is affected by the sin of another.\"'",
      "chain": [
        "38022",
        "20609",
        "20012",
        "11324",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "386",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن يونس بن الحارث، عن إبراهيم بن أبي ميمونة، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نزلت في أهل قباء ‏{فيه رجال يحبون أن يتطهروا والله يحب المطهرين}‏ قال كانوا يستنجون بالماء فنزلت فيهم هذه الآية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'The (following) was revealed about the people of Quba': 'In it (the mosque) are men who love to clean and purify themselves. And Allah loves those who make themselves clean and pure.'\" He said: 'They used to clean themselves with water(after urinating), and this Verse was revealed concerning them.'\"",
      "chain": [
        "30216",
        "20609",
        "23500",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "676",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن سفيان، عن زيد بن جبير، عن خشف بن مالك، عن أبيه، عن عبد الله بن مسعود، قال شكونا إلى النبي  صلى الله عليه وسلم  حر الرمضاء فلم يشكنا ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"We complained to the Messenger of Allah about the heat of the sunbaked ground, but he did not respond to our complaint.\"",
      "chain": [
        "30216",
        "20609",
        "20012",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "1058",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا سفيان، عن أسامة بن زيد، عن عثمان بن عروة، عن عروة، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله وملائكته يصلون على ميامن الصفوف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)said:‘Allah and His angels send blessings upon the right side of therows.’”",
      "chain": [
        "30203",
        "20609",
        "20012",
        "50",
        "11526",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1603",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا سفيان، عن حمران بن أعين، عن أبي الطفيل، عن مجمع بن جارية الأنصاري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن أخاكم النجاشي قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ فصفنا خلفه صفين ‏.‏",
      "text_en": " It wasnarrated from Mujammi’ bin Jariyah Al-Ansari that theMessenger ofAllah (ﷺ) said:                      “Your brother Najashi has died, sostand and prayfor him.” So we formed two rows behind him.",
      "chain": [
        "30201",
        "20609",
        "20012",
        "15108",
        "3660"
      ]
    },
    {
      "hadith_no": "3184",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، عن عمار بن رزيق، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت ادلج النبي  صلى الله عليه وسلم  ليلة النفر من البطحاء ادلاجا ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) set out beforedaybreak, on the night of departure, from Batha’.”",
      "chain": [
        "30201",
        "20609",
        "20595",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3355",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، ح وحدثنا أحمد بن سنان، وإسحاق بن منصور، قالا حدثنا عبد الرحمن بن مهدي، قالا حدثنا مالك بن أنس، عن إسماعيل بن أبي حكيم، عن عبيدة بن سفيان، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أكل كل ذي ناب من السباع حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Eating anypredatory animal that has fangs is unlawful.”",
      "chain": [
        "30201",
        "20609",
        "30297",
        "30313",
        "20033",
        "20001",
        "11828",
        "11888",
        "13"
      ]
    },
    {
      "hadith_no": "3635",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا معاوية بن هشام، حدثنا عمار بن رزيق، عن عبد الله بن عيسى، عن أمية بن هند، عن عبد الله بن عامر بن ربيعة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ العين حق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from hisfather,that the Prophet (ﷺ) said:                      “The evil eye is real.”",
      "chain": [
        "30212",
        "20609",
        "20595",
        "11361",
        "13501",
        "709",
        "708"
      ]
    },
    {
      "hadith_no": "3645",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا معاوية بن هشام، حدثنا سفيان، عن عاصم، عن يوسف بن عبد الله بن الحارث، عن أنس، أن النبي  صلى الله عليه وسلم  رخص في الرقية من الحمة والعين والنملة ‏.‏",
      "text_en": " It wasnarrated from Anas that the Prophet (ﷺ) allowed Ruqyah forthescorpion’s sting, the evil eye, and Namlah (sores or smallpustulesulcers or sores on a person’s sides).",
      "chain": [
        "30149",
        "20609",
        "20012",
        "11080",
        "10728",
        "19"
      ]
    },
    {
      "hadith_no": "3767",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، وسفيان بن عقبة، عن سفيان، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رآني النبي  صلى الله عليه وسلم  ولي شعر طويل فقال ‏\"‏ ذباب ذباب ‏\"‏ ‏.‏ فانطلقت فأخذته فرآني النبي  صلى الله عليه وسلم  فقال ‏\"‏ إني لم أعنك وهذا أحسن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “The Prophet (ﷺ) saw mewhenI had long hair. He said: ‘Bad news, bad news!’ So I went awayand cut it short. Then the Prophet (ﷺ) saw me and said: ‘I didnotmean you, but this is better.’”",
      "chain": [
        "30201",
        "20609",
        "20586",
        "20012",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "3879",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، أنبأنا شيبان، عن يحيى، عن أبي سلمة، أن ربيعة بن كعب الأسلمي، أخبره أنه، كان يبيت عند باب رسول الله  صلى الله عليه وسلم  وكان يسمع رسول الله  صلى الله عليه وسلم  يقول من الليل ‏\"‏ سبحان الله رب العالمين ‏\"‏ ‏.‏ الهوي ثم يقول ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏",
      "text_en": " Rabi’ah bin Ka’b Al-Aslami narrated that he used to spend the night outside the door of the Messenger of Allah (ﷺ), and he used to hear the Messenger of Allah (ﷺ) saying at night:                      “Subhan Allahi Rabbil-‘alamin (Glory is to Allah, the Lord of the worlds),” repeating that for a while, then he said: Subhan Allahi wa bihamdihi (Glory and praise is to Allah).”",
      "chain": [
        "30201",
        "20609",
        "20240",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "hadith_no": "3923",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر، حدثنا معاوية بن هشام، حدثنا علي بن صالح، عن سماك، عن قابوس، قال قالت أم الفضل يا رسول الله رأيت كأن في بيتي عضوا من أعضائك قال ‏\"‏ خيرا رأيت تلد فاطمة غلاما فترضعيه ‏\"‏ ‏.‏ فولدت حسينا أو حسنا فأرضعته بلبن قثم قالت فجئت به إلى النبي  صلى الله عليه وسلم  فوضعته في حجره فبال فضربت كتفه فقال النبي  صلى الله عليه وسلم  ‏\"‏ أوجعت ابني رحمك الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Qabus said:                      “Umm Fadl said: ‘O Messenger ofAllah!It is as if I saw (in a dream) one of your limbs in my house.’Hesaid: ‘What you have seen is good. Fatimah will give birth to a boyand you will breastfeed him.’ Fatimah gave birth to Husain orHasan,and I breastfed him with the milk of Qutham.’ She said: ‘Ibrought himto the Prophet (ﷺ) and placed him in his lap, and heurinated, so Istruck him on the shoulder.” The Prophet (ﷺ) said:“You have hurt myson, may Allah have mercy on you.”",
      "chain": [
        "20436",
        "20609",
        "20593",
        "10770",
        "15453"
      ]
    },
    {
      "hadith_no": "4139",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، عن هشام بن سعد، عن عمرو بن عثمان، عن عاصم بن عمر بن عثمان، عن عروة، عن عائشة، قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ مروا بالمعروف وانهوا عن المنكر قبل أن تدعوا فلا يستجاب لكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Aishah said:                      “I heard the Messenger ofAllah(ﷺ) say: ‘enjoin what is good and forbid what is evil,before youcall and you are not answered.’”",
      "chain": [
        "30201",
        "20609",
        "20519",
        "10581",
        "28261",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4220",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا علي بن صالح، عن يزيد بن أبي زياد، عن إبراهيم، عن علقمة، عن عبد الله، قال بينما نحن عند رسول الله  صلى الله عليه وسلم  إذ أقبل فتية من بني هاشم فلما رآهم النبي  صلى الله عليه وسلم  اغرورقت عيناه وتغير لونه قال فقلت ما نزال نرى في وجهك شيئا نكرهه ‏.‏ فقال ‏\"‏ إنا أهل بيت اختار الله لنا الآخرة على الدنيا وإن أهل بيتي سيلقون بعدي بلاء وتشريدا وتطريدا حتى يأتي قوم من قبل المشرق معهم رايات سود فيسألون الخير فلا يعطونه فيقاتلون فينصرون فيعطون ما سألوا فلا يقبلونه حتى يدفعوها إلى رجل من أهل بيتي فيملؤها قسطا كما ملؤوها جورا فمن أدرك ذلك منكم فليأتهم ولو حبوا على الثلج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"While we were with theMessenger of Allah (ﷺ), some youngsters from Banu Hashim camealong.When the Prophet (ﷺ) saw them, his eyes filled with tearsand hiscolor changed. I said: 'We still see something in your facethat wedo not like (to see).' He said: 'We are members of aHousehold forwhom Allah has chosen the Hereafter over this world.The people of myHousehold will face calamity, expulsion and exileafter I am gone,until some people will come from the east carryingblack banners. Theywill ask for something good but will not be givenit. Then they willfight and will be victorious, then they will begiven what theywanted, but they will not accept it and will giveleadership to a manfrom my family. Then they will fill it withjustice just as it wasfilled with injustice. Whoever among you livesto see that, let him goto them even if he has to crawl over snow.'\"",
      "chain": [
        "30203",
        "20609",
        "20593",
        "10844",
        "11051",
        "11017",
        "16"
      ]
    }
  ],
  "total_hadiths": 41
}