{
  "id": "20622",
  "name": "Hrmlh bin 'Imran bin Qrad حرملة بن عمران بن قراد",
  "full_name": "Hrmlh bin 'Imran bin Qrad حرملة بن عمران بن قراد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18510",
      "name": "'Abdullah bin al-Harith عبد الله بن الحارث الكندي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10860",
      "name": "Sulaym bin Jubair سليم بن جبير أبو يونس مولى أبي هريرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10872",
      "name": "Ka'b bin 'Alqama bin Ka'b كعب بن علقمة بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "36036",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن محمد أبو صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6657",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني حرملة، ح وحدثني هارون بن، سعيد الأيلي حدثنا ابن وهب، حدثني حرملة، - وهو ابن عمران التجيبي - عن عبد الرحمن، بن شماسة المهري قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم ستفتحون أرضا يذكر فيها القيراط فاستوصوا بأهلها خيرا فإن لهم ذمة ورحما فإذا رأيتم رجلين يقتتلان في موضع لبنة فاخرج منها ‏\"‏ ‏.‏ قال فمر بربيعة وعبد الرحمن ابنى شرحبيل بن حسنة يتنازعان في موضع لبنة فخرج منها ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      You would soon conquer a land where people are in the habit of using foul language. They have a right of kinship upon you. And when you see two persons fighting for the space of a brick, then get out of that. He (Abu Dharr) then happened to pass by Rabila and 'Abd al-Rahman, the two sons of Shurahbil b. Hasana, and they had been disputing for the space of a brick. So he left the land.",
      "chain": [
        "20029",
        "30487",
        "30492",
        "20029",
        "20622",
        "10867",
        "23"
      ]
    },
    {
      "hadith_no": "1766",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، حدثنا عبد الله بن المبارك، عن حرملة بن عمران، عن عبد الله بن الحارث الأزدي، قال سمعت غرفة بن الحارث الكندي، قال شهدت رسول الله صلى الله عليه وسلم في حجة الوداع وأتي بالبدن فقال ‏\"‏ ادعوا لي أبا حسن ‏\"‏ ‏.‏ فدعي له علي - رضى الله عنه - فقال له ‏\"‏ خذ بأسفل الحربة ‏\"‏ ‏.‏ وأخذ رسول الله صلى الله عليه وسلم بأعلاها ثم طعن بها في البدن فلما فرغ ركب بغلته وأردف عليا رضى الله عنه ‏.‏",
      "text_en": " Narrated Arfah ibn al-Harith al-Kandi:                     I was present with the Messenger of Allah (ﷺ) at the Farewell Pilgrimage. When the sacrificial camels were brought to him, he said: Call AbulHasan (Ali) to me. Ali was then called for and he (the Prophet) said to him: Catch hold of the lower end of the lance, and the Messenger of Allah (ﷺ) himself caught hold of the upper end. He then pierced the camels with it. When he finished slaughtering, he rode on his mule and mounted Ali behind him.",
      "chain": [
        "30514",
        "20033",
        "20025",
        "20622",
        "18510",
        "5220"
      ]
    },
    {
      "hadith_no": "4728",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا علي بن نصر، ومحمد بن يونس النسائي، - المعنى - قالا حدثنا عبد الله بن يزيد المقرئ، حدثنا حرملة، - يعني ابن عمران - حدثني أبو يونس، سليم بن جبير مولى أبي هريرة قال سمعت أبا هريرة، يقرأ هذه الآية ‏{‏ إن الله يأمركم أن تؤدوا الأمانات إلى أهلها ‏}‏ إلى قوله تعالى ‏{‏ سميعا بصيرا ‏}‏ قال رأيت رسول الله صلى الله عليه وسلم يضع إبهامه على أذنه والتي تليها على عينه قال أبو هريرة ‏.‏ رأيت رسول الله صلى الله عليه وسلم يقرؤها ويضع إصبعيه قال ابن يونس قال المقرئ يعني ‏{‏ إن الله سميع بصير ‏}‏ يعني أن لله سمعا وبصرا ‏.‏ قال أبو داود وهذا رد على الجهمية ‏.‏",
      "text_en": " Abu Yunus Sulaim b. Jubair, client of Abu Hurairah, said :                      I heard Abu Hurairah recite this verse : “Allah doth command you to render back  your trusts to those to whom they are due” up to “For Allah is he who heareth and seeth all things”. He said : I saw the Messenger of Allah (May peace be upon him) putting his thumb on his ear and finger on his eye.Abu Hurairah said : I saw the Messenger of Allah (May peace be upon him) reciting this verse and putting his fingers. Ibn Yunus said that al-Muqri said. “Allah hears and sees” means that Allah has the power of hearing and seeing.Abu Dawud said: This is a refutation of the Jahmiyyah.",
      "chain": [
        "30557",
        "23033",
        "20622"
      ]
    },
    {
      "hadith_no": "3669",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسين بن الحسن المروزي، حدثنا ابن المبارك، عن حرملة بن عمران، قال سمعت أبا عشانة المعافري، قال سمعت عقبة بن عامر، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من كان له ثلاث بنات فصبر عليهن وأطعمهن وسقاهن وكساهن من جدته - كن له حجابا من النار يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Uqbah bin Amir said, I heard the Messenger of Allah(ﷺ) say:                     \"Whoever has three daughters and is patient towards them, and feeds them, gives them to drink, and clothes them from his wealth; they will be a shield for him from the Fire on the Day of Resurrection.'\"",
      "chain": [
        "20025",
        "20622",
        "16021",
        "189"
      ]
    }
  ],
  "total_hadiths": 4
}