{
  "id": "20625",
  "name": "'Abdur Rahman bin Salman عبد الرحمن بن سلمان الحجري",
  "full_name": "'Abdur Rahman bin Salman عبد الرحمن بن سلمان الحجري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  س  -  لا بأس به ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11209",
      "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11207",
      "name": "'Aqil bin Khalid bin 'Aqil عقيل بن خالد بن عقيل الأيلي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1833",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الطاهر، حدثنا ابن وهب، عن عبد الرحمن بن سلمان الحجري، عن عقيل بن خالد، أن سلمة بن كهيل، حدثه أن كريبا حدثه أن ابن عباس بات ليلة عند رسول الله صلى الله عليه وسلم قال فقام رسول الله صلى الله عليه وسلم إلى القربة فسكب منها فتوضأ ولم يكثر من الماء ولم يقصر في الوضوء ‏.‏ وساق الحديث وفيه قال ودعا رسول الله صلى الله عليه وسلم ليلتئذ تسع عشرة كلمة ‏.‏ قال سلمة حدثنيها كريب فحفظت منها ثنتى عشرة ونسيت ما بقي قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل لي في قلبي نورا وفي لساني نورا وفي سمعي نورا وفي بصري نورا ومن فوقي نورا ومن تحتي نورا وعن يميني نورا وعن شمالي نورا ومن بين يدى نورا ومن خلفي نورا واجعل في نفسي نورا وأعظم لي نورا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I slept one night in the house of Maimuna when the Apostle of Allah (may peace be upon him) was there, with a view to seeing the prayer of the Apostle of Allah (may peace be upon him) at night. The Apostle of Allah (may peace be upon him) entered into conversation with his wife for a short while, and then went to sleep, and the rest of the hadith is the same and in it mention is made of:\" He then got up, performed ablution and brushed his teeth.\"",
      "chain": [
        "20029",
        "20625",
        "11207",
        "11350",
        "11211"
      ]
    }
  ],
  "total_hadiths": 1
}