{
  "id": "20621",
  "name": "Jabir bin Isma'il al-Hdrmy جابر بن إسماعيل الحضرمي",
  "full_name": "Jabir bin Isma'il al-Hdrmy جابر بن إسماعيل الحضرمي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ بخ  م  د  س  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Hadrami",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11207",
      "name": "'Aqil bin Khalid bin 'Aqil عقيل بن خالد بن عقيل الأيلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19890",
      "name": "Hayy bin 'Abdullah bin Sharayh حيي بن عبد الله بن شريح",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1661",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الطاهر، وعمرو بن سواد، قالا أخبرنا ابن وهب، حدثني جابر بن إسماعيل، عن عقيل، عن ابن شهاب، عن أنس، عن النبي صلى الله عليه وسلم إذا عجل عليه السفر يؤخر الظهر إلى أول وقت العصر فيجمع بينهما ويؤخر المغرب حتى يجمع بينها وبين العشاء حين يغيب الشفق ‏.‏",
      "text_en": " Anas reported that when the Apostle of Allah (may peace be upon him) had to set out on a journey hurriedly, he delayed the noon prayer to the earlier time for the afternoon prayer, and then he would combine them, and he would delay the sunset prayer to the time when the twilight would disappear and then combine it with the 'Isha' prayer.",
      "chain": [
        "30443",
        "20029",
        "20621",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني جابر بن إسماعيل، عن عقيل، بهذا الحديث بإسناده قال ويؤخر المغرب حتى يجمع بينها وبين العشاء حين يغيب الشفق ‏.‏",
      "text_en": " The above mentioned tradition has also been reported by 'Uqail through a different chain of narrators. He said:                      He would delay the evening prayer till he combined the evening and the night prayers when the twilight disappeared.",
      "chain": [
        "30584",
        "20029",
        "20621",
        "11207"
      ]
    },
    {
      "hadith_no": "601",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني عمرو بن سواد بن الأسود بن عمرو، قال أنبأنا ابن وهب، قال حدثنا جابر بن إسماعيل، عن عقيل، عن ابن شهاب، عن أنس، عن رسول الله صلى الله عليه وسلم أنه كان إذا عجل به السير يؤخر الظهر إلى وقت العصر فيجمع بينهما ويؤخر المغرب حتى يجمع بينها وبين العشاء حين يغيب الشفق ‏.‏",
      "text_en": " It was narrated from Anas that the Messenger of Allah (ﷺ) said:                      \"If the Messenger of Allah (ﷺ) wanted to travel quickly, he would delay Zuhr until the time of 'Asr and combine them, and he would delay Maghrib until he combined it with 'Isha' when the twilight had disappeared.\"",
      "chain": [
        "30443",
        "20029",
        "20621",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني ابن لهيعة، وجابر بن إسماعيل، عن عقيل، عن ابن شهاب، عن سالم، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا استيقظ أحدكم من نومه فلا يدخل يده في الإناء حتى يغسلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim from his father that:                     The Messenger of Allah said: \"When anyone of you wakes up from sleep, he should not put his hand into the vessel until he has washed it.\"",
      "chain": [
        "30487",
        "20029",
        "20624",
        "20621",
        "11207",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 4
}