{
  "id": "20637",
  "name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
  "full_name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Client",
      "al-Shami"
    ]
  },
  "parents": [
    {
      "id": "17066",
      "name": "Muhajir bin Abi Muslim مهاجر بن أبي مسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "17532",
      "name": "'Amr bin Muhajir bin 'Abi Muslim عمرو بن المهاجر بن أبي مسلم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "17066",
      "name": "Muhajir bin Abi Muslim مهاجر بن أبي مسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17532",
      "name": "'Amr bin Muhajir bin 'Abi Muslim عمرو بن المهاجر بن أبي مسلم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1912",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يزيد بن عبد ربه، حدثنا الوليد بن مسلم، عن محمد بن مهاجر، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، قال سمعت النواس، بن سمعان الكلابي يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يؤتى بالقرآن يوم القيامة وأهله الذين كانوا يعملون به تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ كأنهما غمامتان أو ظلتان سوداوان بينهما شرق أو كأنهما حزقان من طير صواف تحاجان عن صاحبهما",
      "text_en": " Ibn 'Abbas reported that while Gabriel was sitting with the Apostle (may peace be upon him) he heard a creaking sound above him. He lifted his head and said:                      This As a gate opened in heaven today which had never been opened before. Then when an angel descended through it, he said: This is an angel who came down to the earth who had-never come down before. He greeted and said: Rejoice in two lights given to you which have not been given to any prophet before you: Falihat al-Kitab and the concluding verses of Suarah al-Baqara. You will never recite a letter from them for which you will not be given (a reward).",
      "chain": [
        "30313",
        "30572",
        "20733",
        "20637",
        "10975",
        "4097",
        "3600"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا محمد بن مهاجر، عن عروة بن، رويم حدثني الأنصاري، أن رسول الله صلى الله عليه وسلم قال لجعفر بهذا الحديث فذكر نحوهم قال في السجدة الثانية من الركعة الأولى كما قال في حديث مهدي بن ميمون ‏.‏",
      "text_en": " Narrated 'Urwah b. Ruwaim:                     That an al-Ansari narrated to him: The Messenger of Allah (ﷺ) said to Ja'far. He then narrated the tradition in like manner. This version has the words: \"In the second prostration of the first rak'ah\" in addition to the words transmitted by Mahdi b. Maimun (in the previous tradition).",
      "chain": [
        "30335",
        "20637",
        "20280"
      ]
    },
    {
      "hadith_no": "2544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أبو المغيرة، حدثنا محمد بن مهاجر، حدثنا عقيل بن شبيب، عن أبي وهب، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ عليكم بكل أشقر أغر محجل، أو كميت أغر ‏\"‏ ‏.‏ فذكر نحوه ‏.‏ قال محمد - يعني ابن مهاجر - سألته ‏:‏ لم فضل الأشقر قال ‏:‏ لأن النبي صلى الله عليه وسلم بعث سرية فكان أول من جاء بالفتح صاحب أشقر ‏.‏",
      "text_en": " Narrated AbuWahb:                     The Prophet (ﷺ) said: Keep to every sorrel horse with a white blaze and white on the legs, or dark bay with a white blaze. He then  mentioned something similar. Muhammad ibn al-Muhajir said: I asked him: Why was a sorrel horse preferred? He replied: Because the Prophet (ﷺ) had sent a contingent, and the man who first brought the news of victory was the rider of a sorrel horse.",
      "chain": [
        "38566",
        "20442",
        "20637",
        "18745"
      ]
    },
    {
      "hadith_no": "2548",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا مسكين، - يعني ابن بكير - حدثنا محمد بن مهاجر، عن ربيعة بن يزيد، عن أبي كبشة السلولي، عن سهل ابن الحنظلية، قال ‏:‏ مر رسول الله صلى الله عليه وسلم ببعير قد لحق ظهره ببطنه، فقال ‏:‏ ‏\"‏ اتقوا الله في هذه البهائم المعجمة فاركبوها وكلوها صالحة ‏\"‏ ‏.‏",
      "text_en": " Narrated Sahl ibn al-Hanzaliyyah:                     The Messenger of Allah (ﷺ) came upon an emaciated camel and said: Fear Allah regarding these dumb animals. Ride them when they are in good condition and feed them when they are in good condition.",
      "chain": [
        "30352",
        "20463",
        "20637",
        "11414",
        "11669",
        "1824"
      ]
    },
    {
      "hadith_no": "3881",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا محمد بن مهاجر، عن أبيه، عن أسماء بنت يزيد بن السكن، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقتلوا أولادكم سرا فإن الغيل يدرك الفارس فيدعثره عن فرسه ‏\"‏ ‏.‏",
      "text_en": " Narrated Asma', daughter of Yazid ibn as-Sakan,:                     I heard the Messenger of Allah (ﷺ) as saying: Do not kill your children secretly, for the milk, with which a child is suckled while his mother is pregnant, overtakes the horseman and throws him from his horse.",
      "chain": [
        "30335",
        "20637",
        "17066",
        "84"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا أبو أحمد البزاز، هشام بن سعيد الطالقاني قال حدثنا محمد بن مهاجر الأنصاري، عن عقيل بن شبيب، عن أبي وهب، - وكانت له صحبة - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تسموا بأسماء الأنبياء وأحب الأسماء إلى الله عز وجل عبد الله وعبد الرحمن وارتبطوا الخيل وامسحوا بنواصيها وأكفالها وقلدوها ولا تقلدوها الأوتار وعليكم بكل كميت أغر محجل أو أشقر أغر محجل أو أدهم أغر محجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Wahb, who was a Companion of the Prophet, said:                      \"The Messenger of Allah said: 'Call (your children) by the names of the prophets. And the most beloved names to Allah, the Mighty and Sublime, are 'Abdullah and 'Abdur-Rahman. Keep horses; wipe their forelocks and posteriors, and prepare them for Jihad, but do not prepare them to seek vengeance for people killed during the Jahiliyyah. You should seek out Kumait, horses with a white mark on the face and white feet, or red with a white mark on the face and white feet, or black with a white mark on the face and white feet.'\"",
      "chain": [
        "30375",
        "20637",
        "18745"
      ]
    }
  ],
  "total_hadiths": 6
}