{
  "id": "20638",
  "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
  "full_name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "167",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Tanuqi",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11670",
      "name": "Isma'il bin 'Ubaidullah bin Abi Muhajir إسماعيل بن عبيد الله بن أبي المهاجر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "17501",
      "name": "Bilal bin Sa'd bin Tamim بلال بن سعد بن تميم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10880",
      "name": "Sulaiman bin Musa al-Ashdaq سليمان بن موسى الأموي الأشدق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10877",
      "name": "Atyh bin Qays al-Klaby عطية بن قيس الكلابي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19201",
      "name": "Yonus bin Maysra bin Halbus يونس بن ميسرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26016",
      "name": "Salmah bin al-'Ayyar سلمة بن العيار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28238",
      "name": "Shryh bin Yazid al-Hdrmy شريح بن يزيد الحضرمي أبو حيوة الحمصي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30525",
      "name": "Yahya bin Ishaq يحيى بن إسحاق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20463",
      "name": "Mskyn bin Bkyr al-Hrany مسكين بن بكير الحراني أبو عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27536",
      "name": "'Umar bin Abd al-Wahd عمر بن عبد الواحد بن قيس السلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28372",
      "name": "'Abdul Malik bin Muhammad عبد الملك بن محمد الحميري البرسمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30330",
      "name": "al-Hakm bin Nafi', Abu al-Yaman الحكم بن نافع أبو اليمان الحمصي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30284",
      "name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30355",
      "name": "'Abdullah bin Yusuf al-Tunaysi عبد الله بن يوسف التنيسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36036",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن محمد أبو صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38550",
      "name": "Muhammad bin 'Uthman al-Tnwkhy محمد بن عثمان التنوخي أبو الجماهر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "29",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا مروان، - يعني ابن محمد الدمشقي - حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، قال قلت لطاوس إن فلانا حدثني بكذا، وكذا، ‏.‏ قال إن كان صاحبك مليا فخذ عنه ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "20640",
        "20638",
        "10880"
      ]
    },
    {
      "hadith_no": "454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن سعيد، - وهو ابن عبد العزيز - عن عطية بن قيس، عن قزعة، عن أبي سعيد الخدري، قال لقد كانت صلاة الظهر تقام فيذهب الذاهب إلى البقيع فيقضي حاجته ثم يتوضأ ثم يأتي ورسول الله صلى الله عليه وسلم في الركعة الأولى مما يطولها ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The noon prayer would start and one would go to al-Baqi' and after having relieved himself he would perform ablution and then come, while the Messenger of Allah (may peace be upon him) would be in the first rak'ah, because he would prolong it so much.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "10877",
        "38"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا مروان بن محمد الدمشقي، حدثنا سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم إذا رفع رأسه من الركوع قال ‏\"‏ ربنا لك الحمد ملء السموات والأرض وملء ما شئت من شىء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      When the Messenger of Allah (may peace be upon him) raised his head after bowing, he said: O Allah! our Lord, to Thee be the praise that would fill all the heavens and the earth, and all that it pleases Thee besides (them). O, thou art worthy of praise and glory, most worthy of what a servant says, and we all are Thy servants, no one can withhold what Thou givest or give what Thou withholdest, and riches cannot avail a wealthy person against Thee.",
      "chain": [
        "30025",
        "20640",
        "20638",
        "10877",
        "38"
      ]
    },
    {
      "hadith_no": "2450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، وسلمة بن شبيب، - قال سلمة حدثنا وقال الدارمي، أخبرنا مروان، وهو ابن محمد الدمشقي - حدثنا سعيد، - وهو ابن عبد العزيز - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو فحبيب إلى وأما هو عندي فأمين عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم تسعة أو ثمانية أو سبعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ وكنا حديث عهد ببيعة فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ قال فبسطنا أيدينا وقلنا قد بايعناك يا رسول الله فعلام نبايعك قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ فلقد رأيت بعض أولئك النفر يسقط سوط أحدهم فما يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " Malik al-Ashja'i reported:                      We, nine, eight or seven men, were in the company of the Messenger of Allah (may peace be upon him) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
      "chain": [
        "30025",
        "30417",
        "237",
        "30025",
        "20201",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "hadith_no": "2686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن سعيد بن عبد العزيز، عن إسماعيل، بن عبيد الله عن أم الدرداء، عن أبي الدرداء، - رضى الله عنه - قال خرجنا مع رسول الله صلى الله عليه وسلم في شهر رمضان في حر شديد حتى إن كان أحدنا ليضع يده على رأسه من شدة الحر وما فينا صائم إلا رسول الله صلى الله عليه وسلم وعبد الله بن رواحة ‏.‏",
      "text_en": " Abu Darda' (Allah be pleased with him) reported:                      We set out during the month of Ramadan with the Messenger of Allah (may peace be upon him) in such an intense heat that one of us would place his hand over his head (in order to protect himself) against the excessive heat, and none among us was observing the fast, except the Messenger of Allah (may peace be upon him) and 'Abdullah b. Rawaha.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "6737",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن بن بهرام الدارمي، حدثنا مروان، - يعني ابن محمد الدمشقي - حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم فيما روى عن الله، تبارك وتعالى أنه قال ‏\"‏ يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعا فاستغفروني أغفر لكم يا عبادي إنكم لن تبلغوا ضري فتضروني ولن تبلغوا نفعي فتنفعوني يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد ما نقص ذلك من ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه ‏\"‏ ‏.‏ قال سعيد كان أبو إدريس الخولاني إذا حدث بهذا الحديث جثا على ركبتيه ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying that Allah, the Exalted and Glorious, said:                      My servants, I have made oppression unlawful for Me and unlawful for you, so do not commit oppression against one another. My servants, all of you are liable to err except one whom I guide on the right path, so seek right guidance from Me so that I should direct you to the right path. O My servants, all of you are hungry (needy) except one whom I feed, so beg food from Me, so that I may give that to you. O My servants, all of you are naked (need clothes) except one whom I provide garments, so beg clothes from Me, so that I should clothe you. O My servants, you commit error night and day and I am there to pardon your sins, so beg pardon from Me so that I should grant you pardon. O My servants, you can neither do Me any harm nor can you do Me any good. O My servants, even if the first amongst you and the last amongst you and even the whole of human race of yours, and that of jinns even, become (equal in) God-conscious like the heart of a single person amongst you, nothing would add to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of the Jinns too in unison become the most wicked (all beating) like the heart of a single person, it would cause no loss to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of jinns also all stand in one plain ground and you ask Me and I confer upon every person what he asks for, it would not. in any way, cause any loss to Me (even less) than that which is caused to the ocean by dipping the needle in it. My servants, these for you I shall reward you for thern, so he who deeds of yours which I am recording finds good should praise Allah and he who does not find that should not blame anyone but his ownself. Sa'id said that when Abu Idris Khaulini narrated this hadith he knelt upon his knees.",
      "chain": [
        "20640",
        "20638",
        "11414",
        "11027",
        "23"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، عن سعيد بن عبد العزيز، عن زياد بن أبي سودة، عن ميمونة، مولاة النبي صلى الله عليه وسلم أنها قالت يا رسول الله أفتنا في بيت المقدس فقال ‏\"‏ ائتوه فصلوا فيه ‏\"‏ ‏.‏ - وكانت البلاد إذ ذاك حربا - فإن لم تأتوه وتصلوا فيه فابعثوا بزيت يسرج في قناديله ‏\"‏ ‏.‏",
      "text_en": " Narrated Maymunah ibn Sa'd:                     I said: Messenger of Allah, tell us the legal injunction about (visiting) Bayt al-Muqaddas (the dome of the Rock at Jerusalem). The Messenger of Allah (ﷺ) said: go and pray there. All the cities at that time were effected by war. If you cannot visit it and pray there, then send some oil to be used in the lamps.",
      "chain": [
        "30352",
        "20463",
        "20638",
        "18312"
      ]
    },
    {
      "hadith_no": "705",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سعيد بن عبد العزيز، عن مولى، ليزيد بن نمران عن يزيد بن نمران، قال رأيت رجلا بتبوك مقعدا فقال مررت بين يدى النبي صلى الله عليه وسلم وأنا على حمار وهو يصلي فقال ‏\"‏ اللهم اقطع أثره ‏\"‏ ‏.‏ فما مشيت عليها بعد ‏.‏",
      "text_en": " Yazid b. Namran said:                      I saw a crippled man at Tabuk. He (the man) said: I passed riding a donkey in front of the Prophet(ﷺ) who was praying. He said (cursing him): O Allah, cut off his walking. Thenceforth I could not walk.",
      "chain": [
        "31160",
        "20032",
        "20638"
      ]
    },
    {
      "hadith_no": "825",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن سهل الرملي، حدثنا الوليد، عن ابن جابر، وسعيد بن عبد العزيز، وعبد الله بن العلاء، عن مكحول، عن عبادة، نحو حديث الربيع بن سليمان قالوا فكان مكحول يقرأ في المغرب والعشاء والصبح بفاتحة الكتاب في كل ركعة سرا ‏.‏ قال مكحول اقرأ بها فيما جهر به الإمام إذا قرأ بفاتحة الكتاب وسكت سرا فإن لم يسكت اقرأ بها قبله ومعه وبعده لا تتركها على حال ‏.‏",
      "text_en": " The above mentioned tradition has been transmitted through a different chain of narrators by 'Ubadah b. al-samit like the version of al-Rabi’b Sulaiman. This version adds:                      Makhul used to recite Surah al Fatihah al-kitab quietly in the prayer in which the imam recites the Qur’an loudly when he observes the period of silence. If he does not observe the period of silence, recite it before him(i.e before his recitation), or along with him or after him; do not give it up in any case.",
      "chain": [
        "38403",
        "20733",
        "20638",
        "20399",
        "11066"
      ]
    },
    {
      "hadith_no": "847",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا الوليد، ح وحدثنا محمود بن خالد، حدثنا أبو مسهر، ح وحدثنا ابن السرح، حدثنا بشر بن بكر، ح وحدثنا محمد بن مصعب، حدثنا عبد الله بن يوسف، كلهم عن سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة بن يحيى، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم كان يقول حين يقول سمع الله لمن حمده ‏\"‏ اللهم ربنا لك الحمد ملء السماء ‏\"‏ ‏.‏ قال مؤمل ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد لا مانع لما أعطيت ‏\"‏ ‏.‏ زاد محمود ‏\"‏ ولا معطي لما منعت ‏\"‏ ‏.‏ ثم اتفقوا - ‏\"‏ ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏ قال بشر ‏\"‏ ربنا لك الحمد ‏\"‏ ‏.‏ لم يقل محمود ‏\"‏ اللهم ‏\"‏ ‏.‏ قال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-Khuri said:                      When the Messenger of Allah (ﷺ) said: “ Allah listens to him who praises Him,” he also said: O Allah, our Lord, to thee be the praise in all heavens. Mu’ammil said( in his version); “ In all the heavens, and in all the earth, and in all that it pleases Thee to create afterwards. O thou Who art worthy of praise and glory, most worthy of what a servant says, and we are all thy servants, no one can withhold what thou givest or give what Thou withholdest. “The narrators then were agreed on the words: “And riches cannot avail a wealthy person with Thee.”",
      "chain": [
        "38659",
        "20733",
        "37534",
        "30284",
        "30485",
        "20413",
        "28536",
        "30355",
        "20638",
        "10877",
        "11302",
        "38"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، عن سعيد بن عبد العزيز، عن مكحول، عن كثير بن مرة أبي شجرة، عن نعيم بن همار، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يقول الله عز وجل يا ابن آدم لا تعجزني من أربع ركعات في أول نهارك أكفك آخره ‏\"‏ ‏.‏",
      "text_en": " Narrated Nu'aym ibn Hammar:                     I heard the Messenger of Allah (ﷺ) say: Allah, the Exalted, says: Son of Adam, do not be helpless in performing four rak'ahs for Me at the beginning of the day: I will supply what you need till the end of it.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "11066",
        "19940",
        "5314"
      ]
    },
    {
      "hadith_no": "1642",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو إلى فحبيب وأما هو عندي فأمين عوف بن مالك قال كنا عند رسول الله صلى الله عليه وسلم سبعة أو ثمانية أو تسعة فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ وكنا حديث عهد ببيعة قلنا قد بايعناك حتى قالها ثلاثا فبسطنا أيدينا فبايعناه فقال قائل يا رسول الله إنا قد بايعناك فعلام نبايعك قال ‏\"‏ أن تعبدوا الله ولا تشركوا به شيئا وتصلوا الصلوات الخمس وتسمعوا وتطيعوا ‏\"‏ ‏.‏ وأسر كلمة خفية قال ‏\"‏ ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ قال فلقد كان بعض أولئك النفر يسقط سوطه فما يسأل أحدا أن يناوله إياه ‏.‏ قال أبو داود حديث هشام لم يروه إلا سعيد ‏.‏",
      "text_en": " Awf b. Malik said :                      We were with Messenger of Allah (May peace be upon him), seven or eight or nine.  He said : Do you take the oath of allegiance to the Messenger of Allah (May peace be upon him), and we shortly took the oath of allegiance.  We said: we have already taken the oath of allegiance to you.  He repeated the same words three times.  We then stretched our hands and took the oath of allegiance to him.  A man (or us) said : We took the oath of allegiance to you; now on what should we take the oath of allegiance, Messenger of Allah ?  He replied: That you should worship Allah, do not associate anything with Him, offer five times prayer, listen and obey.  He uttered a word quietly  : And do not beg from the people.  When the whip fell on the ground, none of that group asked anyone to pick up the whip for him.Abu Dawud said : The version of Hisham was not narrated by anyone except Sa'id.",
      "chain": [
        "30288",
        "20733",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "hadith_no": "2331",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عبد الواحد، حدثنا أبو مسهر، قال كان سعيد - يعني ابن عبد العزيز - يقول سره أوله ‏.‏ قال أبو داود وقال بعضهم سره وسطه وقالوا آخره ‏.‏",
      "text_en": " Narrated Ahmad b. 'Abd al-Wahid:                     On the authority of Abu Mushir. He said: Sa'id, that is, Ibn 'Abd al-'Aziz said: The meaning of the word sirraha is \"in the beginning of it (the month)\"",
      "chain": [
        "30284",
        "20638",
        "30002"
      ]
    },
    {
      "hadith_no": "2409",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، حدثني إسماعيل بن عبيد الله، حدثتني أم الدرداء، عن أبي الدرداء، قال خرجنا مع رسول الله صلى الله عليه وسلم في بعض غزواته في حر شديد حتى إن أحدنا ليضع يده على رأسه أو كفه على رأسه من شدة الحر ما فينا صائم إلا رسول الله صلى الله عليه وسلم وعبد الله بن رواحة ‏.‏",
      "text_en": " Narrated Abu al-Darda:                     We went out along with the Messenger of Allah (ﷺ) for some battle in intense heat, so much so that one of us placed his hand on his head, or placed his palm on his head, due to intense heat, No one of us fasted except the Messenger of Allah (ﷺ) and 'Abd Allah b. Rawahah.",
      "chain": [
        "38659",
        "20733",
        "20638",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3601",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن خلف بن طارق الرازي، حدثنا زيد بن يحيى بن عبيد الخزاعي، حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، بإسناده قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجوز شهادة خائن ولا خائنة ولا زان ولا زانية ولا ذي غمر على أخيه ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above (No. 3593) has also been transmitted by Sulayman ibn Musa through a different chain of narrators. This version has:                      The Messenger of Allah (ﷺ) said: The testimony of a deceitful man or woman, of an adulterer and adulteress, and of one who harbours rancour against his brother is not allowable.",
      "chain": [
        "30268",
        "27513",
        "20638",
        "10880"
      ]
    },
    {
      "hadith_no": "4638",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا علي بن سهل الرملي، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، عن مكحول، قال لتمخرن الروم الشام أربعين صباحا لا يمتنع منها إلا دمشق وعمان ‏.‏",
      "text_en": " Makhul said:                      The Romans will enter Syria and stay there for forty days, and no place will be saved from them but Damascus and 'Uman.",
      "chain": [
        "38403",
        "20733",
        "20638",
        "11066"
      ]
    },
    {
      "hadith_no": "4924",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن عبيد الله الغداني، حدثنا الوليد بن مسلم، حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، عن نافع، قال سمع ابن عمر، مزمارا - قال - فوضع أصبعيه على أذنيه ونأى عن الطريق وقال لي يا نافع هل تسمع شيئا قال فقلت لا ‏.‏ قال فرفع أصبعيه من أذنيه وقال كنت مع النبي صلى الله عليه وسلم فسمع مثل هذا فصنع مثل هذا ‏.‏ قال أبو علي اللؤلؤي سمعت أبا داود يقول هذا حديث منكر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Nafi' said: Ibn Umar heard a pipe, put his fingers in his ears and went away from the road. He said to me: Are you hearing anything? I said: No. He said: He then took his fingers out of his ears and said: I was with the Prophet (ﷺ), and he heard like this and he did like this. AbuAli al-Lu'lu said: I heard AbuDawud say: This is a rejected tradition.",
      "chain": [
        "34007",
        "20733",
        "20638",
        "10880",
        "11014"
      ]
    },
    {
      "hadith_no": "1684",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، أنبأنا عبد الله بن المبارك، أنبأنا سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة، عن أبي سعيد الخدري، قال لما بلغ النبي صلى الله عليه وسلم عام الفتح مر الظهران فآذننا بلقاء العدو فأمرنا بالفطر فأفطرنا أجمعون ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن عمر ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     \"During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.",
      "chain": [
        "30304",
        "20025",
        "20638",
        "10877",
        "38"
      ]
    },
    {
      "hadith_no": "4213",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو مسهر عبد الأعلى بن مسهر، عن سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن عبد الرحمن بن أبي عميرة، وكان، من أصحاب رسول الله صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال لمعاوية ‏\"‏ اللهم اجعله هاديا مهديا واهد به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abu 'Umairah - and he was one of the Companions of the Messenger of Allah (ﷺ):                     from the Prophet (ﷺ), that he said to Mu'awiyah: \"O Allah, make him a guiding one, and guide (others) by him.\"",
      "chain": [
        "11222",
        "20638",
        "11414"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن هشام، قال حدثنا مخلد، عن سعيد بن عبد العزيز، قال حدثنا يزيد بن أبي مالك، قال حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتيت بدابة فوق الحمار ودون البغل خطوها عند منتهى طرفها فركبت ومعي جبريل عليه السلام فسرت فقال انزل فصل ‏.‏ ففعلت فقال أتدري أين صليت صليت بطيبة وإليها المهاجر ثم قال انزل فصل ‏.‏ فصليت فقال أتدري أين صليت صليت بطور سيناء حيث كلم الله عز وجل موسى عليه السلام ثم قال انزل فصل ‏.‏ فنزلت فصليت فقال أتدري أين صليت صليت ببيت لحم حيث ولد عيسى عليه السلام ‏.‏ ثم دخلت بيت المقدس فجمع لي الأنبياء عليهم السلام فقدمني جبريل حتى أممتهم ثم صعد بي إلى السماء الدنيا فإذا فيها آدم عليه السلام ثم صعد بي إلى السماء الثانية فإذا فيها ابنا الخالة عيسى ويحيى عليهما السلام ثم صعد بي إلى السماء الثالثة فإذا فيها يوسف عليه السلام ثم صعد بي إلى السماء الرابعة فإذا فيها هارون عليه السلام ثم صعد بي إلى السماء الخامسة فإذا فيها إدريس عليه السلام ثم صعد بي إلى السماء السادسة فإذا فيها موسى عليه السلام ثم صعد بي إلى السماء السابعة فإذا فيها إبراهيم عليه السلام ثم صعد بي فوق سبع سموات فأتينا سدرة المنتهى فغشيتني ضبابة فخررت ساجدا فقيل لي إني يوم خلقت السموات والأرض فرضت عليك وعلى أمتك خمسين صلاة فقم بها أنت وأمتك ‏.‏ فرجعت إلى إبراهيم فلم يسألني عن شىء ثم أتيت على موسى فقال كم فرض الله عليك وعلى أمتك قلت خمسين صلاة ‏.‏ قال فإنك لا تستطيع أن تقوم بها أنت ولا أمتك فارجع إلى ربك فاسأله التخفيف ‏.‏ فرجعت إلى ربي فخفف عني عشرا ثم أتيت موسى فأمرني بالرجوع فرجعت فخفف عني عشرا ثم ردت إلى خمس صلوات ‏.‏ قال فارجع إلى ربك فاسأله التخفيف فإنه فرض على بني إسرائيل صلاتين فما قاموا بهما ‏.‏ فرجعت إلى ربي عز وجل فسألته التخفيف فقال إني يوم خلقت السموات والأرض فرضت عليك وعلى أمتك خمسين صلاة فخمس بخمسين فقم بها أنت وأمتك ‏.‏ فعرفت أنها من الله تبارك وتعالى صرى فرجعت إلى موسى عليه السلام فقال ارجع فعرفت أنها من الله صرى - أى حتم - فلم أرجع ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah (ﷺ) said:                      \"I was brought an animal that was larger than a donkey and smaller than a mule, whose stride could reach as far as it could see. I mounted it, and Jibril was with me, and I set off. Then he said: 'Dismount and pray,' so I did that. He said: 'Do you know where you have prayed? You have prayed in Taibah, which will be the place of the emigration.' Then he said: 'Dismount and pray,' so I prayed. He said: 'Do you know where you have prayed? You have prayed in Mount Sinai, where Allah, the Mighty and Sublime, spoke to Musa, peace be upon him.' So I dismounted and prayed, and he said: 'Do you know where you have prayed? You have prayed in Bethlehem, where 'Eisa, peace be upon him, was born.' Then I entered Bait Al-Maqdis (Jerusalem) where the Prophets, peace be upon them, were assembled for me, and Jibril brought me forward to lead them in prayer. Then I was taken up to the first heaven, where I saw Adam, peace be upon him. Then I was taken up to the second heaven where I saw the maternal cousins 'Eisa and Yahya, peace be upon them. Then I was taken up to the third heaven where I saw Yusuf, peace be upon him. Then I was taken up to the fourth heaven where I saw Harun, peace be upon him. Then I was taken up to the fifth heaven where I saw Idris, peace be upon him. Then I was taken up to the sixth heaven where I saw Musa, peace be upon him. Then I was taken up to the seventh heaven where I saw Ibrahim, peace be upon him. Then I was taken up above seven heavens and we came to Sidrah Al-Muntaha and I was covered with fog. I fell down prostrate and it was said to me: '(Indeed) The day I created the heavens and the Earth, I enjoined upon you and your Ummah fifty prayers, so establish them, you and your Ummah.' I came back to Ibrahim and he did not ask me about anything, then I came to Musa and he said: 'How much did your Lord enjoin upon you and your Ummah?' I said: 'Fifty prayers.' He said: 'You will not be able to establish them, neither you nor your Ummah. Go back to your Lord and ask Him to reduce it.' So I went back to my Lord and He reduced it by ten. Then I came to Musa and he told me to go back, so I went back and He reduced it by ten. Then I came to Musa and he told me to go back, so I went back and He reduced it by ten. Then it was reduced it by ten. Then it was reduced to five prayers. He (Musa) said: 'Go back to you Lord and ask Him to reduce it, for two prayers were enjoined upon the Children of Israel but they did not establish them.' So I went back to my Lord and asked Him to reduce it, but He said: 'The day I created the heavens and the Earth, I enjoined fifty prayers upon you and your Ummah. Five is for fifty, so establish them, you and your Ummah.' I knew that this was what Allah, the Mighty and Sublime, had determined so I went back to Musa, peace be upon him, and he said: 'Go back.' But I knew that it was what Allah had determined, so I did not go back.\"",
      "chain": [
        "38434",
        "20462",
        "20638",
        "19"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال أخبرنا الحبيب الأمين، عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ فرددها ثلاث مرات فقدمنا أيدينا فبايعناه فقلنا يا رسول الله قد بايعناك فعلام قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وأسر كلمة خفية أن لا تسألوا الناس شيئا ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik Al-Ashja'i said:                      \"We were with the Messenger of Allah (ﷺ) and he said: 'Will you not pledge to the Messenger of Allah (ﷺ)?' And he repeated it three times. So we stretched forth our hands to give our pledge. We said: 'O Messenger of Allah, we are willing to give you our pledge, but on what?' He said: 'That you will worship Allah and not associate anything with him, and (offer) the five daily prayers.' And he said, very quietly: 'And you will not ask the people for anything.'\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن ابن الديلمي، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن سليمان بن داود صلى الله عليه وسلم لما بنى بيت المقدس سأل الله عز وجل خلالا ثلاثة سأل الله عز وجل حكما يصادف حكمه فأوتيه وسأل الله عز وجل ملكا لا ينبغي لأحد من بعده فأوتيه وسأل الله عز وجل حين فرغ من بناء المسجد أن لا يأتيه أحد لا ينهزه إلا الصلاة فيه أن يخرجه من خطيئته كيوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:                      \"When Sulaiman bin Dawud finished building BAir Al-Maqdis, he asked Allah for three things: Judgement that was in harmony with His judgement, and he was given that. And he asked Allah for a dominion that no one after him would have, and he was given that. And when he finished building the Masjid he asked Allah, the Mighty and Sublime, that no one should come to it, intending only to pray there, but he would emerge free of sin as the day his mother bore him.\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "5136",
        "29"
      ]
    },
    {
      "hadith_no": "973",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا الوليد، عن سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة، عن أبي سعيد الخدري، قال لقد كانت صلاة الظهر تقام فيذهب الذاهب إلى البقيع فيقضي حاجته ثم يتوضأ ثم يجئ ورسول الله صلى الله عليه وسلم في الركعة الأولى يطولها ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Iqamah for Zuhr prayer would be said, and a person could go to the Al-Baqi', relieve himself, perform wudhu, and come (to the masjid), and the Messenger of Allah (ﷺ) would still be in the first rak'ah, making it lengthy.",
      "chain": [
        "10581",
        "20733",
        "20638",
        "10877",
        "38"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني عمرو بن هشام أبو أمية الحراني، قال حدثنا مخلد، عن سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة بن يحيى، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم كان يقول حين يقول ‏\"‏ سمع الله لمن حمده ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد خير ما قال العبد وكلنا لك عبد لا مانع لما أعطيت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     The Messenger of Allah (ﷺ) used to say: \"Sami Allahu liman hamidah, Rabbana wa lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'ama shi'ta min shai'in ba'd. Athlath-thana'i wal-majdi khairu ma qalal-'abdu wa kulluna laka 'abdun la mani'a lima a'taita wa la yanfa'u dhal-jaddi minkal-jadd (Allah hears the one who praises Him; Our Lord, to You be the Praise, filling the heavens, filling the Earth, and filling whatever else You will, Lord of Glory and Majesty, the truest thing a slave had said, and we are all slaves to You. None can withhold what You grant, nor can the possession of an owner benefit him before You.)\"",
      "chain": [
        "38434",
        "20462",
        "20638",
        "10877",
        "11302",
        "38"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن منصور، وهارون بن محمد بن بكار بن بلال، - واللفظ له - قالا حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن يحيى بن الحارث، عن أبي الأشعث الصنعاني، عن أوس بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غسل واغتسل وغدا وابتكر ودنا من الإمام ولم يلغ كان له بكل خطوة عمل سنة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws that:                     The Prophet (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, comes early to the masjid and sits near the imam, and does not engage in idle talk, he will have for every step he takes (the reward of) a year's worth of good deeds, fasting it and praying Qiyam during it.\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "19894",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "1540",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الرحيم البرقي، عن عبد الله بن يوسف، قال أنبأنا سعيد بن عبد العزيز، عن الزهري، قال كان عبد الله بن عمر يحدث أنه صلى صلاة الخوف مع رسول الله صلى الله عليه وسلم قال كبر النبي صلى الله عليه وسلم وصف خلفه طائفة منا وأقبلت طائفة على العدو فركع بهم النبي صلى الله عليه وسلم ركعة وسجدتين ثم انصرفوا وأقبلوا على العدو وجاءت الطائفة الأخرى فصلوا مع النبي صلى الله عليه وسلم ففعل مثل ذلك ثم سلم ثم قام كل رجل من الطائفتين فصلى لنفسه ركعة وسجدتين ‏.‏",
      "text_en": " It was narrated that Az-Zuhri said:                     \"Abdullah bin 'Umar used to narrate that he offered the fear prayer with the Messenger of Allah (ﷺ). He said: 'The Prophet (ﷺ) said the takbir and one group of us formed a row behind him while the other group faced the enemy. The Prophet (ﷺ) led them in bowing once and prostrating twice, then they moved away and faced the enemy, and the other group came and prayed with the Prophet (ﷺ), doing likewise. Then he said the taslim, then each man of both groups stood and prayed by himself, bowing once and prostrating twice.'\"",
      "chain": [
        "36057",
        "30355",
        "20638",
        "11013",
        "18"
      ]
    },
    {
      "hadith_no": "1814",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن ناصح، قال حدثنا مروان بن محمد، عن سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ من صلى أربع ركعات قبل الظهر وأربعا بعدها حرمه الله عز وجل على النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Habibah that:                     The Messenger of Allah (ﷺ) used to say: \"Whoever prays four rak'ahs before Zuhr and four after, Allah, the Mighty and Sublime, will forbid him from the Fire.\"",
      "chain": [
        "20640",
        "20638",
        "10880",
        "11066",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمود بن خالد، عن مروان بن محمد، قال حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، - قال مروان وكان سعيد إذا قرئ عليه عن أم حبيبة عن النبي صلى الله عليه وسلم أقر بذلك ولم ينكره وإذا حدثنا به هو لم يرفعه - قالت من ركع أربع ركعات قبل الظهر وأربعا بعدها حرمه الله على النار ‏.‏ قال أبو عبد الرحمن مكحول لم يسمع من عنبسة شيئا ‏.‏",
      "text_en": " It was narrated from Umm Habibah-and when this was narrated to Sa'eed from Umm Habibah from the Prophet (ﷺ), he would approve it and not deny it but when he narrated it to us, he did not attribute it to the Prophet (ﷺ)- she said:                     \"Whoever prays four rak'ahs before Zuhr and four after it, Allah (SWT) will forbid him from the Fire.\"",
      "chain": [
        "37534",
        "20640",
        "20638",
        "10880",
        "11066",
        "846",
        "59",
        "20201",
        "59"
      ]
    },
    {
      "hadith_no": "1816",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن إسحاق، قال حدثنا أبو عاصم، قال حدثنا سعيد بن عبد العزيز، قال سمعت سليمان بن موسى، يحدث عن محمد بن أبي سفيان، قال لما نزل به الموت أخذه أمر شديد فقال حدثتني أختي أم حبيبة بنت أبي سفيان قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرمه الله تعالى على النار ‏\"‏ ‏.‏",
      "text_en": " Sulaiman bin Musa narrated that:                     When Muhammad bin Abi Sufyan was dying, he was greatly distressed and said: \"My sister Umm Habibah bint Abi Sufyan said: 'The Messenger of Allah (ﷺ) said: Whoever maintains four rak'ahs before Zuhr and four after, Allah (SWT) will forbid him from the Fire.'\"",
      "chain": [
        "30580",
        "20241",
        "20638",
        "10880"
      ]
    },
    {
      "hadith_no": "4856",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عبد الواحد، قال حدثنا مروان بن محمد، قال حدثنا سعيد، - وهو ابن عبد العزيز - عن الزهري، قال جاءني أبو بكر بن حزم بكتاب في رقعة من أدم عن رسول الله صلى الله عليه وسلم ‏\"‏ هذا بيان من الله ورسوله ‏{‏ يا أيها الذين آمنوا أوفوا بالعقود ‏}‏ ‏\"‏ ‏.‏ فتلا منها آيات ثم قال ‏\"‏ في النفس مائة من الإبل وفي العين خمسون وفي اليد خمسون وفي الرجل خمسون وفي المأمومة ثلث الدية وفي الجائفة ثلث الدية وفي المنقلة خمس عشرة فريضة وفي الأصابع عشر عشر وفي الأسنان خمس خمس وفي الموضحة خمس ‏\"‏ ‏.‏",
      "text_en": " It was narrate that Az-Zuhri said:                     \"Abu Bakr bin Hazm brought me a letter on a piece of leather (which was ) from the Messenger of Allah: 'This is a statement from Allah and His Messenger: 'O you who believe! Fulfill (your obligations. And he quoted some Verses from it. Then he said: 'For a soul, one hundred camels; for an eye, fifty camels; for a hand, fifty; for a foot, fifty; for a blow to the head that reaches the brain, one-third of the Diyah: for a hand, fifty; for a stab wound that penetrates deeply, one-third of the Diyah; for a blow that breaks a bone, fifteen camels; for fingers, ten each; for teeth, five each; for a wound that exposes the bone, five. (Daif)",
      "chain": [
        "20640",
        "20638",
        "11013"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سعيد بن عبد العزيز، عن سليمان بن موسى، عن أبي سيارة المتعي، قال قلت يا رسول الله إن لي نحلا ‏.‏ قال ‏\"‏ أد العشر ‏\"‏ ‏.‏ قلت يا رسول الله احمها لي ‏.‏ فحماها لي ‏.‏",
      "text_en": " It was narrated that:                     Abu Sayyarah Al-Muta said: “I said: 'O Messenger of Allah! I have bees.' He said: 'Give one-tenth.' I said: 'O Messenger of Allah!' Protect it for me.' And he protected it for me.”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20638",
        "10880"
      ]
    },
    {
      "hadith_no": "2977",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا سعيد بن عبد العزيز التنوخي، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم، قال حدثني الحبيب الأمين، - أما هو إلى فحبيب وأما هو عندي فأمين - عوف بن مالك الأشجعي قال كنا عند النبي صلى الله عليه وسلم سبعة أو ثمانية أو تسعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فبسطنا أيدينا فقال قائل يا رسول الله إنا قد بايعناك فعلام نبايعك فقال ‏\"‏ أن تعبدوا الله ولا تشركوا به شيئا وتقيموا الصلوات الخمس وتسمعوا وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ قال فلقد رأيت بعض أولئك النفر يسقط سوطه فلا يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " ‘Awfbin Malik Al-Ashja’i said:                      “We were with the Prophet (ﷺ) –seven or eight or nine of us – and he said: ‘Will you not givepledgeto the Messenger of Allah?’ So we stretched forth our handsandsomeone said: ‘O Messenger of Allah, we have already given youourpledge. On what basis shall we give this pledge?’ He said: ‘(Onthebasis that) you will worship Allah and not associate anythingwithHim, you will establish the five daily prayers, you will listenandobey’ – then he spoke some words under his breath – ‘andyou will notask the people for anything.’ He said: ‘I saw someof that group. Ifhe dropped his whip he would not ask anyone to pickit up for him.’”",
      "chain": [
        "30288",
        "20733",
        "20638",
        "11414",
        "11027"
      ]
    },
    {
      "hadith_no": "3249",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا محمد بن شعيب، أخبرني سعيد بن عبد العزيز، حدثنا يونس بن ميسرة بن حلبس، قال خرجنا مع أبي سعيد الزرقي - صاحب رسول الله  صلى الله عليه وسلم  - إلى شراء الضحايا ‏.‏ قال يونس فأشار أبو سعيد إلى كبش أدغم ليس بالمرتفع ولا المتضع في جسمه فقال لي اشتر لي هذا ‏.‏ كأنه شبهه بكبش رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Yunusbin Maisarah bin Halbas said:                      “I went out with Abu Sa’eedAz-Zuraqi, the Companion of the Messenger of Allah (ﷺ), to buyanimalsor sacrifice.” Yunus said: “Abu Sa’eed pointed to a ramthat had someblackness around its ears and jaw, and was neither toobig nor toosmall, and said to me: ‘Buy this one for them, as itseems to resemblethe ram of the Messenger of Allah (ﷺ).’”",
      "chain": [
        "30285",
        "20732",
        "20638",
        "19201"
      ]
    }
  ],
  "total_hadiths": 33
}