{
  "id": "20646",
  "name": "Ja'far bin Brqan جعفر بن برقان",
  "full_name": "Ja'far bin Brqan جعفر بن برقان",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "al-Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Kalabi",
      "B.Zuhrah",
      "al-Ra'",
      "al-Raqqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "28091",
      "name": "Habib bin Abi Marzuq حبيب بن أبي مرزوق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20633",
      "name": "Kathir bin Hisham al-Klaby كثير بن هشام الكلابي أبو سهل الرقي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20667",
      "name": "'Umar bin Ayoub al-Bdy عمر بن أيوب العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28194",
      "name": "Zayd bin Abi al-Zrqa'a زيد بن أبي الزرقاء يزيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-367",
      "hadith_no": "367",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن حاتم، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، حدثنا يزيد بن الأصم، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ليسألنكم الناس عن كل شىء حتى يقولوا الله خلق كل شىء فمن خلقه ‏\"‏ ‏.‏",
      "text_en": " Yazid b. al-Asamm said:                      I heard Abu Huraira saying that the Messenger of Allah (may peace be upon him) observed: people will certainly ask you about everything till they will propound: Allah created every thing, but who created Allah?",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20633",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-497-3",
      "hadith_no": "497",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، وإسحاق بن إبراهيم، - واللفظ لعمرو - قال إسحاق أخبرنا وقال الآخرون، حدثنا وكيع، حدثنا جعفر بن برقان، عن يزيد بن الأصم، عن ميمونة بنت الحارث، قالت كان رسول الله صلى الله عليه وسلم إذا سجد جافى حتى يرى من خلفه وضح إبطيه ‏.‏ قال وكيع يعني بياضهما ‏.‏",
      "text_en": " Maimuna daughter of Harith reported:                      When the Messenger of Allah (may peace be upon him) prostrated, he kept his hands so much apart from each other that when it was seen from behind the armpits became visible. Waki' said: That is their whiteness.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30263",
        "30022",
        "30123",
        "30312",
        "20032",
        "20646",
        "10842",
        "61"
      ]
    },
    {
      "id": "sahih-muslim-1516",
      "hadith_no": "1516",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا زهير بن حرب، وأبو كريب وإسحاق بن إبراهيم عن وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بنحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5065",
      "hadith_no": "5065",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا كثير بن هشام، حدثنا جعفر، - وهو ابن برقان - حدثنا يزيد بن الأصم، قال سمعت معاوية بن أبي سفيان، ذكر حديثا رواه عن  النبي صلى الله عليه وسلم لم أسمعه روى عن النبي صلى الله عليه وسلم على منبره حديثا غيره قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد الله به خيرا يفقهه في الدين ولا تزال عصابة من المسلمين يقاتلون على الحق ظاهرين على من ناوأهم إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been related by, Yazid b. al-Asamm that he heard Mu'awiya b. Abu Sfyan quote a tradition from the Holy Prophet (may peace be upon him) which he related from the Prophet (mail peace he upon him) -and he did not hear him quote from the Holy Prophet (masy peace be upon him) any tradition other than this in the course of his sermon from the pulpit-that whom Allah wants to do a favour, He grants him an understanding of religion. A group of people from the Muslims will remain on the Right Path and continue until the Day of Judgment to triumph over those who oppose them.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20633",
        "20646",
        "10842",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-6708",
      "hadith_no": "6708",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عمرو الناقد، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، عن يزيد بن، الأصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله لا ينظر إلى صوركم وأموالكم ولكن ينظر إلى قلوبكم وأعمالكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upqn him) as saying:                      Verily Allah does not look to your faces and your wealth but He looks to your heart and to your deeds.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20633",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6877",
      "hadith_no": "6877",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، حدثنا  يزيد بن الأصم، عن أبي هريرة، بحديث يرفعه قال ‏\"‏ الناس معادن كمعادن الفضة والذهب خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا والأرواح جنود مجندة فما تعارف منها ائتلف وما تناكر منها اختلف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira narrated directly from Allah's Messenger (may peace be upon him) that he said:                      People are like mines of gold and silver; those who were excellent in Jahiliya (during the days of ignorance) are excellent In Islam, when they have, an understanding, and the souls are troops collected together and those who had a mutual familiarity amongst themselves in the store of prenatal existence would have affinity amongst them, (in this world also) and those who opposed one of them, would be at variance with one another.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20633",
        "20646",
        "10842"
      ]
    },
    {
      "id": "sahih-muslim-7005",
      "hadith_no": "7005",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، عن جعفر بن برقان، عن يزيد، بن الأصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقول أنا عند ظن عبدي بي وأنا معه إذا دعاني ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him as saying that Allah thus stated:                      I live in the thought of My servant as he thinks of Me and with him as he calls Me.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-534",
      "hadith_no": "534",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زهير بن حرب، حدثنا وكيع، حدثنا جعفر بن برقان، عن شداد، مولى عياض بن عامر عن بلال، أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ لا تؤذن حتى يستبين لك الفجر هكذا ‏\"‏ ‏.‏ ومد يديه عرضا قال أبو داود شداد مولى عياض لم يدرك بلالا ‏.‏",
      "text_en": " Narrated Bilal:                     The Messenger of Allah (ﷺ) said to Bilal: Do not call adhan until the dawn appears clearly to you in this way, stretching his hand in latitude.Abu Dawud said: Shaddad did not see Bilal.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20032",
        "20646",
        "18411",
        "24"
      ]
    },
    {
      "id": "sunan-abi-daud-2296",
      "hadith_no": "2296",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا جعفر بن برقان، حدثنا ميمون بن مهران، قال قدمت المدينة فدفعت إلى سعيد بن المسيب فقلت فاطمة بنت قيس طلقت فخرجت من بيتها فقال سعيد تلك امرأة فتنت الناس إنها كانت لسنة فوضعت على يدى ابن أم مكتوم الأعمى ‏.‏",
      "text_en": " Maimun bin Mihram said “I came to Median and went to Sa’id bin Al Musayyab”. I said (to him) Fathimah daughter of Qais was divorced and she shifted from her house. Sa’id said “This woman has perverted people. She was arrogant so she was placed with Ibn Umm Makhtum, the blind.”",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "20646",
        "11012"
      ]
    },
    {
      "id": "sunan-abi-daud-2532",
      "hadith_no": "2532",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو معاوية، حدثنا جعفر بن برقان، عن يزيد بن أبي نشبة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ ثلاثة من أصل الإيمان ‏:‏ الكف عمن قال لا إله إلا الله ولا تكفره بذنب ولا تخرجه من الإسلام بعمل، والجهاد ماض منذ بعثني الله إلى أن يقاتل آخر أمتي الدجال لا يبطله جور جائر ولا عدل عادل، والإيمان بالأقدار ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: Three things are the roots of faith: to refrain from (killing) a person who utters, \"There is no god but Allah\" and not to declare him unbeliever whatever sin he commits, and not to excommunicate him from Islam for his any action; and jihad will be performed continuously since the day Allah sent me as a prophet until the day the last member of my community will fight with the Dajjal (Antichrist). The tyranny of any tyrant and the justice of any just (ruler) will not invalidate it. One must have faith in Divine decree.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "20646",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-3407",
      "hadith_no": "3407",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عمر بن أيوب، عن جعفر بن برقان، عن ثابت بن الحجاج، عن زيد بن ثابت، قال نهى رسول الله صلى الله عليه وسلم عن المخابرة ‏.‏ قلت وما المخابرة قال أن تأخذ الأرض بنصف أو ثلث أو ربع ‏.‏",
      "text_en": " Narrated Zaid b. Thabit:                     The Messenger of Allah (ﷺ) forbade mukhabarah. I asked: What is mukhabarah ? He replied: That you have the land (for cultivation) for half, a third, or a quarter (of the produce).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20667",
        "20646",
        "18099",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-3410",
      "hadith_no": "3410",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا عمر بن أيوب، حدثنا جعفر بن برقان، عن ميمون بن مهران، عن مقسم، عن ابن عباس، قال افتتح رسول الله صلى الله عليه وسلم خيبر واشترط أن له الأرض وكل صفراء وبيضاء ‏.‏ قال أهل خيبر نحن أعلم بالأرض منكم فأعطناها على أن لكم نصف الثمرة ولنا نصف ‏.‏ فزعم أنه أعطاهم على ذلك فلما كان حين يصرم النخل بعث إليهم عبد الله بن رواحة فحزر عليهم النخل وهو الذي يسميه أهل المدينة الخرص فقال في ذه كذا وكذا قالوا أكثرت علينا يا ابن رواحة ‏.‏ فقال فأنا ألي حزر النخل وأعطيكم نصف الذي قلت ‏.‏ قالوا هذا الحق وبه تقوم السماء والأرض قد رضينا أن نأخذه بالذي قلت ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) conquered Khaibar, and stipulated that all the land, gold and silver would belong to him. The people of Khaibar said: we know the land more than you ; so give it to us on condition that you should have half of the produce and we would have the half. He then gave it to them on that condition. When the time of picking the fruits of the palm-trees came, he sent 'Abd Allah b. Rawahah to them, and he assessed the among of the fruits of the palm-trees. This is what the people of Medina call khars (assessment). He used to say: In these palm-trees there is such-and-such amount (of produce). They would say: You assessed more to us, Ibn Rawahah (than the real amount). He would say: I first take the responsibility of assessing the fruits of the palm-trees and give you half of (the amount) I said. They would say: This is true, and on this (equity) stand the heavens and the earth. We agreed that we should take (the amount which) you said.",
      "usc_msa_ref": "",
      "chain": [
        "38120",
        "20667",
        "20646",
        "11012",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3411",
      "hadith_no": "3411",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سهل الرملي، حدثنا زيد بن أبي الزرقاء، عن جعفر بن برقان، بإسناده ومعناه قال فحزر وقال عند قوله وكل صفراء وبيضاء يعني الذهب والفضة له ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Ja'far b. Burqan through his chain and to the same effect. This version has:                      He said: He assessed, and after the words of kull safara' wa baida', he said: that is, gold and silver will belong to him.",
      "usc_msa_ref": "",
      "chain": [
        "28194",
        "20646"
      ]
    },
    {
      "id": "sunan-abi-daud-3412",
      "hadith_no": "3412",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا كثير، - يعني ابن هشام - عن جعفر بن برقان، حدثنا ميمون، عن مقسم، أن النبي صلى الله عليه وسلم حين افتتح خيبر فذكر نحو حديث زيد قال فحزر النخل وقال فأنا ألي جذاذ النخل وأعطيكم نصف الذي قلت ‏.‏",
      "text_en": " Narrated Miqsam:                     When the Prophet (ﷺ) conquered Khaibar. He then narrated it like the tradition of Zaid (b. Abu al-Zarqa'). This version has: He then assessed the produce of the palm-trees and said: I take the job of picking the fruit myself, and I shall give you half of (the amount) I said.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20633",
        "20646",
        "11725"
      ]
    },
    {
      "id": "sunan-abi-daud-3774",
      "hadith_no": "3774",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا كثير بن هشام، عن جعفر بن برقان، عن الزهري، عن سالم، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن مطعمين عن الجلوس على مائدة يشرب عليها الخمر وأن يأكل الرجل وهو منبطح على بطنه ‏.‏ قال أبو داود هذا الحديث لم يسمعه جعفر من الزهري وهو منكر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) forbade two kinds of food: to sit at cloth on which wine is drunk, and to eat by a man while lying on his stomach.Abu Dawud said : Ja'far did not hear this tradition from al-Zuhri. His tradition is rejected.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20633",
        "20646",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4181",
      "hadith_no": "4181",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا عمر بن أيوب، عن جعفر بن برقان، عن ثابت بن الحجاج، عن عبد الله الهمداني، عن الوليد بن عقبة، قال لما فتح نبي الله صلى الله عليه وسلم مكة جعل أهل مكة يأتونه بصبيانهم فيدعو لهم بالبركة ويمسح رءوسهم قال فجيء بي إليه وأنا مخلق فلم يمسني من أجل الخلوق ‏.‏",
      "text_en": " Narrated Al-Walid ibn Uqbah:                     When the Prophet of Allah (ﷺ) conquered Makkah. The people of Makkah began to bring their boys and he would invoke a blessing on them and rub their heads. I was brought, but as I had been perfumed with khaluq, he did not touch me because of the khaluq.",
      "usc_msa_ref": "",
      "chain": [
        "38120",
        "20667",
        "20646",
        "18099"
      ]
    },
    {
      "id": "sunan-abi-daud-4834",
      "hadith_no": "4834",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا جعفر، - يعني ابن برقان - عن يزيد، - يعني ابن الأصم - عن أبي هريرة، يرفعه قال ‏\"‏ الأرواح جنود مجندة فما تعارف منها ائتلف وما تناكر منها اختلف ‏\"‏ ‏.‏",
      "text_en": " ABU HURAIRAH REPORTED THE PROPHET(MAY PEACE BE UPON HIM) AS SAYING:                      THE SPIRITS ARE IN MARSHALLED HOSTS; THOSE WHO KNOW ONE ANOTHER WILL BE FRIENDLY, AND THOSE WHO DO NOT, WILL KEEP APART.",
      "usc_msa_ref": "",
      "chain": [
        "38673",
        "20646",
        "10842"
      ]
    },
    {
      "id": "jami-al-tirmidhi-217",
      "hadith_no": "217",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقد هممت أن آمر فتيتي أن يجمعوا حزم الحطب ثم آمر بالصلاة فتقام ثم أحرق على أقوام لا يشهدون الصلاة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن مسعود وأبي الدرداء وابن عباس ومعاذ بن أنس وجابر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم أنهم قالوا من سمع النداء فلم يجب فلا صلاة له ‏.‏ وقال بعض أهل العلم هذا على التغليظ والتشديد ولا رخصة لأحد في ترك الجماعة إلا من عذر ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"I was about to order my boys to collect bundles of firewood, then order Salat to be held, then burn (the homes) of the people who did not attend the Salat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-735",
      "hadith_no": "735",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، عن الزهري، عن عروة، عن عائشة، قالت كنت أنا وحفصة، صائمتين فعرض لنا طعام اشتهيناه فأكلنا منه فجاء رسول الله صلى الله عليه وسلم فبدرتني إليه حفصة وكانت ابنة أبيها فقالت يا رسول الله إنا كنا صائمتين فعرض لنا طعام اشتهيناه فأكلنا منه ‏.‏ قال ‏\"‏ اقضيا يوما آخر مكانه ‏\"‏ ‏.‏ قال أبو عيسى وروى صالح بن أبي الأخضر ومحمد بن أبي حفصة هذا الحديث عن الزهري عن عروة عن عائشة مثل هذا ‏.‏ ورواه مالك بن أنس ومعمر وعبيد الله بن عمر وزياد بن سعد وغير واحد من الحفاظ عن الزهري عن عائشة مرسلا ‏.‏ ولم يذكروا فيه عن عروة وهذا أصح ‏.‏  لأنه روي عن ابن جريج، قال سألت الزهري قلت له أحدثك عروة عن عائشة قال لم أسمع من عروة في هذا شيئا ولكني سمعت في خلافة سليمان بن عبد الملك من ناس عن بعض من سأل عائشة عن هذا الحديث ‏.‏ حدثنا بذلك علي بن عيسى بن يزيد البغدادي حدثنا روح بن عبادة عن ابن جريج فذكر الحديث ‏.‏ وقد ذهب قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلى هذا الحديث فرأوا عليه القضاء إذا أفطر وهو قول مالك بن أنس ‏.‏",
      "text_en": " Aishah narrated:                     \"Hafsah and I were both fasting when we were presented some food that we really wanted, so we ate from it. The Messenger of Allah came, and Hafsah beat me to him - she was the daughter of her father - and she said: 'O Messenger of Allah! We were both fasting when we were presented with some food that we wanted, so we ate from it.' He said: 'Make up another day in its place.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20633",
        "20646",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2388",
      "hadith_no": "2388",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقول أنا عند ظن عبدي في وأنا معه إذا دعاني ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed Allah Most High says: 'I am as My slave thinks of Me, and I am with him when He  calls upon Me.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2390",
      "hadith_no": "2390",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، حدثنا حبيب بن أبي مرزوق، عن عطاء بن أبي رباح، عن أبي مسلم الخولاني، حدثني معاذ بن جبل، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله عز وجل المتحابون في جلالي لهم منابر من نور يغبطهم النبيون والشهداء ‏\"‏ ‏.‏ وفي الباب عن أبي الدرداء وابن مسعود وعبادة بن الصامت وأبي هريرة وأبي مالك الأشعري ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو مسلم الخولاني اسمه عبد الله بن ثوب ‏.‏",
      "text_en": " Mu'adh binJabal narrated that the Messenger of Allah (s.a.w) said:                     \"Allah, the Mighty and Sublime, said: 'Those who love each other for the sake of My Majesty shall be upon podiums of light, and they will be admired by the Prophets and the martyrs.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20633",
        "20646",
        "28091",
        "11029",
        "11026",
        "32"
      ]
    },
    {
      "id": "sunan-an-nasai-2025",
      "hadith_no": "2025",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا المغيرة بن عبد الرحمن، قال حدثنا زيد بن علي، - وهو أبو أسامة - قال حدثنا جعفر بن برقان، عن حبيب بن أبي مرزوق، عن عطاء، عن جابر، ‏:‏ أن النبي صلى الله عليه وسلم صلى على قبر امرأة بعد ما دفنت ‏.‏",
      "text_en": " It was narrated from Jabir:                     That the Prophet prayed at the grave of a woman after she had been buried.",
      "usc_msa_ref": "",
      "chain": [
        "20182",
        "20646",
        "28091",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-4516",
      "hadith_no": "4516",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا هارون بن زيد بن أبي الزرقاء، قال حدثنا أبي قال، حدثنا جعفر بن برقان، قال بلغني عن الزهري، عن سالم، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن لبستين ونهانا رسول الله صلى الله عليه وسلم عن بيعتين عن المنابذة والملامسة وهي بيوع كانوا يتبايعون بها في الجاهلية ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"The Messenger of Allah forbade two kinds of garments, and he forbade two kinds of transactions for us: Munabadhah and Mulamasah, which are kinds of transactions which were common during the Jahiliyyah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38673",
        "20646",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1508",
      "hadith_no": "1508",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا جعفر بن مسافر، حدثني كثير بن هشام، حدثنا جعفر بن برقان، عن ميمون بن مهران، عن عمر بن الخطاب، قال قال لي النبي  صلى الله عليه وسلم  ‏\"‏ إذا دخلت على مريض فمره أن يدعو لك فإن دعاءه كدعاء الملائكة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Al-Khattab said:                      “The Prophet (ﷺ)saidto me: ‘When you enter upon one who is sick, tell him to pray foryou, for his supplication is like the supplication of the angels.’”",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20633",
        "20646",
        "11012",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-1892",
      "hadith_no": "1892",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا عمر بن أيوب، عن جعفر بن برقان، عن ميمون بن مهران، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  حين افتتح خيبر اشترط عليهم أن له الأرض وكل صفراء وبيضاء ‏.‏ يعني الذهب والفضة ‏.‏ وقال له أهل خيبر نحن أعلم بالأرض فأعطناها على أن نعملها ويكون لنا نصف الثمرة ولكم نصفها ‏.‏ فزعم أنه أعطاهم على ذلك فلما كان حين يصرم النخل بعث إليهم ابن رواحة فحزر النخل وهو الذي يدعونه أهل المدينة الخرص فقال في ذا كذا وكذا ‏.‏ فقالوا أكثرت علينا يا ابن رواحة ‏.‏ فقال فأنا أحزر النخل وأعطيكم نصف الذي قلت ‏.‏ قال فقالوا هذا الحق وبه تقوم السماء والأرض ‏.‏ فقالوا قد رضينا أن نأخذ بالذي قلت ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     when the Prophet conquered Khaibar, he stipulated that the land, and all the yellow and white, meaning gold and silver belonged to him. The people of Khaibar said to him: “We know the land better, so give it to us so that we may work the land, and you will have half of its produce and we will have half.” He maintained that, he gave it to them on that basis. When the time for the date harvest came, he sent Ibn Rawahah to them. He assesses the date palms, and he said: “For this tree, such and such (amount).” They said: “You are demanding too much of us, O Ibn Rawahah!” He said: “This is my assessment and I will give you half of what I say.” They said: “This is fair, and fairness is what haven and earth are based on.” They said: “We Agree to take (accept) what you say.”",
      "usc_msa_ref": "",
      "chain": [
        "35154",
        "20667",
        "20646",
        "11012",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3495",
      "hadith_no": "3495",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، عن الزهري، عن سالم، عن أبيه، قال نهى رسول الله  صلى الله عليه وسلم  أن يأكل الرجل وهو منبطح على وجهه ‏.‏",
      "text_en": " It wasnarrated from Salim that his father said:                      “The Messenger ofAllah(ﷺ) forbade a man from eating while lying down on his face.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20633",
        "20646",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 26
}