{
  "id": "20645",
  "name": "al-Jarrah bin Malih bin 'Ady الجراح بن مليح بن عدي",
  "full_name": "al-Jarrah bin Malih bin 'Ady الجراح بن مليح بن عدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "181",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  د  ت  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11562",
      "name": "'Imran bin Muslim al-Munqari عمران بن مسلم المنقري القصير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20233",
      "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20586",
      "name": "Sufyan bin 'Uqba al-Swa'iy سفيان بن عقبة السوائي الكوفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30523",
      "name": "Mansur bin Abi Mazahim منصور بن أبي مزاحم بشير التركي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "62",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا حسن الحلواني، حدثنا أبو يحيى الحماني، حدثنا قبيصة، وأخوه، أنهما سمعا الجراح بن مليح، يقول سمعت جابرا، يقول عندي سبعون ألف حديث عن أبي جعفر، عن النبي صلى الله عليه وسلم كلها ‏.‏",
      "text_en": "",
      "chain": [
        "130115",
        "20332",
        "20351",
        "20645",
        "34"
      ]
    },
    {
      "hadith_no": "2075",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا عمرو الناقد، وأبو كريب قالا حدثنا وكيع، عن سفيان، كلاهما عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان منكم مصليا بعد الجمعة فليصل أربعا ‏\"‏ ‏.‏ وليس في حديث جرير ‏\"‏ منكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When any one amongst you observes prayer after Jumu'a, he should observe four rak'ahs. (In the hadith transmitted by Jarir the word minkum is not recorded.)",
      "chain": [
        "30022",
        "20028",
        "30263",
        "30216",
        "20032",
        "20645",
        "13"
      ]
    },
    {
      "hadith_no": "5984",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، ح وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا محمد بن الصباح، حدثنا إسماعيل يعني ابن زكرياء، ح وحدثنا أبو كريب، حدثنا وكيع، عن سفيان، كلهم عن سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث خالد عن سهيل إلا جريرا وحده فإن في حديثه ‏\"‏ من قتل وزغا في أول ضربة كتبت له مائة حسنة وفي الثانية دون ذلك وفي الثالثة دون ذلك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Huraira through another chain of transmitters (and the words are):                      - He who killed a gecko with the first stroke for him are ordained one hundred virtues, and with the second one less than that and with the third one less than that.",
      "chain": [
        "30367",
        "20469",
        "30022",
        "20028",
        "30269",
        "20313",
        "30216",
        "20032",
        "20645",
        "13"
      ]
    },
    {
      "hadith_no": "6959",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، وأبي، قالا حدثنا الأعمش، ح وحدثني أبو سعيد الأشج، - واللفظ له - حدثنا وكيع، حدثنا الأعمش، عن أبي وائل، قال كنت جالسا مع عبد الله وأبي موسى فقالا قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بين يدى الساعة أياما يرفع فيها العلم وينزل فيها الجهل ويكثر فيها الهرج والهرج القتل ‏\"‏ ‏.‏",
      "text_en": " Abu Wa'il reported:                      I was sitting with 'Abdullah and Abu Musa that they reported Allah's Messenger (may peace be upon him) having said: Prior to the Last Hour, there would be a time when knowledge would be taken away, and ignorance would take its place and there would be bloodshed on a large scale.",
      "chain": [
        "30212",
        "20032",
        "20645",
        "11060",
        "30200",
        "20032",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "2419",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي، حدثنا وهب، حدثنا موسى بن على، ح وحدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن موسى بن على، - والإخبار في حديث وهب - قال سمعت أبي أنه، سمع عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام وهي أيام أكل وشرب ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Prophet (ﷺ) said: The day of Arafah, the day of sacrifice, the days of tashriq are (the days of) our festival, O people of Islam. These are the days of eating and drinking.",
      "chain": [
        "30115",
        "20298",
        "30203",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "hadith_no": "2722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عباد الأزدي، قال حدثنا وكيع، عن أبيه، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله بن مسعود، قال نفلني رسول الله صلى الله عليه وسلم يوم بدر سيف أبي جهل كان قتله ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     At the battle of Badr the Messenger of Allah gave me AbuJahl's sword, as I had killed him.",
      "chain": [
        "20032",
        "20645",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "3192",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، حدثنا موسى بن على بن رباح، قال سمعت أبي يحدث، أنه سمع عقبة بن عامر، قال ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل وحين تضيف الشمس للغروب حتى تغرب أو كما قال ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     There were three times at which the Messenger of Allah (ﷺ) used to forbid us to pray or bury our dead - when the sun begins to rise till it is fully up, when the sun is at its height midway till it passes the meridian, and when the sun draws near to setting till it sets, or as he said.",
      "chain": [
        "30203",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "hadith_no": "773",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن موسى بن على، عن أبيه، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام وهي أيام أكل وشرب ‏\"‏ ‏.‏ قال وفي الباب عن علي وسعد وأبي هريرة وجابر ونبيشة وبشر بن سحيم وعبد الله بن حذافة وأنس وحمزة بن عمرو الأسلمي وكعب بن مالك وعائشة وعمرو بن العاص وعبد الله بن عمرو ‏.‏ قال أبو عيسى وحديث عقبة بن عامر حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم يكرهون الصيام أيام التشريق إلا أن قوما من أصحاب النبي صلى الله عليه وسلم وغيرهم رخصوا للمتمتع إذا لم يجد هديا ولم يصم في العشر أن يصوم أيام التشريق ‏.‏ وبه يقول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ قال أبو عيسى وأهل العراق يقولون موسى بن علي بن رباح وأهل مصر يقولون موسى بن على ‏.‏ وقال سمعت قتيبة يقول سمعت الليث بن سعد يقول قال موسى بن علي لا أجعل أحدا في حل صغر اسم أبي ‏.‏",
      "text_en": " Uqbah bin Amir narrated that :                     The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"",
      "chain": [
        "30480",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "hadith_no": "1030",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن موسى بن على بن رباح، عن أبيه، عن عقبة بن عامر الجهني، قال ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل وحين تضيف الشمس للغروب حتى تغرب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يكرهون الصلاة على الجنازة في هذه الساعات ‏.‏ وقال ابن المبارك معنى هذا الحديث أن نقبر فيهن موتانا ‏.‏ يعني الصلاة على الجنازة ‏.‏ وكره الصلاة على الجنازة عند طلوع الشمس وعند غروبها وإذا انتصف النهار حتى تزول الشمس ‏.‏ وهو قول أحمد وإسحاق ‏.‏ قال الشافعي لا بأس بالصلاة على الجنازة في الساعات التي تكره فيهن الصلاة ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhni narrated:                     \"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"",
      "chain": [
        "30480",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "hadith_no": "1808",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن مدويه، حدثنا مسدد، حدثنا الجراح بن مليح، والد، وكيع، عن أبي إسحاق، عن شريك بن حنبل، عن علي، أنه قال نهي عن أكل الثوم، إلا مطبوخا ‏.‏",
      "text_en": " Narrated Sharik bin Hanbal:                     That 'Ali said: \"Eating garlic was prohibited except when cooked.\"",
      "chain": [
        "30175",
        "20645",
        "20032",
        "11049",
        "15232",
        "5"
      ]
    },
    {
      "hadith_no": "8",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو عبد الله، قال حدثنا هشام بن عمار، حدثنا الجراح بن مليح، حدثنا بكر بن زرعة، قال سمعت أبا عنبة الخولاني، وكان، قد صلى القبلتين مع رسول الله  صلى الله عليه وسلم  قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا يزال الله يغرس في هذا الدين غرسا يستعملهم في طاعته ‏\"‏ ‏.‏",
      "text_en": " Abu 'Inabah Al-Khawlani said that:                     The Messenger of Allah (ﷺ) said: \"Allah will continue to plant new people in this religion and use them in His obedience.\"",
      "chain": [
        "30184",
        "30288",
        "20645"
      ]
    },
    {
      "hadith_no": "91",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا يحيى بن أبي حية أبو جناب الكلبي، عن أبيه، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا عدوى ولا طيرة ولا هامة ‏\"‏ ‏.‏ فقام إليه رجل أعرابي فقال يا رسول الله أرأيت البعير يكون به الجرب فيجرب الإبل كلها قال ‏\"‏ ذلكم القدر فمن أجرب الأول ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah (ﷺ) said: 'There is no 'Adwa (contagion), no Tiyarah (evil omen) and no Hamah.' A Bedouin man stood up and said: 'O Messenger of Allah, what do you think about a camel that suffers from mange and then all other camels get mange?' He said: 'That is because of the Divine Decree. How else did the first one get mange?'\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20645",
        "18"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن أبيه، ح وحدثنا محمد بن يحيى، حدثنا عبد الرزاق، عن سفيان، عن أبي فزارة العبسي، عن أبي زيد، مولى عمرو بن حريث عن عبد الله بن مسعود، أن رسول الله  صلى الله عليه وسلم  قال له ليلة الجن ‏\"‏ عندك طهور ‏\"‏ ‏.‏ قال لا إلا شىء من نبيذ في إداوة ‏.‏ قال ‏\"‏ تمرة طيبة وماء طهور ‏\"‏ ‏.‏ فتوضأ ‏.‏ هذا حديث وكيع ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mas'ud that :                     On the night of the jinn, the Messenger of Allah said to him: \"Do you have water for ablution?\" He said: \"No, I have nothing, but some Nabidh in a vessel.\" He said: \"Good dates and pure water (i.e. there is no harm from the mixing of the two).\" So he performed ablution with it. This is the narration of Waki'.",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20645",
        "11222",
        "20121",
        "20005",
        "19264",
        "16"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا وكيع، عن عبد الله بن عمرو بن مرة، عن أبيه، عن سالم بن أبي الجعد، عن ثوبان، قال لما نزل في الفضة والذهب ما نزل قالوا فأى المال نتخذ قال عمر فأنا أعلم لكم ذلك ‏.‏ فأوضع على بعيره فأدرك النبي  صلى الله عليه وسلم  وأنا في أثره فقال يا رسول الله أى المال نتخذ فقال ‏\"‏ ليتخذ أحدكم قلبا شاكرا ولسانا ذاكرا وزوجة مؤمنة تعين أحدكم على أمر الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Thawban said: “When the Verse concerning silver and gold was revealed, they said: 'What kind of wealth should we acquire?' Umar said: 'I will tell you about that.' So he rode on his camel and caught up with the Prophet, and I followed him. He said: 'O Messenger of Allah what kind of wealth should we acquire?' He said: 'Let one of acquire a thankful heart, a tongue that remembers Allah and a believing wife who will help him with regard to the Hereafter.' ”",
      "chain": [
        "38475",
        "20032",
        "20645",
        "11342",
        "130"
      ]
    },
    {
      "hadith_no": "2735",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا أبي، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، قال قضى رسول الله صلى الله عليه وسلم بالدية على العاقلة ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     “The Messenger of Allah (ﷺ) ruled that the blood money must be paid by the 'Aqilah.”",
      "chain": [
        "38409",
        "20032",
        "20645",
        "11067",
        "11051",
        "10798",
        "166"
      ]
    },
    {
      "hadith_no": "3102",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، حدثنا أبي، عن عطاء بن السائب، عن كثير بن جمهان، عن ابن عمر، قال إن أسع بين الصفا والمروة فقد رأيت رسول الله  صلى الله عليه وسلم  يسعى وإن أمش فقد رأيت رسول الله  صلى الله عليه وسلم  يمشي وأنا شيخ كبير ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “If I go quickly between SafaandMarwah, that is because I saw the Messenger of Allah (ﷺ) goingquickly, and if I walk that is because I saw the Messenger of Allah(ﷺ) walking, even though I am an old man.”",
      "chain": [
        "38409",
        "20032",
        "20645",
        "11068",
        "19939",
        "18"
      ]
    },
    {
      "hadith_no": "3336",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عبد الله، حدثنا وكيع، عن أبيه، عن منصور، عن إبراهيم، عن همام بن الحارث النخعي، عن عدي بن حاتم، قال سألت رسول الله  صلى الله عليه وسلم  عن المعراض فقال ‏\"‏ لا تأكل إلا أن يخزق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Adi bit Hatim said:                      “I asked the Messenger ofAllah (ﷺ) about Mi’rad. He said: ‘Do not eat unless you pierce(thegame).’”",
      "chain": [
        "20032",
        "20645",
        "11067",
        "11051",
        "11400",
        "212"
      ]
    },
    {
      "hadith_no": "3669",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أبي جناب، عن أبيه، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا عدوى ولا طيرة ولا هامة ‏\"‏ ‏.‏ فقام إليه رجل فقال يا رسول الله البعير يكون به الجرب فتجرب به الإبل ‏.‏ قال ‏\"‏ ذلك القدر فمن أجرب الأول ‏\"‏ ‏.‏",
      "text_en": " Ibn‘Umar said:                      “The Messenger of Allah (ﷺ) said: ‘There is no‘Adwa, no omen, and no Hamah.’ A man stood up and said: ‘OMessengerof Allah, what if a camel has mange and another camel getsmange fromit?’ He said: ‘That is the Divine decree. Who causesthe mange in thefirst one?’”",
      "chain": [
        "30201",
        "20032",
        "20645",
        "18"
      ]
    }
  ],
  "total_hadiths": 18
}