{
  "id": "20644",
  "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
  "full_name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "115",
      "date_gregorian": "733",
      "date_display": [
        "115 AH",
        "733 CE"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "197",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Kula'i",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11720",
      "name": "Muhammad bin Ziyad al-Alhani محمد بن زياد الألهاني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20459",
      "name": "Muhammad bin al-Walid al-Zubaidi محمد بن الوليد بن عامر الزبيدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27550",
      "name": "Mua'wiya bin Yahya al-Sdfy معاوية بن يحيى الصدفي أبو روح الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28572",
      "name": "Mua'wiya bin Yahya معاوية بن يحيى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27053",
      "name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30558",
      "name": "'Isa bin al-Mndhr al-Slmy عيسى بن المنذر السلمي أبو موسى الحمصي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "31645",
      "name": "Atyh bin Bqyh bin al-Walid عطية بن بقية بن الوليد",
      "grade": "3rd Century AH"
    },
    {
      "id": "30288",
      "name": "Hisham bin 'Ammar bin Nasayr هشام بن عمار بن نصير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30572",
      "name": "Yazid bin Abd Rbh يزيد بن عبد ربه الزبيدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38462",
      "name": "Kathir bin 'Ubaid bin Nmyr كثير بن عبيد بن نمير المذحجي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3587",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني إسحاق بن منصور، حدثني عيسى بن المنذر، حدثنا بقية، حدثنا الزبيدي، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من دعي إلى عرس أو نحوه فليجب ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleated with them) reported Allah's Messenger (may peace be upon him) having said:                      He who is invited to a wedding feast or like it, he should accept it.",
      "chain": [
        "30313",
        "20644",
        "20459",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "175",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، عن بحير، - هو ابن سعد - عن خالد، عن بعض، أصحاب النبي أن النبي صلى الله عليه وسلم رأى رجلا يصلي وفي ظهر قدمه لمعة قدر الدرهم لم يصبها الماء فأمره النبي صلى الله عليه وسلم أن يعيد الوضوء والصلاة ‏.‏",
      "text_en": " Narrated Some Companions of the Prophet:                     The Prophet (ﷺ) saw a person offering prayer, and on the back of his foot a small part equal to the space of a dirham remained unwashed; the water did not reach it. The Prophet (ﷺ) commanded him to repeat the ablution and prayer.",
      "chain": [
        "26010",
        "20644",
        "11282"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، - في آخرين - قالوا حدثنا بقية، عن الوضين بن عطاء، عن محفوظ بن علقمة، عن عبد الرحمن بن عائذ، عن علي بن أبي طالب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وكاء السه العينان فمن نام فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) said: The eyes are the leather strap of the anus, so one who sleeps should perform ablution.",
      "chain": [
        "26010",
        "20644",
        "17548",
        "18970",
        "19925",
        "5"
      ]
    },
    {
      "hadith_no": "213",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عبد الملك اليزني، حدثنا بقية بن الوليد، عن سعد الأغطش، - وهو ابن عبد الله - عن عبد الرحمن بن عائذ الأزدي، - قال هشام وهو ابن قرط أمير حمص - عن معاذ بن جبل، قال سألت رسول الله صلى الله عليه وسلم عما يحل للرجل من امرأته وهي حائض قال فقال ‏\"‏ ما فوق الإزار والتعفف عن ذلك أفضل ‏\"‏ ‏.‏ قال أبو داود وليس هو - يعني الحديث - بالقوي ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     I asked the Messenger of Allah (ﷺ): What is lawful for a man to do with his wife when she is menstruating? He replied: What is above the waist-wrapper, but it is better to abstain from it, too.Abu Dawud said: This (tradition) is not strong.",
      "chain": [
        "20644",
        "19925",
        "32"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حيوة بن شريح المصري، حدثنا بقية، عن ضبارة بن عبد الله بن أبي سليك الألهاني، أخبرني ابن نافع، عن ابن شهاب الزهري، قال قال سعيد بن المسيب إن أبا قتادة بن ربعي أخبره قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله تعالى إني فرضت على أمتك خمس صلوات وعهدت عندي عهدا أنه من جاء يحافظ عليهن لوقتهن أدخلته الجنة ومن لم يحافظ عليهن فلا عهد له عندي ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Qatadah ibn Rib'iyy:                     Allah , the Exalted said: I made five times' prayers obligatory on your people, and I took a guarantee that if anyone observes them regularly at their times, I shall admit him to Paradise; if anyone does not offer them regularly, there is no such guarantee of Mine for him.",
      "chain": [
        "26010",
        "20644",
        "11002"
      ]
    },
    {
      "hadith_no": "655",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، وشعيب بن إسحاق، عن الأوزاعي، حدثني محمد بن الوليد، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فخلع نعليه فلا يؤذ بهما أحدا ليجعلهما بين رجليه أو ليصل فيهما ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when any of you prays and takes off his sandals, he should not harm anyone by them. He should place them between his feet or pray with them on",
      "chain": [
        "38363",
        "20644",
        "20239",
        "20024",
        "20459",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، حدثنا الزبيدي، عن الزهري، عن سالم، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة رفع يديه حتى تكونا حذو منكبيه ثم كبر وهما كذلك فيركع ثم إذا أراد أن يرفع صلبه رفعهما حتى تكونا حذو منكبيه ثم قال سمع الله لمن حمده ولا يرفع يديه في السجود ويرفعهما في كل تكبيرة يكبرها قبل الركوع حتى تنقضي صلاته ‏.‏",
      "text_en": " ‘Abd Allah b. Umar said:                      The Messenger of Allah (ﷺ) used to raise his hands opposite his shoulders when he began prayer, then he uttered takbir (Allah is most great) in the same condition, and then he bowed. And when he raised his back (head) after bowing he raised them opposite his shoulders, and said: “Allah listens to him who praises Him.” But he did not raise his hand when he prostrated himself; he rather raised them when he uttered the takbir (Allah is most great) before bowing until his prayer is finished.",
      "chain": [
        "20644",
        "20459",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "735",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني عتبة، حدثني عبد الله بن عيسى، عن العباس بن سهل الساعدي، عن أبي حميد، بهذا الحديث قال وإذا سجد فرج بين فخذيه غير حامل بطنه على شىء من فخذيه ‏.‏ قال أبو داود رواه ابن المبارك أخبرنا فليح سمعت عباس بن سهل يحدث فلم أحفظه فحدثنيه أراه ذكر عيسى بن عبد الله أنه سمعه من عباس بن سهل قال حضرت أبا حميد الساعدي بهذا الحديث ‏.‏",
      "text_en": " Abu Humaid reported to the same effect. He said:                      When he (the Prophet) prostrated he kept his thighs wide and did not let his belly touch the thighs.Abu Dawud says that Ibn Mubarak narrated this hadith from ‘Abbas b. Sahl, which he did not remember well. It is thought that he has mentioned ‘Isa b. ‘Abd Allah, ‘Abbas b. Sahl and Abu Humaid al-Sa’idi.",
      "chain": [
        "10581",
        "20644",
        "11361",
        "1457",
        "30002",
        "20025",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "880",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثنا شعيب، عن الزهري، عن عروة، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في صلاته ‏\"‏ اللهم إني أعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏ ‏.‏ فقال له قائل ما أكثر ما تستعيذ من المغرم فقال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to make supplication during the prayer saying: \"O Allah, I seek refuge in Thee from the punishment of the grave; I seek refuge  in Thee from the trial of the Antichrist; I seek refuge in Thee from the trial of life and the trial of death; O Allah, I seek refuge in Thee from sin and debt.\" Someone said to him: How often you seek refuge from debt! He replied: When a man is in debt, he talks and tells lies, makes promises and breaks them.",
      "chain": [
        "10581",
        "20644",
        "20428",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1073",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المصفى، وعمر بن حفص الوصابي، - المعنى - قالا حدثنا بقية، حدثنا شعبة، عن المغيرة الضبي، عن عبد العزيز بن رفيع، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ قد اجتمع في يومكم هذا عيدان فمن شاء أجزأه من الجمعة وإنا مجمعون ‏\"‏ ‏.‏ قال عمر عن شعبة ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Two festivals ('Id and Friday) have synchronised on this day. If anyone does not want to offer the Friday prayer, the 'Id prayer is sufficient for him. But we shall offer the Friday prayer.This tradition has been narrated by 'Umar from Shu'bah.",
      "chain": [
        "30204",
        "20644",
        "20020",
        "11257",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1546",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثنا ضبارة بن عبد الله بن أبي السليك، عن دويد بن نافع، حدثنا أبو صالح السمان، قال قال أبو هريرة إن رسول الله صلى الله عليه وسلم كان يدعو يقول ‏\"‏ اللهم إني أعوذ بك من الشقاق والنفاق وسوء الأخلاق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to supplicate by saying: \"O Allah, I seek refuge in Thee from divisiveness, hypocrisy, and evil character.\"",
      "chain": [
        "10581",
        "20644",
        "16029",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2483",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني بحير، عن خالد، - يعني ابن معدان - عن أبي قتيلة، عن ابن حوالة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سيصير الأمر إلى أن تكونوا جنودا مجندة جند بالشام وجند باليمن وجند بالعراق ‏\"‏ ‏.‏ قال ابن حوالة خر لي يا رسول الله إن أدركت ذلك ‏.‏ فقال ‏\"‏ عليك بالشام فإنها خيرة الله من أرضه يجتبي إليها خيرته من عباده فأما إن أبيتم فعليكم بيمنكم واسقوا من غدركم فإن الله توكل لي بالشام وأهله ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn Hawalah:                     The Prophet (ﷺ) said: It will turn out that you will be armed troops, one is Syria, one in the Yemen and one in Iraq. Ibn Hawalah said: Choose for me, Messenger of Allah, if I reach that time. He replied: Go to Syria, for it is Allah's chosen land, to which his best servants will be gathered, but if you are unwilling, go to your Yemen, and draw water from your tanks, for Allah has on my account taken special charge of Syria and its people.",
      "chain": [
        "26010",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية بن الوليد، عن ابن ثوبان، عن أبيه، يرد إلى مكحول إلى عبد الرحمن بن غنم الأشعري أن أبا مالك الأشعري، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من فصل في سبيل الله فمات أو قتل فهو شهيد أو وقصه فرسه أو بعيره أو لدغته هامة أو مات على فراشه أو بأى حتف شاء الله فإنه شهيد وإن له الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMalik al-Ash'ari:                     AbuMalik heard the Messenger of Allah (ﷺ) say: He who goes forth in Allah's path and dies or is killed is a martyr, or has his neck broken through being thrown by his horse or by his camel, or is stung by a poisonous creature, or dies on his bed by any kind of death Allah wishes is a martyr and will go to Paradise.",
      "chain": [
        "38363",
        "20644"
      ]
    },
    {
      "hadith_no": "2515",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني بحير، عن خالد بن معدان، عن أبي بحرية، عن معاذ بن جبل، عن رسول الله صلى الله عليه وسلم أنه قال ‏:‏ ‏\"‏ الغزو غزوان فأما من ابتغى وجه الله، وأطاع الإمام، وأنفق الكريمة، وياسر الشريك، واجتنب الفساد، فإن نومه ونبهه أجر كله وأما من غزا فخرا ورياء وسمعة، وعصى الإمام، وأفسد في الأرض، فإنه لم يرجع بالكفاف ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: Fighting is of two kinds: The one who seeks Allah's favour, obeys the leader, gives the property he values, treats his associates gently and avoids doing mischief, will have the reward for all the time whether he is asleep or awake; but the one who fights in a boasting spirit, for the sake of display and to gain a reputation, who disobeys the leader and does mischief in the earth will not return credit or without blame.",
      "chain": [
        "26010",
        "20644",
        "11422",
        "19921",
        "32"
      ]
    },
    {
      "hadith_no": "2541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن خالد أبو مروان، وابن المصفى، قالا حدثنا بقية، عن ابن ثوبان، عن أبيه، يرد إلى مكحول إلى مالك بن يخامر أن معاذ بن جبل، حدثهم أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ من قاتل في سبيل الله فواق ناقة فقد وجبت له الجنة، ومن سأل الله القتل من نفسه صادقا ثم مات أو قتل فإن له أجر شهيد ‏\"‏ ‏.‏ زاد ابن المصفى من هنا ‏:‏ ‏\"‏ ومن جرح جرحا في سبيل الله أو نكب نكبة فإنها تجيء يوم القيامة كأغزر ما كانت، لونها لون الزعفران، وريحها ريح المسك، ومن خرج به خراج في سبيل الله فإن عليه طابع الشهداء ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: If anyone fights in Allah's path as long as the time between two milkings of a she-camel, Paradise will be assured for him. If anyone sincerely asks Allah for being killed and then dies or is killed, there will be a reward of a martyr for him. Ibn al-Musaffa added from here: If anyone is wounded in Allah's path, or suffers a misfortune, it will come on the Day of resurrection as copious as possible, its colour saffron, and its odour musk; and if anyone suffers from ulcers while in Allah's path, he will have on him the stamp of the martyrs.",
      "chain": [
        "37540",
        "20644",
        "32"
      ]
    },
    {
      "hadith_no": "2603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني صفوان، حدثني شريح بن عبيد، عن الزبير بن الوليد، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم إذا سافر فأقبل الليل قال ‏\"‏ يا أرض ربي وربك الله أعوذ بالله من شرك وشر ما فيك وشر ما خلق فيك ومن شر ما يدب عليك وأعوذ بالله من أسد وأسود ومن الحية والعقرب ومن ساكن البلد ومن والد وما ولد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     When the Messenger of Allah (ﷺ) was travelling and night came on, he said: O earth, my Lord and  your Lord is Allah; I seek refuge in Allah from your evil, the evil of what you contain, the evil of what has been created in you, and the evil of what creeps upon you; I seek refuge in Allah from lions, from large black snakes, from other snakes, from scorpions, from the evil of jinn which inhabit a settlement, and from a parent and his offspring.",
      "chain": [
        "10581",
        "20644",
        "10921",
        "18414",
        "17022",
        "18"
      ]
    },
    {
      "hadith_no": "2630",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، عن الأوزاعي، عن أسيد بن عبد الرحمن، عن فروة بن مجاهد، عن سهل بن معاذ، عن أبيه، قال غزونا مع نبي الله صلى الله عليه وسلم ‏.‏ بمعناه ‏.‏",
      "text_en": " Sahl bin Mu’adh reported on the authority of his father “We fought along with the Prophet of Allaah(ﷺ). The rest of the tradition is to the same effect.”",
      "chain": [
        "10581",
        "20644",
        "20024",
        "18053",
        "5225"
      ]
    },
    {
      "hadith_no": "2856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا محمد بن حرب، ح وحدثنا محمد بن المصفى، حدثنا بقية، عن الزبيدي، حدثنا يونس بن سيف، حدثنا أبو إدريس الخولاني، حدثني أبو ثعلبة الخشني، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ثعلبة كل ما ردت عليك قوسك وكلبك ‏\"‏ ‏.‏ زاد عن ابن حرب ‏\"‏ المعلم ويدك فكل ذكيا وغير ذكي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said to me: AbuTha'labah, eat what returns to you by your bow and your dog.  Ibn Harb's version adds: \"The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered\".",
      "chain": [
        "30373",
        "20644",
        "20459",
        "19199",
        "11027"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني عمارة بن أبي الشعثاء، حدثني سنان بن قيس، حدثني شبيب بن نعيم، حدثني يزيد بن خمير، حدثني أبو الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أخذ أرضا بجزيتها فقد استقال هجرته ومن نزع صغار كافر من عنقه فجعله في عنقه فقد ولى الإسلام ظهره ‏\"‏ ‏.‏ قال فسمع مني خالد بن معدان هذا الحديث فقال لي أشبيب حدثك قلت نعم ‏.‏ قال فإذا قدمت فسله فليكتب إلى بالحديث ‏.‏ قال فكتبه له فلما قدمت سألني خالد بن معدان القرطاس فأعطيته فلما قرأه ترك ما في يديه من الأرضين حين سمع ذلك ‏.‏ قال أبو داود هذا يزيد بن خمير اليزني ليس هو صاحب شعبة ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: If anyone takes land by (paying) its jizyah, he renounces his immigration; and if anyone takes off the disgrace of an unbeliever from his neck he turns away his back from Islam. He (the narrator) said: Thereafter Khalid ibn Ma'dan heard this tradition from me, and he said: Has Shubayb narrated it to you? I said: Yes. He said! When you come to him, ask him to write this tradition to me. He said: He then wrote it for him. When I came, Khalid ibn Ma'dan asked me for the paper and I gave it to him. When he read (the paper), he abandoned the lands he had in his possession the moment he heard this.Abu Dawud said: This Yazid b. Khumair al-Yazani is not the disciple of Shu'bah.",
      "chain": [
        "26010",
        "20644",
        "28422",
        "27014",
        "17033",
        "10981"
      ]
    },
    {
      "hadith_no": "3417",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد، قالا حدثنا بقية، حدثني بشر بن عبد الله بن يسار، قال عمرو حدثني عبادة بن نسى، عن جنادة بن أبي أمية، عن عبادة بن الصامت، نحو هذا الخبر - والأول أتم - فقلت ما ترى فيها يا رسول الله فقال ‏\"‏ جمرة بين كتفيك تقلدتها ‏\"‏ ‏.‏ أو ‏\"‏ تعلقتها ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Ubadah b. al-Samit through a different chain of narrators, but the former tradition is more perfect. This version has:                      I said: What do you think about it, Messenger of Allah? He said: A live coal between your shoulders which you have put around your neck or hanged it.",
      "chain": [
        "10581",
        "38462",
        "20644",
        "11081",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3627",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، وموسى بن مروان الرقي، قالا حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن سيف، عن عوف بن مالك، أنه حدثهم أن النبي صلى الله عليه وسلم قضى بين رجلين ‏.‏ فقال المقضي عليه لما أدبر حسبي الله ونعم الوكيل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله يلوم على العجز ولكن عليك بالكيس فإذا غلبك أمر فقل حسبي الله ونعم الوكيل ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Holy Prophet (ﷺ) gave a decision between two men, and the one against whom the decision was given turned away and said: For me Allah sufficeth, and He is the best dispenser of affairs. The Holy Prophet (ﷺ) said: Allah, Most High, blames for falling short, but apply intelligence, and when the matter gets the better of you, say; For me Allah sufficeth, and He is the best disposer of affairs.",
      "chain": [
        "38363",
        "35154",
        "20644",
        "11422",
        "11558",
        "10805"
      ]
    },
    {
      "hadith_no": "3739",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، حدثنا الزبيدي، عن نافع، بإسناد أيوب ومعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Nafi’ to the same effect through the chain of narrators as mentioned in Ayyub.",
      "chain": [
        "20644",
        "20459"
      ]
    },
    {
      "hadith_no": "3790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن شبيب، وحيوة بن شريح الحمصي، قال حيوة حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير - زاد حيوة - وكل ذي ناب من السباع ‏.‏ قال أبو داود وهو قول مالك ‏.‏ قال أبو داود لا بأس بلحوم الخيل وليس العمل عليه ‏.‏ قال أبو داود وهذا منسوخ قد أكل لحوم الخيل جماعة من أصحاب النبي صلى الله عليه وسلم منهم ابن الزبير وفضالة بن عبيد وأنس بن مالك وأسماء ابنة أبي بكر وسويد بن غفلة وعلقمة وكانت قريش في عهد رسول الله صلى الله عليه وسلم تذبحها ‏.‏",
      "text_en": " Narrated Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) forbade us to eat horse-flesh, the flesh of mules and of asses. The narrator Haywah added: Every beast of prey with a fang.Abu Dawud said: This view is held by Malik.Abu Dawud said: There is no harm in (eating) horse-flesh and this tradition is not practised.Abu Dawud said: This tradition has been abrogated. A body of Companions of the Prophet (ﷺ) had eaten horse-flesh. OF them are: Ibn al-Zubair, Fudalah bin 'Ubaid, Anas bin Malik, Asma' daughter of Abu Bakr, Suwaid bin Ghaflah, 'Alqamah; the Quraish used to slaughter them (horses) during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "26010",
        "26010",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "3829",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا ح، وحدثنا حيوة بن شريح، حدثنا بقية، عن بحير، عن خالد، عن أبي زياد، خيار بن سلمة أنه سأل عائشة عن البصل، فقالت إن آخر طعام أكله رسول الله صلى الله عليه وسلم طعام فيه بصل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Khalid said: AbuZiyad Khiyar ibn Salamah asked Aisha about onions. She replied: The last food which the Messenger of Allah (ﷺ) ate was some which contained onions.",
      "chain": [
        "30309",
        "26010",
        "20644",
        "11282",
        "53"
      ]
    },
    {
      "hadith_no": "3899",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، حدثني الزبيدي، عن الزهري، عن طارق، - يعني ابن مخاشن - عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بلديغ لدغته عقرب قال فقال ‏\"‏ لو قال أعوذ بكلمات الله التامة من شر ما خلق لم يلدغ ‏\"‏ ‏.‏ أو ‏\"‏ لم تضره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     A man who was stung by a scorpion was brought to the Prophet (ﷺ). He said: Had he said the word: \"I seek refuge in the perfect words of Allah from the evil of what He created, \"he would not have been stung, or he said, \"It would not have harmed him.\"",
      "chain": [
        "26010",
        "20644",
        "20459",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "3915",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، قال قلت لمحمد - يعني ابن راشد - قوله ‏\"‏ هام ‏\"‏ ‏.‏ قال كانت الجاهلية تقول ليس أحد يموت فيدفن إلا خرج من قبره هامة ‏.‏ قلت فقوله صفر ‏.‏ قال سمعت أن أهل الجاهلية يستشئمون بصفر فقال النبي صلى الله عليه وسلم ‏\"‏ لا صفر ‏\"‏ ‏.‏ قال محمد وقد سمعنا من يقول هو وجع يأخذ في البطن فكانوا يقولون هو يعدي فقال ‏\"‏ لا صفر ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. al-Musaffa said to us on the authority of Baqiyyah. He said:                      I asked Muhammad b. Rashid about the meaning of the word hamah. He replied: The pre-Islamic Arabs used to say: When anyone dies and is buried, a bird comes forth from his grave. I asked: What did he mean by safar ? He said: I heard that the pre-Islamic Arabs used to take evil omen from safar. So the Prophet (ﷺ) said: There is no safar. Muhammad (b. Rashid) said: We heard someone say: It is a pain in the stomach. They said that it was infection. Hence he said: There is no safar.",
      "chain": [
        "20644"
      ]
    },
    {
      "hadith_no": "3966",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان بن عمرو، حدثني سليم بن عامر، عن شرحبيل بن السمط، أنه قال لعمرو بن عبسة حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة كانت فداءه من النار ‏\"‏ ‏.‏",
      "text_en": " Amr ibn Abasah, said that Marrah ibn Ka'b said:                      I heard the Messenger of Allah (ﷺ) say: If anyone emancipates a Muslim slave, that will be his ransom from Jahannam.",
      "chain": [
        "38363",
        "20644",
        "10921",
        "10915",
        "6225"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد الحمصيان، قالا حدثنا بقية، عن الزبيدي، عن الزهري، عن أنس بن مالك، أنه حدثه أنه، رأى على أم كلثوم بنت رسول الله صلى الله عليه وسلم بردا سيراء ‏.‏ قال والسيراء المضلع بالقز ‏.‏",
      "text_en": " Anas b. Malik said that he saw a striped garment over Umm Kulthum, daughter of the Messenger of Allah (ﷺ). He said:                      The word \"siyara\" means striped with silk.",
      "chain": [
        "10581",
        "38462",
        "20644",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4131",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد الحمصي، حدثنا بقية، عن بحير، عن خالد، قال وفد المقدام بن معديكرب وعمرو بن الأسود ورجل من بني أسد من أهل قنسرين إلى معاوية بن أبي سفيان فقال معاوية للمقدام أعلمت أن الحسن بن علي توفي فرجع المقدام فقال له رجل أتراها مصيبة قال له ولم لا أراها مصيبة وقد وضعه رسول الله صلى الله عليه وسلم في حجره فقال ‏\"‏ هذا مني وحسين من علي ‏\"‏ ‏.‏ فقال الأسدي جمرة أطفأها الله عز وجل ‏.‏ قال فقال المقدام أما أنا فلا أبرح اليوم حتى أغيظك وأسمعك ما تكره ‏.‏ ثم قال يا معاوية إن أنا صدقت فصدقني وإن أنا كذبت فكذبني قال أفعل ‏.‏ قال فأنشدك بالله هل تعلم أن رسول الله صلى الله عليه وسلم نهى عن لبس الذهب قال نعم ‏.‏ قال فأنشدك بالله هل سمعت رسول الله صلى الله عليه وسلم ينهى عن لبس الحرير قال نعم ‏.‏ قال فأنشدك بالله هل تعلم أن رسول الله صلى الله عليه وسلم نهى عن لبس جلود السباع والركوب عليها قال نعم ‏.‏ قال فوالله لقد رأيت هذا كله في بيتك يا معاوية ‏.‏ فقال معاوية قد علمت أني لن أنجو منك يا مقدام قال خالد فأمر له معاوية بما لم يأمر لصاحبيه وفرض لابنه في المائتين ففرقها المقدام في أصحابه قال ولم يعط الأسدي أحدا شيئا مما أخذ فبلغ ذلك معاوية فقال أما المقدام فرجل كريم بسط يده وأما الأسدي فرجل حسن الإمساك لشيئه ‏.‏",
      "text_en": " Khalid said:                      Al-Miqdam ibn Ma'dikarib and a man of Banu Asad from the people of Qinnisrin went to Mu'awiyah ibn AbuSufyan.  Mu'awiyah said to al-Miqdam: Do you know that al-Hasan ibn Ali has died? Al-Miqdam recited the Qur'anic verse \"We belong to Allah and to Him we shall return.\"  A man asked him: Do you think it a calamity?  He replied: Why should I not consider it a calamity when it is a fact that the Messenger of Allah (ﷺ) used to take him on his lap, saying: This belongs to me and Husayn belongs to Ali?  The man of Banu Asad said: (He was) a live coal which Allah has extinguished.  Al-Miqdam said: Today I shall continue to make you angry and make you hear what you dislike. He then said: Mu'awiyah, if I speak the truth, declare me true, and if I tell a lie, declare me false.  He said: Do so.  He said: I adjure you by Allah, did you hear the Messenger of Allah (ﷺ) forbidding use to wear gold?  He replied: Yes.  He said: I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) prohibited the wearing of silk?  He replied: Yes.  He said: I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) prohibited the wearing of the skins of beasts of prey and riding on them?  He said: Yes. He said: I swear by Allah, I saw all this in your house, O Mu'awiyah.  Mu'awiyah said: I know that I cannot be saved from you, O Miqdam.  Khalid said: Mu'awiyah then ordered to give him what he did not order to give to his two companions, and gave a stipend of two hundred (dirhams) to his son. Al-Miqdam then divided it among his companions, and the man of Banu Asad did not give anything to anyone from the property he received. When Mu'awiyah was informed about it, he said: Al-Miqdam is a generous man; he has an open hand (for generosity). The man of Banu Asad withholds his things in a good manner.",
      "chain": [
        "38429",
        "20644",
        "11282",
        "30"
      ]
    },
    {
      "hadith_no": "4296",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، حدثنا بقية، عن بحير، عن خالد، عن ابن أبي بلال، عن عبد الله بن بسر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بين الملحمة وفتح المدينة ست سنين ويخرج المسيح الدجال في السابعة ‏\"‏ ‏.‏ قال أبو داود هذا أصح من حديث عيسى ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     The Prophet (ﷺ) said: The time between the great war and the conquest of the city (Constantinople) will be six years, and the Dajjal (Antichrist) will come forth in the seventh.Abu Dawud said: This is sounder than the tradition narrated by Isa (bin Yunus)",
      "chain": [
        "26010",
        "20644",
        "11282",
        "3650"
      ]
    },
    {
      "hadith_no": "4320",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، حدثني بحير، عن خالد بن معدان، عن عمرو بن الأسود، عن جنادة بن أبي أمية، عن عبادة بن الصامت، أنه حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إني قد حدثتكم عن الدجال حتى خشيت أن لا تعقلوا إن مسيح الدجال رجل قصير أفحج جعد أعور مطموس العين ليس بناتئة ولا جحراء فإن ألبس عليكم فاعلموا أن ربكم ليس بأعور ‏\"‏ ‏.‏ قال أبو داود عمرو بن الأسود ولي القضاء ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Prophet (ﷺ) said: I have told you so much about the Dajjal (Antichrist) that I am afraid you may not understand. The Antichrist is short, hen-toed, woolly-haired, one-eyed, an eye-sightless, and neither protruding nor deep-seated. If you are confused about him, know that your Lord is not one-eyed.Abu Dawud said: 'Amr bin Al-Aswad was appointed a judge.",
      "chain": [
        "26010",
        "20644",
        "11422",
        "11714",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "4382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان، حدثنا أزهر بن عبد الله الحرازي، أن قوما، من الكلاعيين سرق لهم متاع فاتهموا أناسا من الحاكة فأتوا النعمان بن بشير صاحب النبي صلى الله عليه وسلم فحبسهم أياما ثم خلى سبيلهم فأتوا النعمان فقالوا خليت سبيلهم بغير ضرب ولا امتحان ‏.‏ فقال النعمان ما شئتم إن شئتم أن أضربهم فإن خرج متاعكم فذاك وإلا أخذت من ظهوركم مثل ما أخذت من ظهورهم ‏.‏ فقالوا هذا حكمك فقال هذا حكم الله وحكم رسوله صلى الله عليه وسلم ‏.‏ قال أبو داود إنما أرهبهم بهذا القول أى لا يجب الضرب إلا بعد الاعتراف ‏.‏",
      "text_en": " Azhar ibn Abdullah al-Harari said:                      Some goods of the people of Kila' were stolen. They accused some men of the weavers (of theft). They came to an-Nu'man ibn Bashir, the companion of the Prophet (ﷺ). He confined them for some days and then set them free.  They came to an-Nu'man and said: You have set them free without beating and investigation. An-Nu'man said: What do you want? You want me to beat them. If your goods are found with them, then it is all right; otherwise, I shall take (retaliation) from your back as I have taken from their backs.  They asked: Is this your decision?  He said: This is the decision of Allah and His Apostle (ﷺ).Abu Dawud said: By this statement he frightened them ; that is, beating is not necessary except after acknowledgement.",
      "chain": [
        "38363",
        "20644",
        "10921",
        "18019"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن يحيى، قالا حدثنا أبو المغيرة، حدثنا صفوان، ح وحدثنا عمرو بن عثمان، حدثنا بقية، قال حدثني صفوان، نحوه قال حدثني أزهر بن عبد الله الحرازي، عن أبي عامر الهوزني، عن معاوية بن أبي سفيان، أنه قام فينا فقال ألا إن رسول الله صلى الله عليه وسلم قام فينا فقال ‏\"‏ ألا إن من قبلكم من أهل الكتاب افترقوا على ثنتين وسبعين ملة وإن هذه الملة ستفترق على ثلاث وسبعين ثنتان وسبعون في النار وواحدة في الجنة وهي الجماعة ‏\"‏ ‏.‏ زاد ابن يحيى وعمرو في حديثيهما ‏\"‏ وإنه سيخرج من أمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكلب لصاحبه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ الكلب بصاحبه لا يبقى منه عرق ولا مفصل إلا دخله ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Amir al-Hawdhani said:                      Mu’awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of ALLA H (SAWS) stood among us and said: Beware! The people of the Book before were split up into seventy-two sects, and this community will be split into seventy three: seventy-two of them will go to Hell and one of them will go to Paradise, and it is the majority group.Ibn Yahya and ‘Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, ‘Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
      "chain": [
        "30007",
        "11222",
        "20442",
        "10921",
        "10581",
        "20644",
        "10921",
        "18019",
        "27"
      ]
    },
    {
      "hadith_no": "4704",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، قال حدثني عمر بن جعثم القرشي، قال حدثني زيد بن أبي أنيسة، عن عبد الحميد بن عبد الرحمن، عن مسلم بن يسار، عن نعيم بن ربيعة، قال كنت عند عمر بن الخطاب بهذا الحديث وحديث مالك أتم ‏.‏",
      "text_en": " Nu’aim b. Rabl’ah said :                      I was with ‘Umar b. al-Khattab when he transmitted this tradition. The tradition of Malik is more perfect.",
      "chain": [
        "20644",
        "11340",
        "11190",
        "13118"
      ]
    },
    {
      "hadith_no": "4712",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، ح وحدثنا موسى بن مروان الرقي، وكثير بن عبيد المذحجي، قالا حدثنا محمد بن حرب، - المعنى - عن محمد بن زياد، عن عبد الله بن أبي قيس، عن عائشة، قالت قلت يا رسول الله ذراري المؤمنين فقال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏ فقلت يا رسول الله بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏ قلت يا رسول الله فذراري المشركين قال ‏\"‏ من آبائهم ‏\"‏ ‏.‏ قلت بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said :                      I said : Messenger of Allah (May peace be upon him) what happens to the offspring of believers ? He replied : They are joined to their parents. I asked : Messenger of Allah! Although they have done nothing ? He replied : Allah knows best what they were doing. I asked : what happens to the offspring of polytheists, Messenger of Allah ? he replied! They are joined to their parents. I asked : Although they have done nothing? He replied : Allah knows best what they were doing.",
      "chain": [
        "38363",
        "20644",
        "35154",
        "38462",
        "30373",
        "11216",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، وأبو المغيرة، قالا حدثنا صفوان، قال حدثني راشد بن سعد، وعبد الرحمن بن جبير، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم فقلت من هؤلاء يا جبريل قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم ‏\"‏ ‏.‏ قال أبو داود حدثناه يحيى بن عثمان عن بقية ليس فيه أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When I was taken up to heaven I passed by people who had nails of copper and were scratching their faces and their breasts. I said: Who are these people,  Gabriel? He replied: They are those who were given to back biting and who aspersed people's honour.Abu Dawud said: Yahya b. 'Uthman has also transmitted it from Baqiyyah, there is no mention of Anas in it.",
      "chain": [
        "20644",
        "20442",
        "10921",
        "19909",
        "10865",
        "19"
      ]
    },
    {
      "hadith_no": "4881",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح المصري، حدثنا بقية، عن ابن ثوبان، عن أبيه، عن مكحول، عن وقاص بن ربيعة، عن المستورد، أنه حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ من أكل برجل مسلم أكلة فإن الله يطعمه مثلها من جهنم ومن كسي ثوبا برجل مسلم فإن الله يكسوه مثله من جهنم ومن قام برجل مقام سمعة ورياء فإن الله يقوم به مقام سمعة ورياء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mustawrid:                     The Prophet (ﷺ) said: If anyone eats once at the cost of a Muslim's honour, Allah will give him a like amount of Jahannam to eat; if anyone clothes himself with a garment at the cost of a Muslim's honour, Allah will clothe him with like amount of Jahannam; and if anyone puts himself in a position of reputation and show Allah will disgrace him with a place of reputation and show on the Day of Resurrection.",
      "chain": [
        "26010",
        "20644",
        "11066",
        "2904"
      ]
    },
    {
      "hadith_no": "4971",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، - إمام مسجد حمص - حدثنا بقية بن الوليد، عن ضبارة بن مالك الحضرمي، عن أبيه، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن سفيان بن أسيد الحضرمي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كبرت خيانة أن تحدث أخاك حديثا هو لك به مصدق وأنت له به كاذب ‏\"‏ ‏.‏",
      "text_en": " Narrated Sufyan ibn Asid al-Hadrami:                     I heard the Messenger of Allah (ﷺ) say: It is great treachery that you should tell your brother something and have him believe you when you are lying.",
      "chain": [
        "26010",
        "20644",
        "10942"
      ]
    },
    {
      "hadith_no": "5057",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا بقية، عن بحير، عن خالد بن معدان، عن ابن أبي بلال، عن عرباض بن سارية، أن رسول الله صلى الله عليه وسلم كان يقرأ المسبحات قبل أن يرقد وقال ‏\"‏ إن فيهن آية أفضل من ألف آية ‏\"‏ ‏.‏",
      "text_en": " Narrated Irbad ibn Sariyah:                     The Messenger of Allah (ﷺ) used to recite al-Musabbihat before going to sleep, and say: They contain a verse which is better than a thousand verses.",
      "chain": [
        "38659",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "5078",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، عن مسلم، - يعني ابن زياد - قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يصبح اللهم إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدا عبدك ورسولك إلا غفر له ما أصاب في يومه ذلك من ذنب وإن قالها حين يمسي غفر له ما أصاب تلك الليلة ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: If anyone says in the morning: \"O Allah! in the morning we call Thee, the bearers of Thy Throne, Thy angels, and all Thy creatures to witness that Thou art Allah than Whom there is no god, Thou being alone and without a partner, and that Muhammad is Thy servant and Thy Apostle,\" Allah will forgive him any sins that he commits that day; and if he repeats them in the evening. Allah will forgive him any sins he commits that night.",
      "chain": [
        "10581",
        "20644",
        "19"
      ]
    },
    {
      "hadith_no": "5085",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا كثير بن عبيد، حدثنا بقية بن الوليد، عن عمر بن جعثم، قال حدثني الأزهر بن عبد الله الحرازي، قال حدثني شريق الهوزني، قال دخلت على عائشة رضى الله عنها فسألتها بم كان رسول الله صلى الله عليه وسلم يفتتح إذا هب من الليل فقالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان إذا هب من الليل كبر عشرا وحمد عشرا وقال ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏ عشرا وقال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ عشرا واستغفر عشرا وهلل عشرا ثم قال ‏\"‏ اللهم إني أعوذ بك من ضيق الدنيا وضيق يوم القيامة ‏\"‏ ‏.‏ عشرا ثم يفتتح الصلاة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Shariq al-Hawzani and I came to Aisha (Allah be pleased with her) and asked her: By which (prayer) the Messenger of Allah (ﷺ) began when he woke up at night? She replied: You asked me about a thing which no one asked me before. When he woke up at night, he uttered: \"Allah is Most Great\" ten times, and uttered \"Praise be to Allah\" ten times, and said \"Glory be to Allah and I begin with His praise\" ten times, and said: \"Glory be to the King, the Most Holy\" ten times, and asked Allah's pardon ten times, and said: \"There is no god but Allah\" ten times, and then said: \"O Allah! I seek refuge in Thee from the strait of the Day of resurrection,\" ten times. He then began the prayer.",
      "chain": [
        "38462",
        "20644",
        "18019"
      ]
    },
    {
      "hadith_no": "5130",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، عن أبي بكر بن أبي مريم، عن خالد بن محمد الثقفي، عن بلال بن أبي الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ حبك الشىء يعمي ويصم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: Your love for a thing causes blindness and deafness.",
      "chain": [
        "26010",
        "20644",
        "27053",
        "17505",
        "18090",
        "37"
      ]
    },
    {
      "hadith_no": "5163",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، حدثنا عثمان بن زفر، قال حدثني محمد بن خالد بن رافع بن مكيث، عن عمه الحارث بن رافع بن مكيث، وكان، رافع من جهينة قد شهد الحديبية مع رسول الله صلى الله عليه وسلم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ حسن الملكة نماء وسوء الخلق شؤم ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Makith:                     The Messenger of Allah (ﷺ) said: Treating those under one's authority well produces prosperity, but an evil nature produces evil fortune.",
      "chain": [
        "20644",
        "35079",
        "18902"
      ]
    },
    {
      "hadith_no": "5186",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، - في آخرين - قالوا حدثنا بقية بن الوليد، حدثنا محمد بن عبد الرحمن، عن عبد الله بن بسر، قال كان رسول الله صلى الله عليه وسلم إذا أتى باب قوم لم يستقبل الباب من تلقاء وجهه ولكن من ركنه الأيمن أو الأيسر ويقول ‏\"‏ السلام عليكم السلام عليكم ‏\"‏ ‏.‏ وذلك أن الدور لم يكن عليها يومئذ ستور ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     When the Messenger of Allah (ﷺ) came to some people's door, he did not face it squarely, but faced the right or left corner, and said: Peace be upon you! peace be upon you! That was because there were no curtains on the doors of the house at that time.",
      "chain": [
        "38659",
        "20644",
        "11105",
        "3650"
      ]
    },
    {
      "hadith_no": "1635",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن منصور المروزي، أخبرنا حيوة بن شريح الحمصي، عن بقية، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة، عن عمرو بن عبسة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شاب شيبة في سبيل الله كانت له نورا يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وحيوة بن شريح ابن يزيد الحمصي ‏.‏",
      "text_en": " Narrated Amr bin 'Abasah:                     That the Messenger of Allah (ﷺ) said: \"Whoever develops some gray hair in the cause of Allah, it shall be a light for him in the Day of Judgement.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. As for Haiwah bin Shuraih, (the remainder of his name is) Ibn Yazid Al-Himsi.",
      "chain": [
        "30313",
        "26010",
        "20644",
        "11422",
        "19940",
        "4002"
      ]
    },
    {
      "hadith_no": "1663",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا نعيم بن حماد، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ للشهيد عند الله ست خصال يغفر له في أول دفعة ويرى مقعده من الجنة ويجار من عذاب القبر ويأمن من الفزع الأكبر ويوضع على رأسه تاج الوقار الياقوتة منها خير من الدنيا وما فيها ويزوج اثنتين وسبعين زوجة من الحور العين ويشفع في سبعين من أقاربه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب ‏.‏",
      "text_en": " Narrated Al-Miqdam bin Ma'diykarib:                     That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30025",
        "30238",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "2676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن حجر، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، قال وعظنا رسول الله صلى الله عليه وسلم يوما بعد صلاة الغداة موعظة بليغة ذرفت منها العيون ووجلت منها القلوب فقال رجل إن هذه موعظة مودع فماذا تعهد إلينا يا رسول الله قال ‏\"‏ أوصيكم بتقوى الله والسمع والطاعة وإن عبد حبشي فإنه من يعش منكم يرى اختلافا كثيرا وإياكم ومحدثات الأمور فإنها ضلالة فمن أدرك ذلك منكم فعليه بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏  وقد روى ثور بن يزيد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ حدثنا بذلك الحسن بن علي الخلال وغير واحد قالوا حدثنا أبو عاصم عن ثور بن يزيد عن خالد بن معدان عن عبد الرحمن بن عمرو السلمي عن العرباض بن سارية عن النبي صلى الله عليه وسلم نحوه والعرباض بن سارية يكنى أبا نجيح ‏.‏ وقد روي هذا الحديث عن حجر بن حجر عن عرباض بن سارية عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Al-'Irbad bin Sariyah:                     \"One day after the morning Salat, the Messenger of Allah (ﷺ) exhorted us to the extent that the eyes wept and the hearts shuddered with fear. A man said: 'Indeed this is a farewell exhortation. [So what] do you order us O Messenger of Allah?' He said: 'I order you to have Taqwa of Allah, and to listen and obey, even in the case of a Ethiopian slave. Indeed, whomever among you lives, he will see much difference. Beware of the newly invented matters, for indeed they are astray. Whoever among you sees that, then he must stick to my Sunnah and the Sunnah of the rightly guided Khulafa', click to it with the molars.'\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17046",
        "5172"
      ]
    },
    {
      "hadith_no": "3098",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن النواس بن سمعان الكلابي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ضرب مثلا صراطا مستقيما على كنفى الصراط داران لهما أبواب مفتحة على الأبواب ستور وداع يدعو على رأس الصراط وداع يدعو فوقه‏:‏ ‏(‏والله يدعو إلى دار السلام ويهدي من يشاء إلى صراط مستقيم‏)‏ والأبواب التي على كنفى الصراط حدود الله فلا يقع أحد في حدود الله حتى يكشف الستر والذي يدعو من فوقه واعظ ربه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال سمعت عبد الله بن عبد الرحمن يقول سمعت زكريا بن عدي يقول قال أبو إسحاق الفزاري خذوا عن بقية ما حدثكم عن الثقات ولا تأخذوا عن إسماعيل بن عياش ما حدثكم عن الثقات ولا غير الثقات ‏.‏",
      "text_en": " Narrated An-Nawwas bin Sam'an Al-Kilabi:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "4097",
        "3600"
      ]
    },
    {
      "hadith_no": "3171",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا علي بن حجر، أخبرنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الله بن أبي بلال، عن عرباض بن سارية، أنه حدثه أن النبي صلى الله عليه وسلم كان يقرأ المسبحات قبل أن يرقد ويقول ‏\"‏ إن فيهن آية خير من ألف آية ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Irbad bin Sariyah:                     that the Prophet (ﷺ) would recite the Musabbihat (Chapters 17, 57, 59, 61-64 & 87) before sleep and say \"Indeed there is an Ayah in them that is better than one thousand Ayat.\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17040"
      ]
    },
    {
      "hadith_no": "3406",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، أخبرنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الله بن أبي بلال، عن العرباض بن سارية، رضى الله عنه أن النبي صلى الله عليه وسلم كان لا ينام حتى يقرأ المسبحات ويقول ‏\"‏ فيها آية خير من ألف آية ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
      "text_en": " Ar-Irbad bin Sariyah [may Allah be pleased with him] narrated that:                     The Prophet would not sleepy until he had recite Al-Musabbihat, and he would say: “In them is an Ayah that is better than a thousand Ayah.”",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17040",
        "5172"
      ]
    }
  ],
  "total_hadiths": 138
}