{
  "id": "20644",
  "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
  "full_name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "115",
      "date_gregorian": "733",
      "date_display": [
        "115 AH",
        "733 CE"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "197",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Kula'i",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11720",
      "name": "Muhammad bin Ziyad al-Alhani محمد بن زياد الألهاني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20459",
      "name": "Muhammad bin al-Walid al-Zubaidi محمد بن الوليد بن عامر الزبيدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27550",
      "name": "Mua'wiya bin Yahya al-Sdfy معاوية بن يحيى الصدفي أبو روح الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28572",
      "name": "Mua'wiya bin Yahya معاوية بن يحيى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27053",
      "name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30558",
      "name": "'Isa bin al-Mndhr al-Slmy عيسى بن المنذر السلمي أبو موسى الحمصي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "31645",
      "name": "Atyh bin Bqyh bin al-Walid عطية بن بقية بن الوليد",
      "grade": "3rd Century AH"
    },
    {
      "id": "30288",
      "name": "Hisham bin 'Ammar bin Nasayr هشام بن عمار بن نصير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30572",
      "name": "Yazid bin Abd Rbh يزيد بن عبد ربه الزبيدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38462",
      "name": "Kathir bin 'Ubaid bin Nmyr كثير بن عبيد بن نمير المذحجي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3587",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني إسحاق بن منصور، حدثني عيسى بن المنذر، حدثنا بقية، حدثنا الزبيدي، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من دعي إلى عرس أو نحوه فليجب ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleated with them) reported Allah's Messenger (may peace be upon him) having said:                      He who is invited to a wedding feast or like it, he should accept it.",
      "chain": [
        "30313",
        "20644",
        "20459",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "175",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، عن بحير، - هو ابن سعد - عن خالد، عن بعض، أصحاب النبي أن النبي صلى الله عليه وسلم رأى رجلا يصلي وفي ظهر قدمه لمعة قدر الدرهم لم يصبها الماء فأمره النبي صلى الله عليه وسلم أن يعيد الوضوء والصلاة ‏.‏",
      "text_en": " Narrated Some Companions of the Prophet:                     The Prophet (ﷺ) saw a person offering prayer, and on the back of his foot a small part equal to the space of a dirham remained unwashed; the water did not reach it. The Prophet (ﷺ) commanded him to repeat the ablution and prayer.",
      "chain": [
        "26010",
        "20644",
        "11282"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، - في آخرين - قالوا حدثنا بقية، عن الوضين بن عطاء، عن محفوظ بن علقمة، عن عبد الرحمن بن عائذ، عن علي بن أبي طالب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وكاء السه العينان فمن نام فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) said: The eyes are the leather strap of the anus, so one who sleeps should perform ablution.",
      "chain": [
        "26010",
        "20644",
        "17548",
        "18970",
        "19925",
        "5"
      ]
    },
    {
      "hadith_no": "213",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عبد الملك اليزني، حدثنا بقية بن الوليد، عن سعد الأغطش، - وهو ابن عبد الله - عن عبد الرحمن بن عائذ الأزدي، - قال هشام وهو ابن قرط أمير حمص - عن معاذ بن جبل، قال سألت رسول الله صلى الله عليه وسلم عما يحل للرجل من امرأته وهي حائض قال فقال ‏\"‏ ما فوق الإزار والتعفف عن ذلك أفضل ‏\"‏ ‏.‏ قال أبو داود وليس هو - يعني الحديث - بالقوي ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     I asked the Messenger of Allah (ﷺ): What is lawful for a man to do with his wife when she is menstruating? He replied: What is above the waist-wrapper, but it is better to abstain from it, too.Abu Dawud said: This (tradition) is not strong.",
      "chain": [
        "20644",
        "19925",
        "32"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حيوة بن شريح المصري، حدثنا بقية، عن ضبارة بن عبد الله بن أبي سليك الألهاني، أخبرني ابن نافع، عن ابن شهاب الزهري، قال قال سعيد بن المسيب إن أبا قتادة بن ربعي أخبره قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله تعالى إني فرضت على أمتك خمس صلوات وعهدت عندي عهدا أنه من جاء يحافظ عليهن لوقتهن أدخلته الجنة ومن لم يحافظ عليهن فلا عهد له عندي ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Qatadah ibn Rib'iyy:                     Allah , the Exalted said: I made five times' prayers obligatory on your people, and I took a guarantee that if anyone observes them regularly at their times, I shall admit him to Paradise; if anyone does not offer them regularly, there is no such guarantee of Mine for him.",
      "chain": [
        "26010",
        "20644",
        "11002"
      ]
    },
    {
      "hadith_no": "655",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، وشعيب بن إسحاق، عن الأوزاعي، حدثني محمد بن الوليد، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فخلع نعليه فلا يؤذ بهما أحدا ليجعلهما بين رجليه أو ليصل فيهما ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when any of you prays and takes off his sandals, he should not harm anyone by them. He should place them between his feet or pray with them on",
      "chain": [
        "38363",
        "20644",
        "20239",
        "20024",
        "20459",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، حدثنا الزبيدي، عن الزهري، عن سالم، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة رفع يديه حتى تكونا حذو منكبيه ثم كبر وهما كذلك فيركع ثم إذا أراد أن يرفع صلبه رفعهما حتى تكونا حذو منكبيه ثم قال سمع الله لمن حمده ولا يرفع يديه في السجود ويرفعهما في كل تكبيرة يكبرها قبل الركوع حتى تنقضي صلاته ‏.‏",
      "text_en": " ‘Abd Allah b. Umar said:                      The Messenger of Allah (ﷺ) used to raise his hands opposite his shoulders when he began prayer, then he uttered takbir (Allah is most great) in the same condition, and then he bowed. And when he raised his back (head) after bowing he raised them opposite his shoulders, and said: “Allah listens to him who praises Him.” But he did not raise his hand when he prostrated himself; he rather raised them when he uttered the takbir (Allah is most great) before bowing until his prayer is finished.",
      "chain": [
        "20644",
        "20459",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "735",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني عتبة، حدثني عبد الله بن عيسى، عن العباس بن سهل الساعدي، عن أبي حميد، بهذا الحديث قال وإذا سجد فرج بين فخذيه غير حامل بطنه على شىء من فخذيه ‏.‏ قال أبو داود رواه ابن المبارك أخبرنا فليح سمعت عباس بن سهل يحدث فلم أحفظه فحدثنيه أراه ذكر عيسى بن عبد الله أنه سمعه من عباس بن سهل قال حضرت أبا حميد الساعدي بهذا الحديث ‏.‏",
      "text_en": " Abu Humaid reported to the same effect. He said:                      When he (the Prophet) prostrated he kept his thighs wide and did not let his belly touch the thighs.Abu Dawud says that Ibn Mubarak narrated this hadith from ‘Abbas b. Sahl, which he did not remember well. It is thought that he has mentioned ‘Isa b. ‘Abd Allah, ‘Abbas b. Sahl and Abu Humaid al-Sa’idi.",
      "chain": [
        "10581",
        "20644",
        "11361",
        "1457",
        "30002",
        "20025",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "880",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثنا شعيب، عن الزهري، عن عروة، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في صلاته ‏\"‏ اللهم إني أعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏ ‏.‏ فقال له قائل ما أكثر ما تستعيذ من المغرم فقال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to make supplication during the prayer saying: \"O Allah, I seek refuge in Thee from the punishment of the grave; I seek refuge  in Thee from the trial of the Antichrist; I seek refuge in Thee from the trial of life and the trial of death; O Allah, I seek refuge in Thee from sin and debt.\" Someone said to him: How often you seek refuge from debt! He replied: When a man is in debt, he talks and tells lies, makes promises and breaks them.",
      "chain": [
        "10581",
        "20644",
        "20428",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1073",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المصفى، وعمر بن حفص الوصابي، - المعنى - قالا حدثنا بقية، حدثنا شعبة، عن المغيرة الضبي، عن عبد العزيز بن رفيع، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ قد اجتمع في يومكم هذا عيدان فمن شاء أجزأه من الجمعة وإنا مجمعون ‏\"‏ ‏.‏ قال عمر عن شعبة ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Two festivals ('Id and Friday) have synchronised on this day. If anyone does not want to offer the Friday prayer, the 'Id prayer is sufficient for him. But we shall offer the Friday prayer.This tradition has been narrated by 'Umar from Shu'bah.",
      "chain": [
        "30204",
        "20644",
        "20020",
        "11257",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1546",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثنا ضبارة بن عبد الله بن أبي السليك، عن دويد بن نافع، حدثنا أبو صالح السمان، قال قال أبو هريرة إن رسول الله صلى الله عليه وسلم كان يدعو يقول ‏\"‏ اللهم إني أعوذ بك من الشقاق والنفاق وسوء الأخلاق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to supplicate by saying: \"O Allah, I seek refuge in Thee from divisiveness, hypocrisy, and evil character.\"",
      "chain": [
        "10581",
        "20644",
        "16029",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2483",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني بحير، عن خالد، - يعني ابن معدان - عن أبي قتيلة، عن ابن حوالة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سيصير الأمر إلى أن تكونوا جنودا مجندة جند بالشام وجند باليمن وجند بالعراق ‏\"‏ ‏.‏ قال ابن حوالة خر لي يا رسول الله إن أدركت ذلك ‏.‏ فقال ‏\"‏ عليك بالشام فإنها خيرة الله من أرضه يجتبي إليها خيرته من عباده فأما إن أبيتم فعليكم بيمنكم واسقوا من غدركم فإن الله توكل لي بالشام وأهله ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn Hawalah:                     The Prophet (ﷺ) said: It will turn out that you will be armed troops, one is Syria, one in the Yemen and one in Iraq. Ibn Hawalah said: Choose for me, Messenger of Allah, if I reach that time. He replied: Go to Syria, for it is Allah's chosen land, to which his best servants will be gathered, but if you are unwilling, go to your Yemen, and draw water from your tanks, for Allah has on my account taken special charge of Syria and its people.",
      "chain": [
        "26010",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية بن الوليد، عن ابن ثوبان، عن أبيه، يرد إلى مكحول إلى عبد الرحمن بن غنم الأشعري أن أبا مالك الأشعري، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من فصل في سبيل الله فمات أو قتل فهو شهيد أو وقصه فرسه أو بعيره أو لدغته هامة أو مات على فراشه أو بأى حتف شاء الله فإنه شهيد وإن له الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMalik al-Ash'ari:                     AbuMalik heard the Messenger of Allah (ﷺ) say: He who goes forth in Allah's path and dies or is killed is a martyr, or has his neck broken through being thrown by his horse or by his camel, or is stung by a poisonous creature, or dies on his bed by any kind of death Allah wishes is a martyr and will go to Paradise.",
      "chain": [
        "38363",
        "20644"
      ]
    },
    {
      "hadith_no": "2515",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني بحير، عن خالد بن معدان، عن أبي بحرية، عن معاذ بن جبل، عن رسول الله صلى الله عليه وسلم أنه قال ‏:‏ ‏\"‏ الغزو غزوان فأما من ابتغى وجه الله، وأطاع الإمام، وأنفق الكريمة، وياسر الشريك، واجتنب الفساد، فإن نومه ونبهه أجر كله وأما من غزا فخرا ورياء وسمعة، وعصى الإمام، وأفسد في الأرض، فإنه لم يرجع بالكفاف ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: Fighting is of two kinds: The one who seeks Allah's favour, obeys the leader, gives the property he values, treats his associates gently and avoids doing mischief, will have the reward for all the time whether he is asleep or awake; but the one who fights in a boasting spirit, for the sake of display and to gain a reputation, who disobeys the leader and does mischief in the earth will not return credit or without blame.",
      "chain": [
        "26010",
        "20644",
        "11422",
        "19921",
        "32"
      ]
    },
    {
      "hadith_no": "2541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن خالد أبو مروان، وابن المصفى، قالا حدثنا بقية، عن ابن ثوبان، عن أبيه، يرد إلى مكحول إلى مالك بن يخامر أن معاذ بن جبل، حدثهم أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ من قاتل في سبيل الله فواق ناقة فقد وجبت له الجنة، ومن سأل الله القتل من نفسه صادقا ثم مات أو قتل فإن له أجر شهيد ‏\"‏ ‏.‏ زاد ابن المصفى من هنا ‏:‏ ‏\"‏ ومن جرح جرحا في سبيل الله أو نكب نكبة فإنها تجيء يوم القيامة كأغزر ما كانت، لونها لون الزعفران، وريحها ريح المسك، ومن خرج به خراج في سبيل الله فإن عليه طابع الشهداء ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: If anyone fights in Allah's path as long as the time between two milkings of a she-camel, Paradise will be assured for him. If anyone sincerely asks Allah for being killed and then dies or is killed, there will be a reward of a martyr for him. Ibn al-Musaffa added from here: If anyone is wounded in Allah's path, or suffers a misfortune, it will come on the Day of resurrection as copious as possible, its colour saffron, and its odour musk; and if anyone suffers from ulcers while in Allah's path, he will have on him the stamp of the martyrs.",
      "chain": [
        "37540",
        "20644",
        "32"
      ]
    },
    {
      "hadith_no": "2603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني صفوان، حدثني شريح بن عبيد، عن الزبير بن الوليد، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم إذا سافر فأقبل الليل قال ‏\"‏ يا أرض ربي وربك الله أعوذ بالله من شرك وشر ما فيك وشر ما خلق فيك ومن شر ما يدب عليك وأعوذ بالله من أسد وأسود ومن الحية والعقرب ومن ساكن البلد ومن والد وما ولد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     When the Messenger of Allah (ﷺ) was travelling and night came on, he said: O earth, my Lord and  your Lord is Allah; I seek refuge in Allah from your evil, the evil of what you contain, the evil of what has been created in you, and the evil of what creeps upon you; I seek refuge in Allah from lions, from large black snakes, from other snakes, from scorpions, from the evil of jinn which inhabit a settlement, and from a parent and his offspring.",
      "chain": [
        "10581",
        "20644",
        "10921",
        "18414",
        "17022",
        "18"
      ]
    },
    {
      "hadith_no": "2630",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، عن الأوزاعي، عن أسيد بن عبد الرحمن، عن فروة بن مجاهد، عن سهل بن معاذ، عن أبيه، قال غزونا مع نبي الله صلى الله عليه وسلم ‏.‏ بمعناه ‏.‏",
      "text_en": " Sahl bin Mu’adh reported on the authority of his father “We fought along with the Prophet of Allaah(ﷺ). The rest of the tradition is to the same effect.”",
      "chain": [
        "10581",
        "20644",
        "20024",
        "18053",
        "5225"
      ]
    },
    {
      "hadith_no": "2856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا محمد بن حرب، ح وحدثنا محمد بن المصفى، حدثنا بقية، عن الزبيدي، حدثنا يونس بن سيف، حدثنا أبو إدريس الخولاني، حدثني أبو ثعلبة الخشني، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ثعلبة كل ما ردت عليك قوسك وكلبك ‏\"‏ ‏.‏ زاد عن ابن حرب ‏\"‏ المعلم ويدك فكل ذكيا وغير ذكي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said to me: AbuTha'labah, eat what returns to you by your bow and your dog.  Ibn Harb's version adds: \"The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered\".",
      "chain": [
        "30373",
        "20644",
        "20459",
        "19199",
        "11027"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني عمارة بن أبي الشعثاء، حدثني سنان بن قيس، حدثني شبيب بن نعيم، حدثني يزيد بن خمير، حدثني أبو الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أخذ أرضا بجزيتها فقد استقال هجرته ومن نزع صغار كافر من عنقه فجعله في عنقه فقد ولى الإسلام ظهره ‏\"‏ ‏.‏ قال فسمع مني خالد بن معدان هذا الحديث فقال لي أشبيب حدثك قلت نعم ‏.‏ قال فإذا قدمت فسله فليكتب إلى بالحديث ‏.‏ قال فكتبه له فلما قدمت سألني خالد بن معدان القرطاس فأعطيته فلما قرأه ترك ما في يديه من الأرضين حين سمع ذلك ‏.‏ قال أبو داود هذا يزيد بن خمير اليزني ليس هو صاحب شعبة ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: If anyone takes land by (paying) its jizyah, he renounces his immigration; and if anyone takes off the disgrace of an unbeliever from his neck he turns away his back from Islam. He (the narrator) said: Thereafter Khalid ibn Ma'dan heard this tradition from me, and he said: Has Shubayb narrated it to you? I said: Yes. He said! When you come to him, ask him to write this tradition to me. He said: He then wrote it for him. When I came, Khalid ibn Ma'dan asked me for the paper and I gave it to him. When he read (the paper), he abandoned the lands he had in his possession the moment he heard this.Abu Dawud said: This Yazid b. Khumair al-Yazani is not the disciple of Shu'bah.",
      "chain": [
        "26010",
        "20644",
        "28422",
        "27014",
        "17033",
        "10981"
      ]
    },
    {
      "hadith_no": "3417",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد، قالا حدثنا بقية، حدثني بشر بن عبد الله بن يسار، قال عمرو حدثني عبادة بن نسى، عن جنادة بن أبي أمية، عن عبادة بن الصامت، نحو هذا الخبر - والأول أتم - فقلت ما ترى فيها يا رسول الله فقال ‏\"‏ جمرة بين كتفيك تقلدتها ‏\"‏ ‏.‏ أو ‏\"‏ تعلقتها ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Ubadah b. al-Samit through a different chain of narrators, but the former tradition is more perfect. This version has:                      I said: What do you think about it, Messenger of Allah? He said: A live coal between your shoulders which you have put around your neck or hanged it.",
      "chain": [
        "10581",
        "38462",
        "20644",
        "11081",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3627",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، وموسى بن مروان الرقي، قالا حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن سيف، عن عوف بن مالك، أنه حدثهم أن النبي صلى الله عليه وسلم قضى بين رجلين ‏.‏ فقال المقضي عليه لما أدبر حسبي الله ونعم الوكيل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله يلوم على العجز ولكن عليك بالكيس فإذا غلبك أمر فقل حسبي الله ونعم الوكيل ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Holy Prophet (ﷺ) gave a decision between two men, and the one against whom the decision was given turned away and said: For me Allah sufficeth, and He is the best dispenser of affairs. The Holy Prophet (ﷺ) said: Allah, Most High, blames for falling short, but apply intelligence, and when the matter gets the better of you, say; For me Allah sufficeth, and He is the best disposer of affairs.",
      "chain": [
        "38363",
        "35154",
        "20644",
        "11422",
        "11558",
        "10805"
      ]
    },
    {
      "hadith_no": "3739",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، حدثنا الزبيدي، عن نافع، بإسناد أيوب ومعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Nafi’ to the same effect through the chain of narrators as mentioned in Ayyub.",
      "chain": [
        "20644",
        "20459"
      ]
    },
    {
      "hadith_no": "3790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن شبيب، وحيوة بن شريح الحمصي، قال حيوة حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير - زاد حيوة - وكل ذي ناب من السباع ‏.‏ قال أبو داود وهو قول مالك ‏.‏ قال أبو داود لا بأس بلحوم الخيل وليس العمل عليه ‏.‏ قال أبو داود وهذا منسوخ قد أكل لحوم الخيل جماعة من أصحاب النبي صلى الله عليه وسلم منهم ابن الزبير وفضالة بن عبيد وأنس بن مالك وأسماء ابنة أبي بكر وسويد بن غفلة وعلقمة وكانت قريش في عهد رسول الله صلى الله عليه وسلم تذبحها ‏.‏",
      "text_en": " Narrated Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) forbade us to eat horse-flesh, the flesh of mules and of asses. The narrator Haywah added: Every beast of prey with a fang.Abu Dawud said: This view is held by Malik.Abu Dawud said: There is no harm in (eating) horse-flesh and this tradition is not practised.Abu Dawud said: This tradition has been abrogated. A body of Companions of the Prophet (ﷺ) had eaten horse-flesh. OF them are: Ibn al-Zubair, Fudalah bin 'Ubaid, Anas bin Malik, Asma' daughter of Abu Bakr, Suwaid bin Ghaflah, 'Alqamah; the Quraish used to slaughter them (horses) during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "26010",
        "26010",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "3829",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا ح، وحدثنا حيوة بن شريح، حدثنا بقية، عن بحير، عن خالد، عن أبي زياد، خيار بن سلمة أنه سأل عائشة عن البصل، فقالت إن آخر طعام أكله رسول الله صلى الله عليه وسلم طعام فيه بصل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Khalid said: AbuZiyad Khiyar ibn Salamah asked Aisha about onions. She replied: The last food which the Messenger of Allah (ﷺ) ate was some which contained onions.",
      "chain": [
        "30309",
        "26010",
        "20644",
        "11282",
        "53"
      ]
    },
    {
      "hadith_no": "3899",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، حدثني الزبيدي، عن الزهري، عن طارق، - يعني ابن مخاشن - عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بلديغ لدغته عقرب قال فقال ‏\"‏ لو قال أعوذ بكلمات الله التامة من شر ما خلق لم يلدغ ‏\"‏ ‏.‏ أو ‏\"‏ لم تضره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     A man who was stung by a scorpion was brought to the Prophet (ﷺ). He said: Had he said the word: \"I seek refuge in the perfect words of Allah from the evil of what He created, \"he would not have been stung, or he said, \"It would not have harmed him.\"",
      "chain": [
        "26010",
        "20644",
        "20459",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "3915",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، قال قلت لمحمد - يعني ابن راشد - قوله ‏\"‏ هام ‏\"‏ ‏.‏ قال كانت الجاهلية تقول ليس أحد يموت فيدفن إلا خرج من قبره هامة ‏.‏ قلت فقوله صفر ‏.‏ قال سمعت أن أهل الجاهلية يستشئمون بصفر فقال النبي صلى الله عليه وسلم ‏\"‏ لا صفر ‏\"‏ ‏.‏ قال محمد وقد سمعنا من يقول هو وجع يأخذ في البطن فكانوا يقولون هو يعدي فقال ‏\"‏ لا صفر ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. al-Musaffa said to us on the authority of Baqiyyah. He said:                      I asked Muhammad b. Rashid about the meaning of the word hamah. He replied: The pre-Islamic Arabs used to say: When anyone dies and is buried, a bird comes forth from his grave. I asked: What did he mean by safar ? He said: I heard that the pre-Islamic Arabs used to take evil omen from safar. So the Prophet (ﷺ) said: There is no safar. Muhammad (b. Rashid) said: We heard someone say: It is a pain in the stomach. They said that it was infection. Hence he said: There is no safar.",
      "chain": [
        "20644"
      ]
    },
    {
      "hadith_no": "3966",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان بن عمرو، حدثني سليم بن عامر، عن شرحبيل بن السمط، أنه قال لعمرو بن عبسة حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة كانت فداءه من النار ‏\"‏ ‏.‏",
      "text_en": " Amr ibn Abasah, said that Marrah ibn Ka'b said:                      I heard the Messenger of Allah (ﷺ) say: If anyone emancipates a Muslim slave, that will be his ransom from Jahannam.",
      "chain": [
        "38363",
        "20644",
        "10921",
        "10915",
        "6225"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد الحمصيان، قالا حدثنا بقية، عن الزبيدي، عن الزهري، عن أنس بن مالك، أنه حدثه أنه، رأى على أم كلثوم بنت رسول الله صلى الله عليه وسلم بردا سيراء ‏.‏ قال والسيراء المضلع بالقز ‏.‏",
      "text_en": " Anas b. Malik said that he saw a striped garment over Umm Kulthum, daughter of the Messenger of Allah (ﷺ). He said:                      The word \"siyara\" means striped with silk.",
      "chain": [
        "10581",
        "38462",
        "20644",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4131",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد الحمصي، حدثنا بقية، عن بحير، عن خالد، قال وفد المقدام بن معديكرب وعمرو بن الأسود ورجل من بني أسد من أهل قنسرين إلى معاوية بن أبي سفيان فقال معاوية للمقدام أعلمت أن الحسن بن علي توفي فرجع المقدام فقال له رجل أتراها مصيبة قال له ولم لا أراها مصيبة وقد وضعه رسول الله صلى الله عليه وسلم في حجره فقال ‏\"‏ هذا مني وحسين من علي ‏\"‏ ‏.‏ فقال الأسدي جمرة أطفأها الله عز وجل ‏.‏ قال فقال المقدام أما أنا فلا أبرح اليوم حتى أغيظك وأسمعك ما تكره ‏.‏ ثم قال يا معاوية إن أنا صدقت فصدقني وإن أنا كذبت فكذبني قال أفعل ‏.‏ قال فأنشدك بالله هل تعلم أن رسول الله صلى الله عليه وسلم نهى عن لبس الذهب قال نعم ‏.‏ قال فأنشدك بالله هل سمعت رسول الله صلى الله عليه وسلم ينهى عن لبس الحرير قال نعم ‏.‏ قال فأنشدك بالله هل تعلم أن رسول الله صلى الله عليه وسلم نهى عن لبس جلود السباع والركوب عليها قال نعم ‏.‏ قال فوالله لقد رأيت هذا كله في بيتك يا معاوية ‏.‏ فقال معاوية قد علمت أني لن أنجو منك يا مقدام قال خالد فأمر له معاوية بما لم يأمر لصاحبيه وفرض لابنه في المائتين ففرقها المقدام في أصحابه قال ولم يعط الأسدي أحدا شيئا مما أخذ فبلغ ذلك معاوية فقال أما المقدام فرجل كريم بسط يده وأما الأسدي فرجل حسن الإمساك لشيئه ‏.‏",
      "text_en": " Khalid said:                      Al-Miqdam ibn Ma'dikarib and a man of Banu Asad from the people of Qinnisrin went to Mu'awiyah ibn AbuSufyan.  Mu'awiyah said to al-Miqdam: Do you know that al-Hasan ibn Ali has died? Al-Miqdam recited the Qur'anic verse \"We belong to Allah and to Him we shall return.\"  A man asked him: Do you think it a calamity?  He replied: Why should I not consider it a calamity when it is a fact that the Messenger of Allah (ﷺ) used to take him on his lap, saying: This belongs to me and Husayn belongs to Ali?  The man of Banu Asad said: (He was) a live coal which Allah has extinguished.  Al-Miqdam said: Today I shall continue to make you angry and make you hear what you dislike. He then said: Mu'awiyah, if I speak the truth, declare me true, and if I tell a lie, declare me false.  He said: Do so.  He said: I adjure you by Allah, did you hear the Messenger of Allah (ﷺ) forbidding use to wear gold?  He replied: Yes.  He said: I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) prohibited the wearing of silk?  He replied: Yes.  He said: I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) prohibited the wearing of the skins of beasts of prey and riding on them?  He said: Yes. He said: I swear by Allah, I saw all this in your house, O Mu'awiyah.  Mu'awiyah said: I know that I cannot be saved from you, O Miqdam.  Khalid said: Mu'awiyah then ordered to give him what he did not order to give to his two companions, and gave a stipend of two hundred (dirhams) to his son. Al-Miqdam then divided it among his companions, and the man of Banu Asad did not give anything to anyone from the property he received. When Mu'awiyah was informed about it, he said: Al-Miqdam is a generous man; he has an open hand (for generosity). The man of Banu Asad withholds his things in a good manner.",
      "chain": [
        "38429",
        "20644",
        "11282",
        "30"
      ]
    },
    {
      "hadith_no": "4296",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، حدثنا بقية، عن بحير، عن خالد، عن ابن أبي بلال، عن عبد الله بن بسر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بين الملحمة وفتح المدينة ست سنين ويخرج المسيح الدجال في السابعة ‏\"‏ ‏.‏ قال أبو داود هذا أصح من حديث عيسى ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     The Prophet (ﷺ) said: The time between the great war and the conquest of the city (Constantinople) will be six years, and the Dajjal (Antichrist) will come forth in the seventh.Abu Dawud said: This is sounder than the tradition narrated by Isa (bin Yunus)",
      "chain": [
        "26010",
        "20644",
        "11282",
        "3650"
      ]
    },
    {
      "hadith_no": "4320",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، حدثني بحير، عن خالد بن معدان، عن عمرو بن الأسود، عن جنادة بن أبي أمية، عن عبادة بن الصامت، أنه حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إني قد حدثتكم عن الدجال حتى خشيت أن لا تعقلوا إن مسيح الدجال رجل قصير أفحج جعد أعور مطموس العين ليس بناتئة ولا جحراء فإن ألبس عليكم فاعلموا أن ربكم ليس بأعور ‏\"‏ ‏.‏ قال أبو داود عمرو بن الأسود ولي القضاء ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Prophet (ﷺ) said: I have told you so much about the Dajjal (Antichrist) that I am afraid you may not understand. The Antichrist is short, hen-toed, woolly-haired, one-eyed, an eye-sightless, and neither protruding nor deep-seated. If you are confused about him, know that your Lord is not one-eyed.Abu Dawud said: 'Amr bin Al-Aswad was appointed a judge.",
      "chain": [
        "26010",
        "20644",
        "11422",
        "11714",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "4382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان، حدثنا أزهر بن عبد الله الحرازي، أن قوما، من الكلاعيين سرق لهم متاع فاتهموا أناسا من الحاكة فأتوا النعمان بن بشير صاحب النبي صلى الله عليه وسلم فحبسهم أياما ثم خلى سبيلهم فأتوا النعمان فقالوا خليت سبيلهم بغير ضرب ولا امتحان ‏.‏ فقال النعمان ما شئتم إن شئتم أن أضربهم فإن خرج متاعكم فذاك وإلا أخذت من ظهوركم مثل ما أخذت من ظهورهم ‏.‏ فقالوا هذا حكمك فقال هذا حكم الله وحكم رسوله صلى الله عليه وسلم ‏.‏ قال أبو داود إنما أرهبهم بهذا القول أى لا يجب الضرب إلا بعد الاعتراف ‏.‏",
      "text_en": " Azhar ibn Abdullah al-Harari said:                      Some goods of the people of Kila' were stolen. They accused some men of the weavers (of theft). They came to an-Nu'man ibn Bashir, the companion of the Prophet (ﷺ). He confined them for some days and then set them free.  They came to an-Nu'man and said: You have set them free without beating and investigation. An-Nu'man said: What do you want? You want me to beat them. If your goods are found with them, then it is all right; otherwise, I shall take (retaliation) from your back as I have taken from their backs.  They asked: Is this your decision?  He said: This is the decision of Allah and His Apostle (ﷺ).Abu Dawud said: By this statement he frightened them ; that is, beating is not necessary except after acknowledgement.",
      "chain": [
        "38363",
        "20644",
        "10921",
        "18019"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن يحيى، قالا حدثنا أبو المغيرة، حدثنا صفوان، ح وحدثنا عمرو بن عثمان، حدثنا بقية، قال حدثني صفوان، نحوه قال حدثني أزهر بن عبد الله الحرازي، عن أبي عامر الهوزني، عن معاوية بن أبي سفيان، أنه قام فينا فقال ألا إن رسول الله صلى الله عليه وسلم قام فينا فقال ‏\"‏ ألا إن من قبلكم من أهل الكتاب افترقوا على ثنتين وسبعين ملة وإن هذه الملة ستفترق على ثلاث وسبعين ثنتان وسبعون في النار وواحدة في الجنة وهي الجماعة ‏\"‏ ‏.‏ زاد ابن يحيى وعمرو في حديثيهما ‏\"‏ وإنه سيخرج من أمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكلب لصاحبه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ الكلب بصاحبه لا يبقى منه عرق ولا مفصل إلا دخله ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Amir al-Hawdhani said:                      Mu’awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of ALLA H (SAWS) stood among us and said: Beware! The people of the Book before were split up into seventy-two sects, and this community will be split into seventy three: seventy-two of them will go to Hell and one of them will go to Paradise, and it is the majority group.Ibn Yahya and ‘Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, ‘Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
      "chain": [
        "30007",
        "11222",
        "20442",
        "10921",
        "10581",
        "20644",
        "10921",
        "18019",
        "27"
      ]
    },
    {
      "hadith_no": "4704",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، قال حدثني عمر بن جعثم القرشي، قال حدثني زيد بن أبي أنيسة، عن عبد الحميد بن عبد الرحمن، عن مسلم بن يسار، عن نعيم بن ربيعة، قال كنت عند عمر بن الخطاب بهذا الحديث وحديث مالك أتم ‏.‏",
      "text_en": " Nu’aim b. Rabl’ah said :                      I was with ‘Umar b. al-Khattab when he transmitted this tradition. The tradition of Malik is more perfect.",
      "chain": [
        "20644",
        "11340",
        "11190",
        "13118"
      ]
    },
    {
      "hadith_no": "4712",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، ح وحدثنا موسى بن مروان الرقي، وكثير بن عبيد المذحجي، قالا حدثنا محمد بن حرب، - المعنى - عن محمد بن زياد، عن عبد الله بن أبي قيس، عن عائشة، قالت قلت يا رسول الله ذراري المؤمنين فقال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏ فقلت يا رسول الله بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏ قلت يا رسول الله فذراري المشركين قال ‏\"‏ من آبائهم ‏\"‏ ‏.‏ قلت بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said :                      I said : Messenger of Allah (May peace be upon him) what happens to the offspring of believers ? He replied : They are joined to their parents. I asked : Messenger of Allah! Although they have done nothing ? He replied : Allah knows best what they were doing. I asked : what happens to the offspring of polytheists, Messenger of Allah ? he replied! They are joined to their parents. I asked : Although they have done nothing? He replied : Allah knows best what they were doing.",
      "chain": [
        "38363",
        "20644",
        "35154",
        "38462",
        "30373",
        "11216",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، وأبو المغيرة، قالا حدثنا صفوان، قال حدثني راشد بن سعد، وعبد الرحمن بن جبير، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم فقلت من هؤلاء يا جبريل قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم ‏\"‏ ‏.‏ قال أبو داود حدثناه يحيى بن عثمان عن بقية ليس فيه أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When I was taken up to heaven I passed by people who had nails of copper and were scratching their faces and their breasts. I said: Who are these people,  Gabriel? He replied: They are those who were given to back biting and who aspersed people's honour.Abu Dawud said: Yahya b. 'Uthman has also transmitted it from Baqiyyah, there is no mention of Anas in it.",
      "chain": [
        "20644",
        "20442",
        "10921",
        "19909",
        "10865",
        "19"
      ]
    },
    {
      "hadith_no": "4881",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح المصري، حدثنا بقية، عن ابن ثوبان، عن أبيه، عن مكحول، عن وقاص بن ربيعة، عن المستورد، أنه حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ من أكل برجل مسلم أكلة فإن الله يطعمه مثلها من جهنم ومن كسي ثوبا برجل مسلم فإن الله يكسوه مثله من جهنم ومن قام برجل مقام سمعة ورياء فإن الله يقوم به مقام سمعة ورياء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mustawrid:                     The Prophet (ﷺ) said: If anyone eats once at the cost of a Muslim's honour, Allah will give him a like amount of Jahannam to eat; if anyone clothes himself with a garment at the cost of a Muslim's honour, Allah will clothe him with like amount of Jahannam; and if anyone puts himself in a position of reputation and show Allah will disgrace him with a place of reputation and show on the Day of Resurrection.",
      "chain": [
        "26010",
        "20644",
        "11066",
        "2904"
      ]
    },
    {
      "hadith_no": "4971",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، - إمام مسجد حمص - حدثنا بقية بن الوليد، عن ضبارة بن مالك الحضرمي، عن أبيه، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن سفيان بن أسيد الحضرمي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كبرت خيانة أن تحدث أخاك حديثا هو لك به مصدق وأنت له به كاذب ‏\"‏ ‏.‏",
      "text_en": " Narrated Sufyan ibn Asid al-Hadrami:                     I heard the Messenger of Allah (ﷺ) say: It is great treachery that you should tell your brother something and have him believe you when you are lying.",
      "chain": [
        "26010",
        "20644",
        "10942"
      ]
    },
    {
      "hadith_no": "5057",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا بقية، عن بحير، عن خالد بن معدان، عن ابن أبي بلال، عن عرباض بن سارية، أن رسول الله صلى الله عليه وسلم كان يقرأ المسبحات قبل أن يرقد وقال ‏\"‏ إن فيهن آية أفضل من ألف آية ‏\"‏ ‏.‏",
      "text_en": " Narrated Irbad ibn Sariyah:                     The Messenger of Allah (ﷺ) used to recite al-Musabbihat before going to sleep, and say: They contain a verse which is better than a thousand verses.",
      "chain": [
        "38659",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "5078",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، عن مسلم، - يعني ابن زياد - قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يصبح اللهم إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدا عبدك ورسولك إلا غفر له ما أصاب في يومه ذلك من ذنب وإن قالها حين يمسي غفر له ما أصاب تلك الليلة ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: If anyone says in the morning: \"O Allah! in the morning we call Thee, the bearers of Thy Throne, Thy angels, and all Thy creatures to witness that Thou art Allah than Whom there is no god, Thou being alone and without a partner, and that Muhammad is Thy servant and Thy Apostle,\" Allah will forgive him any sins that he commits that day; and if he repeats them in the evening. Allah will forgive him any sins he commits that night.",
      "chain": [
        "10581",
        "20644",
        "19"
      ]
    },
    {
      "hadith_no": "5085",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا كثير بن عبيد، حدثنا بقية بن الوليد، عن عمر بن جعثم، قال حدثني الأزهر بن عبد الله الحرازي، قال حدثني شريق الهوزني، قال دخلت على عائشة رضى الله عنها فسألتها بم كان رسول الله صلى الله عليه وسلم يفتتح إذا هب من الليل فقالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان إذا هب من الليل كبر عشرا وحمد عشرا وقال ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏ عشرا وقال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ عشرا واستغفر عشرا وهلل عشرا ثم قال ‏\"‏ اللهم إني أعوذ بك من ضيق الدنيا وضيق يوم القيامة ‏\"‏ ‏.‏ عشرا ثم يفتتح الصلاة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Shariq al-Hawzani and I came to Aisha (Allah be pleased with her) and asked her: By which (prayer) the Messenger of Allah (ﷺ) began when he woke up at night? She replied: You asked me about a thing which no one asked me before. When he woke up at night, he uttered: \"Allah is Most Great\" ten times, and uttered \"Praise be to Allah\" ten times, and said \"Glory be to Allah and I begin with His praise\" ten times, and said: \"Glory be to the King, the Most Holy\" ten times, and asked Allah's pardon ten times, and said: \"There is no god but Allah\" ten times, and then said: \"O Allah! I seek refuge in Thee from the strait of the Day of resurrection,\" ten times. He then began the prayer.",
      "chain": [
        "38462",
        "20644",
        "18019"
      ]
    },
    {
      "hadith_no": "5130",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، عن أبي بكر بن أبي مريم، عن خالد بن محمد الثقفي، عن بلال بن أبي الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ حبك الشىء يعمي ويصم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: Your love for a thing causes blindness and deafness.",
      "chain": [
        "26010",
        "20644",
        "27053",
        "17505",
        "18090",
        "37"
      ]
    },
    {
      "hadith_no": "5163",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، حدثنا عثمان بن زفر، قال حدثني محمد بن خالد بن رافع بن مكيث، عن عمه الحارث بن رافع بن مكيث، وكان، رافع من جهينة قد شهد الحديبية مع رسول الله صلى الله عليه وسلم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ حسن الملكة نماء وسوء الخلق شؤم ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Makith:                     The Messenger of Allah (ﷺ) said: Treating those under one's authority well produces prosperity, but an evil nature produces evil fortune.",
      "chain": [
        "20644",
        "35079",
        "18902"
      ]
    },
    {
      "hadith_no": "5186",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، - في آخرين - قالوا حدثنا بقية بن الوليد، حدثنا محمد بن عبد الرحمن، عن عبد الله بن بسر، قال كان رسول الله صلى الله عليه وسلم إذا أتى باب قوم لم يستقبل الباب من تلقاء وجهه ولكن من ركنه الأيمن أو الأيسر ويقول ‏\"‏ السلام عليكم السلام عليكم ‏\"‏ ‏.‏ وذلك أن الدور لم يكن عليها يومئذ ستور ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     When the Messenger of Allah (ﷺ) came to some people's door, he did not face it squarely, but faced the right or left corner, and said: Peace be upon you! peace be upon you! That was because there were no curtains on the doors of the house at that time.",
      "chain": [
        "38659",
        "20644",
        "11105",
        "3650"
      ]
    },
    {
      "hadith_no": "1635",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن منصور المروزي، أخبرنا حيوة بن شريح الحمصي، عن بقية، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة، عن عمرو بن عبسة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شاب شيبة في سبيل الله كانت له نورا يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وحيوة بن شريح ابن يزيد الحمصي ‏.‏",
      "text_en": " Narrated Amr bin 'Abasah:                     That the Messenger of Allah (ﷺ) said: \"Whoever develops some gray hair in the cause of Allah, it shall be a light for him in the Day of Judgement.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. As for Haiwah bin Shuraih, (the remainder of his name is) Ibn Yazid Al-Himsi.",
      "chain": [
        "30313",
        "26010",
        "20644",
        "11422",
        "19940",
        "4002"
      ]
    },
    {
      "hadith_no": "1663",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا نعيم بن حماد، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ للشهيد عند الله ست خصال يغفر له في أول دفعة ويرى مقعده من الجنة ويجار من عذاب القبر ويأمن من الفزع الأكبر ويوضع على رأسه تاج الوقار الياقوتة منها خير من الدنيا وما فيها ويزوج اثنتين وسبعين زوجة من الحور العين ويشفع في سبعين من أقاربه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب ‏.‏",
      "text_en": " Narrated Al-Miqdam bin Ma'diykarib:                     That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30025",
        "30238",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "2676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن حجر، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، قال وعظنا رسول الله صلى الله عليه وسلم يوما بعد صلاة الغداة موعظة بليغة ذرفت منها العيون ووجلت منها القلوب فقال رجل إن هذه موعظة مودع فماذا تعهد إلينا يا رسول الله قال ‏\"‏ أوصيكم بتقوى الله والسمع والطاعة وإن عبد حبشي فإنه من يعش منكم يرى اختلافا كثيرا وإياكم ومحدثات الأمور فإنها ضلالة فمن أدرك ذلك منكم فعليه بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏  وقد روى ثور بن يزيد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ حدثنا بذلك الحسن بن علي الخلال وغير واحد قالوا حدثنا أبو عاصم عن ثور بن يزيد عن خالد بن معدان عن عبد الرحمن بن عمرو السلمي عن العرباض بن سارية عن النبي صلى الله عليه وسلم نحوه والعرباض بن سارية يكنى أبا نجيح ‏.‏ وقد روي هذا الحديث عن حجر بن حجر عن عرباض بن سارية عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Al-'Irbad bin Sariyah:                     \"One day after the morning Salat, the Messenger of Allah (ﷺ) exhorted us to the extent that the eyes wept and the hearts shuddered with fear. A man said: 'Indeed this is a farewell exhortation. [So what] do you order us O Messenger of Allah?' He said: 'I order you to have Taqwa of Allah, and to listen and obey, even in the case of a Ethiopian slave. Indeed, whomever among you lives, he will see much difference. Beware of the newly invented matters, for indeed they are astray. Whoever among you sees that, then he must stick to my Sunnah and the Sunnah of the rightly guided Khulafa', click to it with the molars.'\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17046",
        "5172"
      ]
    },
    {
      "hadith_no": "3098",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن النواس بن سمعان الكلابي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ضرب مثلا صراطا مستقيما على كنفى الصراط داران لهما أبواب مفتحة على الأبواب ستور وداع يدعو على رأس الصراط وداع يدعو فوقه‏:‏ ‏(‏والله يدعو إلى دار السلام ويهدي من يشاء إلى صراط مستقيم‏)‏ والأبواب التي على كنفى الصراط حدود الله فلا يقع أحد في حدود الله حتى يكشف الستر والذي يدعو من فوقه واعظ ربه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال سمعت عبد الله بن عبد الرحمن يقول سمعت زكريا بن عدي يقول قال أبو إسحاق الفزاري خذوا عن بقية ما حدثكم عن الثقات ولا تأخذوا عن إسماعيل بن عياش ما حدثكم عن الثقات ولا غير الثقات ‏.‏",
      "text_en": " Narrated An-Nawwas bin Sam'an Al-Kilabi:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "4097",
        "3600"
      ]
    },
    {
      "hadith_no": "3171",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا علي بن حجر، أخبرنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الله بن أبي بلال، عن عرباض بن سارية، أنه حدثه أن النبي صلى الله عليه وسلم كان يقرأ المسبحات قبل أن يرقد ويقول ‏\"‏ إن فيهن آية خير من ألف آية ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Irbad bin Sariyah:                     that the Prophet (ﷺ) would recite the Musabbihat (Chapters 17, 57, 59, 61-64 & 87) before sleep and say \"Indeed there is an Ayah in them that is better than one thousand Ayat.\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17040"
      ]
    },
    {
      "hadith_no": "3406",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، أخبرنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الله بن أبي بلال، عن العرباض بن سارية، رضى الله عنه أن النبي صلى الله عليه وسلم كان لا ينام حتى يقرأ المسبحات ويقول ‏\"‏ فيها آية خير من ألف آية ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
      "text_en": " Ar-Irbad bin Sariyah [may Allah be pleased with him] narrated that:                     The Prophet would not sleepy until he had recite Al-Musabbihat, and he would say: “In them is an Ayah that is better than a thousand Ayah.”",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17040",
        "5172"
      ]
    },
    {
      "hadith_no": "3501",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا حيوة بن شريح، وهو ابن يزيد الحمصي عن بقية بن الوليد، عن مسلم بن زياد، قال سمعت أنسا، يقول إن رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قال حين يصبح اللهم أصبحنا نشهدك ونشهد حملة عرشك وملائكتك وجميع خلقك بأنك لا إله إلا أنت وحدك لا شريك لك وأن محمدا عبدك ورسولك ‏.‏ إلا غفر الله له ما أصاب في يومه ذلك وإن قالها حين يمسي غفر الله له ما أصاب في تلك الليلة من ذنب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Anas narrated that the Messenger of Allah said:                     “Whoever says in the morning: ‘O Allah we have reached morning, calling You to witness, and calling the carriers of Your Throne to witness, and Your angels, and all of Your creation, that You are Allah, none has the right to be worshipped by You, Alone, without partner, and that Muhammad is Your slave and Your Messenger. (Allahumma Asbahna Nush-hiduka Wa Nush-hidu Hamalata Arshika Wa Mala’ikataka Wa Jami’a Khalqika Bi-Annaka Allah, La Ilaha Illa Anta Wahdaka La Sharika Laka Wa Anna Muhammadan Abduka Wa Rasulika)’ Allah will forgive him for whatever he does that day, and if he says it in the evening, Allah will forgive him for whatever sin he commits that night.”",
      "chain": [
        "30025",
        "26010",
        "20644",
        "19"
      ]
    },
    {
      "hadith_no": "562",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني موسى بن سليمان بن إسماعيل بن القاسم، قال حدثنا بقية، عن يونس، قال حدثني الزهري، عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من الجمعة أو غيرها فقد تمت صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that the Prophet (ﷺ) said:                      \"Whoever catches up with with a Rak'ah of Jumu'ah or any other (prayer), his prayer is complete.\"",
      "chain": [
        "38654",
        "20644",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "599",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، عن ابن أبي حمزة، ح وأنبأنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، - واللفظ له - عن شعيب، عن الزهري، قال أخبرني سالم، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم إذا أعجله السير في السفر يؤخر صلاة المغرب حتى يجمع بينها وبين العشاء ‏.‏",
      "text_en": " It was narrated that Az-Zuhri said:                      \"Salim told me that his father said: 'I saw the Messenger of Allah (ﷺ), when he was in a hurry to travel, delaying Maghrib so that he could combine it with 'Isha'.'\"",
      "chain": [
        "10581",
        "20644",
        "30304",
        "20239",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "688",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد بن معدان، عن كثير بن مرة، عن عمرو بن عبسة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من بنى مسجدا يذكر الله فيه بنى الله عز وجل له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin 'Abasah that the Messenger of Allah (ﷺ) said:                      \"Whoever builds a Masjid in which Allah is remembered, Allah, (the Mighty and Sublime) will build for him a house in Paradise.\"",
      "chain": [
        "10581",
        "20644",
        "11422",
        "19940",
        "4002"
      ]
    },
    {
      "hadith_no": "817",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرني يحيى بن عثمان الحمصي، قال حدثنا بقية، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن العرباض بن سارية، عن رسول الله صلى الله عليه وسلم كان يصلي على الصف الأول ثلاثا وعلى الثاني واحدة ‏.‏",
      "text_en": " It was narrated from Al'Irbad bin Sariyah that the Messenger of Allah (ﷺ) used to send Salah on the first row three times and on the second row once.",
      "chain": [
        "20644",
        "11422",
        "4097",
        "5172"
      ]
    },
    {
      "hadith_no": "925",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن الزبيدي، قال أخبرني الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أمن القارئ فأمنوا فإن الملائكة تؤمن فمن وافق تأمينه تأمين الملائكة غفر الله له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'When the reciter says Amin, then say: \"Amin\" too, for the angels say Amin and if a person's Amin coincides with the Amin of the angels, Allah will forgive his previous sins\"",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "991",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، وأبو حيوة عن ابن أبي حمزة، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم قرأ في صلاة المغرب بسورة الأعراف فرقها في ركعتين ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Messenger of Allah (ﷺ) recited Surat Al-A'raf in maghrib and split it between two rak'ahs.",
      "chain": [
        "10581",
        "20644",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن ابن أبي حمزة، قال حدثني محمد، قال حدثني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، كان يحدث أن رسول الله صلى الله عليه وسلم كان يدعو في الصلاة حين يقول ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم يقول وهو قائم قبل أن يسجد ‏\"‏ اللهم أنج الوليد بن الوليد وسلمة بن هشام وعياش بن أبي ربيعة والمستضعفين من المؤمنين اللهم اشدد وطأتك على مضر واجعلها عليهم كسني يوسف ‏\"‏ ‏.‏ ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ فيسجد وضاحية مضر يومئذ مخالفون لرسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     The Messenger of Allah (ﷺ) used to supplicate in prayer when he said: \"Sami' Allahu liman hamidah, Rabbana wa lakal-hamd (Allah hears those who praise Him; O our Lord, and to You be praise),\"then he said while standing, before he prostrated: \"O Allah, save Al-Walid bin Al-Walid and Salamah bin Hisham and 'Ayyshah bin Abi Rabi'ah and those who are weak and oppressed in Makkah. O Allah, intensify Your punishment in Mudar and give them years (of famine) like the years of Yusuf.\" Then he would say: \"Allah is Most Great\" and then he prostrated. The people of Mudar and their environs were opposed to the Messenger of Allah (ﷺ) at the time.",
      "chain": [
        "10581",
        "20644",
        "20278",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير بن دينار، قال حدثنا بقية، قال حدثنا شعبة، قال وحدثني ابن عون، وخالد الحذاء، عن ابن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم سجد في وهمه بعد التسليم ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Prophet (ﷺ) prostrated after the salam when he was not sure.",
      "chain": [
        "38429",
        "20644",
        "20020",
        "11071",
        "11282",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بقية، قال حدثنا الزبيري، أن مكحولا، حدثه أن مسروق بن الأجدع حدثه عن عائشة، قالت رأيت رسول الله صلى الله عليه وسلم يشرب قائما وقاعدا ويصلي حافيا ومنتعلا وينصرف عن يمينه وعن شماله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I saw the Messenger of Allah (ﷺ) drink standing and sitting, and he prayed barefoot and with sandals, and he left (after prayer) to the right and to the left.\"",
      "chain": [
        "30123",
        "20644",
        "20355",
        "11066",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1512",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا هشام بن عبد الملك أبو تقي الحمصي، قال حدثنا بقية، عن شعيب، عن الزهري، عن عباد بن تميم، عن عمه، أنه رأى رسول الله صلى الله عليه وسلم في الاستسقاء استقبل القبلة وقلب الرداء ورفع يديه ‏.‏",
      "text_en": " It was narrated from 'Abbad bin Tamim, from his paternal uncle, that:                     He saw the Messenger of Allah (ﷺ), when he prayed for rain, turn to face the Qiblah, turning his cloak around and raising his hands.",
      "chain": [
        "20644",
        "20428",
        "11013",
        "639"
      ]
    },
    {
      "hadith_no": "1539",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرني كثير بن عبيد، عن بقية، عن شعيب، قال حدثني الزهري، قال حدثني سالم بن عبد الله، عن أبيه، قال غزوت مع رسول الله صلى الله عليه وسلم قبل نجد فوازينا العدو وصاففناهم فقام رسول الله صلى الله عليه وسلم يصلي بنا فقامت طائفة منا معه وأقبل طائفة على العدو فركع رسول الله صلى الله عليه وسلم ومن معه ركعة وسجد سجدتين ثم انصرفوا فكانوا مكان أولئك الذين لم يصلوا وجاءت الطائفة التي لم تصل فركع بهم ركعة وسجدتين ثم سلم رسول الله صلى الله عليه وسلم فقام كل رجل من المسلمين فركع لنفسه ركعة وسجدتين ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated that his father said:                     \"I went out on a campaign with the Messenger of Allah (ﷺ) toward Najd. We confronted the enemy and formed ranks facing them. The Messenger of Allah (ﷺ) stood up and led us in prayer. Some of us stood with him and some of us faced the enemy. The Messenger of Allah (ﷺ) bowed and those who were with him bowed, and prostrated twice. Then they moved away and took the place of the others, and the other group who had not prayed came and he led them in bowing once and prostrating twice. Then the Messenger of Allah (ﷺ) said the salam and each of the Muslims stood up and bowed once, and prostrated twice individually.\"",
      "chain": [
        "38462",
        "20644",
        "20428",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1710",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثني ضبارة بن أبي السليل، قال حدثني دويد بن نافع، قال أخبرني ابن شهاب، قال حدثني عطاء بن يزيد، عن أبي أيوب، أن النبي صلى الله عليه وسلم قال ‏\"‏ الوتر حق فمن شاء أوتر بسبع ومن شاء أوتر بخمس ومن شاء أوتر بثلاث ومن شاء أوتر بواحدة ‏\"‏ ‏.‏",
      "text_en": " Duwaid bin Nafi' said:                     \" Ibn Shihab informed me, saying: 'Ata bin Yazid narrated to me from Abu Ayyub:That the Prophet (ﷺ) said: 'Witr is a duty, and whoever wants to pray witr with seven (rak'ahs), let him do so; whoever wants to pray witr with five, let him do so, whoever wants to pray witr with three, let him do so; and whoever wants to pray witr with one, let him do so.'\"",
      "chain": [
        "10581",
        "20644",
        "16029",
        "11013",
        "11206",
        "33"
      ]
    },
    {
      "hadith_no": "1819",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثنا الزبيدي، قال حدثني الزهري، عن أبي عبيد، مولى عبد الرحمن بن عوف أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يتمنين أحدكم الموت إما محسنا فلعله أن يعيش يزداد خيرا وهو خير له وإما مسيئا فلعله أن يستعتب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Ubaid the freed slave of 'Abdur-Rahman bin Awf that he heard Abu Huraidah say:                     'None of you should wish for death. Either he is a doer of good, so if he lives he will do more good or he is a doer of evil but perhaps he will give up his evil ways.\"'",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "2083",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، قال أخبرني الزبيدي، قال أخبرني الزهري، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يبعث الناس يوم القيامة حفاة عراة غرلا ‏\"‏ ‏.‏ فقالت عائشة فكيف بالعورات قال ‏\"‏ لكل امرئ منهم يومئذ شأن يغنيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah said:                     \"The people will be raised up on the Day of Resurrection barefoot, naked and uncircumcised.\" 'Aishah said: \"What about their 'Awrahs?\" he said: \"Every man that day will have enough to make him careless of other\".",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2164",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن بقية بن الوليد، قال أخبرني بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب، عن النبي صلى الله عليه وسلم قال ‏\"‏ عليكم بغداء السحور فإنه هو الغداء المبارك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Miqdam bin Madikarib that the Prophet said:                     \"You should take Sahur for it is the blessed breakfast.\"",
      "chain": [
        "38265",
        "20025",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "2186",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عمرو بن عثمان، عن بقية، قال حدثنا بحير، عن خالد، عن جبير بن نفير، أن رجلا، سأل عائشة عن الصيام، فقالت إن رسول الله صلى الله عليه وسلم كان يصوم شعبان كله ويتحرى صيام الاثنين والخميس ‏.‏",
      "text_en": " It was narrated from Jubair bin Nufair that a man asked Aishah about fasting and she said:                     \"The Messenger of Allah used to fast all of Shaban, and he made sure to fast on Mondays and Thursdays.\" '",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "53"
      ]
    },
    {
      "hadith_no": "2356",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثنا بحير، عن خالد بن معدان، عن جبير بن نفير، أن عائشة، قالت إن رسول الله صلى الله عليه وسلم كان يصوم شعبان كله ‏.‏",
      "text_en": " It was narrated from Jubair bin Nufair that 'Aishah said:                     \"The Messenger of Allah used to fast all of Shaban.\"",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "53"
      ]
    },
    {
      "hadith_no": "2360",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن عثمان، عن بقية، قال حدثنا بحير، عن خالد بن معدان، عن جبير بن نفير، أن عائشة، قالت إن رسول الله صلى الله عليه وسلم كان يتحرى صيام الاثنين والخميس ‏.‏",
      "text_en": " It was narrate from Jubair bin Nufair that 'Aishah said:                     \"The Messenger of Allah used to be keen to fast on Mondays and Thursday.\"",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "53"
      ]
    },
    {
      "hadith_no": "2707",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني كثير بن عبيد، عن بقية، عن شعبة، قال حدثني إسماعيل بن إبراهيم، قال حدثني عبد العزيز بن صهيب، عن أنس بن مالك، قال نهى رسول الله صلى الله عليه وسلم عن التزعفر ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah forbade perfuming oneself with saffron.",
      "chain": [
        "38462",
        "20644",
        "20020",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3092",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن محمد بن مغيرة، قال حدثنا عثمان بن سعيد، عن شعيب، عن الزهري، قال حدثنا عبيد الله، ح وأنبأنا كثير بن عبيد، قال حدثنا بقية، عن شعيب، قال حدثني الزهري، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن أبا هريرة، قال لما توفي رسول الله صلى الله عليه وسلم وكان أبو بكر بعده وكفر من كفر من العرب قال عمر رضى الله عنه يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها ‏.‏ قال عمر فوالله ما هو إلا أن رأيت أن الله عز وجل شرح صدر أبي بكر للقتال فعرفت أنه الحق ‏.‏ واللفظ لأحمد ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud that Abu Hurairah said:                      \"When the Messenger of Allah (ﷺ) died and Abu Bakr (was appointed Khalifah) after him, and some of the 'Arabs disbelieved, 'Umar, may Allah be pleased with him, said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah (ﷺ) said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah.) Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?'\" Abu Bakr, may Allah be pleased with him, said: \"I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar said) 'By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.'\" The wording is that of Ahmad.",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11201",
        "38462",
        "20644",
        "20239",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "3105",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا بقية، عن الزبيدي، عن الزهري، عن عطاء بن يزيد، عن أبي سعيد الخدري، أن رجلا، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله أى الناس أفضل قال ‏\"‏ من جاهد بنفسه وماله في سبيل الله ‏\"‏ ‏.‏ قال ثم من يا رسول الله قال ‏\"‏ ثم مؤمن في شعب من الشعاب يتقي الله ويدع الناس من شره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that a man came to the Messenger of Allah (ﷺ) and said:                      \"O Messenger of Allah! Which of the people is best?\" He said: \"One who strives with himself and his wealth in the cause of Allah.\" He said: \"Then who, O Messenger of Allah?\" He said: \"Then a believer (isolating himself) in one of the mountain passes, who fears Allah and spares the people his evil.\"",
      "chain": [
        "38462",
        "20644",
        "20459",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "3142",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية، عن صفوان، قال حدثني سليم بن عامر، عن شرحبيل بن السمط، أنه قال لعمرو بن عبسة يا عمرو حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شاب شيبة في سبيل الله تعالى كانت له نورا يوم القيامة ومن رمى بسهم في سبيل الله تعالى بلغ العدو أولم يبلغ كان له كعتق رقبة ومن أعتق رقبة مؤمنة كانت له فداءه من النار عضوا بعضو ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Shurahbil bin As-Simt that he said to 'Amr bin 'Abasah:                      \"O 'Amr! Tell us a Hadith that you heard from the Messenger of Allah (ﷺ).\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever develops one gray hair in the cause of Allah, Most High, it will be light for him on the Day of Resurrection. Whoever shoots an arrow in the cause of Allah, Most High, whether it reaches the enemy or not, it will be as if he freed a slave. Whoever frees a believing slave, it will be a ransom for him from the Fire, limb by limb.'\"",
      "chain": [
        "38429",
        "20644",
        "10921",
        "10915",
        "6225"
      ]
    },
    {
      "hadith_no": "3153",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن ابن أبي عميرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من الناس من نفس مسلمة يقبضها ربها تحب أن ترجع إليكم وأن لها الدنيا وما فيها غير الشهيد ‏\"‏ ‏.‏ قال ابن أبي عميرة قال رسول الله صلى الله عليه وسلم ‏\"‏ ولأن أقتل في سبيل الله أحب إلى من أن يكون لي أهل الوبر والمدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abi 'Amirah that the Messenger of Allah (ﷺ) said:                      \"There is no Muslim soul among the people that is taken by its Lord and wishes it could come back to you, even if it had this world and everything in it, except the martyr.\" Ibn Abi 'Amirah said: \"The Messenger of Allah (ﷺ) said: 'If I were to be killed in the cause of Allah, that would be dearer to me that if all the people of the deserts and the cities were to be mine.'\"[1][1] Meaning: If they were all my slaves and I set them free.",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097"
      ]
    },
    {
      "hadith_no": "3164",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، قال حدثنا بحير، عن خالد، عن ابن أبي بلال، عن العرباض بن سارية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يختصم الشهداء والمتوفون على فرشهم إلى ربنا في الذين يتوفون من الطاعون فيقول الشهداء إخواننا قتلوا كما قتلنا ‏.‏ ويقول المتوفون على فرشهم إخواننا ماتوا على فرشهم كما متنا فيقول ربنا انظروا إلى جراحهم فإن أشبه جراحهم جراح المقتولين فإنهم منهم ومعهم فإذا جراحهم قد أشبهت جراحهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-'Irbad bin Sariyah that the Messenger of Allah (ﷺ) said:                      \"The martyrs and those who dies in their beds referred a dispute to our Lord concerning those who dies of the plague. The martyrs said: 'Our brothers were killed as we were killed.' And those who dies in their beds said: 'Our brothers dies on their beds as we died.' Our Lord said: 'Look at their wounds; if their wounds; if their wounds are like the wounds of those who were killed then they are of them and belong with them.' And their wounds were like their (the martyrs') wounds.\"",
      "chain": [
        "10581",
        "20644",
        "11282",
        "5172"
      ]
    },
    {
      "hadith_no": "3175",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني محمد بن عبد الله بن عبد الرحيم، قال حدثنا أسد بن موسى، قال حدثنا بقية، قال حدثني أبو بكر الزبيدي، عن أخيه، محمد بن الوليد عن لقمان بن عامر، عن عبد الأعلى بن عدي البهراني، عن ثوبان، مولى رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عصابتان من أمتي أحرزهما الله من النار عصابة تغزو الهند وعصابة تكون مع عيسى ابن مريم عليهما السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Thawban, the freed slave of the Messenger of Allah (ﷺ), said:                      \"The Messenger of Allah (ﷺ) said: 'There are two groups of my Ummah whom Allah will free from the Fire: The group that invades India, and the group that will be with 'Isa bin Maryam, peace be upon him.'\"",
      "chain": [
        "28040",
        "20644",
        "18888"
      ]
    },
    {
      "hadith_no": "3184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن الأوزاعي، قال حدثني يحيى، عن محمد بن إبراهيم، قال أنبأنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق زوجين في سبيل الله دعته خزنة الجنة من أبواب الجنة يا فلان هلم فادخل ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله ذاك الذي لا توى عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأرجو أن تكون منهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever spends on a pair (of things) in the cause of Allah, the gatekeepers of Paradise will call him from the gates of Paradise (saying): O So-and-so, come and enter!' Abu Bakr said: 'O Messenger of Allah, such a person will never perish or be miserable.' The Messenger of Allah (ﷺ) said: 'I hope that you will be one of them.'\"",
      "chain": [
        "10581",
        "20644",
        "20024",
        "11449",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3188",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، عن أبي بحرية، عن معاذ بن جبل، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ الغزو غزوان فأما من ابتغى وجه الله وأطاع الإمام وأنفق الكريمة وياسر الشريك واجتنب الفساد كان نومه ونبهه أجرا كله وأما من غزا رياء وسمعة وعصى الإمام وأفسد في الأرض فإنه لا يرجع بالكفاف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin Jabal that the Messenger of Allah (ﷺ) said:                      \"Campaigns are of two types. As for the one who seek the Face of Allah, obeys the imam, spends what is precious to him, is easy-going with his companion and avoids mischief, when he is asleep and when he is awake, it will all bring reward. But as for the one who fights to show off, and he disobeys the imam and does mischief in the land, he will not come back the same as when he left.\" [1][1] It was not simply be the case that he comes back with no good deeds to his credit, rather he will have a number of evil deeds on his record.",
      "chain": [
        "10581",
        "20644",
        "11282",
        "19921",
        "32"
      ]
    },
    {
      "hadith_no": "3405",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن أبي عمرو، - وهو الأوزاعي - قال حدثنا يحيى، قال حدثني أبو سلمة، قال حدثتني فاطمة بنت قيس، أن أبا عمرو بن حفص المخزومي، طلقها ثلاثا فانطلق خالد بن الوليد في نفر من بني مخزوم إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أبا عمرو بن حفص طلق فاطمة ثلاثا فهل لها نفقة فقال ‏\"‏ ليس لها نفقة ولا سكنى ‏\"‏ ‏.‏",
      "text_en": " Fatimah bint Qais narrated that Abu 'Amr bin Hafs Al-Makhzumi divorced her thrice. Khalid bin Al-Walid went with a group of (the tribe of) Makhzum to the Messenger of Allah and said:                      \"O Messenger of Allah! Abu 'Amr bin Hafs has divorced Fatimah thrice, is she entitled to provision?\" He said: \"She is not entitled to provision nor shelter.\"",
      "chain": [
        "10581",
        "20644",
        "20031",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "3592",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية بن الوليد، قال حدثنى شعبة، قال حدثني حميد الطويل، عن أنس بن مالك، قال سابق رسول الله صلى الله عليه وسلم أعرابي فسبقه فكأن أصحاب رسول الله صلى الله عليه وسلم وجدوا في أنفسهم من ذلك فقيل له في ذلك فقال ‏\"‏ حق على الله أن لا يرفع شىء نفسه في الدنيا إلا وضعه الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah raced with a Bedouin and (the latter) won. It was as if the Companions of the Messenger of Allah were upset by this, so he said: 'It is a right upon Allah that there is nothing that raises itself in this world except that He lowers it.'\"",
      "chain": [
        "38429",
        "20644",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3605",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا محمد بن مصفى بن بهلول، قال حدثنا بقية، عن سعيد بن سالم المكي، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، عن عمر، قال سألت رسول الله صلى الله عليه وسلم عن أرض لي بثمغ قال ‏\"‏ احبس أصلها وسبل ثمرتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar said:                      \"I asked the Messenger of Allah about some land of mine in Thamgh. He said: 'Freeze it and donate its fruits.'\"",
      "chain": [
        "20644",
        "23020",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "3740",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا عمر، عن الأوزاعي، حدثنا ابن شهاب، قال وأخبرني عمرو بن عثمان، أنبأنا بقية بن الوليد، عن الأوزاعي، عن الزهري، عن عروة، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعمر عمرى فهي له ولعقبه يرثها من يرثه من عقبه ‏\"‏ ‏.‏",
      "text_en": " Al-Awza'i narrated from Az-Zuhri, from 'Urwah, from Jabir, who said:                      \"The Messenger of Allah said: 'Whoever is given something on the basis of 'Umra, it belongs to him and to his descendants, and is inherited by those who inherit from him.'\"",
      "chain": [
        "37534",
        "3",
        "20024",
        "11013",
        "10581",
        "20644",
        "20024",
        "11013",
        "10511",
        "34"
      ]
    },
    {
      "hadith_no": "3841",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، عن أبي عمرو، - وهو الأوزاعي - عن يحيى بن أبي كثير، عن محمد بن الزبير الحنظلي، عن أبيه، عن عمران بن حصين، رضى الله عنهما قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر في معصية وكفارتها كفارة يمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain, may Allah be pleased with him, said:                      \"The Messenger of Allah said: 'There is no vow to commit an act of disobedience, and its expiation is the expiation for an oath.'\"",
      "chain": [
        "10581",
        "20644",
        "11449",
        "14340",
        "123"
      ]
    },
    {
      "hadith_no": "4009",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بقية، قال حدثني بحير بن سعد، عن خالد بن معدان، أن أبا رهم السمعي، حدثهم أن أبا أيوب الأنصاري حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جاء يعبد الله ولا يشرك به شيئا ويقيم الصلاة ويؤتي الزكاة ويجتنب الكبائر كان له الجنة ‏\"‏ ‏.‏ فسألوه عن الكبائر فقال ‏\"‏ الإشراك بالله وقتل النفس المسلمة والفرار يوم الزحف ‏\"‏ ‏.‏",
      "text_en": " Abu Ayyub Al-Ansari narrated that:                     The Messenger of Allah [SAW] said: \"Whoever comes worshipping Allah and not associating anything with Him, establishing Salah, paying Zakah and avoiding major sins, Paradise will be his.\" They asked him about major sins and he said: \"Associating others with Allah, killing a Muslim soul, and fleeing (from the battlefield) on the day of the march.\"",
      "chain": [
        "30123",
        "20644",
        "11422",
        "33"
      ]
    },
    {
      "hadith_no": "4195",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد، قال حدثنا بقية بن الوليد، قال حدثنا بحير، عن خالد بن معدان، عن أبي بحرية، عن معاذ بن جبل، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ الغزو غزوان فأما من ابتغى وجه الله وأطاع الإمام وأنفق الكريمة واجتنب الفساد فإن نومه ونبهته أجر كله وأما من غزا رياء وسمعة وعصى الإمام وأفسد في الأرض فإنه لا يرجع بالكفاف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muadah bin Jabal that the Messenger of Allah said:                     \"Military campaigns are of two types: as for the one who seeks the Face of Allah, obeys the imam, spends what is precious and avoids mischief, whether he is asleep or awake, he is earning reward. But as for the one who fights in order to show off and gain a reputation, and disobeys the imam and spreads mischief in the land, he comes back empty-handed.\" (Da 'if)",
      "chain": [
        "10581",
        "20644",
        "11422",
        "19921",
        "32"
      ]
    },
    {
      "hadith_no": "4204",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثنا ابن المبارك، عن ابن أبي حسين، عن القاسم بن محمد، قال سمعت عمتي، تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من ولي منكم عملا فأراد الله به خيرا جعل له وزيرا صالحا إن نسي ذكره وإن ذكر أعانه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Qasim bin Muhammad said:                     \" I heard my paternal aunt say: 'The Messenger of Allah said; \"Whoever among you is appointed to a position of authority. If Allah wills good for him. He will give him a righteous minister who will remind him if he forgets and help him if he remembers",
      "chain": [
        "10581",
        "20644",
        "20025",
        "10535"
      ]
    },
    {
      "hadith_no": "4254",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد بن معدان، عن المقدام بن معديكرب، قال نهى رسول الله صلى الله عليه وسلم عن الحرير والذهب ومياثر النمور ‏.‏",
      "text_en": " It was narrated that Al-Miqdam bin Ma di Karib said:                     \"The Messenger of Allah forbade silk, gold and saddlecloths (Miyathir) made of leopard skin.",
      "chain": [
        "10581",
        "20644",
        "11422"
      ]
    },
    {
      "hadith_no": "4255",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، قال وفد المقدام بن معديكرب على معاوية فقال له أنشدك بالله هل تعلم أن رسول الله صلى الله عليه وسلم نهى عن لبوس جلود السباع والركوب عليها قال نعم ‏.‏",
      "text_en": " It was narrated that Khalid said:                     \"Al-Miqdam bi8n Ma di Karib came to visit Mu awiyah and said to him: I adjure you by Allah, do you know that the messenger of Allah forbade wearing the Hides of predators and riding on them? He said: 'yes.\"",
      "chain": [
        "10581",
        "20644",
        "11282"
      ]
    },
    {
      "hadith_no": "4326",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، عن جبير بن نفير، عن أبي ثعلبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل النهبى ولا يحل من السباع كل ذي ناب ولا تحل المجثمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Tha'labah said:                     \"The Messenger of Allah said: 'Wealth taken by force is (not permissible), any predator that has fangs is not permissible, and any animal used for target practice is not permissible.\"",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "4056"
      ]
    },
    {
      "hadith_no": "4331",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا بقية بن الوليد، قال حدثني ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل أكل لحوم الخيل والبغال والحمير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khalid bin al-walid that he heard the Messe4nger of Allah say:                     \"It is not permissible to eat the flesh of horses, mules or donkeys.\"",
      "chain": [
        "30123",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "4332",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير وكل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Khalid bin Al-Walid that:                     the Messenger of Allah forbade eating the flesh of horses, mules and donkeys, and any predator that has fangs.",
      "chain": [
        "38462",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "4341",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، أنبأنا بقية، عن بحير، عن خالد بن معدان، عن جبير بن نفير، عن أبي ثعلبة الخشني، أنه حدثهم أنهم، غزوا مع رسول الله صلى الله عليه وسلم إلى خيبر والناس جياع فوجدوا فيها حمرا من حمر الإنس فذبح الناس منها فحدث بذلك النبي صلى الله عليه وسلم فأمر عبد الرحمن بن عوف فأذن في الناس ‏\"‏ ألا إن لحوم الحمر الإنس لا تحل لمن يشهد أني رسول الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Tha''Aabah Al-Khushani that:                     they went on a military campaign with the Messenger of Allah to Khaibar, and the people were starving. They found some domesticated donkeys there, so the people slaughtered some of them. The Prophet was told about that, and he ordered 'Abdur-rahman bin 'Awf to announce to the people: \"The flesh of domesticated donkeys is not permissible for the one who testifies that I am the Messenger of Allah.\"",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "4056"
      ]
    },
    {
      "hadith_no": "4342",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، عن بقية، قال حدثني الزبيدي، عن الزهري، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السباع وعن لحوم الحمر الأهلية ‏.‏",
      "text_en": " It was narrated from Abu Tha'labah Al-khushani that:                     the Messenger of Allah forbade eating any -predator with fangs, and the flesh of domesticated donkeys.",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "4438",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، عن جبير بن نفير، عن أبي ثعلبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل المجثمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Tha'labah said:                     \"The Messenger of Allah said: An animal that has been taken as a target is not lawful.\"",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "4056"
      ]
    },
    {
      "hadith_no": "4874",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا بقية بن الوليد، قال حدثني صفوان بن عمرو، قال حدثني أزهر بن عبد الله الحرازي، عن النعمان بن بشير، أنه رفع إليه نفر من الكلاعيين أن حاكة سرقوا متاعا فحبسهم أياما ثم خلى سبيلهم فأتوه فقالوا خليت سبيل هؤلاء بلا امتحان ولا ضرب ‏.‏ فقال النعمان ما شئتم إن شئتم أضربهم فإن أخرج الله متاعكم فذاك وإلا أخذت من ظهوركم مثله ‏.‏ قالوا هذا حكمك ‏.‏ قال هذا حكم الله عز وجل ورسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that:                     a group of the Kala'iyin complaned to him about some people who had stolen some goods, shoe detained them for several days, and then he let them go. They came and said: \"You let them go without any pressure (to make them admit to their crime) or beating?\" An-Nu'man said: \"What do you want? If you wish, I will beat them, and if Allah brings back your goods thereby, all well and good. Otherwise I will take retaliation from your backs (by beating you) likewise.\" They said: \"is this your ruling?\" He said: \"This is the ruling of Allah and His Messenger \"(Daif)",
      "chain": [
        "30123",
        "20644",
        "10921",
        "18019",
        "274"
      ]
    },
    {
      "hadith_no": "4979",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثني بقية، قال حدثني نافع بن يزيد، قال حدثني حيوة بن شريح، عن عياش بن عباس، عن جنادة بن أبي أمية، قال سمعت بسر بن أبي أرطاة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Junadah bin Abi Umayyah said:                     \"I heard Busr bin Abi Artah say: 'I heard the Messenger of Allah say: Hand should not be cut off while traveling.\"'",
      "chain": [
        "10581",
        "20644",
        "20629",
        "26010",
        "10871",
        "3205"
      ]
    },
    {
      "hadith_no": "5297",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن عثمان، عن بقية، حدثني الزبيدي، عن الزهري، عن أنس بن مالك، أنه حدثني أنه، رأى على أم كلثوم بنت رسول الله صلى الله عليه وسلم برد سيراء والسيراء المضلع بالقز ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     He saw Umm Kalthum, the daughter of the Messenger of Allah [SAW], wearing a Burdah of Sira' silk, and Sira' is a fabric with stripes of silk.",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "5433",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، قال حدثنا بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن عقبة بن عامر، قال أهديت للنبي صلى الله عليه وسلم بغلة شهباء فركبها وأخذ عقبة يقودها به فقال رسول الله صلى الله عليه وسلم لعقبة ‏\"‏ اقرأ ‏\"‏ ‏.‏ قال وما أقرأ يا رسول الله قال ‏\"‏ اقرأ ‏{‏ قل أعوذ برب الفلق * من شر ما خلق ‏}‏ ‏\"‏ ‏.‏ فأعادها على حتى قرأتها فعرف أني لم أفرح بها جدا قال ‏\"‏ لعلك تهاونت بها ‏\"‏ ‏.‏ فما قمت يعني بمثلها ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"The Prophet [SAW] was given a gray mule which he rode, and 'Uqbah led it. The Messenger of Allah [SAW] said to 'Uqbah: 'Recite.' He said: 'What should I recite, O Messenger of Allah?' He said: 'Recite: 'Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created.' And he repeated it until I had learned it.\"",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "5471",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثنا ضبارة، عن دويد بن نافع، قال قال أبو صالح قال أبو هريرة إن رسول الله صلى الله عليه وسلم كان يدعو ‏\"‏ اللهم إني أعوذ بك من الشقاق والنفاق وسوء الأخلاق ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] used to say in his supplication: 'Allahumma inni a'udhu bika minash-shiqaqi wan-nifaqi, wa suw'il-akhlaq (O Allah, I seek refuge with You from opposing the truth, hypocrisy and bad manners.)'\"",
      "chain": [
        "10581",
        "20644",
        "16029",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "5472",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بقية، قال حدثني أبو سلمة، سليمان بن سليم الحمصي قال حدثني الزهري، عن عروة، - هو ابن الزبير - عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يكثر التعوذ من المغرم والمأثم فقيل له يا رسول الله إنك تكثر التعوذ من المغرم والمأثم فقال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] often used to seek refuge (with Allah) from debt and sin. It was said to him: 'O Messenger of Allah! You often seek refuge from debt and sin?' He said: 'If a man gets into debt, he speaks and lies, and he makes a promise and breaks it.'\"",
      "chain": [
        "30123",
        "20644",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5670",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، قال حدثنا الأوزاعي، قال حدثني ربيعة بن يزيد، ح وأخبرني عمرو بن عثمان بن سعيد، عن بقية، عن أبي عمرو، - وهو الأوزاعي - عن ربيعة بن يزيد، عن عبد الله بن الديلمي، قال دخلت على عبد الله بن عمرو بن العاص وهو في حائط له بالطائف يقال له الوهط وهو مخاصر فتى من قريش يزن ذلك الفتى بشرب الخمر فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شرب الخمر شربة لم تقبل له توبة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم تقبل توبته أربعين صباحا فإن تاب تاب الله عليه فإن عاد كان حقا على الله أن يسقيه من طينة الخبال يوم القيامة ‏\"‏ ‏.‏ اللفظ لعمرو ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ad-Dailami said:                     \"I entered upon 'Abdullah bin 'Amr bin Al-'As when he was in a garden of his in At-Ta'if called Al-Waht. He was walking and holding hands with a young man of Quraish who was suspected of drinking Khamr. He said: 'I heard the Messenger of Allah [SAW] say: Whoever drinks Khamr once, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again (a fourth time), then it is a right upon Allah to make him drink from the mud of Khibal on the Day of Resurrection.\" This is the wording of 'Amr.",
      "chain": [
        "30475",
        "20389",
        "11049",
        "20024",
        "11414",
        "10581",
        "20644",
        "11414",
        "5136"
      ]
    },
    {
      "hadith_no": "5735",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية، قال حدثني الأوزاعي، عن يحيى بن أبي عمرو، عن عبد الله بن الديلمي، عن أبيه، فيروز قال قدمت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا أصحاب كرم وقد أنزل الله عز وجل تحريم الخمر فماذا نصنع قال ‏\"‏ تتخذونه زبيبا ‏\"‏ ‏.‏ قلت فنصنع بالزبيب ماذا قال ‏\"‏ تنقعونه على غدائكم وتشربونه على عشائكم وتنقعونه على عشائكم وتشربونه على غدائكم ‏\"‏ ‏.‏ قلت أفلا نؤخره حتى يشتد قال ‏\"‏ لا تجعلوه في القلل واجعلوه في الشنان فإنه إن تأخر صار خلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah Ad-Dailami that his father Fairuz said:                     \"I came to the Messenger of Allah [SAW] and said: 'O Messenger of Allah, we have grapevines and Allah, the Mighty and Sublime, has revealed that Khamr (wine) is forbidden, so what should we do?' He said: 'Make raisins.' I said: 'What should we do with the raisins?' He said: 'Soak them in the morning and drink them in the evening, and soak them in the evening and drink them in the morning.' I said: 'Can we leave it until it gets stronger?' He said: 'Do not put it in clay vessels, rather put it in skins, for if it stays there for a long time, it will turn into vinegar.'\"",
      "chain": [
        "38429",
        "20644",
        "20024",
        "5136"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن الأوزاعي، عن ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن مجوس هذه الأمة المكذبون بأقدار الله إن مرضوا فلا تعودوهم وإن ماتوا فلا تشهدوهم وإن لقيتموهم فلا تسلموا عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'The Magicians of this Ummah are those who deny the decrees of Allah. If they fall sick, do not visit them; if they die, do not attend their funerals; and if you meet them, do not greet them with Salam.'\"",
      "chain": [
        "20644",
        "20024",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "459",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن محمد بن الفضل، عن أبيه، عن سالم، عن ابن عمر، قال رأى رسول الله  صلى الله عليه وسلم  رجلا يتوضأ فقال ‏\"‏ لا تسرف لا تسرف ‏\"‏ ‏.‏",
      "text_en": " It is narrated that Ibn 'Umar said:                     \"The Messenger of Allah saw a man performing ablution, and he said: 'Do not be extravagant, do not be extravagant (in using water).'\" (Maudu')",
      "chain": [
        "20644",
        "20283",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "515",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن الوضين بن عطاء، عن محفوظ بن علقمة، عن عبد الرحمن بن عائذ الأزدي، عن علي بن أبي طالب، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ العين وكاء السه فمن نام فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abu Talib that:                     The Messenger of Allah said: \"The eye is the leather strap (that ties up) the anus, so whoever falls asleep, let him perform ablution.\"",
      "chain": [
        "20644",
        "17548",
        "18970",
        "19925",
        "5"
      ]
    },
    {
      "hadith_no": "536",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن عبد ربه، حدثنا بقية، عن خالد بن يزيد بن عمر بن هبيرة الفزاري، عن عطاء بن السائب، قال سمعت محارب بن دثار، يقول سمعت عبد الله بن عمر، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ توضئوا من لحوم الإبل ولا توضئوا من لحوم الغنم وتوضئوا من ألبان الإبل ولا توضئوا من ألبان الغنم وصلوا في مرابض الغنم ولا تصلوا في معاطن الإبل ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr said:                     \"I heard the Messenger of Allah say: 'Perform ablution after (eating) camel meat, but do not perform ablution after (eating) mutton. Perform ablution after (drinking) camel's milk, but do not perform ablution after (drinking) sheep's milk. Perform prayer in the sheep pens but not do in the camels' Ma'atin.'\"",
      "chain": [
        "11222",
        "30572",
        "20644",
        "11408",
        "11068",
        "11389",
        "18"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، قال حدثنا بقية، عن جرير بن يزيد، قال حدثني منذر، حدثني محمد بن المنكدر، عن جابر، قال مر رسول الله  صلى الله عليه وسلم  برجل يتوضأ ويغسل خفيه فقال بيده كأنه دفعه ‏\"‏ إنما أمرت بالمسح ‏\"‏ ‏.‏ وقال رسول الله  صلى الله عليه وسلم  بيده هكذا من أطراف الأصابع إلى أصل الساق وخطط بالأصابع ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah passed by a man who was performing ablution and washing his leather socks. He gestures with his hand, (and said): 'Rather I have been commanded to wipe them.' The Messenger of Allah gestured with his hand like this, from the tips of the toes to the base of the shin, tracing lines with his fingers.\"",
      "chain": [
        "20644",
        "28079",
        "11398",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "662",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن حبيب بن صالح، عن أبي حى المؤذن، عن ثوبان، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ لا يقوم أحد من المسلمين وهو حاقن حتى يتخفف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that:                     The Messenger of Allah said: \"No one among the Muslims should stand to pray when he is suppressing (the need to urinate or defecate), until he has to relieve himself.\"",
      "chain": [
        "20644",
        "28090",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "712",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن مروان بن سالم، عن عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خصلتان معلقتان في أعناق المؤذنين للمسلمين صلاتهم وصيامهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: There are two characteristics in which the Muslims are dependent upon their Mu'adh-dhins: their prayer and their fasting.\"",
      "chain": [
        "20644",
        "28558",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن حبيب بن صالح، عن يزيد بن شريح، عن أبي حى المؤذن، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يؤم عبد فيخص نفسه بدعوة دونهم فإن فعل فقد خانهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban said:                      “The Messenger of Allah (ﷺ)said: ‘Noperson should lead others in prayer, then supplicate onlyfor himselfand not for them. If he does that, he has betrayed them.’”",
      "chain": [
        "20644",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "1177",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا بقية بن الوليد، حدثنا يونس بن يزيد الأيلي، عن الزهري، عن سالم، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أدرك ركعة من صلاة الجمعة أو غيرها فقد أدرك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)said:‘Whoever catches one Rak’ah of Friday prayer or other than it,then he has caught the prayer.’”",
      "chain": [
        "10581",
        "20644",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1183",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن عبد ربه، حدثنا بقية، عن مبشر بن عبيد، عن حجاج بن أرطاة، عن عطية العوفي، عن ابن عباس، قال كان النبي  صلى الله عليه وسلم  يركع من قبل الجمعة أربعا لا يفصل في شىء منهن ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Prophet (ﷺ) used toperformfour Rak’ah before Friday (prayer), and he did not separateany ofthem.”",
      "chain": [
        "11222",
        "30572",
        "20644",
        "20580",
        "15373",
        "17"
      ]
    },
    {
      "hadith_no": "1188",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن عبد الله بن واقد، عن محمد بن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله  صلى الله عليه وسلم  عن الاحتباء يوم الجمعة - يعني - والإمام يخطب ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “The Messenger of Allah (ﷺ) forbade Ihtiba’onFridays, meaning, when the Imam is delivering the sermon.”",
      "chain": [
        "20644",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1371",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، حدثنا شعبة، حدثني مغيرة الضبي، عن عبد العزيز بن رفيع، عن أبي صالح، عن ابن عباس، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ اجتمع عيدان في يومكم هذا فمن شاء أجزأه من الجمعة وإنا مجمعون إن شاء الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Two ‘Eid have come together on this day of yours. So whoeverwants, that (the ‘Eid prayer) will suffice him, and he will nothaveto pray Friday, but we will pray Friday if Allah wills.”",
      "chain": [
        "20644",
        "20020",
        "11257",
        "11161",
        "17"
      ]
    },
    {
      "hadith_no": "1372",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن عبد ربه، حدثنا بقية، حدثنا شعبة، عن مغيرة الضبي، عن عبد العزيز بن رفيع، عن أبي صالح، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "11222",
        "30572",
        "20644",
        "20020",
        "11257",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1467",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا بقية بن الوليد، حدثنا ضبارة بن عبد الله بن أبي السليل، أخبرني دويد بن نافع، عن الزهري، قال قال سعيد بن المسيب إن أبا قتادة بن ربعي أخبره أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ قال الله عز وجل افترضت على أمتك خمس صلوات وعهدت عندي عهدا أنه من حافظ عليهن لوقتهن أدخلته الجنة ومن لم يحافظ عليهن فلا عهد له عندي ‏\"‏ ‏.‏",
      "text_en": " Sa’eedbin Musayyab said that Abu Qatadah bin Rib’i told him that theMessenger of Allah (ﷺ) said:                      “Allah said: ‘I have enjoined onyournation five prayers, and I have made a covenant with Myself thatwhoever maintains them, I will admit them to Paradise, and whoeverdoes not maintain them, has no such covenant with Me.’”",
      "chain": [
        "38705",
        "20644",
        "16029",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "1495",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا بقية، عن أبي عبد الرحمن التميمي، عن عثمان بن عطاء، عن أبيه، عن المغيرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "38462",
        "20644",
        "11359",
        "3690",
        "166"
      ]
    },
    {
      "hadith_no": "1528",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن مبشر بن عبيد، عن زيد بن أسلم، عن عبد الله بن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليغسل موتاكم المأمونون ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar that the Messenger of Allah(ﷺ) said:                      ‘Let the honest wash your dead.”",
      "chain": [
        "20644",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "1547",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا بقية بن الوليد، عن أبي بكر بن أبي مريم، عن راشد بن سعد، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  قال رأى رسول الله  صلى الله عليه وسلم  ناسا ركبانا على دوابهم في جنازة فقال ‏\"‏ ألا تستحيون أن ملائكة الله يمشون على أقدامهم وأنتم ركبان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban, the freed slave of the Messenger ofAllah(ﷺ), said:                      “The Messenger of Allah (ﷺ) saw some peopleridingon their animals in a funeral (procession). He said: ‘Do younotfeel ashamed that the angels of Allah are walking on foot and youareriding?’”",
      "chain": [
        "38462",
        "20644",
        "27053",
        "19909"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو التقي، هشام بن عبد الملك الحمصي حدثنا بقية، حدثنا الزبيدي، عن هشام بن عروة، عن أبيه، عن عائشة، قالت اكتحل رسول الله  صلى الله عليه وسلم  وهو صائم ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)appliedkohl to his eyes while he was fasting.”",
      "chain": [
        "20644",
        "20459",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1786",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا بقية، حدثنا صدقة بن خالد، حدثنا يحيى بن الحارث الذماري، قال سمعت أبا أسماء الرحبي، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ من صام ستة أيام بعد الفطر كان تمام السنة ‏{من جاء بالحسنة فله عشر أمثالها}‏ ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban, the freed slave of the Messenger ofAllah(ﷺ), that the Messenger of Allah (ﷺ) said:                      “Whoever fastssixdays after the Fitr will have completed the year, for whoever doesagood deed will have the reward of ten like it.”",
      "chain": [
        "30288",
        "20644",
        "20398",
        "19894",
        "10883"
      ]
    },
    {
      "hadith_no": "1821",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، حدثنا محمد بن عبد الرحمن، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  لبلال ‏\"‏ الغداء يا بلال ‏\"‏ ‏.‏ فقال إني صائم ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نأكل أرزاقنا وفضل رزق بلال في الجنة أشعرت يا بلال أن الصائم تسبح عظامه وتستغفر له الملائكة ما أكل عنده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin Buraidah that his father said:                      “TheMessenger of Allah (ﷺ) said to Bilal: ‘Come and eat, O Bilal.’Hesaid: ‘I am fasting.’ The Messenger of Allah (ﷺ) said: ‘Weareeating our provision, but most of Bilal’s provision is inParadise. Doyou realise, O Bilal, that the bones of the fastingperson glorifyAllah and the angels pray for forgiveness for him solong as food iseaten in front of him?’”",
      "chain": [
        "20644",
        "11105",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1854",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو أحمد المرار بن حمويه، حدثنا محمد بن المصفى، حدثنا بقية بن الوليد، عن ثور بن يزيد، عن خالد بن معدان، عن أبي أمامة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من قام ليلتى العيدين لله محتسبا لم يمت قلبه يوم تموت القلوب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Umamah that the Prophet (ﷺ) said:                      “Whoeverspends the nights of the two ‘Eid in praying voluntary prayers,seeking reward from Allah, his heart will not die on the Day whenhearts will die.”",
      "chain": [
        "20644",
        "20415",
        "11422",
        "405"
      ]
    },
    {
      "hadith_no": "2177",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا بقية، عن عبد الله بن محرر، عن قتادة، عن أنس، قال سمع النبي  صلى الله عليه وسلم  رجلا يقول أنا إذا ليهودي ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ وجبت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Messenger of Allah (ﷺ) heard a man say:                     \"If that happens, I will be a Jew.\" The Messenger of Allah (ﷺ) said: 'That is guaranteed.\"",
      "chain": [
        "30288",
        "20644",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2317",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب، عن أبي أيوب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كيلوا طعامكم يبارك لكم فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Ayyub that the Prophet (ﷺ) said:                     \"Measure your food, may you be blessed therein.\"",
      "chain": [
        "10581",
        "20644",
        "11422",
        "33"
      ]
    },
    {
      "hadith_no": "2332",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا بقية بن الوليد، عن معاوية بن يحيى، عن مكحول، وسليمان بن موسى، عن واثلة بن الأسقع، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من باع عيبا لم يبينه لم يزل في مقت من الله ولم تزل الملائكة تلعنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Wathilah bin Asqa' said:                     \"I heard the Messenger of Allah (ﷺ) say: 'Whoever sells defective goods without pointing it out, he will remain subject to the wrath of Allah, and the angels will continue to curse him.'\"",
      "chain": [
        "38361",
        "20644",
        "11066",
        "10880",
        "4049"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن مسلمة بن على، عن سعيد بن أبي أيوب، عن الحارث بن يزيد، عن على بن رباح، قال سمعت عتبة بن الندر، يقول كنا عند رسول الله صلى الله عليه وسلم فقرأ طسم حتى إذا بلغ قصة موسى قال ‏\"‏ إن موسى صلى الله عليه وسلم أجر نفسه ثماني سنين أو عشرا على عفة فرجه وطعام بطنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali bin Rabah said:                     “I heard 'Utbah bin Nuddar say: 'We were with the Messenger of Allah (ﷺ) and he recited Ta-Sin. When he reached the story of Musa, he said: 'Musa (A.S) hired himself out for eight years, or ten, in return for his chastity and food in his stomach.' ”",
      "chain": [
        "20644",
        "20375"
      ]
    },
    {
      "hadith_no": "2805",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن يزيد بن عوف، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات على وصية مات على سبيل وسنة ومات على تقى وشهادة ومات مغفورا له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that the Messenger of Allah (ﷺ) said:                     “Whoever dies leaving a will, he dies on the right path and Sunnah, and he dies with piety and witness, and he dies forgiven.”",
      "chain": [
        "20644",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2809",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا بقية، عن أبي حلبس، عن خليد بن أبي خليد، عن معاوية بن قرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حضرته الوفاة فأوصى وكانت وصيته على كتاب الله كانت كفارة لما ترك من زكاته في حياته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Qurrah, from his father that the Messenger of Allah (ﷺ) said:                     “Whoever makes a will as death approaches, and his will is in accordance with the book of Allah (SWT) it will be an expiation for whatever he did not pay of his Zakah during his lifetime.”",
      "chain": [
        "38705",
        "20644",
        "18260",
        "11306",
        "5238"
      ]
    },
    {
      "hadith_no": "2882",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا بقية، عن معاوية بن يحيى، عن ليث بن أبي سليم، عن يحيى بن عباد، عن أم الدرداء، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غزوة في البحر مثل عشر غزوات في البر والذي يسدر في البحر كالمتشحط في دمه في سبيل الله سبحانه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                      “Amilitary expedition by sea is like ten expeditions by land.The onewho suffers from seasickness is like one who gets drenched inhis ownblood in the cause of Allah.”",
      "chain": [
        "30288",
        "20644",
        "10957",
        "10840",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3319",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، حدثني ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، قال نهى رسول الله  صلى الله عليه وسلم  عن لحوم الخيل والبغال والحمير ‏.‏",
      "text_en": " It wasnarrated that Khalid bin Walid said:                      “The Messenger of Allah(ﷺ)forbade the flesh of horses, mules and donkeys.”",
      "chain": [
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "3473",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، - وكان يعد من الأبدال - حدثنا بقية، حدثنا يوسف بن أبي كثير، عن نوح بن ذكوان، عن الحسن، عن أنس بن مالك، قال لبس رسول الله  صلى الله عليه وسلم  الصوف واحتذى المخصوف ‏.‏ وقال أكل رسول الله  صلى الله عليه وسلم  بشعا ولبس خشنا ‏.‏ فقيل للحسن ما البشع قال غليظ الشعير ما كان يسيغه إلا بجرعة ماء ‏.‏",
      "text_en": " It wasnarrated from Hasan that Anas bin Malik said:                      “The Messenger ofAllah (ﷺ) wore wool, and his shows were sandals.”",
      "chain": [
        "38705",
        "20644",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "3477",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا هشام بن عمار، وسويد بن سعيد، ويحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، قالوا حدثنا بقية بن الوليد، حدثنا يوسف بن أبي كثير، عن نوح بن ذكوان، عن الحسن، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من السرف أن تأكل كل ما اشتهيت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “It is extravagance to eat everything you want.”",
      "chain": [
        "30288",
        "30547",
        "38705",
        "20644",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "3557",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن مسلم بن عبد الله، عن زياد بن عبد الله، عن عاصم بن محمد بن زيد بن عبد الله بن عمر، عن أبيه، عن جده، قال نهانا رسول الله  صلى الله عليه وسلم  أن نشرب على بطوننا وهو الكرع ونهانا أن نغترف باليد الواحدة وقال ‏\"‏ لا يلغ أحدكم كما يلغ الكلب ولا يشرب باليد الواحدة كما يشرب القوم الذين سخط الله عليهم ولا يشرب بالليل من إناء حتى يحركه إلا أن يكون إناء مخمرا ومن شرب بيده وهو يقدر على إناء يريد التواضع كتب الله له بعدد أصابعه حسنات وهو إناء عيسى ابن مريم عليهما السلام إذ طرح القدح فقال أف هذا مع الدنيا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Asim bin Muhammad bin Zaid bin ‘Abdullah, fromhisfather, that his grandfather said:                      “The Messenger of Allah (ﷺ)forbade us to drink while (lying) on our bellies, lapping up water,and he forbade us to drink from one hand only. He said: ‘None ofyoushould lap up water as a dog does, and he should not drink waterfromone hand as the people with whom Allah is angry do, and heshould notdrink from a vessel at night without stirring it first,unless thevessel was covered. Whoever drinks from his hand when heis able todrink from a vessel, with the intention of humility, Allahwill recordgood deeds equivalent to the number of fingers for him.It (i.e., thehand) is the vessel of ‘Eisa bin Maryam, (as) when hethrew away thecup and said: ‘Ugh! That belongs to this world.’”",
      "chain": [
        "20644",
        "20163",
        "11217"
      ]
    },
    {
      "hadith_no": "3675",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا بقية، حدثنا أبو بكر العنسي، عن يزيد بن أبي حبيب، ومحمد بن يزيد المصريين، قالا حدثنا نافع، عن ابن عمر، قال قالت أم سلمة يا رسول الله لا يزال يصيبك كل عام وجع من الشاة المسمومة التي أكلت ‏.‏ قال ‏\"‏ ما أصابني شىء منها إلا وهو مكتوب على وآدم في طينته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that Umm Salamah said:                      “O Messenger ofAllah, every year you are still suffering pain because of thepoisonedmeat that you ate.” He said: “Nothing that happens tome, but it wasdecreed for me when Adam was still at the stage ofbeing clay.’”",
      "chain": [
        "38705",
        "20644",
        "11411",
        "34204",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3685",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا بقية بن الوليد، عن يوسف بن أبي كثير، عن نوح بن ذكوان، عن الحسن، عن أنس، قال لبس رسول الله  صلى الله عليه وسلم  الصوف واحتذى المخصوف ولبس ثوبا خشنا خشنا ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “The Messenger of Allah (ﷺ) worewooland sandals, and he wore coarse, rough garments.”",
      "chain": [
        "38705",
        "20644",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا بقية، أنبأنا أبو أحمد الدمشقي، عن أبي الزبير، عن جابر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تربوا صحفكم أنجح لها إن التراب مبارك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that the Messenger of Allah(ﷺ) said:                     \"Put dust on your writings, because it is better, and dust is blessed (being humble in correspondence brings good results).\"",
      "chain": [
        "30201",
        "20472",
        "20644",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4232",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا بقية، عن بحير بن سعد، عن خالد بن أبي بلال، عن عبد الله بن بسر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بين الملحمة وفتح المدينة ست سنين ويخرج الدجال في السابعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Busr that the Messenger of Allah(ﷺ) said:                      \"Between the fierce battle and the conquest ofAl-Madinahwill be six years, and the appearance of Dajjal will comein theseventh.'\"",
      "chain": [
        "30547",
        "20644",
        "3650"
      ]
    }
  ],
  "total_hadiths": 138
}