{
  "id": "20656",
  "name": "Shayban bin Farroukh شيبان بن فروخ / أبي شيبة",
  "full_name": "Shayban bin Farroukh شيبان بن فروخ / أبي شيبة",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": [
        "140 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "235",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  د  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "Client",
      "al-Habti",
      "al-Ayli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11273",
      "name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20205",
      "name": "Aban bin Yazid al-Attar",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20237",
      "name": "Salam bin Mskyn bin Rabi'ya سلام بن مسكين بن ربيعة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20236",
      "name": "Sulaiman bin al-Mughira al-Qaysy سليمان بن المغيرة القيسي مولاهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20552",
      "name": "al-S'q bin Hzn الصعق بن حزن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20253",
      "name": "'Abdul 'Aziz bin Muslim al-Qasimali عبد العزيز بن مسلم القسملي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30167",
      "name": "Muhammad bin al-Salt al-Basri محمد بن الصلت البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - قال حدثنا ثابت، عن أنس بن مالك، قال حدثني محمود بن الربيع، عن عتبان بن مالك، قال قدمت المدينة فلقيت عتبان فقلت حديث بلغني عنك قال أصابني في بصري بعض الشىء فبعثت إلى رسول الله صلى الله عليه وسلم أني أحب أن تأتيني فتصلي في منزلي فأتخذه مصلى - قال - فأتى النبي صلى الله عليه وسلم ومن شاء الله من أصحابه فدخل وهو يصلي في منزلي وأصحابه يتحدثون بينهم ثم أسندوا عظم ذلك وكبره إلى مالك بن دخشم قالوا ودوا أنه دعا عليه فهلك وودوا أنه أصابه شر ‏.‏ فقضى رسول الله صلى الله عليه وسلم الصلاة وقال ‏\"‏ أليس يشهد أن لا إله إلا الله وأني رسول الله ‏\"‏ ‏.‏ قالوا إنه يقول ذلك وما هو في قلبه ‏.‏ قال ‏\"‏ لا يشهد أحد أن لا إله إلا الله وأني رسول الله فيدخل النار أو تطعمه ‏\"‏ ‏.‏ قال أنس فأعجبني هذا الحديث فقلت لابني اكتبه فكتبه ‏.‏",
      "text_en": " It is narrated on the authority of 'Itban b. Malik that he came to Medina and said:                      Something had gone wrong with my eyesight. I, therefore, sent (a message to the Holy Prophet): Verily it is my ardent desire that you should kindly grace my house with your presence and observe prayer there so, that I should make that corner a place of worship. He said: The Prophet (may peace be upon him) came there, and those amongst the Companions whom Allah willed also accompanied him. He entered (my place) and offered prayer at my residence and his Companions began to talk amongst themselves (and this conversation centered round hypocrites), and then the conspicuous one, Malik b. Dukhshum was made the target and they wished that he (the Holy Prophet) should curse him and he should die or he should meet some calamity. In the meanwhile the Messenger of Allah (may peace and blessings be upon him) completed his prayer and said: Does Malik b. Dukhshum not testify the fact that there is no god but Allah and verily I am the messenger of Allah. They replied: He makes a profession of it (no doubt) but does not do it out of (sincere) heart. He (the Holy Prophet) said: He who testifies that there is no god but Allah and I am the messenger of Allah would not enter Hell or its (flames) would not consume him. Anas said: This hadith impressed me very much and I told my son to write it down.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "19",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني شيبان بن فروخ، وعبد الله بن محمد بن أسماء الضبعي، قالا حدثنا مهدي، - وهو ابن ميمون - حدثنا واصل الأحدب، عن أبي وائل، عن حذيفة، أنه بلغه أن رجلا، ينم الحديث فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة نمام ‏\"‏ ‏.‏",
      "text_en": " It is reported from Hudhaifa that news reached him (the Holy Prophet) that a certain man carried tales. Upon this Hudhaifa remarked:                      I heard Allah's Messenger (may peace be upon him) saying: The tale-bearer shall not enter Paradise.",
      "chain": [
        "20656",
        "11307",
        "11401",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "355",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن الجعد أبي عثمان، حدثنا أبو رجاء العطاردي، عن ابن عباس، عن رسول الله صلى الله عليه وسلم فيما يروي عن ربه تبارك وتعالى قال ‏\"‏ إن الله كتب الحسنات والسيئات ثم بين ذلك فمن هم بحسنة فلم يعملها كتبها الله عنده حسنة كاملة وإن هم بها فعملها كتبها الله عز وجل عنده عشر حسنات إلى سبعمائة ضعف إلى أضعاف كثيرة وإن هم بسيئة فلم يعملها كتبها الله عنده حسنة كاملة وإن هم بها فعملها كتبها الله سيئة واحدة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abbas that the Messenger of Allah (may peace be upon him) transmitted it from the Blessed and Great Lord:                      Verily Allah recorded the good and the evil and then made it clear that he who intended good but did not do it, Allah recorded one complete good in his favour, but if he intended it and also did it, the Glorious and Great Allah recorded ten to seven hundred virtues and even more to his credit. But it he intended evil, but did not commit it, Allah wrote down full one good in his favour. If he intended that and also committed it, Allah made an entry of one evil against him.",
      "chain": [
        "20656",
        "20258",
        "11580",
        "11440",
        "17"
      ]
    },
    {
      "hadith_no": "380",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن الحسن، قال عاد عبيد الله بن زياد معقل بن يسار المزني في مرضه الذي مات فيه ‏.‏ قال معقل إني محدثك حديثا سمعته من رسول الله صلى الله عليه وسلم لو علمت أن لي حياة ما حدثتك إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يسترعيه الله رعية يموت يوم يموت وهو غاش لرعيته إلا حرم الله عليه الجنة ‏\"‏ ‏.‏",
      "text_en": " Hasan reported:                      'Ubaidullah b. Ziyad paid a visit to Ma'qil b. Yasar Muzani in his illness of which he (later on) died. (At this juncture) Ma'qil said: I am going to narrate to you a hadith which I have heard from the Messenger of Allah (may peace be upon him) and which I would not have transmitted if I knew that I would survive. Verily I have heard the Messenger of Allah (may peace be upon him) say: There is none amongst the bondsmen who was entrusted with the affairs of his subjects and he died in such a state that he was dishonest in his dealings with those over whom he ruled that the Paradise is not forbidden for him.",
      "chain": [
        "20656",
        "11273",
        "11016"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، حدثنا ثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتيت بالبراق - وهو دابة أبيض طويل فوق الحمار ودون البغل يضع حافره عند منتهى طرفه - قال فركبته حتى أتيت بيت المقدس - قال - فربطته بالحلقة التي يربط به الأنبياء - قال - ثم دخلت المسجد فصليت فيه ركعتين ثم خرجت فجاءني جبريل - عليه السلام - بإناء من خمر وإناء من لبن فاخترت اللبن فقال جبريل صلى الله عليه وسلم اخترت الفطرة ‏.‏ ثم عرج بنا إلى السماء فاستفتح جبريل فقيل من أنت قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بآدم فرحب بي ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء الثانية فاستفتح جبريل عليه السلام ‏.‏ فقيل من أنت قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بابنى الخالة عيسى ابن مريم ويحيى بن زكرياء صلوات الله عليهما فرحبا ودعوا لي بخير ‏.‏ ثم عرج بي إلى السماء الثالثة فاستفتح جبريل ‏.‏ فقيل من أنت قال جبريل ‏.‏ قيل ومن معك قال محمد صلى الله عليه وسلم ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بيوسف صلى الله عليه وسلم إذا هو قد أعطي شطر الحسن فرحب ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء الرابعة فاستفتح جبريل - عليه السلام - قيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قال وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بإدريس فرحب ودعا لي بخير قال الله عز وجل ‏{‏ ورفعناه مكانا عليا‏}‏ ثم عرج بنا إلى السماء الخامسة فاستفتح جبريل ‏.‏ قيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بهارون صلى الله عليه وسلم فرحب ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء السادسة فاستفتح جبريل عليه السلام ‏.‏ قيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بموسى صلى الله عليه وسلم فرحب ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء السابعة فاستفتح جبريل فقيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد صلى الله عليه وسلم ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بإبراهيم صلى الله عليه وسلم مسندا ظهره إلى البيت المعمور وإذا هو يدخله كل يوم سبعون ألف ملك لا يعودون إليه ثم ذهب بي إلى السدرة المنتهى وإذا ورقها كآذان الفيلة وإذا ثمرها كالقلال - قال - فلما غشيها من أمر الله ما غشي تغيرت فما أحد من خلق الله يستطيع أن ينعتها من حسنها ‏.‏ فأوحى الله إلى ما أوحى ففرض على خمسين صلاة في كل يوم وليلة فنزلت إلى موسى صلى الله عليه وسلم فقال ما فرض ربك على أمتك قلت خمسين صلاة ‏.‏ قال ارجع إلى ربك فاسأله التخفيف فإن أمتك لا يطيقون ذلك فإني قد بلوت بني إسرائيل وخبرتهم ‏.‏ قال فرجعت إلى ربي فقلت يا رب خفف على أمتي ‏.‏ فحط عني خمسا فرجعت إلى موسى فقلت حط عني خمسا ‏.‏ قال إن أمتك لا يطيقون ذلك فارجع إلى ربك فاسأله التخفيف ‏.‏ - قال - فلم أزل أرجع بين ربي تبارك وتعالى وبين موسى - عليه السلام - حتى قال يا محمد إنهن خمس صلوات كل يوم وليلة لكل صلاة عشر فذلك خمسون صلاة ‏.‏ ومن هم بحسنة فلم يعملها كتبت له حسنة فإن عملها كتبت له عشرا ومن هم بسيئة فلم يعملها لم تكتب شيئا فإن عملها كتبت سيئة واحدة - قال - فنزلت حتى انتهيت إلى موسى صلى الله عليه وسلم فأخبرته فقال ارجع إلى ربك فاسأله التخفيف ‏.‏ فقال رسول الله صلى الله عليه وسلم فقلت قد رجعت إلى ربي حتى استحييت منه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said:                      I was brought al-Buraq Who is an animal white and long, larger than a donkey but smaller than a mule, who would place his hoof a distance equal to the range of version. I mounted it and came to the Temple (Bait Maqdis in Jerusalem), then tethered it to the ring used by the prophets. I entered the mosque and prayed two rak'ahs in it, and then came out and Gabriel brought me a vessel of wine and a vessel of milk. I chose the milk, and Gabriel said: You have chosen the natural thing. Then he took me to heaven. Gabriel then asked the (gate of heaven) to be opened and he was asked who he was. He replied: Gabriel. He was again asked: Who is with you? He (Gabriel) said: Muhammad. It was said: Has he been sent for? Gabriel replied: He has indeed been sent for. And (the door of the heaven) was opened for us and lo! we saw Adam. He welcomed me and prayed for my good. Then we ascended to the second heaven. Gabriel (peace be upon him) (asked the door of heaven to be opened), and he was asked who he was. He answered: Gabriel; and was again asked: Who is with you? He replied: Muhammad. It was said: Has he been sent for? He replied: He has indeed been sent for. The gate was opened. When I entered 'Isa b. Maryam and Yahya b. Zakariya (peace be upon both of them), cousins from the maternal side. welcomed me and prayed for my good Then I was taken to the third heaven and Gabriel asked for the opening (of the door). He was asked: Who are you? He replied: Gabriel. He was (again) asked: Who is with you? He replied Muhammad (may peace be upon him). It was said: Has he been sent for? He replied He has indeed been sent for. (The gate) was opened for us and I saw Yusuf (peace of Allah be upon him) who had been given half of (world) beauty. He welcomed me prayed for my well-being. Then he ascended with us to the fourth heaven. Gabriel (peace be upon him) asked for the (gate) to be opened, and it was said: Who is he? He replied: Gabriel. It was (again) said: Who is with you? He said: Muhammad. It was said: Has he been sent for? He replied: He has indeed been sent for. The (gate) was opened for us, and lo! Idris was there. He welcomed me and prayed for my well-being (About him) Allah, the Exalted and the Glorious, has said:\" We elevated him (Idris) to the exalted position\" (Qur'an xix. 57). Then he ascended with us to the fifth heaven and Gabriel asked for the (gate) to be opened. It was said: Who is he? He replied Gabriel. It was (again) said: Who is with thee? He replied: Muhammad. It was said Has he been sent for? He replied: He has indeed been sent for. (The gate) was opened for us and then I was with Harun (Aaron-peace of Allah be upon him). He welcomed me prayed for my well-being. Then I was taken to the sixth heaven. Gabriel (peace be upon him) asked for the door to be opened. It was said: Who is he? He replied: Gabriel. It was said: Who is with thee? He replied: Muhammad. It was said: Has he been sent for? He replied: He has indeed been sent for. (The gate) was opened for us and there I was with Musa (Moses peace be upon him) He welcomed me and prayed for my well-being. Then I was taken up to the seventh heaven. Gabriel asked the (gate) to be opened. It was said: Who is he? He said: Gabriel It was said. Who is with thee? He replied: Muhammad (may peace be upon him.) It was said: Has he been sent for? He replied: He has indeed been sent for. (The gate) was opened for us and there I found Ibrahim (Abraham peace be upon him) reclining against the Bait-ul-Ma'mur and there enter into it seventy thousand angels every day, never to visit (this place) again. Then I was taken to Sidrat-ul-Muntaha whose leaves were like elephant ears and its fruit like big earthenware vessels. And when it was covered by the Command of Allah, it underwent such a change that none amongst the creation has the power to praise its beauty. Then Allah revealed to me a revelation and He made obligatory for me fifty prayers every day and night. Then I went down to Moses (peace be upon him) and he said: What has your Lord enjoined upon your Ummah? I said: Fifty prayers. He said: Return to thy Lord and beg for reduction (in the number of prayers), for your community shallnot be able to bear this burden. as I have put to test the children of Isra'il and tried them (and found them too weak to bear such a heavy burden). He (the Holy Prophet) said: I went back to my Lord and said: My Lord, make things lighter for my Ummah. (The Lord) reduced five prayers for me. I went down to Moses and said. (The Lord) reduced five (prayers) for me, He said: Verily thy Ummah shall not be able to bear this burden; return to thy Lord and ask Him to make things lighter. I then kept going back and forth between my Lord Blessed and Exalted and Moses, till He said: There are five prayers every day and night. O Muhammad, each being credited as ten, so that makes fifty prayers. He who intends to do a good deed and does not do it will have a good deed recorded for him; and if he does it, it will be recorded for him as ten; whereas he who intends to do an evil deed and does not do, it will not be recorded for him; and if he does it, only one evil deed will be recorded. I then came down and when I came to Moses and informed him, he said: Go back to thy Lord and ask Him to make things lighter. Upon this the Messenger of Allah remarked: I returned to my Lord until I felt ashamed before Him.",
      "chain": [
        "20656",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، حدثنا ثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أتاه جبريل صلى الله عليه وسلم وهو يلعب مع الغلمان فأخذه فصرعه فشق عن قلبه فاستخرج القلب فاستخرج منه علقة فقال هذا حظ الشيطان منك ‏.‏ ثم غسله في طست من ذهب بماء زمزم ثم لأمه ثم أعاده في مكانه وجاء الغلمان يسعون إلى أمه - يعني ظئره - فقالوا إن محمدا قد قتل ‏.‏ فاستقبلوه وهو منتقع اللون ‏.‏ قال أنس وقد كنت أرى أثر ذلك المخيط في صدره ‏.‏",
      "text_en": " Anas b. Malik reported that Gabriel came to the Messenger of Allah (may peace be upon him) while he was playing with his playmates. He took hold of him and lay him prostrate on the ground and tore open his breast and took out the heart from it and then extracted a blood-clot out of it and said:                      That was the part of Satan in thee. And then he washed it with the water of Zamzam in a golden basin and then it was joined together and restored to it place. The boys came running to his mother, i. e. his nurse, and said: Verily Muhammad has been murdered. They all rushed toward him (and found him all right) His color was changed, Anas said. I myself saw the marks of needle on his breast.",
      "chain": [
        "20656",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا شيبان بن فروخ، وأبو كامل الجحدري جميعا عن أبي عوانة، - قال أبو كامل حدثنا أبو عوانة، - عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف عنا النبي صلى الله عليه وسلم في سفر سافرناه فأدركنا وقد حضرت صلاة العصر فجعلنا نمسح على أرجلنا فنادى ‏\"‏ ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr reported:                      The Messenger of Allah (may peace be upon him) lagged behind us on a journey. We travelled (back) and be took him; and then came the time of the afternoon prayer, and as we were going to wipe our feet he (the Holy Prophet) called out: Woe to the heels because of Hell-fire.",
      "chain": [
        "20656",
        "30559",
        "20469",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا شيبان بن فروخ، وعبد الله بن محمد بن أسماء الضبعي، قالا حدثنا مهدي، - وهو ابن ميمون - حدثنا محمد بن عبد الله بن أبي يعقوب، عن الحسن بن سعد، مولى الحسن بن علي عن عبد الله بن جعفر، قال أردفني رسول الله صلى الله عليه وسلم ذات يوم خلفه فأسر إلى حديثا لا أحدث به أحدا من الناس وكان أحب ما استتر به رسول الله صلى الله عليه وسلم لحاجته هدف أو حائش نخل ‏.‏ قال ابن أسماء في حديثه يعني حائط نخل ‏.‏",
      "text_en": " 'Abdullah b. Ja'far reported:                      The Messenger of Allah (may peace be upon him) one day made me mount behind him and he confided to me something secret which I would not disclose to anybody; and the Messenger of Allah (may peace be upon him) liked the concealment provided by a lofty place or cluster of dates (while answering the call of nature), Ibn Asma' said in his narration: It implied an enclosure of the date-trees.",
      "chain": [
        "20656",
        "11307",
        "11076",
        "10754",
        "108"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسماعيل ابن علية، ح وحدثنا شيبان بن فروخ، حدثنا عبد الوارث، كلاهما عن عبد العزيز، عن أنس، قال أقيمت الصلاة ورسول الله صلى الله عليه وسلم نجي لرجل - وفي حديث عبد الوارث ونبي الله صلى الله عليه وسلم يناجي الرجل - فما قام إلى الصلاة حتى نام القوم ‏.‏",
      "text_en": " Anas reported:                      (The people) stood up for prayer and the Messenger of Allah (may peace be upon him) was whispering to a man, and in the narration of 'Abd al-Warith (the words are): The Apostle of Allah (may peace be upon him) was having a private conversation with a man, and did not start the prayer till the people dozed off.",
      "chain": [
        "30022",
        "20208",
        "20656",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "434",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن عبد العزيز، - وهو ابن صهيب - عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتموا الصفوف فإني أراكم خلف ظهري ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) said: Complete the rows, for I can see you behind my back.",
      "chain": [
        "20656",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن أبي نضرة العبدي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم رأى في أصحابه تأخرا فقال لهم ‏\"‏ تقدموا فائتموا بي وليأتم بكم من بعدكم لا يزال قوم يتأخرون حتى يؤخرهم الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) saw (a tendency ) among his Companions to go to the back, so he said to them: Come forward and follow my lead, and let those who come after you follow your lead. People will continue to keep back till Allah will put them at the back.",
      "chain": [
        "20656",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "449",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال ما قرأ رسول الله صلى الله عليه وسلم على الجن وما رآهم انطلق رسول الله صلى الله عليه وسلم في طائفة من أصحابه عامدين إلى سوق عكاظ وقد حيل بين الشياطين وبين خبر السماء وأرسلت عليهم الشهب فرجعت الشياطين إلى قومهم فقالوا ما لكم قالوا حيل بيننا وبين خبر السماء وأرسلت علينا الشهب ‏.‏ قالوا ما ذاك إلا من شىء حدث فاضربوا مشارق الأرض ومغاربها فانظروا ما هذا الذي حال بيننا وبين خبر السماء ‏.‏ فانطلقوا يضربون مشارق الأرض ومغاربها فمر النفر الذين أخذوا نحو تهامة - وهو بنخل - عامدين إلى سوق عكاظ وهو يصلي بأصحابه صلاة الفجر فلما سمعوا القرآن استمعوا له وقالوا هذا الذي حال بيننا وبين خبر السماء ‏.‏ فرجعوا إلى قومهم فقالوا يا قومنا ‏{‏ إنا سمعنا قرآنا عجبا * يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا‏}‏ فأنزل الله عز وجل على نبيه محمد صلى الله عليه وسلم ‏{‏ قل أوحي إلى أنه استمع نفر من الجن‏}‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) neither recited the Qur'an to the Jinn nor did he see them. The Messenger of Allah (may peace be upon him) went out with some of his Companions with the intention of going to the bazaar of 'Ukaz And there had been (at that time) obstructions between satans and the news from the Heaven, and there were flung flames upon them. So satan went back to their people and they said: What has happened to you? They said: There have been created obstructions between us and the news from the Heaven. And there have been flung upon us flames. They said: It cannot happen but for some (important) event. So traverse the eastern parts of the earth and the western parts and find out why is it that there have been created obstructions between us and the news from the Heaven. So they went forth and traversed the easts of the earth and its wests. Some of them proceeded towards Tihama and that is a nakhl towards the bazaar of 'Ukaz and he (the Holy Prophet) was leading his Companions in the morning prayer. So when they heard the Qur'an. they listened to it attentively and said: It is this which has caused obstruction between us and news from the Heaven. They went back to their people and said: O our people, we have heard a strange Qur'an which directs us to the right path; so we affirm our faith in it and we would never associate anyone with our Lord. And Allah, the Exalted and Glorious, revealed to His Apostle Muhammad (may peace be upon him):\" It has been revealed to me that a party of Jinn listened to it\" (Qur'an, lxxii. 1).",
      "chain": [
        "20656",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو عوانة، عن منصور، عن الوليد أبي بشر، عن أبي الصديق الناجي، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم كان يقرأ في صلاة الظهر في الركعتين الأوليين في كل ركعة قدر ثلاثين آية وفي الأخريين قدر خمس عشرة آية أو قال نصف ذلك وفي العصر في الركعتين الأوليين في كل ركعة قدر قراءة خمس عشرة آية وفي الأخريين قدر نصف ذلك ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Apostle of Allah (may peace be upon him) used to recite in every rak'ah of the first two rak'ahs of the noon prayer about thirty verses and in the last two about fifteen verses or half (of the first rak'ah) and in every rak'ah of the 'Asr prayer of the first two rak'ahs about fifteen verses and in the last two verses half (of the first ones).",
      "chain": [
        "20656",
        "20469",
        "11067",
        "10725",
        "11268",
        "38"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا ابن هلال، - يعني حميدا - قال بينما أنا وصاحب، لي نتذاكر حديثا إذ قال أبو صالح السمان أنا أحدثك، ما سمعت من أبي سعيد، ورأيت، منه قال بينما أنا مع أبي سعيد، يصلي يوم الجمعة إلى شىء يستره من الناس إذ جاء رجل شاب من بني أبي معيط أراد أن يجتاز بين يديه فدفع في نحره فنظر فلم يجد مساغا إلا بين يدى أبي سعيد فعاد فدفع في نحره أشد من الدفعة الأولى فمثل قائما فنال من أبي سعيد ثم زاحم الناس فخرج فدخل على مروان فشكا إليه ما لقي - قال - ودخل أبو سعيد على مروان فقال له مروان ما لك ولابن أخيك جاء يشكوك ‏.‏ فقال أبو سعيد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا صلى أحدكم إلى شىء يستره من الناس فأراد أحد أن يجتاز بين يديه فليدفع في نحره فإن أبى فليقاتله فإنما هو شيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Salih al-Samman reported:                      I narrate to you what I heard and saw from Abu Sa'id al-Khudri: One day I was with Abu Sa'id and he was saying prayer on Friday turning to a thing which concealed him from the people when a young man from Banu Mu'ait came there and he tried to pass in front of him; he turned him back by striking his chest. He looked about but finding no other way to pass except in front of Abu Sa'id, made a second attempt. He (Abu Sa'id) turned him away by Striking his chest more vigorously than the first stroke. He stood up and had a scuffle with Abu Sa'id. Then the people gathered there He came out and went to Marwan and complained to him what had happened to him. Abu Sa'id too came to Marwan. Marwin said to him: What has happened to you and the son of your brother that he came to complain against you? Abu Sa'id said: I heard from the Messenger of Allah (may peace be upon him) saying: When any one of you prays facing something which conceals him from people and anyone tries to pass in front of him, he should be turned away, but if he refuses, he should be forcibly restrained from it, for he is a devil.",
      "chain": [
        "20656",
        "20236",
        "11161"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح قال وحدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير، حدثنا أبي ح، قال وحدثنا إسحاق، أيضا أخبرنا المعتمر بن سليمان، قال سمعت سلم بن أبي الذيال، ح قال وحدثني يوسف بن حماد المعني، حدثنا زياد البكائي، عن عاصم الأحول، كل هؤلاء عن حميد بن هلال، بإسناد يونس كنحو حديثه ‏.‏",
      "text_en": " This hadith has been transmitted by Humaid b. Hilal on the authority of Yunus.",
      "chain": [
        "20656",
        "20236",
        "30170",
        "30160",
        "20173",
        "20020",
        "30123",
        "20298",
        "11272",
        "20288",
        "30573"
      ]
    },
    {
      "hadith_no": "1201",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، وشيبان بن فروخ، كلاهما عن عبد الوارث، - قال يحيى أخبرنا عبد الوارث بن سعيد، عن أبي التياح الضبعي، حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم قدم المدينة فنزل في علو المدينة في حى يقال لهم بنو عمرو بن عوف ‏.‏ فأقام فيهم أربع عشرة ليلة ثم إنه أرسل إلى ملإ بني النجار فجاءوا متقلدين بسيوفهم - قال - فكأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته وأبو بكر ردفه وملأ بني النجار حوله حتى ألقى بفناء أبي أيوب - قال - فكان رسول الله صلى الله عليه وسلم يصلي حيث أدركته الصلاة ويصلي في مرابض الغنم ثم إنه أمر بالمسجد قال فأرسل إلى ملإ بني النجار فجاءوا فقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏ ‏.‏ قالوا لا والله لا نطلب ثمنه إلا إلى الله ‏.‏ قال أنس فكان فيه ما أقول كان فيه نخل وقبور المشركين وخرب ‏.‏ فأمر رسول الله صلى الله عليه وسلم بالنخل فقطع وبقبور المشركين فنبشت وبالخرب فسويت - قال - فصفوا النخل قبلة وجعلوا عضادتيه حجارة - قال - فكانوا يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم إنه لا خير إلا خير الآخره فانصر الأنصار والمهاجره",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) came to Medina and stayed in the upper part of Medina for fourteen nights with a tribe called Banu 'Amr b 'Auf. He then sent for the chiefs of Banu al-Najir, and they came with swords around their inecks. He (the narrator) said: I perceive as if I am seeing the Messenger of Allah (may peace be upon him) on his ride with Abu Bakr behind him and the chiefs of Banu al-Najjar around him till he alighted in the courtyard of Abu Ayyub. He (the narrator) said: The Messenger of Allah (may peace be upon him) said prayer when the time came for prayer, and he prayed in the fold of goats and sheep. He then ordered mosques to be built and sent for the chiefs of Banu al-Najjar, and they came (to him). He (the Holy Prophet) said to them: O Banu al-Najjar, sell these lands of yours to me. They said: No, by Allah. we would not demand their price, but (reward) from the Lord. Anas said: There (in these lands) were trees and graves of the polytheists, and ruins. The Messenger of Allah (may peace he upon him) ordered that the trees should be cut, and the graves should be dug out, and the ruins should be levelled. The trees (were thus) placed in rows towards the qibla and the stones were set on both sides of the door, and (while building the mosque) they (the Companions) sang rajaz verses along with the Messenger of Allah (may peace be upon him): O Allah: there is no good but the good of the next world, So help the Ansar and the Muhajirin.",
      "chain": [
        "30399",
        "20656",
        "20258",
        "20031",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1206",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، عن ابن عمر، ح وحدثنا قتيبة بن سعيد، - واللفظ له - عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الصبح بقباء إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة ‏.‏ وقد أمر أن يستقبل الكعبة فاستقبلوها ‏.‏ وكانت وجوههم إلى الشام فاستداروا إلى الكعبة ‏.‏",
      "text_en": " Ibn 'Umar reported:                      As the people were praying at Quba' a man came to them and said: It has been revealed to file Messenger of Allah (may peace be upon him) during the night and he has been directed to turn towards the Ka'ba. So turn towards it. Their faces were towards Syria and they turned round towards Ka'ba.",
      "chain": [
        "20656",
        "20253",
        "11183",
        "18",
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "1257",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا عبد الوارث، ح قال وحدثنا يحيى بن يحيى، أخبرنا هشيم، ح قال وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن القاسم بن مهران، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث ابن علية وزاد في حديث هشيم قال أبو هريرة كأني أنظر إلى رسول الله صلى الله عليه وسلم يرد ثوبه بعضه على بعض ‏.‏",
      "text_en": " Abu Huraira reported:                      I perceive as if I am looking at the Messenger of Allah (may peace be upon him) folding up a part of his cloth with another one.",
      "chain": [
        "20656",
        "20258",
        "30399",
        "20468",
        "30170",
        "20173",
        "10956",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "1261",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء الضبعي، وشيبان بن فروخ، قالا حدثنا مهدي بن ميمون، حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ عرضت على أعمال أمتي حسنها وسيئها فوجدت في محاسن أعمالها الأذى يماط عن الطريق ووجدت في مساوي أعمالها النخاعة تكون في المسجد لا تدفن ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Apostle of Allah (may peace be upon him) said: The deeds of my people, good and bad, were presented before me, and I found the removal of something objectionable from the road among their good deeds, and the sputum mucus left unburied in the mosque among their evil deeds.",
      "chain": [
        "20656",
        "11307",
        "11729",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "1532",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا شيبان بن فروخ، وأبو الربيع، كلاهما عن عبد الوارث، قال شيبان حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا فربما تحضر الصلاة وهو في بيتنا فيأمر بالبساط الذي تحته فيكنس ثم ينضح ثم يؤم رسول الله صلى الله عليه وسلم ونقوم خلفه فيصلي بنا وكان بساطهم من جريد النخل ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) wits the best among people in character. On occasions, the time of prayer would come while he was in our house. He would then order to spread the mat lying under him. That was dusted and then water was sprinkled over it. The Messenger of Allah (may peace be upon him) then led the prayer and we stood behind him, and that mat was made of the leaves of date-palm.",
      "chain": [
        "20656",
        "20258",
        "20240",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1594",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - حدثنا ثابت، عن عبد الله بن رباح، عن أبي قتادة، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنكم تسيرون عشيتكم وليلتكم وتأتون الماء إن شاء الله غدا ‏\"‏ ‏.‏ فانطلق الناس لا يلوي أحد على أحد - قال أبو قتادة - فبينما رسول الله صلى الله عليه وسلم يسير حتى ابهار الليل وأنا إلى جنبه - قال - فنعس رسول الله صلى الله عليه وسلم فمال عن راحلته فأتيته فدعمته من غير أن أوقظه حتى اعتدل على راحلته - قال - ثم سار حتى تهور الليل مال عن راحلته - قال - فدعمته من غير أن أوقظه حتى اعتدل على راحلته - قال - ثم سار حتى إذا كان من آخر السحر مال ميلة هي أشد من الميلتين الأوليين حتى كاد ينجفل فأتيته فدعمته فرفع رأسه فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ قلت أبو قتادة ‏.‏ قال ‏\"‏ متى كان هذا مسيرك مني ‏\"‏ ‏.‏ قلت ما زال هذا مسيري منذ الليلة ‏.‏ قال ‏\"‏ حفظك الله بما حفظت به نبيه ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل ترانا نخفى على الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل ترى من أحد ‏\"‏ ‏.‏ قلت هذا راكب ‏.‏ ثم قلت هذا راكب آخر ‏.‏ حتى اجتمعنا فكنا سبعة ركب - قال - فمال رسول الله صلى الله عليه وسلم عن الطريق فوضع رأسه ثم قال ‏\"‏ احفظوا علينا صلاتنا ‏\"‏ ‏.‏ فكان أول من استيقظ رسول الله صلى الله عليه وسلم والشمس في ظهره - قال - فقمنا فزعين ثم قال ‏\"‏ اركبوا ‏\"‏ ‏.‏ فركبنا فسرنا حتى إذا ارتفعت الشمس نزل ثم دعا بميضأة كانت معي فيها شىء من ماء - قال - فتوضأ منها وضوءا دون وضوء - قال - وبقي فيها شىء من ماء ثم قال لأبي قتادة ‏\"‏ احفظ علينا ميضأتك فسيكون لها نبأ ‏\"‏ ‏.‏ ثم أذن بلال بالصلاة فصلى رسول الله صلى الله عليه وسلم ركعتين ثم صلى الغداة فصنع كما كان يصنع كل يوم - قال - وركب رسول الله صلى الله عليه وسلم وركبنا معه - قال - فجعل بعضنا يهمس إلى بعض ما كفارة ما صنعنا بتفريطنا في صلاتنا ثم قال ‏\"‏ أما لكم في أسوة ‏\"‏ ‏.‏ ثم قال ‏\"‏ أما إنه ليس في النوم تفريط إنما التفريط على من لم يصل الصلاة حتى يجيء وقت الصلاة الأخرى فمن فعل ذلك فليصلها حين ينتبه لها فإذا كان الغد فليصلها عند وقتها ‏\"‏ ‏.‏ ثم قال ‏\"‏ ما ترون الناس صنعوا ‏\"‏ ‏.‏ قال ثم قال ‏\"‏ أصبح الناس فقدوا نبيهم فقال أبو بكر وعمر رسول الله صلى الله عليه وسلم بعدكم لم يكن ليخلفكم ‏.‏ وقال الناس إن رسول الله صلى الله عليه وسلم بين أيديكم فإن يطيعوا أبا بكر وعمر يرشدوا ‏\"‏ ‏.‏ قال فانتهينا إلى الناس حين امتد النهار وحمي كل شىء وهم يقولون يا رسول الله هلكنا عطشنا ‏.‏ فقال ‏\"‏ لا هلك عليكم ‏\"‏ ‏.‏ ثم قال ‏\"‏ أطلقوا لي غمري ‏\"‏ ‏.‏ قال ودعا بالميضأة فجعل رسول الله صلى الله عليه وسلم يصب وأبو قتادة يسقيهم فلم يعد أن رأى الناس ماء في الميضأة تكابوا عليها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحسنوا الملأ كلكم سيروى ‏\"‏ ‏.‏ قال ففعلوا فجعل رسول الله صلى الله عليه وسلم يصب وأسقيهم حتى ما بقي غيري وغير رسول الله صلى الله عليه وسلم - قال - ثم صب رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ اشرب ‏\"‏ ‏.‏ فقلت لا أشرب حتى تشرب يا رسول الله قال ‏\"‏ إن ساقي القوم آخرهم شربا ‏\"‏ ‏.‏ قال فشربت وشرب رسول الله صلى الله عليه وسلم - قال - فأتى الناس الماء جامين رواء ‏.‏ قال فقال عبد الله بن رباح إني لأحدث هذا الحديث في مسجد الجامع إذ قال عمران بن حصين انظر أيها الفتى كيف تحدث فإني أحد الركب تلك الليلة ‏.‏ قال قلت فأنت أعلم بالحديث ‏.‏ فقال ممن أنت قلت من الأنصار ‏.‏ قال حدث فأنتم أعلم بحديثكم ‏.‏ قال فحدثت القوم فقال عمران لقد شهدت تلك الليلة وما شعرت أن أحدا حفظه كما حفظته ‏.‏",
      "text_en": " Abu Qatida reported:                      The Messenger of Allah (way peace be upon him) addressed us and said: You would travel In the evening and the might till (God willing) you would come in the morning to a place of water. So the people travelled (self absorbed) without paying any heed to one another, and the Messenger of Allah (may peace be upon him) also travelled till It was midnight. I was by his side. The Messenger of Allah (may peace be upon him) began to doze and leaned (to one side) of his camel. I came to him and I lent him support without awaking him till he sat poised on his ride. He went on travelling till a major part of the night was over and (he again) leaned (to one side) of his camel. I supported him without awaking him till he sat\" bed on his ride. and then travelled till it was near dawn. He (again) leaned which was far more inclined than the two earlier leanings and he was about to fall down. So I came to him and supported him and he lifted his head and said; Who is this? I said: it is Abu Qatida. He (the Holy Prophet again) said: Since how long have you been travelling along with me like this? I said: I have been travelling in this very state since the night. He said: May Allah protect you, as you have protected His Apostle (from falling down), and again said: Do you see that we are hidden from the people? - and again said: Do you see anyone? I said: Here is a rider. I again said: Here Is another rider till we gathered together and we were seven riders. The Messenger of Allah (may peace be upon him) stepped aside of the highway and placed his head (for sleep and said): Guard for us our prayers. The Messenger of Allah (may peace be upon him) was the first to wake up and the rays of the sun were falling on his back. We got up startled He (the Holy Prophet) said: Ride on So we rode on till the sun had (sufficiently) risen. He then came down from his camel and called for a jug of water which I had with me. There was a little water in that. He performed ablution with that which was less thorough as compared with his usual ablutions and some water of that had been left. He (the Holy Prophet) said to Abu Qatida: Keep a watch over your jug of water; it would have (a miraculous) condition about it. Then Bilal summoned (people) to prayer and then the Messenger of Allah (may peace be upon him) observed two rak'ahs and then said the morning prayer as he said every day. The Messenger of Allah (may peace be upon him) (then) rode on and we rode along with him and some of us whispered to the others saying: How would there be compensation for omission in our prayers? Upon this he (the Apostle of Allah) said: Is there not in me (my life) a model for you? There is no omission in sleeping. The (cognizable) emission is that one should not say prayer (intentionally) till the time of the other prayer comes. So he who did like it (omitted prayer in sleep or due to other unavoidable circumstances) should say prayer when he becomes aware of it and on the next day he should observe it at its prescribed time. He (the Holy Prophet) said: What do you think the people would have done (at this hour)? They would have in the morning found their Apostle missing from amongst them and then Abu Bakr and 'Umar would have told them that the Messenger of Allah (may peace be upon him) must be behind you, he cannot leave you behind (him), but the people said: The Messenger of Allah (may peace be upon him) is ahead of you. So if you had obeyed Abu Bakr and Umar, you would have gone on the right path. So we proceeded on till we came up to the people (from whom we had lagged behind) and the day had considerably risen and everything became hot, and they (the Companions of the Holy Prophet) said: Messenger of Allah, we are dying of thirst. Upon this he (the Holy Prophet) remarked: There is no destruction for you. And again said: Bring that small cup of mine and he then asked for the jug of water to be brought to him. The Messenger of Allah (may peace be upon him) began to pour water (in that small cup) and Abu Qatida gave them to drink. And when the people saw that there was (a little) water in the jug, they fell upon it. Upon this the Messenger of Allah (may peace be upon him) said: Behave well; the water (is enough) to satiate all of you. Then they (the Companions) began to receive (their share of) water with calmness (without showing any anxiety) and the Messenger of Allah (may peace be upon him) began to fill (the cap), and I began to serve them till no one was left except me and the Messenger of Allah (may peace be upon him). He then filled (the cup) with water and said to me: Drink it. I said: Messenger of Allah, I would not drink till you drink. Upon this he said: The server of the people Is the last among them to drink. So I drank and the Messenger of Allah (may peace be upon him) also drank and the people came to the place of water quite happy and satiated. 'Abdullah b. Rabah said: I am going to narrate this hadith in the great mosque, when 'Imran b. Husain said: See, O young man, how will you narrate for I was also one of the riders on that night? I said: So you must be knowing this hadith well. He said: Who are you? I said: I am one of the Ansar. Upon this he said: You narrate, for you know your hadith better. I, therefore, narrated it to the people. 'Imran said: I was also present that night, but I know not anyone else who learnt it so well as you have learnt.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "1696",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا يزيد، - يعني الرشك - حدثتني معاذة، أنها سألت عائشة - رضى الله عنها - كم كان رسول الله صلى الله عليه وسلم يصلي صلاة الضحى قالت أربع ركعات ويزيد ما شاء ‏.‏",
      "text_en": " Mu'adha asked 'A'isha (Allah be pleased with her) how many rak'ahs Allah's Messenger (may peace be upon him) prayed at the forenoon prayer. She replied:                      Four rak'ahs, but sometimes more as he pleased.",
      "chain": [
        "20656",
        "20258",
        "11319",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "1705",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا أبو التياح، حدثني أبو عثمان النهدي، عن أبي هريرة، قال أوصاني خليلي صلى الله عليه وسلم بثلاث بصيام ثلاثة أيام من كل شهر وركعتى الضحى وأن أوتر قبل أن أرقد ‏.‏",
      "text_en": " Abu Huraira reported. My friend (the Holy Prophet, may peace be upon him) has instructed me to do three things:                      three fasts during every month, two rak'ahs of the forenoon prayer, and observing Witr prayer before going to bed.",
      "chain": [
        "20656",
        "20258",
        "11317",
        "11113",
        "13"
      ]
    },
    {
      "hadith_no": "1793",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن أبي التياح، قال حدثني أبو مجلز، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Messenger (may peace be upon him) as saying:                      Witr is a rak'ah at the end of the night prayer.",
      "chain": [
        "20656",
        "20258",
        "11317",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "1846",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا مهدي، - وهو ابن ميمون - حدثنا عمران،   القصير عن قيس بن سعد، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم   بهذا الحديث واللفظ قريب من ألفاظهم ‏.‏",
      "text_en": " 'Abd al-Rahman b. 'Auf reported:                      I asked 'A'isha, the mother of the believers, (to tell me) the words with which the Apostle of Allah (may peace be upon him) commenced the prayer when he got up at night. She said: When he got up at night he would commence his prayer with these words: O Allah, Lord of Gabriel, and Michael, and Israfil, the Creator of the heavens and the earth, Who knowest the unseen and the seen; Thou decidest amongst Thy servants concerning their differences. Guide me with Thy permission in the divergent views (which the people) hold about Truth, for it is Thou Who guidest whom Thou wilt to the Straight Path.",
      "chain": [
        "20656",
        "11307",
        "172",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1868",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه شيبان بن فروخ، حدثنا عبد الوارث، عن عبد العزيز، عن أنس، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " 'Urwa b. Zubair reported that 'A'isha, the wife of the Apostle of Allah (may peace be upon him), told him that (once) Haula' dint Tuwait b. Habib b. Asad b. 'Abd al-'Uzzi passed by her (at the time) when the Messenger of Allah (may peace be upon him) was with her. I ('A'Isha) said:                      It Is Haula' bint Tuwait and they say that she does not sleep at night. Upon this the Messenger of Allah (may peace be upon him) said: (Oh) she does not sleep at night! Choose an act which you are capable of doing (continuously). By Allah, Allah would not grow weary, but you will grow weary.",
      "chain": [
        "20656",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1948",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا مهدي بن ميمون، حدثنا واصل الأحدب، عن أبي، وائل قال غدونا على عبد الله بن مسعود يوما بعد ما صلينا الغداة فسلمنا بالباب فأذن لنا - قال - فمكثنا بالباب هنية - قال - فخرجت الجارية فقالت ألا تدخلون فدخلنا فإذا هو جالس يسبح فقال ما منعكم أن تدخلوا وقد أذن لكم فقلنا لا إلا أنا ظننا أن بعض أهل البيت نائم ‏.‏ قال ظننتم بآل ابن أم عبد غفلة قال ثم أقبل يسبح حتى ظن أن الشمس قد طلعت فقال يا جارية انظري هل طلعت قال فنظرت فإذا هي لم تطلع فأقبل يسبح حتى إذا ظن أن الشمس قد طلعت قال يا جارية انظري هل طلعت فنظرت فإذا هي قد طلعت ‏.‏ فقال الحمد لله الذي أقالنا يومنا هذا - فقال مهدي وأحسبه قال - ولم يهلكنا بذنوبنا - قال - فقال رجل من القوم قرأت المفصل البارحة كله - قال - فقال عبد الله هذا كهذ الشعر إنا لقد سمعنا القرائن وإني لأحفظ القرائن التي كان يقرؤهن رسول الله صلى الله عليه وسلم ثمانية عشر من المفصل وسورتين من آل حم.",
      "text_en": " Shaqiq reported:                      A person from Banu Bajila who was called Nabik b. Sinan came to Abdullah and said: I recite mufassal surahs in one rak'ah. Upon this 'Abdullah said: (You recite) like the recitation of poetry. I know the manner in which the Messenger of Allah (may peace be upon him) recited two surahs in one rak'ah.",
      "chain": [
        "20656",
        "11307",
        "11401"
      ]
    },
    {
      "hadith_no": "1976",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن عبد العزيز، - وهو ابن صهيب - عن أنس بن مالك، قال كنا بالمدينة فإذا أذن المؤذن لصلاة المغرب ابتدروا السواري فيركعون ركعتين ركعتين حتى إن الرجل الغريب ليدخل المسجد فيحسب أن الصلاة قد صليت من كثرة من يصليهما ‏.‏",
      "text_en": " Abdullah b. Mughaffal reported Allah's Messenger (may peace be upon him) u saying:                      There Is between the two calls (Adhan and Iqama) a prayer. And he mentioned it three times, and at the third time he said: This applies to those who wish to do it.",
      "chain": [
        "20656",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "2062",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، قال قال أبو رفاعة انتهيت إلى النبي صلى الله عليه وسلم وهو يخطب قال فقلت يا رسول الله رجل غريب جاء يسأل عن دينه لا يدري ما دينه - قال - فأقبل على رسول الله صلى الله عليه وسلم وترك خطبته حتى انتهى إلى فأتي بكرسي حسبت قوائمه حديدا - قال - فقعد عليه رسول الله صلى الله عليه وسلم وجعل يعلمني مما علمه الله ثم أتى خطبته فأتم آخرها ‏.‏",
      "text_en": " Abu Rifa'a reported:                      I came to the Holy Prophet (may peace be upon him) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah (may peace be upon him) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah (may peace be upon him) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end.",
      "chain": [
        "20656",
        "20236",
        "11281"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا نافع، قال قيل لابن عمر إن أبا هريرة يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من تبع جنازة فله قيراط من الأجر ‏\"‏ ‏.‏ فقال ابن عمر أكثر علينا أبو هريرة ‏.‏ فبعث إلى عائشة فسألها فصدقت أبا هريرة فقال ابن عمر لقد فرطنا في قراريط كثيرة ‏.‏",
      "text_en": " Nafi' narrated that it was said to Ibn 'Umar that Abu Huraira reported to have heard Allah's Messenger (may peace be upon him) as saying:                      He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira. Ibn 'Umar said: We missed so many qirats.",
      "chain": [
        "20656",
        "11272",
        "11014",
        "13"
      ]
    },
    {
      "hadith_no": "2354",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا أبو الأشهب، حدثنا خليد العصري، عن الأحنف، بن قيس قال كنت في نفر من قريش فمر أبو ذر وهو يقول بشر الكانزين بكى في ظهورهم يخرج من جنوبهم وبكى من قبل أقفائهم يخرج من جباههم ‏.‏ - قال - ثم تنحى فقعد ‏.‏ - قال - قلت من هذا قالوا هذا أبو ذر ‏.‏ قال فقمت إليه فقلت ما شىء سمعتك تقول قبيل قال ما قلت إلا شيئا قد سمعته من نبيهم صلى الله عليه وسلم ‏.‏ قال قلت ما تقول في هذا العطاء قال خذه فإن فيه اليوم معونة فإذا كان ثمنا لدينك فدعه‏.‏",
      "text_en": " Ahnaf b. Qais reported:                      While I was in the company of the (elites) of Quraiah, Abu Dharr came there and he was saying: Give glad tidings to the hoarders of riches that their backs would be branded (so deeply) that (the hot Iron) would come out of their sides, and when the backs of their necks would be branded, it would come out of their foreheads. He (Abu Dharr) then went away and sat down. I asked who he was. They said: He is Abu Dharr. I went to him and said to him: What is this that I heard from you which you were saying before? He said: I said nothing but only that which I heard from their Prophet (may peace be upon him). I again said: What do you say about this gift? He said: Take it, for today it is a help. But when it becomes a price for your religion, then abandon it.",
      "chain": [
        "20656",
        "11273",
        "11112"
      ]
    },
    {
      "hadith_no": "2507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا القاسم، - وهو ابن الفضل الحداني - حدثنا أبو نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تمرق مارقة عند فرقة من المسلمين يقتلها أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that the Messenger of Allah (may peace be upon him) said:                      A group would secede itself (from the Ummah) when there would be dissension among the Muslims. Out of the two groups who would be nearer the truth would kill them.",
      "chain": [
        "20656",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بعدي من أمتي - أو سيكون بعدي من أمتي - قوم يقرءون القرآن لا يجاوز حلاقيمهم يخرجون من الدين كما يخرج السهم من الرمية ثم لا يعودون فيه هم شر الخلق والخليقة ‏\"‏ ‏.‏ فقال ابن الصامت فلقيت رافع بن عمرو الغفاري أخا الحكم الغفاري قلت ما حديث سمعته من أبي ذر كذا وكذا فذكرت له هذا الحديث فقال وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Verily there would arise from my Ummah after me or soon after me a group (of people) who would recite the Qar'an, but it would not go beyond their throats, and they would pass clean through their religion just as the arrow passes through the prey, and they would never come back to it. They would be the worst among the creation and the creatures. Ibn Samit (one of the narrators) said: I met Rafi' b. 'Amr Ghifari, the brother of Al-Hakam Ghifari and I said: What is this hadith that I heard from Abu Dharr, i. e. so and so? -and then I narrated that hadith to him and said: I heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "20656",
        "20236",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "2596",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن عبد الله بن سوادة القشيري، حدثني والدي، أنه سمع سمرة بن جندب، يقول سمعت محمدا، صلى الله عليه وسلم يقول",
      "text_en": " Samura b. Jandub reported Muhammad (may peace be upon him) as saying. The call of Bilal may not mislead any one of you (and he may, under the wrong impression gathered from it, refrain) from taking meal before the commencement of the fast (for the streaks) of this whiteness (which are vertical indicate the false dawn and the true dawn with which the fast commences is that when the streaks of light are) spread.",
      "chain": [
        "20656",
        "20258",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2801",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن يزيد الرشك، قال حدثتني معاذة، العدوية أنها سألت عائشة زوج النبي صلى الله عليه وسلم أكان رسول الله صلى الله عليه وسلم يصوم من كل شهر ثلاثة أيام قالت نعم ‏.‏ فقلت لها من أى أيام الشهر كان يصوم قالت لم يكن يبالي من أى أيام الشهر يصوم ‏.‏",
      "text_en": " Mu'adha al-'Adawiyya reported that she asked 'A'isha, the wife of the Apostle of Allah (may peace be upon him), whether the Messenger of Allah (may peace be upon him) observed fasts for three days during every month. She said:                      Yes I said to her: Which were (the particular) days of the month on which he observed fast? She said: He was not particular about the days of the month on which to observe fast.",
      "chain": [
        "20656",
        "20258",
        "11319",
        "11456"
      ]
    },
    {
      "hadith_no": "2855",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا عطاء بن أبي رباح، عن صفوان، بن يعلى بن أمية عن أبيه، - رضى الله عنه - قال جاء رجل إلى النبي صلى الله عليه وسلم وهو بالجعرانة عليه جبة وعليها خلوق - أو قال أثر صفرة - فقال كيف تأمرني أن أصنع في عمرتي قال وأنزل على النبي صلى الله عليه وسلم الوحى فستر بثوب وكان يعلى يقول وددت أني أرى النبي صلى الله عليه وسلم وقد نزل عليه الوحى - قال - فقال أيسرك أن تنظر إلى النبي صلى الله عليه وسلم وقد أنزل عليه الوحى قال فرفع عمر طرف الثوب فنظرت إليه له غطيط - قال وأحسبه قال - كغطيط البكر - قال - فلما سري عنه قال ‏\"‏ أين السائل عن العمرة اغسل عنك أثر الصفرة - أو قال أثر الخلوق - واخلع عنك جبتك واصنع في عمرتك ما أنت صانع في حجك ‏\"‏ ‏.‏",
      "text_en": " Ya'la b. Umayya reported on the authority of his father (Allah be pleased with them) that a person came to the Apostle of Allah (may peace be upon him) as he was at Ji'rana and he (the person) had been putting on a cloak which was perfumed, or he (the narrator) said:                      There was a trace of yellowness on it. He said (to the Holy Prophet): What do you command me to do during my Umra? (It was at this juncture) that the revelation came to the Apostle of Allah (way peace be upon him) and he was covered with a cloth, and Ya'la said: Would that I see revelation coming to the Apostle of Allah (may peace be upon him). He (Hadrat 'Umar) said: Would it please you to see the Apostle of Allah (may peace be upon him) receiving the revelations 'Umar lifted a corner of the cloth and I looked at him and he was emitting a sound of snorting. He (the narrator) said: I thought it was the sound of a camel. When he was relieved of this he said: Where is he who asked about Umra? When the person came, the Holy Prophet (may peace be upon him) said: Wash out the trace of yellowness, or he said: the trace of perfume and put off the cloak and do in your 'Umra what you do in your Hajj.",
      "chain": [
        "20656",
        "20297",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "2928",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو عوانة، عن زيد بن جبير، قال سأل رجل ابن عمر ما يقتل الرجل من الدواب وهو محرم قال حدثتني إحدى نسوة النبي صلى الله عليه وسلم أنه كان يأمر بقتل الكلب العقور والفارة والعقرب والحديا والغراب والحية ‏.‏ قال وفي الصلاة أيضا ‏.‏",
      "text_en": " Zaid b. Jubair reported:                      A person asked Ibn 'Umar which beast a Mubrim could kill, whereupon he said: One of the wives of Allab's Apostle (may peace be upon him) told me: He (the Holy Prophet) commanded to kill voracious dcg, rat, scorpion, kite, crow, and snake (and this is allowed) likewise in prayer.",
      "chain": [
        "20656",
        "20469",
        "22061"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - جميعا عن نافع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي، بن مسهر ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن عبيد الله، ح وحدثني أبو كامل، حدثنا حماد، حدثنا أيوب، ح وحدثنا ابن المثنى، حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، كل هؤلاء عن نافع، عن ابن عمر، - رضى الله عنهما - عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك وابن جريج ولم يقل أحد منهم عن نافع عن ابن عمر - رضى الله عنهما - سمعت النبي صلى الله عليه وسلم ‏.‏ إلا ابن جريج وحده وقد تابع ابن جريج على ذلك ابن إسحاق ‏.‏ وحدثنيه فضل بن سهل، حدثنا يزيد بن هارون، أخبرنا محمد بن إسحاق، عن نافع، وعبيد الله بن عبد الله، عن ابن عمر، - رضى الله عنهما - قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ خمس لا جناح في قتل ما قتل منهن في الحرم ‏\"‏ ‏.‏ فذكر بمثله‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through be upon him) as saying:                      Five (are the beasts) in killing which or their being killed in the precinct of the Ka'ba there is no sin.\" The rest of the hadith is the same.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20656",
        "11272",
        "11014",
        "30201",
        "20345",
        "30212",
        "11201",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "3302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا عطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم دخل الكعبة وفيها ست سوار فقام عند سارية فدعا ولم يصل ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that Allah's Apostle (may peace be upon him) entered the Ka'ba, and in it there were six pillars, and he stood near a pillar and made supplication, bnt did not observe the prayer.",
      "chain": [
        "20656",
        "20297",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3809",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه شيبان بن فروخ، حدثنا عبد العزيز، - يعني ابن مسلم - حدثنا عبد، الله بن دينار عن نافع، بإسناد حديث الليث ‏.‏ مثل روايته ‏.‏",
      "text_en": " A hadith like this is transmitted on the authority of Nafi'.",
      "chain": [
        "20656",
        "20253",
        "11183"
      ]
    },
    {
      "hadith_no": "3844",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثناه قتيبة بن سعيد، ومحمد بن رمح، جميعا عن الليث بن سعد، ح وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، حدثنا أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، ح وحدثنا محمد بن، المثنى حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، ح وحدثني إسحاق بن منصور، أخبرنا عبد الرزاق، عن ابن جريج، أخبرني إسماعيل بن أمية، ح وحدثنا هارون بن سعيد، الأيلي حدثنا ابن وهب، أخبرني أسامة، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، عن ابن أبي ذئب، كل هؤلاء عن نافع، عن ابن عمر، بمعنى حديث مالك عن نافع.‏",
      "text_en": " This hadith has been reported on the authority of Ibn 'Umar through another chain of transmitters.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20656",
        "11272",
        "30137",
        "20022",
        "11015",
        "30212",
        "20331",
        "11201",
        "30170",
        "20259",
        "11062"
      ]
    },
    {
      "hadith_no": "4002",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا همام، قال سأل سليمان بن موسى عطاء فقال أحدثك جابر بن عبد الله أن النبي صلى الله عليه وسلم قال ‏\"‏ من كانت له أرض فليزرعها أو ليزرعها أخاه ولا يكرها ‏\"‏ ‏.‏ قال نعم ‏.‏",
      "text_en": " Sulaiman b. Musa asked Ata':                      Did Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:\" He who has land should cultivate it himself, or let his brother cultivate it, and should not give on rent\"? He said: Yes.",
      "chain": [
        "20656",
        "20297",
        "10880"
      ]
    },
    {
      "hadith_no": "4140",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير يعني ابن حازم، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، ح وحدثنا محمد بن المثنى، حدثنا ابن، أبي عدي عن ابن عون، كلهم عن نافع، ‏.‏ بنحو حديث الليث عن نافع، عن أبي سعيد، الخدري عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id al-Khudri through another chain of transmitters.",
      "chain": [
        "20656",
        "11272",
        "30170",
        "20259",
        "11062",
        "30170",
        "20276",
        "11014",
        "38"
      ]
    },
    {
      "hadith_no": "4203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن ابن أبي نجيح، حدثني عبد الله، بن كثير عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم والناس يسلفون فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف فلا يسلف إلا في كيل معلوم ووزن معلوم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Messenger (may peace be upon him) came to (Medina) and the people were paying in advance (for the fruits, etc.), he said to them:                      He who makes an advance payment should not make advance payment except for a specified measure and weight (and for a specified period).",
      "chain": [
        "20656",
        "20258",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4357",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا الصعق، - يعني ابن حزن - حدثنا مطر الوراق، حدثنا زهدم الجرمي، قال دخلت على أبي موسى وهو يأكل لحم دجاج وساق الحديث بنحو حديثهم وزاد فيه قال ‏\"‏ إني والله ما نسيتها ‏\"‏ ‏.‏",
      "text_en": " Zahdam al-Jarmi reported:                      I visited Abu Musa and lie was eating fowl's meat. The rest of the hadith is the same with this addition that he (the Holy Prophet) said: By Allah, I did not forget it.",
      "chain": [
        "20656",
        "20552",
        "10719",
        "11589"
      ]
    },
    {
      "hadith_no": "4370",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، حدثنا عبد الرحمن، بن سمرة قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الرحمن بن سمرة لا تسأل الإمارة فإنك إن أعطيتها عن مسألة وكلت إليها وإن أعطيتها عن غير مسألة أعنت عليها وإذا حلفت على يمين فرأيت غيرها خيرا منها فكفر عن يمينك وائت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman b. Samura reported that Allah's Messenger (may peace be upon him) said to me:                      Abd al-Rahman b. Samura, don't ask for authority for if it is granted to you for asking for it, you would be commissioned for it (without having the support of Allah), but if you are granted it without your asking for it. You would be helped (by Allah) in it. And when you take an oath and find something else better than that, expiate for (breaking) your oath, and do that which is better. This hadith has also been transmitted on the authority of Ibn Farrukh.",
      "chain": [
        "20656",
        "11272",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "4371",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "قال أبو أحمد الجلودي حدثنا أبو العباس الماسرجسي، حدثنا شيبان بن فروخ، ‏.‏ بهذا الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "20656"
      ]
    },
    {
      "hadith_no": "4417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، عن نافع، مولى عبد الله بن عمر عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق نصيبا له في عبد فكان له من المال قدر ما يبلغ قيمته قوم عليه قيمة عدل وإلا فقد عتق منه ما عتق ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      He who gives up his share in a slave, and he has money enough to meet the full price, a fair price for him should be fixed; otherwise be has emancipated him to the extent that he has emancipated.",
      "chain": [
        "20656",
        "11272",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4464",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا عطاء، عن صفوان بن يعلى ابن، منية عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل وقد عض يد رجل فانتزع يده فسقطت ثنيتاه - يعني الذي عضه - قال فأبطلها النبي صلى الله عليه وسلم وقال ‏\"‏ أردت أن تقضمه كما يقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " Safwan b. Ya'la b. Munya reported on the authority of his father that there came to Allah's Apostle (may peace be upon him) a person who had bitten the hand of another person and who had withdrawn his hand (and as a result thereof) his foreteeth had fallen (those which had bitten). The Apostle of Allah (may peace be upon him) turned down his (claim), and said:                      Do you wish to bite as the camel bites?",
      "chain": [
        "20656",
        "20297",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "4579",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا شيبان بن فروخ، أخبرنا أبو عوانة، عن سهيل، بهذا الإسناد ‏.‏ مثله غير أنه قال ويسخط لكم ثلاثا ‏.‏ ولم يذكر ولا تفرقوا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Suhail with the same chain of transmitters, but with a slight variation of words.",
      "chain": [
        "20656",
        "20469"
      ]
    }
  ],
  "total_hadiths": 96
}