{
  "id": "20650",
  "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
  "full_name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      " Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  4  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Tamimi",
      "Kufi",
      "Khurasan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20152",
      "name": "Ubayy bin al-'Abbas bin Sahl أبي بن العباس بن سهل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11558",
      "name": "Syf bin Sulaiman سيف بن سليمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20662",
      "name": "'Abdul Malik bin al-Rabi' عبد الملك بن الربيع بن سبرة بن معبد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22013",
      "name": "Usamah bin Zayd bin Aslm أسامة بن زيد بن أسلم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20501",
      "name": "Aflah bin Sa'id al-Ansari أفلح بن سعيد الأنصاري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20504",
      "name": "al-Dahhak bin 'Uthman bin 'Abdullah الضحاك بن عثمان بن عبد الله بن خالد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30242",
      "name": "Ahmed bin Manay' أحمد بن منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30297",
      "name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31896",
      "name": "Yahya bin Abi Talb al-Bzaz يحيى بن أبي طالب",
      "grade": "3rd Century AH"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-234-3",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير بن مالك الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم ‏.‏ قال فذكر مثله غير أنه قال ‏\"‏ من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir al-Juhani reported:                      Verily the Messenger of Allah (may peace be upon him) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-338-2",
      "hadith_no": "338",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن الضحاك بن عثمان، قال أخبرني زيد بن أسلم، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينظر الرجل إلى عورة الرجل ولا المرأة إلى عورة المرأة ولا يفضي الرجل إلى الرجل في ثوب واحد ولا تفضي المرأة إلى المرأة في الثوب الواحد ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman, the son of Abu Sa'id al-Khudri, reported from his father:                      The Messenger of Allah (may peace be upon him) said: A man should not see the private parts of another man, and a woman should not see the private parts of another woman, and a man should not lie with another man under one covering, and a woman should not lie with another woman under one covering.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20504",
        "11163",
        "11879",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1745",
      "hadith_no": "1745",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، وحسن الحلواني، كلاهما عن زيد، قال حسن حدثنا زيد بن الحباب، حدثني الضحاك بن عثمان، حدثني عبد الله بن عروة، عن أبيه، عن عائشة، قالت لما بدن رسول الله صلى الله عليه وسلم وثقل كان أكثر صلاته جالسا ‏.‏",
      "text_en": " Hafsa reported:                      Never did I see the Messenger of Allah (may peace be upon him) observing supererogatory prayer sitting till one year before his death when he would observe Nafl prayer in a sitting position, and he would recite the Surah (of the Qur'an) in such a slow-measured tone (that duration of its recital) became more lengthy than the one longer than this.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "15",
        "20650",
        "20504",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2436",
      "hadith_no": "2436",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، حدثني ربيعة بن يزيد الدمشقي، عن عبد الله بن عامر اليحصبي، قال سمعت معاوية، يقول إياكم وأحاديث إلا حديثا كان في عهد عمر فإن عمر كان يخيف الناس في الله عز وجل سمعت رسول الله صلى الله عليه وسلم وهو يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما أنا خازن فمن أعطيته عن طيب نفس فيبارك له فيه ومن أعطيته عن مسألة وشره كان كالذي يأكل ولا يشبع ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya said:                      Be cautious about ahadith except those which were current during the reign of Umar, for he exhorted people to ftar Allah, the Exalted and majestic. I heard the Messenger of Allah (may peace be upon him) as saying: He upon whom Allah intends to bestow goodness, He confers upon him an insight in religion; and I heard the Messenger of Allah (way peace be upon him) as saying: I am the treasurer. To one whom I give out of (my own) sweet will, he would be blessed in that, but he whom I give (yielding to his constant begging and for his covetousness is like one who would eat, but would not be satisfied.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "10882",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-2497",
      "hadith_no": "2497",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب الثقفي، قال سمعت يحيى بن سعيد، يقول أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، ح.  وحدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثني قرة بن خالد، حدثني أبو الزبير، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم كان يقسم مغانم ‏.‏ وساق الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir b. 'Abdullah through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11263",
        "34",
        "30201",
        "20650",
        "11301",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2993",
      "hadith_no": "2993",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حسن بن علي الحلواني، حدثنا زيد بن الحباب، حدثني إبراهيم بن نافع، حدثني عبد الله بن أبي نجيح، عن مجاهد، عن عائشة، - رضى الله عنها - أنها حاضت بسرف فتطهرت بعرفة فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ يجزئ عنك طوافك بالصفا والمروة عن حجك وعمرتك ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that she entered in the monthly period at Sarif, and took bath at 'Arafa (after the period was over). The messenger of Allah (may peace be upon him) said to her:                      Your circumambulation between al Safa and al-Marwa is enough for your Hajj and 'Umra.",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20189",
        "11254",
        "11028",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3628",
      "hadith_no": "3628",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني أحمد بن المنذر البصري، حدثنا زيد بن حباب، حدثنا معاوية، أخبرني علي بن أبي طلحة الهاشمي، عن أبي الوداك، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Abu Sa'id from Allah's Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "27",
        "10752",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3925",
      "hadith_no": "3925",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو كريب قالوا حدثنا زيد بن حباب، عن الضحاك بن عثمان، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اشترى طعاما فلا يبعه حتى يكتاله ‏\"‏ ‏.‏ وفي رواية أبي بكر ‏\"‏ من ابتاع ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who bought foodgrain should not sell it until he had measured it. In the narration of Abu Bakr there the word is Ibta' instead of Ishtara.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20504",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4229",
      "hadith_no": "4229",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "وحدثنيه محمد بن العلاء أبو كريب الهمداني، حدثنا زيد بن حباب، عن يحيى، بن أيوب عن ابن طاوس، بهذا الإسناد ‏.‏ نحو حديث وهيب وروح بن القاسم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20379"
      ]
    },
    {
      "id": "sahih-muslim-4569",
      "hadith_no": "4569",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا زيد، - وهو ابن حباب - حدثني سيف بن سليمان، أخبرني قيس بن سعد، عن عمرو بن دينار، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قضى بيمين وشاهد ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) pronounced judgment on the basis of an oath and a witness (by the plaintiff).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20650",
        "11558",
        "172",
        "11081",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-4798",
      "hadith_no": "4798",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، ح وحدثنا سعيد بن محمد، الجرمي حدثنا أبو تميلة، قالا جميعا حدثنا حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، ‏.‏ قال غزا رسول الله صلى الله عليه وسلم تسع عشرة غزوة قاتل في ثمان منهن ‏.‏ ولم يقل أبو بكر منهن ‏.‏ وقال في حديثه حدثني عبد الله بن بريدة ‏.‏",
      "text_en": " It has been narrated on the authority of Buraida (who heard the tradition from his father) that the Messenger of Allah (may peace be upon him) conducted nineteen military campaigns and he (actually) fought in eight of them.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "30195",
        "20183",
        "20648",
        "11432"
      ]
    },
    {
      "id": "sahih-muslim-5224",
      "hadith_no": "5224",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، رافع قالا حدثنا زيد بن حباب، ح وحدثنا  إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الرحمن بن مهدي، كلاهما عن معاوية بن صالح، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mu'awiya b. Salih with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "30021"
      ]
    },
    {
      "id": "sahih-muslim-5387",
      "hadith_no": "5387",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن عكرمة بن عمار، حدثني  إياس بن سلمة بن الأكوع، أن أباه، حدثه أن رجلا أكل عند رسول الله صلى الله عليه وسلم بشماله فقال ‏\"‏ كل بيمينك ‏\"‏ ‏.‏ قال لا أستطيع قال ‏\"‏ لا استطعت ‏\"‏ ‏.‏ ما منعه إلا الكبر ‏.‏ قال فما رفعها إلى فيه ‏.‏",
      "text_en": " Salama b. Akwa' reported on the authority of his father that a person ate in the presence of Allah's Messenger (may peace be upon him) with his left hand, whereupon he said:                      Eat with your right hand. He said: I cannot do that, whereupon he (the Holy Prophet) said: May you not be able to do that. It was vanity that prevented him from doing it, and he could not raise it (the right hand) up to his mouth.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-5691",
      "hadith_no": "5691",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني زهير بن حرب، حدثنا زيد بن الحباب، عن إبراهيم بن نافع، أخبرني  الحسن بن مسلم بن يناق، عن صفية بنت شيبة، عن عائشة، أن امرأة، من الأنصار زوجت ابنة لها فاشتكت فتساقط شعرها فأتت النبي صلى الله عليه وسلم فقالت إن زوجها يريدها أفأصل شعرها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لعن الواصلات ‏\"‏ ‏.‏  وحدثنيه محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن إبراهيم بن نافع، بهذا الإسناد وقال ‏\"‏ لعن الموصلات ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that a woman from the Ansar married her daughter who had lost her hair because of illness. She came to Allah's Apostle (may peace be upon him) and said:                      Her husband wants that false hair should be aaded to her head. Thereupon Allah's Messenger (may peace be upon him) said: The woman who adds false hair has been cursed. This hadith has been narrated on the authority of Nafi' with the same chain of transmitters but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20650",
        "20189",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6475",
      "hadith_no": "6475",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو جعفر، محمد بن الفرج حدثنا زيد بن الحباب، أخبرني عبد العزيز، بن أبي سلمة أخبرنا محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أريت الجنة فرأيت امرأة أبي طلحة ثم سمعت خشخشة أمامي فإذا بلال ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I was shown Paradise and I saw the wife of Abu Talha (i. e. Umm Sulaim) and I heard the noise of steps before me and, lo, it was that of Bilal.",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "32017",
        "11048",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-7374",
      "hadith_no": "7374",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا ابن نمير، حدثنا زيد، - يعني ابن حباب - حدثنا أفلح بن سعيد، حدثنا  عبد الله بن رافع، مولى أم سلمة قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك إن طالت بك مدة أن ترى قوما في أيديهم مثل أذناب البقر يغدون في غضب الله ويروحون في سخط الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      If you survive for a time you would certainly see people who would have whips in their hands like the tail of an ox. They would get up in the morning under the wrath of Allah and they would get into the evening with the anger of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20650",
        "20501",
        "11864",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-136",
      "hadith_no": "136",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا زيد، - يعني ابن الحباب - حدثنا عبد الرحمن بن ثوبان، حدثنا عبد الله بن الفضل الهاشمي، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (my peace be upon him) washed the limbs in ablution twice.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "11187",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-197",
      "hadith_no": "197",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، عن زيد بن الحباب، عن مطيع بن راشد، عن توبة العنبري، أنه سمع أنس بن مالك، يقول إن رسول الله صلى الله عليه وسلم شرب لبنا فلم يمضمض ولم يتوضأ وصلى ‏.‏ قال زيد دلني شعبة على هذا الشيخ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Messenger of Allah (ﷺ) drank some milk and he did not rinse his mouth nor did he perform ablution, and he offered the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "24432",
        "11579",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-607",
      "hadith_no": "607",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبدة بن عبد الله، أخبرنا زيد، - يعني ابن الحباب - عن محمد بن صالح، حدثني حصين، من ولد سعد بن معاذ عن أسيد بن حضير، أنه كان يؤمهم - قال - فجاء رسول الله صلى الله عليه وسلم يعوده فقالوا يا رسول الله إن إمامنا مريض ‏.‏ فقال ‏\"‏ إذا صلى قاعدا فصلوا قعودا ‏\"‏ ‏.‏ قال أبو داود هذا الحديث ليس بمتصل ‏.‏",
      "text_en": " Husain reported on the authority of the children of Sa’d b. Mu’adh that Usaid b. Hudair used to act as their Imam. (when he fell ill) the Messenger of Allah (ﷺ) came to him inquiring about his illness. They said:                      Messenger of Allah, our Imam is ill. He said : When he prays sitting, pray sitting.Abu Dawud said : The chain of this tradition is not continuous (muttasil)",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20650",
        "45"
      ]
    },
    {
      "id": "sunan-abi-daud-766",
      "hadith_no": "766",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رافع، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، أخبرني أزهر بن سعيد الحرازي، عن عاصم بن حميد، قال سألت عائشة بأى شىء كان يفتتح رسول الله صلى الله عليه وسلم قيام الليل فقالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان إذا قام كبر عشرا وحمد الله عشرا وسبح عشرا وهلل عشرا واستغفر عشرا وقال ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني ‏\"‏ ‏.‏ ويتعوذ من ضيق المقام يوم القيامة ‏.‏ قال أبو داود ورواه خالد بن معدان عن ربيعة الجرشي عن عائشة نحوه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Asim ibn Humayd said: I asked Aisha: By what words the Messenger of Allah (ﷺ) would begin his supererogatory prayer at night? She replied: You ask me about a thing of which no one asked me before you. When he stood up, be uttered the takbir (Allah is most great) ten times, and uttered \"Praise be to Allah\" ten times, and uttered \"Glory be to Allah \" ten times, and uttered \"There is no god but Allah\" ten times, and sought forgiveness ten times, and said: O Allah, forgive me, and guide me, and give me sustenance, and keep me well, and he sought refuge in Allah from the hardship of standing before Allah on the Day of Judgment.Abu Dawud said: This tradition has also been narrated by Khalid b. Ma'dan from Rab'iah al-Jarashi on the authority of 'Aishah.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20650",
        "20675",
        "18018"
      ]
    },
    {
      "id": "sunan-abi-daud-850",
      "hadith_no": "850",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن مسعود، حدثنا زيد بن الحباب، حدثنا كامل أبو العلاء، حدثني حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يقول بين السجدتين ‏\"‏ اللهم اغفر لي وارحمني وعافني واهدني وارزقني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) used to say between the two prostrations: \"O Allah, forgive me, have mercy on me, guide me, heal me, and provide for me.\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "11331",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-906",
      "hadith_no": "906",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من أحد يتوضأ فيحسن الوضوء ويصلي ركعتين يقبل بقلبه ووجهه عليهما إلا وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Uqbah. B Amir al-Juhani reported the Messenger of Allah(ﷺ) as saying:                      Any one performs ablution and performs the ablution perfectly and then offers two rak’ahs of prayers concentrating on them with his heart and face but paradise will necessarily fall to his lot.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "20675",
        "11414",
        "11027",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1084",
      "hadith_no": "1084",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، حدثني فليح بن سليمان، حدثني عثمان بن عبد الرحمن التيمي، سمعت أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يصلي الجمعة إذا مالت الشمس ‏.‏",
      "text_en": " Anas b. Malik said:                      The Messenger of Allah (ﷺ) used to offer the Friday prayer when the sun declined.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-1109",
      "hadith_no": "1109",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، أن زيد بن حباب، حدثهم حدثنا حسين بن واقد، حدثني عبد الله بن بريدة، عن أبيه، قال خطبنا رسول الله صلى الله عليه وسلم فأقبل الحسن والحسين - رضى الله عنهما - عليهما قميصان أحمران يعثران ويقومان فنزل فأخذهما فصعد بهما المنبر ثم قال ‏\"‏ صدق الله ‏{‏ إنما أموالكم وأولادكم فتنة ‏}‏ رأيت هذين فلم أصبر ‏\"‏ ‏.‏ ثم أخذ في الخطبة ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Messenger of Allah (ﷺ) delivered a speech to us; meanwhile al-Hasan and al-Husayn came upon there stumbling, wearing red shirts. He came down from the pulpit, took them and ascended it with them. He then said: Allah truly said: \"Your property and your children are only trial\" (Ixiv.15). I saw both of them, and I could not wait. Afterwards he resumed the speech.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-1153",
      "hadith_no": "1153",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، وابن أبي زياد، - المعنى قريب - قالا حدثنا زيد، - يعني ابن حباب - عن عبد الرحمن بن ثوبان، عن أبيه، عن مكحول، قال أخبرني أبو عائشة، جليس لأبي هريرة أن سعيد بن العاص، سأل أبا موسى الأشعري وحذيفة بن اليمان كيف كان رسول الله صلى الله عليه وسلم يكبر في الأضحى والفطر فقال أبو موسى كان يكبر أربعا تكبيره على الجنائز ‏.‏ فقال حذيفة صدق ‏.‏ فقال أبو موسى كذلك كنت أكبر في البصرة حيث كنت عليهم ‏.‏ وقال أبو عائشة وأنا حاضر سعيد بن العاص ‏.‏",
      "text_en": " Abu 'Aishah said:                      Sa'id b. al-'As asked Abu Musa al-Ash'ari and Hudhaifah b. al-Yaman: How would the Messenger of Allah (ﷺ) utter the takbir (Allah is most great) in the prayer of the day of sacrifice and of the breaking of the fast. Abu Musa said: He uttered takbir four times as he did at funerals. Hudhaifah said: He is correct. Then Abu Musa said: I used to utter the takbir in a similar way when I was the governor of Basrah. Abu 'Aishah said: I was present there when Sa'id b. al-'As asked.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "11066",
        "989",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-1303",
      "hadith_no": "1303",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا زيد بن الحباب العكلي، حدثني مالك بن مغول، حدثني مقاتل بن بشير العجلي، عن شريح بن هانئ، عن عائشة، - رضى الله عنها - قال سألتها عن صلاة، رسول الله صلى الله عليه وسلم فقالت ما صلى رسول الله صلى الله عليه وسلم العشاء قط فدخل على إلا صلى أربع ركعات أو ست ركعات ولقد مطرنا مرة بالليل فطرحنا له نطعا فكأني أنظر إلى ثقب فيه ينبع الماء منه وما رأيته متقيا الأرض بشىء من ثيابه قط ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Shurayh ibn Hani said: I asked Aisha about the prayer of the Messenger of Allah (ﷺ).  She said: The Messenger of Allah (ﷺ) never offered the night prayer and thereafter came to me but he offered four or six rak'ahs of prayer. One night the rain fell, so we spread a piece of leather (for his prayer), and now I see as if there is a hole in it from which the water is flowing. I never saw him protecting his clothes from the earth (as he did on that occasion).",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20650",
        "20358",
        "15547",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1494",
      "hadith_no": "1494",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الرحمن بن خالد الرقي، حدثنا زيد بن حباب، حدثنا مالك بن مغول، بهذا الحديث قال فيه ‏\"‏ لقد سألت الله عز وجل باسمه الأعظم ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has been transmitted through a different chain of narrators by Malik b. Mighwal. This verso adds:                      \"He has asked Allah using His Greatest Name.\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20358"
      ]
    },
    {
      "id": "sunan-abi-daud-2036",
      "hadith_no": "2036",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن العلاء، أن زيد بن الحباب، حدثهم حدثنا سليمان بن كنانة، مولى عثمان بن عفان أخبرنا عبد الله بن أبي سفيان، عن عدي بن زيد، قال حمى رسول الله صلى الله عليه وسلم كل ناحية من المدينة بريدا بريدا لا يخبط شجره ولا يعضد إلا ما يساق به الجمل ‏.‏",
      "text_en": " ‘Adi bin Zaid said “The Apostle of Allaah(ﷺ) declared Madeenah a protected land a mail-post(three miles) from each side. Its trees are not to be beaten off or to be cut except what is taken from the Camel.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "12219"
      ]
    },
    {
      "id": "sunan-abi-daud-2175",
      "hadith_no": "2175",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، حدثنا عمار بن رزيق، عن عبد الله بن عيسى، عن عكرمة، عن يحيى بن يعمر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من خبب امرأة على زوجها أو عبدا على سيده ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Anyone who incites a woman against her husband or a slave against his master is not one of us.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20595",
        "11361",
        "11023",
        "11316",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2506",
      "hadith_no": "2506",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد بن الحباب، عن عبد المؤمن بن خالد الحنفي، حدثني نجدة بن نفيع، قال ‏:‏ سألت ابن عباس عن هذه الآية، ‏{‏ إلا تنفروا يعذبكم عذابا أليما ‏}‏ قال ‏:‏ فأمسك عنهم المطر وكان عذابهم ‏.‏",
      "text_en": " Najdah bin Nufai’ said “I asked Ibn ‘Abbas about the verse. “Unless you go forth, He will punish you with a grievous penalty.” He replied “The rain stopped from them. This was their punishment.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "28375",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2684",
      "hadith_no": "2684",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا زيد بن حباب، قال أخبرنا عمرو بن عثمان بن عبد الرحمن بن سعيد بن يربوع المخزومي، قال حدثني جدي، عن أبيه، أن رسول الله صلى الله عليه وسلم قال يوم فتح مكة ‏\"‏ أربعة لا أؤمنهم في حل ولا حرم ‏\"‏ ‏.‏ فسماهم ‏.‏ قال وقينتين كانتا لمقيس فقتلت إحداهما وأفلتت الأخرى فأسلمت ‏.‏ قال أبو داود لم أفهم إسناده من ابن العلاء كما أحب ‏.‏",
      "text_en": " Narrated Sa'id ibn Yarbu' al-Makhzumi:                     The Prophet (ﷺ) said: on the day of the conquest of Mecca: There are four persons whom I shall not give protection in the sacred and non-sacred territory. He then named them. There were two singing girls of al-Maqis; one of them was killed and the other escaped and embraced Islam.Abu Dawud said: I could not understand its chain of narrators from Ibn al-'Ala' as I liked.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "10581",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-2729",
      "hadith_no": "2729",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن سعيد، وغيره، أخبرنا زيد بن الحباب، قال حدثنا رافع بن سلمة بن زياد، حدثني حشرج بن زياد، عن جدته أم أبيه، أنها خرجت مع رسول الله صلى الله عليه وسلم في غزوة خيبر سادس ست نسوة فبلغ رسول الله صلى الله عليه وسلم فبعث إلينا فجئنا فرأينا فيه الغضب فقال ‏\"‏ مع من خرجتن وبإذن من خرجتن ‏\"‏ ‏.‏ فقلنا يا رسول الله خرجنا نغزل الشعر ونعين به في سبيل الله ومعنا دواء الجرحى ونناول السهام ونسقي السويق فقال ‏\"‏ قمن ‏\"‏ حتى إذا فتح الله عليه خيبر أسهم لنا كما أسهم للرجال ‏.‏ قال فقلت لها يا جدة وما كان ذلك قالت تمرا ‏.‏",
      "text_en": " Narrated Umm Ziyad:                     Hashraj ibn Ziyad reported on the authority of his grandmother that she went out with the Messenger of Allah (ﷺ) for the battle of Khaybar. They were six in number including herself.  (She said): When the Messenger of Allah (ﷺ) was informed about it, he sent for us. We came to him, and found him angry.  He said: With whom did you come out, and by whose permission did you come out?  We said: Messenger of Allah, we have come out to spin the hair, by which we provide aid in the cause of Allah. We have medicine for the wounded, we hand arrows (to the fighters), and supply drink made of wheat or barley.  He said: Stand up. When Allah bestowed victory of Khaybar on him, he allotted shares to us from spoils that he allotted to the men.  He (Hashraj ibn Ziyad) said: I said to her: Grandmother, what was that?  She replied: Dates.",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20650"
      ]
    },
    {
      "id": "sunan-abi-daud-3136",
      "hadith_no": "3136",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد، - يعني ابن الحباب - ح وحدثنا قتيبة بن سعيد، حدثنا أبو صفوان، - يعني المرواني - عن أسامة، عن الزهري، عن أنس بن مالك، - المعنى - أن رسول الله صلى الله عليه وسلم مر على حمزة وقد مثل به فقال ‏\"‏ لولا أن تجد صفية في نفسها لتركته حتى تأكله العافية حتى يحشر من بطونها ‏\"‏ ‏.‏ وقلت الثياب وكثرت القتلى فكان الرجل والرجلان والثلاثة يكفنون في الثوب الواحد - زاد قتيبة - ثم يدفنون في قبر واحد فكان رسول الله صلى الله عليه وسلم يسأل ‏\"‏ أيهم أكثرهم قرآنا ‏\"‏ ‏.‏ فيقدمه إلى القبلة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Messenger of Allah (ﷺ) passed Hamzah who was killed and disfigured. He said: If Safiyyah were not grieved, I would have left him until the birds and beasts of prey would have eaten him, and he would have been resurrected from their bellies. The garments were scanty and the slain were in great number. So one, two and three persons were shrouded in one garment. The narrator Qutaybah added: They were then buried in one grave. The Messenger of Allah (ﷺ) asked: Which of the two learnt the Qur'an more? He then advanced him toward the qiblah (direction of prayer).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "30367",
        "50",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-3258",
      "hadith_no": "3258",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا زيد بن الحباب، حدثنا حسين، - يعني ابن واقد - حدثني عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ من حلف فقال إني بريء من الإسلام فإن كان كاذبا فهو كما قال، وإن كان صادقا فلن يرجع إلى الإسلام سالما ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: If anyone takes an oath and says: I am free from Islam; now if he is a liar (in his oath), he will not return to Islam with soundness.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3265",
      "hadith_no": "3265",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرني زيد بن حباب، أخبرني محمد بن هلال، حدثني أبي أنه، سمع أبا هريرة، يقول ‏:‏ كانت يمين رسول الله صلى الله عليه وسلم إذا حلف يقول ‏:‏ ‏\"‏ لا، وأستغفر الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) swore an oath, it was: No, and I beg forgiveness of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30379",
        "20650",
        "12489",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3608",
      "hadith_no": "3608",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان بن أبي شيبة، والحسن بن علي، أن زيد بن الحباب، حدثهم حدثنا سيف المكي، - قال عثمان سيف بن سليمان - عن قيس بن سعد، عن عمرو بن دينار، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قضى بيمين وشاهد ‏.‏",
      "text_en": " Ibn 'Abbas said:                      The Messenger of Allah (ﷺ) gave a decision on the basis of an oath and a single witness.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30",
        "20650",
        "172",
        "11081",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3688",
      "hadith_no": "3688",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن حاتم بن حريث، عن مالك بن أبي مريم، قال دخل علينا عبد الرحمن بن غنم فتذاكرنا الطلاء فقال حدثني أبو مالك الأشعري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليشربن ناس من أمتي الخمر يسمونها بغير اسمها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Ghanam:                     Malik ibn AbuMaryam said: AbdurRahman ibn Ghanam entered upon us and we discussed tila' and he said: AbuMalik al-Ash'ari told me that he heard the Messenger of Allah (ﷺ) say: Some of my people will assuredly drink wine calling it by another name.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20650",
        "20675",
        "18138",
        "17058"
      ]
    },
    {
      "id": "sunan-abi-daud-4196",
      "hadith_no": "4196",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا زيد بن الحباب، عن ميمون بن عبد الله، عن ثابت البناني، عن أنس بن مالك، قال كانت لي ذؤابة فقالت لي أمي لا أجزها كان رسول الله صلى الله عليه وسلم يمدها ويأخذ بها ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I had a hanging lock of hair. My mother said to me: I shall not cut it, for the Messenger of Allah (ﷺ) used to stretch it our and hold it.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4223",
      "hadith_no": "4223",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا الحسن بن علي، ومحمد بن عبد العزيز بن أبي رزمة، - المعنى - أن زيد بن حباب، أخبرهم عن عبد الله بن مسلم السلمي المروزي أبي طيبة، عن عبد الله بن بريدة، عن أبيه، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وعليه خاتم من شبه فقال له ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ فطرحه ثم جاء وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ فطرحه فقال يا رسول الله من أى شىء أتخذه قال ‏\"‏ اتخذه من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏ ولم يقل محمد عبد الله بن مسلم ‏.‏ ولم يقل الحسن السلمي المروزي ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A man came to the Prophet (ﷺ) and he was wearing a signet-ring of yellow copper. He said to him: How is it that I notice the odour of idols in you? So he threw it away, and came wearing an iron signet ring. He (the Prophet) said: What is it that I see you wearing the adornment of the inhabitants of Hell? So he threw it away. He asked: Messenger of Allah, what material I must use? He said: Make it of silver, but do not weigh it as much as a mithqal,The narrator Muhammad did not say: \" 'Abd Allah b. Muslim,\" and al-Hasan did not say: \"al-Sulami al-Marwazi.\"",
      "usc_msa_ref": "",
      "chain": [
        "30",
        "20650",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4546",
      "hadith_no": "4546",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا زيد بن الحباب، عن محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، من بني عدي قتل فجعل النبي صلى الله عليه وسلم ديته اثنى عشر ألفا ‏.‏ قال أبو داود رواه ابن عيينة عن عمرو عن عكرمة عن النبي صلى الله عليه وسلم لم يذكر ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man of Banu Adi was killed. The Prophet (ﷺ) fixed his blood-wit at the rate of twelve thousand (dirhams).Abu Dawud said: Ibn 'Uyainah transmitted it from 'Amr, from 'Ikrimah, from the Prophet (ﷺ), and he did not mention Ibn 'Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20650",
        "167",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-5093",
      "hadith_no": "5093",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن العلاء، أن زيد بن حباب، أخبرهم عن أبي هلال، عن قتادة، أن رسول الله صلى الله عليه وسلم كان إذا رأى الهلال صرف وجهه عنه ‏.‏ قال أبو داود ليس عن النبي صلى الله عليه وسلم في هذا الباب حديث مسند صحيح ‏.‏",
      "text_en": " Narrated Qatadah:                     When the Messenger of Allah (ﷺ) saw the new moon, he turned away his face from it.Abu Dawud said: On this subject there is no tradition which has perfect chain and is sound.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "11019"
      ]
    },
    {
      "id": "sunan-abi-daud-5170",
      "hadith_no": "5170",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، عن عمار بن رزيق، عن عبد الله بن عيسى، عن عكرمة، عن يحيى بن يعمر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خبب زوجة امرئ أو مملوكه فليس منا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone corrupts (instigates) the wife of a man or his slave (against him), he is not from us.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20595",
        "11361",
        "11023",
        "11316",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-43",
      "hadith_no": "43",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، ومحمد بن رافع، قالا حدثنا زيد بن حباب، عن عبد الرحمن بن ثابت بن ثوبان، قال حدثني عبد الله بن الفضل، عن عبد الرحمن بن هرمز، هو الأعرج عن أبي هريرة، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين ‏.‏ قال أبو عيسى وفي الباب عن جابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث ابن ثوبان عن عبد الله بن الفضل وهو إسناد حسن صحيح ‏.‏ قال أبو عيسى وقد روى همام عن عامر الأحول عن عطاء عن أبي هريرة أن النبي صلى الله عليه وسلم توضأ ثلاثا ثلاثا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Prophet performed Wudu two time (for each limb).\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30375",
        "20650",
        "20731",
        "11187",
        "11197",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-53",
      "hadith_no": "53",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا سفيان بن وكيع بن الجراح، حدثنا عبد الله بن وهب، عن زيد بن حباب، عن أبي معاذ، عن الزهري، عن عروة، عن عائشة، قالت كان لرسول الله صلى الله عليه وسلم خرقة ينشف بها بعد الوضوء ‏.‏ قال أبو عيسى حديث عائشة ليس بالقائم ولا يصح عن النبي صلى الله عليه وسلم في هذا الباب شيء ‏.‏ وأبو معاذ يقولون هو سليمان بن أرقم وهو ضعيف عند أهل الحديث ‏.‏ قال وفي الباب عن معاذ بن جبل ‏.‏",
      "text_en": " Aishah narrated:                     \"Allah's Messenger had a cloth that he would use to dry off with after Wudu.\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20029",
        "20650",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-55",
      "hadith_no": "55",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن محمد بن عمران الثعلبي الكوفي، حدثنا زيد بن حباب، عن معاوية بن صالح، عن ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله اللهم اجعلني من التوابين واجعلني من المتطهرين فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أنس وعقبة بن عامر ‏.‏ قال أبو عيسى حديث عمر قد خولف زيد بن حباب في هذا الحديث ‏.‏ قال وروى عبد الله بن صالح وغيره عن معاوية بن صالح عن ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر عن عمر ‏.‏ وعن ربيعة عن أبي عثمان عن جبير بن نفير عن عمر ‏.‏ وهذا حديث في إسناده اضطراب ولا يصح عن النبي صلى الله عليه وسلم في هذا الباب كبير شيء ‏.‏ قال محمد وأبو إدريس لم يسمع من عمر شيئا ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated that :                     Allah's Messenger said: 'Whoever performs Wudu, making Wudu well, then says: (Ashhadu an la ilaha illallah, wahdahu la sharika lahu, wa ashhadu anna Muhammadan-abduhu wa rasuluhu, Allahummajalni minat tawwabin, waj'alni minal mutatahhirin) 'I testify that none has the right to be worshipped but Allah Alone, there are no partners for Him. And I testify that Muhammad is His servant and Messenger. O Allah! Make me among the repentant, and make me among those who purify themselves.' Then eight gates of Paradise are opened for him, that may enter by whichever of them wishes.\"",
      "usc_msa_ref": "",
      "chain": [
        "10898",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-250",
      "hadith_no": "250",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا زيد بن حباب، حدثني مالك بن أنس، حدثنا الزهري، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أمن الإمام فأمنوا فإنه من وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said \"When the Imam says 'Amin' then (all of you) say 'Amin.' For whoever's 'Amin' concurs with the 'Amin' of the angels, then his past sins will be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "20001",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-284",
      "hadith_no": "284",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا زيد بن حباب، عن كامل أبي العلاء، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يقول بين السجدتين ‏\"‏ اللهم اغفر لي وارحمني واجبرني واهدني وارزقني ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"Between the two prostrations, the Prophet would say: (Allahummaghfir li, warhamni, wajburni, wahdini, warzuqni). 'O Allah! Pardon me, have mercy on me, help me, guide me, and grant me sustenance.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "20650",
        "11331",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-285",
      "hadith_no": "285",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي الخلال الحلواني، حدثنا يزيد بن هارون، عن زيد بن حباب، عن كامل أبي العلاء، نحوه ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وهكذا روي عن علي، ‏.‏ وبه يقول الشافعي وأحمد وإسحاق يرون هذا جائزا في المكتوبة والتطوع ‏.‏ وروى بعضهم هذا الحديث عن كامل أبي العلاء مرسلا ‏.‏",
      "text_en": " Ibn Abbas narrated:                     (Another chain) which is similar.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20472",
        "20650"
      ]
    },
    {
      "id": "jami-al-tirmidhi-309",
      "hadith_no": "309",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي البصري، حدثنا زيد بن الحباب، حدثنا حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يقرأ في العشاء الآخرة بالشمس وضحاها ونحوها من السور ‏.‏ قال وفي الباب عن البراء بن عازب وأنس ‏.‏ قال أبو عيسى حديث بريدة حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قرأ في العشاء الآخرة بالتين والزيتون ‏.‏ وروي عن عثمان بن عفان أنه كان يقرأ في العشاء بسور من أوساط المفصل نحو سورة المنافقين وأشباهها ‏.‏ وروي عن أصحاب النبي صلى الله عليه وسلم والتابعين أنهم قرءوا بأكثر من هذا وأقل فكأن الأمر عندهم واسع في هذا ‏.‏ وأحسن شيء في ذلك ما روي عن النبي صلى الله عليه وسلم أنه قرأ بالشمس وضحاها والتين والزيتون ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated that his father (Buraidah) said:                     \"Allah's Messenger would recite: By the sun and its brightness, or similar Surah for the latter Isha (prayer).\"",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-435",
      "hadith_no": "435",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، - يعني محمد بن العلاء الهمداني حدثنا زيد بن الحباب، حدثنا عمر بن أبي خثعم، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى بعد المغرب ست ركعات لم يتكلم فيما بينهن بسوء عدلن له بعبادة ثنتى عشرة سنة ‏\"‏ ‏.‏ قال أبو عيسى وقد روي عن عائشة عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى بعد المغرب عشرين ركعة بنى الله له بيتا في الجنة ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث غريب لا نعرفه إلا من حديث زيد بن الحباب عن عمر بن أبي خثعم ‏.‏ قال وسمعت محمد بن إسماعيل يقول عمر بن عبد الله بن أبي خثعم منكر الحديث ‏.‏ وضعفه جدا ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     Allah's Messenger (S) said: \"Whoever prays six Rak'ah after Al-Maghrib, and he does not speak about anything between them, then they will be counted for him as twelve years of worship.\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-482",
      "hadith_no": "482",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا زيد بن حباب العكلي، حدثنا موسى بن عبيدة، حدثني سعيد بن أبي سعيد، مولى أبي بكر بن محمد بن عمرو بن حزم عن أبي رافع، قال قال رسول الله صلى الله عليه وسلم للعباس ‏\"‏ يا عم ألا أصلك ألا أحبوك ألا أنفعك ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ يا عم صل أربع ركعات تقرأ في كل ركعة بفاتحة الكتاب وسورة فإذا انقضت القراءة فقل الله أكبر والحمد لله وسبحان الله ولا إله إلا الله خمس عشرة مرة قبل أن تركع ثم اركع فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد الثانية فقلها عشرا ثم ارفع رأسك فقلها عشرا قبل أن تقوم فتلك خمس وسبعون في كل ركعة وهي ثلاثمائة في أربع ركعات فلو كانت ذنوبك مثل رمل عالج لغفرها الله لك ‏\"‏ ‏.‏ قال يا رسول الله ومن يستطيع أن يقولها في كل يوم قال ‏\"‏ فإن لم تستطع أن تقولها في كل يوم فقلها في جمعة فإن لم تستطع أن تقولها في جمعة فقلها في شهر ‏\"‏ ‏.‏ فلم يزل يقول له حتى قال ‏\"‏ فقلها في سنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث أبي رافع ‏.‏",
      "text_en": " Abu Rafi narrated that :                     Allah's Messenger said to Al-Abbas: \"O uncle! Shall I not give to you, shall I not present to you, shall I not benefit you?\" He said: \"Of course, O Messenger of Allah!\" He said: \"O uncle! Pray four Rak'ah, reciting in each Rak'ah Fatihatil-Kitab and a Surah. When you are finished your recitation then say: Allahu Akbar, wal-hamdulilah, wa Subhan-Allah, [Wa La Ilaha illallah] 'Allah is Greatest, and all praise is due to Allah, and Glorious is Allah, [and there is none worthy of worship except Allah].' fifteen times before you bow. Then bow and say it ten times, then raise your head and say it ten times. Then prostrate [the second time] and say it ten times. Then raise your head and say it ten times before standing. That is seventy-five in every Rak'ah, which is three-hundred in four Rak'ah. If your sins were like a heap of sand then Allah would forgive you.\" He said: \"O Messenger if Allah! Who is able to say that every day?\" He said: \"If you can not say it every day then say it every Friday, and if you are not able to say it every Friday then say it every month.\" And he did not stop saying that until he said: \"Then say it every year.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "12527",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-616",
      "hadith_no": "616",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن الحباب، أخبرنا معاوية بن صالح، حدثني سليم بن عامر، قال سمعت أبا أمامة، يقول سمعت رسول الله صلى الله عليه وسلم يخطب في حجة الوداع فقال ‏\"‏ اتقوا الله ربكم وصلوا خمسكم وصوموا شهركم وأدوا زكاة أموالكم وأطيعوا ذا أمركم تدخلوا جنة ربكم ‏\"‏ ‏.‏ قال فقلت لأبي أمامة منذ كم سمعت من رسول الله صلى الله عليه وسلم هذا الحديث قال سمعته وأنا ابن ثلاثين سنة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Sulaim bin Amir narrated:                     \"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20675",
        "10915",
        "4048"
      ]
    },
    {
      "id": "jami-al-tirmidhi-815",
      "hadith_no": "815",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن أبي زياد الكوفي، حدثنا زيد بن حباب، عن سفيان، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم حج ثلاث حجج حجتين قبل أن يهاجر وحجة بعد ما هاجر ومعها عمرة فساق ثلاثا وستين بدنة وجاء علي من اليمن ببقيتها فيها جمل لأبي جهل في أنفه برة من فضة فنحرها رسول الله صلى الله عليه وسلم وأمر رسول الله صلى الله عليه وسلم من كل بدنة ببضعة فطبخت وشرب من مرقها ‏.‏ قال أبو عيسى هذا حديث غريب من حديث سفيان لا نعرفه إلا من حديث زيد بن حباب ‏.‏ ورأيت عبد الله بن عبد الرحمن روى هذا الحديث في كتبه عن عبد الله بن أبي زياد ‏.‏ قال وسألت محمدا عن هذا فلم يعرفه من حديث الثوري عن جعفر عن أبيه عن جابر عن النبي صلى الله عليه وسلم ‏.‏ ورأيته لا يعد هذا الحديث محفوظا ‏.‏ وقال إنما يروى عن الثوري عن أبي إسحاق عن مجاهد مرسلا ‏.‏",
      "text_en": " Jabir bin Abdullah narrated:                     \"The Prophet performed Hajj three times. He performed Hajj twice before his emigration, and he performed one Hajj after he emigrated, and these were accompanied by Umrah. So he drove sixty-three sacrificial animals (Budn) and Ali came from Yemen with the rest of them, among them was a camel of Abu Jahl that has a ring made of silver in its nose. So he (the Messenger of Allah) slaughtered the, and the Messenger of Allah ordered that a piece of each of them be cooked, and he drank from its broth.\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20012",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1026",
      "hadith_no": "1026",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا زيد بن حباب، حدثنا إبراهيم بن عثمان، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم قرأ على الجنازة بفاتحة الكتاب ‏.‏ قال وفي الباب عن أم شريك ‏.‏ قال أبو عيسى حديث ابن عباس حديث ليس إسناده بذلك القوي ‏.‏ إبراهيم بن عثمان هو أبو شيبة الواسطي منكر الحديث ‏.‏ والصحيح عن ابن عباس قوله من السنة القراءة على الجنازة بفاتحة الكتاب ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet recited Fatihatil-Kitab for a funeral (prayer).\" (Da'if Jiddan)",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20650",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1101",
      "hadith_no": "1101",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك بن عبد الله، عن أبي إسحاق، ح وحدثنا قتيبة، حدثنا أبو عوانة، عن أبي إسحاق، ح وحدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن إسرائيل، عن أبي إسحاق، ح وحدثنا عبد الله بن أبي زياد، حدثنا زيد بن حباب، عن يونس بن أبي إسحاق، عن أبي إسحاق، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نكاح إلا بولي ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وابن عباس وأبي هريرة وعمران بن حصين وأنس ‏.‏",
      "text_en": " Abu Musa narrated that :                     the Messenger of Allah said: \"There is no marriage except with a Wali.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "30367",
        "20469",
        "11049",
        "30160",
        "20033",
        "20311",
        "11049",
        "20650",
        "10846",
        "11049"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1145",
      "hadith_no": "1145",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا زيد بن الحباب، حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن ابن مسعود، أنه سئل عن رجل، تزوج امرأة ولم يفرض لها صداقا ولم يدخل بها حتى مات ‏.‏ فقال ابن مسعود لها مثل صداق نسائها لا وكس ولا شطط وعليها العدة ولها الميراث ‏.‏ فقام معقل بن سنان الأشجعي فقال قضى رسول الله صلى الله عليه وسلم في بروع بنت واشق امرأة منا مثل الذي قضيت ‏.‏ ففرح بها ابن مسعود ‏.‏ قال وفي الباب عن الجراح ‏.‏ حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، وعبد الرزاق، كلاهما عن سفيان، عن منصور، نحوه ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح وقد روي عنه، من غير وجه ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وبه يقول الثوري وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم علي بن أبي طالب وزيد بن ثابت وابن عباس وابن عمر إذا تزوج الرجل المرأة ولم يدخل بها ولم يفرض لها صداقا حتى مات قالوا لها الميراث ولا صداق لها وعليها العدة ‏.‏ وهو قول الشافعي قال لو ثبت حديث بروع بنت واشق لكانت الحجة فيما روي عن النبي صلى الله عليه وسلم ‏.‏ وروي عن الشافعي أنه رجع بمصر بعد عن هذا القول وقال بحديث بروع بنت واشق ‏.‏",
      "text_en": " Alqamah narrated that :                     Ibn Mas'ud was asked about a man who married a woman and he did not stipulate the dowry for her, and he did not enter into her until he died. So Ibn Mas'ud said: \"She gets the same dowry as other women, no less and no more, she has to observe the Iddah, and she gets inheritance.\" So Ma'qil bin Sinan Al-Ashja'I stood and said: \"The Messenger of Allah judged the same as you have judged regarding Birwa bint Washiq, a woman of ours.\" So Ibn Mas'ud was happy about that.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20650",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1301",
      "hadith_no": "1301",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن مالك بن أنس، عن داود بن حصين، عن أبي سفيان، مولى ابن أبي أحمد عن أبي هريرة، أن رسول الله صلى الله عليه وسلم رخص في بيع العرايا فيما دون خمسة أوسق أو كذا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) permitted Al-'Araya in cases less than five Wasq. Or similar.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "20001",
        "11160",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1606",
      "hadith_no": "1606",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي، حدثنا زيد بن الحباب، أخبرنا سفيان الثوري، عن أبي الزبير، عن جابر، عن عمر بن الخطاب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لئن عشت إن شاء الله لأخرجن اليهود والنصارى من جزيرة العرب ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     That the Messenger of Allah (ﷺ) said: \"If I live - if Allah wills - I will expel the Jews and the Christians from the Arabian Peninsula.\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20012",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1626",
      "hadith_no": "1626",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن رافع، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، عن كثير بن الحارث، عن القاسم أبي عبد الرحمن، عن عدي بن حاتم الطائي، أنه سأل رسول الله صلى الله عليه وسلم أى الصدقة أفضل قال ‏\"‏ خدمة عبد في سبيل الله أو ظل فسطاط أو طروقة فحل في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى وقد روي عن معاوية بن صالح هذا الحديث مرسلا وخولف زيد في بعض إسناده ‏.‏ قال وروى الوليد بن جميل هذا الحديث عن القاسم أبي عبد الرحمن عن أبي أمامة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim At-Tai:                     That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20650",
        "20675",
        "11648",
        "212"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1762",
      "hadith_no": "1762",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، والفضل بن موسى، وزيد بن حباب، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث عبد المؤمن بن خالد تفرد به وهو مروزي ‏.‏ وروى بعضهم هذا الحديث عن أبي تميلة عن عبد المؤمن بن خالد عن عبد الله بن بريدة عن أمه عن أم سلمة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is from Al-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, from Umm Salamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, from Umm Salamah is more correct, Abu Tumailah mentioned 'his mother' in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20183",
        "20452",
        "20650",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1785",
      "hadith_no": "1785",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد، حدثنا زيد بن حباب، وأبو تميلة يحيى بن واضح عن عبد الله بن مسلم، عن عبد الله بن بريدة، عن أبيه، قال جاء رجل إلى النبي صلى الله عليه وسلم وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ ثم جاءه وعليه خاتم من صفر فقال ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ ثم أتاه وعليه خاتم من ذهب فقال ‏\"‏ ما لي أرى عليك حلية أهل الجنة ‏\"‏ ‏.‏ قال من أى شيء أتخذه قال ‏\"‏ من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏ وعبد الله بن مسلم يكنى أبا طيبة وهو مروزي ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     From his father who said: \"A man wearing an iron ring came to the Prophet (ﷺ). So he said to him: 'What is this I see on you, jewelry of the people of the Fire ?' Then he came wearing a ring of brass. So he said: 'What is this smell of idols I sense on you ?' Then he came wearing a ring of gold. So he said to him: 'What is this jewelry of the people of Paradise I see on you ?' So he said: 'What should I use then ?' He said: 'From silver, but not its entire weight.\"[Abu 'Eisa said:] This Hadith is Gharib and there are narrations on this topic from 'Abdullah bin 'Amr, and 'Abdullah bin Muslim's Kunyah is Abu Taibah, and he is from Al-Marwaz.",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20650",
        "11872",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1811",
      "hadith_no": "1811",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن حميد، حدثنا زيد بن الحباب، عن أبي خلدة، عن أبي العالية، قال الثوم من طيبات الرزق ‏.‏ وأبو خلدة اسمه خالد بن دينار وهو ثقة عند أهل الحديث وقد أدرك أنس بن مالك وسمع منه وأبو العالية اسمه رفيع هو الرياحي قال عبد الرحمن بن مهدي كان أبو خلدة خيارا مسلما ‏.‏",
      "text_en": " Narrated Abu Khaldah:                     That Abu Al-'Aliyah said: \"garlic is among the good provisions.\" Abu Khaldah's name is Khalid bin Dinar, and he is trustworthy according to the people of Hadith. He saw Anas bin Malik and heard narrations from him. Abu Al-'Aliyah's name is Rufai' and he is Ar-Riyahi. 'Abdur-Rahman bin Mahdi said: \"Abu Khaldah was preferable, reliable.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20650",
        "11618",
        "20033"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2067",
      "hadith_no": "2067",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد بن حميد، حدثنا زيد بن الحباب العكلي، حدثني أبو سلمة الكندي، حدثنا فرقد السبخي، عن مرة بن شراحيل الهمداني، وهو الطيب - عن أبي بكر الصديق، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ملعون من ضار مؤمنا أو مكر به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Abu Bakr As-Siddiq narrated that the  Messenger of Allah said:                     \"Cursed are those who harm a believer, or plot to do so.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20650",
        "28683",
        "14313",
        "11391",
        "2"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2193",
      "hadith_no": "2193",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا زيد بن حباب، عن فائد، مولى عبيد الله بن علي عن مولاه، عبيد الله بن علي عن جدته، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2261-2",
      "hadith_no": "2261",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، أخبرني موسى بن عبيدة، حدثني عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مشت أمتي المطيطياء وخدمها أبناء الملوك أبناء فارس والروم سلط شرارها على خيارها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد رواه أبو معاوية عن يحيى بن سعيد الأنصاري ‏.‏ حدثنا بذلك، محمد بن إسماعيل الواسطي حدثنا أبو معاوية، عن يحيى بن سعيد، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه ‏.‏ ولا يعرف لحديث أبي معاوية عن يحيى بن سعيد عن عبد الله بن دينار عن ابن عمر أصل إنما المعروف حديث موسى بن عبيدة ‏.‏ وقد روى مالك بن أنس هذا الحديث عن يحيى بن سعيد مرسلا ولم يذكر فيه عن عبد الله بن دينار عن ابن عمر ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Dinar, that Ibn 'Umar said:                     \"The Messenger of Allah(s.a.w) said: 'When my Ummah walks in a proud march, and its servants are the children of kings, children of Persians and Romans, the evilest of them will be set over the best of them\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "12527",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2466",
      "hadith_no": "2466",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا بشر بن آدم ابن بنت أزهر السمان، حدثنا زيد بن الحباب، حدثنا أبى بن عباس بن سهل بن سعد، حدثني أبو بكر بن محمد بن عمرو بن حزم، حدثني عبد الله بن عمرو بن عثمان، حدثني خارجة بن زيد بن ثابت، حدثني عبد الرحمن بن أبي عمرة، حدثني زيد بن خالد الجهني، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الشهداء من أدى شهادته قبل أن يسألها ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah(s.a.w)   said:                     \"The best of witnesses is the one who gives his testimony before  being asked  for it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30125",
        "20650",
        "11239",
        "10933",
        "11006",
        "1238",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2329",
      "hadith_no": "2329",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن معاوية بن صالح، عن عمرو بن قيس، عن عبد الله بن بسر، أن أعرابيا، قال يا رسول الله من خير الناس قال ‏\"‏ من طال عمره وحسن عمله ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وجابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " 'Abdullah bin Busr narrated that a Bedouin said:                     \"O Messenger of Allah! Who is the best of the people?\" He said: \"He whose life is long and his deeds are good.\"There are narrations on this topic from Abu Hurairah and Jabir.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "20675",
        "213",
        "3650"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2377",
      "hadith_no": "2377",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي، حدثنا زيد بن حباب، أخبرني المسعودي، حدثنا عمرو بن مرة، عن إبراهيم، عن علقمة، عن عبد الله، قال نام رسول الله صلى الله عليه وسلم على حصير فقام وقد أثر في جنبه فقلنا يا رسول الله لو اتخذنا لك وطاء ‏.‏ فقال ‏\"‏ ما لي وما للدنيا ما أنا في الدنيا إلا كراكب استظل تحت شجرة ثم راح وتركها ‏\"‏ ‏.‏ قال وفي الباب عن عمر وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah narrated :                     \"The Messenger of Allah (s.a.w) was sleeping upon a mat, then he stood, and the mat had left marks on his side. We said: 'O Messenger of Allah! We said: 'O Messenger of Allah! We could get a bed for you.' He said: 'What do I have to do with the world! I am not in the world but as a rider seeking shade under a tree, then he catches his breath and leaves it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20724",
        "11381",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2389",
      "hadith_no": "2389",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، حدثنا عبد الرحمن بن جبير بن نفير الحضرمي، عن أبيه، عن النواس بن سمعان، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن البر والإثم فقال النبي صلى الله عليه وسلم ‏\"‏ البر حسن الخلق والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ‏\"‏ ‏.‏  حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، نحوه إلا أنه قال سألت النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " An-Nawas bin Sama'an narrated that a man came asking the Messenger of Allah (s.a.w) about righteousness and sin. So the Prophet (s.a.w) said:                     \"Righteouness is good behaviour, and sin is what fluctuates in your chest, and you would hate that the people discovered it about you.\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20675",
        "3600"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2687",
      "hadith_no": "2687",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا زيد بن حباب، حدثنا علي بن مسعدة الباهلي، حدثنا قتادة، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ كل ابن آدم خطاء وخير الخطائين التوابون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث علي بن مسعدة عن قتادة ‏.‏",
      "text_en": " Anas narrated that the Prophet (s.a.w) said:                     \"Every son of Adam sins, and the best of the sinners are the repetant.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20650",
        "24321",
        "11019",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3023",
      "hadith_no": "3023",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا زيد بن حباب، أخبرني الضحاك بن عثمان، أخبرني زيد بن أسلم، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينظر الرجل إلى عورة الرجل ولا تنظر المرأة إلى عورة المرأة ولا يفضي الرجل إلى الرجل في الثوب الواحد ولا تفضي المرأة إلى المرأة في الثوب الواحد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abi Sa'eed [Al-Khudri]:                     from his father who said: \"The Messenger of Allah (ﷺ) said: 'A man is not to look at the 'Awrah of a man, and a woman is not to look at the 'Awrah of a woman. A man is not to be alone with a man under one garment, and a woman is not to be alone with a women under one garment.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20504",
        "11163",
        "11879",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3131",
      "hadith_no": "3131",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا زيد بن حباب، عن عمر بن أبي خثعم، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ حم الدخان في ليلة أصبح يستغفر له سبعون ألف ملك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وعمر بن أبي خثعم يضعف ‏.‏ قال محمد وهو منكر الحديث ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Whoever recites Ha Mim Ad-Dukhan during the night, in the morning seventy thousand angels seek forgiveness for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20650",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3132",
      "hadith_no": "3132",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا زيد بن حباب، عن هشام أبي المقدام، عن الحسن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ حم الدخان في ليلة الجمعة غفر له ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وهشام أبو المقدام يضعف ولم يسمع الحسن من أبي هريرة هكذا قال أيوب ويونس بن عبيد وعلي بن زيد ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Whoever recites Ha Mum Ad-Dukhan during Friday night, he shall be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "11016",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3585",
      "hadith_no": "3585",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا زيد بن حباب، حدثنا سلام بن سليمان النحوي أبو المنذر، حدثنا عاصم بن أبي النجود، عن أبي وائل، عن الحارث بن يزيد البكري، قال قدمت المدينة فدخلت المسجد فإذا هو غاص بالناس وإذا رايات سود تخفق وإذا بلال متقلد السيف بين يدى رسول الله صلى الله عليه وسلم قلت ما شأن الناس قالوا يريد أن يبعث عمرو بن العاص وجها فذكر الحديث بطوله نحوا من حديث سفيان بن عيينة بمعناه ‏.‏ قال ويقال له الحارث بن حسان أيضا ‏.‏",
      "text_en": " Narrated Abu Wa'il:                     that Al-Harith bin Yazid Al-Bakri said: \"I arrived in Al-Madinah and entered the Masjid and found it full with the people and I also noticed a black banner raised high, while Bilal was holding a sword before the Messenger of Allah (ﷺ). I said: 'What is the matter with the people?' They said: 'He intends to send 'Amr bin Al-'As somewhere.'\" So he mentioned the Hadith in its entirety, similar in meaning to the narration of Sufyan bin 'Uyainah (#3273). He said: He is also called Al-Harith bin Hassan.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20650",
        "11358",
        "11353"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3647",
      "hadith_no": "3647",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن الصباح البزار، حدثنا زيد بن حباب، أخبرنا سهيل بن عبد الله القطعي، وهو أخو حزم بن أبي حزم القطعي عن ثابت، عن أنس بن مالك، عن رسول الله صلى الله",
      "text_en": " Anas bin Malik narrated that:                     The Messenger of Allah said regarding this Ayah: “He is the One deserving of the Taqwa, and He is the One Who forgives. – he said: ‘Allah, Blessed is He and Most High, said: “I am the most worthy to have Taqwa of, so whoever has Taqwa of Me, not having any god besides Me, then I am most worthy that I forgive him.”",
      "usc_msa_ref": "",
      "chain": [
        "30244",
        "20650",
        "11269",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3375-2",
      "hadith_no": "3375",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن معاوية بن صالح، عن عمرو بن قيس، عن عبد الله بن بسر، رضى الله عنه أن رجلا، قال يا رسول الله إن شرائع الإسلام قد كثرت على فأخبرني بشيء أتشبث به ‏.‏ قال ‏\"‏ لا يزال لسانك رطبا من ذكر الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abdullah bin Busr [may Allah be pleased with him] narrated that:                     A man said: “O Messenger of Allah, indeed, the legislated acts of Islam have become too much for me, so inform me of a thing that I should stick to.” He said: “Let not your tongue cease to be moist with the remembrance of Allah.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "20675",
        "213",
        "3650"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3445-2",
      "hadith_no": "3445",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، أخبرني أسامة بن زيد، عن سعيد المقبري، عن أبي هريرة، رضى الله عنه أن رجلا، قال يا رسول الله إني أريد أن أسافر فأوصني ‏.‏ قال ‏\"‏ عليك بتقوى الله والتكبير على كل شرف ‏\"‏ ‏.‏ فلما أن ولى الرجل قال ‏\"‏ اللهم اطو له الأرض وهون عليه السفر ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏",
      "text_en": " Abu Hurairah [may Allah be pleased with him] narrated that :                     a man said: “O Messenger of Allah, I intend to travel, so advise me.” He said, “Hold fast to the Taqwa of Allah, and (say the) Takbir upon every elevated place.” So when the man turned away he said: “O Allah make near for him the distance, and ease for him the journey (Allahummatwi Lahul-Bu’da Wa Hawwin Alaihis-Safar).”",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "50",
        "11168",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3475-2",
      "hadith_no": "3475",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا جعفر بن محمد بن عمران الثعلبي الكوفي، حدثنا زيد بن حباب، عن مالك بن مغول، عن عبد الله بن بريدة الأسلمي، عن أبيه، قال سمع النبي صلى الله عليه وسلم رجلا يدعو وهو يقول اللهم إني أسألك بأني أشهد أنك أنت الله لا إله إلا أنت الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد ‏.‏ قال فقال ‏\"‏ والذي نفسي بيده لقد سأل الله باسمه الأعظم الذي إذا دعي به أجاب وإذا سئل به أعطى ‏\"‏ ‏.‏ قال زيد فذكرته لزهير بن معاوية بعد ذلك بسنين فقال حدثني أبو إسحاق عن مالك بن مغول ‏.‏ قال زيد ثم ذكرته لسفيان الثوري فحدثني عن مالك ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى شريك هذا الحديث عن أبي إسحاق عن ابن بريدة عن أبيه وإنما أخذه أبو إسحاق الهمداني عن مالك بن مغول وإنما دلسه ‏.‏ وروى شريك هذا الحديث عن أبي إسحاق ‏.‏",
      "text_en": " Abdullah bin Buraidah Al Aslami narrated from his father, who said:                     “The Prophet heard a man supplicating, and he was saying: ‘O Allah, indeed, I ask you by my testifying that You are Allah, there is none worthy of worship except You, the One, As-Samad, the one who does not beget, nor was begotten, and there is none who is like Him (Allahumma Inni As’aluka Bi Anni Ashhadu Annaka Antalllah, La Ilaha Illa Anta Al-Ahadus-Samadu, Alladhi Lam Yalid Wa Lam Yulad, Wa Lam Yakun Lahu Kufuwan Ahad).” He said: “So he said: ‘By the One in Whose Hand is my soul, he has asked Allah by His Greatest Name, the one which of He is called upon by it, He responds, and when He is asked by it, He gives.’”(One of the narrators) Zaid said: “So I mentioned it to Zuhair bin Mu’awiyah years after that, and he said: Abu Ishaq reported to me from Malik bin Mighwal.’” Zaid said: “Then I mentioned it to Sufyan, so he reported it to me from Malik.”",
      "usc_msa_ref": "",
      "chain": [
        "10898",
        "20650",
        "20358"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3509-2",
      "hadith_no": "3509",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا زيد بن حباب، أن حميدا المكي، مولى ابن علقمة حدثه أن عطاء بن أبي رباح حدثه عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مررتم برياض الجنة فارتعوا ‏\"‏ ‏.‏ قلت يا رسول الله وما رياض الجنة قال ‏\"‏ المساجد ‏\"‏ ‏.‏ قلت وما الرتع يا رسول الله قال ‏\"‏ سبحان الله والحمد لله ولا إله إلا الله والله أكبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “When you pass by the gardens of Paradise, then feast.” I said: “O Messenger of Allah, and what are the gardens of Paradise?” He said, “The Masajid.” I said: “And what is feasting, O Messenger of Allah?” He said: “Glory is to Allah, (Subhan Allah)’ and ‘All praise is due to Allah, (Al-Hamdulillah)’ and ‘None has the right to be worshipped but Allah, (La Ilaha Illallah)’ and ‘Allah is the Greatest (Allahu Akbar).’”",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20650",
        "11029",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3553-2",
      "hadith_no": "3553",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، قال وأخبرني سفيان الثوري، عن محمد بن عبد الرحمن بن أبي ليلى، عن الشعبي، عن عبد الرحمن بن أبي ليلى، عن أبي أيوب الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال عشر مرات لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير ‏.‏ كانت له عدل أربع رقاب من ولد إسماعيل ‏\"‏ ‏.‏ قال وقد روي هذا الحديث عن أبي أيوب موقوفا ‏.‏",
      "text_en": " Abu Ayyub Al-Ansari narrated that the Messenger of Allah said:                     “Whoever says ten times: ‘None has the right to be worshipped by Allah, Alone, without partner, to Him belongs all that exists, and to Him belongs the praise, [He gives life and causes death,] and He has power over all things, (La Ilaha Illallah, Wahdahu La Sharika Lahu, Lahul-Mulku Wa Lahul-Hamdu, [Yuhyi Wa Yumitu,] Wa Huwa Ala Kulli Shai’in Qadir)’ it is for him equal to freeing four slaves among the offspring of Isma’il.’”",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20012",
        "11052",
        "11196",
        "33"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3569-2",
      "hadith_no": "3569",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد الله بن نمير، وزيد بن حباب، عن موسى بن عبيدة، عن محمد بن ثابت، عن أبي حكيم، خطمي مولى الزبير عن الزبير بن العوام، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من صباح يصبح العباد فيه إلا ومناد ينادي سبحان الملك القدوس ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب ‏.‏",
      "text_en": " Az-Zubair bin Awwam narrated:                     that the Prophet said: “There is nothing a morning that the slave of Allah reached except that a caller calls out: ‘Glority the King, the Free of Deficiencies. (Sabbihul Malikal-Qaddus)’”",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20331",
        "20650",
        "12527",
        "18895",
        "7"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4055",
      "hadith_no": "4055",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن صباح البزار، حدثنا زيد بن حباب، عن خارجة بن عبد الله بن سليمان بن زيد بن ثابت، أخبرنا يزيد بن رومان، عن عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم جالسا فسمعنا لغطا وصوت صبيان فقام رسول الله صلى الله عليه وسلم فإذا حبشية تزفن والصبيان حولها فقال ‏\"‏ يا عائشة تعالى فانظري ‏\"‏ ‏.‏ فجئت فوضعت لحيى على منكب رسول الله صلى الله عليه وسلم فجعلت أنظر إليها ما بين المنكب إلى رأسه فقال لي ‏\"‏ أما شبعت أما شبعت ‏\"‏ ‏.‏ قالت فجعلت أقول لا لأنظر منزلتي عنده إذ طلع عمر قال فارفض الناس عنها قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأنظر إلى شياطين الإنس والجن قد فروا من عمر ‏\"‏ ‏.‏ قالت فرجعت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Messenger of Allah (ﷺ) was sitting and we heard a scream and the voices of children. So the Messenger of Allah (ﷺ) arose, and it was an Ethiopian woman, prancing around while the children played around her. So he said: 'O 'Aishah, come (and) see.' So I came, and I put my chin upon the shoulder of the Messenger of Allah (ﷺ) and I began to watch her from between his shoulder and his head, and he said to me: 'Have you had enough, have you had enough?'\" She said: \"So I kept saying: 'No,' to see my status with him. Then 'Umar appeared.\" She said: \"So they dispersed.\" She said: \"So the Messenger of Allah (ﷺ) said: 'Indeed I see the Shayatin among men and jinn have run from 'Umar.' She said: 'So I returned.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30244",
        "20650",
        "22047",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4202",
      "hadith_no": "4202",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا زيد بن حباب، حدثنا ميمون أبو عبد الله، حدثنا ثابت، قال قال لي أنس بن مالك يا ثابت خذ عني فإنك لم تأخذ عن أحد أوثق مني إني أخذته عن رسول الله صلى الله عليه وسلم وأخذه رسول الله صلى الله عليه وسلم عن جبريل وأخذه جبريل عن الله تعالى ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث زيد بن حباب ‏.‏",
      "text_en": " Narrated Thabit Al-Bunani:                     \"Anas bin Malik said to me: 'O Thabit, take from me, for indeed you shall not take from one more trustworthy than me. Verily, I took it from the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) took it from Jibra'il, and Jibra'il took it from Allah the Mighty and Sublime.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20650",
        "11269",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4203",
      "hadith_no": "4203",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن ميمون أبي عبد الله، عن ثابت، عن أنس، نحو حديث إبراهيم بن يعقوب ولم يذكر فيه وأخذه النبي صلى الله عليه وسلم عن جبريل ‏.‏",
      "text_en": " Narrated Thabit:                     from Anas, similar to the previous narration of Ibrahim bin Ya'qub, and he did not mention in it: \"And the Prophet (ﷺ) took it from Jibra'il.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "11269"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4315",
      "hadith_no": "4315",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، حدثنا أبو مريم الأنصاري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الملك في قريش والقضاء في الأنصار والأذان في الحبشة والأمانة في الأزد ‏\"‏ ‏.‏ يعني اليمن ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Leadership is among the Quraish, and reasoning and judgment is among the Ansar, and the Adhan is among the Ethiopians, and the trust is among the Al-Azd.\" meaning Yemen.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20650",
        "20675",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-37",
      "hadith_no": "37",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمود بن غيلان، حدثنا زيد بن الحباب، وقبيصة، قالا أنبأنا سفيان، عن الضحاك بن عثمان، عن نافع، عن ابن عمر، قال مر رجل على النبي صلى الله عليه وسلم وهو يبول فسلم عليه فلم يرد عليه السلام ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"A man passed by the Prophet (ﷺ) when he was urinating and greeted him with Salam, but he did not return his greeting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20650",
        "20351",
        "20012",
        "20504",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-149",
      "hadith_no": "149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن علي بن حرب المروزي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن عقبة بن عامر الجهني، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then says: \"Ashhadu an la ilaha ill-Allah was ashhadu anna Muhammadan 'abduhu wa rasuluh (I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is his slave and Messenger),\" eight gates of Paradise will be opened for him, and he may enter through whichever one he wishes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38553",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "189",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-152",
      "hadith_no": "152",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثنا ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم صلى ركعتين يقبل عليهما بقلبه ووجهه وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then prays two Rak'ahs in which his heart and face are focused, Paradise will be his.\"",
      "usc_msa_ref": "",
      "chain": [
        "35153",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-529",
      "hadith_no": "529",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثنا خارجة بن عبد الله بن سليمان بن زيد بن ثابت، قال حدثني الحسين بن بشير بن سلام، عن أبيه، قال دخلت أنا ومحمد بن علي، على جابر بن عبد الله الأنصاري فقلنا له أخبرنا عن صلاة، رسول الله صلى الله عليه وسلم وذاك زمن الحجاج بن يوسف ‏.‏ قال خرج رسول الله صلى الله عليه وسلم فصلى الظهر حين زالت الشمس وكان الفىء قدر الشراك ثم صلى العصر حين كان الفىء قدر الشراك وظل الرجل ثم صلى المغرب حين غابت الشمس ثم صلى العشاء حين غاب الشفق ثم صلى الفجر حين طلع الفجر ثم صلى من الغد الظهر حين كان الظل طول الرجل ثم صلى العصر حين كان ظل الرجل مثليه قدر ما يسير الراكب سير العنق إلى ذي الحليفة ثم صلى المغرب حين غابت الشمس ثم صلى العشاء إلى ثلث الليل أو نصف الليل - شك زيد - ثم صلى الفجر فأسفر ‏.‏",
      "text_en": " Al-Husain bin Bashir bin Sallam narrated that his father said:                      \"Muhammad bin 'Ali and I entered upon Jabir bin 'Abdullah Al-Ansari. We said to him: 'Tell us about the prayer of the Messenger of Allah (ﷺ).' That was at the time of Al-Hajjaj bin Yusuf. He said: 'The Messenger of Allah (ﷺ) came out and prayed Zuhr when the sun had passed its zenith and the shadow (of a thing) was the length of a sandal-strap. Then he prayed 'Asr when the shadow of a man was the length of a sandal-strap plus his height. Then he prayed Maghrib when the sun had set. Then he prayed 'Isha' when the twilight disappeared. Then he prayed Fajr when dawn broke. The next day he prayed Zuhr when a man's shadow was equal to his height. Then he prayed 'Asr when a man's shadow was twice his height, and (the time between the prayer and sunset) lasted as long as it takes a swift rider to reach Dhul-Hulaifah. Then he prayed Maghrib when the sun set, then he prayed 'Isha' when one-third or one-half of the night had passed'\" - (One of the narrators) Zaid, was not sure - \"then he prayed Fajr when it had become bright.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "22047",
        "22038"
      ]
    },
    {
      "id": "sunan-an-nasai-800",
      "hadith_no": "800",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال حدثنا زيد بن الحباب، قال حدثنا أفلح بن سعيد، قال حدثنا بريدة بن سفيان بن فروة الأسلمي، عن غلام، لجده يقال له مسعود فقال مر بي رسول الله صلى الله عليه وسلم وأبو بكر فقال لي أبو بكر يا مسعود ائت أبا تميم - يعني مولاه - فقل له يحملنا على بعير ويبعث إلينا بزاد ودليل يدلنا ‏.‏ فجئت إلى مولاى فأخبرته فبعث معي ببعير ووطب من لبن فجعلت آخذ بهم في إخفاء الطريق وحضرت الصلاة فقام رسول الله صلى الله عليه وسلم يصلي وقام أبو بكر عن يمينه وقد عرفت الإسلام وأنا معهما فجئت فقمت خلفهما فدفع رسول الله صلى الله عليه وسلم في صدر أبي بكر فقمنا خلفه ‏.‏ قال أبو عبد الرحمن بريدة هذا ليس بالقوي في الحديث ‏.‏",
      "text_en": " Buraidah bin Sufyin bin Farwah Al-Aslami narrated that a slave of his grandfather who was called Mas'Od said:                      \"The Messenger of Allah (ﷺ) and Abu Bakr passed by me and Abu Bakr said to me: '0 Mas'ud, go to Abu Tamim' - meaning the man from whom he had been freed - 'and tell him to give us a camel so that wecould ride, and let him send us some food and a guide to show us the way.' So I went to my former master and told him the same, and he sent with me a camel and vessels of milk, and I brought them via a secret route. Then the time for prayer came and the Messenger of Allah (ﷺ) stood up and prayed, and Abu Bakr stood to his right. I had come to know about Islam and I was with them, so I came and stood behind them. So the Messenger of Allah (ﷺ) pushed Abu Bakr on the chest (to make him move backward) and we stood behind him.\" Abu 'Abdur-Rahman (An-Nasai)said: (This) Buraidah is not a reliable narrator of Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20650",
        "20501",
        "12025"
      ]
    },
    {
      "id": "sunan-an-nasai-900",
      "hadith_no": "900",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثني جعفر بن سليمان، عن علي بن علي، عن أبي المتوكل، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم إذا افتتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"When the Messenger of Allah (ﷺ) started to pray, he would say: 'Subhanakallahumma, wa bihamdika tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuk (Glory and praise be to You, O Allah. Blessed be Your name and exalted be Your majesty, there is none worthy of worship except You.)\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "20532",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-923",
      "hadith_no": "923",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثني أبو الزاهرية، قال حدثني كثير بن مرة الحضرمي، عن أبي الدرداء، سمعه يقول سئل رسول الله صلى الله عليه وسلم أفي كل صلاة قراءة قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال رجل من الأنصار وجبت هذه ‏.‏ فالتفت إلى وكنت أقرب القوم منه فقال ما أرى الإمام إذا أم القوم إلا قد كفاهم ‏.‏ قال أبو عبد الرحمن هذا عن رسول الله صلى الله عليه وسلم خطأ إنما هو قول أبي الدرداء ولم يقرأ هذا مع الكتاب ‏.‏",
      "text_en": " Kathir bin Murrah Al-Hadrami narrated that :                     He heard Abu Ad-Darda say: \"The Messenger of Allah (ﷺ) was asked: 'Is there recitation in every prayer?' He said: 'Yes.' A man among the Ansar said: 'Is that obligatory?' He (Abu Ad-Darda) turned to me (Kathir), as I was closest of the people to him, and said: 'I think that if the Imam leads the people, that is sufficient for them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20650",
        "20675",
        "10901",
        "19940",
        "37"
      ]
    },
    {
      "id": "sunan-an-nasai-1606",
      "hadith_no": "1606",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني معاوية بن صالح، قال حدثني نعيم بن زياد أبو طلحة، قال سمعت النعمان بن بشير، على منبر حمص يقول قمنا مع رسول الله صلى الله عليه وسلم في شهر رمضان ليلة ثلاث وعشرين إلى ثلث الليل الأول ثم قمنا معه ليلة خمس وعشرين إلى نصف الليل ثم قمنا معه ليلة سبع وعشرين حتى ظننا أن لا ندرك الفلاح وكانوا يسمونه السحور ‏.‏",
      "text_en": " Nu'aim bin Ziyad Abu Talhah said:                     \"I heard An-Nu'man bin Bashir on the minbar in Hims saying: \"We prayed Qiyam with the Messenger of Allah (ﷺ) during Ramadan on the night of the twenty-third until one-third of the night had passed, then we prayed Qiyam with him on the night of the twenty-fifth until one-half of the night had passed, then we prayed Qiyam with him on the night of the twenty-seventh until we thought that we would miss Al-Falah- that is what they used to call suhur.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "20675",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-1617",
      "hadith_no": "1617",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عصمة بن الفضل، قال حدثنا زيد بن الحباب، عن معاوية بن صالح، قال حدثنا الأزهر بن سعيد، عن عاصم بن حميد، قال سألت عائشة بما كان رسول الله صلى الله عليه وسلم يستفتح قيام الليل قالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان رسول الله صلى الله عليه وسلم يكبر عشرا ويحمد عشرا ويسبح عشرا ويهلل عشرا ويستغفر عشرا ويقول ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني أعوذ بالله من ضيق المقام يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Asim bin Humaid said:                     \"I asked 'Aishah with what did he- meaning the Prophet (ﷺ)- start Qiyam Al-Lail? She said: 'You have asked me something which no one before you has asked. The Messenger of Allah (ﷺ) used to say the takbir ten times, the tahmid ten times, the tasbih ten times, and the tahlil ten times, and pray for forgiveness ten times, and say: Allahummaghfirli, wahdini, warzuqni wa 'afini. A'udhu billahi min diqil-maqami yawmal-qiyamah (O Allah, forgive me, guide me, grant me provision and good health. I seek refuge with Allah from the difficulty of standing on the Day of Resurrection.)\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20675"
      ]
    },
    {
      "id": "sunan-an-nasai-1799",
      "hadith_no": "1799",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا زيد بن حباب، قال حدثني محمد بن سعيد الطائفي، قال حدثنا عطاء بن أبي رباح، عن يعلى بن أمية، قال قدمت الطائف فدخلت على عنبسة بن أبي سفيان وهو بالموت فرأيت منه جزعا فقلت إنك على خير ‏.‏ فقال أخبرتني أختي أم حبيبة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى ثنتى عشرة ركعة بالنهار أو بالليل بنى الله عز وجل له بيتا في الجنة ‏\"‏ ‏.‏ خالفهم أبو يونس القشيري ‏.‏",
      "text_en": " It was narrated that Ya'la bin Umayyah said:                     \"I came to At-Ta'if and entered upon Anbasah bin Abi Sufyan when he was dying. I saw that he was afraid so I said: 'You will be fine.' He said: 'My sister Umm Habibah told me that the Messenger of Allah (ﷺ) said: Whoever prays twelve rak'ahs by day or by night, Allah, the Mighty and Sublime, will build for him a house in Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20650",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-2359",
      "hadith_no": "2359",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني ثابت بن قيس الغفاري، قال حدثني أبو سعيد المقبري، قال حدثني أبو هريرة، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم كان يسرد الصوم فيقال لا يفطر ويفطر فيقال لا يصوم ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid:                     That the Messenger of Allah used to fast continually and it ws said that he would not break his fast, and he used not to fast and it was said that he would not fast.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "239",
        "11212",
        "13",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-3117",
      "hadith_no": "3117",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عصمة بن الفضل، قال حدثنا زيد بن حباب، عن عبد الرحمن بن شريح، قال سمعت محمد بن شمير الرعيني، يقول سمعت أبا علي التجيبي، أنه سمع أبا ريحانة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ حرمت عين على النار سهرت في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " Abu 'Ali At-Tujibi (said) that he heard Abu Raihanah say:                      \"I heard the Messenger of Allah (ﷺ) say: 'The eye that stays awake in the cause of Allah will be forbidden to the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20438",
        "16093",
        "10696"
      ]
    },
    {
      "id": "sunan-an-nasai-3524",
      "hadith_no": "3524",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا زيد بن الحباب، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن ابن مسعود، أنه سئل عن رجل، تزوج امرأة ولم يفرض لها صداقا ولم يدخل بها حتى مات قال ابن مسعود لها مثل صداق نسائها لا وكس ولا شطط وعليها العدة ولها الميراث ‏.‏ فقام معقل بن سنان الأشجعي فقال قضى فينا رسول الله صلى الله عليه وسلم في بروع بنت واشق - امرأة منا - مثل ما قضيت ‏.‏ ففرح ابن مسعود رضى الله عنه ‏.‏",
      "text_en": " It was narrated from Ibn Mas'ud, that he was asked about a man who married a woman, but did not name a Mahr or consummate the marriage before he died. Ibn Mas'ud said:                      \"She should have a Mahr like that of women like her, no less and no more; she has to observe the 'Iddah, and she is entitled to inherit.\" Ma'qil bin Sinan Al-Ashja'i stood up and said: \"The Messenger of Allah passed a similar judgment among us concerning Birwa' bint Washiq.\" And Ibn Masud rejoiced at that.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20650",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5195",
      "hadith_no": "5195",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثني عبد الله بن مسلم، - من أهل مرو أبو طيبة - قال حدثنا عبد الله بن بريدة، عن أبيه، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ فطرحه ثم جاءه وعليه خاتم من شبه فقال ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ فطرحه قال يا رسول الله من أى شىء أتخذه قال ‏\"‏ من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Buraidah narrated from his father that:                     A man came to the Prophet [SAW] and he was wearing an iron ring. He said: \"Why do I see you wearing the jewelry of the people of Hell?\" He threw it away, then he came and he was wearing a brass ring. He said: \"Why do I notice the stench of idols from you?\" So he threw it away, and said: \"O Messenger of Allah, what should I use?\" He said: \"Silver, but it should not equal a Mithqal.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5535",
      "hadith_no": "5535",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا زيد بن الحباب، أن معاوية بن صالح، حدثه وحدثني أزهر بن سعيد، - يقال له الحرازي شامي عزيز الحديث - عن عاصم بن حميد قال سألت عائشة بما كان رسول الله صلى الله عليه وسلم يفتتح قيام الليل قالت سألتني عن شىء ما سألني عنه أحد كان يكبر عشرا ويسبح عشرا ويستغفر عشرا ويقول ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني ‏\"‏ ‏.‏ ويتعوذ من ضيق المقام يوم القيامة ‏.‏",
      "text_en": " It was narrated that 'Asim bin Humaid said:                     \"I asked 'Aishah with what the Messenger of Allah [SAW] would start Qiyam Al-Lail. She said: 'You have asked me about something that no one else has asked me about. He used to say Allahu Akbar ten times, and Subhan-Allah ten times, and Istaghfir-Allah ten times, and he would say, Allahummaghfirli, wahdini, warzuqni, wa'afini (O Allah, forgive me, guide me, grant me provision and give me good health,) and he would seek refuge from the difficulty of the standing on the Day of Resurrection.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20650",
        "20675",
        "18018"
      ]
    },
    {
      "id": "sunan-ibn-majah-12",
      "hadith_no": "12",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن معاوية بن صالح، حدثني الحسن بن جابر، عن المقدام بن معديكرب الكندي، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ يوشك الرجل متكئا على أريكته يحدث بحديث من حديثي فيقول بيننا وبينكم كتاب الله عز وجل فما وجدنا فيه من حلال استحللناه وما وجدنا فيه من حرام حرمناه ‏.‏ ألا وإن ما حرم رسول الله  صلى الله عليه وسلم  مثل ما حرم الله ‏\"‏ ‏.‏",
      "text_en": " Miqdam bin Ma'dikarib Al-Kindi narrated that:                     The Messenger of Allah (ﷺ) said: \"Soon there will come a time that a man will be reclining on his pillow, and when one of my Ahadith is narrated he will say: 'The Book of Allah is (sufficient) between us and you. Whatever it states is permissible, we will take as permissible, and whatever it states is forbidden, we will take as forbidden.' Verily, whatever the Messenger of Allah (ﷺ) has forbidden is like that which Allah has forbidden.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675"
      ]
    },
    {
      "id": "sunan-ibn-majah-214",
      "hadith_no": "214",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا كثير بن عبد الله بن عمرو بن عوف المزني، حدثني أبي، عن جدي، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أحيا سنة من سنتي فعمل بها الناس كان له مثل أجر من عمل بها لا ينقص من أجورهم شيئا ومن ابتدع بدعة فعمل بها كان عليه أوزار من عمل بها لا ينقص من أوزار من عمل بها شيئا ‏\"‏ ‏.‏",
      "text_en": " Kathir bin 'Abdullah bin 'Amr bin 'Awf Al-Muzani said:                     \"My father told me narrating from my grandfather, that the Messenger of Allah said: 'Whoever revives a Sunnah of mine, which people then act upon, will have a reward equivalent to that of those who act upon it, without that detracting from their reward in the slightest. And whoever introduces an innovation (Bid'ah) that is acted upon, will have a burden of sins equivalent to that of those who act upon it, withot that detracting from the burden of those who act upon it in the slightest.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650"
      ]
    },
    {
      "id": "sunan-ibn-majah-397",
      "hadith_no": "397",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، أنبأنا مالك بن أنس، أخبرني إسحاق بن عبد الله بن أبي طلحة الأنصاري، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب، وكانت، تحت بعض ولد أبي قتادة أنها صبت لأبي قتادة ماء يتوضأ به فجاءت هرة تشرب فأصغى لها الإناء فجعلت أنظر إليه فقال يا ابنة أخي أتعجبين قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إنها ليست بنجس هي من الطوافين أو الطوافات ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kabshah bint Ka'b, who was married to one of the sons of Ab Qatadah, that:                     She poured water for Abu Qatadah to perform ablution. A cat came and drank the water, and he tilted the vessel for it. She started looking at it (in surprise) and he said: \"O daughter of my brother, do you find it strange? The Messenger of Allah said: 'They (cats) are not impure, they are of those who go around among you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20001",
        "11151",
        "19957"
      ]
    },
    {
      "id": "sunan-ibn-majah-423",
      "hadith_no": "423",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا بشر بن آدم، حدثنا زيد بن الحباب، حدثني الوليد بن عقبة، حدثني حذيفة بن أبي حذيفة الأزدي، عن صفوان بن عسال، قال صببت على النبي  صلى الله عليه وسلم  الماء في السفر والحضر في الوضوء ‏.‏",
      "text_en": " It was narrated that Safwan bin 'Assal said:                     \"I poured water for the Prophet on journeys and as a resident, when he performed ablution.\"",
      "usc_msa_ref": "",
      "chain": [
        "30125",
        "20650",
        "18169",
        "4143"
      ]
    },
    {
      "id": "sunan-ibn-majah-429",
      "hadith_no": "429",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا زيد بن الحباب، ح وحدثنا محمد بن بشار، حدثنا أبو عامر العقدي، ح وحدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، قالوا حدثنا كثير بن زيد، عن ربيح بن عبد الرحمن بن أبي سعيد، عن أبيه، عن أبي سعيد، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     The Messenger of Allah said: \"There is no ablution for one who does not mention the Name of Allah (before doing it).\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "30160",
        "20443",
        "30242",
        "20355",
        "22171",
        "22055",
        "11879",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-443",
      "hadith_no": "443",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، وداود بن عبد الله، قالا حدثنا مالك بن أنس، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من توضأ فليستنثر ومن استجمر فليوتر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever performs ablution, let him clean his nose, and whoever uses pebbles to clean himself after defecating, let him use an odd number.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "11333",
        "20001",
        "11013",
        "11027",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-506",
      "hadith_no": "506",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن عبد الرحمن، حدثنا الحسين بن علي، وزيد بن الحباب، ح وحدثنا محمد بن يحيى، حدثنا أبو نعيم، قالوا حدثنا عمرو بن عبد الله بن وهب أبو سليمان النخعي، قال حدثني زيد العمي، عن أنس بن مالك، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من توضأ فأحسن الوضوء ثم قال ثلاث مرات أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله فتح له ثمانية أبواب الجنة من أيها شاء دخل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     The Prophet said: \"Whoever performs ablution and does it well, then says three times: 'Ashhadu an la ilaha illallah wahdahu la sharika lahu, wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (I bear witness that none has the right to be worshipped but Allah alone, with no partner, and I bear witness that Muhammed is His slave and His Messenger),' eight gates of Paradise will be opened for him; whichever one he wants he may enter.\" (Da'if)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20650",
        "11222",
        "20348",
        "14135",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-598",
      "hadith_no": "598",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قال حدثنا زيد بن الحباب، قال حدثنا عمر بن عبد الله بن أبي خثعم الثمالي، قال حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قالوا يا رسول الله ما الطهور على الخفين قال ‏\"‏ للمسافر ثلاثة أيام ولياليهن وللمقيم يوم وليلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"They said: 'O Messenger of Allah! What about the purification of the leather socks?' He said: 'For the traveler it is three days and nights, and for the resident it is one day and one night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20650",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-660",
      "hadith_no": "660",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا بشر بن آدم، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن السفر بن نسير، عن يزيد بن شريح، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  نهى أن يصلي الرجل وهو حاقن ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     The Messenger of Allah forbade a man to perform prayer when he was suppressing (the urge to urinate or defecate).",
      "usc_msa_ref": "",
      "chain": [
        "30125",
        "20650",
        "20675",
        "18366",
        "19173",
        "405"
      ]
    },
    {
      "id": "sunan-ibn-majah-706",
      "hadith_no": "706",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن الضحاك بن عثمان، حدثنا زيد بن أسلم، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا تنظر المرأة إلى عورة المرأة ولا ينظر الرجل إلى عورة الرجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abu Sa'eed Al-Khudri from his father that:                     The Messenger of Allah said: \"No woman should look at the nakedness of another woman, and no man should look at the nakedness of another man.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20504",
        "11163",
        "11879",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-711",
      "hadith_no": "711",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا ابن وهب، ح وحدثنا ابن حميد، حدثنا زيد بن الحباب، قالا حدثنا ابن لهيعة، عن أبي الزبير، عن جابر، عن عمر بن الخطاب، قال رأى رسول الله  صلى الله عليه وسلم  رجلا توضأ فترك موضع الظفر على قدمه فأمره أن يعيد الوضوء والصلاة ‏.‏ قال فرجع ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     \"The Messenger of Allah saw a man performing ablution and he missed a spot the size of a fingernail on his foot. He commanded him to repeat the ablution and his prayer, so he did.\"",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20650",
        "20624",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-720",
      "hadith_no": "720",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، وأبو بكر بن أبي شيبة قالا حدثنا زيد بن الحباب، عن مالك بن أنس، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا سمعتم النداء فقولوا كما يقول المؤذن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah said: 'When you hear the call (to prayer), say what the Mu'adh-dhin says.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30201",
        "20650",
        "20001",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-770",
      "hadith_no": "770",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا عبد الملك بن ربيع بن سبرة بن معبد الجهني، أخبرني أبي، عن أبيه، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يصلى في أعطان الإبل ويصلى في مراح الغنم ‏\"‏ ‏.‏",
      "text_en": " 'Abdul-Malik bin Rabi' bin Sabrah bin Ma'bad Al-Juhani said:                     \"My father told me, from his father that the Messenger of Allah said: 'Do not perform prayer in the camels' resting-places, and perform prayer in the sheep's resting-places.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650"
      ]
    },
    {
      "id": "sunan-ibn-majah-853",
      "hadith_no": "853",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثني جعفر بن سليمان الضبعي، حدثني علي بن علي الرفاعي، عن أبي المتوكل، عن أبي سعيد الخدري، قال كان رسول الله  صلى الله عليه وسلم  يستفتح صلاته يقول ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) used to start his prayer by saying: ‘Subhanaka Allahummawabi hamdika, wa tabarakas-muka, wa ta’ala jadduka, wa la ilahaghairuka (Glory and praise be to You, O Allah, blessed be Your Nameand exalted be Your majesty, none has the right to be worshipped butyou).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20532",
        "20716",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-874",
      "hadith_no": "874",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، حدثنا ربيعة بن يزيد، عن قزعة، قال سألت أبا سعيد الخدري عن صلاة، رسول الله  صلى الله عليه وسلم  فقال ليس لك في ذلك خير ‏.‏ قلت بين رحمك الله ‏.‏ قال كانت الصلاة تقام لرسول الله  صلى الله عليه وسلم  الظهر فيخرج أحدنا إلى البقيع فيقضي حاجته ويجيء فيتوضأ فيجد رسول الله  صلى الله عليه وسلم  في الركعة الأولى من الظهر ‏.‏",
      "text_en": " It wasnarrated that Qaza’ah said:                      “I asked Abu Sa’eed Al-Khudriaboutthe prayer of the Messenger of Allah (ﷺ). He said: ‘There isnothing good in that for you.’* I said: ‘Explain it, may Allahhavemercy on you.’ He said: ‘The Iqamah would be given for theZuhr prayerfor the Messenger of Allah (ﷺ), then one of us would goout to Al-Baqi’, relieve himself, then come back and performablution, and hewould find the Messenger of Allah (ﷺ) still in thefirst Rak’ah ofZuhr.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1012",
      "hadith_no": "1012",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا زيد بن الحباب، حدثني أبو المقدام، عن محمد بن كعب، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  أن يصلى خلف المتحدث والنائم ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)forbade performing prayer behind one who is engaged in conversationorone who is sleeping.”",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20650",
        "11221",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1418",
      "hadith_no": "1418",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن معاوية بن صالح، حدثني أزهر بن سعيد، عن عاصم بن حميد، قال سألت عائشة ماذا كان النبي  صلى الله عليه وسلم  يفتتح به قيام الليل قالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان يكبر عشرا ويحمد عشرا ويسبح عشرا ويستغفر عشرا ويقول ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني ‏\"‏ ‏.‏ ويتعوذ من ضيق المقام يوم القيامة ‏.‏",
      "text_en": " It wasnarrated that ‘Asim bin Humaid said:                      “I asked ‘Aishah: ‘Withwhat did the Prophet (ﷺ) start voluntary prayers?’ She said: ‘Youhave asked me about something which no one has asked before. He usedto say Allahu Akbar ten times, and Al-Hamdu Lillah ten times andSubhan Allah ten times, and he would say Allahumma aghfirli wahdini,warzuqni, wa ‘afini (O Allah, forgive me, guide me, grant meprovisionand give me good health),” and he would seek refuge fromthedifficulty of the standing on the Day of Resurrection.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "18018"
      ]
    },
    {
      "id": "sunan-ibn-majah-1436",
      "hadith_no": "1436",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، وأبو عمر حفص بن عمر قالا حدثنا زيد بن الحباب، حدثني عمر بن أبي خثعم اليمامي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى ست ركعات بعد المغرب لم يتكلم بينهن بسوء عدلت له عبادة اثنتى عشرة سنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Whoever prays six Rak’ah after the Maghrib and does notspeakevil between them, they will be made equivalent to twelveyears’worship.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20650",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1449",
      "hadith_no": "1449",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى بن عبد الرحمن أبو عيسى المسروقي، حدثنا زيد بن الحباب، حدثنا موسى بن عبيدة، حدثني سعيد بن أبي سعيد، مولى أبي بكر بن عمرو بن حزم عن أبي رافع، قال قال رسول الله  صلى الله عليه وسلم  للعباس ‏\"‏ يا عم ألا أحبوك ألا أنفعك ألا أصلك ‏\"‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ تصلي أربع ركعات تقرأ في كل ركعة بفاتحة الكتاب وسورة فإذا انقضت القراءة فقل سبحان الله والحمد لله ولا إله إلا الله والله أكبر خمس عشرة مرة قبل أن تركع ثم اركع فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد فقلها عشرا ثم ارفع رأسك فقلها عشرا قبل أن تقوم فتلك خمس وسبعون في كل ركعة وهي ثلاثمائة في أربع ركعات فلو كانت ذنوبك مثل رمل عالج غفرها الله لك ‏\"‏ ‏.‏ قال يا رسول الله ومن لم يستطع يقولها في يوم قال ‏\"‏ قلها في جمعة فإن لم تستطع فقلها في شهر ‏\"‏ ‏.‏ حتى قال ‏\"‏ فقلها في سنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Rafi’ said:                      “The Messenger of Allah (ﷺ)saidto ‘Abbas: ‘O uncle, shall I not give you a gift, shall I notbenefit you, shall I not uphold my ties of kinship with you?’ Hesaid:‘Of course, O Messenger of Allah.’ He said: ‘Pray fourRak’ah, andrecite in each Rak’ah the Opening of the Book(Al-Fatihah) and aSurah. When you have finished reciting, say:Subhan-Allah wal-hamduLillah wa la ilaha illallah wa Allahu Akbar(Glory is to Allah, praiseis to Allah, none has the right to beworshipped but Allah and Allahis the Most Great) fifteen timesbefore you bow in Ruku’. Then bow andsay it ten times; then raiseyour head and say it ten times; thenprostrate and say it ten times;then raise your head and say it tentimes; then prostrate and say itten times; then raise your head andsay it ten times before you standup. That wil be seventy-five timesin each Rak’ah and three hundredtimes in the four Rak’ah, and even ifyour sins are like the grainsof sand, Allah will forgive you forthem.’ He said: ‘O Messengerof Allah, what if someone cannot say itin one day?’ He said: ‘Thensay it once in a week; if you cannot, thensay it once in a month’until he said: ‘Once in a year.’”",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "12527",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-1562",
      "hadith_no": "1562",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا زيد بن الحباب، حدثنا إبراهيم بن عثمان، عن الحكم، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قرأ على الجنازة بفاتحة الكتاب ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) recited theOpeningof the Book (Al-Fatihah) in the funeral prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20650",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1626",
      "hadith_no": "1626",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا موسى بن عبيدة، حدثني سعيد بن أبي سعيد، عن الأدرع السلمي، قال جئت ليلة أحرس النبي  صلى الله عليه وسلم  فإذا رجل قراءته عالية فخرج النبي  صلى الله عليه وسلم  فقلت يا رسول الله هذا مراء ‏.‏ قال فمات بالمدينة ففرغوا من جهازه فحملوا نعشه فقال النبي  صلى الله عليه وسلم  ‏\"‏ ارفقوا به رفق الله به إنه كان يحب الله ورسوله ‏\"‏ ‏.‏ قال وحفر حفرته فقال ‏\"‏ أوسعوا له وسع الله عليه ‏\"‏ ‏.‏ فقال بعض أصحابه يا رسول الله لقد حزنت عليه ‏.‏ فقال ‏\"‏ أجل إنه كان يحب الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Adra’ As-Sulami said:                      “I came one night to guardthe Prophet (ﷺ), and there was a man reciting loudly. The Prophet(ﷺ) came out and I said: ‘O Messenger of Allah, this man isshowingoff.’ Then he died in Al-Madinah, and they finishedpreparing him,then they carried his dead body. The Prophet (ﷺ)said: ‘Be gentlewith him, may Allah be gentle with him, for heloved Allah and HisMessenger.’ Then his grave was dug and he (theProphet (ﷺ)) said:‘Make it spacious for him, and may Allah makeit spacious for him.’Some of his Companions said: ‘O Messengerof Allah, you are grievingfor him.’ He said: ‘Yes indeed, for heloved Allah and HisMessenger.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "12527",
        "11168"
      ]
    },
    {
      "id": "sunan-ibn-majah-1717",
      "hadith_no": "1717",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن شعبة، عن منصور، عن سالم بن أبي الجعد، عن أبي سلمة، عن أم سلمة، قالت كان رسول الله  صلى الله عليه وسلم  يصل شعبان برمضان ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)usedto join Sha’ban to Ramadan.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20020",
        "11067",
        "11342",
        "10567",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-2374",
      "hadith_no": "2374",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، حدثني سعيد بن هانئ، قال سمعت العرباض بن سارية، يقول كنت عند النبي  صلى الله عليه وسلم  فقال أعرابي اقضني بكري ‏.‏ فأعطاه بعيرا مسنا فقال الأعرابي يا رسول الله هذا أسن من بعيري ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ خير الناس خيرهم قضاء ‏\"‏ ‏.‏",
      "text_en": " Sa'eed bin Hani' said:                     \"I heard 'Irbad bin Sariyah say: 'I was with the Prophet (ﷺ) and a Bedouin said: \"Pay me back for my young camel, and he gave him an older (i.e., better) camel.\" He said: 'O Messenger of Allah! It is older (i.e., better) than my camel.' The Messenger of Allah (ﷺ) said: 'The best of people are those who are best in repaying.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "5172"
      ]
    },
    {
      "id": "sunan-ibn-majah-2364-2",
      "hadith_no": "2364",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن عبد الرحمن الجعفي، قالا حدثنا زيد بن الحباب العكلي، أخبرني أبى بن عباس بن سهل بن سعد الساعدي، حدثني أبو بكر بن عمرو بن حزم، حدثني محمد بن عبد الله بن عمرو بن عثمان بن عفان، حدثني خارجة بن زيد بن ثابت، أخبرني عبد الرحمن بن أبي عمرة الأنصاري، أنه سمع زيد بن خالد الجهني، يقول إنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الشهود من أدى شهادته قبل أن يسألها ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani said that he heard the Messenger of Allah (ﷺ) say:                     “The best of witnesses is the one who gives his testimony before he is asked for it.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "14346",
        "20650",
        "22187",
        "11006",
        "1238"
      ]
    },
    {
      "id": "sunan-ibn-majah-2848",
      "hadith_no": "2848",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن موسى بن عبيدة، حدثني يحيى بن حرب، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال لما نزلت آية اللعان قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة ألحقت بقوم من ليس منهم فليست من الله في شىء ولن يدخلها جنته وأيما رجل أنكر ولده وقد عرفه احتجب الله منه يوم القيامة وفضحه على رءوس الأشهاد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “Then the Verse of Li’an wasrevealed, the Messenger of Allah (ﷺ) said: ‘Any woman whoattributedher child to people to whom he does not belong, then shehas norelation to (the religion of) Allah, and she will never enterParadise, and any man who rejects his child, while he recognizes him,Allah will screen Himself from him on the Day of Resurrection anddisgrace him before the witnesses.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "12527",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2936",
      "hadith_no": "2936",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن ابن لهيعة، أخبرني يزيد بن أبي حبيب، عن لهيعة بن عقبة، قال سمعت أبا الورد، صاحب النبي صلى الله عليه وسلم يقول إياكم والسرية التي إن لقيت فرت وإن غنمت غلت ‏.‏",
      "text_en": " It wasnarrated that Lahi’ah bin ‘Uqbah said:                      “I heard Abul-Ward, theCompanion of the Messenger of Allah (ﷺ), say: ‘Beware of thetroopwhich, when it meets (the enemy) it flees, and when it takesspoils ofwar, it steals from it.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20624",
        "11411"
      ]
    },
    {
      "id": "sunan-ibn-majah-3242",
      "hadith_no": "3242",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا عبد الله بن عياش، عن عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من كان له سعة ولم يضح فلا يقربن مصلانا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever can afford it, but does not offer a sacrifice, let himnotcome near our prayer place.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "778",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3314",
      "hadith_no": "3314",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن معاوية بن صالح، حدثني الحسن بن جابر، عن المقدام بن معديكرب الكندي، أن رسول الله  صلى الله عليه وسلم  حرم أشياء حتى ذكر الحمر الإنسية ‏.‏",
      "text_en": " It wasnarrated from Miqdam bin Ma’dikarib Al-Kindi that theMessenger ofAllah (ﷺ) forbade several things, until he mentioned(the meat of)domesticated donkeys.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675"
      ]
    },
    {
      "id": "sunan-ibn-majah-3446",
      "hadith_no": "3446",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو كريب، حدثنا زيد بن الحباب، عن جعفر بن برد الراسبي، حدثتني مولاتي أم سالم الراسبية، قالت سمعت عائشة، تقول كان رسول الله  صلى الله عليه وسلم  إذا أتي بلبن قال ‏\"‏ بركة أو بركتان ‏\"‏ ‏.‏",
      "text_en": " I heard‘Aishah say:                      “The Messenger of Allah (ﷺ) would say, whenmilkwas brought to him: ‘A blessing,’ or ‘Two blessings.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3561",
      "hadith_no": "3561",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا زيد بن الحباب، حدثنا مندل بن علي، عن محمد بن إسحاق، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، قال كان لرسول الله  صلى الله عليه وسلم  قدح من قوارير يشرب فيه ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)hada glass cup from which he would drink.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20650",
        "25314",
        "11107",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3578",
      "hadith_no": "3578",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا علي بن سلمة، حدثنا زيد بن الحباب، حدثنا سفيان، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ عليكم بالشفاءين العسل والقرآن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                     “You should take the two that bring healing: Honey and theQur’an.”",
      "usc_msa_ref": "",
      "chain": [
        "38402",
        "20650",
        "20012",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3631",
      "hadith_no": "3631",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا فائد، مولى عبيد الله بن علي بن أبي رافع حدثني مولاى، عبيد الله حدثتني جدتي، سلمى أم رافع مولاة رسول الله  صلى الله عليه وسلم  قالت كان لا يصيب النبي  صلى الله عليه وسلم  قرحة ولا شوكة إلا وضع عليه الحناء ‏.‏",
      "text_en": " SalmaUmm Rafi’, the freed slave woman of the Messenger of Allah(ﷺ),said:                      “The Prophet (ﷺ) did not suffer any injury or thorn-prickbut he would apply henna to it.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3731",
      "hadith_no": "3731",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو عامر عبد الله بن عامر بن براد بن يوسف بن أبي بردة بن أبي موسى الأشعري، حدثنا زيد بن الحباب، حدثنا حسين بن واقد، قاضي مرو حدثني عبد الله بن بريدة، أن أباه، حدثه قال رأيت رسول الله  صلى الله عليه وسلم  يخطب فأقبل حسن وحسين عليهما قميصان أحمران يعثران ويقومان فنزل النبي  صلى الله عليه وسلم  فأخذهما فوضعهما في حجره فقال ‏\"‏ صدق الله ورسوله ‏{إنما أموالكم وأولادكم فتنة}‏ رأيت هذين فلم أصبر ‏\"‏ ‏.‏ ثم أخذ في خطبته ‏.‏",
      "text_en": " ‘Abdullah bin Buraidah narrated that his father told him:                      I saw theMessenger of Allah (ﷺ) delivering a sermon, and Hasan and Husaincame forward, wearing red shirts, stumbling and getting up again. TheProphet (ﷺ) stepped down, picked them up and put them in his lap.Then he said: “Allah and His Messenger have spoken the truth. ‘Yourwealth and your children are only a trial.’ [64:15] I saw these twoand I could not be patient. Then he resumed his sermon.”",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3786",
      "hadith_no": "3786",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا يحيى بن أيوب، حدثني عياش بن عباس الحميري، عن أبي حصين الحجري الهيثم، عن عامر الحجري، قال سمعت أبا ريحانة، صاحب النبي  صلى الله عليه وسلم  يقول كان النبي  صلى الله عليه وسلم  ينهى عن ركوب النمور ‏.‏",
      "text_en": " It wasnarrated that ‘Amir Al-Hajri said:                      “I heard Abu Raihanah, theCompanion of the Prophet (ﷺ) say: ‘The Prophet (ﷺ) used toforbidriding on leopard skins.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20379",
        "10871"
      ]
    },
    {
      "id": "sunan-ibn-majah-3667-2",
      "hadith_no": "3667",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن موسى بن على، سمعت أبي يذكر، عن سراقة بن مالك، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ ألا أدلكم على أفضل الصدقة ابنتك مردودة إليك ليس لها كاسب غيرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Suraqah bin Malik that the Prophet(ﷺ) said:                     \"Shall I not tell you of the best charity? A daughter who comes back to you and has no other breadwinner apart from you.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "471"
      ]
    },
    {
      "id": "sunan-ibn-majah-3722-2",
      "hadith_no": "3722",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن أبي المنيب، عن ابن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  نهى أن يقعد بين الظل والشمس ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah, from his father, that the Prophet(ﷺ) :                     \"forbade sitting between the shade and sun.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3793",
      "hadith_no": "3793",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، أخبرني عمرو بن قيس الكندي، عن عبد الله بن بسر، أن أعرابيا، قال لرسول الله  صلى الله عليه وسلم  إن شرائع الإسلام قد كثرت على فأنبئني منها بشىء أتشبث به ‏.‏ قال ‏\"‏ لا يزال لسانك رطبا من ذكر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Busr that a Bedouin said to the Messenger of Allah(ﷺ) said:                     \"The laws of Islam are burdensome for me. Tell me of something that I will be able to adhere to. He said: 'Always keep your tongue moist with the remembrance of Allah, the Mighty and Sublime.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20650",
        "20675",
        "19935",
        "3650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3798",
      "hadith_no": "3798",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا زيد بن الحباب، عن مالك بن أنس، أخبرني سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال في يوم مائة مرة لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير كان له عدل عشر رقاب وكتبت له مائة حسنة ومحي عنه مائة سيئة وكن له حرزا من الشيطان سائر يومه إلى الليل ولم يأت أحد بأفضل مما أتى به إلا من قال أكثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah(ﷺ) said: \"Whoever says one hundered times each day: La ilaha illahu wahdahu la sharikalahu, wa lahul-mulku wa lahul hamduwa huwa ala kulli shayin qadeer (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion, all praise is to Him, and He is able to do all things), it will be equivalent to him freeing ten slaves, and one hundered merits will be recorded for him, and one hundered bad deeds will be erased from (his record), and it will be a protection for him against Satan all day until night comes. No one can do anything better then him except one who says more.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20650",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3852",
      "hadith_no": "3852",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا زيد بن الحباب، حدثنا سفيان، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يرحمنا الله وأخا عاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Messenger of Allah (saas) said: \"May Allah have mercy on us and on our brother of 'Ad.\" (i.e., Prophet Hud alay-salaam).",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20012",
        "11049",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 139
}