{
  "id": "20658",
  "name": "'Abdullah bin 'Abdur Rahman bin Ya'la عبد الله بن عبد الرحمن بن يعلى",
  "full_name": "'Abdullah bin 'Abdur Rahman bin Ya'la عبد الله بن عبد الرحمن بن يعلى",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ta'if"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  تم  س  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Ta'ifi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10952",
      "name": "'Amr bin al-Shryd عمرو بن الشريد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18713",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن أوس بن أبي أوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18605",
      "name": "Abd Rbh bin al-Hakam عبد ربه بن الحكم بن سفيان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19944",
      "name": "al-Muttalib bin 'Abdullah bin Hantab المطلب بن عبد الله بن حنطب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6024",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا المعتمر بن سليمان، ح وحدثنا زهير بن حرب، حدثنا عبد الرحمن بن مهدي، كلاهما عن عبد الله بن عبد الرحمن الطائفي، عن عمرو، بن الشريد عن أبيه، قال استنشدني رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث إبراهيم بن ميسرة وزاد قال ‏\"‏ إن كاد ليسلم ‏\"‏ ‏.‏ وفي حديث ابن مهدي قال ‏\"‏ فلقد كاد يسلم في شعره ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Sharid reported on the authority of his father that Allah's Messenger (may peace be upon him) asked him to recite poetry, the rest of the hadith is the same, but with this addition:                      \"He (that is Umayya b. Abu Sharid) was about to become a Muslim and in the hadith transmitted on the authority, of Ibn Mahdi (the words are) \"He was almost a Muslim in his poetry.\"",
      "chain": [
        "30399",
        "20288",
        "30022",
        "20658",
        "10952"
      ]
    },
    {
      "hadith_no": "1151",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت عبد الله بن عبد الرحمن الطائفي، يحدث عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ التكبير في الفطر سبع في الأولى وخمس في الآخرة والقراءة بعدهما كلتيهما ‏\"‏ ‏.‏",
      "text_en": " 'Abd b. 'Amr b. al-'As said:                      The Prophet of Allah (ﷺ) said: There are seven takers in the first rak'ah and five in the second rak'ah of the prayer offered on the day of the breaking of the fast.",
      "chain": [
        "30175",
        "20288",
        "20658",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1393",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، أخبرنا قران بن تمام، ح وحدثنا عبد الله بن سعيد، أخبرنا أبو خالد، - وهذا لفظه - عن عبد الله بن عبد الرحمن بن يعلى، عن عثمان بن عبد الله بن أوس، عن جده، - قال عبد الله بن سعيد في حديثه أوس بن حذيفة - قال قدمنا على رسول الله صلى الله عليه وسلم في وفد ثقيف - قال - فنزلت الأحلاف على المغيرة بن شعبة وأنزل رسول الله صلى الله عليه وسلم بني مالك في قبة له ‏.‏ قال مسدد وكان في الوفد الذين قدموا على رسول الله صلى الله عليه وسلم من ثقيف قال كان كل ليلة يأتينا بعد العشاء يحدثنا ‏.‏ قال أبو سعيد قائما على رجليه حتى يراوح بين رجليه من طول القيام وأكثر ما يحدثنا ما لقي من قومه من قريش ثم يقول لا سواء كنا مستضعفين مستذلين - قال مسدد بمكة - فلما خرجنا إلى المدينة كانت سجال الحرب بيننا وبينهم ندال عليهم ويدالون علينا فلما كانت ليلة أبطأ عن الوقت الذي كان يأتينا فيه فقلنا لقد أبطأت عنا الليلة ‏.‏ قال إنه طرأ على جزئي من القرآن فكرهت أن أجيء حتى أتمه ‏.‏ قال أوس سألت أصحاب رسول الله صلى الله عليه وسلم كيف يحزبون القرآن قالوا ثلاث وخمس وسبع وتسع وإحدى عشرة وثلاث عشرة وحزب المفصل وحده ‏.‏ قال أبو داود وحديث أبي سعيد أتم ‏.‏",
      "text_en": " Narrated Aws ibn Hudhayfah:                     We came upon the Messenger of Allah (ﷺ) in a deputation of Thaqif. The signatories of the pact came to al-Mughirah ibn Shu'bah as his guests. The Messenger of Allah (ﷺ) made Banu-Malik stay in a tent of his.  Musaddad's version says: He was in the deputation of Thaqif which came to the Messenger of Allah (ﷺ). He used to visit and have a talk with us every day after the night prayer.  The version of AbuSa'id says: He remained standing for such a long time (talking to us) that he put his weight sometimes on one leg and sometimes on the other due to his long stay. He mostly told us how his people, the Quraysh, behaved with him.  He would say: We were not equal; we were weak and degraded at Mecca (according to Musaddad's version). When we came over to Medina the fighting began between us; sometimes we overcome them and at other times they overcome us. One night he came late and did not come at the time he used to come.  We asked him: You came late tonight?  He said: I could not recite the fixed part of the Qur'an that I used to recite every day. I disliked to come till I had completed it.  Aws said: I asked the companions of the Messenger of Allah (ﷺ): How do you divide the Qur'an for daily recitation?  They said: Three surahs, five surahs, eleven surahs, thirteen surahs' mufassal surahs.Abu Dawud said: The version of Abu Sa'id is complete.",
      "chain": [
        "30175",
        "25244",
        "30200",
        "20326",
        "20658",
        "18713",
        "3219"
      ]
    },
    {
      "hadith_no": "3066",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الأعلى بن عبد الأعلى، قال حدثنا عبد الله بن عبد الرحمن الطائفي، عن عطاء بن أبي رباح، قال حدثتني عائشة بنت طلحة، عن خالتها، عائشة أم المؤمنين أن رسول الله صلى الله عليه وسلم أمر إحدى نسائه أن تنفر من جمع ليلة جمع فتأتي جمرة العقبة فترميها وتصبح في منزلها ‏.‏ وكان عطاء يفعله حتى مات ‏.‏",
      "text_en": " Aishah bint Tallah narrated from her maternal aunt Aishah the Mother of the Believers that:                     the Messenger of Allah told one of his wives to depart from Jam (Al-Muzadalifah) on the night of Jam, to go to Jamratual Aqabah and stone it, then come back to her camp before morning. And Ata used to do that until he died.",
      "chain": [
        "30153",
        "20246",
        "20658",
        "11029",
        "10504"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا عبد الله بن عبد الرحمن الطائفي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  لم يصل قبلها ولا بعدها في عيد ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Prophet (ﷺ) did not pray before or after the‘Eid prayer.",
      "chain": [
        "38409",
        "20032",
        "20658",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2212",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا مروان بن معاوية، عن عبد الله بن عبد الرحمن الطائفي، عن ميمونة بنت كردم اليسارية، أن أباها، لقي النبي  صلى الله عليه وسلم  وهي رديفة له فقال إني نذرت أن أنحر ببوانة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ هل بها وثن ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أوف بنذرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Maimunah bint Kardam Al-Yasariyyah that :                     her father met the Prophet (ﷺ) when she was riding behind him. He said: \"I vowed to offer a sacrifice at Buwanah.\" The Messenger of Allah (ﷺ) said: \"Is there any idol there?\" He said: \"No.\" He said: \" Fulfill your vow.\" (Hasan)Another chain with similar wording.",
      "chain": [
        "30201",
        "20201",
        "20658",
        "4015"
      ]
    }
  ],
  "total_hadiths": 6
}