{
  "id": "2065",
  "name": "'Abdullah bin al-Sa'ib ( عبد الله بن السائب المخزومي ( رضي الله عنه",
  "full_name": "'Abdullah bin al-Sa'ib ( عبد الله بن السائب المخزومي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خت  4  -  صحبة ]"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "Late Muslim",
      "Makki",
      "Qari"
    ]
  },
  "parents": [
    {
      "id": "2064",
      "name": "al-Sa'ib b. Abi Sa'ib ( السائب بن أبي السائب القرشي المكي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "2066",
      "name": "'Abdur Rahman bin al-Sa'ib ( عبد الرحمن بن السائب المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4037",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد الواحد بن زياد، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا علي بن مسهر، كلاهما عن الشيباني، عن عبد الله بن السائب، قال سألت عبد الله بن معقل عن المزارعة، فقال أخبرني ثابت بن الضحاك، أن رسول الله صلى الله عليه وسلم نهى عن المزارعة ‏.‏ وفي رواية ابن أبي شيبة نهى عنها ‏.‏ وقال سألت ابن معقل ‏.‏ ولم يسم عبد الله ‏.‏",
      "text_en": " Abdullah b. al Sa'ib reported:                      I asked Abdullah b. Ma'qil about Muzara'a (cultivating land on share basis in the produce). He said: Thabit b. Dahhak informed me that Allah's Messenger (may peace be upon him) forbade Muzara'a as Ibn Abu Shaiba forbade it with a slight change of words. He (the narrator) said: I asked Ibn Ma'qil but he did not name 'Abdullah.",
      "chain": [
        "30399",
        "20256",
        "30201",
        "20345",
        "11352",
        "2065",
        "18580",
        "1902"
      ]
    },
    {
      "hadith_no": "4038",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن حماد، أخبرنا أبو عوانة، عن سليمان، الشيباني عن عبد الله بن السائب، قال دخلنا على عبد الله بن معقل فسألناه عن المزارعة، فقال زعم ثابت أن رسول الله صلى الله عليه وسلم نهى عن المزارعة وأمر بالمؤاجرة وقال ‏\"‏ لا بأس بها ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. al-Sa'ib reported:                      We visited 'Abdullah b. Ma'qil and asked him about sharing of crops, whereupon he said: Thabit alleged that Allah's Messenger (may peace be upon him) forbade Muzara'a and commanded leasing it out on rent (for money) and said: There is no harm in it.",
      "chain": [
        "30313",
        "20574",
        "20469",
        "11352",
        "2065"
      ]
    },
    {
      "hadith_no": "648",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، حدثني محمد بن عباد بن جعفر، عن ابن سفيان، عن عبد الله بن السائب، قال رأيت النبي صلى الله عليه وسلم يصلي يوم الفتح ووضع نعليه عن يساره ‏.‏",
      "text_en": " Narrated Abdullah ibn as-Sa'ib:                     I saw the Prophet (ﷺ) praying on the day of the conquest of Mecca and he had placed his shoe at his left side.",
      "chain": [
        "30175",
        "20031",
        "11070",
        "11262",
        "2065"
      ]
    },
    {
      "hadith_no": "649",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، وأبو عاصم قالا أخبرنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقول أخبرني أبو سلمة بن سفيان، وعبد الله بن المسيب العابدي، وعبد الله بن عمرو، عن عبد الله بن السائب، قال صلى بنا رسول الله صلى الله عليه وسلم الصبح بمكة فاستفتح سورة المؤمنين حتى إذا جاء ذكر موسى وهارون - أو ذكر موسى وعيسى ابن عباد يشك أو اختلفوا - أخذت رسول الله صلى الله عليه وسلم سعلة فحذف فركع وعبد الله بن السائب حاضر لذلك ‏.‏",
      "text_en": " ‘Abd Allah b. al-Sa’ib said; the Messenger of Allah (ﷺ) led us in the morning prayer at Mecca. He began to recite Surah al-Mu;minin and while he came to description of Moses and Aaron or the description of Moses and Jesus the narrator Ibn ‘Abbad doubts or other narrators differed amongst themselves on this word the prophet (ﷺ) coughed and gave up (recitation) and then bowed ‘Abd Allah b. al-Sa’ib was present seeing all this incident.",
      "chain": [
        "30115",
        "20121",
        "20241",
        "11070",
        "11262",
        "29",
        "2065"
      ]
    },
    {
      "hadith_no": "1155",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا الفضل بن موسى السيناني، حدثنا ابن جريج، عن عطاء، عن عبد الله بن السائب، قال شهدت مع رسول الله صلى الله عليه وسلم العيد فلما قضى الصلاة قال ‏\"‏ إنا نخطب فمن أحب أن يجلس للخطبة فليجلس ومن أحب أن يذهب فليذهب ‏\"‏ ‏.‏ قال أبو داود هذا مرسل عن عطاء عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn as-Sa'ib:                     I attended the 'Id prayer along with the Messenger of Allah (ﷺ). When he finished the prayer, he said: We shall deliver the sermon; he who likes to sit for listening to it may sit and he who likes to go away may go away.Abu Dawud said: this is a mursal tradition (i.e. the successor 'Ata directly reporting from the Prophet (ﷺ) and omitting the link of the Companions).",
      "chain": [
        "30269",
        "20452",
        "11070",
        "11029",
        "2065"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا ابن جريج، عن يحيى بن عبيد، عن أبيه، عن عبد الله بن السائب، قال سمعت رسول الله صلى الله عليه وسلم يقول ما بين الركنين ‏{‏ ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار ‏}‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn as-Sa'ib:                     I heard the Messenger of Allah (ﷺ) say between the two corners: O Allah, bring us a blessing in this world and a blessing in the next and guard us from punishment of Hell.",
      "chain": [
        "30175",
        "20347",
        "11070",
        "10841",
        "2065"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو داود الطيالسي، حدثنا محمد بن مسلم بن أبي الوضاح، هو أبو سعيد المؤدب عن عبد الكريم الجزري، عن مجاهد، عن عبد الله بن السائب، أن رسول الله صلى الله عليه وسلم كان يصلي أربعا بعد أن تزول الشمس قبل الظهر وقال ‏\"‏ إنها ساعة تفتح فيها أبواب السماء وأحب أن يصعد لي فيها عمل صالح ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي أيوب ‏.‏ قال أبو عيسى حديث عبد الله بن السائب حديث حسن غريب ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يصلي أربع ركعات بعد الزوال لا يسلم إلا في آخرهن ‏.‏",
      "text_en": " Abdullah bin As-Sa'ib narrated:                     \"Allah's Messenger would pray four (Rak'ah) after the Zawal of the sun before Az-Zuhr. He said: 'It is an hour in which the gates of the heavens are opened, and I love that a righteous deed should be raised up for me in it.'\"",
      "chain": [
        "20547",
        "167",
        "18655",
        "11028",
        "2065"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وشعيب بن يوسف، عن يحيى، عن ابن جريج، قال أخبرني محمد بن عباد، عن عبد الله بن سفيان، عن عبد الله بن السائب، أن رسول الله صلى الله عليه وسلم صلى يوم الفتح فوضع نعليه عن يساره ‏.‏",
      "text_en": " It was narrated from Abdullah bin As Saib that the Messenger of Allah(ﷺ) prayed on the day of Conquest (of Makkah), and he put his sandals to his left.",
      "chain": [
        "30359",
        "20031",
        "11070",
        "30377",
        "2065"
      ]
    },
    {
      "hadith_no": "1007",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن جريج، قال أخبرني محمد بن عباد، حديثا رفعه إلى ابن سفيان عن عبد الله بن السائب، قال حضرت رسول الله صلى الله عليه وسلم يوم الفتح فصلى في قبل الكعبة فخلع نعليه فوضعهما عن يساره فافتتح بسورة المؤمنين فلما جاء ذكر موسى أو عيسى - عليهما السلام - أخذته سعلة فركع ‏.‏",
      "text_en": " It was narrated that Abdullah bin As-Sa'ib said:                     \"I was with the Messenger of Allah (ﷺ) on the day of the Conquest (of Makkah). He prayed in front of the Ka'bah. He took off his shoes and placed them to his left, and he started to recite Surat Al-Mu'minun. When he reached the passage that mentions Musa and 'Eisa, peace be upon them both, he started coughing, then he bowed.\"",
      "chain": [
        "30449",
        "20423",
        "11070",
        "30377",
        "2065"
      ]
    },
    {
      "hadith_no": "1282",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبد الوهاب بن عبد الحكم الوراق، قال حدثنا معاذ بن معاذ، عن سفيان بن سعيد، ح وأخبرنا محمود بن غيلان، قال حدثنا وكيع، وعبد الرزاق، عن سفيان، عن عبد الله بن السائب، عن زاذان، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لله ملائكة سياحين في الأرض يبلغوني من أمتي السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah (SWT) has angels who travel around on Earth conveying to me the Salams of my Ummah.'\"",
      "chain": [
        "20286",
        "20012",
        "30277",
        "20032",
        "20121",
        "20005",
        "2065",
        "10911",
        "16"
      ]
    },
    {
      "hadith_no": "1571",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن يحيى بن أيوب، قال حدثنا الفضل بن موسى، قال حدثنا ابن جريج، عن عطاء، عن عبد الله بن السائب، أن النبي صلى الله عليه وسلم صلى العيد قال ‏\"‏ من أحب أن ينصرف فلينصرف ومن أحب أن يقيم للخطبة فليقم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin As-SA'ib that:                     The Prophet (ﷺ) offered the 'Eid prayer and said: 'Whoever would like to leave, let him leave, and whoever would like to stay for the Khutbah, let him stay.\"",
      "chain": [
        "38617",
        "20452",
        "11070",
        "11029",
        "2065"
      ]
    },
    {
      "hadith_no": "869",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن ابن جريج، عن ابن أبي مليكة، عن عبد الله بن السائب، قال قرأ رسول الله  صلى الله عليه وسلم  في صلاة الصبح ب ‏{المؤمنون}‏ فلما أتى على ذكر عيسى أصابته شرقة فركع ‏.‏ يعني سعلة ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Sa’ib said:                      “The Messenger ofAllah(ﷺ) recited Al-Mu’minun [Al-Mu’minun 23] in the Subh prayer,and when he came to the mention of ‘Eisa, he was overcome with acough, so he bowed in Ruku’.”",
      "chain": [
        "30288",
        "20005",
        "11070",
        "11090",
        "2065"
      ]
    },
    {
      "hadith_no": "1349",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هدية بن عبد الوهاب، وعمرو بن رافع البجلي، قالا حدثنا الفضل بن موسى، حدثنا ابن جريج، عن عطاء، عن عبد الله بن السائب، قال حضرت العيد مع رسول الله  صلى الله عليه وسلم  فصلى بنا العيد ثم قال ‏\"‏ قد قضينا الصلاة فمن أحب أن يجلس للخطبة فليجلس ومن أحب أن يذهب فليذهب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Sa’ib said:                      “I attended the ‘Eidprayer with the Messenger of Allah (ﷺ). He led us in offering the‘Eid prayer, then he said: ‘I have finished the prayer. Whoeverwantsto sit (and listen to) the sermon, then let him sit, andwhoever wantsto leave, then let him leave.’”",
      "chain": [
        "18792",
        "20452",
        "11070",
        "11029",
        "2065"
      ]
    },
    {
      "hadith_no": "1498",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد، عن ابن جريج، عن محمد بن عباد، عن عبد الله بن سفيان، عن عبد الله بن السائب، قال رأيت رسول الله  صلى الله عليه وسلم  صلى يوم الفتح فجعل نعليه عن يساره ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Sa’ib said:                      “I saw the MessengerofAllah (ﷺ) praying on the Day of the Conquest, and he put hisshowson his left.”",
      "chain": [
        "30201",
        "20031",
        "11070",
        "30377",
        "2065"
      ]
    }
  ],
  "total_hadiths": 14
}