{
  "id": "20665",
  "name": "'Ubaid bin Sa'id bin Aban bin Sa'id عبيد بن سعيد بن أبان بن سعيد",
  "full_name": "'Ubaid bin Sa'id bin Aban bin Sa'id عبيد بن سعيد بن أبان بن سعيد",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "18347",
      "name": "Sa'id bin Aban bin Sa'id سعيد بن أبان بن سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20367",
      "name": "Yahya bin Sa'id bin Aban bin Sa'id يحيى بن سعيد بن أبان بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "29001",
      "name": "'Unbasa bin Sa'id bin Aban bin Sa'id عنبسة بن سعيد بن أبان بن سعيد",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "29002",
      "name": "'Abdullah bin Sa'id bin Aban bin Sa'id عبد الله بن سعيد بن أبان بن سعيد",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "29003",
      "name": "Muhammad bin Sa'id bin Aban bin Sa'id محمد بن سعيد بن أبان بن سعيد",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "30254",
      "name": "Sa'id bin Yahya bin Sa'id bin Aban سعيد بن يحيى بن سعيد بن أبان",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1305",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثناه إسحاق بن إبراهيم، أخبرنا عبيد بن سعيد الأموي، حدثنا سفيان، عن منصور، بهذا الإسناد وقال ‏\"‏ فليتحر الصواب ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Mansur with the same chain of transmitters with the words:                      He should aim at what is correct and complete.\"",
      "chain": [
        "20665",
        "20012"
      ]
    },
    {
      "hadith_no": "284",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد بن سعيد، وشبابة بن سوار، عن شعبة، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20665",
        "20426",
        "20020"
      ]
    },
    {
      "hadith_no": "1641",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو بشر قالا حدثنا قبيصة، ح وحدثنا أبو كريب، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن خلف العسقلاني، حدثنا الفريابي، وقبيصة، كلهم عن سفيان، عن عبد الله بن عثمان بن خثيم، عن عبد الرحمن بن بهمان، عن عبد الرحمن بن حسان بن ثابت، عن أبيه، قال لعن رسول الله  صلى الله عليه وسلم  زوارات القبور ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Hassan bin Thabit that hisfathersaid:                      “The Messenger of Allah (ﷺ) cursed women who visitgraves.”",
      "chain": [
        "30201",
        "11419",
        "20351",
        "30216",
        "20665",
        "38502",
        "20034",
        "20351",
        "20012",
        "10644",
        "12272",
        "451",
        "452"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن بشار، حدثنا يزيد بن هارون، وأبو داود قالوا حدثنا شعبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ من صام الأبد فلا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Shikhkhir that his father said:                     “TheProphet (ﷺ) said: ‘Whoever fasts continually, he neither fastsnor breaks his fast.’”",
      "chain": [
        "30201",
        "20665",
        "30160",
        "20472",
        "20547",
        "20020",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "3349",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن قتادة، عن عقبة بن صهبان، عن عبد الله بن مغفل، قال نهى النبي  صلى الله عليه وسلم  عن الخذف وقال ‏\"‏ إنها لا تقتل الصيد ولا تنكي العدو ولكنها تفقأ العين وتكسر السن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Mughaffal said:                      “The Prophet (ﷺ)forbade throwing small pebbles and said: ‘They do not kill any gameorhurt the enemy, but they can break a tooth or put out an eye.’”",
      "chain": [
        "30201",
        "20665",
        "30160",
        "20173",
        "20020",
        "11019",
        "11602",
        "3242"
      ]
    },
    {
      "hadith_no": "3849",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، وعلي بن محمد، قالا حدثنا عبيد بن سعيد، قال سمعت شعبة، عن يزيد بن خمير، قال سمعت سليم بن عامر، يحدث عن أوسط بن إسماعيل البجلي، أنه سمع أبا بكر، حين قبض النبي  صلى الله عليه وسلم  يقول قام رسول الله  صلى الله عليه وسلم  في مقامي هذا عام الأول ثم بكى أبو بكر ثم قال ‏\"‏ عليكم بالصدق فإنه مع البر وهما في الجنة وإياكم والكذب فإنه مع الفجور وهما في النار وسلوا الله المعافاة فإنه لم يؤت أحد بعد اليقين خيرا من المعافاة ولا تحاسدوا ولا تباغضوا ولا تقاطعوا ولا تدابروا وكونوا عباد الله إخوانا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Awsat (bin Isma'il) Al-Bajali that :                     he heard Abu Bakr, when the Prophet (saas) had passed away, saying: \"The Messenger of Allah (saas) stood in this place where I am standing, last year.\" Then Abu Bakr wept, then he said: \"You must adhere to the truth, for with it comes righteousness and they both lead to Paradise. And you must beware of lying for with it comes immorality, and they both lead to Hell. Ask Allah for Al-Mu'afah, for no one is given anything after certainty that is better than Mu'afah. Do not envy one another, do not hate one another, do not sever ties with one another, do not turn your backs on one another and be, O slaves of Allah, brothers.\"",
      "chain": [
        "20436",
        "38409",
        "20665",
        "20020",
        "10981",
        "10915"
      ]
    }
  ],
  "total_hadiths": 6
}