{
  "id": "20668",
  "name": "'Umar bin Sa'd bin 'Ubaid عمر بن سعد بن عبيد أبو داود",
  "full_name": "'Umar bin Sa'd bin 'Ubaid عمر بن سعد بن عبيد أبو داود",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10745",
      "name": "Bdr bin 'Uthman al-Amwy بدر بن عثمان الأموي مولاهم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20745",
      "name": "Y'aqub bin 'Abdullah يعقوب بن عبد الله بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20362",
      "name": "Huraym bin Sufyan al-Bajli هريم بن سفيان البجلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22074",
      "name": "Salah bin Hasaan al-Nadri صالح بن حسان النضري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30475",
      "name": "al-Qasim bin Zakaria bin Dinar القاسم بن زكريا بن دينار القرشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "35153",
      "name": "Musa bin 'Abdur Rahman موسى بن عبد الرحمن بن سعيد بن مسروق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35002",
      "name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن محمد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4298",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا أبو داود الحفري، عن سفيان، عن سعد بن، إبراهيم عن عامر بن سعد، عن سعد، قال دخل النبي صلى الله عليه وسلم على يعودني ‏.‏ فذكر بمعنى حديث الزهري ولم يذكر قول النبي صلى الله عليه وسلم في سعد ابن خولة غير أنه قال وكان يكره أن يموت بالأرض التي هاجر منها ‏.‏",
      "text_en": " 'Amir b. Sa'd reported from S'ad (b. Abu Waqqas):                      Allah's Apostle (may peace be upon him) visited me to inquire after my health, the rest of the hadith is the same as transmitted on the authority of Zuhri, but lie did not make mention of the words of Allah's Apostle (may peace be upon him) in regard to Sa'd b. Khaula except this that he said:\" He (the Holy Prophet) did not like death in the land from which lie had migrated.\"",
      "chain": [
        "30313",
        "20668",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، حدثنا أبو داود الحفري، عمر بن سعد عن سفيان، عن ابن عون، عن نافع، عن ابن عمر، عن عمر، قال أصبت أرضا من أرض خيبر فأتيت رسول الله صلى الله عليه وسلم فقلت أصبت أرضا لم أصب مالا أحب إلى ولا أنفس عندي منها ‏.‏ وساق الحديث بمثل حديثهم ولم يذكر فحدثت محمدا وما بعده ‏.‏",
      "text_en": " 'Umar reported:                      I acquired land from the lands of Khaibar. I came to Allah's Messenger (may peace be upon him) and said: I have acquired a piece of land. Never have I acquired land more loved by me and more cherished by me than this. The rest of the hadith is the same, but he made no mention of this:\" I narrated it to Muhammad\" and what follows.",
      "chain": [
        "30123",
        "20668",
        "20012",
        "11071",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "5422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، أخبرنا أبو داود الحفري، ح وحدثنيه محمد بن، رافع حدثنا عبد الرزاق، كلاهما عن سفيان، بهذا الإسناد ‏.‏ مثله ‏.‏ وفي حديثهما ‏\"‏ ولا يمسح يده بالمنديل حتى يلعقها أو يلعقها ‏\"‏ ‏.‏ وما بعده ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sufyan with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30123",
        "20668"
      ]
    },
    {
      "hadith_no": "6336",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا سفيان بن عيينة، ح وحدثني محمد بن رافع، حدثنا  أبو داود الحفري، عن سفيان، كلاهما عن أبي الزناد، عن الأعرج، عن أبي سلمة، عن أبي، هريرة عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث يونس عن الزهري وفي حديثهما ذكر البقرة والشاة معا وقالا في حديثهما ‏\"‏ فإني أومن به أنا وأبو بكر وعمر ‏\"‏ ‏.‏ وما هما ثم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri, and there is a clear mention of the stories of ox and goat (and the words are):                      I believe in it and so do Abu Bakr and Umar, but they were not at that time present there.",
      "chain": [
        "30377",
        "20005",
        "30375",
        "20668",
        "11061",
        "11197",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6408",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا أبو داود الحفري، حدثنا سفيان، عن أبي إسحاق، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Ishaq with the same chain of transmitters.",
      "chain": [
        "30123",
        "20668",
        "20012"
      ]
    },
    {
      "hadith_no": "16",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة قالا حدثنا عمر بن سعد، عن سفيان، عن الضحاك بن عثمان، عن نافع، عن ابن عمر، قال مر رجل على النبي صلى الله عليه وسلم وهو يبول فسلم عليه فلم يرد عليه ‏.‏ قال أبو داود وروي عن ابن عمر وغيره أن النبي صلى الله عليه وسلم تيمم ثم رد على الرجل السلام ‏.‏",
      "text_en": " Narrated Ibn 'Umar :                     A man passed by the Prophet (sal Allaahu alayhi wa sallam ) while he was urinating, and saluted him. The Prophet (sal Allaahu alayhi wa sallam) did not return the salutation to him.Abu Dawud said : It is narrated on the authority of Ibn 'Umar that the  Prophet (sal Allaahu alayhi wa sallam) performed tayammum, then he returned the salutation to the man.",
      "chain": [
        "4",
        "20668",
        "20012",
        "20504",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4241",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الحفري، عن بدر بن عثمان، عن عامر، عن رجل، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ يكون في هذه الأمة أربع فتن في آخرها الفناء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: four (majestic) trials (fitnahs) will take place among this community, and in their end there will be destruction.",
      "chain": [
        "30524",
        "20668",
        "10745",
        "11052",
        "18"
      ]
    },
    {
      "hadith_no": "4850",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو داود الحفري، حدثنا سفيان الثوري، عن سماك بن حرب، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم إذا صلى الفجر تربع في مجلسه حتى تطلع الشمس حسناء ‏.‏",
      "text_en": " JABIR B. SAMURAH SAID:                      WHEN THE PROPHET(MAY PEACE BE UPON HIM) PRAYED THE DAWN PRAYER, HE SAT CROSS-LEGGED WHERE HE WAS TILL THE SUN HAD COME WELL UP.",
      "chain": [
        "30203",
        "20668",
        "20012",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "5175",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الحفري، عن سفيان، عن الأعمش، عن طلحة بن مصرف، عن رجل، عن سعد، نحوه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Talhah b. Musarrif from a man from Sa’d from the prophet (May peace be upon him) through a different chain of narrators.",
      "chain": [
        "30524",
        "20668",
        "20012",
        "11060",
        "11356",
        "9"
      ]
    },
    {
      "hadith_no": "1359",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان الثوري، عن حميد، عن أنس، قال أهدت بعض أزواج النبي صلى الله عليه وسلم إلى النبي صلى الله عليه وسلم طعاما في قصعة فضربت عائشة القصعة بيدها فألقت ما فيها فقال النبي صلى الله عليه وسلم ‏\"‏ طعام بطعام وإناء بإناء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Anas narrated:                      \"One of the wives of the Prophet (ﷺ) gave the Prophet (ﷺ) some food in a bowl. Then 'Aishah broke the bowl with her hand, and discarded what was in it. So the Prophet (ﷺ) said: \"Food for food and vessel for vessel.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1567",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر، - واسمه أحمد بن عبد الله الهمداني ومحمود بن غيلان قالا حدثنا أبو داود الحفري، حدثنا يحيى بن زكريا بن أبي زائدة، عن سفيان بن سعيد، عن هشام، عن ابن سيرين، عن عبيدة، عن علي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن جبرائيل هبط عليه فقال له خيرهم يعني أصحابك في أسارى بدر القتل أو الفداء على أن يقتل منهم قابلا مثلهم ‏.‏ قالوا الفداء ويقتل منا ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وأنس وأبي برزة وجبير بن مطعم ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث الثوري لا نعرفه إلا من حديث ابن أبي زائدة ‏.‏ وروى أبو أسامة عن هشام عن ابن سيرين عن عبيدة عن علي عن النبي صلى الله عليه وسلم نحوه ‏.‏ وروى ابن عون عن ابن سيرين عن عبيدة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ وأبو داود الحفري اسمه عمر بن سعد ‏.‏",
      "text_en": " Narrated 'Ali:                     That the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"There are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.Abu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)Ibn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.Abu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.",
      "chain": [
        "20668",
        "20366",
        "20012",
        "11065",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "1870",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن منصور، عن سالم بن أبي الجعد، عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن الظروف فشكت إليه الأنصار فقالوا ليس لنا وعاء ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وأبي سعيد وأبي هريرة وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"The Messenger of Allah (ﷺ) prohibited using (certain) containers. So the Ansar complained about that to him. They said: 'We will have no vessels!' so he said: 'If so then use them.'\"He said: There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Sa'eed, and 'Abdullah bin 'Amr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11067",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "2110",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبوا الأموات فتؤذوا الأحياء ‏\"‏ ‏.‏ قال أبو عيسى وقد اختلف أصحاب سفيان في هذا الحديث فروى بعضهم مثل رواية الحفري وروى بعضهم عن سفيان عن زياد بن علاقة قال سمعت رجلا يحدث عند المغيرة بن شعبة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " ' Al-Mughirah bin Shu'bah narrated that the Messenger of Allah said:                     \"Do not vilify the dead (and) by that harm the living.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2298",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا مؤمل، وأبو داود الحفري عن سفيان، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "30180",
        "20668",
        "20012"
      ]
    },
    {
      "hadith_no": "2641",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان الثوري، عن عبد الرحمن بن زياد بن أنعم الإفريقي، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليأتين على أمتي ما أتى على بني إسرائيل حذو النعل بالنعل حتى إن كان منهم من أتى أمه علانية لكان في أمتي من يصنع ذلك وإن بني إسرائيل تفرقت على ثنتين وسبعين ملة وتفترق أمتي على ثلاث وسبعين ملة كلهم في النار إلا ملة واحدة قالوا ومن هي يا رسول الله قال ما أنا عليه وأصحابي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث مفسر حسن غريب لا نعرفه مثل هذا إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"What befell the children of Isra'il will befall my Ummah, step by step, such that if there was one who had intercourse with his mother in the open, then there would be someone from my Ummah who would do that. Indeed the children of Isra'il split into seventy-two sects, and my Ummah will split into seventy-three sects. All of them are in the Fire Except one sect.\" He said: \"And which is it O Messenger of Allah?\" He said: \"What I am upon and my Companions.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "28326",
        "1945",
        "29"
      ]
    },
    {
      "hadith_no": "2650",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبو داود الحفري، عن سفيان، عن أبي هارون العبدي، قال كنا نأتي أبا سعيد فيقول مرحبا بوصية رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الناس لكم تبع وإن رجالا يأتونكم من أقطار الأرضين يتفقهون في الدين فإذا أتوكم فاستوصوا بهم خيرا ‏\"‏ ‏.‏ قال أبو عيسى قال علي قال يحيى بن سعيد كان شعبة يضعف أبا هارون العبدي ‏.‏ قال يحيى بن سعيد ما زال ابن عون يروي عن أبي هارون العبدي حتى مات ‏.‏ قال أبو عيسى وأبو هارون اسمه عمارة بن جوين ‏.‏",
      "text_en": " Narrated Abu Harun [Al-'Abdi]:                     \"We went to Abu Sa'eed and he said: 'Welcome with the exhortation of the Messenger of Allah (ﷺ). Indeed the Prophet (ﷺ) said: \"Surely, the people are followers of you, and men will certainly come to you from the regions of the earth to gain understanding in the religion. So when they come to you exhort them with good.\"",
      "chain": [
        "35047",
        "20668",
        "20012",
        "18767"
      ]
    },
    {
      "hadith_no": "3016",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن الجريري، عن أبي نضرة، عن رجل، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "hadith_no": "3162",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، وأبو نعيم عن سفيان، عن عاصم بن أبي النجود، عن زر، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقال لصاحب القرآن اقرأ وارتق ورتل كما كنت ترتل في الدنيا فإن منزلتك عند آخر آية تقرأ بها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Prophet (ﷺ) said: \"It shall be said - meaning to the one who memorized the Qur'an - 'Recite, and rise up, recite (melodiously) as you would recite in the world. For indeed your rank shall be at the last Ayah you recited.'\"",
      "chain": [
        "30277",
        "20668",
        "20348",
        "20012",
        "11358",
        "11337",
        "29"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان الثوري، عن عمرو بن مرة، عن عبد الله بن الحارث، عن طليق بن قيس، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يدعو يقول ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر الهدى لي وانصرني على من بغى على رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطواعا لك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي وثبت حجتي وسدد لساني واهد قلبي واسلل سخيمة صدري ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمود بن غيلان وحدثنا محمد بن بشر العبدي، عن سفيان الثوري، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Ibn Abbas said:                     “The Prophet used to supplicate, saying: “My Lord, aid me and do not aid against me, and grant me victory and do not grant victory over me, plot for me and do not plot against me, guide me and facilitate guidance for me, grant me victory over those who transgress against me. My Lord, make me ever-grateful to You, ever-remembering of You, ever-fearful of You, ever-obedient to You, ever-humble to You, oft-turning and returning to You. My Lord, accept my repentance, wash my sin, answer my call, make firm my proof, make firm my tongue, guide my heart, and remove the treachery of my chest (Rabbi A’inni Wa La Tu’in Alayya, Wansurni Wa La Tansur Alayya, Wahdini Wa Yassir Lil-Huda, Wansurni Ala Man Bagha Alayya. Rabbij’alni Laka Shakkaran, Laka Dhak-Karan, Laka Rahhaban, Laka Mitwa’an, Laka Mikhbitan, Ilaika Awwahan Muniba. Rabbi Taqabbal Tawbati, Waghsil Hawbati, Wa Ajib Da’wati, Wa Thab-bit Hujjati, Wa Saddid Lisani Wahdi Qalbi, Waslul Sakhimata Sadri).”",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11381",
        "912",
        "19870",
        "17"
      ]
    },
    {
      "hadith_no": "4110",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، وأبو نعيم عن سفيان، عن محمد بن المنكدر، عن جابر، رضى الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن لكل نبي حواريا وإن حواري الزبير بن العوام ‏\"‏ ‏.‏ وزاد أبو نعيم فيه يوم الأحزاب قال ‏\"‏ من يأتينا بخبر القوم ‏\"‏ ‏.‏ قال الزبير أنا ‏.‏ قالها ثلاثا قال الزبير أنا ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir [may Allah be pleased with him]:                     that the Messenger of Allah (ﷺ) said: \"Indeed, every Prophet has a Hawari and, [indeed], my Hawari is Az-Zubair [bin Al-'Awwam].\"And Abu Na'im added in it: \"On the Day of Al-Ahzab, he (ﷺ) said: 'Who will bring us news about their party?' Az-Zubair said: 'I will.' He said it three times. Az-Zubair said (each time): 'I will.'\"",
      "chain": [
        "30277",
        "20668",
        "20348",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4136",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد الخدري، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     that the Messenger of Allah (ﷺ) said: \"Al-Hasan and Al-Husain are the chiefs of the youth of Paradise.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "546",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، - هو الحفري - عن سفيان، عن عبد الله بن أبي لبيد، عن أبي سلمة، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم هذه فإنهم يعتمون على الإبل وإنها العشاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah (ﷺ) said: 'Do not let the Bedouin make you change the name of this prayer of yours, for they delay the prayer until it is very dark because of their preoccupation with camels and milking them. Verily, it is 'Isha'.'\"",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11515",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "1501",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود الحفري، عن سفيان، عن الأسود بن قيس، عن ثعلبة بن عباد، عن سمرة، أن النبي صلى الله عليه وسلم خطب حين انكسفت الشمس فقال ‏\"‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Samurah that:                     The Prophet (ﷺ) delivered a Khutbah when the sun eclipsed and he said: 'Amma ba'd (to proceed).'\"",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "hadith_no": "1661",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو داود الحفري، عن حفص، عن حميد، عن عبد الله بن شقيق، عن عائشة، قالت رأيت النبي صلى الله عليه وسلم يصلي متربعا ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا روى هذا الحديث غير أبي داود وهو ثقة ولا أحسب هذا الحديث إلا خطأ والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I saw the Prophet (ﷺ) praying while sitting cross-legged.\"",
      "chain": [
        "30524",
        "20668",
        "20317",
        "11279",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "2714",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبدة بن عبد الله الصفار، قال حدثنا أبو داود، - يعني الحفري - عن سفيان، عن عمرو بن دينار، عن سعيد بن جبير، عن ابن عباس، قال مات رجل فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر وكفنوه في ثيابه ولا تخمروا وجهه ورأسه فإنه يبعث يوم القيامة ملبيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas Said:                     \" A man died, and the Messenger of Allah said: wash him with water and lotus leaves, and shroud him in his cloths, but do not cover his head and face, for he will be raised on the Day of Resurrection reciting the Talbiyah.",
      "chain": [
        "30149",
        "20668",
        "20012",
        "11081",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو داود الحفري، عمر بن سعد عن سفيان الثوري، عن ابن عون، عن نافع، عن ابن عمر، عن عمر، قال أصبت أرضا من أرض خيبر فأتيت رسول الله صلى الله عليه وسلم فقلت أصبت أرضا لم أصب مالا أحب إلى ولا أنفس عندي منها ‏.‏ قال ‏\"‏ إن شئت تصدقت بها ‏\"‏ ‏.‏ فتصدق بها - على أن لا تباع ولا توهب - في الفقراء وذي القربى والرقاب والضيف وابن السبيل لا جناح على من وليها أن يأكل بالمعروف غير متمول مالا ويطعم ‏.‏",
      "text_en": " It was narrated from Sufyan Ath-Thawri, from Ibn 'Awn, from Nafi', from Ibn 'Umar, from 'Umar, that he said:                      \"I was allocated some land of Khaibar. I came to the Messenger of Allah and said: 'I have acquired some land and I have never acquired any wealth that is dearer to me or more precious than it.' He said: 'If you wish, you can give it in charity.'\" So he gave it in charity on condition that it would not be bought or given away, for the poor, relatives, slaves, guests and wayfarers. And there is no sin on the administrator if he eats from it or feeds others on a reasonable basis, with no intention of becoming wealthy from it.",
      "chain": [
        "30123",
        "20668",
        "20012",
        "11071",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن أبي إسحاق، عن عمر بن سعد، قال حدثنا سعد بن أبي وقاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ قتال المسلم كفر وسبابه فسوق ‏\"‏ ‏.‏",
      "text_en": " Sa'd bin Abi Waqas told us that:                     The Messenger of Allah [SAW] said: \"Fighting a Muslim is Kufr and defaming him is evildoing.\"",
      "chain": [
        "30123",
        "20121",
        "20115",
        "11049",
        "20668",
        "9"
      ]
    },
    {
      "hadith_no": "4454",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا القاسم بن زكريا بن دينار، قال حدثنا أبو داود الحفري، عن سفيان، عن محمد بن عبد الرحمن، عن المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يأتي على الناس زمان ما يبالي الرجل من أين أصاب المال من حلال أو حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'There will come a time when a man will not care where his wealth comes from, whether (the source is) Halal or Haram.\"",
      "chain": [
        "30475",
        "20668",
        "20012",
        "11105",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4972",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود الحفري، عن سفيان، عن ابن جريج، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس على خائن ولا منتهب ولا مختلس قطع ‏\"‏ ‏.‏ ولم يسمعه أيضا ابن جريج من أبي الزبير ‏.‏",
      "text_en": " It was narrated from Sufyan, from Abu Az-Zubair, that Jabir said:                     \"The Messenger of Allah said: 'The pilferer is not to be cut off.\"' (Sahih)   Ibn Juraij also did not hear it from Abu Az-Zubair. Ibn Juraij also did not hear it from Abu Az-Zubair.",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5099",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا أبو داود الحفري، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن رسول الله صلى الله عليه وسلم الواشمات والموتشمات والمتنمصات والمتفلجات للحسن المغيرات ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] cursed the women who do tattoos and the women who have them done, Al-Mutanammisat, and the women who have their teeth separated for the sake of beauty, those who change (the creation of Allah.)\"",
      "chain": [
        "36587",
        "20668",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5117",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، - يعني الحفري - عن سفيان، عن الجريري، عن أبي نضرة، عن رجل، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'The perfume for men is that whose scent is apparent while its color is hidden, and the perfume for women is that whose color is apparent, while its scent is hidden.'\"",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "hadith_no": "5656",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود الحفري، وأبو أحمد الزبيري عن سفيان، عن منصور، عن سالم، عن جابر، أن رسول الله صلى الله عليه وسلم لما نهى عن الظروف شكت الأنصار فقالت يا رسول الله ليس لنا وعاء ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that :                     When the Messenger of Allah [SAW] forbade large water skins that are cut from the top and can no longer be closed, Ansar complained and said: \"O Messenger of Allah, we do not have any vessels.\" The Prophet [SAW] said: \"Then there is no harm.\"",
      "chain": [
        "30277",
        "20668",
        "20355",
        "20012",
        "11067",
        "11011",
        "34"
      ]
    },
    {
      "hadith_no": "2376",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو السائب، سلم بن جنادة حدثنا أبو داود الحفري، عن سفيان، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال اشتركت أنا وسعد، وعمار، يوم بدر فيما نصيب فلم أجئ أنا ولا عمار بشىء وجاء سعد برجلين ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"Sa'd, 'Ammar and I entered into a partnership on the day of Badr, (agreeing to share) whatever was allotted to us. 'Ammar and I did not get anything, but Sa'd got two men (slaves).\"",
      "chain": [
        "20668",
        "20012",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا موسى بن عبد الرحمن، أنبأنا أبو داود الحفري، عن سفيان، عن أبي الزبير، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يمسح أحدكم يده حتى يلعقها فإنه لا يدري في أى طعامه البركة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir that the Messenger of Allah (ﷺ) said:                     “Noneof you should wipe his hand until he has licked it, for he doesnotknow where the blessing if in his food.’”",
      "chain": [
        "20668",
        "20012",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4223",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو داود الحفري، حدثنا ياسين، عن إبراهيم بن محمد ابن الحنفية، عن أبيه، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المهدي منا أهل البيت يصلحه الله في ليلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali that the Messenger of Allah (ﷺ) said:                     \"Mahdi is one of us, the people of the Household. Allahrectifying himin a single night.\"",
      "chain": [
        "30203",
        "20668",
        "5"
      ]
    }
  ],
  "total_hadiths": 35
}