{
  "id": "20677",
  "name": "Ma'ql bin 'Ubaidullah معقل بن عبيد الله الجزري أبو عبد",
  "full_name": "Ma'ql bin 'Ubaidullah معقل بن عبيد الله الجزري أبو عبد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "166",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  د  س  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-'Absi",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "21944",
      "name": "'Ikrama bin Khalid bin Salma عكرمة بن خالد بن سلمة المخزومي",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10689",
      "name": "Suwayd bin Hjyr سويد بن حجير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20418",
      "name": "al-Hasan bin Muhammad bin A'yn الحسن بن محمد بن أعين",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28545",
      "name": "Muhammad bin Yazid bin Sinan محمد بن يزيد بن سنان الجزري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "119",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، أن رجلا، سأل رسول الله صلى الله عليه وسلم فقال أرأيت إذا صليت الصلوات المكتوبات وصمت رمضان وأحللت الحلال وحرمت الحرام ولم أزد على ذلك شيئا أأدخل الجنة قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال والله لا أزيد على ذلك شيئا ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that a man once said to the Messenger of Allah (may peace be upon him):                      Shall I enter Paradise in case I say the obligatory prayers, observe the (fasts) of Ramadan and treat that as lawful which has been made permissible (by the Shari'ah) and deny myself that what is forbidden, and make no addition to it? He (the Holy Prophet) replied in the affirmative. He (the inquirer) said: By Allah, I would add nothing to it.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "243",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن محمد بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أخبرني عمر بن الخطاب، أن رجلا، توضأ فترك موضع ظفر على قدمه فأبصره النبي صلى الله عليه وسلم فقال ‏\"‏ ارجع فأحسن وضوءك ‏\"‏ ‏.‏ فرجع ثم صلى ‏.‏",
      "text_en": " Jabir reported:                      'Umar b. Khattab said that a person performed ablution and left a small part equal to the space of a nail (unwashed). The Apostle of Allah (may peace be upon him) saw that and said: Go back and perform ablution well. He then went back (performed ablution well) and offered the prayer.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني سلمة بن شبيب، قال حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، عن أبي هريرة، أنه أخبره أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم فليفرغ على يده ثلاث مرات قبل أن يدخل يده في إنائه فإنه لا يدري فيم باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: When anyone amongst you wakes up from sleep, he should wash his hands three times before putting it in the utensil, for he does not know where his hand was during the night.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "13"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أيكم خاف أن لا يقوم من آخر الليل فليوتر ثم ليرقد ومن وثق بقيام من الليل فليوتر من آخره فإن قراءة آخر الليل محضورة وذلك أفضل ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      The most excellent prayer is that in which the duration of standing is longer.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1807",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الليل ساعة لا يوافقها عبد مسلم يسأل الله خيرا إلا أعطاه إياه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Our Lord, the Blessed and the Exalted, descends every night to the lowest heaven when one-third of the latter part of the night is left, and says: Who supplicates Me so that I may answer him? Who asks Me so that I may give to him? Who asks Me forgiveness so that I may forgive him?",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3198",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن زيد بن أبي، أنيسة عن يحيى بن حصين، عن جدته أم الحصين، قال سمعتها تقول، حججت مع رسول الله صلى الله عليه وسلم حجة الوداع فرأيته حين رمى جمرة العقبة وانصرف وهو على راحلته ومعه بلال وأسامة أحدهما يقود به راحلته والآخر رافع ثوبه على رأس رسول الله صلى الله عليه وسلم من الشمس - قالت - فقال رسول الله صلى الله عليه وسلم قولا كثيرا ثم سمعته يقول ‏\"‏ إن أمر عليكم عبد مجدع - حسبتها قالت - أسود يقودكم بكتاب الله تعالى فاسمعوا له وأطيعوا ‏\"‏ ‏.‏",
      "text_en": " Umm al-Husain (Allah be pleased with her) reported:                      I performed Hajj along with Allah's Messenger (may peace be upon him) on the occasion of the Farewell Pilgrimage and saw him when he flung pebbles at Jamrat al-'Aqaba and returned while he was riding the camel, and Bilal and Usama were with him. One of them was leading his camel, while the other was raising his cloth over the head of Allah's Messenger (may peace be upon him) to protect him from the sun. She (further) said: Allah's Messenger (may peace be upon him) said so many things, and I heard him saying: If a slave having some limb of his missing and having dark complexion is appointed to govern you according to the Book of Allah the Exalted. listen to him and obey him.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11340"
      ]
    },
    {
      "hadith_no": "3203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله الجزري - عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الاستجمار تو ورمى الجمار تو والسعى بين الصفا والمروة تو والطواف تو وإذا استجمر أحدكم فليستجمر بتو ‏\"‏ ‏.‏",
      "text_en": " Jabir (b. Abdullab) (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Odd number of stones are to be used for cleaning (the private parts after answering the call of nature), and casting of pebbles at the Jamras is to be done by odd numbers (seven), and (the number) of circuits between al-Safa' and al-Marwa is also odd (seven), and the number of circuits (around the Ka'ba) is also odd (seven). Whenever any one of you is required to use stones (for cleaning the private parts) he should use odd number of stones (three, five or seven).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال سألت جابرا عن ركوب الهدى، فقال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ اركبها بالمعروف حتى تجد ظهرا ‏\"‏ ‏.‏",
      "text_en": " Abu Zubair reported:                      I asked Jabir (Allah be pleased with him) about riding on the sacrificial animal, to which he replied: I heard Allah's Apostle (may peace be upon him) as saying: Ride on them gently until you find another mount.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3373",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا ابن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لأحدكم أن يحمل بمكة السلاح‏\"‏ ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported:                      I heard Allah's Apostle (may peace be upon him) say: It is not permissible for any one of you to carry weapons in Mecca.",
      "chain": [
        "30417",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3475",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال قال جابر سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا أحدكم أعجبته المرأة فوقعت في قلبه فليعمد إلى امرأته فليواقعها فإن ذلك يرد ما في نفسه ‏\"‏ ‏.‏",
      "text_en": " Jabir heard Allah's Apostle (may peace be upon him) say:                      When a woman fascinates any one of you and she captivates his heart, he should go to his wife and have an intercourse with her, for it would repel what he feels.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن ابن أبي عبلة، عن عمر بن عبد العزيز، قال حدثنا الربيع بن سبرة الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن المتعة وقال ‏\"‏ ألا إنها حرام من يومكم هذا إلى يوم القيامة ومن كان أعطى شيئا فلا يأخذه ‏\"‏ ‏.‏",
      "text_en": " Sabra al-Juhanni reported on the authority of his father:                      Allah's Messenger (may peace be upon him) prohibited the contracting of temporary marriage and said: Behold, it is forbidden from this very day of yours to the Day of Resurrection, and he who has given something (as a dower) should not take it back.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11010",
        "11847"
      ]
    },
    {
      "hadith_no": "3633",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن عطاء، قال سمعت جابرا، يقول لقد كنا نعزل على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported:                      We used to practise 'azl during the life of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4098",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال سألت جابرا عن ثمن الكلب، والسنور، قال زجر النبي صلى الله عليه وسلم عن ذلك ‏.‏",
      "text_en": " Abu Zubair said:                      I asked Jabir about the price of a dog and a cat; he said: Allah's Messenger (may peace be upon him) disapproved of that.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي قزعة، الباهلي عن أبي نضرة، عن أبي سعيد، قال أتي رسول الله صلى الله عليه وسلم بتمر فقال ‏\"‏ ما هذا التمر من تمرنا ‏\"‏ ‏.‏ فقال الرجل يا رسول الله بعنا تمرنا صاعين بصاع من هذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا الربا فردوه ثم بيعوا تمرنا واشتروا لنا من هذا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      Dates were brought to Allah's Messenger (may peace be upon him), and he said: These dates are not like our dates, whereupon a man said: We sold two sa's of our dates (in order to get) one sa', of these (fine dates), whereupon Allah's Messenger (may peace be upon him) said: That is interest; so return (these dates of fine quality), and get your (inferior dates) ; then sell our dates (for money) and buy for us (with the help of money) such (fine dates).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4508",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن امرأة، من بني مخزوم سرقت فأتي بها النبي صلى الله عليه وسلم فعاذت بأم سلمة زوج النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ والله لو كانت فاطمة لقطعت يدها ‏\"‏ ‏.‏ فقطعت ‏.‏",
      "text_en": " Jaibir reported that a woman from the tribe of Makhzum committed theft. She was brought to Allah's Apostle (may peace be upon him) and she sought refuge (intercession) from Umm Salama, the wife of Allah's Apostle (may peace be upon him). Thereupon Allah's Apostle (may peace be upon him) said:                      By Allah, even if she were Fatima, I would have her hand cut off. And thus her hand was cut off.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4868",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن زيد بن أبي، أنيسة عن يحيى بن حصين، عن جدته أم الحصين، قال سمعتها تقول، حججت مع رسول الله صلى الله عليه وسلم حجة الوداع - قالت - فقال رسول الله صلى الله عليه وسلم قولا كثيرا ثم سمعته يقول ‏\"‏ إن أمر عليكم عبد مجدع - حسبتها قالت - أسود يقودكم بكتاب الله فاسمعوا له وأطيعوا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Yahya b. Husain who learnt the tradition from his grandmother. Umm Husain. He said':                      I heard her say: I performed Hajjat-ul-Wada' in the company of the Messenger of Allah (may peace be upon him). He said a lot of things (on this occasion). Then I heard him say: If a maimed slave is appointed a commander over you the narrator says: I think she said:\" a black stave\" who leads you according to the Book of Allah, then listen to him and obey him.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11340"
      ]
    },
    {
      "hadith_no": "5154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال سألت جابرا عن الضب، فقال لا تطعموه ‏.‏ وقذره وقال قال عمر بن الخطاب إن النبي صلى الله عليه وسلم لم يحرمه ‏.‏ إن الله عز وجل ينفع به غير واحد فإنما طعام عامة الرعاء منه ولو كان عندي طعمته ‏.‏",
      "text_en": " Abu Zubair reported:                      I asked Jabir about ithe eating) of the lizard, whereupon he said: Don't eat that as he (the Holy Prophet) felt disgust. He (the narrator) said that Umar b. al-Khattab reminded: Allah's Apostle (may peace be upon him) did not declare it to be unlawful. Allah, the Exalted and Majestic, has (made it a source) of benefit for more than one (persons). It is a common diet of the shepherds. Had it been with me, I would have eaten that.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "5359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن الزهري، عن  سعيد بن المسيب، أنه سمع أبا هريرة، يقول أتي رسول الله صلى الله عليه وسلم ‏.‏ بمثله ولم يذكر بإيلياء ‏.‏",
      "text_en": " This hadith is narrated on the authority of Abu Huraira through another chain of transmitters, but he did not mention Aelia (Capitolina. i. e. Bait al-Maqdis).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "5615",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول في غزوة غزوناها ‏\"‏ استكثروا منالنعال فإن الرجل لا يزال راكبا ما انتعل ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apostle (may peace be upon him) saying during an expedition in which we also participated: Make a general practice of wearing sandals, for a man is riding as it were when he wears sandals.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5674",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم مر عليه حمار قد وسم في وجهه فقال ‏\"‏ لعن الله الذي وسمه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that there happened to pass before Allah's Apostle (may peace be upon him) an ass the face of which had been cauterised, whereupon he said:                      Allah has cursed one who has cauterised it (on the face).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5817",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقيمن أحدكم أخاه يوم الجمعة ثم ليخالف إلى مقعده فيقعد فيه ولكن يقول افسحوا ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Apostle (may peace he upon him) as saying:                      None amongst you should make his brother stand on Friday (during the congregational prayer) and then occupy his-place. but he should only say to him (Accommodate me).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5953",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن الزهري، أخبرني يحيى بن عروة، أنه سمع عروة، يقول قالت عائشة سأل أناس رسول الله صلى الله عليه وسلم عن الكهان فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ليسوا بشىء ‏\"‏ ‏.‏ قالوا يا رسول الله فإنهم يحدثون أحيانا الشىء يكون حقا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الجن يخطفها الجني فيقرها في أذن وليه قر الدجاجة فيخلطون فيها أكثر من مائة كذبة ‏\"‏ ‏.‏",
      "text_en": " 'Urwa reported from 'A'isha that she said that people asked Allah's Messenger (may peace be upon him) about the kahins. Allah's Messenger (may peace be upon him) said to them:                      It is nothing (i. e. it is a mere superstition). They said: Allah's Messenger, they at times narrate to us things which we find true. Thereupon Allah's Messenger (may peace be upon him) said: That is a word pertaining to truth which a jinn snatches away and then cackles into the ear of his friend as the hen does. And then they mix in it more than one hundred lies.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6084",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن أم مالك، كانت تهدي للنبي صلى الله عليه وسلم في عكة لها سمنا فيأتيها بنوها فيسألون الأدم وليس عندهم شىء فتعمد إلى الذي كانت تهدي فيه للنبي صلى الله عليه وسلم فتجد فيه سمنا فما زال يقيم لها أدم بيتها حتى عصرته فأتت النبي صلى الله عليه وسلم فقال ‏\"‏ عصرتيها ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ لو تركتيها ما زال قائما ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that Umm Malik used to send clarified butter in a small skin to the Apostle of Allah (may peace be upon him). Her sons would come to her and ask for seasoning when they had nothing with them (in the form of condiments) and she would go to that (skin) in which she offered (clarified butter) to Allah's Apostle (may peace be upon him), and she would find in that clarified butter and it kept providing her with seasoning for her household until she had (completely) squeezed it. She came to Allah's Apostle (may peace be upon him) and (informed him about it). Thereupon, he (the Holy Prophet) said:                      Did you squeeze it? She said: Yes. Thereupon he said: If you had left it in that very state, it would have kept on provid- ing you (the clarified butter) on end.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6085",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن رجلا، أتى النبي صلى الله عليه وسلم يستطعمه فأطعمه شطر وسق شعير فما زال الرجل يأكل منه وامرأته وضيفهما حتى كاله فأتى النبي صلى الله عليه وسلم فقال ‏\"‏ لو لم تكله لأكلتم منه ولقام لكم ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that a person came to Allah's Apostle (may peace be upon him) and asked for food. And he gave him half a wasq of barley, and the person and his wife and their guests kept on making use of it (as a food) until he weighed it (in order to find out the actual quantity, and it was no more). He came to Allah's Apostle (may peace be upon him) (and informed him about it). He said:                      Had you not weighed it, you would be eating out of it and it would have remained intact for you.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6592",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، كلهم قال عن النبي صلى الله عليه وسلم قال ‏\"‏ أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through other chains of transmitters but all of them narrated on the authority of Jabir that Allah's Apostle (may peace be upon him) said:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263"
      ]
    },
    {
      "hadith_no": "7195",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن الزهري، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن عمه، عبيد الله بن كعب وكان قائد كعب حين أصيب بصره وكان أعلم قومه وأوعاهم لأحاديث أصحاب رسول الله صلى الله عليه وسلم قال سمعت أبي كعب بن مالك وهو أحد الثلاثة الذين تيب عليهم يحدث أنه لم يتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط غير غزوتين ‏.‏ وساق الحديث وقال فيه وغزا رسول الله صلى الله عليه وسلم بناس كثير يزيدون على عشرة آلاف ولا يجمعهم ديوان حافظ ‏.‏",
      "text_en": " It is reported on the authority of Abdullah b. K'ab and he was the guide of Ka'b as he lost his eyesight and he was the greatest scholar amongst his people and he retained in his mind many ahadith of the Companions of Allah's Messenger (may peace be upon him). He said:                      I heard my father Ka'b b. Malik, and he fas one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger (may peace be upon him) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are:\" That Allah's Messenger (may peace be upon him) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.\"",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11013",
        "11519"
      ]
    },
    {
      "hadith_no": "7285",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن  جابر، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ يبعث الشيطان سراياه فيفتنون الناس فأعظمهم عنده منزلة أعظمهم فتنة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that Allah's Apostle (may peace be upqn him) said:                      The Satan sends detachments of his own in order to put people to trial and the highest in rank, in his eyes, is one who is most notorious in sowing the seed of dissension.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "7299",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن  جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يدخل أحدا منكم عمله الجنة ولا يجيره من النار ولا أنا إلا برحمة من الله ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apoetle (may peace be upon him) as saying: None of you would get into Paradise because of his good deeds alone, and he would not be rescued from Fire, not even I, but because of the Mercy of Allah.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1796",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا معقل، عن عطاء، قال أخبرت أن أم حبيبة بنت أبي سفيان قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من ركع ثنتى عشرة ركعة في يومه وليلته سوى المكتوبة بنى الله له بها بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ata said:                     \"I was told that Umm Habibah bin Abi Sufyan said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever prays twelve rak'ahs during the day and night, apart from the prescribed prayers, Allah (SWT) will build for him a house in Paradise.'\"",
      "chain": [
        "38591",
        "20418",
        "20677",
        "11029",
        "59"
      ]
    },
    {
      "hadith_no": "3425",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا معقل، عن الزهري، قال أخبرني عبد الرحمن بن عبد الله بن كعب، عن عمه، عبيد الله بن كعب قال سمعت أبي كعبا، يحدث قال أرسل إلى رسول الله صلى الله عليه وسلم وإلى صاحبى أن رسول الله صلى الله عليه وسلم يأمركم أن تعتزلوا نساءكم فقلت للرسول أطلق امرأتي أم ماذا أفعل قال لا بل تعتزلها ولا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني فيهم حتى يقضي الله عز وجل ‏.‏ فلحقت بهم ‏.‏ خالفه معمر ‏.‏",
      "text_en": " It was narrated from Ma'qil, from Az-Zuhri who said:                      \"Abdur-Rahman bin 'Abdullah bin Ka'b narrated that his paternal uncle 'Ubaidullah bin Ka'b said: 'I heard my father Ka'b say: The Messenger of Allah sent word to me and my two companions saying: The Messenger of Allah commands you to keep away from your wives. I said to the envoy: Should I divorce my wife, or what should I do? He said: No, just keep away from her and do not come near her. I said to my wife: Go to your family and stay with them until Allah, the Mighty and Sublime, decides (concerning me). So she went to them.'\"",
      "chain": [
        "38591",
        "20418",
        "20677",
        "11013",
        "11519"
      ]
    },
    {
      "hadith_no": "3826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا معقل، عن الزهري، قال أخبرني عبد الرحمن بن عبد الله بن كعب، عن عمه، عبيد الله بن كعب قال سمعت أبي كعب بن مالك، يحدث قال قلت يا رسول الله إن الله عز وجل إنما نجاني بالصدق وإن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ فقال ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏ ‏.‏ قلت فإني أمسك سهمي الذي بخيبر ‏.‏",
      "text_en": " It was narrated from 'Ubaydullah bin Ka'b:                      \"I heard my father Ka'b bin Malik narrate: 'I said: O Messenger of Allah, Allah, the Mighty and Sublime, has saved me by my being truthful, and as part of my repentance I want to give my wealth in charity to Allah and His Messenger. He said: Keep some of your wealth for yourself; that is better for you. I said: I will keep my share that is in Khaibar.'\"",
      "chain": [
        "38591",
        "20418",
        "20677",
        "11013",
        "11519"
      ]
    },
    {
      "hadith_no": "4891",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا معقل، عن أبي الزبير، عن جابر، أن امرأة، من بني مخزوم سرقت فأتي بها النبي صلى الله عليه وسلم فعاذت بأم سلمة فقال النبي صلى الله عليه وسلم ‏\"‏ لو كانت فاطمة بنت محمد لقطعت يدها ‏\"‏ ‏.‏ فقطعت يدها ‏.‏",
      "text_en": " It was narrated from Jabir that:                     a woman from Banu Makhzum stole (something), and she was brought to the Prophet. She sought the protection of Umm Salamah, but the Prophet said: \"If Fatimah bint Muhammad were to steal, I would cut off her hand.\" And he ordered that her hand be cut off.",
      "chain": [
        "38591",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 32
}