{
  "id": "20675",
  "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
  "full_name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims",
      " Abdulas"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Hadrami",
      "Judge",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11151",
      "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10942",
      "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19909",
      "name": "Rashid bin Sa'd راشد بن سعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11515",
      "name": "'Abdullah bin Abi Labid عبد الله بن أبي لبيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10948",
      "name": "'Ali bin Abi Talha علي بن أبي طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10884",
      "name": "al-Ala' bin al-Harith bin 'Abdul Warith العلاء بن الحارث بن عبد الوارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10899",
      "name": "Habib bin 'Ubaid al-Rhby حبيب بن عبيد الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18018",
      "name": "Azhar bin Sa'id al-Harazi أزهر بن سعيد الحرازي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12321",
      "name": "Abd al-Whab bin Bkht عبد الوهاب بن بخت",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20537",
      "name": "Hmad bin Khalid al-Khyat حماد بن خالد الخياط القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20190",
      "name": "Bashr bin al-Sari al-Afwah بشر بن السري أبو عمرو الأفوه",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28040",
      "name": "Asad bin Musa - Asad al-Sunnah أسد بن موسى بن إبراهيم - أسد السنة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "36036",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن محمد أبو صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن عقبة بن عامر، ح وحدثني أبو عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كانت علينا رعاية الإبل فجاءت نوبتي فروحتها بعشي فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس فأدركت من قوله ‏\"‏ ما من مسلم يتوضأ فيحسن وضوءه ثم يقوم فيصلي ركعتين مقبل عليهما بقلبه ووجهه إلا وجبت له الجنة ‏\"‏ ‏.‏ قال فقلت ما أجود هذه ‏.‏ فإذا قائل بين يدى يقول التي قبلها أجود ‏.‏ فنظرت فإذا عمر قال إني قد رأيتك جئت آنفا قال ‏\"‏ ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ - الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبد الله ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (may peace be upon him) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umair who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.",
      "chain": [
        "30514",
        "20033",
        "20675",
        "11414",
        "11027",
        "189",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير بن مالك الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم ‏.‏ قال فذكر مثله غير أنه قال ‏\"‏ من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir al-Juhani reported:                      Verily the Messenger of Allah (may peace be upon him) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "307",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة عن وتر، رسول الله صلى الله عليه وسلم ‏.‏ فذكر الحديث قلت كيف كان يصنع في الجنابة أكان يغتسل قبل أن ينام أم ينام قبل أن يغتسل قالت كل ذلك قد كان يفعل ربما اغتسل فنام وربما توضأ فنام ‏.‏ قلت الحمد لله الذي جعل في الأمر سعة ‏.‏",
      "text_en": " 'Abdullah b. Abu'l-Qais reported:                      I asked 'A'isha about the Witr (prayer) of the Messenger of Allah (may peace be upon him) and made mention of a hadith, then I said: What did he do after having sexual intercourse? Did he take a bath before going to sleep or did he sleep before taking a bath? She said: He did all these. Some- times he took a bath and then slept, and sometimes he performed ablution only and went to sleep. I (the narrator) said: Praise be to Allah Who has made things easy (for human beings).",
      "chain": [
        "30367",
        "20023",
        "20675",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن ربيعة، قال حدثني قزعة، قال أتيت أبا سعيد الخدري وهو مكثور عليه فلما تفرق الناس عنه قلت إني لا أسألك عما يسألك هؤلاء عنه - قلت - أسألك عن صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقال ما لك في ذاك من خير ‏.‏ فأعادها عليه فقال كانت صلاة الظهر تقام فينطلق أحدنا إلى البقيع فيقضي حاجته ثم يأتي أهله فيتوضأ ثم يرجع إلى المسجد ورسول الله صلى الله عليه وسلم في الركعة الأولى ‏.‏",
      "text_en": " Qaz'a reported:                      I came to Abu Sa'id al-Khudri and he was surrounded by people. When the people departed from him I said: I am not going to ask you what these people have been asking you. I want to ask you about the prayer of the Messenger of Allah (may peace be upon him). He (Abu Sa'id) said: There is no good for you in this. He (Qaz'a), however, repeated (his demand). He then said: The noon prayer would start and one of us would go to Baqi' and, having relieved himself, would come to his home, then perform ablution and go to the mosque, and (he would find) The Messenger of Allah (may peace be upon him) in the first rak'ah.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "11162"
      ]
    },
    {
      "hadith_no": "1239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن معاوية بن صالح، يقول حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا ‏.‏ وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ‏.‏ ثلاث مرات ثم قلت ألعنك بلعنة الله التامة فلم يستأخر ثلاث مرات ثم أردت أخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' reported:                      Allah's Messenger (may peace be upon him) stood up (to pray) and we heard him say:\" I seek refuge in Allah from thee.\" Then said:\" curse thee with Allah's curse\" three times, then he stretched out his hand as though he was taking hold of something. When he finished the prayer, we said: Messenger of Allah, we heard you say something during the prayer which we have not heard you say before, and we saw you stretch out your hand. He replied: Allah's enemy Iblis came with a flame of fire to put it in my face, so I said three times:\" I Seek refuge in Allah from thee.\" Then I said three times:\" I curse thee with Allah's full curse.\" But he did not retreat (on any one of these) three occasions. Thereafter I meant to seize him. I swear by Allah that had it not been for the supplication of my brother Sulaiman he would have been bound, and made an object of sport for the children of Medina.",
      "chain": [
        "30491",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "2205",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، عن معاوية بن صالح، ح وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، حدثنا عبد العزيز، - يعني ابن مسلم - كلهم عن يحيى بن سعيد، بهذا   الإسناد ‏.‏ نحوه ‏.‏ وفي حديث عبد العزيز وما تركت رسول الله صلى الله عليه وسلم   من العي ‏.‏",
      "text_en": " This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters like one narrated by 'Abd al-'Aziz (with the change of these words):                     \" You did not spare the Messenger of Allah (may peace be upon him) the botheration.\"",
      "chain": [
        "30201",
        "20331",
        "20029",
        "20675",
        "30494",
        "20250",
        "11062"
      ]
    },
    {
      "hadith_no": "2276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، أخبرنا ابن وهب، أخبرني معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، سمعه يقول سمعت عوف بن مالك، يقول صلى رسول الله صلى الله عليه وسلم على جنازة فحفظت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة وأعذه من عذاب القبر أو من عذاب النار ‏\"‏ ‏.‏ قال حتى تمنيت أن أكون أنا ذلك الميت ‏.‏ قال وحدثني عبد الرحمن بن جبير حدثه عن أبيه عن عوف بن مالك عن النبي صلى الله عليه وسلم بنحو هذا الحديث أيضا ‏.‏",
      "text_en": " Jubair b. Nufair says:                      I heard it from 'Auf b. Malik that the Holy Prophet (may peace be upon him) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10899",
        "4097",
        "10805"
      ]
    },
    {
      "hadith_no": "2436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، حدثني ربيعة بن يزيد الدمشقي، عن عبد الله بن عامر اليحصبي، قال سمعت معاوية، يقول إياكم وأحاديث إلا حديثا كان في عهد عمر فإن عمر كان يخيف الناس في الله عز وجل سمعت رسول الله صلى الله عليه وسلم وهو يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما أنا خازن فمن أعطيته عن طيب نفس فيبارك له فيه ومن أعطيته عن مسألة وشره كان كالذي يأكل ولا يشبع ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya said:                      Be cautious about ahadith except those which were current during the reign of Umar, for he exhorted people to ftar Allah, the Exalted and majestic. I heard the Messenger of Allah (may peace be upon him) as saying: He upon whom Allah intends to bestow goodness, He confers upon him an insight in religion; and I heard the Messenger of Allah (way peace be upon him) as saying: I am the treasurer. To one whom I give out of (my own) sweet will, he would be blessed in that, but he whom I give (yielding to his constant begging and for his covetousness is like one who would eat, but would not be satisfied.",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "10882",
        "27"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن ربيعة، قال حدثني قزعة، قال أتيت أبا سعيد الخدري - رضى الله عنه - وهو مكثور عليه فلما تفرق الناس عنه قلت إني لا أسألك عما يسألك هؤلاء عنه ‏.‏ سألته عن الصوم في السفر فقال سافرنا مع رسول الله صلى الله عليه وسلم إلى مكة ونحن صيام قال فنزلنا منزلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم قد دنوتم من عدوكم والفطر أقوى لكم ‏\"‏ ‏.‏ فكانت رخصة فمنا من صام ومنا من أفطر ثم نزلنا منزلا آخر فقال ‏\"‏ إنكم مصبحو عدوكم والفطر أقوى لكم فأفطروا ‏\"‏ ‏.‏ وكانت عزمة فأفطرنا ثم قال لقد رأيتنا نصوم مع رسول الله صلى الله عليه وسلم بعد ذلك في السفر ‏.‏",
      "text_en": " Qaza'a reported:                      I came to Abu Sa'id al-Khudri (Allah be pleased with him) and he was surrounded (by people), and when they dispersed I said to him: I am not going to ask you about what these people were asking. I ask you about fasting on a journey. Upon this he said: We travelled with the Messenger of Allah (may peace be upon him) towards Mecca and we had been observing fast. We halted at a place. There the Messenger of Allah (may peace be upon him) said: You are nearing your enemy and breaking of fast would give you greater strength, and that was a concession (given to us). But some of us continued to observe the fast and some of us broke it. We then got down at another place and he (the Holy Prophet) said: You are going to encounter the enemy in the morning and breaking of the fast would give you strength, so break the fast. As it was a point of stress, so we broke the fast. But subsequently we saw ourselves observing the fast with the Messenger of Allah (may peace be upon him) on a journey.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "11162"
      ]
    },
    {
      "hadith_no": "3627",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرني معاوية، - يعني ابن صالح - عن علي بن أبي طلحة، عن أبي الوداك، عن أبي سعيد الخدري، سمعه يقول سئل رسول الله صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما من كل الماء يكون الولد وإذا أراد الله خلق شىء لم يمنعه شىء ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) was asked about 'azl, whereupon he said:                      The child does not come from all the liquid (sermen) and when Allah intends to create anything nothing can prevent it (from coming into existence).",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10948",
        "10752",
        "38"
      ]
    },
    {
      "hadith_no": "4669",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، أخبرني معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال قتل رجل من حمير رجلا من العدو فأراد سلبه فمنعه خالد بن الوليد وكان واليا عليهم فأتى رسول الله صلى الله عليه وسلم عوف بن مالك فأخبره فقال لخالد ‏\"‏ ما منعك أن تعطيه سلبه ‏\"‏ ‏.‏ قال استكثرته يا رسول الله ‏.‏ قال ‏\"‏ ادفعه إليه ‏\"‏ ‏.‏ فمر خالد بعوف فجر بردائه ثم قال هل أنجزت لك ما ذكرت لك من رسول الله صلى الله عليه وسلم فسمعه رسول الله صلى الله عليه وسلم فاستغضب فقال ‏\"‏ لا تعطه يا خالد لا تعطه يا خالد هل أنتم تاركون لي أمرائي إنما مثلكم ومثلهم كمثل رجل استرعي إبلا أو غنما فرعاها ثم تحين سقيها فأوردها حوضا فشرعت فيه فشربت صفوه وتركت كدره فصفوه لكم وكدره عليهم ‏\"‏ ‏.‏",
      "text_en": " Auf b. Malik has narrated that a man from the Himyar tribe killed an enemy and wanted to take the booty. Khalid b. Walid, who was the commander over them, forbade, him. 'Auf b Malik (the narrator) came to the Messenger of Allah (may peace be upon him) and informed him (to this effect). The latter asked Khalid:                      What prevented you from giving the booty to him? Khalid said: I thought it was too much. He (the Holy Prophet) said: Hand it over to him. Now when Khalid by Auf, the latter pulled him by his cloak and said (by way of chafing him): Hasn't the same thing happened what I reported to you from the Messenger of Allah (may peace he upon him)? When the Messenger of Allah (may peace be upon him) heard it. he was angry (and said): Khalid, don't give him, Khalid, don't give him. Are you going to desert the commanders appointed by roe? Your similitude and theirs is like a person who took camels and sheep for grazing. He grazed them and when it was time for them to have a drink, he brought them to a pool. So they drank from it, drinking away its clear water and leaving the turbid water below So the clear water (i. e. the best reward) is for you and the turbid water (i e. blame) is for them.",
      "chain": [
        "20029",
        "20675",
        "10865",
        "10805"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا أبو عبد الله، حماد بن خالد الخياط عن  معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رميت بسهمك فغاب عنك فأدركته فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba reported Allah's Messenger (may peace be upon him) having said this:                      If you shoot with your arrow and (the game) goes out of your sight and you find it (later on), then eat that if it has not gone rotten.",
      "chain": [
        "30383",
        "30184",
        "20675",
        "10865",
        "4056"
      ]
    },
    {
      "hadith_no": "5096",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء، عن مكحول، عن أبي ثعلبة الخشني، عن النبي صلى الله عليه وسلم حديثه في الصيد ثم قال ابن حاتم حدثنا ابن مهدي عن معاوية عن عبد الرحمن بن جبير وأبي الزاهرية عن جبير بن نفير عن أبي ثعلبة الخشني ‏.‏ بمثل حديث العلاء غير أنه لم يذكر نتونته وقال في الكلب ‏\"‏ كله بعد ثلاث إلا أن ينتن فدعه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Tha'laba al- Khushani with a slight variation of (words):                      He (the Holy Prophet) said in regard to the game killed by (a trained) dog: Eat after three days provided it has not gone rotten.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "10606",
        "11066",
        "4056"
      ]
    },
    {
      "hadith_no": "5223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثني زهير بن حرب، حدثنا معن بن عيسى، حدثنا معاوية بن صالح، عن أبي، الزاهرية عن جبير بن نفير، عن ثوبان، قال ذبح رسول الله صلى الله عليه وسلم ضحيته ثم قال ‏\"‏ يا ثوبان أصلح لحم هذه ‏\"‏ ‏.‏ فلم أزل أطعمه منها حتى قدم المدينة ‏.‏",
      "text_en": " Thauban reported that Allah's Messenger (way peace be upon him) slaughtered his sacrificial animal and then said:                      Thauban, make his meat usable (for journey), and I continuously served him that until he arrived in Medina.",
      "chain": [
        "30022",
        "30112",
        "20675",
        "10901",
        "4097",
        "130"
      ]
    },
    {
      "hadith_no": "5862",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني معاوية بن صالح، عن عبد الرحمن، بن جبير عن أبيه، عن عوف بن مالك الأشجعي، قال كنا نرقي في الجاهلية فقلنا يا رسول الله كيف ترى في ذلك فقال ‏\"‏ اعرضوا على رقاكم لا بأس بالرقى ما لم يكن فيه شرك ‏\"‏ ‏.‏",
      "text_en": " 'Auf b. Malik Ashja'i reported We practised incantation in the pre-Islamic days and we said:                      Allah's Messenger. what is your opinion about it? He said: Let me know your incantation and said: There is no harm in the incantation which does not smack of polytheism.",
      "chain": [
        "20029",
        "20675",
        "10865",
        "3051"
      ]
    },
    {
      "hadith_no": "6680",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا ابن مهدي، عن معاوية بن صالح، عن  عبد الرحمن بن جبير بن نفير، عن أبيه، عن النواس بن سمعان الأنصاري، قال سألت رسول الله صلى الله عليه وسلم عن البر والإثم فقال ‏\"‏ البر حسن الخلق والإثم ما حاك في صدرك وكرهت أن يطلع عليه الناس ‏\"‏ ‏.‏",
      "text_en": " Nawwas b. Sam'an al-Ansari reported:                      I asked Allah's Messenger (may peace be upon him) about virtue and vice. He said: Virtue is a kind disposition and vice is what rankles in your heart and that you disapprove that people should come to know of it.",
      "chain": [
        "30514",
        "20033",
        "20675",
        "10942",
        "3600"
      ]
    },
    {
      "hadith_no": "6681",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، حدثني معاوية، - يعني ابن صالح - عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن نواس بن سمعان، قال أقمت مع رسول الله صلى الله عليه وسلم بالمدينة سنة ما يمنعني من الهجرة إلا المسألة كان أحدنا إذا هاجر لم يسأل رسول الله صلى الله عليه وسلم عن شىء - قال - فسألته عن البر والإثم فقال رسول الله صلى الله عليه وسلم ‏\"‏ البر حسن الخلق والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ‏\"‏ ‏.‏",
      "text_en": " Nawwas b. Sam'an reported:                      I stayed with Allah's Messenger (may peace be upon him) for one year. What obstructed me to migrate was (nothing) but (persistent) inquiries from him (about Islam). (It was a common observation) that when anyone of us migrated (to Medina) he ceased to ask (too many questions) from Allah's Messenger (may peace be upon him). So I asked him about virtue and vice. Thereupon Allah's Messenger (may peace be upon him) said: Virtue is a kind disposition and vice is what rankles in your mind and that you disapprove of its being known to the people.",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10942"
      ]
    },
    {
      "hadith_no": "7112",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني معاوية، - وهو ابن صالح - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يزال يستجاب للعبد ما لم يدع بإثم أو قطيعة رحم ما لم يستعجل ‏\"‏ ‏.‏ قيل يا رسول الله ما الاستعجال قال ‏\"‏ يقول قد دعوت وقد دعوت فلم أر يستجيب لي فيستحسر عند ذلك ويدع الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The supplication of the servant is granted in case he does not supplicate for sin or for severing the ties of blood, or he does not become impatient. It was said: Allah's Messenger, what does:\" If he does not grow impatient\" imply? He said: That he should say like this: I supplicated and I supplicated but I did not find it being responded. and theu he becomes frustrated and abandons supplication.",
      "chain": [
        "20029",
        "20675",
        "11414",
        "11027",
        "13"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن معاوية بن صالح، عن أبي مريم، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا استيقظ أحدكم من نومه فلا يدخل يده في الإناء حتى يغسلها ثلاث مرات فإن أحدكم لا يدري أين باتت يده أو أين كانت تطوف يده ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported :                      I heard the Messenger of Allah (May Peace be upon him) say: When any of you wakes up from sleep, he should not put his hand in the utensil until he washes it three times, for none of you knows where his hand remained during the night or where it went round.",
      "chain": [
        "30485",
        "30491",
        "20029",
        "20675",
        "13"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن عبد العزيز بن مسلم، عن أبي معقل، عن أنس بن مالك، قال رأيت رسول الله صلى الله عليه وسلم يتوضأ وعليه عمامة قطرية فأدخل يده من تحت العمامة فمسح مقدم رأسه ولم ينقض العمامة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I saw the Messenger (ﷺ) perform ablution. He had a Qutri turban. He inserted his hand beneath the turban and wiped over the forelock, and did not untie the turban.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "20253",
        "19384",
        "19"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، سمعت معاوية، - يعني ابن صالح - يحدث عن أبي عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كنا مع رسول الله صلى الله عليه وسلم خدام أنفسنا نتناوب الرعاية رعاية إبلنا فكانت على رعاية الإبل فروحتها بالعشي فأدركت رسول الله صلى الله عليه وسلم يخطب الناس فسمعته يقول ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقوم فيركع ركعتين يقبل عليهما بقلبه ووجهه إلا قد أوجب ‏\"‏ ‏.‏ فقلت بخ بخ ما أجود هذه ‏.‏ فقال رجل من بين يدى التي قبلها يا عقبة أجود منها ‏.‏ فنظرت فإذا هو عمر بن الخطاب فقلت ما هي يا أبا حفص قال إنه قال آنفا قبل أن تجيء ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقول حين يفرغ من وضوئه أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏ قال معاوية وحدثني ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir said:                      We served ourselves in the company of Messenger of Allah (ﷺ). We tended our camels by turn. One day I had my turn to tend the camels, and I drove them in the afternoon. I found the Messenger of Allah (ﷺ) addressing the people. I heard him say: Anyone amongst you who performs ablution, and does it well, then he stands and offers two rak’ahs of prayer, concentrating on it with his heart and body, Paradise will be his lot by all means. I said: Ha-ha! How fine it is! A man in front of me said: The action (mentioned by the Prophet) earlier, O ‘Uqbah, is finer that this one. I looked at him and found him to be ‘Umar b. al-Khattab. I asked him: What is that, O Abu Hafs? He replied: He (the Prophet) had said before you came: If any one of you performs ablution, and does it well, and when he finishes the ablution, he utters the words : I bear witness that there is no deity except Allah, He has no associate, and I bear witness that Muhammad is His Servant and His Messenger, all the eight doors of Paradise will be opened for him; he may enter (through) any of them. Mu’awiyah said: Rabi’ah b. Yazid narrated this tradition to me from Abu Idris and the authority of  ‘Uqbah b.’Amir.",
      "chain": [
        "30296",
        "20029",
        "20675",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "211",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عبد الله بن وهب، حدثنا معاوية، - يعني ابن صالح - عن العلاء بن الحارث، عن حرام بن حكيم، عن عمه عبد الله بن سعد الأنصاري، قال سألت رسول الله صلى الله عليه وسلم عما يوجب الغسل وعن الماء يكون بعد الماء فقال ‏\"‏ ذاك المذى وكل فحل يمذي فتغسل من ذلك فرجك وأنثييك وتوضأ وضوءك للصلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Sa'd al-Ansari:                     I asked the Messenger of Allah (ﷺ) as to what makes it necessary to take a bath and about the (prostatic) fluid that flows after taking a bath. He replied: that is called madhi (prostatic fluid). It flows from every male. You should wash your private parts and testicles because of it and perform ablution as you do for prayer.",
      "chain": [
        "30309",
        "20029",
        "20675",
        "10884"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة المكتوبة واجبة خلف كل مسلم برا كان أو فاجرا وإن عمل الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah(ﷺ) as saying:                      The obligatory prayer is essential behind every Muslim, pious or impious, even if he has committed a sins.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "10884",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "666",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن إبراهيم الغافقي، حدثنا ابن وهب، ح وحدثنا قتيبة بن سعيد، حدثنا الليث، - وحديث ابن وهب أتم - عن معاوية بن صالح، عن أبي الزاهرية، عن كثير بن مرة، عن عبد الله بن عمر، - قال قتيبة عن أبي الزاهرية، عن أبي شجرة، لم يذكر ابن عمر - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقيموا الصفوف وحاذوا بين المناكب وسدوا الخلل ولينوا بأيدي إخوانكم ‏\"‏ ‏.‏ لم يقل عيسى ‏\"‏ بأيدي إخوانكم ‏\"‏ ‏.‏ ‏\"‏ ولا تذروا فرجات للشيطان ومن وصل صفا وصله الله ومن قطع صفا قطعه الله ‏\"‏ ‏.‏ قال أبو داود أبو شجرة كثير بن مرة ‏.‏ قال أبو داود ومعنى ‏\"‏ ولينوا بأيدي إخوانكم ‏\"‏ ‏.‏ إذا جاء رجل إلى الصف فذهب يدخل فيه فينبغي أن يلين له كل رجل منكبيه حتى يدخل في الصف ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: Set the rows in order, stand shoulder to shoulder, close the gaps, be pliant in the hands of your brethren, and do not leave openings for the devil. If anyone joins up a row, Allah will join him up, but if anyone  breaks a row, Allah will cut him off.Abu Dawud said: The name of Abu Shjrah is Kathir b. Murrah.",
      "chain": [
        "20029",
        "30367",
        "20675",
        "10901",
        "19940",
        "18",
        "30367",
        "10901"
      ]
    },
    {
      "hadith_no": "766",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رافع، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، أخبرني أزهر بن سعيد الحرازي، عن عاصم بن حميد، قال سألت عائشة بأى شىء كان يفتتح رسول الله صلى الله عليه وسلم قيام الليل فقالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان إذا قام كبر عشرا وحمد الله عشرا وسبح عشرا وهلل عشرا واستغفر عشرا وقال ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني ‏\"‏ ‏.‏ ويتعوذ من ضيق المقام يوم القيامة ‏.‏ قال أبو داود ورواه خالد بن معدان عن ربيعة الجرشي عن عائشة نحوه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Asim ibn Humayd said: I asked Aisha: By what words the Messenger of Allah (ﷺ) would begin his supererogatory prayer at night? She replied: You ask me about a thing of which no one asked me before you. When he stood up, be uttered the takbir (Allah is most great) ten times, and uttered \"Praise be to Allah\" ten times, and uttered \"Glory be to Allah \" ten times, and uttered \"There is no god but Allah\" ten times, and sought forgiveness ten times, and said: O Allah, forgive me, and guide me, and give me sustenance, and keep me well, and he sought refuge in Allah from the hardship of standing before Allah on the Day of Judgment.Abu Dawud said: This tradition has also been narrated by Khalid b. Ma'dan from Rab'iah al-Jarashi on the authority of 'Aishah.",
      "chain": [
        "30375",
        "20650",
        "20675",
        "18018"
      ]
    },
    {
      "hadith_no": "873",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا معاوية بن صالح، عن عمرو بن قيس، عن عاصم بن حميد، عن عوف بن مالك الأشجعي، قال قمت مع رسول الله صلى الله عليه وسلم ليلة فقام فقرأ سورة البقرة لا يمر بآية رحمة إلا وقف فسأل ولا يمر بآية عذاب إلا وقف فتعوذ - قال - ثم ركع بقدر قيامه يقول في ركوعه ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم سجد بقدر قيامه ثم قال في سجوده مثل ذلك - ثم قام فقرأ بآل عمران ثم قرأ سورة سورة ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i:                     I stood up to pray along with the Messenger of Allah (ﷺ); he got up and recited Surat al-Baqarah (Surah 2). When he came to a verse which spoke of mercy, he stopped and made supplication, and when he came to verse which spoke of punishment, he stopped and sought refuge in Allah, then he bowed and paused as long as he stood (reciting Surah al-Baqarah), and said while bowing, \"Glory be to the Possessor of greatness, the Kingdom, grandeur and majesty.\"  :Then he prostrated himself and paused as long as he stood up and recited Surat Aal Imran (Surah 3) and then recited many surahs one after another.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "213",
        "3051"
      ]
    },
    {
      "hadith_no": "906",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من أحد يتوضأ فيحسن الوضوء ويصلي ركعتين يقبل بقلبه ووجهه عليهما إلا وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Uqbah. B Amir al-Juhani reported the Messenger of Allah(ﷺ) as saying:                      Any one performs ablution and performs the ablution perfectly and then offers two rak’ahs of prayers concentrating on them with his heart and face but paradise will necessarily fall to his lot.",
      "chain": [
        "30203",
        "20650",
        "20675",
        "11414",
        "11027",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "1118",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن معروف، حدثنا بشر بن السري، حدثنا معاوية بن صالح، عن أبي الزاهرية، قال كنا مع عبد الله بن بسر صاحب النبي صلى الله عليه وسلم يوم الجمعة فجاء رجل يتخطى رقاب الناس فقال عبد الله بن بسر جاء رجل يتخطى رقاب الناس يوم الجمعة والنبي صلى الله عليه وسلم يخطب فقال له النبي صلى الله عليه وسلم ‏\"‏ اجلس فقد آذيت ‏\"‏ ‏.‏",
      "text_en": " Abu al-Zahiriyyah said:                      We were in the company of 'Abd Allah b. Busr, the Companion of the Prophet (ﷺ), on a Friday. A man came and stepped over the people. 'Abd Allah b. Busr said: A man came and stepped over the people while the Prophet (ﷺ) was giving the sermon on Friday. The Prophet (ﷺ) said: Sit down, you have annoyed (the people).",
      "chain": [
        "30280",
        "20190",
        "20675",
        "10901"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال قلت لعائشة رضى الله عنها ‏:‏ بكم كان رسول الله صلى الله عليه وسلم يوتر قالت ‏:‏ كان يوتر بأربع وثلاث، وست وثلاث، وثمان وثلاث، وعشر وثلاث، ولم يكن يوتر بأنقص من سبع، ولا بأكثر من ثلاث عشرة ‏.‏ قال أبو داود زاد أحمد بن صالح ‏:‏ ولم يكن يوتر بركعتين قبل الفجر ‏.‏ قلت ‏:‏ ما يوتر قالت ‏:‏ لم يكن يدع ذلك ‏.‏ ولم يذكر أحمد ‏:‏ وست وثلاث ‏.‏",
      "text_en": " 'Abd Allah b. Abi Qais said that he asked 'Aishah:                      How many rak'ahs would the Messenger of Allah (ﷺ) pray observing the witr ? She said: He used to observe the witr with four and three, six and three, eight and three, and ten and three rak'ahs never observing less than seven or more than thirteen.The narrator Ahmad added in his version: He would not observe the witr with two rak'ahs before the dawn. I asked: With what would he observe the witr ? She said: He would never leave it. The version of Ahmad does not mention the words \"six and three (rak'ahs)\".",
      "chain": [
        "30226",
        "30491",
        "20029",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "1437",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة عن وتر، رسول الله صلى الله عليه وسلم قالت ربما أوتر أول الليل وربما أوتر من آخره ‏.‏ قلت كيف كانت قراءته أكان يسر بالقراءة أم يجهر قالت كل ذلك كان يفعل ربما أسر وربما جهر وربما اغتسل فنام وربما توضأ فنام ‏.‏ قال أبو داود وقال غير قتيبة تعني في الجنابة ‏.‏",
      "text_en": " \t'Abd Allah b. Abu Qais said:                      I asked 'Aishah about the witr observes by the Messenger of Allah (ﷺ). She replied: Sometime he observed the witr prayer in the early hours of the night, sometimes he observed it at the end of it. I asked: How did he recite the Qur'an ? Did he recite the Qur'an quietly or loudly ? She replied: He did it in any way. Sometimes he recited quietly and sometimes loudly, sometimes he took bath and then slept and sometimes he performed ablution and then slept.Abu Dawud said: The narrators other than Qutaibah said: This refer to his bath due to sexual defilement.",
      "chain": [
        "30367",
        "20023",
        "20675",
        "10935",
        "53"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثني عبد الرحمن بن مهدي، حدثني معاوية بن صالح، عن عبد الله بن أبي قيس، قال سمعت عائشة، - رضى الله عنها - تقول كان رسول الله صلى الله عليه وسلم يتحفظ من شعبان ما لا يتحفظ من غيره ثم يصوم لرؤية رمضان فإن غم عليه عد ثلاثين يوما ثم صام ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to count the days in Sha'ban in a manner he did not count any other month; then he fasted when he sighted the new moon of Ramadan; but if the weather was cloudy he counted thirty days and then fasted.",
      "chain": [
        "30007",
        "20033",
        "20675",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "2344",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عمرو بن محمد الناقد، حدثنا حماد بن خالد الخياط، حدثنا معاوية بن صالح، عن يونس بن سيف، عن الحارث بن زياد، عن أبي رهم، عن العرباض بن سارية، قال دعاني رسول الله صلى الله عليه وسلم إلى السحور في رمضان فقال ‏\"‏ هلم إلى الغداء المبارك ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Irbad ibn Sariyyah:                     The Messenger of Allah (ﷺ) invited me to a meal shortly before dawn in Ramadan saying: Come to the blessed morning meal.",
      "chain": [
        "30263",
        "20537",
        "20675",
        "19199",
        "17011",
        "5172"
      ]
    },
    {
      "hadith_no": "2431",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن عبد الله بن أبي قيس، سمع عائشة، تقول كان أحب الشهور إلى رسول الله صلى الله عليه وسلم أن يصومه شعبان ثم يصله برمضان ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The month most liked by the Messenger of Allah (ﷺ) for fasting was Sha'ban. He then joined it with Ramadan.",
      "chain": [
        "30007",
        "20033",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "2533",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ الجهاد واجب عليكم مع كل أمير برا كان أو فاجرا، والصلاة واجبة عليكم خلف كل مسلم برا كان أو فاجرا وإن عمل الكبائر، والصلاة واجبة على كل مسلم برا كان أو فاجرا وإن عمل الكبائر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Striving in the path of Allah (jihad) is incumbent on you along with every ruler, whether he is pious or impious; the prayer is obligatory on you behind every believer, pious or impious, even if he commits grave sins; the (funeral) prayer is incumbent upon every Muslim, pious and impious, even if he commits major sins.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "10884",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "2535",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا أسد بن موسى، حدثنا معاوية بن صالح، حدثني ضمرة، أن ابن زغب الإيادي، حدثه قال ‏:‏ نزل على عبد الله بن حوالة الأزدي فقال لي ‏:‏ بعثنا رسول الله صلى الله عليه وسلم لنغنم على أقدامنا فرجعنا فلم نغنم شيئا وعرف الجهد في وجوهنا فقام فينا فقال ‏:‏ ‏\"‏ اللهم لا تكلهم إلى فأضعف عنهم، ولا تكلهم إلى أنفسهم فيعجزوا عنها، ولا تكلهم إلى الناس فيستأثروا عليهم ‏\"‏ ‏.‏ ثم وضع يده على رأسي - أو قال ‏:‏ على هامتي - ثم قال ‏:‏ ‏\"‏ يا ابن حوالة إذا رأيت الخلافة قد نزلت أرض المقدسة فقد دنت الزلازل والبلابل والأمور العظام، والساعة يومئذ أقرب من الناس من يدي هذه من رأسك ‏\"‏ ‏.‏ قال أبو داود ‏:‏ عبد الله بن حوالة حمصي ‏.‏",
      "text_en": " Narrated Abdullah ibn Hawalah al-Azdi:                     The Messenger of Allah (ﷺ) sent us on foot to get spoil, but we returned without getting any. When he saw the signs of distress on our faces, he stood up on our faces and said: O Allah, do not put them under my care, for I would be too weak to care for them; do not put them in care of themselves, for they would be incapable of that, and do not put them in the care of men, for they would choose the best things for themselves. He then placed his hand on my head and said: Ibn Hawalah, when you see the caliphate has settled in the holy land, earthquakes, sorrows and serious matters will have drawn near and on that day the Last Hour will be nearer to mankind than this hand of mine is to your head.Abu Dawud said: 'Abd Allah b. Hawalah belongs to Hims.",
      "chain": [
        "30226",
        "28040",
        "20675",
        "20738"
      ]
    },
    {
      "hadith_no": "2749",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة الجشمي، قال حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن ابن جارية، عن حبيب بن مسلمة، أن رسول الله صلى الله عليه وسلم كان ينفل الربع بعد الخمس والثلث بعد الخمس إذا قفل ‏.‏",
      "text_en": " Narrated Habib ibn Maslamah:                     The Messenger of Allah (ﷺ) used to give a quarter of the booty as reward after the fifty had been kept off, and a third after the fifth had been kept off when he returned.",
      "chain": [
        "20033",
        "20675",
        "10884",
        "11066",
        "2901"
      ]
    },
    {
      "hadith_no": "2814",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا حماد بن خالد الخياط، قال حدثنا معاوية بن صالح، عن أبي الزاهرية، عن جبير بن نفير، عن ثوبان، قال ضحى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا ثوبان أصلح لنا لحم هذه الشاة ‏\"‏ ‏.‏ قال فما زلت أطعمه منها حتى قدمنا المدينة ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) sacrificed during a journey and then said: Thawban, mend the meat of this goat. I then kept on supplying its meat until we reached Medina.",
      "chain": [
        "30352",
        "20537",
        "20675",
        "10901",
        "4097",
        "130"
      ]
    },
    {
      "hadith_no": "2861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حماد بن خالد الخياط، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة الخشني، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رميت الصيد فأدركته بعد ثلاث ليال وسهمك فيه فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Prophet (ﷺ) said: When you shoot your arrow (and the animal goes out of your sight) and you come three days later on it, and in it there is your arrow, then eat provided it has not stench.",
      "chain": [
        "30020",
        "20537",
        "20675",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "3485",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، حدثنا معاوية بن صالح، عن عبد الوهاب بن بخت، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله حرم الخمر وثمنها وحرم الميتة وثمنها وحرم الخنزير وثمنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: Allah forbade wine and the price paid for it, and forbade dead meat and the price paid for it, and forbade swine and the price paid for it.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "12321",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3688",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن حاتم بن حريث، عن مالك بن أبي مريم، قال دخل علينا عبد الرحمن بن غنم فتذاكرنا الطلاء فقال حدثني أبو مالك الأشعري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليشربن ناس من أمتي الخمر يسمونها بغير اسمها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Ghanam:                     Malik ibn AbuMaryam said: AbdurRahman ibn Ghanam entered upon us and we discussed tila' and he said: AbuMalik al-Ash'ari told me that he heard the Messenger of Allah (ﷺ) say: Some of my people will assuredly drink wine calling it by another name.",
      "chain": [
        "30007",
        "20650",
        "20675",
        "18138",
        "17058"
      ]
    },
    {
      "hadith_no": "4263",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن الحسن المصيصي، حدثنا حجاج، - يعني ابن محمد - حدثنا الليث بن سعد، قال حدثني معاوية بن صالح، أن عبد الرحمن بن جبير، حدثه عن أبيه، عن المقداد بن الأسود، قال ايم الله لقد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن السعيد لمن جنب الفتن إن السعيد لمن جنب الفتن إن السعيد لمن جنب الفتن ولمن ابتلي فصبر فواها ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdad ibn al-Aswad:                     I swear by Allah, I heard the Messenger of Allah (ﷺ) say: The happy man is he who avoids dissensions: happy is the man who avoids dissensions; happy is the man who avoids dissensions: but how fine is the man who is afflicted and shows endurance.",
      "chain": [
        "20381",
        "20023",
        "20675",
        "10865",
        "163"
      ]
    },
    {
      "hadith_no": "4349",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا موسى بن سهل، حدثنا حجاج بن إبراهيم، حدثنا ابن وهب، حدثني معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن أبي ثعلبة الخشني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يعجز الله هذه الأمة من نصف يوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Tha'labat al-Khushani:                     The Prophet (ﷺ) said: Allah will not fail to detain this community for less than half a day.",
      "chain": [
        "20029",
        "20675",
        "10865",
        "4056"
      ]
    },
    {
      "hadith_no": "5200",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، قال أخبرني معاوية بن صالح، عن أبي موسى، عن أبي مريم، عن أبي هريرة، قال إذا لقي أحدكم أخاه فليسلم عليه فإن حالت بينهما شجرة أو جدار أو حجر ثم لقيه فليسلم عليه أيضا ‏.‏ قال معاوية وحدثني عبد الوهاب بن بخت عن أبي الزناد عن الأعرج عن أبي هريرة عن رسول الله صلى الله عليه وسلم مثله سواء ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When one of you meets his brother, he should salute him, then if he meets him again after a tree, wall or stone has come between them, he should also salute him.Mu'awiyah said: 'Abd al-Wahhab b. Bakht transmitted a similar tradition to me from Abu al-Zinad, from al-A'raj, from Abu Hurairah, from the Messenger of Allah (ﷺ).",
      "chain": [
        "30296",
        "20029",
        "20675",
        "19370",
        "13"
      ]
    },
    {
      "hadith_no": "55",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن محمد بن عمران الثعلبي الكوفي، حدثنا زيد بن حباب، عن معاوية بن صالح، عن ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله اللهم اجعلني من التوابين واجعلني من المتطهرين فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أنس وعقبة بن عامر ‏.‏ قال أبو عيسى حديث عمر قد خولف زيد بن حباب في هذا الحديث ‏.‏ قال وروى عبد الله بن صالح وغيره عن معاوية بن صالح عن ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر عن عمر ‏.‏ وعن ربيعة عن أبي عثمان عن جبير بن نفير عن عمر ‏.‏ وهذا حديث في إسناده اضطراب ولا يصح عن النبي صلى الله عليه وسلم في هذا الباب كبير شيء ‏.‏ قال محمد وأبو إدريس لم يسمع من عمر شيئا ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated that :                     Allah's Messenger said: 'Whoever performs Wudu, making Wudu well, then says: (Ashhadu an la ilaha illallah, wahdahu la sharika lahu, wa ashhadu anna Muhammadan-abduhu wa rasuluhu, Allahummajalni minat tawwabin, waj'alni minal mutatahhirin) 'I testify that none has the right to be worshipped but Allah Alone, there are no partners for Him. And I testify that Muhammad is His servant and Messenger. O Allah! Make me among the repentant, and make me among those who purify themselves.' Then eight gates of Paradise are opened for him, that may enter by whichever of them wishes.\"",
      "chain": [
        "10898",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "3"
      ]
    },
    {
      "hadith_no": "133",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا عباس العنبري، ومحمد بن عبد الأعلى، قالا حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن معاوية، عن عمه عبد الله بن سعد، قال سألت النبي صلى الله عليه وسلم عن مواكلة الحائض فقال ‏\"‏ واكلها ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأنس ‏.‏ قال أبو عيسى حديث عبد الله بن سعد حديث حسن غريب ‏.‏ وهو قول عامة أهل العلم لم يروا بمواكلة الحائض بأسا ‏.‏ واختلفوا في فضل وضوئها فرخص في ذلك بعضهم وكره بعضهم فضل طهورها ‏.‏",
      "text_en": " Abdullah bin Sa'd narrated:                     I asked the Prophet about eating with a menstruating woman. He said: \"Eat with her.\"",
      "chain": [
        "30437",
        "30449",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    },
    {
      "hadith_no": "449",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة كيف كان قراءة النبي صلى الله عليه وسلم بالليل أكان يسر بالقراءة أم يجهر فقالت كل ذلك قد كان يفعل ربما أسر بالقراءة وربما جهر ‏.‏ فقلت الحمد لله الذي جعل في الأمر سعة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abdullah bin Abi Qais narrated:                     \"I asked Aishah how the recitation of the Prophet (S) was at night. [Would he recite silently o audibly?] So she said: 'He would do both of those. Sometimes he was silent with his recitation and sometimes it was audible.' So I said: 'All praise is due to Allah, the One who made the matter broad.'\"",
      "chain": [
        "30367",
        "20023",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "616",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن الحباب، أخبرنا معاوية بن صالح، حدثني سليم بن عامر، قال سمعت أبا أمامة، يقول سمعت رسول الله صلى الله عليه وسلم يخطب في حجة الوداع فقال ‏\"‏ اتقوا الله ربكم وصلوا خمسكم وصوموا شهركم وأدوا زكاة أموالكم وأطيعوا ذا أمركم تدخلوا جنة ربكم ‏\"‏ ‏.‏ قال فقلت لأبي أمامة منذ كم سمعت من رسول الله صلى الله عليه وسلم هذا الحديث قال سمعته وأنا ابن ثلاثين سنة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Sulaim bin Amir narrated:                     \"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"",
      "chain": [
        "20650",
        "20675",
        "10915",
        "4048"
      ]
    },
    {
      "hadith_no": "1025",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك، قال سمعت رسول الله صلى الله عليه وسلم يصلي على ميت ففهمت من صلاته عليه ‏\"‏ اللهم اغفر له وارحمه واغسله بالبرد واغسله كما يغسل الثوب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمد بن إسماعيل أصح شيء في هذا الباب هذا الحديث ‏.‏",
      "text_en": " Awf bin Malik said:                     \"I heard the Messenger of Allah, while he was performing Salat for a deceased person. I could hear him saying in his prayer: (Allahummagfir lahu, war hamhu, waghsilhu bil-baradi (waghsilhu) kama yughsaluth-thawb) 'O Allah! Forgive him, have mercy upon him, and wash him with (snow or ice) (and wash him) just as a garment is washed.'\"",
      "chain": [
        "30160",
        "20033",
        "20675",
        "10942",
        "10805"
      ]
    },
    {
      "hadith_no": "1626",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن رافع، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، عن كثير بن الحارث، عن القاسم أبي عبد الرحمن، عن عدي بن حاتم الطائي، أنه سأل رسول الله صلى الله عليه وسلم أى الصدقة أفضل قال ‏\"‏ خدمة عبد في سبيل الله أو ظل فسطاط أو طروقة فحل في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى وقد روي عن معاوية بن صالح هذا الحديث مرسلا وخولف زيد في بعض إسناده ‏.‏ قال وروى الوليد بن جميل هذا الحديث عن القاسم أبي عبد الرحمن عن أبي أمامة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim At-Tai:                     That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).",
      "chain": [
        "30375",
        "20650",
        "20675",
        "11648",
        "212"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن معاوية بن صالح، عن أبي طالوت، قال دخلت على أنس بن مالك وهو يأكل القرع وهو يقول يا لك شجرة ما أحبك إلا لحب رسول الله صلى الله عليه وسلم إياك ‏.‏ قال وفي الباب عن حكيم بن جابر عن أبيه ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Abu Talut:                     \"I entered upon Anas bin Malik while he was eating gourd, and he was saying: 'O you tree! I do not like you but because of the Messenger of Allah (ﷺ) liked you.'\"He said: There is something on this topic from Hakim bin Jarir, from his father.[Abu 'Eisa said:] This Hadith is Gharib from this route.",
      "chain": [
        "30367",
        "20023",
        "20675"
      ]
    },
    {
      "hadith_no": "2329",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن معاوية بن صالح، عن عمرو بن قيس، عن عبد الله بن بسر، أن أعرابيا، قال يا رسول الله من خير الناس قال ‏\"‏ من طال عمره وحسن عمله ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وجابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " 'Abdullah bin Busr narrated that a Bedouin said:                     \"O Messenger of Allah! Who is the best of the people?\" He said: \"He whose life is long and his deeds are good.\"There are narrations on this topic from Abu Hurairah and Jabir.",
      "chain": [
        "30216",
        "20650",
        "20675",
        "213",
        "3650"
      ]
    },
    {
      "hadith_no": "2336",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسن بن سوار، حدثنا ليث بن سعد، عن معاوية بن صالح، أن عبد الرحمن بن جبير بن نفير، حدثه عن أبيه، عن كعب بن عياض، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن لكل أمة فتنة وفتنة أمتي المال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب إنما نعرفه من حديث معاوية بن صالح ‏.‏",
      "text_en": " Ka'b bin 'Iyad narrated that the Prophet (s.a.w) said:                     \"Indeed there is a fitnah for every Ummah, and the Fitnah for my Ummah is wealth.\"",
      "chain": [
        "30242",
        "28100",
        "20023",
        "20675",
        "10942"
      ]
    },
    {
      "hadith_no": "2389",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، حدثنا عبد الرحمن بن جبير بن نفير الحضرمي، عن أبيه، عن النواس بن سمعان، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن البر والإثم فقال النبي صلى الله عليه وسلم ‏\"‏ البر حسن الخلق والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ‏\"‏ ‏.‏  حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، نحوه إلا أنه قال سألت النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " An-Nawas bin Sama'an narrated that a man came asking the Messenger of Allah (s.a.w) about righteousness and sin. So the Prophet (s.a.w) said:                     \"Righteouness is good behaviour, and sin is what fluctuates in your chest, and you would hate that the people discovered it about you.\"",
      "chain": [
        "20650",
        "20675",
        "3600"
      ]
    },
    {
      "hadith_no": "2653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبد الله بن صالح، حدثني معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، جبير بن نفير عن أبي الدرداء، قال كنا مع رسول الله صلى الله عليه وسلم فشخص ببصره إلى السماء ثم قال ‏\"‏ هذا أوان يختلس العلم من الناس حتى لا يقدروا منه على شيء ‏\"‏ ‏.‏ فقال زياد بن لبيد الأنصاري كيف يختلس منا وقد قرأنا القرآن فوالله لنقرأنه ولنقرئنه نساءنا وأبناءنا ‏.‏ فقال ‏\"‏ ثكلتك أمك يا زياد إن كنت لأعدك من فقهاء أهل المدينة هذه التوراة والإنجيل عند اليهود والنصارى فماذا تغني عنهم ‏\"‏ ‏.‏ قال جبير فلقيت عبادة بن الصامت قلت ألا تسمع إلى ما يقول أخوك أبو الدرداء فأخبرته بالذي قال أبو الدرداء قال صدق أبو الدرداء إن شئت لأحدثنك بأول علم يرفع من الناس الخشوع يوشك أن تدخل مسجد جماعة فلا ترى فيه رجلا خاشعا ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ومعاوية بن صالح ثقة عند أهل الحديث ولا نعلم أحدا تكلم فيه غير يحيى بن سعيد القطان وقد روي عن معاوية بن صالح نحو هذا ‏.‏ وروى بعضهم هذا الحديث عن عبد الرحمن بن جبير بن نفير عن أبيه عن عوف بن مالك عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Jubair bin Nufair:                     from Abu Ad-Darda who said: \"We were with the Prophet (ﷺ) when he raised his sight to the sky, then he said: 'This is the time when knowledge is to be taken from the people, until what remains of it shall not amount to anything.\" So Ziyad bin Labid Al-Ansari said: 'How will it be taken from us while we recite the Qur'an. By Allah we recite it, and our women and children recite it?' He (ﷺ) said: 'May you be bereaved of your mother O Ziyad! I used to consider you among the Fuqaha of the people of Al-Madinah. The Tawrah and Injil are with the Jews and Christians, but what do they avail of them?'\" Jubair said: \"So I met 'Ubadah bin As-Samit and said to him: 'Have you not heard what your brother Abu Ad-Darda said?' Then I informed him of what Abu Ad-Darda said. He said: 'Abu Ad-Darda spoke the truth. If you wish, we shall narrated to you about the first knowledge to be removed from the people: It is Khushu', soon you will enter the congregational Masjid, but not see any man in it with Khushu'.'\"",
      "chain": [
        "30025",
        "20675",
        "10942",
        "37"
      ]
    },
    {
      "hadith_no": "2664",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن الحسن بن جابر اللخمي، عن المقدام بن معديكرب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا هل عسى رجل يبلغه الحديث عني وهو متكئ على أريكته فيقول بيننا وبينكم كتاب الله فما وجدنا فيه حلالا استحللناه وما وجدنا فيه حراما حرمناه وإن ما حرم رسول الله صلى الله عليه وسلم كما حرم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Al-Miqdam bin Ma'dikarib:                     that the Messenger of Allah (ﷺ) said: \"Lo! Soon a Hadith from me will be conveyed to a man, while he is reclining on his couch, and he says: 'Between us and you is Allah's Book. So whatever we find in it that is lawful, we consider lawful, and whatever we find in it that is unlawful, we consider it unlawful.' Indeed whatever the Messenger of Allah (ﷺ) made unlawful, it is the same as what Allah made unlawful.\"",
      "chain": [
        "30160",
        "20033",
        "20675"
      ]
    },
    {
      "hadith_no": "3174",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن معاوية بن صالح، عن عبد الله بن أبي قيس، هو رجل بصري قال سألت عائشة عن وتر رسول الله صلى الله عليه وسلم كيف كان يوتر من أول الليل أو من آخره فقالت كل ذلك قد كان يصنع ربما أوتر من أول الليل وربما أوتر من آخره ‏.‏ فقلت الحمد لله الذي جعل في الأمر سعة فقلت كيف كانت قراءته أكان يسر بالقراءة أم يجهر قالت كل ذلك قد كان يفعل قد كان ربما أسر وربما جهر قال فقلت الحمد لله الذي جعل في الأمر سعة قلت فكيف كان يصنع في الجنابة أكان يغتسل قبل أن ينام أو ينام قبل أن يغتسل قالت كل ذلك قد كان يفعل فربما اغتسل فنام وربما توضأ فنام قلت الحمد لله الذي جعل في الأمر سعة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Abi Qais [A man from Al-Basrah]:                     \"I asked 'Aishah about the Witr of the Messenger of Allah (ﷺ), how would he perform Witr, was it during the first part of the night or the end of it? She said: 'All of that. Sometimes he would perform Witr during the first part of the night, and sometimes he would perform Witr during the end of it.' So I said: 'All praise is due to Allah who made the matter accommodating.' I said: 'How was his recitation, was he quiet with recitations or loud?' She said: 'He would do all of that. Sometimes he would recite quietly and sometimes aloud.' I said: 'All praise is due to Allah who made the matter accommodating. He said: 'I said: 'How would he deal with sexual impurity? Would he perform Ghusl prior to sleeping or would he sleep prior to Ghusl?' She said: 'He would do all of that. Sometimes he would perform Ghusl then sleep, and sometimes he would perform Wudu and then sleep.' I said: 'Allah praise is due to Allah who made the matter accommodating.'\"",
      "chain": [
        "30367",
        "20023",
        "20675",
        "53"
      ]
    },
    {
      "hadith_no": "3375",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن معاوية بن صالح، عن عمرو بن قيس، عن عبد الله بن بسر، رضى الله عنه أن رجلا، قال يا رسول الله إن شرائع الإسلام قد كثرت على فأخبرني بشيء أتشبث به ‏.‏ قال ‏\"‏ لا يزال لسانك رطبا من ذكر الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abdullah bin Busr [may Allah be pleased with him] narrated that:                     A man said: “O Messenger of Allah, indeed, the legislated acts of Islam have become too much for me, so inform me of a thing that I should stick to.” He said: “Let not your tongue cease to be moist with the remembrance of Allah.”",
      "chain": [
        "30216",
        "20650",
        "20675",
        "213",
        "3650"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا إسحاق بن عيسى، حدثني معن، حدثني معاوية بن صالح، عن ضمرة بن حبيب، قال سمعت أبا أمامة، رضي الله عنه يقول حدثني عمرو بن عبسة، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ أقرب ما يكون الرب من العبد في جوف الليل الآخر فإن استطعت أن تكون ممن يذكر الله في تلك الساعة فكن ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Umamah [may Allah be pleased with him] said:                     Amr bin Abasah reported to me that he heard the Prophet say: “The closest that the Lord is to a worshipper is during the last part of the night, so if you are able to be of those who remember Allah in that hour, then do so.”",
      "chain": [
        "30025",
        "30112",
        "20675",
        "19913",
        "4002"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا حجين بن المثنى، حدثنا الليث بن سعد، عن معاوية بن صالح، عن ربيعة بن يزيد، عن عبد الملك بن عامر، عن النعمان بن بشير، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ يا عثمان إنه لعل الله يقمصك قميصا فإن أرادوك على خلعه فلا تخلعه لهم ‏\"‏ ‏.‏ قال وفي الحديث قصة طويلة ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) said: \"O 'Uthman! Indeed Allah may give you a shirt, and if they wish that you take it off, do not take it off for them.\"",
      "chain": [
        "30277",
        "20382",
        "20023",
        "20675",
        "11414",
        "274",
        "53"
      ]
    },
    {
      "hadith_no": "4174",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن يزيد بن عميرة، قال لما حضر معاذ بن جبل الموت قيل له يا أبا عبد الرحمن أوصنا ‏.‏ قال أجلسوني ‏.‏ فقال إن العلم والإيمان مكانهما من ابتغاهما وجدهما يقول ذلك ثلاث مرات والتمسوا العلم عند أربعة رهط عند عويمر أبي الدرداء وعند سلمان الفارسي وعند عبد الله بن مسعود وعند عبد الله بن سلام الذي كان يهوديا فأسلم فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه عاشر عشرة في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن سعد ‏.‏ قال وهذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Yazid bin 'Umairah:                     \"When death was upon Mu'adh bin Jabal, it was said to him: 'O Abu 'Abdur-Rahman, advise us.' He said: 'Sit me up.' So he said: 'Indeed, knowledge and faith are at their place, whoever desires them shall find them.' He said that three times. 'And seek knowledge from four men: 'Uwaimir Abu Ad-Darda, with Salman Al-Farisi, with 'Abdullah bin Mas'ud, and with 'Abdullah bin Salam who used to be a Jew and then accepted Islam. For indeed, I heard the Messenger of Allah (ﷺ) saying, \"Indeed he is the tenth of ten in Paradise.\"",
      "chain": [
        "30367",
        "20023",
        "20675",
        "11414",
        "11027"
      ]
    },
    {
      "hadith_no": "4315",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، حدثنا أبو مريم الأنصاري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الملك في قريش والقضاء في الأنصار والأذان في الحبشة والأمانة في الأزد ‏\"‏ ‏.‏ يعني اليمن ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Leadership is among the Quraish, and reasoning and judgment is among the Ansar, and the Adhan is among the Ethiopians, and the trust is among the Al-Azd.\" meaning Yemen.",
      "chain": [
        "30242",
        "20650",
        "20675",
        "13"
      ]
    },
    {
      "hadith_no": "4316",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن أبي مريم الأنصاري، عن أبي هريرة، نحوه ولم يرفعه ‏.‏ وهذا أصح من حديث زيد بن حباب ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20033",
        "20675",
        "19370",
        "13"
      ]
    },
    {
      "hadith_no": "62",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، قال شهدت عوف بن مالك يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله وأوسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik said:                      \"I heard the Messenger of Allah (ﷺ) offering the (funeral) prayer for one who had died, and I heard him say in his supplication: 'Allahummaghfir lahu warhamhu wa 'afihi was a'fu 'anhu, wa akrim nuzulahu wa wassi' ,adkhalahu waghsilhu bil-ma'i wath-thalji wal-baradi wa naqqihi min al-khataya kama ynaqqath-thawb al-abyad min ad-danas. (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash him with water and snow and hail, and cleanse him of sin as a white garment is cleansed of dirt).\"",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097"
      ]
    },
    {
      "hadith_no": "148",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا آدم بن أبي إياس، قال حدثنا الليث، - هو ابن سعد - قال حدثنا معاوية بن صالح، قال أخبرني أبو يحيى، سليم بن عامر وضمرة بن حبيب وأبو طلحة نعيم بن زياد قالوا سمعنا أبا أمامة الباهلي، يقول سمعت عمرو بن عبسة، يقول قلت يا رسول الله كيف الوضوء قال ‏\"‏ أما الوضوء فإنك إذا توضأت فغسلت كفيك فأنقيتهما خرجت خطاياك من بين أظفارك وأناملك فإذا مضمضت واستنشقت منخريك وغسلت وجهك ويديك إلى المرفقين ومسحت رأسك وغسلت رجليك إلى الكعبين اغتسلت من عامة خطاياك فإن أنت وضعت وجهك لله عز وجل خرجت من خطاياك كيوم ولدتك أمك ‏\"‏ ‏.‏ قال أبو أمامة فقلت يا عمرو بن عبسة انظر ما تقول أكل هذا يعطى في مجلس واحد فقال أما والله لقد كبرت سني ودنا أجلي وما بي من فقر فأكذب على رسول الله صلى الله عليه وسلم ولقد سمعته أذناى ووعاه قلبي من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Amr bin 'Abasah said:                      \"I said: 'O Messenger of Allah! How is Wudu' done?' He said: 'As for Wudu', when you perform Wudu', and you wash your hands to clean them, your sins come out from between your fingers and fingertips. When you rinse your mouth and nostrils, and wash your face and hands up to the elbows, and wipe you head, and wash your feet up to the ankles, you are cleansed of all your sins. When you prostrate your face to Allah, may He be exalted, you emerge from your sins like the day your mother you.'\" Abu Umamah said: \"I said: 'O 'Amr bin 'Abasah! Look at what you are saying! Was all of that given in one sitting? He said: 'By Allah, I have grown old, my appointed time is near and I am not so poor that I should tell lies about the Messenger of Allah (ﷺ). I heard it with my own ears and understood it in my heart from the Messenger of Allah.'\"",
      "chain": [
        "38433",
        "20404",
        "20023",
        "20675",
        "4002"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن علي بن حرب المروزي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن عقبة بن عامر الجهني، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then says: \"Ashhadu an la ilaha ill-Allah was ashhadu anna Muhammadan 'abduhu wa rasuluh (I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is his slave and Messenger),\" eight gates of Paradise will be opened for him, and he may enter through whichever one he wishes.'\"",
      "chain": [
        "38553",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "189",
        "3"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثنا ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم صلى ركعتين يقبل عليهما بقلبه ووجهه وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then prays two Rak'ahs in which his heart and face are focused, Paradise will be his.\"",
      "chain": [
        "35153",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "404",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة كيف كان نوم رسول الله صلى الله عليه وسلم في الجنابة أيغتسل قبل أن ينام أو ينام قبل أن يغتسل قالت كل ذلك قد كان يفعل ربما اغتسل فنام وربما توضأ فنام ‏‏.‏‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Qais said:                      \"I asked 'Aishah: 'How did the Messenger of Allah (ﷺ) sleep while he was Junub? Did he perform Ghusl before sleeping or sleep before performing Ghusl?' She said: 'He did both. Sometimes he would perform Ghusl then sleep, and sometimes he would perform Wudu' then sleep.'\"",
      "chain": [
        "20033",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "579",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عمرو بن منصور، قال أنبأنا آدم بن أبي إياس، قال حدثنا الليث بن سعد، قال حدثنا معاوية بن صالح، قال أخبرني أبو يحيى، سليم بن عامر وضمرة بن حبيب وأبو طلحة نعيم بن زياد قالوا سمعنا أبا أمامة الباهلي، يقول سمعت عمرو بن عبسة، يقول قلت يا رسول الله هل من ساعة أقرب من الأخرى أو هل من ساعة يبتغى ذكرها قال ‏\"‏ نعم إن أقرب ما يكون الرب عز وجل من العبد جوف الليل الآخر فإن استطعت أن تكون ممن يذكر الله عز وجل في تلك الساعة فكن فإن الصلاة محضورة مشهودة إلى طلوع الشمس فإنها تطلع بين قرنى الشيطان وهي ساعة صلاة الكفار فدع الصلاة حتى ترتفع قيد رمح ويذهب شعاعها ثم الصلاة محضورة مشهودة حتى تعتدل الشمس اعتدال الرمح بنصف النهار فإنها ساعة تفتح فيها أبواب جهنم وتسجر فدع الصلاة حتى يفيء الفىء ثم الصلاة محضورة مشهودة حتى تغيب الشمس فإنها تغيب بين قرنى شيطان وهي صلاة الكفار ‏\"‏ ‏.‏",
      "text_en": " Abu Yahya Sulaim bin 'Amir, Damrah bin Habib and Abu Talhah Nu'aim bin Ziyad said:                      \"We heard Abu Umamah Al-Bahili say: 'I heard 'Amrah bin 'Abasah say: I said: 'O Messenger of Allah, is there any moment which brings one close to Allah than another, or any moment that should be sought out for remembering Allah? He said: 'Yes, the closest that the Lord is to His slave is in the last part of the night, so if you can be among those who remember Allah at that time, then do so. For prayer is attended and witnessed (by the angels) until the sun rises, then it rises between the two horns of the Shaitan, that is the time when the disbelievers pray, so do not pray until the sun had risen to the height of a spear and its rays have disappeared. Then prayer is attended and witness (by the angels) until the sun is directly overhead at midday, and that is the time when the gates of Hell are opened and it is stoked up. So do not pray until the shadows appear. Then prayer is attended and witnessed (by angels) until the sun sets, and it sets between the horns of a Shaitan, and that is the time when the disbelievers pray.'\"",
      "chain": [
        "38433",
        "20404",
        "20023",
        "20675",
        "4002"
      ]
    },
    {
      "hadith_no": "819",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عيسى بن إبراهيم بن مثرود، قال حدثنا عبد الله بن وهب، عن معاوية بن صالح، عن أبي الزاهرية، عن كثير بن مرة، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من وصل صفا وصله الله ومن قطع صفا قطعه الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullih bin 'Umar that the Messenger of Allah (ﷺ)said:                      \"Whoever completes a row, may Allah be generous to him, and whoever cuts a row, may Allah cut him off.\"",
      "chain": [
        "20029",
        "20675",
        "10901",
        "19940",
        "18"
      ]
    },
    {
      "hadith_no": "923",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثني أبو الزاهرية، قال حدثني كثير بن مرة الحضرمي، عن أبي الدرداء، سمعه يقول سئل رسول الله صلى الله عليه وسلم أفي كل صلاة قراءة قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال رجل من الأنصار وجبت هذه ‏.‏ فالتفت إلى وكنت أقرب القوم منه فقال ما أرى الإمام إذا أم القوم إلا قد كفاهم ‏.‏ قال أبو عبد الرحمن هذا عن رسول الله صلى الله عليه وسلم خطأ إنما هو قول أبي الدرداء ولم يقرأ هذا مع الكتاب ‏.‏",
      "text_en": " Kathir bin Murrah Al-Hadrami narrated that :                     He heard Abu Ad-Darda say: \"The Messenger of Allah (ﷺ) was asked: 'Is there recitation in every prayer?' He said: 'Yes.' A man among the Ansar said: 'Is that obligatory?' He (Abu Ad-Darda) turned to me (Kathir), as I was closest of the people to him, and said: 'I think that if the Imam leads the people, that is sufficient for them.'\"",
      "chain": [
        "30524",
        "20650",
        "20675",
        "10901",
        "19940",
        "37"
      ]
    },
    {
      "hadith_no": "952",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا موسى بن حزام الترمذي، وهارون بن عبد الله، - واللفظ له - قالا حدثنا أبو أسامة، قال أخبرني سفيان، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عقبة بن عامر، أنه سأل النبي صلى الله عليه وسلم عن المعوذتين قال عقبة فأمنا بهما رسول الله صلى الله عليه وسلم في صلاة الفجر ‏.‏",
      "text_en": " It was narrated from Uqbah bin Amr that:                     He asked the Prophet (ﷺ) about Al-Mua'awwidhatain. Uqbah said: \"The Messenger of Allah (ﷺ) led us in praying Fajr and recited them.\"",
      "chain": [
        "30394",
        "20318",
        "20012",
        "20675",
        "10942",
        "189"
      ]
    },
    {
      "hadith_no": "1049",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عمرو بن منصور، - يعني النسائي - قال حدثنا آدم بن أبي إياس، قال حدثنا الليث، عن معاوية، - يعني ابن صالح - عن أبي قيس الكندي، - وهو عمرو بن قيس - قال سمعت عاصم بن حميد، قال سمعت عوف بن مالك، يقول قمت مع رسول الله صلى الله عليه وسلم ليلة فلما ركع مكث قدر سورة البقرة يقول في ركوعه ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏",
      "text_en": " 'Asim bin Humaid said:                     \"I heard 'Awf bin Malik say: 'I prayed Qiyam with the Messenger of Allah (ﷺ) one night, and when he bowed, he stayed as long as it takes to recite Surat Al-Baqarah, saying: \"Subhana Dhil-jabaruti wal-malakuti wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might).\"",
      "chain": [
        "38433",
        "20404",
        "20023",
        "20675",
        "10805"
      ]
    },
    {
      "hadith_no": "1132",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا الحسن بن سوار، قال حدثنا ليث بن سعد، عن معاوية بن صالح، عن عمرو بن قيس الكندي، أنه سمع عاصم بن حميد، يقول سمعت عوف بن مالك، يقول قمت مع النبي صلى الله عليه وسلم فبدأ فاستاك وتوضأ ثم قام فصلى فبدأ فاستفتح من البقرة لا يمر بآية رحمة إلا وقف وسأل ولا يمر بآية عذاب إلا وقف يتعوذ ثم ركع فمكث راكعا بقدر قيامه يقول في ركوعه ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم سجد بقدر ركوعه يقول في سجوده ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم قرأ آل عمران ثم سورة ثم سورة فعل مثل ذلك ‏.‏",
      "text_en": " 'Awf bin Malik said:                     \"I prayed Qiyam with the Prophet (ﷺ). He started by using the Siwak and performing wudu, then he stood and prayed. He started reciting Al-Baqarah and he did not come to any verse that spoke of mercy but he paused and asked for mercy, and he did not come to any verse that spoke of punishment but he paused (and sought refuge with Allah from that). Then he bowed and he stayed bowing for as long as he had stood,a nd he said while bowing: 'Subhanaka Dhil-jabaraut wal-malakut wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might.)' Then he prostrated for as long as he had bowed, saying while prostrating: 'Subhana Dhil-jabarut wal-malakut wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might.)' Then he recited Al Imran, then another surah and another, doing that each time.\"",
      "chain": [
        "30524",
        "28100",
        "20023",
        "20675",
        "19935",
        "10805"
      ]
    },
    {
      "hadith_no": "1215",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، عن ابن وهب، عن معاوية بن صالح، قال حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم يصلي فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ثلاث مرات ثم قلت ألعنك بلعنة الله فلم يستأخر ثلاث مرات ثم أردت أن آخذه والله لولا دعوة أخينا سليمان لأصبح موثقا بها يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ad-Darda' said:                     \"The Messenger of Allah (ﷺ) stood praying, and we heard him say: 'I seek refuge with Allah from you.' Then he said: 'I curse you with the curse of Allah (SWT),' three times and stretched out his hand as if to take something. When he finished praying we said: 'O Messenger of Allah, we heard you say something in your prayer that we have never heard you say before, and we saw you stretch out your hand.' He said: 'The enemy of Allah (SWT), Iblis, came with a brand of fire to throw it in my face, so I said: I seek refuge with Allah from you three times, then I wanted to take hold of him. By Allah (SWT), were it not for the prayer of our brother Sulaiman, he would have been tied up this morning for the children of Al-Madinah to play with him.'\"",
      "chain": [
        "20672",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا وهب بن بيان، قال أنبأنا ابن وهب، قال سمعت معاوية بن صالح، عن أبي الزاهرية، عن عبد الله بن بسر، قال كنت جالسا إلى جانبه يوم الجمعة فقال جاء رجل يتخطى رقاب الناس فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أى اجلس فقد آذيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Az-Zahiriyah about 'Abdullah bin Busr, he said:                     \"I was sitting beside him on Friday and he said: 'A man came, stepping over people's necks, and the Messenger of Allah (ﷺ) said: 'Sit down, you are disturbing people.\"",
      "chain": [
        "36063",
        "20029",
        "20675",
        "10901",
        "3650"
      ]
    },
    {
      "hadith_no": "1606",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني معاوية بن صالح، قال حدثني نعيم بن زياد أبو طلحة، قال سمعت النعمان بن بشير، على منبر حمص يقول قمنا مع رسول الله صلى الله عليه وسلم في شهر رمضان ليلة ثلاث وعشرين إلى ثلث الليل الأول ثم قمنا معه ليلة خمس وعشرين إلى نصف الليل ثم قمنا معه ليلة سبع وعشرين حتى ظننا أن لا ندرك الفلاح وكانوا يسمونه السحور ‏.‏",
      "text_en": " Nu'aim bin Ziyad Abu Talhah said:                     \"I heard An-Nu'man bin Bashir on the minbar in Hims saying: \"We prayed Qiyam with the Messenger of Allah (ﷺ) during Ramadan on the night of the twenty-third until one-third of the night had passed, then we prayed Qiyam with him on the night of the twenty-fifth until one-half of the night had passed, then we prayed Qiyam with him on the night of the twenty-seventh until we thought that we would miss Al-Falah- that is what they used to call suhur.\"",
      "chain": [
        "38022",
        "20650",
        "20675",
        "274"
      ]
    },
    {
      "hadith_no": "1617",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عصمة بن الفضل، قال حدثنا زيد بن الحباب، عن معاوية بن صالح، قال حدثنا الأزهر بن سعيد، عن عاصم بن حميد، قال سألت عائشة بما كان رسول الله صلى الله عليه وسلم يستفتح قيام الليل قالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان رسول الله صلى الله عليه وسلم يكبر عشرا ويحمد عشرا ويسبح عشرا ويهلل عشرا ويستغفر عشرا ويقول ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني أعوذ بالله من ضيق المقام يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Asim bin Humaid said:                     \"I asked 'Aishah with what did he- meaning the Prophet (ﷺ)- start Qiyam Al-Lail? She said: 'You have asked me something which no one before you has asked. The Messenger of Allah (ﷺ) used to say the takbir ten times, the tahmid ten times, the tasbih ten times, and the tahlil ten times, and pray for forgiveness ten times, and say: Allahummaghfirli, wahdini, warzuqni wa 'afini. A'udhu billahi min diqil-maqami yawmal-qiyamah (O Allah, forgive me, guide me, grant me provision and good health. I seek refuge with Allah from the difficulty of standing on the Day of Resurrection.)\"",
      "chain": [
        "20650",
        "20675"
      ]
    },
    {
      "hadith_no": "1662",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا عبد الرحمن، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة كيف كانت قراءة رسول الله صلى الله عليه وسلم بالليل يجهر أم يسر قالت كل ذلك قد كان يفعل ربما جهر وربما أسر ‏.‏",
      "text_en": " It was narrated that Abdullah bin Abi Qais said:                     \"I asked Aishah: \"How did the Messenger of Allah (ﷺ) recite at night- did he recite loudly or silently?\" She said: 'He used to do both; sometimes he recited loudly and sometimes he recited silently.'\"",
      "chain": [
        "20033",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا عبد الله بن وهب، قال قال معاوية بن صالح وحدثني يحيى بن سعيد، عن عمرة، عن عائشة، قالت لما أتى نعى زيد بن حارثة وجعفر بن أبي طالب وعبد الله بن رواحة جلس رسول الله صلى الله عليه وسلم يعرف فيه الحزن وأنا أنظر من صئر الباب فجاءه رجل فقال إن نساء جعفر يبكين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ انطلق فانههن ‏\"‏ ‏.‏ فانطلق ثم جاء فقال قد نهيتهن فأبين أن ينتهين ‏.‏ فقال ‏\"‏ انطلق فانههن ‏\"‏ ‏.‏ فانطلق ثم جاء فقال قد نهيتهن فأبين أن ينتهين ‏.‏ قال ‏\"‏ فانطلق فاحث في أفواههن التراب ‏\"‏ ‏.‏ فقالت عائشة فقلت أرغم الله أنف الأبعد إنك والله ما تركت رسول الله صلى الله عليه وسلم وما أنت بفاعل ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     'When news of the death of Zaid bin Harithah, Ja'far bin Abi Talib and 'Abdullah bin Rawahah was announced, the Messenger of Allah sat down and it could be seen that he was grieving. I was looking through a crack in the door, and a man came and said: 'Ja'far's womenfolk are weeping.' The Messenger of Allah said: 'Go and prevent them.' He went away, then he came back, and said: I told them not to do that, but they refused to stop; He said: Go and prevent them; He went away then he came back, and said: I told them not to do that, but they refused to stop. He said: 'Throw dust in their mouths.'\" Aishah said: \"I said: 'May Allah rub his nose in the dust, the one who is over there! You did not leave the Messenger of Allah alone but you were not going to do (what he told you to do).\"\"",
      "chain": [
        "30493",
        "20029",
        "20675",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1984",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد الكلاعي، عن جبير بن نفير الحضرمي، قال سمعت عوف بن مالك، يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت في دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة ونجه من النار - أو قال - وأعذه من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jubair bin Nufair Al-Hadrami said:                     \"I heard 'Awf bin Malik say: \"I heard the Messenger of Allah offering the funeral prayer for one who had died, and I heard him say in his supplication: Allahummaghfir lahu warhamhu wa 'afihi, wa a'fu 'anhu, wa akrim nuzulahu wa wassi' mudkhalahu waghsilhu bil-ma wath-thalji wal-barad, wa naqqihi min al-khataya kama naqqaita-thawb al-abyad min ad-danas. Wa abdihu daran khairan min darhi, wa ahlan khayran min ahlihi, wa zawjan khayran min zawjihi. Wa adkhilahul-jannah wa najjhi min an-nar\" (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash hm with water and snow and hail, and cleanse him of his sin as you cleanse a white garment of dirt. O Allah, give him a house better than his house and a family better than his house and a family better than his family and a wife better than his wife, and admit him to Paradise and save him from Hellfire).''' Or he said: \"Wa a'idhhu al-qabr (And protect him from the torment of the grave.)\"",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097",
        "10805"
      ]
    },
    {
      "hadith_no": "2053",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن الحسن، قال حدثنا حجاج، عن ليث بن سعد، عن معاوية بن صالح، أن صفوان بن عمرو، حدثه عن راشد بن سعد، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن رجلا قال يا رسول الله ما بال المؤمنين يفتنون في قبورهم إلا الشهيد قال ‏\"‏ كفى ببارقة السيوف على رأسه فتنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rashid bin Sa'd, that a man among the Companions of the Prophet said:                     \"O Messenger of Allah, why will the believers be tested in their graves except the martyr?\" He said: \"The flashing of the swords above his head is trial enough.\"",
      "chain": [
        "38070",
        "20219",
        "20023",
        "20675",
        "10921",
        "19909"
      ]
    },
    {
      "hadith_no": "2163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا شعيب بن يوسف، - بصري - قال حدثنا عبد الرحمن، عن معاوية بن صالح، عن يونس بن سيف، عن الحارث بن زياد، عن أبي رهم، عن العرباض بن سارية، قال سمعت رسول الله صلى الله عليه وسلم وهو يدعو إلى السحور في شهر رمضان وقال ‏\"‏ هلموا إلى الغداء المبارك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that AL-'Irbad bin Sariyah said:                     \"I heard the Messenger of Allah inviting people to have Sahur in Ramadan. He said: 'Come to the blessed breakfast.\" (Hasan)Chatper 26. Calling Sahur \"Ghada\" (Breakfast)",
      "chain": [
        "20033",
        "20675",
        "19199",
        "17011",
        "5172"
      ]
    },
    {
      "hadith_no": "2350",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا ابن وهب، قال حدثنا معاوية بن صالح، أن عبد الله بن أبي قيس، حدثه أنه، سمع عائشة، تقول كان أحب الشهور إلى رسول الله صلى الله عليه وسلم أن يصومه شعبان بل كان يصله برمضان ‏.‏",
      "text_en": " Aishah said:                     \"The month which the Messenger of Allah most liked to fast was Shaban; indeed he used to join it to Ramadan.\"",
      "chain": [
        "30583",
        "20029",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "2561",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن معاوية بن صالح، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الجاهر بالقرآن كالجاهر بالصدقة والمسر بالقرآن كالمسر بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                     \"The one who recites the Qur'an loudly is like one who gives charity openly, and the one who recites the Qur'an quietly is like one who gives charity in secret.\"",
      "chain": [
        "20672",
        "20029",
        "20675",
        "11422",
        "19940",
        "189"
      ]
    },
    {
      "hadith_no": "2725",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني معاوية بن صالح، قال حدثني يحيى بن معين، قال حدثنا حجاج، قال حدثنا يونس، عن أبي إسحاق، عن البراء، قال كنت مع علي بن أبي طالب حين أمره رسول الله صلى الله عليه وسلم على اليمن فلما قدم على النبي صلى الله عليه وسلم قال علي فأتيت رسول الله صلى الله عليه وسلم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ كيف صنعت ‏\"‏ ‏.‏ قلت أهللت بإهلالك ‏.‏ قال ‏\"‏ فإني سقت الهدى وقرنت ‏\"‏ ‏.‏ قال وقال صلى الله عليه وسلم لأصحابه ‏\"‏ لو استقبلت من أمري ما استدبرت لفعلت كما فعلتم ولكني سقت الهدى وقرنت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Bara said:                     \"I was with 'Ali bin Abi Talib when the Messenger of All appointed him as governor of Yemen. When he came to the Messenger of Allah, Ali said: 'I came to the Messenger of and the Messenger of Allah said: \"What did you do?\" I said; \"I entered Ihram for that for which you entered Ihram.\" He said: \"I have brought the Hadi and am performing Qiran\" And he said to his companions: \"If I had known what I know now, I would have done what you have done, but I brought the Hadi and I am performing Qiran",
      "chain": [
        "20675",
        "30020",
        "20219",
        "20475",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4036",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال وأخبرني يحيى بن أيوب، ومعاوية بن صالح، عن يحيى بن سعيد، عن سعيد بن المسيب، قال قدم ناس من العرب على رسول الله صلى الله عليه وسلم فأسلموا ثم مرضوا فبعث بهم رسول الله صلى الله عليه وسلم إلى لقاح ليشربوا من ألبانها فكانوا فيها ثم عمدوا إلى الراعي غلام رسول الله صلى الله عليه وسلم فقتلوه واستاقوا اللقاح فزعموا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم عطش من عطش آل محمد الليلة ‏\"‏ ‏.‏ فبعث رسول الله صلى الله عليه وسلم في طلبهم فأخذوا فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏ وبعضهم يزيد على بعض إلا أن معاوية قال في هذا الحديث استاقوا إلى أرض الشرك ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"Some 'Arab people came to the Messenger of Allah [SAW] and accepted Islam, then they became sick. The Messenger of Allah [SAW] sent them to some milk camels to drink their milk. While they were with them, they attacked the herdsman, who was a slave of the Messenger of Allah [SAW], and killed him. They drove off the camels, and claimed that the Messenger of Allah [SAW] had said: 'O Allah, make thirsty the one who makes the family of Muhammad thirsty tonight.' The Messenger of Allah [SAW] sent (men) after them, and they were caught. Then he had their hands and feet cut off, and their eyes gouged out.\" Some of them (the narrators) added more than others, except that in his narration of this Hadith, Mu'awiyah said: \"They drove them off to the land of Shirk.\"",
      "chain": [
        "30485",
        "20029",
        "20379",
        "20675",
        "11062",
        "11002"
      ]
    },
    {
      "hadith_no": "4303",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرني أحمد بن خالد الخلال، قال حدثنا معن، قال أنبأنا معاوية، - وهو ابن صالح - عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم في الذي يدرك صيده بعد ثلاث فليأكله إلا أن ينتن ‏.‏",
      "text_en": " It was narrated from Abu Tha'labah from the Prophet that:                     the one who catches up with the game (he shot) after three days may eat from it, unless it has turned rotten.",
      "chain": [
        "36504",
        "30112",
        "20675",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "4619",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرحمن بن مهدي، قال حدثنا معاوية بن صالح، قال سمعت سعيد بن هانئ، يقول سمعت عرباض بن سارية، يقول بعت من رسول الله صلى الله عليه وسلم بكرا فأتيته أتقاضاه فقال ‏\"‏ أجل لا أقضيكها إلا نجيبة ‏\"‏ ‏.‏ فقضاني فأحسن قضائي وجاءه أعرابي يتقاضاه سنه فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعطوه سنا ‏\"‏ ‏.‏ فأعطوه يومئذ جملا فقال هذا خير من سني ‏.‏ فقال ‏\"‏ خيركم خيركم قضاء ‏\"‏ ‏.‏",
      "text_en": " Irbad bin Saryah said:                     \"I lent a young camel to the Messenger of Allah, and I came to ask him to repay me. He said: 'Yes, I will only repay you with a superior she-camel.' so he repaid me and repaid me well. Then a Bedouin came to him to ask to repay him a camel of a certain age, and the Messenger of Allah said: 'Give him a camel of certain age.' On that day they gave him a mature camel and he said: 'This is better than my camel.' He (The Prophet) Said:' The best of you is the one who is best in repaying.'''",
      "chain": [
        "30123",
        "20033",
        "20675"
      ]
    },
    {
      "hadith_no": "5434",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا موسى بن حزام الترمذي، قال أنبأنا أبو أسامة، عن سفيان، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عقبة بن عامر، أنه سأل رسول الله صلى الله عليه وسلم عن المعوذتين ‏.‏ قال عقبة فأمنا رسول الله صلى الله عليه وسلم بهما في صلاة الغداة ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that :                     He asked the Messenger of Allah [SAW] about Al-Mu'awwidhatain. 'Uqbah said: \"The Messenger of Allah [SAW] recited them when he led us in Salah Al-Ghadah (As-Subh).\"",
      "chain": [
        "30394",
        "20318",
        "20012",
        "20675",
        "10942",
        "189"
      ]
    },
    {
      "hadith_no": "5436",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن عمرو، قال أنبأنا ابن وهب، قال أخبرني معاوية بن صالح، عن ابن الحارث، - وهو العلاء - عن القاسم، مولى معاوية عن عقبة بن عامر، قال كنت أقود برسول الله صلى الله عليه وسلم في السفر فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عقبة ألا أعلمك خير سورتين قرئتا ‏\"‏ ‏.‏ فعلمني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ فلم يرني سررت بهما جدا فلما نزل لصلاة الصبح صلى بهما صلاة الصبح للناس فلما فرغ رسول الله صلى الله عليه وسلم من الصلاة التفت إلى فقال ‏\"‏ يا عقبة كيف رأيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"I was leading the Messenger of Allah [SAW] (on his mount) on a journey, and the Messenger of Allah [SAW] said: 'O 'Uqbah, shall I not teach you the best two Surahs that can be recited?' And he taught me: 'Say: I seek refuge with (Allah) the Lord of the daybreak.' And 'Say: I seek refuge with (Allah) the Lord of mankind...' He thought that I did not seem too overjoyed with them, so when he stopped to pray Subh, he recited them when he led the people in the Subh prayer. When the Messenger of Allah [SAW] finished praying, he turned to me and said: 'O 'Uqbah, what do you think?'\"",
      "chain": [
        "20029",
        "20675",
        "189"
      ]
    },
    {
      "hadith_no": "5535",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا زيد بن الحباب، أن معاوية بن صالح، حدثه وحدثني أزهر بن سعيد، - يقال له الحرازي شامي عزيز الحديث - عن عاصم بن حميد قال سألت عائشة بما كان رسول الله صلى الله عليه وسلم يفتتح قيام الليل قالت سألتني عن شىء ما سألني عنه أحد كان يكبر عشرا ويسبح عشرا ويستغفر عشرا ويقول ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني ‏\"‏ ‏.‏ ويتعوذ من ضيق المقام يوم القيامة ‏.‏",
      "text_en": " It was narrated that 'Asim bin Humaid said:                     \"I asked 'Aishah with what the Messenger of Allah [SAW] would start Qiyam Al-Lail. She said: 'You have asked me about something that no one else has asked me about. He used to say Allahu Akbar ten times, and Subhan-Allah ten times, and Istaghfir-Allah ten times, and he would say, Allahummaghfirli, wahdini, warzuqni, wa'afini (O Allah, forgive me, guide me, grant me provision and give me good health,) and he would seek refuge from the difficulty of the standing on the Day of Resurrection.'\"",
      "chain": [
        "38088",
        "20650",
        "20675",
        "18018"
      ]
    },
    {
      "hadith_no": "5723",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن خالد، عن معن، قال حدثنا معاوية بن صالح، عن يحيى بن سعيد، عن سعيد بن المسيب، قال إذا طبخ الطلاء على الثلث فلا بأس به ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"When At-Tila' (thickened grape juice) has been cooked and reduced to one-third, then there is nothing wrong with it.\"",
      "chain": [
        "30112",
        "20675",
        "11062",
        "11002"
      ]
    },
    {
      "hadith_no": "12",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن معاوية بن صالح، حدثني الحسن بن جابر، عن المقدام بن معديكرب الكندي، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ يوشك الرجل متكئا على أريكته يحدث بحديث من حديثي فيقول بيننا وبينكم كتاب الله عز وجل فما وجدنا فيه من حلال استحللناه وما وجدنا فيه من حرام حرمناه ‏.‏ ألا وإن ما حرم رسول الله  صلى الله عليه وسلم  مثل ما حرم الله ‏\"‏ ‏.‏",
      "text_en": " Miqdam bin Ma'dikarib Al-Kindi narrated that:                     The Messenger of Allah (ﷺ) said: \"Soon there will come a time that a man will be reclining on his pillow, and when one of my Ahadith is narrated he will say: 'The Book of Allah is (sufficient) between us and you. Whatever it states is permissible, we will take as permissible, and whatever it states is forbidden, we will take as forbidden.' Verily, whatever the Messenger of Allah (ﷺ) has forbidden is like that which Allah has forbidden.\"",
      "chain": [
        "30201",
        "20650",
        "20675"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن بشر بن منصور، وإسحاق بن إبراهيم السواق، قالا حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن ضمرة بن حبيب، عن عبد الرحمن بن عمرو السلمي، أنه سمع العرباض بن سارية، يقول وعظنا رسول الله  صلى الله عليه وسلم  موعظة ذرفت منها العيون ووجلت منها القلوب فقلنا يا رسول الله إن هذه لموعظة مودع فماذا تعهد إلينا قال ‏\"‏ قد تركتكم على البيضاء ليلها كنهارها لا يزيغ عنها بعدي إلا هالك من يعش منكم فسيرى اختلافا كثيرا فعليكم بما عرفتم من سنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ وعليكم بالطاعة وإن عبدا حبشيا فإنما المؤمن كالجمل الأنف حيثما قيد انقاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Amr As-Sulami that:                     He heard Al-'Irbad bin Sariyah say: \"The Messenger of Allah (ﷺ) delivered a moving speech to us which made our eyes flow with tears and made our hearts melt. We said: 'O Messenger of Allah. This is a speech of farewell. What did you enjoin upon us?' He said: 'I am leaving you upon a (path of) brightness whose night is like its day. No one will deviate from it after I am gone but one who is doomed. Whoever among you lives will see great conflict. I urge you to adhere to what you know of my Sunnah and the path of the Rightly-Guided Caliphs, and cling stubbornly to it. And you must obey, even if (your leader is) an Abyssinian leader. For the true believer is like a camel with a ring in its nose; wherever it is driven, it complies.\"",
      "chain": [
        "30123",
        "20033",
        "20675",
        "19913",
        "17046",
        "5172"
      ]
    },
    {
      "hadith_no": "563",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، والعباس بن الوليد الدمشقيان، قالا حدثنا مروان بن محمد، حدثنا رشدين، أنبأنا معاوية بن صالح، عن راشد بن سعد، عن أبي أمامة الباهلي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الماء لا ينجسه شىء إلا ما غلب على ريحه وطعمه ولونه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah Al-Bahili said:                     \"The Messenger of Allah said: 'Water is not made impure by anything except that which changes its smell, taste and color.'\"",
      "chain": [
        "37534",
        "20640",
        "20675",
        "19909",
        "4048"
      ]
    },
    {
      "hadith_no": "607",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو طاهر، أحمد بن عمرو بن السرح حدثنا عبد الله بن وهب، حدثنا معاوية بن صالح، عن عبد العزيز بن مسلم، عن أبي معقل، عن أنس بن مالك، قال رأيت رسول الله  صلى الله عليه وسلم  توضأ وعليه عمامة قطرية فأدخل يده من تحت العمامة فمسح مقدم رأسه ولم ينقض العمامة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"I saw the Messenger of Allah performing ablution, wearing a Qatari turban. He put his hand beneath the turban and wiped the front part of his head, and he did not take the turban off.\"",
      "chain": [
        "20029",
        "20675",
        "20253",
        "19"
      ]
    },
    {
      "hadith_no": "660",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا بشر بن آدم، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن السفر بن نسير، عن يزيد بن شريح، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  نهى أن يصلي الرجل وهو حاقن ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     The Messenger of Allah forbade a man to perform prayer when he was suppressing (the urge to urinate or defecate).",
      "chain": [
        "30125",
        "20650",
        "20675",
        "18366",
        "19173",
        "405"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن حكيم، عن عمه عبد الله بن سعد، قال سألت رسول الله  صلى الله عليه وسلم  عن مواكلة الحائض فقال ‏\"‏ واكلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Sa'd said:                     \"I asked the Messenger of Allah about eating with a menstruating woman and he said: 'Eat with her.'\"",
      "chain": [
        "34043",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    },
    {
      "hadith_no": "874",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، حدثنا ربيعة بن يزيد، عن قزعة، قال سألت أبا سعيد الخدري عن صلاة، رسول الله  صلى الله عليه وسلم  فقال ليس لك في ذلك خير ‏.‏ قلت بين رحمك الله ‏.‏ قال كانت الصلاة تقام لرسول الله  صلى الله عليه وسلم  الظهر فيخرج أحدنا إلى البقيع فيقضي حاجته ويجيء فيتوضأ فيجد رسول الله  صلى الله عليه وسلم  في الركعة الأولى من الظهر ‏.‏",
      "text_en": " It wasnarrated that Qaza’ah said:                      “I asked Abu Sa’eed Al-Khudriaboutthe prayer of the Messenger of Allah (ﷺ). He said: ‘There isnothing good in that for you.’* I said: ‘Explain it, may Allahhavemercy on you.’ He said: ‘The Iqamah would be given for theZuhr prayerfor the Messenger of Allah (ﷺ), then one of us would goout to Al-Baqi’, relieve himself, then come back and performablution, and hewould find the Messenger of Allah (ﷺ) still in thefirst Rak’ah ofZuhr.’”",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "38"
      ]
    },
    {
      "hadith_no": "1418",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن معاوية بن صالح، حدثني أزهر بن سعيد، عن عاصم بن حميد، قال سألت عائشة ماذا كان النبي  صلى الله عليه وسلم  يفتتح به قيام الليل قالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان يكبر عشرا ويحمد عشرا ويسبح عشرا ويستغفر عشرا ويقول ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني ‏\"‏ ‏.‏ ويتعوذ من ضيق المقام يوم القيامة ‏.‏",
      "text_en": " It wasnarrated that ‘Asim bin Humaid said:                      “I asked ‘Aishah: ‘Withwhat did the Prophet (ﷺ) start voluntary prayers?’ She said: ‘Youhave asked me about something which no one has asked before. He usedto say Allahu Akbar ten times, and Al-Hamdu Lillah ten times andSubhan Allah ten times, and he would say Allahumma aghfirli wahdini,warzuqni, wa ‘afini (O Allah, forgive me, guide me, grant meprovisionand give me good health),” and he would seek refuge fromthedifficulty of the standing on the Day of Resurrection.”",
      "chain": [
        "30201",
        "20650",
        "20675",
        "18018"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن معاوية، عن عمه عبد الله بن سعد، قال سألت رسول الله  صلى الله عليه وسلم  أيما أفضل الصلاة في بيتي أو الصلاة في المسجد قال ‏\"‏ ألا ترى إلى بيتي ما أقربه من المسجد فلأن أصلي في بيتي أحب إلى من أن أصلي في المسجد إلا أن تكون صلاة مكتوبة ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Sa’d said:                      “I asked the Messenger of Allah (ﷺ):‘Which is better prayer in my house or prayer in the mosque?’ Hesaid:‘Do you not see how close my house is to the mosque?’ Butpraying inmy house is dearer to me than praying in the mosque, apartfrom theprescribed prayers.’”",
      "chain": [
        "34043",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    },
    {
      "hadith_no": "2374",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، حدثني سعيد بن هانئ، قال سمعت العرباض بن سارية، يقول كنت عند النبي  صلى الله عليه وسلم  فقال أعرابي اقضني بكري ‏.‏ فأعطاه بعيرا مسنا فقال الأعرابي يا رسول الله هذا أسن من بعيري ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ خير الناس خيرهم قضاء ‏\"‏ ‏.‏",
      "text_en": " Sa'eed bin Hani' said:                     \"I heard 'Irbad bin Sariyah say: 'I was with the Prophet (ﷺ) and a Bedouin said: \"Pay me back for my young camel, and he gave him an older (i.e., better) camel.\" He said: 'O Messenger of Allah! It is older (i.e., better) than my camel.' The Messenger of Allah (ﷺ) said: 'The best of people are those who are best in repaying.\"'",
      "chain": [
        "30201",
        "20650",
        "20675",
        "5172"
      ]
    },
    {
      "hadith_no": "2739",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو كريب، حدثنا رشدين بن سعد، عن معاوية بن صالح، عن معاذ بن محمد الأنصاري، عن ابن صهبان، عن العباس بن عبد المطلب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا قود في المأمومة ولا الجائفة ولا المنقلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abbas bin 'Abdul-Muttalib that the Messenger of Allah (ﷺ) said:                     “There is no retaliation for a head wound that does not reach the brain, a spear wound that does not penetrate deeply, or a wound that dislocates a bone.”",
      "chain": [
        "30216",
        "26012",
        "20675",
        "28568",
        "25145",
        "100"
      ]
    },
    {
      "hadith_no": "3314",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن معاوية بن صالح، حدثني الحسن بن جابر، عن المقدام بن معديكرب الكندي، أن رسول الله  صلى الله عليه وسلم  حرم أشياء حتى ذكر الحمر الإنسية ‏.‏",
      "text_en": " It wasnarrated from Miqdam bin Ma’dikarib Al-Kindi that theMessenger ofAllah (ﷺ) forbade several things, until he mentioned(the meat of)domesticated donkeys.",
      "chain": [
        "30201",
        "20650",
        "20675"
      ]
    },
    {
      "hadith_no": "3793",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، أخبرني عمرو بن قيس الكندي، عن عبد الله بن بسر، أن أعرابيا، قال لرسول الله  صلى الله عليه وسلم  إن شرائع الإسلام قد كثرت على فأنبئني منها بشىء أتشبث به ‏.‏ قال ‏\"‏ لا يزال لسانك رطبا من ذكر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Busr that a Bedouin said to the Messenger of Allah(ﷺ) said:                     \"The laws of Islam are burdensome for me. Tell me of something that I will be able to adhere to. He said: 'Always keep your tongue moist with the remembrance of Allah, the Mighty and Sublime.'\"",
      "chain": [
        "20436",
        "20650",
        "20675",
        "19935",
        "3650"
      ]
    },
    {
      "hadith_no": "4156",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا معن بن عيسى، عن معاوية بن صالح، عن حاتم بن حريث، عن مالك بن أبي مريم، عن عبد الرحمن بن غنم الأشعري، عن أبي مالك الأشعري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليشربن ناس من أمتي الخمر يسمونها بغير اسمها يعزف على رءوسهم بالمعازف والمغنيات يخسف الله بهم الأرض ويجعل منهم القردة والخنازير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Malik Ash’ari that the Messenger of Allah(ﷺ) said:                      “People among my nation will drink wine, calling it byanother name, and musical instruments will be played for them andsinging girls (will sing for them). Allah will cause the earth toswallow them up, and will turn them into monkeys and pigs.”",
      "chain": [
        "11184",
        "30112",
        "20675",
        "18138",
        "17058",
        "5152",
        "5372"
      ]
    }
  ],
  "total_hadiths": 106
}