{
  "id": "20707",
  "name": "Hisham bin Ishaq bin 'Abdullah هشام بن إسحاق بن عبد الله بن الحارث",
  "full_name": "Hisham bin Ishaq bin 'Abdullah هشام بن إسحاق بن عبد الله بن الحارث",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ 4  -  مقبول ]"
    ],
    "tags": [
      "Quraish",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "19898",
      "name": "Ishaq bin 'Abdullah bin al-Harith إسحاق بن عبد الله بن الحارث بن كنانة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19898",
      "name": "Ishaq bin 'Abdullah bin al-Harith إسحاق بن عبد الله بن الحارث بن كنانة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1165",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا النفيلي، وعثمان بن أبي شيبة، نحوه قالا حدثنا حاتم بن إسماعيل، حدثنا هشام بن إسحاق بن عبد الله بن كنانة، قال أخبرني أبي قال، أرسلني الوليد بن عتبة - قال عثمان ابن عقبة وكان أمير المدينة - إلى ابن عباس أسأله عن صلاة، رسول الله صلى الله عليه وسلم في الاستسقاء فقال خرج رسول الله صلى الله عليه وسلم متبذلا متواضعا متضرعا حتى أتى المصلى - زاد عثمان فرقي على المنبر ثم اتفقا - ولم يخطب خطبكم هذه ولكن لم يزل في الدعاء والتضرع والتكبير ثم صلى ركعتين كما يصلي في العيد ‏.‏ قال أبو داود والإخبار للنفيلي والصواب ابن عتبة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ishaq ibn Abdullah ibn Kinanah reported: Al-Walid ibn Utbah or (according to the version of Uthman) al-Walid ibn Uqbah, the then governor of Medina, sent me to Ibn Abbas to ask him about the prayer for rain offered by the Messenger of Allah (ﷺ). He said: The Messenger of Allah (ﷺ) went out wearing old clothes in a humble and lowly manner until he reached the place of prayer. He then ascended the pulpit, but he did not deliver the sermon as you deliver (usually).  He remained engaged in making supplication, showing humbleness (to Allah) and uttering the takbir (Allah is most great). He then offered two rak'ahs of prayer as done on the 'Id (festival).Abu Dawud said: This is the version of al-Nufail. What is correct is Ibn Utbah's",
      "chain": [
        "30352",
        "30203",
        "20159",
        "20707",
        "19898",
        "17"
      ]
    }
  ],
  "total_hadiths": 1
}