{
  "id": "20701",
  "name": "'Abdur Rahman bin Harith bin 'Ayyash عبد الرحمن بن الحارث بن عياش",
  "full_name": "'Abdur Rahman bin Harith bin 'Ayyash عبد الرحمن بن الحارث بن عياش",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": [
        "80 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "143",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "19700",
      "name": "al-Harith bin 'Abdullah bin 'Ayyash الحارث بن عبد الله بن عياش",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "29005",
      "name": "'Abdullah bin al-Harith bin 'Abdullah عبد الله بن الحارث بن عبد الله",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "children": [
    {
      "id": "20181",
      "name": "al-Mughira bin 'Abdur Rahman bin Harith المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "teachers": [
    {
      "id": "29005",
      "name": "'Abdullah bin al-Harith bin 'Abdullah عبد الله بن الحارث بن عبد الله",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "12114",
      "name": "Zayd bin 'Ali bin al-Husain زيد بن علي بن الحسين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19803",
      "name": "Hakeem bin Hakeem bin 'Aabad حكيم بن حكيم بن عباد بن حنيف الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10880",
      "name": "Sulaiman bin Musa al-Ashdaq سليمان بن موسى الأموي الأشدق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20181",
      "name": "al-Mughira bin 'Abdur Rahman bin Harith المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "23063",
      "name": "Muslim bin Khalid al-Zanji مسلم بن خالد الزنجي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11230",
      "name": "al-Walid bin Kathir al-Makhzumi الوليد بن كثير المخزومي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-149",
      "hadith_no": "149",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبد الرحمن بن أبي الزناد، عن عبد الرحمن بن الحارث بن عياش بن أبي ربيعة، عن حكيم بن حكيم، وهو ابن عباد بن حنيف أخبرني نافع بن جبير بن مطعم، قال أخبرني ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ أمني جبريل عليه السلام عند البيت مرتين فصلى الظهر في الأولى منهما حين كان الفىء مثل الشراك ثم صلى العصر حين كان كل شيء مثل ظله ثم صلى المغرب حين وجبت الشمس وأفطر الصائم ثم صلى العشاء حين غاب الشفق ثم صلى الفجر حين برق الفجر وحرم الطعام على الصائم ‏.‏ وصلى المرة الثانية الظهر حين كان ظل كل شيء مثله لوقت العصر بالأمس ثم صلى العصر حين كان ظل كل شيء مثليه ثم صلى المغرب لوقته الأول ثم صلى العشاء الآخرة حين ذهب ثلث الليل ثم صلى الصبح حين أسفرت الأرض ثم التفت إلى جبريل فقال يا محمد هذا وقت الأنبياء من قبلك ‏.‏ والوقت فيما بين هذين الوقتين ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وبريدة وأبي موسى وأبي مسعود الأنصاري وأبي سعيد وجابر وعمرو بن حزم والبراء وأنس ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"Jibril (peace be upon him] led me (in Salat) twice at the House. So he prayed Zuhr the first time when the shadow was similar to (the length of) the strap a sandal. Then he prayed Asr when everything was similar (to the length of) its shadow. Then he prayed Maghrib when the sun had set and the fasting person breaks fast. Then he prayed Isha when the twilight had vanished. Then he prayed Fajr when Fajr (dawn) began, and when eating is prohibited for the fasting person. The second time he prayed Zuhr when the shadow of everything was similar to (the length of) it, at the time of Asr the day before. Then he prayed Asr when the shadow of everything was about twice as long as it. Then he prayed Maghrib at the same time as he did the first time. Then he prayed Isha, the later one, when a third of the night had gone. Then he prayed Subh when the land glowed. The Jibril turned towards me and said: \"O Muhammad! These are the times of the Prophets before you, and the (best) time is what is between these two times.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20509",
        "20701",
        "19803",
        "11059",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-885",
      "hadith_no": "885",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عبد الرحمن بن الحارث بن عياش بن أبي ربيعة، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، رضى الله عنه قال وقف رسول الله صلى الله عليه وسلم بعرفة فقال ‏\"‏ هذه عرفة وهذا هو الموقف وعرفة كلها موقف ‏\"‏ ‏.‏ ثم أفاض حين غربت الشمس وأردف أسامة بن زيد وجعل يشير بيده على هيئته والناس يضربون يمينا وشمالا يلتفت إليهم ويقول ‏\"‏ يا أيها الناس عليكم السكينة ‏\"‏ ‏.‏ ثم أتى جمعا فصلى بهم الصلاتين جميعا فلما أصبح أتى قزح فوقف عليه وقال ‏\"‏ هذا قزح وهو الموقف وجمع كلها موقف ‏\"‏ ‏.‏ ثم أفاض حتى انتهى إلى وادي محسر فقرع ناقته فخبت حتى جاوز الوادي فوقف وأردف الفضل ثم أتى الجمرة فرماها ثم أتى المنحر فقال ‏\"‏ هذا المنحر ومنى كلها منحر ‏\"‏ ‏.‏ واستفتته جارية شابة من خثعم فقالت إن أبي شيخ كبير قد أدركته فريضة الله في الحج أفيجزئ أن أحج عنه قال ‏\"‏ حجي عن أبيك ‏\"‏ ‏.‏ قال ولوى عنق الفضل فقال العباس يا رسول الله لم لويت عنق ابن عمك قال ‏\"‏ رأيت شابا وشابة فلم آمن الشيطان عليهما ‏\"‏ ‏.‏ ثم أتاه رجل فقال يا رسول الله إني أفضت قبل أن أحلق ‏.‏ قال ‏\"‏ احلق أو قصر ولا حرج ‏\"‏ ‏.‏ قال وجاء آخر فقال يا رسول الله إني ذبحت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال ثم أتى البيت فطاف به ثم أتى زمزم فقال ‏\"‏ يا بني عبد المطلب لولا أن يغلبكم الناس عنه لنزعت ‏\"‏ ‏.‏ قال وفي الباب عن جابر ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح لا نعرفه من حديث علي إلا من هذا الوجه من حديث عبد الرحمن بن الحارث بن عياش ‏.‏ وقد رواه غير واحد عن الثوري مثل هذا ‏.‏ والعمل على هذا عند أهل العلم رأوا أن يجمع بين الظهر والعصر بعرفة في وقت الظهر ‏.‏ وقال بعض أهل العلم إذا صلى الرجل في رحله ولم يشهد الصلاة مع الإمام إن شاء جمع هو بين الصلاتين مثل ما صنع الإمام ‏.‏ قال وزيد بن علي هو ابن حسين بن علي بن أبي طالب عليه السلام ‏.‏",
      "text_en": " Ali bin Abi Talib, may Allah be pleased with him, narrated:                     \"The Messenger of Allah stopped at Arafat and said: 'This is Arafah and it is a place of standing. And all of Arafat is a place for standing.' Then he departed when the sun had set and took Usamah bin Zaid as a companion rider, and he was motioning with his hand as was his custom, and the people were striking (their camels) on the right and the left to try and catch them, so he said: 'O you people! Be calmm.' Then he came to Jama and performed the two Salat there combined. When the morning came, he went to Quzah and stood there and said: 'This is Quzah, and it is a place of standing, and all of Jama is a place for standing.' Then he departed until he arrived at Wadi Muhassir. Then he stuck his she-camel and she trotted until he passed the valley. Then he stopped and took Al-Fadl as a companion rider and went to the Jamrah to stone it. Then he went to Al-Manhar and said: 'This is Al-Manhar, and all of Mina is a place for sacrifice.' A young girl from Khath'am came to ask him for a verdict, she said: 'Indeed my father is an elderly man who has lived until Allah has made Hajj obligatory, so would he be rewarded if I perform Hajj for him? He said: 'Perform Hajj for your father.'\" He said: \"And he turned the neck of Al Fadl. So Al-Abbas said: 'O Messenger of Allah! Why did you turn the neck of your cousin?' He said: 'I saw a young man and a young woman, and they were not safe from Shaitan.' A man came to him and said, 'O Messenger of Allah! I performed (Tawaf) Al-Ifadah before shaving.' He said: 'Shave, and there is no harm'\" - or: 'Clip and there is no harm'\" He said: \"Someone else came and said: 'O Messenger of Allah! I did the sacrifice before stoning.' So he said: 'Stone, and there is no harm.'\" He said: \"Then he went to the House (Ka'bah) to perform Tawaf around it, then he went to Zamzam and said: 'O tribe of Abdul-Muttalib! If it were not that the people would rush upon you then I would remove it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20355",
        "20012",
        "20701",
        "19700",
        "11199",
        "5"
      ]
    }
  ],
  "total_hadiths": 2
}