{
  "id": "20719",
  "name": "Muhammad bin Rashid al-Mkhwly محمد بن راشد المكحولي الخزاعي الدمشقي",
  "full_name": "Muhammad bin Rashid al-Mkhwly محمد بن راشد المكحولي الخزاعي الدمشقي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ 4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Khuza'i",
      "al-Damashqi",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "17055",
      "name": "Layth bin Abi Raqiyya ليث بن أبي رقية",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10880",
      "name": "Sulaiman bin Musa al-Ashdaq سليمان بن موسى الأموي الأشدق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12246",
      "name": "'Abdullah bin Muhammad bin 'Aqil عبد الله بن محمد بن عقيل بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17084",
      "name": "Yahya bin Yahya bin Qays يحيى بن يحيى بن قيس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24341",
      "name": "'Amr bin 'Ubaid bin Bab عمرو بن عبيد بن باب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10793",
      "name": "Abd'h bin Abi Lbabh عبدة بن أبي لبابة الأسدي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28194",
      "name": "Zayd bin Abi al-Zrqa'a زيد بن أبي الزرقاء يزيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27509",
      "name": "Khalid bin Yazid al-Slmy خالد بن يزيد السلمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27540",
      "name": "Muhammad bin Bkar bin Bilal محمد بن بكار بن بلال العاملي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34062",
      "name": "Hafs bin 'Umar Abu حفص بن عمر أبو عمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20656",
      "name": "Shayban bin Farroukh شيبان بن فروخ / أبي شيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2113",
      "hadith_no": "2113",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا محمد بن راشد، عن مكحول، نحو خبر سهل قال وكان مكحول يقول ليس ذلك لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Makhul has also transmitted a tradition like the one narrated by Sahl (b. Sa'd al-Sa'idi). Makhul used to say:                      This is not lawful for anyone after the Messenger of Allah (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "38673",
        "20719",
        "11066"
      ]
    },
    {
      "id": "sunan-abi-daud-2265",
      "hadith_no": "2265",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا محمد بن راشد، ح وحدثنا الحسن بن علي، حدثنا يزيد بن هارون، أخبرنا محمد بن راشد، - وهو أشبع - عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، قال إن النبي صلى الله عليه وسلم قضى أن كل مستلحق استلحق بعد أبيه الذي يدعى له ادعاه ورثته فقضى أن كل من كان من أمة يملكها يوم أصابها فقد لحق بمن استلحقه وليس له مما قسم قبله من الميراث شىء وما أدرك من ميراث لم يقسم فله نصيبه ولا يلحق إذا كان أبوه الذي يدعى له أنكره وإن كان من أمة لم يملكها أو من حرة عاهر بها فإنه لا يلحق به ولا يرث وإن كان الذي يدعى له هو ادعاه فهو ولد زنية من حرة كان أو أمة ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather reported:                      The Prophet (ﷺ) decided regarding one who was treated as a member of a family after the death of his father, to whom he was attributed when the heirs said he was one of them, that if he was the child of a slave-woman whom the father owned when he had intercourse with her, he was included among those who sought his inclusion, but received none of the inheritance which was previously divided; he, however, received his portion of the inheritance which had not already been divided; but if the father to whom he was attributed had disowned him, he was not joined to the heirs. If he was a child of a slave-woman whom the father did not possess or of a free woman with whom he had illicit intercourse, he was not joined to the heirs and did not inherit even if the one to whom he was attributed is the one who claimed paternity, since he was a child of fornication whether his mother was free or a slave.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20719",
        "30",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-3600",
      "hadith_no": "3600",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا حفص بن عمر، حدثنا محمد بن راشد، حدثنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم رد شهادة الخائن والخائنة وذي الغمر على أخيه ورد شهادة القانع لأهل البيت وأجازها لغيرهم ‏.‏ قال أبو داود الغمر الحنة والشحناء والقانع الأجير التابع مثل الأجير الخاص ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority told that his grandfather said:                      The Messenger of Allah (ﷺ) rejected the testimony of a deceitful man and woman, of one who harbours rancour against his brother, and he rejected the testimony of one who is dependent on a family, and he allowed his testimony for other.Abu Dawud said: Ghimr means malice and enimity ; qani (dependant), a subordinate servant like a special servant.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4506",
      "hadith_no": "4506",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسلم، حدثنا محمد بن راشد، حدثنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقتل مؤمن بكافر ومن قتل مؤمنا متعمدا دفع إلى أولياء المقتول فإن شاءوا قتلوه وإن شاءوا أخذوا الدية ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     On his father's authority said that his grandfather reported the Prophet (ﷺ) said: A believer will not be killed for an infidel. If anyone kills a man deliberately, he is to be handed over to the relatives of the one who has been killed. If they wish, they may kill, but if they wish, they may accept blood-wit",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4541",
      "hadith_no": "4541",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا محمد بن راشد، ح وحدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى أن من قتل خطأ فديته مائة من الإبل ثلاثون بنت مخاض وثلاثون بنت لبون وثلاثون حقة وعشرة بني لبون ذكر ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the  Messenger of Allah (ﷺ) gave judgment that if anyone is killed accidentally, his blood-wit should be one hundred camels: thirty she-camels which had entered their second year, thirty she-camels which had entered their third year, thirty she-camels which had entered their fourth year, and ten male camels which had entered their third year.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20719",
        "38673",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4564",
      "hadith_no": "4564",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "قال أبو داود وجدت في كتابي عن شيبان، - ولم أسمعه منه - فحدثناه أبو بكر، - صاحب لنا ثقة - قال حدثنا شيبان، حدثنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، قال كان رسول الله صلى الله عليه وسلم يقوم دية الخطإ على أهل القرى أربعمائة دينار أو عدلها من الورق يقومها على أثمان الإبل فإذا غلت رفع في قيمتها وإذا هاجت رخصا نقص من قيمتها وبلغت على عهد رسول الله صلى الله عليه وسلم ما بين أربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ثمانية آلاف درهم وقضى رسول الله صلى الله عليه وسلم على أهل البقر مائتى بقرة ومن كان دية عقله في الشاء فألفى شاة قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن العقل ميراث بين ورثة القتيل على قرابتهم فما فضل فللعصبة ‏\"‏ ‏.‏ قال وقضى رسول الله صلى الله عليه وسلم في الأنف إذا جدع الدية كاملة وإن جدعت ثندوته فنصف العقل خمسون من الإبل أو عدلها من الذهب أو الورق أو مائة بقرة أو ألف شاة وفي اليد إذا قطعت نصف العقل وفي الرجل نصف العقل وفي المأمومة ثلث العقل ثلاث وثلاثون من الإبل وثلث أو قيمتها من الذهب أو الورق أو البقر أو الشاء والجائفة مثل ذلك وفي الأصابع في كل أصبع عشر من الإبل وفي الأسنان في كل سن خمس من الإبل وقضى رسول الله صلى الله عليه وسلم أن عقل المرأة بين عصبتها من كانوا لا يرثون منها شيئا إلا ما فضل عن ورثتها فإن قتلت فعقلها بين ورثتها وهم يقتلون قاتلهم وقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس للقاتل شىء وإن لم يكن له وارث فوارثه أقرب الناس إليه ولا يرث القاتل شيئا ‏\"‏ ‏.‏ قال محمد هذا كله حدثني به سليمان بن موسى عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود محمد بن راشد من أهل دمشق هرب إلى البصرة من القتل ‏.‏",
      "text_en": " Narrated Abu Dawud:                     I found in my notebook from Shaiban and I did not hear from him ; Abu Bakr, a reliable friend of ours, said: Shaiban - Muhammad b. Rashid - Sulaiman b. Musad - 'Amr b. Suh'aib, On his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) would fix the blood-money for accidental killing at the rate of four hundred dinars or their equivalent in silver for townsmen, and he would fix it according to the price of camels. So when they were dear, he increased the amount to be paid, and when cheap prices prevailed he reduced the amount to be paid. In the time of the Messenger of Allah (ﷺ) they reached between four hundred and eight hundred dinars, their equivalent in silver being eight thousand dirhams.  He said: The Messenger of Allah (ﷺ) gave judgment that those who possessed cattle should pay two hundred cows, and those who possessed sheep two thousand sheep.  He said: The Messenger of Allah (ﷺ) said: The blood-money is to be treated as something to be inherited by the heirs of the one who has been killed, and the remainder should be divided among the agnates.  He said: The Messenger of Allah (ﷺ) gave judgment that for cutting off a nose completely there was full blood-money, one hundred (camels) were to be paid. If the tip of the nose was cut off, half of the blood-money,i.e. fifty camels were to be paid, or their equivalent in gold or in silver, or a hundred cows, or one thousand sheep. For the hand, when it was cut of,f half of the blood-money was to be paid; for one foot of half, the blood-money was to be paid. For a wound in the head, a third of the blood-money was due, i.e. thirty-three camels and a third of the blood-money, or their equivalent in gold, silver, cows or sheep. For a head thrust which reaches the body, the same blood-money was to be paid. Ten camels were to be paid for every finger, and five camels for every tooth.  The Messenger of Allah (ﷺ) gave judgment that the blood-money for a woman should be divided among her relatives on her father's side, who did not inherit anything from her except the residence of her heirs. If she was killed, her blood-money should be distributed among her heirs, and they would have the right of taking revenge on the murderer.  The Messenger of Allah (ﷺ) said: There is nothing for the murderer; and if he (the victim) has no heir, his heir will be the one who is nearest to him among the people, but the murderer should not inherit anything.  Muhammad said: All this has been transmitted to me by Sulayman ibn Musa on the authority of Amr ibn Shu'aib who, on his father's authority, said that his grandfather heard it from the Prophet (ﷺ).Abu Dawud said: Muhammad b. Rashid, an inhabitant of Damascus, fled from Basrah escaping murder.",
      "usc_msa_ref": "",
      "chain": [
        "20240",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4565",
      "hadith_no": "4565",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا محمد بن بكار بن بلال العاملي، أخبرنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ عقل شبه العمد مغلظ مثل عقل العمد ولا يقتل صاحبه ‏\"‏ ‏.‏ قال وزادنا خليل عن ابن راشد ‏\"‏ وذلك أن ينزو الشيطان بين الناس فتكون دماء في عميا في غير ضغينة ولا حمل سلاح ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Prophet (ﷺ) said: Blood-wit for what resembles intentional murder is to be made as severe as that for intentional murder, but the culprit is not to be killed. Khalid gave us some additional information on the authority of Ibn Rashid: That (unintentional murder which resembles intentional murder) means that Satan jumps among the people and then the blood is shed blindly without any malice and weapon.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "27540",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1387",
      "hadith_no": "1387",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، أخبرنا حبان، وهو ابن هلال حدثنا محمد بن راشد، أخبرنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل مؤمنا متعمدا دفع إلى أولياء المقتول فإن شاءوا قتلوا وإن شاءوا أخذوا الدية وهي ثلاثون حقة وثلاثون جذعة وأربعون خلفة وما صالحوا عليه فهو لهم ‏\"‏ ‏.‏ وذلك لتشديد العقل ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن غريب ‏.‏",
      "text_en": " Narrated Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) said: \"Whoever kills [a believer] deliberately, he is handed over to the guardians of the one killed. If they wish to, they have him killed, and if they wish to, they take the blood-money. That is thirty Hiqqah, thirty Jadha'ahs and forty pregnant camels. Whatever (amount more) they require from him, than that is for them (if they choose).\" THat is because of the severity of blood-money.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4801",
      "hadith_no": "4801",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد بن هارون، قال أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل خطأ فديته مائة من الإبل ثلاثون بنت مخاض وثلاثون بنت لبون وثلاثون حقة وعشرة بني لبون ذكور ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم يقومها على أهل القرى أربعمائة دينار أو عدلها من الورق ويقومها على أهل الإبل إذا غلت رفع في قيمتها وإذا هانت نقص من قيمتها على نحو الزمان ما كان فبلغ قيمتها على عهد رسول الله صلى الله عليه وسلم ما بين الأربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ‏.‏ قال وقضى رسول الله صلى الله عليه وسلم أن من كان عقله في البقر على أهل البقر مائتى بقرة ومن كان عقله في الشاة ألفى شاة وقضى رسول الله صلى الله عليه وسلم أن العقل ميراث بين ورثة القتيل على فرائضهم فما فضل فللعصبة وقضى رسول الله صلى الله عليه وسلم أن يعقل على المرأة عصبتها من كانوا ولا يرثون منه شيئا إلا ما فضل عن ورثتها وإن قتلت فعقلها بين ورثتها وهم يقتلون قاتلها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah said:                     \"Whoever is killed by mistake, his ransom is one hundred camels: Thirty Bint Makkah, thirty Bint Labun, thirty Hiqqah and ten Bin Labun. \"[1] The Messenger of Allah used to fix the value (of the Diayah for accidental killing) among town-dwellers at four hundred Dinars or the equivalent value in silver. When he calculated the price in terms of people with camels (for Bedouin), it would vary from one time to another. When prices rose, the value in Dinars would rise, and when prices fell the value in Dinars would fall. At the time of the Messenger of Allah the value was between four hundred and eight hundred Dinars, or the equivalent value in silver, eight thousand Dirhams. And the Messenger of Allah ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if a person's blood money was paid in sheep, among this who kept sheep, the value was two thousand sheep. The Messenger of Allah ruled that the blood money is part of the estate, to be divided among the heirs of the victim according to their allotted shares, and whatever is left over is for the 'Asabah. And the Messenger of Allah ruled that if a woman commits urder then he 'Asahah, whoever they may be, must pay the blood money, but they do not inherit anything except that which is left over from her heirs; if a woman is killed then her blood money is to be shared among her heirs, and they may kill her killer. (Hasah)",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4806",
      "hadith_no": "4806",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، عن محمد بن راشد، عن سليمان بن موسى، وذكر، كلمة معناها عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عقل أهل الذمة نصف عقل المسلمين ‏\"‏ ‏.‏ وهم اليهود والنصارى ‏.‏",
      "text_en": " It was narrated from 'Amr Bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said: 'The blood money for Ahl Adh-Dhimmah is half that of the blood money for the Muslims, and they are the Jews and Christians.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-1019",
      "hadith_no": "1019",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو سعيد، سفيان بن زياد المؤدب حدثنا محمد بن راشد، عن الحسن بن ذكوان، عن عطاء، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  أن يغطي الرجل فاه في الصلاة ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)forbade a man to cover his mouth during the prayer.”",
      "usc_msa_ref": "",
      "chain": [
        "20719",
        "11582",
        "11029",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2727",
      "hadith_no": "2727",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا أبي، حدثنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل عمدا دفع إلى أولياء القتيل فإن شاءوا قتلوا وإن شاءوا أخذوا الدية وذلك ثلاثون حقة وثلاثون جذعة وأربعون خلفة وذلك عقل العمد ما صولحوا عليه فهو لهم وذلك تشديد العقل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from this father, from his grandfather that the Messenger of Allah (ﷺ) said:                     “Whoever kills deliberately, he will be handed over to the heirs of the victim. If they want, they may kill him, or if they want, they may accept the blood money, which is thirty Hiqqah, thirty Jadha'ah and forty Khalifah. This is the blood money for deliberate slaying. Whatever is settled by reconciliation belongs to them, and that is a binding covenant.”",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-2732",
      "hadith_no": "2732",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور المروزي، أنبأنا يزيد بن هارون، أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل خطأ فديته من الإبل ثلاثون بنت مخاض وثلاثون ابنة لبون وثلاثون حقة وعشرة بني لبون ‏\"‏ ‏.‏ وكان رسول الله صلى الله عليه وسلم يقومها على أهل القرى أربعمائة دينار أو عدلها من الورق ويقومها على أزمان الإبل إذا غلت رفع في ثمنها وإذا هانت نقص من ثمنها على نحو الزمان ما كان فبلغ قيمتها على عهد رسول الله صلى الله عليه وسلم ما بين الأربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ثمانية آلاف درهم قضى رسول الله صلى الله عليه وسلم أن من كان عقله في البقر على أهل البقر مائتى بقرة ومن كان عقله في الشاء على أهل الشاء ألفى شاة ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                     “Whoever is killed by mistake, his blood money in camels is thirty Bint Makhad (a one-year-old she-camel), thirty Bint Labun (a two-year-old she-camel), thirty Hiqqah (a three-year-old she-camel) and ten Bani Labun (two-years-old male-camel).” The Messenger of Allah (ﷺ) used to fix the value (of the blood money for accidental killing) among town-dwellers at four hundred Dinar or the equivalent value in silver. When he calculated the price in terms of camels (for Bedouins), it would vary from one time to another. When prices roses, the value (in dinars) would rise: and when prices fell, the value (in Dinar) would fall. At the time of the Messenger of Allah (ﷺ) the value was between four hundred and eight hundred dinar, or the equivalent value in silver, eight thousand Dirham. And the Messenger of Allah (ﷺ) ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if person's blood money was paid in sheep, among those who kept sheep, the value was two thousand sheep. (Hasan).",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-2749",
      "hadith_no": "2749",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا يزيد بن هارون، أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، قال قضى رسول الله صلى الله عليه وسلم أن يعقل المرأة عصبتها من كانوا ولا يرثوا منها شيئا إلا ما فضل عن ورثتها وإن قتلت فعقلها بين ورثتها فهم يقتلون قاتلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     “The Messenger of Allah (ﷺ) ruled that a woman's blood money (if she kills someone) should be paid by her male relatives on her father's side, whoever they are, and they should not inherit anything from her, except what is left over after her heirs have been taken their shares. If she is killed than her blood money is to be shared among her heirs, since they are the ones who may kill the one who killed her.”",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-2851",
      "hadith_no": "2851",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن بكار بن بلال الدمشقي، أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل مستلحق استلحق بعد أبيه الذي يدعى له ادعاه ورثته من بعده فقضى أن من كان من أمة يملكها يوم أصابها فقد لحق بمن استلحقه وليس له فيما قسم قبله من الميراث شىء وما أدرك من ميراث لم يقسم فله نصيبه ولا يلحق إذا كان أبوه الذي يدعى له أنكره وإن كان من أمة لا يملكها أو من حرة عاهر بها فإنه لا يلحق ولا يورث وإن كان الذي يدعى له هو ادعاه فهو ولد زنا لأهل أمه من كانوا حرة أو أمة ‏\"‏ ‏.‏ قال محمد بن راشد يعني بذلك ما قسم في الجاهلية قبل الإسلام ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said:                      “Every childwhois attributed to his father after his father to whom he isattributedhas died, and his heirs attributed him to him after hedied, he ruledthat* whoever was born to a slave woman whom he ownedat the time whenhe had intercourse with her, he should be namedafter the one to whomhe was attributed, but he has no share of anyinheritance that wasdistributed previously. Whatever inheritance hefinds has not yet beendistributed, he will have a share of it. Buthe cannot be named afterhis father if the man whom he claimed as hisfather did notacknowledge him. If he as born to a slave woman whomhis father didnot own, or to a free woman with whom he committedadultery, then hecannot be named after him and he does not inheritfrom him, even ifthe one whom he claims as his father acknowledgeshim. So he is anillegitimate child who belongs to his mother’speople, whoever theyare, whether she is a free woman or a slave.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30512",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 15
}