{
  "id": "20711",
  "name": "Sufyan bin Habib al-Basri سفيان بن حبيب البصري",
  "full_name": "Sufyan bin Habib al-Basri سفيان بن حبيب البصري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "186",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11275",
      "name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20628",
      "name": "Musa bin 'Ali bin Rabah موسى بن علي بن رباح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30430",
      "name": "Hameed bin Musa'da bin al-Mubarak حميد بن مسعدة بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34055",
      "name": "al-Hasan bin Qz'h الحسن بن قزعة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30147",
      "name": "'Abdur Rahman bin al-Mubarak al-'Aishi عبد الرحمن بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30395",
      "name": "Nasr bin 'Ali bin Nasr bin 'Ali نصر بن علي بن نصر بن علي الجهضمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30573",
      "name": "Yusuf bin Hmad يوسف بن حماد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1059",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، قال سفيان بن حبيب خبرنا عن خالد الحذاء، عن أبي قلابة، عن أبي المليح، عن أبيه، أنه شهد النبي صلى الله عليه وسلم زمن الحديبية في يوم جمعة وأصابهم مطر لم تبتل أسفل نعالهم فأمرهم أن يصلوا في رحالهم ‏.‏",
      "text_en": " Narrated Usamah ibn Umayr al-Huzali:                     Usamah attended the Prophet (ﷺ) on the occasion of the treaty of al-Hudaybiyyah on Friday. The rain fell as little as the soles of the shoes of the people were not set. He (the Prophet) commanded them to offer Friday prayer in their dwellings.",
      "chain": [
        "30395",
        "20711",
        "11282",
        "11047",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "2421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، ح وحدثنا يزيد بن قبيس، - من أهل جبلة - حدثنا الوليد، جميعا عن ثور بن يزيد، عن خالد بن معدان، عن عبد الله بن بسر السلمي، عن أخته، - وقال يزيد الصماء - أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تصوموا يوم السبت إلا فيما افترض عليكم وإن لم يجد أحدكم إلا لحاء عنبة أو عود شجرة فليمضغه ‏\"‏ ‏.‏ قال أبو داود وهذا حديث منسوخ ‏.‏",
      "text_en": " Narrated As-Samma' sister of Abdullah ibn Busr:                     The Prophet (ﷺ) said: Do not fast on Saturday except what has been made obligatory on you; and if one of you can get nothing but a grape skin or a piece of wood from a tree, he should chew it.",
      "chain": [
        "30430",
        "20711",
        "20733",
        "20415",
        "11422"
      ]
    },
    {
      "hadith_no": "2691",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الرحمن بن المبارك العيشي، قال حدثنا سفيان بن حبيب، قال حدثنا شعبة، عن أبي العنبس، عن أبي الشعثاء، عن ابن عباس، أن النبي صلى الله عليه وسلم جعل فداء أهل الجاهلية يوم بدر أربعمائة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) fixed the ransom of the people of pre-Islamic Arabia at four hundred dirhams per head on the day of the battle of Badr.",
      "chain": [
        "30147",
        "20711",
        "20020",
        "11351",
        "17"
      ]
    },
    {
      "hadith_no": "744",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، عن ثور بن يزيد، عن خالد بن معدان، عن عبد الله بن بسر، عن أخته، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تصوموا يوم السبت إلا فيما افترض الله عليكم فإن لم يجد أحدكم إلا لحاء عنبة أو عود شجرة فليمضغه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومعنى كراهته في هذا أن يخص الرجل يوم السبت بصيام لأن اليهود تعظم يوم السبت ‏.‏",
      "text_en": " Abdullah bin Busr narrated from his sister that :                     the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"",
      "chain": [
        "30430",
        "20711",
        "20415",
        "11422",
        "3650"
      ]
    },
    {
      "hadith_no": "842",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا حميد بن مسعدة البصري، حدثنا سفيان بن حبيب، عن هشام بن حسان، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم تزوج ميمونة وهو محرم ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وبه يقول سفيان الثوري وأهل الكوفة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet married Maimunah while he was a Muhrim.\"",
      "chain": [
        "30430",
        "20711",
        "11311",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1201",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، عن الحجاج الصواف، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يغار والمؤمن يغار وغيرة الله أن يأتي المؤمن ما حرم عليه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعبد الله بن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب ‏.‏ وقد روي عن يحيى بن أبي كثير عن أبي سلمة عن عروة عن أسماء بنت أبي بكر عن النبي صلى الله عليه وسلم هذا الحديث وكلا الحديثين صحيح ‏.‏ والحجاج الصواف هو الحجاج بن أبي عثمان وأبو عثمان اسمه ميسرة والحجاج يكنى أبا الصلت وثقه يحيى بن سعيد القطان ‏.‏ حدثنا أبو بكر العطار عن علي بن المديني قال سألت يحيى بن سعيد القطان عن حجاج الصواف فقال ثقة فطن كيس ‏.‏",
      "text_en": " Abu Hurairah narrated that The Messenger of Allah said:                      “Allah becomes jealous and the believer becomes jealous.  Allah’s jealousy occurs when a believer does what He has made unlawful for him.”",
      "chain": [
        "30430",
        "20711",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3338",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة، حدثنا سفيان بن حبيب، حدثنا سعيد، عن قتادة، عن خلاس بن عمرو، عن عمار بن ياسر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنزلت المائدة من السماء خبزا ولحما وأمروا أن لا يخونوا ولا يدخروا لغد فخانوا وادخروا ورفعوا لغد فمسخوا قردة وخنازير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قد رواه أبو عاصم وغير واحد عن سعيد بن أبي عروبة عن قتادة عن خلاس عن عمار بن ياسر موقوفا ولا نعرفه مرفوعا إلا من حديث الحسن بن قزعة ‏.‏",
      "text_en": " Narrated 'Ammar bin Yasir:                     \"The Messenger of Allah (ﷺ) said: 'The Ma'idah was sent down from the Heavens with bread and meat. And they were commanded to not be deceitful with it and hide it for tomorrow. So they were deceitful with it and they hid it, so it was raised up in the morning. Then they were transformed into monkeys and pigs.'\"",
      "chain": [
        "34055",
        "20711",
        "11168",
        "11019",
        "11283",
        "25"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، عن سعيد بن أبي عروبة، نحوه ولم يرفعه وهذا أصح من حديث الحسن بن قزعة ولا نعلم للحديث المرفوع أصلا ‏.‏",
      "text_en": "",
      "chain": [
        "30430",
        "20711",
        "11073"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة البصري، حدثنا سفيان بن حبيب، عن شعبة، عن ثوير، عن أبيه، عن الطفيل بن أبى بن كعب، عن أبيه، عن النبي صلى الله عليه وسلم ‏:‏ ‏(‏ وألزمهم كلمة التقوى ‏)‏ قال لا إله إلا الله ‏.‏ قال هذا حديث غريب لا نعرفه مرفوعا إلا من حديث الحسن بن قزعة قال وسألت أبا زرعة عن هذا الحديث فلم يعرفه مرفوعا إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated At-Tufail bin Ubayy bin Ka'b:                     from his father, from the Prophet (ﷺ) (regarding this Ayah): 'And made them stick to the word of Taqwa (48:26).' He (ﷺ) said (the word is): \"La Ilaha Illallah.\"",
      "chain": [
        "34055",
        "20711",
        "20020",
        "13898"
      ]
    },
    {
      "hadith_no": "83",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن النعمان بن سالم، عن ابن أبي أوس، عن جده، قال رأيت رسول الله صلى الله عليه وسلم استوكف ثلاثا ‏.‏",
      "text_en": " It was narrated from (Aws bin) Abi Aws that his grandfather said:                      \"I saw the Messenger of Allah (ﷺ) trickle water into his hand until it started to drip from his hand, three times.\"",
      "chain": [
        "30430",
        "20711",
        "20020",
        "10972"
      ]
    },
    {
      "hadith_no": "257",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان بن حبيب، عن شعبة، ح وحدثنا عمرو بن علي، قال حدثنا يحيى، وعبد الرحمن، عن شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت كان النبي صلى الله عليه وسلم - وقال عمرو كان رسول الله صلى الله عليه وسلم - إذا أراد أن يأكل أو ينام وهو جنب توضأ - زاد عمرو في حديثه - وضوءه للصلاة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"If the Prophet (ﷺ)\" - (one of the narrators) 'Amr said: \"If the Messenger of Allah (ﷺ)\" - \"wanted to eat or sleep while he was  Junub, he would perform Wudu'.\" In his narration, 'Amr (one of the narrators) added: \"Wudu' was for prayer.\"",
      "chain": [
        "30430",
        "20711",
        "20020",
        "30153",
        "20031",
        "10530",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "570",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا سفيان، - وهو ابن حبيب - عن موسى بن على، عن أبيه، قال سمعت عقبة بن عامر، يقول ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل وحين تضيف للغروب حتى تغرب ‏.‏",
      "text_en": " It was narrated from Musa bin 'Ali that his father said:                      \"I heard 'Uqbah bin 'Amir say: 'There are three times during which the Messenger of Allah (ﷺ) forbade us from praying or burying our dead: When the sun had clearly started to rise until it was fully risen, when it was directly overhead at noon until it has passed the zenith, and when it was close to setting until it had fully set.'\"",
      "chain": [
        "30430",
        "20711",
        "189"
      ]
    },
    {
      "hadith_no": "891",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان بن حبيب، عن سعيد بن زياد، عن زياد بن صبيح، قال صليت إلى جنب ابن عمر فوضعت يدي على خصري فقال لي هكذا ضربة بيده فلما صليت قلت لرجل من هذا قال عبد الله بن عمر ‏.‏ قلت يا أبا عبد الرحمن ما رابك مني قال إن هذا الصلب وإن رسول الله صلى الله عليه وسلم نهانا عنه ‏.‏",
      "text_en": " It was narrated that Ziyad bin Subaih said:                     \"I prayed beside Ibn Umar and put my hand on my waist, and he did this to me-knocked it with his hand. When I had finished praying I said to a man: 'Who is this?' He said: \"Abdullah bin Umar.' I said: 'O Abu Abdur-Rahman, why are you angry with me?' He said: 'This is the posture of crucifixion, and the Mesenger of Allah (ﷺ) forbade us to do this.'\"",
      "chain": [
        "30430",
        "20711",
        "13028",
        "18"
      ]
    },
    {
      "hadith_no": "1440",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن زبيد، عن عبد الرحمن بن أبي ليلى، عن عمر، قال صلاة الجمعة ركعتان والفطر ركعتان والنحر ركعتان والسفر ركعتان تمام غير قصر على لسان النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"The prayer for jumu'ah is two rak'ahs, and for Al-Fitr is two rak'ahs, and for An-Nahr is two rak'ahs, and for traveling is two rak'ahs, complete and not shortened, on the tongue of the Prophet (ﷺ).\"",
      "chain": [
        "30430",
        "20711",
        "20020",
        "11335",
        "11196",
        "3"
      ]
    },
    {
      "hadith_no": "1660",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان بن حبيب، عن حسين المعلم، عن عبد الله بن بريدة، عن عمران بن حصين، قال سألت النبي صلى الله عليه وسلم عن الذي يصلي قاعدا قال ‏\"‏ من صلى قائما فهو أفضل ومن صلى قاعدا فله نصف أجر القائم ومن صلى نائما فله نصف أجر القاعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain said:                     \"I asked the Prophet (ﷺ) about one who prays sitting down. He said: 'Whoever prays standing up is better, and one who prays sitting down will have half the reward of one who prays standing up. And whoever prays lying down will have half the reward of one who prays sitting down.'\"",
      "chain": [
        "30430",
        "20711",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "2823",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يوسف بن حماد المعني، قال حدثنا سفيان بن حبيب، عن شعبة، عن الحكم، وحبيب، - وهو ابن أبي ثابت - عن سعيد بن جبير، عن ابن عباس، أن الصعب بن جثامة، أهدى للنبي صلى الله عليه وسلم حمارا وهو محرم فرده عليه ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That As-Sab bin Jaththamah gave the Prophet some onager (meat) when he was in Ihram and he returned it to him.",
      "chain": [
        "30573",
        "20711",
        "20020",
        "11069",
        "11331",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2860",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حميد بن مسعدة البصري، قال حدثنا سفيان، - وهو ابن حبيب - عن الحجاج الصواف، عن يحيى بن أبي كثير، عن عكرمة، عن الحجاج بن عمرو الأنصاري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من عرج أو كسر فقد حل وعليه حجة أخرى ‏\"‏ ‏.‏ فسألت ابن عباس وأبا هريرة عن ذلك فقالا صدق ‏.‏",
      "text_en": " It was narrated from Ikrimah, from Al-Hajjaj bin Amr Al-Ansari that:                     he heard the Messenger of Allah say \"Whoever suffers a leg injury of breaks his leg, he has exited Ihram, but he has to perform another Hajj.\" I asked Ibn Abbas and Abu Hurarirah about that and he said \"He spoke the truth.\"",
      "chain": [
        "30430",
        "20711",
        "11449",
        "11023"
      ]
    },
    {
      "hadith_no": "3055",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن عبد الملك بن جريج، وعبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، عن الفضل بن عباس، أنه كان رديف النبي صلى الله عليه وسلم فلم يزل يلبي حتى رمى الجمرة ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin abbas that:                     he was riding behind the Prophet and he continued to recite the Talbiyah until he stoned the Jamrat.",
      "chain": [
        "30430",
        "20711",
        "11070",
        "10945",
        "11029",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3220",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا الحسن بن قزعة، قال حدثنا سفيان، - وهو ابن حبيب - عن ابن جريج، عن عطاء، عن جابر، قال لقيني رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا جابر هل أصبت امرأة بعدي ‏\"‏ ‏.‏ قلت نعم يا رسول الله ‏.‏ قال ‏\"‏ أبكرا أم أيما ‏\"‏ ‏.‏ قلت أيما ‏.‏ قال ‏\"‏ فهلا بكرا تلاعبك ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     It was narrated that Jabir said: \"The Messenger of Allah met me and said: 'O Jabir, have you got married to a woman since I last saw you?' I said: 'Yes, O Messenger of Allah.' He said: 'To a virgin or to a previously-married woman?' I said: 'To a previously-married woman.' He said: 'Why not a virgin, so she could play with you?'\"",
      "chain": [
        "34055",
        "20711",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3322",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن ابن جريج، عن ابن أبي مليكة، عن القاسم بن محمد، عن عائشة، قالت جاءت سهلة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن سالما يدخل علينا وقد عقل ما يعقل الرجال وعلم ما يعلم الرجال ‏.‏ قال ‏\"‏ أرضعيه تحرمي عليه بذلك ‏\"‏ ‏.‏ فمكثت حولا لا أحدث به ولقيت القاسم فقال حدث به ولا تهابه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Sahlah came to the Messenger of Allah and said: 'O Messenger of Allah, Salim enters upon us and he understands what men understand, and knows what men know.' He said: 'Breast-feed him, and you will become unlawful to him thereby.' (Ibn Abi Mulaikah, one of the narrators said:) For a year I did not narrate this, then I met Al-Qasim and he said: 'Narrate it and do not worry about it.'\"",
      "chain": [
        "30430",
        "20711",
        "11070",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4356",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن أبي يعفور، سمع عبد الله بن أبي أوفى، قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات فكنا نأكل الجراد ‏.‏",
      "text_en": " It was narrated from Abu Ya fur that he heard 'Abdullah bin Abi Awfa says:                     \"We went on seven campaigns with the Messenger of Allah and we used to eat locusts.\"",
      "chain": [
        "30430",
        "20711",
        "20020",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "4377",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن قتادة، عن جرى بن كليب، قال سمعت عليا، يقول نهى رسول الله صلى الله عليه وسلم أن يضحى بأعضب القرن ‏.‏ فذكرت ذلك لسعيد بن المسيب قال نعم إلا عضب النصف وأكثر من ذلك ‏.‏",
      "text_en": " 'Ali said:                     \"Messenger of Allah forbade us from sacrificing an animal with a broken horn.\" I (the narrator) mentioned that to Sa'eed bin Al_Musayyab and he said: \"Yes, m unless half or more of the horn is missing.\"",
      "chain": [
        "30430",
        "20711",
        "20020",
        "11019",
        "5"
      ]
    },
    {
      "hadith_no": "4651",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا يوسف بن حماد، قال حدثنا سفيان بن حبيب، عن هشام، عن عكرمة، عن ابن عباس، قال توفي رسول الله صلى الله عليه وسلم ودرعه مرهونة عند يهودي بثلاثين صاعا من شعير لأهله ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah died when his shield was in pledge with a Jew for thirty Sa's of barley for his family",
      "chain": [
        "30573",
        "20711",
        "20295",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4953",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن العرزمي، - وهو عبد الملك بن أبي سليمان - عن عطاء، قال أدنى ما يقطع فيه ثمن المجن ‏.‏ قال وثمن المجن يومئذ عشرة دراهم ‏.‏ قال أبو عبد الرحمن وأيمن الذي تقدم ذكرنا لحديثه ما أحسب أن له صحبة وقد روي عنه حديث آخر يدل على ما قلناه ‏.‏",
      "text_en": " It was narrated that 'Ata' said:                     \"The least for which the hand of a thief is to be cut off is the price of a shield. And the price of a shield in those days was ten Dirhams.\" (Hasan) Abu 'Abdur-Rahman (An-Nasai) said: Ayman, the one whose narrations preceded, I do not think he was a Companion, and another Hadith has been related from him which proves what we have said:",
      "chain": [
        "30430",
        "20711",
        "11029"
      ]
    },
    {
      "hadith_no": "5149",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن سفيان بن حبيب، عن خالد، عن أبي قلابة، عن معاوية، أن رسول الله صلى الله عليه وسلم نهى عن لبس الحرير والذهب إلا مقطعا ‏.‏ خالفه عبد الوهاب رواه عن خالد عن ميمون عن أبي قلابة ‏.‏",
      "text_en": " It was narrated from Mu'awiyah that:                     The Messenger of Allah [SAW] forbade wearing silk and gold, unless it was broken (into smaller pieces).",
      "chain": [
        "34055",
        "20711",
        "20423",
        "11047",
        "27"
      ]
    },
    {
      "hadith_no": "5366",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن سفيان بن حبيب، ومعتمر بن سليمان، عن أشعث، عن محمد بن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في لحفنا ‏.‏ قال سفيان ملاحفنا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] would not pray in our blankets.\"",
      "chain": [
        "34055",
        "20711",
        "20288",
        "11324",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "5572",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن الأوزاعي، قال حدثني أبو كثير، ح وأنبأنا حميد بن مسعدة، عن سفيان بن حبيب، عن الأوزاعي، قال حدثنا أبو كثير، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ الخمر من هاتين ‏\"‏ ‏.‏ وقال سويد في هاتين الشجرتين النخلة والعنبة ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Khamr comes from these two.'\" Suwaid (one of the narrators) said: \"From these two trees: The date palm and the grapevine.\"",
      "chain": [
        "38265",
        "20025",
        "20024",
        "19466",
        "30430",
        "20711",
        "20024",
        "19466",
        "13"
      ]
    }
  ],
  "total_hadiths": 27
}