{
  "id": "20714",
  "name": "Salah bin Abi al-Akhdr صالح بن أبي الأخضر اليمامي مولى هشام",
  "full_name": "Salah bin Abi al-Akhdr صالح بن أبي الأخضر اليمامي مولى هشام",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Yamama",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ 4  -  ضعيف ]"
    ],
    "tags": [
      "Client",
      "al-Yemami",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "29315",
      "name": "Abu Ubaid Hajb Sulaiman أبو عبيد حاجب",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "students": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25197",
      "name": "'Ali bin Gharab علي بن غراب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "223",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا ابن المبارك، عن يونس، عن الزهري، بإسناده ومعناه زاد ‏\"‏ وإذا أراد أن يأكل وهو جنب غسل يديه ‏\"‏ ‏.‏ قال أبو داود ورواه ابن وهب عن يونس فجعل قصة الأكل قول عائشة مقصورا ورواه صالح بن أبي الأخضر عن الزهري كما قال ابن المبارك إلا أنه قال عن عروة أو أبي سلمة ورواه الأوزاعي عن يونس عن الزهري عن النبي صلى الله عليه وسلم كما قال ابن المبارك ‏.‏",
      "text_en": " This Tradition has been narrated on the Authority of al-Zuhri through a different chain. It adds :                      If he intends to eat while he is defiled, he should wash both his hands.Abu Dawud said: Ibn Wahb narrated this tradition on the authority of  Yunus. He described the fact of eating as the statement of ‘A’ishah (not the saying of the prophet). It has also been narrated it from ‘Urwah or Abu Salamah. Al-Awza’I narrated it from Yunus on the Authority of Al-Zuhri from the prophet (ﷺ) as narrated by Ibn al-Mubarak.",
      "chain": [
        "30269",
        "20025",
        "20475",
        "30002",
        "20029",
        "20714"
      ]
    },
    {
      "hadith_no": "2616",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد بن السري، عن ابن المبارك، عن صالح بن أبي الأخضر، عن الزهري، قال عروة فحدثني أسامة، أن رسول الله صلى الله عليه وسلم كان عهد إليه فقال ‏\"‏ أغر على أبنى صباحا وحرق ‏\"‏ ‏.‏",
      "text_en": " Narrated Usamah:                     The Messenger of Allah (ﷺ) enjoined upon him to attack Ubna in the morning and burn the place.",
      "chain": [
        "30480",
        "20025",
        "20714",
        "11013"
      ]
    },
    {
      "hadith_no": "3460",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا النضر بن شميل، أخبرنا صالح بن أبي الأخضر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال لما قفل رسول الله صلى الله عليه وسلم من خيبر أسرى ليلة حتى أدركه الكرى أناخ فعرس ثم قال ‏\"‏ يا بلال اكلأ لنا الليلة ‏\"‏ ‏.‏ قال فصلى بلال ثم تساند إلى راحلته مستقبل الفجر فغلبته عيناه فنام فلم يستيقظ أحد منهم وكان أولهم استيقاظا النبي صلى الله عليه وسلم ‏.‏ فقال ‏\"‏ أى بلال ‏\"‏ ‏.‏ فقال بلال بأبي أنت يا رسول الله أخذ بنفسي الذي أخذ بنفسك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقتادوا ‏\"‏ ‏.‏ ثم أناخ فتوضأ فأقام الصلاة ثم صلى مثل صلاته للوقت في تمكث ثم قال ‏:‏ ‏(‏وأقم الصلاة لذكري ‏)‏ ‏.‏ قال هذا حديث غير محفوظ رواه غير واحد من الحفاظ عن الزهري عن سعيد بن المسيب أن النبي صلى الله عليه وسلم ولم يذكروا فيه عن أبي هريرة ‏.‏ وصالح بن أبي الأخضر يضعف في الحديث ضعفه يحيى بن سعيد القطان وغيره من قبل حفظه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"While the Messenger of Allah (ﷺ) was returning from Khaibar he traveled during the night until he became sleepy and he sat down to rest. Then he said: 'O Bilal! Stand guard for us for the night.'\" He said: 'So Bilal performed Salat, then he leaned against his mount facing the direction of (dawn awaiting) Fajr. His eyes overcame him until he slept, and not one of them awoke. The first of them to awaken was the Prophet (ﷺ) who said: 'O Bilal!' Bilal said: 'May my father be ransomed for you O Messenger of Allah! I was overtaken just as you were overtaken.' So the Messenger of Allah (ﷺ) said: 'Move out!' Then he kneeled to perform Wudu and to announce the standing for the Salat, then he performed Salat the same as he would when not traveling. Then he said: 'And establish the Salat for My rememberance (20:14).'\"",
      "chain": [
        "30277",
        "20291",
        "20714",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "632",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن صالح بن أبي الأخضر، عن الزهري، عن أنس، قال وضعت لرسول الله  صلى الله عليه وسلم  غسلا فاغتسل من جميع نسائه في ليلة ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"I put out water for the Messenger of Allah for a bath, and he had a bath after going to all of his wives in one night.\"",
      "chain": [
        "38409",
        "20032",
        "20714",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "1152",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عمار بن خالد الواسطي، حدثنا علي بن غراب، عن صالح بن أبي الأخضر، عن الزهري، عن عبيد بن السباق، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن هذا يوم عيد جعله الله للمسلمين فمن جاء إلى الجمعة فليغتسل وإن كان طيب فليمس منه وعليكم بالسواك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)said: ‘This day is an ‘Eid (festival) which Allah has ordainedfor theMuslims. Whoever comes to Friday (prayer), let him take abath and ifhe has perfume then let him put some on. And upon you (Iurge to use)is the tooth stick.”",
      "chain": [
        "38417",
        "25197",
        "20714",
        "11013",
        "11203",
        "17"
      ]
    },
    {
      "hadith_no": "2951",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا وكيع، عن صالح بن أبي الأخضر، عن الزهري، عن عروة بن الزبير، عن أسامة بن زيد، قال بعثني رسول الله صلى الله عليه وسلم إلى قرية يقال لها أبنى فقال ‏\"‏ ائت أبنى صباحا ثم حرق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Usamah bin Said said:                      “The Messenger of Allah(ﷺ)sent me to a village called Ubna, and said: “Go to Ubna in themorning and burn it.’”",
      "chain": [
        "38475",
        "20032",
        "20714",
        "11013",
        "10511",
        "50"
      ]
    }
  ],
  "total_hadiths": 6
}