{
  "id": "20724",
  "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
  "full_name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "165",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  4  -  صدوق ]",
      "Fiqh",
      "Hadith"
    ],
    "tags": [
      "al-Hadhli",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11648",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11375",
      "name": "'Ali bin al-Aqmar bin 'Amr علي بن الأقمر بن عمرو",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10806",
      "name": "'Awn bin 'Abdullah bin 'Utba عون بن عبد الله بن عتبة بن مسعود الهذلي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11374",
      "name": "'Alqama bin Mrthd علقمة بن مرثد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19929",
      "name": "'Ali bin Bdhymh علي بن بذيمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11345",
      "name": "Sa'id bin Abi Barda سعيد بن أبي بردة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11328",
      "name": "Jama' bin Shadad al-Maharbi جامع بن شداد المحاربي أبو صخرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10818",
      "name": "Muhammad bin 'Abdur Rahman bin 'Ubaid محمد بن عبد الرحمن بن عبيد القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11663",
      "name": "al-Walid bin al-Yzar bin Hryth الوليد بن العيزار بن حريث العبدي الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20430",
      "name": "'Asim bin 'Ali bin 'Asim عاصم بن علي بن عاصم بن صهيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20268",
      "name": "'Amr bin Marzuq al-Bahli عمرو بن مرزوق الباهلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-507",
      "hadith_no": "507",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، عن أبي داود، ح وحدثنا نصر بن المهاجر، حدثنا يزيد بن هارون، عن المسعودي، عن عمرو بن مرة، عن ابن أبي ليلى، عن معاذ بن جبل، قال أحيلت الصلاة ثلاثة أحوال وأحيل الصيام ثلاثة أحوال وساق نصر الحديث بطوله واقتص ابن المثنى منه قصة صلاتهم نحو بيت المقدس قط قال الحال الثالث أن رسول الله صلى الله عليه وسلم قدم المدينة فصلى - يعني نحو بيت المقدس - ثلاثة عشر شهرا فأنزل الله تعالى هذه الآية ‏{‏ قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا وجوهكم شطره ‏}‏ فوجهه الله تعالى إلى الكعبة ‏.‏ وتم حديثه وسمى نصر صاحب الرؤيا قال فجاء عبد الله بن زيد رجل من الأنصار وقال فيه فاستقبل القبلة قال الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة مرتين حى على الفلاح مرتين الله أكبر الله أكبر لا إله إلا الله ثم أمهل هنية ثم قام فقال مثلها إلا أنه قال زاد بعد ما قال ‏\"‏ حى على الفلاح ‏\"‏ ‏.‏ قد قامت الصلاة قد قامت الصلاة ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقنها بلالا ‏\"‏ ‏.‏ فأذن بها بلال وقال في الصوم قال فإن رسول الله صلى الله عليه وسلم كان يصوم ثلاثة أيام من كل شهر ويصوم يوم عاشوراء فأنزل الله تعالى ‏{‏ كتب عليكم الصيام كما كتب على الذين من قبلكم ‏}‏ إلى قوله ‏{‏ طعام مسكين ‏}‏ فكان من شاء أن يصوم صام ومن شاء أن يفطر ويطعم كل يوم مسكينا أجزأه ذلك وهذا حول فأنزل الله تعالى ‏{‏ شهر رمضان الذي أنزل فيه القرآن ‏}‏ إلى ‏{‏ أيام أخر ‏}‏ فثبت الصيام على من شهد الشهر وعلى المسافر أن يقضي وثبت الطعام للشيخ الكبير والعجوز اللذين لا يستطيعان الصوم وجاء صرمة وقد عمل يومه وساق الحديث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     Prayer passed through three stages and fasting also passed through three stages. The narrator Nasr reported the rest of the tradition completely. The narrator, Ibn al-Muthanna, narrated the story of saying prayer facing in the direction of Jerusalem.  He said: The third stage is that the Messenger of Allah (ﷺ) came to Medina and prayed, i.e. facing Jerusalem, for thirteen months.  Then Allah, the Exalted, revealed the verse: \"We have seen thee turning thy face to Heaven (for guidance, O Muhammad). And now verily We shall make thee turn (in prayer) toward a qiblah which is dear to thee. So turn thy face toward the Inviolable Place of Worship, and ye (O Muslims), wherever ye may be, turn your face (when ye pray) toward it\" (ii.144). And Allah, the Reverend and the Majestic, turned (them) towards the Ka'bah. He (the narrator) completed his tradition.  The narrator, Nasr, mentioned the name of the person who had the dream, saying: And Abdullah ibn Zayd, a man from the Ansar, came. The same version reads: And he turned his face towards the qiblah and said: Allah is most great, Allah is most great; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah; come to prayer (he pronounced it twice), come to salvation (he pronounced it twice); Allah is Most Great, Allah is most great. He then paused for a while, and then got up and pronounced in a similar way, except that after the phrase \"Come to salvation\" he added. \"The time for prayer has come, the time for prayer has come.\"  The Messenger of Allah (ﷺ) said: Teach it to Bilal, then pronounce the adhan (call to prayer) with the same words. As regards fasting, he said: The Messenger of Allah (ﷺ) used to fast for three days every month, and would fast on the tenth of Muharram. Then Allah, the Exalted, revealed the verse: \".......Fasting was prescribed for those before you, that ye may ward off (evil)......and for those who can afford it there is a ransom: the feeding of a man in need (ii.183-84). If someone wished to keep the fast, he would keep the fast; if someone wished to abandon the fast, he would feed an indigent every day; it would do for him. But this was changed. Allah, the Exalted, revealed: \"The month of Ramadan in which was revealed the Qur'an ..........(let him fast the same) number of other days\" (ii.185).  Hence the fast was prescribed for the one who was present in the month (of Ramadan) and the traveller was required to atone (for them); feeding (the indigent) was prescribed for the old man and woman who were unable to fast. (The narrator, Nasr, further reported): The companion Sirmah, came after finishing his day's work......and he narrated the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30002",
        "20472",
        "20724",
        "11381",
        "11196",
        "32"
      ]
    },
    {
      "id": "sunan-abi-daud-530",
      "hadith_no": "530",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن إهاب، حدثنا عبد الله بن الوليد العدني، حدثنا القاسم بن معن، حدثنا المسعودي، عن أبي كثير، مولى أم سلمة عن أم سلمة، قالت علمني رسول الله صلى الله عليه وسلم أن أقول عند أذان المغرب ‏\"‏ اللهم إن هذا إقبال ليلك وإدبار نهارك وأصوات دعاتك فاغفر لي ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) taught me to say when the adhan for the sunset prayer was called; \"O Allah, this is the time when Thy night comes on, Thy day retires, and the voices of Thy summoners are heard, so forgive me.\"",
      "usc_msa_ref": "",
      "chain": [
        "35156",
        "33014",
        "25240",
        "20724",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-550",
      "hadith_no": "550",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عباد الأزدي، حدثنا وكيع، عن المسعودي، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله بن مسعود، قال حافظوا على هؤلاء الصلوات الخمس حيث ينادى بهن فإنهن من سنن الهدى وإن الله شرع لنبيه صلى الله عليه وسلم سنن الهدى ولقد رأيتنا وما يتخلف عنها إلا منافق بين النفاق ولقد رأيتنا وإن الرجل ليهادى بين الرجلين حتى يقام في الصف وما منكم من أحد إلا وله مسجد في بيته ولو صليتم في بيوتكم وتركتم مساجدكم تركتم سنة نبيكم صلى الله عليه وسلم ولو تركتم سنة نبيكم صلى الله عليه وسلم لكفرتم ‏.‏",
      "text_en": " Abd Allah b. Mas’ud said:                      Persevere in observing these five times of prayer where the announcement for them is made, because they are from the paths of right guidance. And Allah, the Might, the Majestic, has laid down for his prophet (ﷺ) the paths of right guidance. I have seen the time when no one stayed away from prayer except a hypocrite whose hypocrite was well known. I witnessed the time when a man would be brought swaying between two men till he was set up in the row (of the prayer). Every one of us has a mosque of his in his house. If you were to pray in your houses and stay from your mosques. You would abandon the Sunnah (practice) of your prophet, and if you were Abandon the Sunnah (Practice) of your Prophet, you would become an unbeliever.",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20724",
        "11375",
        "20327",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-725",
      "hadith_no": "725",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يزيد، - يعني ابن زريع - حدثنا المسعودي، حدثني عبد الجبار بن وائل، حدثني أهل، بيتي عن أبي أنه، حدثهم أنه، رأى رسول الله صلى الله عليه وسلم يرفع يديه مع التكبيرة ‏.‏",
      "text_en": " Wa’il b.Hujr said:                      He saw that when the Prophet(ﷺ) stood up to pray he raised his hands till they were in front of his shoulders and placed his thumbs opposite his ears; then he uttered the Takbir (Allah is most great).",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "20724",
        "10940"
      ]
    },
    {
      "id": "sunan-abi-daud-1037",
      "hadith_no": "1037",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر الجشمي، حدثنا يزيد بن هارون، أخبرنا المسعودي، عن زياد بن علاقة، قال صلى بنا المغيرة بن شعبة فنهض في الركعتين قلنا سبحان الله قال سبحان الله ومضى فلما أتم صلاته وسلم سجد سجدتى السهو فلما انصرف قال رأيت رسول الله صلى الله عليه وسلم يصنع كما صنعت ‏.‏ قال أبو داود وكذلك رواه ابن أبي ليلى عن الشعبي عن المغيرة بن شعبة ورفعه ورواه أبو عميس عن ثابت بن عبيد قال صلى بنا المغيرة بن شعبة مثل حديث زياد بن علاقة ‏.‏ قال أبو داود أبو عميس أخو المسعودي وفعل سعد بن أبي وقاص مثل ما فعل المغيرة وعمران بن حصين والضحاك بن قيس ومعاوية بن أبي سفيان وابن عباس أفتى بذلك وعمر بن عبد العزيز ‏.‏ قال أبو داود هذا فيمن قام من ثنتين ثم سجدوا بعد ما سلموا ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     Ziyad ibn Ilaqah said: Al-Mughirah ibn Shu'bah led us in prayer and he stood up at the end of two rak'ahs. We said: Glory be to Allah; he also said: Glory be to Allah, and he proceeded. When he finished the prayer and gave the salutation, he made two prostrations of forgetfulness. When he turned (to us) he said: I saw the Messenger of Allah (ﷺ) doing so as I did.Abu Dawud said: Ibn Abi Laila narrated this tradition in a similar manner from al-Shaibi from al-Mughirah b. Shu'bah. Abu 'Umais narrated it from Thabit b. 'Ubaid saying: \"Al-Mughirah b. Shu'bah led us in prayer, like the tradition reported by Ziyad b. 'Illaqah.Abu Dawud said: Abu 'Umais is the brother of al-Mas'udi. And Sa'd b. Abi Waqqas did the same as done by al-Mughirah, 'Imran b. Husain, Dahhak b. Qais and Mu'awiyah b. Abi Sufyan. Ibn 'Abbas and 'Umar b. 'Abd al-'Aziz issued legel verdict to the same effect.Abu Dawud said: This applies to a person who stands up at the end of two rak'ahs and males prostration after giving the salutation.",
      "usc_msa_ref": "",
      "chain": [
        "20472",
        "20724",
        "11339"
      ]
    },
    {
      "id": "sunan-abi-daud-2734",
      "hadith_no": "2734",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، حدثنا عبد الله بن يزيد، حدثني المسعودي، حدثني أبو عمرة، عن أبيه، قال أتينا رسول الله صلى الله عليه وسلم أربعة نفر ومعنا فرس فأعطى كل إنسان منا سهما وأعطى للفرس سهمين ‏.‏",
      "text_en": " Narrated AbuUmrah (al-Ansari?):                     We four persons, came to the Messenger of Allah (ﷺ), and we (i.e. each one of us) had horses. He therefore, allotted one portion for each of us, and two portions for his horse.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20354",
        "1945",
        "20724"
      ]
    },
    {
      "id": "sunan-abi-daud-2735",
      "hadith_no": "2735",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، حدثنا أمية بن خالد، حدثنا المسعودي، عن رجل، من آل أبي عمرة عن أبي عمرة، بمعناه إلا أنه قال ثلاثة نفر ‏.‏ زاد فكان للفارس ثلاثة أسهم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu ‘Umrah through a different chain of narrators to the same effect. But this version has “Three Persons” and added “To the horseman three portions.”",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20530",
        "20724"
      ]
    },
    {
      "id": "sunan-abi-daud-3284",
      "hadith_no": "3284",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثنا يزيد بن هارون، قال أخبرني المسعودي، عن عون بن عبد الله، عن عبد الله بن عتبة، عن أبي هريرة، ‏:‏ أن رجلا، أتى النبي صلى الله عليه وسلم بجارية سوداء فقال ‏:‏ يا رسول الله إن على رقبة مؤمنة ‏.‏ فقال لها ‏:‏ ‏\"‏ أين الله ‏\"‏ ‏.‏ فأشارت إلى السماء بأصبعها ‏.‏ فقال لها ‏:‏ ‏\"‏ فمن أنا ‏\"‏ ‏.‏ فأشارت إلى النبي صلى الله عليه وسلم وإلى السماء، يعني أنت رسول الله ‏.‏ فقال ‏:‏ ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A man brought the Prophet (ﷺ) a black slave girl. He said: Messenger of Allah, emancipation of believing slave is due to me. He asked her: Where is Allah ? She pointed to the heaven with her finger. He then asked her: Who am I ? She pointed to the Prophet (ﷺ) and to the heaven, that is to say: You are the Messenger of Allah. He then said: Set her free, she is a believer.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20472",
        "20724",
        "10806",
        "4145"
      ]
    },
    {
      "id": "sunan-abi-daud-4278",
      "hadith_no": "4278",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا كثير بن هشام، حدثنا المسعودي، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمتي هذه أمة مرحومة ليس عليها عذاب في الآخرة عذابها في الدنيا الفتن والزلازل والقتل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa:                     The Prophet (ﷺ) said: This people of mine is one to which mercy is shown. It will have no punishment in the next world, but its punishment in this world will be trials, earthquakes and being killed.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20633",
        "20724",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-4357",
      "hadith_no": "4357",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا المسعودي، عن القاسم، بهذه القصة قال فلم ينزل حتى ضرب عنقه وما استتابه ‏.‏",
      "text_en": " The tradition mention above has also been transmitted by Abu Musa through a different chain if narrators. But there is no mention of demand of repentance.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20724"
      ]
    },
    {
      "id": "sunan-abi-daud-5087",
      "hadith_no": "5087",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا المسعودي، حدثنا القاسم، قال كان أبو ذر يقول من قال حين يصبح اللهم ما حلفت من حلف أو قلت من قول أو نذرت من نذر فمشيئتك بين يدى ذلك كله ما شئت كان وما لم تشأ لم يكن اللهم اغفر لي وتجاوز لي عنه اللهم فمن صليت عليه فعليه صلاتي ومن لعنت فعليه لعنتي كان في استثناء يومه ذلك أو قال ذلك اليوم ‏.‏",
      "text_en": " Narrated AbuDharr:                     If anyone says in the morning: \"O Allah! whatever oath I take, whatever word I speak, and whatever vow I take, Thine will precedes all that: whatever Thou willeth, occurs, and whatever Thou dost not will, dost not occur. O Allah! pardon me and disregard me for it. O Allah! whomsoever Thou sendest thine blessing, to him my blessing is due, and whomsoever thou cursest, to him my curse is due, \" exemption from it will be granted to him that day.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20724",
        "10535",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-365",
      "hadith_no": "365",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يزيد بن هارون، عن المسعودي، عن زياد بن علاقة، قال صلى بنا المغيرة بن شعبة فلما صلى ركعتين قام ولم يجلس فسبح به من خلفه فأشار إليهم أن قوموا فلما فرغ من صلاته سلم وسجد سجدتى السهو وسلم وقال هكذا صنع رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث من غير وجه عن المغيرة بن شعبة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ziyad bin Haqah narrated:                     \"Al-Mughirah bin Shu'bah les us in Salat. When he prayed two Rak'ah he stood without sitting. Those who were behind him said 'Subhan Allah' and he indicated to them that they should stand. He said the Taslim when he had finished his Salat and he performed two prostrations of As-Sahw, and said the Taslim. He said that Allah's Messenger did this.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20472",
        "20724",
        "11339"
      ]
    },
    {
      "id": "jami-al-tirmidhi-893",
      "hadith_no": "893",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن المسعودي، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم قدم ضعفة أهله وقال ‏\"‏ لا ترموا الجمرة حتى تطلع الشمس ‏\"‏ ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أهل العلم لم يروا بأسا أن يتقدم الضعفة من المزدلفة بليل يصيرون إلى منى ‏.‏ وقال أكثر أهل العلم بحديث النبي صلى الله عليه وسلم أنهم لا يرمون حتى تطلع الشمس ‏.‏ ورخص بعض أهل العلم في أن يرموا بليل ‏.‏ والعمل على حديث النبي صلى الله عليه وسلم أنهم لا يرمون ‏.‏ وهو قول الثوري والشافعي ‏.‏ ‏.‏ قال أبو عيسى حديث ابن عباس بعثني رسول الله صلى الله عليه وسلم في ثقل حديث صحيح روي عنه من غير وجه ‏.‏ وروى شعبة هذا الحديث عن مشاش عن عطاء عن ابن عباس عن الفضل بن عباس أن النبي صلى الله عليه وسلم قدم ضعفة أهله من جمع بليل ‏.‏ وهذا حديث خطأ أخطأ فيه مشاش وزاد فيه عن الفضل بن عباس ‏.‏ وروى ابن جريج وغيره هذا الحديث عن عطاء عن ابن عباس ‏.‏ ولم يذكروا فيه عن الفضل بن عباس ‏.‏ ومشاش بصري روى عنه شعبة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet advanced the weak among his family and he said: 'Do not stone the Jamrah until the sun has risen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20724",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-901",
      "hadith_no": "901",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا المسعودي، عن جامع بن شداد أبي صخرة، عن عبد الرحمن بن يزيد، قال لما أتى عبد الله جمرة العقبة استبطن الوادي واستقبل القبلة وجعل يرمي الجمرة على حاجبه الأيمن ثم رمى بسبع حصيات يكبر مع كل حصاة ثم قال والله الذي لا إله إلا هو من ها هنا رمى الذي أنزلت عليه سورة البقرة ‏.‏ حدثنا هناد، حدثنا وكيع، عن المسعودي، بهذا الإسناد نحوه ‏.‏ قال وفي الباب عن الفضل بن عباس وابن عباس وابن عمر وجابر ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم يختارون أن يرمي الرجل من بطن الوادي بسبع حصيات يكبر مع كل حصاة ‏.‏ وقد رخص بعض أهل العلم إن لم يمكنه أن يرمي من بطن الوادي رمى من حيث قدر عليه وإن لم يكن في بطن الوادي ‏.‏",
      "text_en": " Abdur-Rahman bin Yazid narrated:                     \"When Abdullah went to stone Jamrat Al-Aqabah, he went to the middle of the valley, faced the Ka'bah, and proceeded to stone the Jamrah at its southern wall. Then he stoned with seven pebbles, saying: \"Allahu Akbar\" with each pebble. Then he said: 'By Allah except Whom none is worthy of worship. This is where the one stoned to whom Surat Al-Baqarah was revealed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20032",
        "20724",
        "11328",
        "11055"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1001",
      "hadith_no": "1001",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، والمسعودي، عن علقمة بن مرثد، عن أبي الربيع، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع في أمتي من أمر الجاهلية لن يدعهن الناس النياحة والطعن في الأحساب والعدوى أجرب بعير فأجرب مائة بعير من أجرب البعير الأول والأنواء مطرنا بنوء كذا وكذا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"There are four matters in my nation that are from the matters of Jahiliyyah which the people will not leave: Wailing, slandering one's lineage, Al-Adwa - a camel gets mange, so one hundred camels get mange - but who gave the first camel mange? And Al-Anwa (saying): \"We got rain because of this or that celestial positioning.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "30002",
        "20020",
        "20724",
        "11374",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2019",
      "hadith_no": "2019",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن المسعودي، عن الوليد بن العيزار، عن أبي عمرو الشيباني، عن ابن مسعود، قال سألت رسول الله صلى الله عليه وسلم فقلت يا رسول الله أى الأعمال أفضل قال ‏\"‏ الصلاة لميقاتها ‏\"‏ ‏.‏ قلت ثم ماذا يا رسول الله قال ‏\"‏ بر الوالدين ‏\"‏ ‏.‏ قلت ثم ماذا يا رسول الله قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏ ثم سكت عني رسول الله صلى الله عليه وسلم ولو استزدته لزادني ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ رواه الشيباني وشعبة وغير واحد عن الوليد بن العيزار وقد روي هذا الحديث من غير وجه عن أبي عمرو الشيباني عن ابن مسعود ‏.‏ وأبو عمرو الشيباني اسمه سعد بن إياس ‏.‏",
      "text_en": " Ibn Mas'ud said:                     \"I asked the Messenger of Allah: 'O Messenger of Allah! Which is the most virtuous of deeds?' He said: 'Salat during its appropriate time.'I said: 'Then what, O Messenger of Allah?' He said: 'Being dutiful to ones parents.' I said: 'Then what, O Messenger of Allah?' He said: 'Jihad in the cause of Allah.'Then the messenger of Allah was silent,  and if I had asked him more, he would have tol me more.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "20724",
        "11663",
        "11343",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2377",
      "hadith_no": "2377",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي، حدثنا زيد بن حباب، أخبرني المسعودي، حدثنا عمرو بن مرة، عن إبراهيم، عن علقمة، عن عبد الله، قال نام رسول الله صلى الله عليه وسلم على حصير فقام وقد أثر في جنبه فقلنا يا رسول الله لو اتخذنا لك وطاء ‏.‏ فقال ‏\"‏ ما لي وما للدنيا ما أنا في الدنيا إلا كراكب استظل تحت شجرة ثم راح وتركها ‏\"‏ ‏.‏ قال وفي الباب عن عمر وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah narrated :                     \"The Messenger of Allah (s.a.w) was sleeping upon a mat, then he stood, and the mat had left marks on his side. We said: 'O Messenger of Allah! We said: 'O Messenger of Allah! We could get a bed for you.' He said: 'What do I have to do with the world! I am not in the world but as a rider seeking shade under a tree, then he catches his breath and leaves it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20724",
        "11381",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2739",
      "hadith_no": "2739",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا عاصم بن علي، حدثنا المسعودي، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، سأل النبي صلى الله عليه وسلم فقال يا رسول الله هل في الجنة من خيل قال ‏\"‏ إن الله أدخلك الجنة فلا تشاء أن تحمل فيها على فرس من ياقوتة حمراء يطير بك في الجنة حيث شئت إلا فعلت ‏\"‏ ‏.‏ قال وسأله رجل فقال يا رسول الله هل في الجنة من إبل قال فلم يقل له مثل ما قال لصاحبه قال ‏\"‏ إن يدخلك الله الجنة يكن لك فيها ما اشتهت نفسك ولذت عينك ‏\"‏ ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that a man asked the Prophet (s.a.w):                     \"O Messenger of Allah, are there horses in Paradise?\" He said,  \"If Allah admits you into Paradise, you will not wish to be carried, on a horse of rubies that will fly with you wherever you want in Paradise except that you will do so.\" He said: \"And a man asked him: 'O Messenger of Allah, are there camels in Paradise?\"\" He said: \"So he (s.a.w) did not say what he said to his companion, rather, he said: 'If Allah admits you into Paradise, you will have in it whatever is desired by your soul and pleasing to you eye.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20430",
        "20724",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2675-2",
      "hadith_no": "2675",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا المسعودي، عن عبد الملك بن عمير، عن ابن جرير بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سن سنة خير فاتبع عليها فله أجره ومثل أجور من اتبعه غير منقوص من أجورهم شيئا ومن سن سنة شر فاتبع عليها كان عليه وزره ومثل أوزار من اتبعه غير منقوص من أوزارهم شيئا ‏\"‏ ‏.‏ وفي الباب عن حذيفة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن جرير بن عبد الله عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ وقد روي هذا الحديث عن المنذر بن جرير بن عبد الله عن أبيه عن النبي صلى الله عليه وسلم ‏.‏ وقد روي عن عبيد الله بن جرير عن أبيه عن النبي صلى الله عليه وسلم أيضا ‏.‏",
      "text_en": " Narrated Ibn Jarir bin 'Abdullah:                     from his father that the Messenger of Allah (ﷺ) said: \"Whoever starts a good tradition which is followed, then for him is a reward, and the likes of their rewards of whoever follows him, there being nothing diminished from their rewards. And whoever starts a bad tradition which is followed, then for him is the sin, and the likes of the sins of whoever follows him, there being nothing diminished from their sins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "20724",
        "11368"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3997",
      "hadith_no": "3997",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا أبو نعيم، حدثنا المسعودي، عن عثمان بن مسلم بن هرمز، عن نافع بن جبير بن مطعم، عن علي، قال لم يكن رسول الله صلى الله عليه وسلم بالطويل ولا بالقصير شثن الكفين والقدمين ضخم الرأس ضخم الكراديس طويل المسربة إذا مشى تكفأ تكفؤا كأنما انحط من صبب لم أر قبله ولا بعده مثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Ali:                     \"The Prophet (ﷺ) was not tall nor was he short, his hands and feet were thick, his head was large, he was big-boned, he had a long Masrubah (the line of hair from the chest to the navel), and whenever he walked, he leaned forward as if he was going down a decline. I have not seen anyone before him nor after him that resembled him (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20348",
        "20724",
        "11059",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3998",
      "hadith_no": "3998",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن المسعودي، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20724"
      ]
    },
    {
      "id": "sunan-an-nasai-849",
      "hadith_no": "849",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن المسعودي، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله، أنه كان يقول من سره أن يلقى الله عز وجل غدا مسلما فليحافظ على هؤلاء الصلوات الخمس حيث ينادى بهن فإن الله عز وجل شرع لنبيه صلى الله عليه وسلم سنن الهدى وإنهن من سنن الهدى وإني لا أحسب منكم أحدا إلا له مسجد يصلي فيه في بيته فلو صليتم في بيوتكم وتركتم مساجدكم لتركتم سنة نبيكم ولو تركتم سنة نبيكم لضللتم وما من عبد مسلم يتوضأ فيحسن الوضوء ثم يمشي إلى صلاة إلا كتب الله عز وجل له بكل خطوة يخطوها حسنة أو يرفع له بها درجة أو يكفر عنه بها خطيئة ولقد رأيتنا نقارب بين الخطا ولقد رأيتنا وما يتخلف عنها إلا منافق معلوم نفاقه ولقد رأيت الرجل يهادى بين الرجلين حتى يقام في الصف ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"Whoever would like to meet Allah tomorrow as a Muslim, let  him regularly attend these five (daily) prayers  whenever the call for them is given (that in the mosques), for Allah prescribed forHis Prophet the ways of guidance, and they (the prayers) are part of those ways of guidance. I do not think that there is anyone among you who does not have a place where he prays in his house. But if you were to pray in your houses and forsake the Masjids, you would be forsaking the Sunnah of your Prophet, and if you were to forsake the Sunnah of yourProphet you would go astray. There is no Muslim slave who performs Wudu and does it well, then walks to the prayer, but Allah will record one Hasanah (gooddeed) for each step he takes, or raise' him one level by it or erase one sin from him. I remember how we used to take short steps, and I remember (a time) when no one stayed behind from the prayer excepta hypocrite whose hypocrisy was well known. And I have seen a man coming Supported by two others until he would be made to stand in the row.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20724",
        "11375",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-951",
      "hadith_no": "951",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن أبان البلخي، قال حدثنا وكيع بن الجراح، عن مسعر، والمسعودي، عن الوليد بن سريع، عن عمرو بن حريث، قال سمعت النبي صلى الله عليه وسلم يقرأ في الفجر ‏{‏ إذا الشمس كورت ‏}‏ ‏.‏",
      "text_en": " It was narrated that Amr bin Huraith said:                     \"I heard the Prophet (ﷺ) reciting: 'When the sun is wound round.' in fajr. \"",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20032",
        "20359",
        "20724",
        "10837",
        "5202"
      ]
    },
    {
      "id": "sunan-an-nasai-1505",
      "hadith_no": "1505",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرني محمد بن منصور، قال حدثنا سفيان، قال حدثنا المسعودي، عن أبي بكر بن عمرو بن حزم، عن عباد بن تميم، - قال سفيان فسألت عبد الله بن أبي بكر فقال سمعته من، عباد بن تميم يحدث أبي - أن عبد الله بن زيد الذي، أري النداء قال إن رسول الله صلى الله عليه وسلم خرج إلى المصلى يستسقي فاستقبل القبلة وقلب رداءه وصلى ركعتين ‏.‏ قال أبو عبد الرحمن هذا غلط من ابن عيينة وعبد الله بن زيد الذي أري النداء هو عبد الله بن زيد بن عبد ربه وهذا عبد الله بن زيد بن عاصم ‏.‏",
      "text_en": " It was narrated from 'Abbad bin Tamim:                     \"Sufyan said: 'I asked 'Abdullah bin Abi Bakr who said: I heard it from Abbad bin Tamim who narrated it from his father, that 'Abdullah bin Zaid, who was shown the call to prayer (in a dream) said: 'The Messenger of Allah (ﷺ) went out to the prayer place to pray for rain. He faced the kiblah and turned his cloak around and prayed two rak'ahs.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "20724",
        "11239",
        "639",
        "606"
      ]
    },
    {
      "id": "sunan-an-nasai-3108",
      "hadith_no": "3108",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هناد بن السري، عن ابن المبارك، عن المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يلج النار رجل بكى من خشية الله تعالى حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان نار جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"No man will enter the Fire who weeps for fear of Allah, Most High, until the milk goes back into the udders. And the dust (of Jihad) in the cause of Allah, and the smoke of Hell will never be combined.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "20724",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-201",
      "hadith_no": "201",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا المسعودي، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه حجابه النور لو كشفها لأحرقت سبحات وجهه كل شىء أدركه بصره ‏\"‏ ‏.‏ ثم قرأ أبو عبيدة ‏{أن بورك من في النار ومن حولها وسبحان الله رب العالمين}‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah said: 'Allah does not sleep, and it is not befitting that He should sleep. He lowers the Scales and raises them. His Veil is Light, and if He were to remove it, the glory of his Face would burn everything of His creation, as far as His gaze reaches.' \" Then Abu 'Ubaidah recited the verse: 'Blessed is whosoever is in the fire, (i.e. the light of Allah) and whosoever is round about it! And Glorified is Allah, the Lord of all that exists.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20724",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-877",
      "hadith_no": "877",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو داود الطيالسي، حدثنا المسعودي، حدثنا زيد العمي، عن أبي نضرة، عن أبي سعيد الخدري، قال اجتمع ثلاثون بدريا من أصحاب رسول الله  صلى الله عليه وسلم  فقالوا تعالوا حتى نقيس قراءة رسول الله  صلى الله عليه وسلم  فيما لم يجهر فيه من الصلاة ‏.‏ فما اختلف منهم رجلان فقاسوا قراءته في الركعة الأولى من الظهر بقدر ثلاثين آية وفي الركعة الأخرى قدر النصف من ذلك وقاسوا ذلك في صلاة العصر على قدر النصف من الركعتين الأخريين من الظهر ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “Thirty of theCompanions of the Messenger of Allah (ﷺ) who had been at Badr cametogether and said: ‘Come, let us estimate the length of therecitationof the Messenger of Allah (ﷺ) for the prayer in whichQur’an is notrecited out aloud.’ No two men among themdisagreed, and theyestimated the length of his recitation in thefirst Rak’ah of the Zuhrto be thirty Verses and in the secondRak’ah to be half of that. Theyestimated his recitation in ‘Asrto be half of the last two Rak’ah ofZuhr.”",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20547",
        "20724",
        "14135",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-959",
      "hadith_no": "959",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الحسين بن بيان، حدثنا زياد بن عبد الله، حدثنا المسعودي، عن عون بن عبد الله، عن أبي فاختة، عن الأسود بن يزيد، عن عبد الله بن مسعود، قال إذا صليتم على رسول الله  صلى الله عليه وسلم  فأحسنوا الصلاة عليه فإنكم لا تدرون لعل ذلك يعرض عليه ‏.‏ قال فقالوا له فعلمنا ‏.‏ قال قولوا اللهم اجعل صلاتك ورحمتك وبركاتك على سيد المرسلين وإمام المتقين وخاتم النبيين محمد عبدك ورسولك إمام الخير وقائد الخير ورسول الرحمة اللهم ابعثه مقاما محمودا يغبطه به الأولون والآخرون اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد ‏.‏",
      "text_en": " Aswad binYazid narrated that ‘Abdullah bin Mas’ud said:                      “When yousendpeace and blessings upon the Messenger of Allah (ﷺ), then do itwell, for you do not know, that may be shown to him.” They said tohim: “Teach us.” He said: “Say: ‘Allahumma aj’al salatakawa rahmatakawa barakatika ‘ala sayyidil-mursalin waimamil-muttaqin wa khatamin-nabiyyin, Muhammad ‘abdika wa Rasulikaimamil-khayri (wa qa’idil-khair), wa Rasulir-Rahmah.Allahummab’athhu maqaman mahmudanyaghbituhu bihil-awwalunawal-akhirun. Allahumma salli ‘ala Muhammadinwa ‘ala aliMuhammadin kama sallayta ‘ala Ibrahim wa ‘ala ali Ibrahim;Allahumma barik ‘ala Muhammadin wa ‘ala ali Muhammadin kamabarakta‘ala Muhammadin kama barakta ‘ala Ibrahim wa ‘ala aliIbrahim, innakaHamidum Majid (O Allah, send Your grace, honour,mercy and blessingsupon the leader of the Messengers, the imam ofthe pious and the sealof the Prophets, Muhammad, Your slave andMessenger, the Imam of thegood (and the leader) of the good, and theMessenger of mercy. OAllah, raise him to a station of praise andglory that will be theenvy of the first and the last. O Allah, sendYour grace, honour andmercy upon Muhammad and upon the family ofMuhammad, as You sent Yourgrace, honour and mercy upon Ibrahim, Youare indeed Praiseworthy,Most Glorious. O Allah, send blessings uponMuhammad and upon thefamily of Muhammad as You sent blessings uponIbrahim and the familyof Ibrahim, You are Praiseworthy, MostGlorious).’”",
      "usc_msa_ref": "",
      "chain": [
        "20724",
        "10806",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2211",
      "hadith_no": "2211",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى، وعبد الله بن إسحاق الجوهري، قالا حدثنا عبد الله بن رجاء، أنبأنا المسعودي، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن رجلا، جاء إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله إني نذرت أن أنحر ببوانة فقال ‏\"‏ في نفسك شىء من أمر الجاهلية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أوف بنذرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that a man came to the Prophet (ﷺ) and said:                     \"O Messenger of Allah, I vowed to offer a sacrifice at Buwanah.\" He said: \"Do you intend any action of Ignorance period?\" He said: \"No.\" He said: \"Then fulfill your vow.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30580",
        "20245",
        "20724",
        "11331",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2292",
      "hadith_no": "2292",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن المسعودي، عن علي بن مدرك، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقلت من هم يا رسول الله فقد خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنان عطاءه والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet (ﷺ) said:                     \"There are three to whom Allah will not speak on the Day of Resurrection nor will He look at them or purify them, and theirs will be a painful torment.\" I said: \"Who are they, O Messenger of Allah? For they are indeed losers.\" He said: \"The one who lets his garment hang beneath his ankles, the one who reminds another of what he has given him, and the one who sells his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20724",
        "11377",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2326",
      "hadith_no": "2326",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا وكيع، حدثنا المسعودي، عن جابر، عن أبي الضحى، عن مسروق، عن عبد الله بن مسعود، أنه قال أشهد على الصادق المصدوق أبي القاسم  صلى الله عليه وسلم  أنه حدثنا قال ‏\"‏ بيع المحفلات خلابة ولا تحل الخلابة لمسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"I bear witness that the true and truly inspired one Abul-Qasim (ﷺ) told us: 'Selling a Muhaffalah is Khilabah, and Khilabah is not lawful for the Muslim.\"' (Ibn Majah said: \" Meaning: 'Deception.\")",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20032",
        "20724",
        "34",
        "11392",
        "11018",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-3145",
      "hadith_no": "3145",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن المسعودي، عن جامع بن شداد، عن عبد الرحمن بن يزيد، قال لما أتى عبد الله بن مسعود جمرة العقبة استبطن الوادي واستقبل الكعبة وجعل الجمرة على حاجبه الأيمن ثم رمى بسبع حصيات يكبر مع كل حصاة ثم قال من هاهنا والذي لا إله غيره رمى الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Yazid said:                      “When ‘AbdullahbinMas’ud stoned ‘Aqabah Pillar, he went to the bottom of the valleyand turned to face the Ka’bah, with the Pillar on his right handside.Then he threw seven pebbles, saying the Takbir with each one.Then hesaid: ‘From here, by the One besides Whom there is noneworthy ofworship, did the one throw, to whom Surat Al-Baqarah wasrevealed.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20724",
        "11328",
        "11055"
      ]
    },
    {
      "id": "sunan-ibn-majah-3372",
      "hadith_no": "3372",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا الأنصاري، حدثنا المسعودي، حدثنا عبد الرحمن بن القاسم بن محمد بن أبي بكر الصديق، عن أبيه، عن عائشة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الحية فاسقة والعقرب فاسقة والفأرة فاسقة والغراب فاسق ‏\"‏ ‏.‏ فقيل للقاسم أيؤكل الغراب قال من يأكله بعد قول رسول الله  صلى الله عليه وسلم  ‏\"‏ فاسق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ) said:                     “Snakes are vermin, scorpions are vermin, mice are vermin and crowsare vermin.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20280",
        "20724",
        "53"
      ]
    }
  ],
  "total_hadiths": 33
}