{
  "id": "20728",
  "name": "Abu Khalid al-Dalani أبو خالد الدالاني الأسدي",
  "full_name": "Abu Khalid al-Dalani أبو خالد الدالاني الأسدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ 4  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Asadi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11619",
      "name": "Ibrahim bin 'Abdur Rahman al-Saksaki إبراهيم بن عبد الرحمن السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22152",
      "name": "'Umar bin Ishaq bin 'Abdullah عمر بن إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12571",
      "name": "Yahya bin Ishaq bin 'Abdullah يحيى بن إسحاق بن عبد الله",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11386",
      "name": "Qays bin Muslim al-Jadli قيس بن مسلم الجدلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20328",
      "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "35075",
      "name": "'Ubaid bin Muhammad al-Mharby عبيد بن محمد المحاربي مولاهم الكوفي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، وهناد بن السري، وعثمان بن أبي شيبة، عن عبد السلام بن حرب، - وهذا لفظ حديث يحيى - عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يسجد وينام وينفخ ثم يقوم فيصلي ولا يتوضأ ‏.‏ قال فقلت له صليت ولم تتوضأ وقد نمت فقال ‏\"‏ إنما الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ زاد عثمان وهناد ‏\"‏ فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو داود قوله ‏\"‏ الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ هو حديث منكر لم يروه إلا يزيد أبو خالد الدالاني عن قتادة وروى أوله جماعة عن ابن عباس ولم يذكروا شيئا من هذا وقال كان النبي صلى الله عليه وسلم محفوظا وقالت عائشة - رضى الله عنها - قال النبي صلى الله عليه وسلم ‏\"‏ تنام عيناى ولا ينام قلبي ‏\"‏ ‏.‏ وقال شعبة إنما سمع قتادة من أبي العالية أربعة أحاديث حديث يونس بن متى وحديث ابن عمر في الصلاة وحديث القضاة ثلاثة وحديث ابن عباس حدثني رجال مرضيون منهم عمر وأرضاهم عندي عمر ‏.‏ قال أبو داود وذكرت حديث يزيد الدالاني لأحمد بن حنبل فانتهرني استعظاما له وقال ما ليزيد الدالاني يدخل على أصحاب قتادة ولم يعبأ بالحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) used to prostrate and sleep (in prostration) and produce puffing sounds (during sleep). Then he would stand and pray and would not perform ablution. I said to him: you prayed but did not perform ablution though you slept (in prostration). He replied: Ablution is necessary for one who sleeps while he is lying down. Uthman and Hannad added: For when he lies down, his joints are relaxed.Abu Dawud said: The statement \"ablution is necessary for one who sleeps while one is lying down\" is a munkar (rejected) tradition. It has been narrated only by Yazid Abu Khalid al-Dalani, on the authority of Qatadah. And its earlier part has been narrated by a group (of narrators) from Ibn 'Abbas; they did not mention anything about it. He (Ibn 'Abbas) said: The Prophet (ﷺ) was protected (during his sleep). 'Aishah reported: The Prophet (ﷺ) said: My eyes sleep, but my heart does not sleep. Shu'bah said: Qatadah heard from Abu'l-'Aliyah only four traditions: the tradition about Jonah son of Matthew, the tradition reported by Ibn 'Umar about prayer, the tradition stating that the judges are three, and the tradition narrated by Ibn 'Abbas saying: (This tradition) has been narrated to me by reliable persons ; 'Umar is one of them, and the most reliable of them in my opinion is 'Umar. Abu Dawud said: I asked Ahmad b. Hanbal about the tradition narrated by Yazid al-Dalani. He rebuked me out of respect for him. Then he said: Yazid al-Dalani does not add anything to what has been narrated by the teachers of Qatadah. He did not care of this tradition (due to its weakness).",
      "chain": [
        "30020",
        "30480",
        "30203",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "832",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع بن الجراح، حدثنا سفيان الثوري، عن أبي خالد الدالاني، عن إبراهيم السكسكي، عن عبد الله بن أبي أوفى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني لا أستطيع أن آخذ من القرآن شيئا فعلمني ما يجزئني منه ‏.‏ قال ‏\"‏ قل سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال يا رسول الله هذا لله عز وجل فما لي قال ‏\"‏ قل اللهم ارحمني وارزقني وعافني واهدني ‏\"‏ ‏.‏ فلما قام قال هكذا بيده فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما هذا فقد ملأ يده من الخير ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn AbuAwfa:                     A man came to the Prophet (ﷺ) and said: I cannot memorise anything from the Qur'an: so teach me something which is sufficient for me. He said: Say Glory be to Allah, and praise be to Allah, and there is no god but Allah, and Allah is most great, and there is no might and no strength but in Allah.  :He said: Messenger of Allah, this is for Allah, but what is for me? He said: Say: O Allah have mercy on me, and sustain me, and keep me well, and guide me. When he stood up, he made a sign with his hand (indicating that he had earned a lot). The Messenger of Allah (ﷺ) said: He filed up his hand with virtues.",
      "chain": [
        "30203",
        "20032",
        "20012",
        "20728",
        "5115"
      ]
    },
    {
      "hadith_no": "1354",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن حصين، نحوه قال ‏:‏ ‏\"‏ وأعظم لي نورا ‏\"‏ ‏.‏ قال أبو داود ‏:‏ وكذلك قال أبو خالد الدالاني عن حبيب في هذا، وكذلك قال في هذا الحديث وقال سلمة بن كهيل عن أبي رشدين عن ابن عباس ‏.‏",
      "text_en": " The above tradition has also been transmitted by Husain through a different chain of narrators in like manner. This version has the words:                      \"And give me abundant light.\"Abu Dawud said: This tradition has been transmitted by Abu Khalid al-Dalani from Habib and Salamah b. Kuhail from Abu Rishdin from Ibn 'Abbas in a similar manner.",
      "chain": [
        "30569",
        "20423",
        "15097",
        "20728",
        "11350"
      ]
    },
    {
      "hadith_no": "3756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد بن السري، عن عبد السلام بن حرب، عن أبي خالد الدالاني، عن أبي العلاء الأودي، عن حميد بن عبد الرحمن الحميري، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا اجتمع الداعيان فأجب أقربهما بابا فإن أقربهما بابا أقربهما جوارا وإن سبق أحدهما فأجب الذي سبق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman al-Himyari:                     A companion of the Prophet (ﷺ) reported him as saying: When two people come together to issue an invitation, accept that of the one whose door is nearer in neighbourhood, but if one of them comes before the other accept the invitation of the one who comes first.",
      "chain": [
        "30480",
        "20248",
        "20728",
        "11280"
      ]
    },
    {
      "hadith_no": "4652",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هناد بن السري، عن عبد الرحمن بن محمد المحاربي، عن عبد السلام بن حرب، عن أبي خالد الدالاني، عن أبي خالد، مولى آل جعدة عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني جبريل فأخذ بيدي فأراني باب الجنة الذي تدخل منه أمتي ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله وددت أني كنت معك حتى أنظر إليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنك يا أبا بكر أول من يدخل الجنة من أمتي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Gabriel came and taking me by the hand showed the gate of Paradise by which my people will enter. AbuBakr then said: Messenger of Allah! I wish I had been with you so that I might have looked at it. The Messenger of Allah (ﷺ) then said: You, AbuBakr, will be the first of my people to enter Paradise.",
      "chain": [
        "30480",
        "20333",
        "20248",
        "20728",
        "13"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن موسى، - كوفي - وهناد ومحمد بن عبيد المحاربي المعنى واحد قالوا حدثنا عبد السلام بن حرب الملائي، عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أنه رأى النبي صلى الله عليه وسلم نام وهو ساجد حتى غط أو نفخ ثم قام يصلي ‏.‏ فقلت يا رسول الله إنك قد نمت قال ‏\"‏ إن الوضوء لا يجب إلا على من نام مضطجعا فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو عيسى وأبو خالد اسمه يزيد بن عبد الرحمن ‏.‏ قال وفي الباب عن عائشة وابن مسعود وأبي هريرة ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     he saw the Prophet sleeping, while in the prostration position, until he snored or snorted. Then he stoodup to pray. So I said: \"O Messenger of Allah! You were sleeping?\" He said: \"Wudu is not required except for sleeping while reclining. For when one reclines, joints relax.\"",
      "chain": [
        "35016",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    }
  ],
  "total_hadiths": 6
}