{
  "id": "20722",
  "name": "Sa'd bin Aws al-Bsy سعد بن أوس العبسي",
  "full_name": "Sa'd bin Aws al-Bsy سعد بن أوس العبسي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Absi",
      "al-Azdi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19863",
      "name": "Bilal bin Yahya al-Bsy بلال بن يحيى العبسي الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25197",
      "name": "'Ali bin Gharab علي بن غراب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1551",
      "hadith_no": "1551",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا محمد بن عبد الله بن الزبير، ح وحدثنا أحمد، حدثنا وكيع، - المعنى - عن سعد بن أوس، عن بلال العبسي، عن شتير بن شكل، عن أبيه، في حديث أبي أحمد شكل بن حميد - قال - قلت يا رسول الله علمني دعاء قال ‏\"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏",
      "text_en": " Narrated Shakl ibn Humayd:                     I said: Messenger of Allah, teach me a supplication. He said: Say: \"O Allah, I seek refuge in Thee from the evil of what I hear, from the evil of what I see, from the evil of what I speak, from the evil of what I think, and from the evil of my semen\" (i.e. sexual passion).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30007",
        "20722",
        "10773"
      ]
    },
    {
      "id": "sunan-abi-daud-1715",
      "hadith_no": "1715",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا الهيثم بن خالد الجهني، حدثنا وكيع، عن سعد بن أوس، عن بلال بن يحيى العبسي، عن علي، رضى الله عنه أنه التقط دينارا فاشترى به دقيقا فعرفه صاحب الدقيق فرد عليه الدينار فأخذه علي وقطع منه قيراطين فاشترى به لحما ‏.‏",
      "text_en": " Narrated Ali ibn Abu Talib:                     Bilal ibn Yahya al-Absi said: Ali found a dinar and purchased some flour with it. The seller of the flour recognised him and returned the dinar to him. Ali took it, deducted two qirat (carat) from it, and purchased meat with it.",
      "usc_msa_ref": "",
      "chain": [
        "35162",
        "20032",
        "20722",
        "19863",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-2386",
      "hadith_no": "2386",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا محمد بن دينار، حدثنا سعد بن أوس العبدي، عن مصدع أبي يحيى، عن عائشة، أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم ويمص لسانها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) used to kiss her and suck her tongue when he was fasting.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "24396",
        "20722",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3986",
      "hadith_no": "3986",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن مسعود المصيصي، حدثنا عبد الصمد بن عبد الوارث، حدثنا محمد بن دينار، حدثنا سعد بن أوس، عن مصدع أبي يحيى، قال سمعت ابن عباس، يقول أقرأني أبى بن كعب كما أقرأه رسول الله صلى الله عليه وسلم ‏{‏ في عين حمئة ‏}‏ مخففة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ubayy ibn Ka'b made me read the following verse as the Messenger of Allah (ﷺ) made him read: \"in a spring of murky water\" (fi 'aynin hami'atin) with short vowel a after h.",
      "usc_msa_ref": "",
      "chain": [
        "20250",
        "24396",
        "20722",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2224-2",
      "hadith_no": "2224",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا بندار، حدثنا أبو داود، حدثنا حميد بن مهران، عن سعد بن أوس، عن زياد بن كسيب العدوي، قال كنت مع أبي بكرة تحت منبر ابن عامر وهو يخطب وعليه ثياب رقاق فقال أبو بلال انظروا إلى أميرنا يلبس ثياب الفساق ‏.‏ فقال أبو بكرة اسكت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أهان سلطان الله في الأرض أهانه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Ziyad bin Kusaib Al-'Adawi said:                     \"I was with Abu Bakrah under the Minbar of Ibn 'Amir while he was giving a Khutbah wearing a fine garment. Abu Bilal said: 'Look at our Amir wearing clothes of wickedness!' So Abu Bakrah said: Be quiet! I heard the Messenger of Allah(s.a.w) saying: \"Whoever insults Allah's Sultan on the earth, Allah disgraces him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20547",
        "20722",
        "14133"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3185",
      "hadith_no": "3185",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا معلى بن منصور، حدثنا محمد بن دينار، عن سعد بن أوس، عن مصدع أبي يحيى، عن ابن عباس، عن أبى بن كعب، أن النبي صلى الله عليه وسلم قرأ ‏(‏في عين حمئة ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه والصحيح ما روي عن ابن عباس قراءته ‏.‏ ويروى أن ابن عباس وعمرو بن العاصي اختلفا في قراءة هذه الآية وارتفعا إلى كعب الأحبار في ذلك فلو كانت عنده رواية عن النبي صلى الله عليه وسلم لاستغنى بروايته ولم يحتج إلى كعب ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     from Ubay bin Ka'b that the Prophet (ﷺ) recited: \"Fi 'Ainin Hami'ah\" (18:86)",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30278",
        "24396",
        "20722",
        "17",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3492-2",
      "hadith_no": "3492",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا سعد بن أوس، عن بلال بن يحيى العبسي، عن شتير بن شكل، عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله علمني تعوذا أتعوذ به ‏.‏ قال فأخذ بكتفي فقال ‏\"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏ يعني فرجه ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث سعد بن أوس عن بلال بن يحيى ‏.‏",
      "text_en": " Shakal bin Humaid said:                      \"I came to the Prophetand said: 'O Messenger of Allah, teach me away of seeking refuge so that I may seek refuge by it.\" He said: \"So he took my hand and said: 'Say: O Allah, indeed I seek refuge in Youfrom the evil of my hearing and the evil of my sight, and the evil of my tongue and the evil of my heart, and the evil of my semen (Allahumma inni a`udhu bika min sharri sam`i wa min sharri basari, wa min sharri lisani, wa min sharri qalbi, wa min sharri maniyyi.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20355",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5444",
      "hadith_no": "5444",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا الحسين بن إسحاق، قال حدثنا أبو نعيم، قال حدثنا سعد بن أوس، قال حدثني بلال بن يحيى، أن شتير بن شكل، أخبره عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا نبي الله علمني تعوذا أتعوذ به فأخذ بيدي ثم قال ‏\"‏ قل أعوذ بك من شر سمعي وشر بصري وشر لساني وشر قلبي وشر منيي ‏\"‏ ‏.‏ قال حتى حفظتها قال سعد والمني ماؤه ‏.‏",
      "text_en": " It was narrated that Shakal bin Humaid said:                     \"I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by means of which I may seek refuge with Allah.' He took me by the hand and said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge with You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm).'\"",
      "usc_msa_ref": "",
      "chain": [
        "38164",
        "20348",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5455",
      "hadith_no": "5455",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا الحسين بن إسحاق، قال أنبأنا أبو نعيم، قال حدثنا سعد بن أوس، قال حدثني بلال بن يحيى، أن شتير بن شكل، أخبره عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا نبي الله علمني تعوذا أتعوذ به فأخذ بيدي ثم قال ‏\"‏ قل أعوذ بك من شر سمعي وشر بصري وشر لساني وشر قلبي وشر منيي ‏\"‏ ‏.‏ قال حتى حفظتها قال سعد والمني ماؤه ‏.‏ خالفه وكيع في لفظه ‏.‏",
      "text_en": " It was narrated that Shakal bin Humaid said:                     \"I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by which I may seek refuge (with Allah).' He took me by the hand then said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge in You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm),' until I had memorized it.\" Waki' contradicted him in the wordings.",
      "usc_msa_ref": "",
      "chain": [
        "38164",
        "20348",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5456",
      "hadith_no": "5456",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عبيد بن وكيع بن الجراح، قال حدثنا أبي، عن سعد بن أوس، عن بلال بن يحيى، عن شتير بن شكل بن حميد، عن أبيه، قال قلت يا رسول الله علمني دعاء أنتفع به ‏.‏ قال ‏\"‏ قل اللهم عافني من شر سمعي وبصري ولساني وقلبي ومن شر منيي ‏\"‏ ‏.‏ يعني ذكره ‏.‏",
      "text_en": " It was narrated from Shutair bin Shakal bin Humaid, that his father said:                     \"I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa min sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and from the evil of my sperm.)'\" - Meaning sexual organ.",
      "usc_msa_ref": "",
      "chain": [
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5484",
      "hadith_no": "5484",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عبيد بن وكيع، قال حدثنا أبي، عن سعد بن أوس، عن بلال بن يحيى، عن شتير بن شكل بن حميد، عن أبيه، قال قلت يا رسول الله علمني دعاء أنتفع به ‏.‏ قال ‏\"‏ قل اللهم عافني من شر سمعي وبصري ولساني وقلبي وشر منيي ‏\"‏ ‏.‏ يعني ذكره ‏.‏",
      "text_en": " It was narrated from Shutair bin Shakal bin Humaid, that his father said:                     \"I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and the evil of my sperm.)\" - Meaning his sexual organ.",
      "usc_msa_ref": "",
      "chain": [
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5726",
      "hadith_no": "5726",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا وكيع، قال حدثنا سعد بن أوس، عن أنس بن سيرين، قال سمعت أنس بن مالك، يقول إن نوحا صلى الله عليه وسلم نازعه الشيطان في عود الكرم فقال هذا لي وقال هذا لي فاصطلحا على أن لنوح ثلثها وللشيطان ثلثيها ‏.‏",
      "text_en": " It was narrated that Anas bin Sirin said:                     \"I heard Anas bin Malik say: 'The Shaitan disputed with Nuh, peace be upon him, concerning the grapevine. One said: \"This is for me,\" and the other said: \"This is for me.\" Then they agreed that Nuh would have one-third and the Shaitan would have two-thirds.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20722",
        "11038",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3510",
      "hadith_no": "3510",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا الحسين بن أبي السري، حدثنا عبيد الله، حدثنا سعد بن أوس العبسي، عن بلال بن يحيى العبسي، عن أبي بكر بن حفص، عن ابن محيريز، عن ثابت بن السمط، عن عبادة بن الصامت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يشرب ناس من أمتي الخمر باسم يسمونها إياه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Messenger of Allah(ﷺ)said:                      “People among my nation will drink wine, under some othername that they will give it.”",
      "usc_msa_ref": "",
      "chain": [
        "11201",
        "20722",
        "19863",
        "11180",
        "40"
      ]
    }
  ],
  "total_hadiths": 13
}