{
  "id": "20739",
  "name": "'Abdul 'Aziz bin Abi Ruwad عبد العزيز بن أبي رواد",
  "full_name": "'Abdul 'Aziz bin Abi Ruwad عبد العزيز بن أبي رواد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "159",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  4  -  صدوق ]"
    ],
    "tags": [
      "al-Makki",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20660",
      "name": "'Abdul Majeed bin 'Abdul 'Aziz عبد المجيد بن عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "20660",
      "name": "'Abdul Majeed bin 'Abdul 'Aziz عبد المجيد بن عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "533",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أيوب بن منصور، حدثنا شعيب بن حرب، عن عبد العزيز بن أبي رواد، أخبرنا نافع، عن مؤذن، لعمر يقال له مسروح أذن قبل الصبح فأمره عمر فذكر نحوه ‏.‏ قال أبو داود وقد رواه حماد بن زيد عن عبيد الله بن عمر عن نافع أو غيره أن مؤذنا لعمر يقال له مسروح أو غيره ‏.‏ قال أبو داود ورواه الدراوردي عن عبيد الله عن نافع عن ابن عمر قال كان لعمر مؤذن يقال له مسعود وذكر نحوه وهذا أصح من ذلك ‏.‏",
      "text_en": " Nafi' reported :                      A mu'adhdhin of ‘Umar, named Masruh, called the Adhan for the morning prayer before the break of dawn; ‘Umar commanded him (to repeat). The narrator reported the tradition in a similar way.Abu Dawud said: This tradition has been transmitted by al-Darawardi from ‘Ubaid Allah on the authority of Ibn ‘Umar, saying: there was a  mu'adhdhin of ‘Umar, named Mas’ud. He then narrated the rest of the tradition. This version is more correct than one.",
      "chain": [
        "35019",
        "20194",
        "20739",
        "11014",
        "20022",
        "11201"
      ]
    },
    {
      "hadith_no": "1614",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الهيثم بن خالد الجهني، حدثنا حسين بن علي الجعفي، عن زائدة، حدثنا عبد العزيز بن أبي رواد، عن نافع، عن عبد الله بن عمر، قال كان الناس يخرجون صدقة الفطر على عهد رسول الله صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏ قال قال عبد الله فلما كان عمر - رضى الله عنه - وكثرت الحنطة جعل عمر نصف صاع حنطة مكان صاع من تلك الأشياء ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The people during the lifetime of the Messenger of Allah (ﷺ) used to bring forth the sadaqah at the end of Ramadan when closing the fast one sa' of barley whose straw is removed, or of raisins. Abdullah said: When Umar (Allah be pleased with him) succeeded, and the wheat became abundant, Umar prescribed half a sa' of wheat instead of all these things.",
      "chain": [
        "35162",
        "20315",
        "20320",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم لا يدع أن يستلم الركن اليماني والحجر في كل طوفة قال وكان عبد الله بن عمر يفعله ‏.‏",
      "text_en": " Ibn ‘Umar said The Apostle of Allaah(ﷺ) did not give up touching the Yamani corner and the (Black) Stone in each of his circumambulations. Ibn ‘Umar used to do so.",
      "chain": [
        "30175",
        "20031",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4094",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا هناد بن السري، حدثنا حسين الجعفي، عن عبد العزيز بن أبي رواد، عن سالم بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإسبال في الإزار والقميص والعمامة من جر منها شيئا خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: Hanging down is in lower garment, shirt and turban. If anyone trails any of them conceitedly, Allah will not look at him on the Day of Resurrection.",
      "chain": [
        "30480",
        "20315",
        "20739",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4227",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي، حدثني أبي، حدثنا عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يتختم في يساره وكان فصه في باطن كفه ‏.‏ قال أبو داود قال ابن إسحاق وأسامة - يعني ابن زيد - عن نافع بإسناده في يمينه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) used to wear the signet-ring on his left hand, and put its stone next the palm of his hand.Abu Dawud said: Ibn Ishaq and Usamah b. Zaid transmitted from Nafi': \"On his right hand\".",
      "chain": [
        "30395",
        "20264",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2100",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا يحيى بن موسى، قال قلت لعبد الرحيم بن هارون الغساني حدثكم عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كذب العبد تباعد عنه الملك ميلا من نتن ما جاء به ‏\"‏ ‏.‏ قال يحيى فأقر به عبد الرحيم بن هارون فقال نعم ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه تفرد به عبد الرحيم بن هارون ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah said:                     \"When the slave (of Allah) lies, the angel goes a mile away from him because of the stench of what he has done.\"Yahya said: \"(I asked) 'Abdur-Rahim bin Harun if he approved of it,and he said 'Yes'.\"",
      "chain": [
        "30221",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن عبد الكريم أبو زرعة الرازي، قال حدثنا أحمد بن عبد الله بن يونس، قال حدثني علي بن الفضيل بن عياض، عن عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، أن رجلا، رأى فيما يرى النائم قيل له بأى شىء أمركم نبيكم صلى الله عليه وسلم قال أمرنا أن نسبح ثلاثا وثلاثين ونحمد ثلاثا وثلاثين ونكبر أربعا وثلاثين فتلك مائة ‏.‏ قال سبحوا خمسا وعشرين واحمدوا خمسا وعشرين وكبروا خمسا وعشرين وهللوا خمسا وعشرين فتلك مائة فلما أصبح ذكر ذلك للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ افعلوا كما قال الأنصاري ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that :                     A man saw in a dream that it was said to him: \"What does your Prophet (ﷺ) command you to do?\" He said: \"He commanded us to say Tasbih thirty-three times following the prayer, and to say the tahmid thirty-three times, and to say the takbir thirty-four times, and that makes one-hundred.\" He said: Say the tasbih twenty-five times and say the tahmid twenty-five times and say the takbir twenty-five times and say the tahlil twenty-five times, and that will make one hundred.\" The following morning he told the Prophet (ﷺ) about that and the Messenger of Allah (ﷺ) said: \"Do what the Ansari said.\"",
      "chain": [
        "30184",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2516",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، قال حدثنا عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، قال كان الناس يخرجون عن صدقة الفطر، في عهد النبي صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"At the time of the Messenger of Allah, the people used to give as Sadaqatul Fitr a Sa' of barely or dates or rye or raising.\"",
      "chain": [
        "11278",
        "20320",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5334",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا حسين بن علي، عن عبد العزيز بن أبي رواد، عن سالم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإسبال في الإزار والقميص والعمامة من جر منها شيئا خيلاء لا ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Al-Isbal may apply to the Izar, the Qamis and the turban. Whoever drags any one of these out of vanity, Allah will not look at him on the Day of Resurrection.'\"",
      "chain": [
        "30375",
        "20315",
        "20739",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "712",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن مروان بن سالم، عن عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خصلتان معلقتان في أعناق المؤذنين للمسلمين صلاتهم وصيامهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: There are two characteristics in which the Muslims are dependent upon their Mu'adh-dhins: their prayer and their fasting.\"",
      "chain": [
        "20644",
        "28558",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1681",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا جميل بن الحسن، قال حدثنا أبو المنذر الهذيل بن الحكم، حدثنا عبد العزيز بن أبي رواد، عن عكرمة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ موت غربة شهادة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     Dying in a strange land is martyrdom.”",
      "chain": [
        "34046",
        "20739",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 11
}