{
  "id": "20734",
  "name": "Ahmed bin Khalid bin Musa al-Wahbi أحمد بن خالد بن موسى الوهبي",
  "full_name": "Ahmed bin Khalid bin Musa al-Wahbi أحمد بن خالد بن موسى الوهبي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "214",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "al-Kundi",
      "al-Wahbi",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38429",
      "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38437",
      "name": "'Imran bin Bakar al-Kula'i عمران بن بكار الكلاعي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1989",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أحمد بن خالد الوهبي، حدثنا محمد بن إسحاق، عن عيسى بن معقل ابن أم معقل الأسدي، - أسد خزيمة - حدثني يوسف بن عبد الله بن سلام، عن جدته أم معقل، قالت لما حج رسول الله صلى الله عليه وسلم حجة الوداع وكان لنا جمل فجعله أبو معقل في سبيل الله وأصابنا مرض وهلك أبو معقل وخرج النبي صلى الله عليه وسلم فلما فرغ من حجه جئته فقال ‏\"‏ يا أم معقل ما منعك أن تخرجي معنا ‏\"‏ ‏.‏ قالت لقد تهيأنا فهلك أبو معقل وكان لنا جمل هو الذي نحج عليه فأوصى به أبو معقل في سبيل الله ‏.‏ قال ‏\"‏ فهلا خرجت عليه فإن الحج في سبيل الله فأما إذ فاتتك هذه الحجة معنا فاعتمري في رمضان فإنها كحجة ‏\"‏ ‏.‏ فكانت تقول الحج حجة والعمرة عمرة وقد قال هذا لي رسول الله صلى الله عليه وسلم ما أدري ألي خاصة ‏.‏",
      "text_en": " Narrated Umm Ma'qil:                     When the Messenger of Allah (ﷺ) performed the Farewell Pilgrimage, and we had a camel, AbuMa'qil dedicated it to the cause of Allah. Then we suffered from a disease, and AbuMa'qil died. The Prophet (ﷺ) went out (for hajj). When he finished the hajj, I came to him.  He said (to me): Umm Ma'qil, what prevented you from coming out for hajj along with us?  She said: We resolved (to do so), but AbuMa'qil died. We had a camel on which we could perform hajj, but AbuMa'qil had bequeathed it to the cause of Allah.  He said: Why did you not go out (for hajj) upon it, for hajj is in the cause of Allah? If you miss this hajj along with us, perform umrah during Ramadan, for it is like hajj.  She used to say: hajj is hajj, and umrah is umrah. The Messenger of Allah (ﷺ) said it to me: I do not know whether it was peculiar to me.",
      "chain": [
        "38566",
        "20734",
        "11107",
        "5335"
      ]
    },
    {
      "hadith_no": "2728",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، قال حدثنا أحمد بن خالد، - يعني الوهبي - حدثنا ابن إسحاق، عن أبي جعفر، والزهري، عن يزيد بن هرمز، قال كتب نجدة الحروري إلى ابن عباس يسأله عن النساء، هل كن يشهدن الحرب مع رسول الله صلى الله عليه وسلم وهل كان يضرب لهن بسهم قال فأنا كتبت كتاب ابن عباس إلى نجدة قد كن يحضرن الحرب مع رسول الله صلى الله عليه وسلم فأما أن يضرب لهن بسهم فلا وقد كان يرضخ لهن ‏.‏",
      "text_en": " Yazid bin Humruz said “Najdah Al Hururi wrote to Ibn ‘Abbas asking him whether the women participated in battle along with the Apostle of Allaah(ﷺ) and whether they were allotted a share from the spoils. I (Yazid bin Hurmuz) wrote a letter on behalf of Ibn ‘Abbas to Najdah. They participated in the battle along with the Apostle of Allaah(ﷺ), but no portion (from the spoils) was allotted to them, they were given only a little of it.",
      "chain": [
        "11222",
        "20734",
        "11107",
        "11013",
        "10627"
      ]
    },
    {
      "hadith_no": "3499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أحمد بن خالد الوهبي، حدثنا محمد بن إسحاق، عن أبي الزناد، عن عبيد بن حنين، عن ابن عمر، قال ابتعت زيتا في السوق فلما استوجبته لنفسي لقيني رجل فأعطاني به ربحا حسنا فأردت أن أضرب على يده فأخذ رجل من خلفي بذراعي فالتفت فإذا زيد بن ثابت فقال لا تبعه حيث ابتعته حتى تحوزه إلى رحلك فإن رسول الله صلى الله عليه وسلم نهى أن تباع السلع حيث تبتاع حتى يحوزها التجار إلى رحالهم ‏.‏",
      "text_en": " Narrated Ibn Umar:                     I bought olive oil in the market. When I became its owner, a man met me and offered good profit for it. I intended to settle the bargain with him, but a man caught hold of my hand from behind. When I turned I found that he was Zayd ibn Thabit. He said: Do not sell it on the spot where you have bought it until you take it to your house, for the Messenger of Allah (ﷺ) forbade to sell the goods where they are bought until the tradesmen take them to their houses.",
      "chain": [
        "38566",
        "20734",
        "11107",
        "11061",
        "11202",
        "18"
      ]
    },
    {
      "hadith_no": "1531",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أحمد بن خالد الوهبي، حدثنا محمد بن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن عائشة، قالت لو كنت استقبلت من الأمر ما استدبرت ما غسل النبي  صلى الله عليه وسلم  غير نسائه ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “If I had known then what I knownow,no one would have washed the Prophet (ﷺ) but his wives.”",
      "chain": [
        "11222",
        "20734",
        "11107",
        "19826",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "1832",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أحمد بن خالد الوهبي، حدثنا محمد بن إسحاق، عن عيسى بن عبد الله بن مالك، عن عطية بن سفيان بن عبد الله بن ربيعة، قال حدثنا وفدنا الذين، قدموا على رسول الله  صلى الله عليه وسلم  بإسلام ثقيف ‏.‏ قال وقدموا عليه في رمضان وضرب عليهم قبة في المسجد فلما أسلموا صاموا ما بقي عليهم من الشهر ‏.‏",
      "text_en": " It wasnarrated that ‘Atiyyah bin Sufyan bin ‘Abdullah bin Rabi’ahsaid:                      “Our delegation who went to the Messenger of Allah (ﷺ) toannounce the Islam of Thaqif told us that they came to him inRamadan.He set up a tent for them in the mosque, and when theybecame Muslim,they fasted what was left of the month.”",
      "chain": [
        "11222",
        "20734",
        "11107"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أحمد بن خالد الوهبي، حدثنا عبد العزيز بن أبي سلمة الماجشون، عن عبد الواحد بن أبي عون، عن سعد بن إبراهيم، عن حابس اليماني، عن أبي بكر الصديق، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى الصبح فهو في ذمة الله فلا تخفروا الله في عهده فمن قتله طلبه الله حتى يكبه في النار على وجهه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Bakr Siddiq that the Messenger of Allah(ﷺ) said:                      “Whoever offers the morning prayer, he is under theprotection of Allah, so do not betray Allah by betraying those whoareunder His protection. Whoever kills him, Allah will seek him outuntilHe throws him on his face into Hell.”",
      "chain": [
        "10581",
        "20734",
        "20026",
        "22141",
        "11063",
        "2"
      ]
    }
  ],
  "total_hadiths": 6
}