{
  "id": "20733",
  "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
  "full_name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "195",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20399",
      "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22024",
      "name": "Isma'il bin Rafa'i bin Awymr إسماعيل بن رافع بن عويمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27507",
      "name": "Khalid bin Yazid bin Salah خالد بن يزيد بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20400",
      "name": "'Abdur Rahman bin Namr al-Yahasbi عبد الرحمن بن نمر اليحصبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20739",
      "name": "'Abdul 'Aziz bin Abi Ruwad عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27538",
      "name": "'Isa bin Musa al-Quraishi عيسى بن موسى القرشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20637",
      "name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16104",
      "name": "Musa bin Ayoub bin 'Amir موسى بن أيوب بن عامر الغافقي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20179",
      "name": "Muhammad bin Matraf محمد بن مطرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11674",
      "name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19894",
      "name": "Yahya bin al-Harith al-Dhamari يحيى بن الحارث الذماري",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30587",
      "name": "Sulaiman bin 'Abdur Rahman سليمان بن عبد الرحمن بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30308",
      "name": "Ibrahim bin al-Mandhir bin 'Abdullah إبراهيم بن المنذر بن عبد الله",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30343",
      "name": "Sadqah bin al-Fadl صدقة بن الفضل أبو الفضل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20533",
      "name": "al-Harith bin 'Ubaid al-Ayadi الحارث بن عبيد الإيادي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30357",
      "name": "'Abdur Rahman bin 'Abdul Malik bin Shayb عبد الرحمن بن عبد الملك بن شيبة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30383",
      "name": "Muhammad bin Mhran محمد بن مهران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30280",
      "name": "Harun bin al-Ma'ruf هارون بن معروف المروزي الخزاز الضرير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30288",
      "name": "Hisham bin 'Ammar bin Nasayr هشام بن عمار بن نصير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38589",
      "name": "Muhammad bin Masfa bin Bahlwal محمد بن مصفى بن بهلول",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37534",
      "name": "Mhmwd bin Khalid محمود بن خالد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30482",
      "name": "al-Walid bin Shuja' bin al-Sakuni الوليد بن شجاع بن الوليد بن قيس السكوني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37537",
      "name": "Musa bin 'Amir bin Amarh موسى بن عامر بن عمارة بن خريم",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "559",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال حدثنا الأوزاعي، قال حدثنا أبو النجاشي، صهيب مولى رافع بن خديج قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع النبي صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the Maghrib prayer with the Prophet and after finishing the prayer one of us may go away and could still see as Par as the spots where one's arrow might reach when shot by a bow.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "707",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا الوليد، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه أبي قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأقوم في الصلاة أريد أن أطول فيها، فأسمع بكاء الصبي، فأتجوز في صلاتي كراهية أن أشق على أمه ‏\"‏‏.‏ تابعه بشر بن بكر وابن المبارك وبقية عن الأوزاعي‏.‏",
      "text_en": " Narrated `Abdullah bin 'Abi Qatada:                     My father said, \"The Prophet said, 'When I stand for prayer, I intend to prolong it but on hearing the cries of a child, I cut it short, as I dislike to trouble the child's mother.' \"",
      "chain": [
        "30309",
        "20733",
        "20024",
        "11449",
        "11804"
      ]
    },
    {
      "hadith_no": "907",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا الوليد بن مسلم، قال حدثنا يزيد بن أبي مريم، قال حدثنا عباية بن رفاعة، قال أدركني أبو عبس وأنا أذهب، إلى الجمعة فقال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من اغبرت قدماه في سبيل الله حرمه الله على النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Abs:                     I heard the Prophet saying, \"Anyone whose feet are covered with dust in Allah's cause, shall be saved by Allah from the Hell-Fire.\"",
      "chain": [
        "30026",
        "20733",
        "11674",
        "11179"
      ]
    },
    {
      "hadith_no": "933",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال حدثني إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال أصابت الناس سنة على عهد النبي صلى الله عليه وسلم فبينا النبي صلى الله عليه وسلم يخطب في يوم جمعة قام أعرابي فقال يا رسول الله هلك المال وجاع العيال، فادع الله لنا‏.‏ فرفع يديه، وما نرى في السماء قزعة، فوالذي نفسي بيده ما وضعها حتى ثار السحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته صلى الله عليه وسلم فمطرنا يومنا ذلك، ومن الغد، وبعد الغد والذي يليه، حتى الجمعة الأخرى، وقام ذلك الأعرابي  أو قال غيره  فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع يديه، فقال ‏\"‏ اللهم حوالينا، ولا علينا ‏\"‏‏.‏ فما يشير بيده إلى ناحية من السحاب إلا انفرجت، وصارت المدينة مثل الجوبة، وسال الوادي قناة شهرا، ولم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once in the lifetime of the Prophet (p.b.u.h) the people were afflicted with drought (famine). While the Prophet was delivering the Khutba on a Friday, a Bedouin stood up and said, \"O, Allah's Apostle! Our possessions are being destroyed and the children are hungry; Please invoke Allah (for rain)\". So the Prophet raised his hands. At that time there was not a trace of cloud in the sky. By Him in Whose Hands my soul is as soon as he lowered his hands, clouds gathered like mountains, and before he got down from the pulpit, I saw the rain falling on the beard of the Prophet. It rained that day, the next day, the third day, the fourth day till the next Friday. The same Bedouin or another man stood up and said, \"O Allah's Apostle! The houses have collapsed, our possessions and livestock have been drowned; Please invoke Allah (to protect us)\". So the Prophet raised both his hands and said, \"O Allah! Round about us and not on us\". So, in whatever direction he pointed with his hands, the clouds dispersed and cleared away, and Medina's (sky) became clear as a hole in between the clouds. The valley of Qanat remained flooded, for one month, none came from outside but talked about the abundant rain.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "973",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال أخبرني نافع، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يغدو إلى المصلى، والعنزة بين يديه، تحمل وتنصب بالمصلى بين يديه فيصلي إليها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet used to proceed to the Musalla and an 'Anaza used to be carried before him and planted in the Musalla in front of him and he would pray facing it (as a Sutra).",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1066",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال أخبرنا ابن نمر، سمع ابن شهاب، عن عروة، عن عائشة  رضى الله عنها  جهر النبي صلى الله عليه وسلم في صلاة الخسوف بقراءته، فإذا فرغ من قراءته كبر فركع، وإذا رفع من الركعة قال سمع الله لمن حمده، ربنا ولك الحمد‏.‏ ثم يعاود القراءة في صلاة الكسوف، أربع ركعات في ركعتين وأربع سجدات‏.‏ وقال الأوزاعي وغيره سمعت الزهري، عن عروة، عن عائشة  رضى الله عنها  أن الشمس، خسفت على عهد رسول الله صلى الله عليه وسلم فبعث مناديا بالصلاة جامعة، فتقدم فصلى أربع ركعات في ركعتين وأربع سجدات‏.‏ وأخبرني عبد الرحمن بن نمر سمع ابن شهاب مثله‏.‏ قال الزهري فقلت ما صنع أخوك ذلك، عبد الله بن الزبير ما صلى إلا ركعتين مثل الصبح إذ صلى بالمدينة‏.‏ قال أجل، إنه أخطأ السنة‏.‏ تابعه سفيان بن حسين وسليمان بن كثير عن الزهري في الجهر‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet (p.b.u.h) recited (the Qur'an) aloud during the eclipse prayer and when he had finished the eclipse prayer he said the Takbir and bowed. When he stood straight from bowing he would say \"Sami 'al-l-ahu Lyman hamidah Rabbana wa laka l-hamd.\" And he would again start reciting. In the eclipse prayer there are four bowing and four prostrations in two rak`at. Al-Auza'i and others said that they had heard Az-Zuhi from 'Ursa from `Aisha saying, \"In the lifetime of Allah's Apostle the sun eclipsed, and he made a person to announce: 'Prayer in congregation.' He led the prayer and performed four bowing and four prostrations in two rak`at.\" Narrated Al-Walid that `Abdur-Rahman bin Namir had informed him that he had heard the same. Ibn Shihab heard the same. Az-Zuhri said, \"I asked ('Ursa), 'What did your brother `Abdullah bin Az-Zubair do? He prayed two rak`at (of the eclipse prayer) like the morning prayer, when he offered the (eclipse) prayer in Median.' 'Ursa replied that he had missed (i.e. did not pray according to) the Prophet's tradition.\" Sulaiman bin Kathir and Sufyan bin Husain narrated from Az-Zuhri that the prayer for the eclipse used to be offered with loud recitation.",
      "chain": [
        "30383",
        "20733",
        "20400",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1154",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير‏.‏ الحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله‏.‏ ثم قال اللهم اغفر لي‏.‏ أو دعا استجيب، فإن توضأ وصلى قبلت صلاته ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, waLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha il-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped but Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are due for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none has the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power Except with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), he will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "1475",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني ابن شهاب، عن عطاء بن يزيد، عن أبي سعيد الخدري  رضى الله عنه  أن أعرابيا سأل رسول الله صلى الله عليه وسلم عن الهجرة فقال ‏\"‏ ويحك، إن شأنها شديد، فهل لك من إبل تؤدي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A Bedouin asked Allah's Apostle about the emigration. The Prophet (p.b.u.h) said, \"May Allah have mercy on you! The matter of emigration is very hard. Have you got camels? Do you pay their Zakat?\" The Bedouin said, \"Yes, I have camels and I pay their Zakat.\" The Prophet said, Work beyond the seas and Allah will not decrease (waste) any of your good deeds.\" (See Hadith No. 260 Vol. 5).",
      "chain": [
        "30026",
        "20733",
        "20024",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "1527",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو الأوزاعي، حدثني إسحاق بن عبد الله بن أبي طلحة، حدثني أنس بن مالك  رضى الله عنه  قال غدوت إلى رسول الله صلى الله عليه وسلم بعبد الله بن أبي طلحة ليحنكه، فوافيته في يده الميسم يسم إبل الصدقة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I took `Abdullah bin Abu Talha to Allah's Apostle to perform Tahnik for him. (Tahnik was a custom among the Muslims that whenever a child was born they used to take it to the Prophet who would chew a piece of date and put a part of its juice in the child's mouth). I saw the Prophet and he had an instrument for branding in his hands and was branding the camels of Zakat.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1540",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم، أخبرنا الوليد، حدثنا الأوزاعي، سمع عطاء، يحدث عن جابر بن عبد الله  رضى الله عنهما  أن إهلال رسول الله صلى الله عليه وسلم من ذي الحليفة حين استوت به راحلته‏.‏ رواه أنس وابن عباس رضى الله عنهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     that Allah's Apostle started saying, \"Labbaik\" from Dhul-Hulaifa when his Mount stood upright carrying him .",
      "chain": [
        "20150",
        "20733",
        "20024",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، وبشر بن بكر التنيسي، قالا حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني عكرمة، أنه سمع ابن عباس  رضى الله عنهما  يقول إنه سمع عمر  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم بوادي العقيق يقول ‏\"‏ أتاني الليلة آت من ربي فقال صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     In the valley of Al-`Aqiq I heard Allah's Apostle saying, \"To night a messenger came to me from my Lord and asked me to pray in this blessed valley and to assume Ihram for Hajj and `Umra together. \"",
      "chain": [
        "30418",
        "20733",
        "20413",
        "20024",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1615",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، حدثنا الأوزاعي، قال حدثني الزهري، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم من الغد يوم النحر وهو بمنى ‏\"‏ نحن نازلون غدا بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏ يعني ذلك المحصب، وذلك أن قريشا وكنانة تحالفت على بني هاشم وبني عبد المطلب، أو بني المطلب أن لا يناكحوهم، ولا يبايعوهم حتى يسلموا إليهم النبي صلى الله عليه وسلم‏.‏ وقال سلامة عن عقيل ويحيى بن الضحاك عن الأوزاعي أخبرني ابن شهاب وقالا بني هاشم وبني المطلب‏.‏ قال أبو عبد الله بني المطلب أشبه‏.‏",
      "text_en": " Narrated Abu Huraira:                     On the Day of Nahr at Mina, the Prophet said, \"Tomorrow we shall stay at Khaif Bani Kinana where the pagans had taken the oath of Kufr (heathenism).\" He meant (by that place) Al-Muhassab where the Quraish tribe and Bani Kinana concluded a contract against Bani Hashim and Bani `Abdul-Muttalib or Bani Al-Muttalib that they would not intermarry with them or deal with them in business until they handed over the Prophet to them.",
      "chain": [
        "30418",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1914",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو، حدثنا إسحاق، حدثني أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس من بلد إلا سيطؤه الدجال، إلا مكة والمدينة، ليس له من نقابها نقب إلا عليه الملائكة صافين، يحرسونها، ثم ترجف المدينة بأهلها ثلاث رجفات، فيخرج الله كل كافر ومنافق ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, and there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in rows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three earthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"",
      "chain": [
        "30308",
        "20733",
        "20024",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "2128",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا الوليد، عن ثور، عن خالد بن معدان، عن المقدام بن معديكرب، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ كيلوا طعامكم يبارك لكم ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miqdam bin Ma'diyakrib:                     The Prophet said, \"Measure your foodstuff and you will be blessed.\"",
      "chain": [
        "30309",
        "20733",
        "11155",
        "11422"
      ]
    },
    {
      "hadith_no": "2131",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الوليد بن مسلم، عن الأوزاعي، عن الزهري، عن سالم، عن أبيه  رضى الله عنه  قال رأيت الذين يشترون الطعام مجازفة يضربون على عهد رسول الله صلى الله عليه وسلم أن يبيعوه حتى يئووه إلى رحالهم‏.‏",
      "text_en": " Narrated Salim:                     that his father said. \"I saw those, who used to buy foodstuff without measuring or weighing in the life time of the Prophet being punished if they sold it before carrying it to their own houses.\"",
      "chain": [
        "30123",
        "20733",
        "20024",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2434",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني أبو هريرة  رضى الله عنه  قال لما فتح الله على رسوله صلى الله عليه وسلم مكة قام في الناس، فحمد الله، وأثنى عليه ثم قال ‏\"‏ إن الله حبس عن مكة الفيل، وسلط عليها رسوله والمؤمنين، فإنها لا تحل لأحد كان قبلي، وإنها أحلت لي ساعة من نهار، وإنها لا تحل لأحد بعدي، فلا ينفر صيدها ولا يختلى شوكها، ولا تحل ساقطتها إلا لمنشد، ومن قتل له قتيل فهو بخير النظرين، إما أن يفدى، وإما أن يقيد ‏\"‏‏.‏ فقال العباس إلا الإذخر، فإنا نجعله لقبورنا وبيوتنا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏‏.‏ فقام أبو شاه  رجل من أهل اليمن  فقال اكتبوا لي يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏‏.‏ قلت للأوزاعي ما قوله اكتبوا لي يا رسول الله قال هذه الخطبة التي سمعها من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     When Allah gave victory to His Apostle over the people of Mecca, Allah's Apostle stood up among the people and after glorifying Allah, said, \"Allah has prohibited fighting in Mecca and has given authority to His Apostle and the believers over it, so fighting was illegal for anyone before me, and was made legal for me for a part of a day, and it will not be legal for anyone after me. Its game should not be chased, its thorny bushes should not be uprooted, and picking up its fallen things is not allowed except for one who makes public announcement for it, and he whose relative is murdered has the option either to accept a compensation for it or to retaliate.\" Al-`Abbas said, \"Except Al-Idhkhir, for we use it in our graves and houses.\" Allah's Apostle said, \"Except Al-Idhkhir.\" Abu Shah, a Yemenite, stood up and said, \"O Allah's Apostle! Get it written for me.\" Allah's Apostle said, \"Write it for Abu Shah.\" (The sub-narrator asked Al-Auza'i): What did he mean by saying, \"Get it written, O Allah's Apostle?\" He replied, \"The speech which he had heard from Allah's Apostle .\"",
      "chain": [
        "30221",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3176",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء بن زبر، قال سمعت بسر بن عبيد الله، أنه سمع أبا إدريس، قال سمعت عوف بن مالك، قال أتيت النبي صلى الله عليه وسلم في غزوة تبوك، وهو في قبة من أدم فقال ‏\"‏ اعدد ستا بين يدى الساعة، موتي، ثم فتح بيت المقدس، ثم موتان يأخذ فيكم كقعاص الغنم، ثم استفاضة المال حتى يعطى الرجل مائة دينار فيظل ساخطا، ثم فتنة لا يبقى بيت من العرب إلا دخلته، ثم هدنة تكون بينكم وبين بني الأصفر فيغدرون، فيأتونكم تحت ثمانين غاية، تحت كل غاية اثنا عشر ألفا ‏\"‏‏.‏",
      "text_en": " Narrated `Auf bin Mali:                     I went to the Prophet during the Ghazwa of Tabuk while he was sitting in a leather tent. He said, \"Count six signs that indicate the approach of the Hour: my death, the conquest of Jerusalem, a plague that will afflict you (and kill you in great numbers) as the plague that afflicts sheep, the increase of wealth to such an extent that even if one is given one hundred Dinars, he will not be satisfied; then an affliction which no Arab house will escape, and then a truce between you and Bani Al-Asfar (i.e. the Byzantines) who will betray you and attack you under eighty flags. Under each flag will be twelve thousand soldiers.",
      "chain": [
        "30418",
        "20733",
        "20399",
        "11412",
        "11027",
        "10805"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا صدقة بن الفضل، حدثنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، عن عبادة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من شهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، وأن عيسى عبد الله ورسوله وكلمته، ألقاها إلى مريم، وروح منه، والجنة حق والنار حق، أدخله الله الجنة على ما كان من العمل ‏\"‏‏.‏ قال الوليد حدثني ابن جابر عن عمير عن جنادة وزاد ‏\"‏ من أبواب الجنة الثمانية، أيها شاء ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada:                     The Prophet said, \"If anyone testifies that None has the right to be worshipped but Allah Alone Who has no partners, and that Muhammad is His Slave and His Apostle, and that Jesus is Allah's Slave and His Apostle and His Word which He bestowed on Mary and a Spirit created by Him, and that Paradise is true, and Hell is true, Allah will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junada, the sub-narrator said, \" 'Ubada added, 'Such a person can enter Paradise through any of its eight gates he likes.\")",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205"
      ]
    },
    {
      "hadith_no": "3649",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني بسر بن عبيد الله الحضرمي، قال حدثني أبو إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير، وكنت أسأله عن الشر مخافة أن يدركني‏.‏ فقلت يا رسول الله إنا كنا في جاهلية وشر، فجاءنا الله بهذا الخير، فهل بعد هذا الخير من شر قال ‏\"‏ نعم ‏\"‏‏.‏ قلت وهل بعد ذلك الشر من خير قال ‏\"‏ نعم، وفيه دخن ‏\"‏‏.‏ قلت وما دخنه قال ‏\"‏ قوم يهدون بغير هديي تعرف منهم وتنكر ‏\"‏‏.‏ قلت فهل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة إلى أبواب جهنم، من أجابهم إليها قذفوه فيها ‏\"‏‏.‏ قلت يا رسول الله صفهم لنا فقال ‏\"‏ هم من جلدتنا، ويتكلمون بألسنتنا ‏\"‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏‏.‏ قلت فإن لم يكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها، ولو أن تعض بأصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa bin Al-Yaman:                     The people used to ask Allah's Apostle about good, but I used to ask him about evil for fear that it might overtake me. Once I said, \"O Allah's Apostle! We were in ignorance and in evil and Allah has bestowed upon us the present good; will there by any evil after this good?\" He said, \"Yes.\" I asked, \"Will there be good after that evil?\" He said, \"Yes, but it would be tained with Dakhan (i.e. Little evil).\" I asked, \"What will its Dakhan be?\" He said, \"There will be some people who will lead (people) according to principles other than my tradition. You will see their actions and disapprove of them.\" I said, \"Will there by any evil after that good?\" He said, \"Yes, there will be some people who will invite others to the doors of Hell, and whoever accepts their invitation to it will be thrown in it (by them).\" I said, \"O Allah's Apostle! Describe those people to us.\" He said, \"They will belong to us and speak our language\" I asked, \"What do you order me to do if such a thing should take place in my life?\" He said, \"Adhere to the group of Muslims and their Chief.\" I asked, \"If there is neither a group (of Muslims) nor a chief (what shall I do)?\" He said, \"Keep away from all those different sects, even if you had to bite (i.e. eat) the root of a tree, till you meet Allah while you are still in that state.\"",
      "chain": [
        "30221",
        "20733",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "3684",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني عمير بن هانئ، أنه سمع معاوية، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، لا يضرهم من خذلهم ولا من خالفهم حتى يأتيهم أمر الله وهم على ذلك ‏\"‏‏.‏ قال عمير فقال مالك بن يخامر قال معاذ وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشام‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of people amongst my followers will remain obedient to Allah's orders and they will not be harmed by anyone who will not help them or who will oppose them, till Allah's Order (the Last Day) comes upon them while they are still on the right path.\"",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "hadith_no": "3722",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن يزيد الكوفي، حدثنا الوليد، عن الأوزاعي، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، عن عروة بن الزبير، قال سألت عبد الله بن عمرو عن أشد، ما صنع المشركون برسول الله صلى الله عليه وسلم قال رأيت عقبة بن أبي معيط جاء إلى النبي صلى الله عليه وسلم وهو يصلي، فوضع رداءه في عنقه فخنقه به خنقا شديدا، فجاء أبو بكر حتى دفعه عنه فقال أتقتلون رجلا أن يقول ربي الله‏.‏ وقد جاءكم بالبينات من ربكم‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked `Abdullah bin `Amr, \"What was the worst thing the pagans did to Allah's Apostle?\" He said, \"I saw `Uqba bin Abi Mu'ait coming to the Prophet while he was praying.' `Uqba put his sheet round the Prophet's neck and squeezed it very severely. Abu Bakr came and pulled `Uqba away from the Prophet and said, \"Do you intend to kill a man just because he says: 'My Lord is Allah, and he has brought forth to you the Evident Signs from your Lord?\"",
      "chain": [
        "34204",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3783",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "قال أبو عبد الله وحدثني سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا عبد الرحمن بن نمر، عن الزهري، حدثني حرملة، مولى أسامة بن زيد أنه بينما هو مع عبد الله بن عمر إذ دخل الحجاج بن أيمن فلم يتم ركوعه ولا سجوده، فقال أعد‏.‏ فلما ولى قال لي ابن عمر من هذا قلت الحجاج بن أيمن ابن أم أيمن‏.‏ فقال ابن عمر لو رأى هذا رسول الله صلى الله عليه وسلم لأحبه، فذكر حبه وما ولدته أم أيمن‏.‏ قال وحدثني بعض أصحابي عن سليمان وكانت حاضنة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Harmala, the freed slave of Usama bin Zaid saidthat while he      was in the company of 'Abdullah bin 'Umar, Al-Hajjaj bin Aiman came in     and (while praying) he did not perform his bowing and prostrations      properly. So Ibn 'Umar told him to repeat his prayer. When he went      away, Ibn 'Umar asked me, \"Who is he?\" I said, \"Al-Hajjaj bin Um      Aiman.\" Ibn 'Umar said, \"If Allah's Apostle saw him, he would have      loved him.\" Then Ibn 'Umar mentioned the love of the Prophet for the      children of Um Aiman. Sulaiman said that Um Aiman was one of the nurses     of the Prophet.",
      "chain": [
        "30184",
        "30587",
        "20733",
        "11013",
        "11683"
      ]
    },
    {
      "hadith_no": "3904",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا الوليد بن مسلم، حدثني الأوزاعي، حدثني يحيى بن أبي كثير، عن محمد بن إبراهيم التيمي، قال حدثني عروة بن الزبير، قال سألت ابن عمرو بن العاص أخبرني بأشد، شىء صنعه المشركون بالنبي صلى الله عليه وسلم قال بينا النبي صلى الله عليه وسلم يصلي في حجر الكعبة إذ أقبل عقبة بن أبي معيط، فوضع ثوبه في عنقه فخنقه خنقا شديدا، فأقبل أبو بكر حتى أخذ بمنكبه ودفعه عن النبي صلى الله عليه وسلم قال ‏{‏أتقتلون رجلا أن يقول ربي الله‏}‏ الآية‏.‏ تابعه ابن إسحاق حدثني يحيى بن عروة عن عروة، قلت لعبد الله بن عمرو‏.‏ وقال عبدة عن هشام عن أبيه قيل لعمرو بن العاص‏.‏ وقال محمد بن عمرو عن أبي سلمة حدثني عمرو بن العاص‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked Ibn `Amr bin Al-As, \"Tell me of the worst thing which the pagans did to the Prophet.\" He said, \"While the Prophet was praying in the Hijr of the Ka`ba; `Uqba bin Abi Mu'ait came and put his garment around the Prophet's neck and throttled him violently. Abu Bakr came and caught him by his shoulder and pushed him away from the Prophet and said, \"Do you want to kill a man just because he says, 'My Lord is Allah?' \"",
      "chain": [
        "30157",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3968",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وقال دحيم حدثنا الوليد، حدثنا الأوزاعي، حدثني أبو عبيد، عن عقبة بن وساج، حدثني أنس بن مالك  رضى الله عنه  قال قدم النبي صلى الله عليه وسلم المدينة، فكان أسن أصحابه أبو بكر، فغلفها بالحناء والكتم حتى قنأ لونها‏.‏",
      "text_en": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "36618",
        "19"
      ]
    },
    {
      "hadith_no": "3971",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي،‏.‏ وقال محمد بن يوسف حدثنا الأوزاعي، حدثنا الزهري، قال حدثني عطاء بن يزيد الليثي، قال حدثني أبو سعيد  رضى الله عنه  قال جاء أعرابي إلى النبي صلى الله عليه وسلم فسأله عن الهجرة فقال ‏\"‏ ويحك إن الهجرة شأنها شديد، فهل لك من إبل ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتعطي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فهل تمنح منها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتحلبها يوم ورودها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Once a bedouin came to the Prophet and asked him about the migration. The Prophet said, \"Mercy of Allah be on you! The migration is a quite difficult matter. Have you got some camels?\" He replied in the affirmative. Then the Prophet said, \"Do you give their Zakat?\" He replied in the affirmative. The Prophet said, \"Do you let others benefit by their milk gratis?\" He replied in the affirmative. Then the Prophet asked, \"Do you milk them on their watering days and give their milk to the poor and needy?\" He replied in the affirmative. The Prophet, said, \"Go on doing like this from beyond the seas, and there is no doubt that Allah will not overlook any of your good deeds.\"",
      "chain": [
        "30026",
        "20733",
        "20024",
        "30388",
        "20024",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "4236",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال هشام بن عمار حدثنا الوليد بن مسلم، حدثنا عمر بن محمد العمري، أخبرني نافع، عن ابن عمر  رضى الله عنهما  أن الناس، كانوا مع النبي صلى الله عليه وسلم يوم الحديبية، تفرقوا في ظلال الشجر، فإذا الناس محدقون بالنبي صلى الله عليه وسلم فقال يا عبد الله، انظر ما شأن الناس قد أحدقوا برسول الله صلى الله عليه وسلم فوجدهم يبايعون، فبايع ثم رجع إلى عمر فخرج فبايع‏.‏",
      "text_en": "",
      "chain": [
        "30288",
        "20733",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4685",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله، حدثنا سليمان بن عبد الرحمن، وموسى بن هارون، قالا حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء بن زبر، قال حدثني بسر بن عبيد الله، قال حدثني أبو إدريس الخولاني، قال سمعت أبا الدرداء، يقول كانت بين أبي بكر وعمر محاورة، فأغضب أبو بكر عمر، فانصرف عنه عمر مغضبا، فاتبعه أبو بكر يسأله أن يستغفر له، فلم يفعل حتى أغلق بابه في وجهه، فأقبل أبو بكر إلى رسول الله صلى الله عليه وسلم فقال أبو الدرداء ونحن عنده فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما صاحبكم هذا فقد غامر ‏\"‏‏.‏ قال وندم عمر على ما كان منه فأقبل حتى سلم وجلس إلى النبي صلى الله عليه وسلم وقص على رسول الله صلى الله عليه وسلم الخبر‏.‏ قال أبو الدرداء وغضب رسول الله صلى الله عليه وسلم وجعل أبو بكر يقول والله يا رسول الله لأنا كنت أظلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل أنتم تاركو لي صاحبي هل أنتم تاركو لي صاحبي إني قلت يا أيها الناس إني رسول الله إليكم جميعا فقلتم كذبت‏.‏ وقال أبو بكر صدقت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     There was a dispute between Abu Bakr and `Umar, and Abu Bakr made `Umar angry. So `Umar left angrily. Abu Bakr followed him, requesting him to ask forgiveness (of Allah) for him, but `Umar refused to do so and closed his door in Abu Bakr's face. So Abu Bakr went to Allah's Apostle while we were with him. Allah's Apostle said, \"This friend of yours must have quarrelled (with somebody).\" In the meantime `Umar repented and felt sorry for what he had done, so he came, greeted (those who were present) and sat with the Prophet and related the story to him. Allah's Apostle became angry and Abu Bakr started saying, \"O Allah's Apostle! By Allah, I was more at fault (than `Umar).\" Allah's Apostle said, \"Are you (people) leaving for me my companion? (Abu Bakr), Are you (people) leaving for me my companion? When I said, 'O people I am sent to you all as the Apostle of Allah,' you said, 'You tell a lie.' while Abu Bakr said, 'You have spoken the truth .\"",
      "chain": [
        "20025",
        "30587",
        "30218",
        "20733",
        "20399",
        "11412",
        "11027"
      ]
    },
    {
      "hadith_no": "4863",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم التيمي، قال حدثني عروة بن الزبير، قال قلت لعبد الله بن عمرو بن العاص أخبرني بأشد، ما صنع المشركون برسول الله صلى الله عليه وسلم قال بينا رسول الله صلى الله عليه وسلم يصلي بفناء الكعبة، إذ أقبل عقبة بن أبي معيط، فأخذ بمنكب رسول الله صلى الله عليه وسلم ولوى ثوبه في عنقه فخنقه خنقا شديدا، فأقبل أبو بكر فأخذ بمنكبه، ودفع عن رسول الله صلى الله عليه وسلم وقال ‏{‏أتقتلون رجلا أن يقول ربي الله وقد جاءكم بالبينات من ربكم‏}‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked `Abdullah bin `Amr bin Al-`As to inform me of the worst thing the pagans had done to Allah's Apostle. He said: \"While Allah's Apostle was praying in the courtyard of the Ka`ba, `Uqba bin Abi Mu'ait came and seized Allah's Apostle by the shoulder and twisted his garment round his neck and throttled him severely. Abu Bakr came and seized `Uqba's shoulder and threw him away from Allah's Apostle and said, \"Would you kill a man because he says: 'My Lord is Allah,' and has come to you with clear Signs from your Lord?\" (40.28)",
      "chain": [
        "30026",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511"
      ]
    },
    {
      "hadith_no": "5309",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، حدثنا الأوزاعي، قال سألت الزهري أى أزواج النبي صلى الله عليه وسلم استعاذت منه قال أخبرني عروة عن عائشة  رضى الله عنها  أن ابنة الجون لما أدخلت على رسول الله صلى الله عليه وسلم ودنا منها قالت أعوذ بالله منك‏.‏ فقال لها ‏\"‏ لقد عذت بعظيم، الحقي بأهلك ‏\"‏‏.‏ قال أبو عبد الله رواه حجاج بن أبي منيع عن جده عن الزهري أن عروة أخبره أن عائشة قالت‏.‏",
      "text_en": " Narrated Al-Awza:                     I asked Az-Zuhri, \"Which of the wives of the Prophet sought refuge with Allah from him?\" He said \"I was told by 'Ursa that `Aisha said, 'When the daughter of Al-Jaun was brought to Allah's Apostle (as his bride) and he went near her, she said, \"I seek refuge with Allah from you.\" He said, \"You have sought refuge with The Great; return to your family.\"",
      "chain": [
        "30418",
        "20733",
        "20024"
      ]
    },
    {
      "hadith_no": "6233",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني عبد الرحمن بن إبراهيم، حدثنا الوليد، عن الأوزاعي، عن الزهري، عن أبي سلمة، والضحاك، عن أبي سعيد الخدري، قال بينا النبي صلى الله عليه وسلم يقسم ذات يوم قسما فقال ذو الخويصرة  رجل من بني تميم  يا رسول الله اعدل‏.‏ قال ‏\"‏ ويلك من يعدل إذا لم أعدل ‏\"‏‏.‏ فقال عمر ائذن لي فلأضرب عنقه‏.‏ قال ‏\"‏ لا، إن له أصحابا يحقر أحدكم صلاته مع صلاتهم، وصيامه مع صيامهم، يمرقون من الدين كمروق السهم من الرمية، ينظر إلى نصله فلا يوجد فيه شىء، ثم ينظر إلى رصافه فلا يوجد فيه شىء، ثم ينظر إلى نضيه فلا يوجد فيه شىء، ثم ينظر إلى قذذه فلا يوجد فيه شىء، سبق الفرث والدم، يخرجون على حين فرقة من الناس، آيتهم رجل إحدى يديه مثل ثدى المرأة، أو مثل البضعة تدردر ‏\"‏‏.‏ قال أبو سعيد أشهد لسمعته من النبي صلى الله عليه وسلم وأشهد أني كنت مع علي حين قاتلهم، فالتمس في القتلى، فأتي به على النعت الذي نعت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     While the Prophet was distributing (war booty etc.) one day, Dhul Khawaisira, a man from the tribe of Bani Tamim, said, \"O Allah's Apostle! Act justly.\" The Prophets said, \"Woe to you! Who else would act justly if I did not act justly?\" `Umar said (to the Prophet ), \"Allow me to chop his neck off.\" The Prophet said, \"No, for he has companions (who are apparently so pious that) if anyone of (you compares his prayer with) their prayer, he will consider his prayer inferior to theirs, and similarly his fasting inferior to theirs, but they will desert Islam (go out of religion) as an arrow goes through the victim's body (games etc.) in which case if its Nasl is examined nothing will be seen thereon, and if its Nady is examined, nothing will be seen thereon, and if its Qudhadh is examined, nothing will be seen thereon, for the arrow has gone out too fast even for the excretions and blood to smear over it. Such people will come out at the time of difference among the (Muslim) people and the sign by which they will be recognized, will be a man whose one of the two hands will look like the breast of a woman or a lump of flesh moving loosely.\" Abu Sa`id added, \"I testify that I heard that from the Prophet and also testify that I was with `Ali when `Ali fought against those people. The man described by the Prophet was searched for among the killed, and was found, and he was exactly as the Prophet had described him.\" (See Hadith No. 807, Vol. 4)",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11013",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "6235",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا أبو عمرو الأوزاعي، قال حدثني ابن شهاب الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري  رضى الله عنه أن أعرابيا قال يا رسول الله أخبرني عن الهجرة‏.‏ فقال ‏\"‏ ويحك إن شأن الهجرة شديد، فهل لك من إبل ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فهل تؤدي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A bedouin said, \"O Allah's Apostle! Inform me about the emigration.\" The Prophet said, \"Waihaka (May Allah be merciful to you)! The question of emigration is a difficult one. Have you got some camels?\" The bedouin said, \"Yes.\" The Prophet said, \"Do you pay their Zakat?\" He said, \"Yes.\" The Prophet said, \"Go on doing like this from beyond the seas, for Allah will not let your deeds go in vain.\"",
      "chain": [
        "30587",
        "20733",
        "20024",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "6800",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن أبي غسان، محمد بن مطرف عن زيد بن أسلم، عن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة مسلمة، أعتق الله بكل عضو منه عضوا من النار، حتى فرجه بفرجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of his body for freeing the corresponding parts of the slave's body, even his private parts will be saved from the Fire) because of freeing the slave's private parts.\"",
      "chain": [
        "30272",
        "30248",
        "20733",
        "20179",
        "11163",
        "11045",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "6890",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، قال حدثني أبو قلابة الجرمي، عن أنس  رضى الله عنه  قال قدم على النبي صلى الله عليه وسلم نفر من عكل، فأسلموا فاجتووا المدينة، فأمرهم أن يأتوا إبل الصدقة، فيشربوا من أبوالها وألبانها، ففعلوا فصحوا، فارتدوا وقتلوا رعاتها واستاقوا، فبعث في آثارهم فأتي بهم، فقطع أيديهم وأرجلهم وسمل أعينهم، ثم لم يحسمهم حتى ماتوا‏.‏",
      "text_en": " Narrated Anas:                     Some people from the tribe of `Ukl came to the Prophet and embraced Islam. The climate of Medina did not suit them, so the Prophet ordered them to go to the (herd of milch) camels of charity and to drink, their milk and urine (as a medicine). They did so, and after they had recovered from their ailment (became healthy) they turned renegades (reverted from Islam) and killed the shepherd of the camels and took the camels away. The Prophet sent (some people) in their pursuit and so they were (caught and) brought, and the Prophets ordered that their hands and legs should be cut off and that their eyes should be branded with heated pieces of iron, and that their cut hands and legs should not be cauterized, till they die.",
      "chain": [
        "30026",
        "20733",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "6891",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن الصلت أبو يعلى، حدثنا الوليد، حدثني الأوزاعي، عن يحيى، عن أبي قلابة، عن أنس، أن النبي صلى الله عليه وسلم قطع العرنيين ولم يحسمهم حتى ماتوا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet cut off the hands and feet of the men belonging to the tribe of `Uraina and did not cauterise (their bleeding limbs) till they died.",
      "chain": [
        "30211",
        "20733",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "7173",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني بسر بن عبيد الله الحضرمي، أنه سمع أبا إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير، وكنت أسأله عن الشر، مخافة أن يدركني فقلت يا رسول الله إنا كنا في جاهلية وشر فجاءنا الله بهذا الخير، فهل بعد هذا الخير من شر قال ‏\"‏ نعم ‏\"‏‏.‏ قلت وهل بعد ذلك الشر من خير قال ‏\"‏ نعم، وفيه دخن ‏\"‏‏.‏ قلت وما دخنه قال ‏\"‏ قوم يهدون بغير هدى، تعرف منهم وتنكر ‏\"‏‏.‏ قلت فهل بعد ذلك الخير من شر قال ‏\"‏ نعم، دعاة على أبواب جهنم، من أجابهم إليها قذفوه فيها ‏\"‏‏.‏ قلت يا رسول الله صفهم لنا‏.‏ قال ‏\"‏ هم من جلدتنا، ويتكلمون بألسنتنا ‏\"‏‏.‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏‏.‏ قلت فإن لم يكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها، ولو أن تعض بأصل شجرة، حتى يدركك الموت، وأنت على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa bin Al-Yaman:                     The people used to ask Allah's Apostle about the good but I used to ask him about the evil lest I should be overtaken by them. So I said, \"O Allah's Apostle! We were living in ignorance and in an (extremely) worst atmosphere, then Allah brought to us this good (i.e., Islam); will there be any evil after this good?\" He said, \"Yes.\" I said, 'Will there be any good after that evil?\" He replied, \"Yes, but it will be tainted (not pure.)'' I asked, \"What will be its taint?\" He replied, \"(There will be) some people who will guide others not according to my tradition? You will approve of some of their deeds and disapprove of some others.\" I asked, \"Will there be any evil after that good?\" He replied, \"Yes, (there will be) some people calling at the gates of the (Hell) Fire, and whoever will respond to their call, will be thrown by them into the (Hell) Fire.\" I said, \"O Allah s Apostle! Will you describe them to us?\" He said, \"They will be from our own people and will speak our language.\" I said, \"What do you order me to do if such a state should take place in my life?\" He said, \"Stick to the group of Muslims and their Imam (ruler).\" I said, \"If there is neither a group of Muslims nor an Imam (ruler)?\" He said, \"Then turn away from all those sects even if you were to bite (eat) the roots of a tree till death overtakes you while you are in that state.\"",
      "chain": [
        "30170",
        "20733",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "7550",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني عمير بن هانئ، أنه سمع معاوية، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، ما يضرهم من كذبهم، ولا من خالفهم، حتى يأتي أمر الله وهم على ذلك ‏\"‏‏.‏ فقال مالك بن يخامر سمعت معاذا يقول وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشأم‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of my followers will keep on following Allah's Laws strictly and they will not be harmed by those who will disbelieve them or stand against them till Allah's Order (The Hour) will come while they will be in that state.\"",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن ابن جابر، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثنا عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله وأن عيسى عبد الله وابن أمته وكلمته ألقاها إلى مريم وروح منه وأن الجنة حق وأن النار حق أدخله الله من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ubadah b. Samit that the messenger of Allah (may peace be upon him) observed:                      He who said:\" There is no god but Allah, He is One and there is no associate with Him, that Muhammad is his servant and His messenger, that Christ is servant and the son of His slave-girl and he (Christ) His word which He communicated to Mary and is His Spirit, that Paradise is a fact and Hell is a fact,\" Allah would make him (he who affirms these truths enter Paradise through any one of its eight doors which he would like.",
      "chain": [
        "30248",
        "20733",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، ح وحدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، جميعا عن الزهري، بهذا الإسناد أما الأوزاعي وابن جريج ففي حديثهما قال أسلمت لله ‏.‏ كما قال الليث في حديثه ‏.‏ وأما معمر ففي حديثه فلما أهويت لأقتله قال لا إله إلا الله ‏.‏",
      "text_en": " The same hadith has been transmitted by the same chain of narrators. The hadith transmitted by Auza'i and Ibn Juraij contains these words:                      I embraced Islam for Allah's sake. and in the hadith narrated by Ma'mar the words are: I knelt down to kill him, that he said; There is no god but Allah.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "30410",
        "20733",
        "20024",
        "30375",
        "20121"
      ]
    },
    {
      "hadith_no": "411",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا زهير بن حرب، حدثني الوليد بن مسلم، حدثنا ابن أبي ذئب، عن ابن شهاب، عن نافع، مولى أبي قتادة عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كيف أنتم إذا نزل فيكم ابن مريم فأمكم منكم ‏\"‏ ‏.‏ فقلت لابن أبي ذئب إن الأوزاعي حدثنا عن الزهري عن نافع عن أبي هريرة ‏\"‏ وإمامكم منكم ‏\"‏ ‏.‏ قال ابن أبي ذئب تدري ما أمكم منكم قلت تخبرني ‏.‏ قال فأمكم بكتاب ربكم تبارك وتعالى وسنة نبيكم صلى الله عليه وسلم ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      What would you do when the son of Mary would descend amongst you and would lead you as one amongst you? Ibn Abi Dhi'b on the authority of Abu Huraira narrated: Your leader amongst you. Ibn Abi Dhi'b said: Do you know what the words:\" He would lead as one amongst you\" mean? I said: Explain these to me. He said: He would lead you according to the Book of your: Lord (hallowed be He and most exalted) and the Sunnah of your Apostle (may peace be upon him).",
      "chain": [
        "30022",
        "20733",
        "20177",
        "11013",
        "11224",
        "13"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال سمعت يحيى، يقول سألت أبا سلمة أى القرآن أنزل قبل قال يا أيها المدثر ‏.‏ فقلت أو اقرأ ‏.‏ فقال سألت جابر بن عبد الله أى القرآن أنزل قبل قال يا أيها المدثر ‏.‏ فقلت أو اقرأ قال جابر أحدثكم ما حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ جاورت بحراء شهرا فلما قضيت جواري نزلت فاستبطنت بطن الوادي فنوديت فنظرت أمامي وخلفي وعن يميني وعن شمالي فلم أر أحدا ثم نوديت فنظرت فلم أر أحدا ثم نوديت فرفعت رأسي فإذا هو على العرش في الهواء - يعني جبريل عليه السلام - فأخذتني رجفة شديدة فأتيت خديجة فقلت دثروني ‏.‏ فدثروني فصبوا على ماء فأنزل الله عز وجل ‏{‏ يا أيها المدثر * قم فأنذر * وربك فكبر * وثيابك فطهر‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Yahya reported:                      I asked Abu Salama what was revealed first from the Qur'an. He said:\" 0, the shrouded one.\" I said: Or\" Recite.\" Jabir said: I am narrating to you what was narrated to us by the Messenger of Allah (may peace be upon him). He said: I stayed in Hira' for one month and when my stay was completed, I come down and went into the heart of the valley. Somebody called me aloud. I looked in front of me, behind me, on the right of my side and on my left, but I did not see any body. I was again called and I looked about but saw nothing. I was called again and raised my head, and there on the Throne in the open atmosphere he, i. e. Gabriel (peace be upon him) was sitting. I began to tremble on account of fear. I came to Khadija and said: Wrap me up. They wrapped me up and threw water on me and Allah, the Exalted and Glorious, sent down this: you who are shrouded! arise and deliver warning, your Lord magnify, your clothes cleanse.\"",
      "chain": [
        "30022",
        "20733",
        "20024",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "392",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، أن أبا هريرة، كان يكبر في الصلاة كلما رفع ووضع ‏.‏ فقلنا يا أبا هريرة ما هذا التكبير قال إنها لصلاة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Salama reported that Abu Huraira recited takbir in prayer on all occasions of rising and kneeling. We said:                      O Abu Huraira, what is this takbir? He said: Verily it is the prayer of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30383",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن عبدة، أن عمر بن الخطاب، كان يجهر بهؤلاء الكلمات يقول سبحانك اللهم وبحمدك تبارك اسمك وتعالى جدك ولا إله غيرك ‏.‏ وعن قتادة أنه كتب إليه يخبره عن أنس بن مالك أنه حدثه قال صليت خلف النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان فكانوا يستفتحون ب ‏{‏ الحمد لله رب العالمين‏}‏ لا يذكرون بسم الله الرحمن الرحيم في أول قراءة ولا في آخرها ‏.‏",
      "text_en": " 'Abda reported:                      'Umar b. al-Khattab used to recite loudly these words: Subhanak Allahumma wa bi hamdika wa tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuka [Glory to Thee,0 Allah, and Thine is the Praise, and Blessed is Thy Name. and Exalted is Thy Majesty. and there is no other object of worship beside Thee]. Qatada informed in writing that Anas b. Malik had narrated to him: I observed prayer behind the Apostle of Allah (may peace be upon him) and Abu Bakr and Umar and 'Uthman. They started (loud recitation) with: AI-hamdu lillahi Rabb al-'Alamin [All Praise is due to Allah, the Lord of the worlds] and did not recite Bismillah ir- Rahman-ir-Rahim (loudly) at the beginning of the recitation or at the end of it.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "20337",
        "3",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن مهران، حدثنا الوليد بن مسلم، عن الأوزاعي، أخبرني إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يذكر ذلك ‏.‏",
      "text_en": " It is reported on the authority of Abu Talha that he had heard Anas b. Malik narrating this.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "11151"
      ]
    },
    {
      "hadith_no": "454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن سعيد، - وهو ابن عبد العزيز - عن عطية بن قيس، عن قزعة، عن أبي سعيد الخدري، قال لقد كانت صلاة الظهر تقام فيذهب الذاهب إلى البقيع فيقضي حاجته ثم يتوضأ ثم يأتي ورسول الله صلى الله عليه وسلم في الركعة الأولى مما يطولها ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The noon prayer would start and one would go to al-Baqi' and after having relieved himself he would perform ablution and then come, while the Messenger of Allah (may peace be upon him) would be in the first rak'ah, because he would prolong it so much.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "10877",
        "38"
      ]
    },
    {
      "hadith_no": "488",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني زهير بن حرب، حدثنا الوليد بن مسلم، قال سمعت الأوزاعي، قال حدثني الوليد بن هشام المعيطي، حدثني معدان بن أبي طلحة اليعمري، قال لقيت ثوبان مولى رسول الله صلى الله عليه وسلم فقلت أخبرني بعمل أعمله يدخلني الله به الجنة ‏.‏ أو قال قلت بأحب الأعمال إلى الله ‏.‏ فسكت ثم سألته فسكت ثم سألته الثالثة فقال سألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ عليك بكثرة السجود لله فإنك لا تسجد لله سجدة إلا رفعك الله بها درجة وحط عنك بها خطيئة ‏\"‏ ‏.‏ قال معدان ثم لقيت أبا الدرداء فسألته فقال لي مثل ما قال لي ثوبان ‏.‏",
      "text_en": " Ma'dan b. Talha reported:                      I met Thauban, the freed slave. of Allah's Messenger (may peace be upon him), and asked him to tell me about an act for which, if I do it, Allah will admit me to Paradise, or I asked about the act which was loved most by Allah. He gave no reply. I again asked and he gave no reply. I asked him for the third time, and he said: I asked Allah's Messenger (may peace be upon him) about that and he said: Make frequent prostrations before Allah, for you will not make one prostration without raising you a degree because of it, and removing a sin from you, because of it. Ma'dan said that then lie met Abu al-Darda' and when he asked him, he received a reply similar to that given by Thauban.",
      "chain": [
        "30022",
        "20733",
        "20024",
        "10977",
        "10878"
      ]
    },
    {
      "hadith_no": "1354",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني زهير بن حرب، حدثنا الوليد بن مسلم، حدثني الأوزاعي، حدثنا حسان بن عطية، حدثني محمد بن أبي عائشة، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فرغ أحدكم من التشهد الآخر فليتعوذ بالله من أربع من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر المسيح الدجال ‏\"‏ ‏.‏  وحدثنيه الحكم بن موسى، حدثنا هقل بن زياد، ح قال وحدثنا علي بن خشرم، أخبرنا عيسى، - يعني ابن يونس - جميعا عن الأوزاعي، بهذا الإسناد وقال ‏\"‏ إذا فرغ أحدكم من التشهد ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ الآخر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When any one of you completes the last tashahhud. he should seek refuge with Allah from four (trials). I.e. from the torment of Hell, from the torment of grave, from the trial of life and death, and from the mischief of Masih at-Dajjal (Antichrist). This hadith has been narrated by al-Auza'i with the same chain of transmitters but with these words:\" When any one of you completes the tashahhud\" and he made no mention of the words\" the last\".",
      "chain": [
        "30022",
        "20733",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، عن الأوزاعي، عن أبي عمار، - اسمه شداد بن عبد الله - عن أبي أسماء، عن ثوبان، قال كان رسول الله صلى الله عليه وسلم إذا انصرف من صلاته استغفر ثلاثا وقال ‏\"‏ اللهم أنت السلام ومنك السلام تباركت ذا الجلال والإكرام ‏\"‏ ‏.‏ قال الوليد فقلت للأوزاعي كيف الاستغفار قال تقول أستغفر الله أستغفر الله ‏.‏",
      "text_en": " Thauban reported:                      When the Messenger of Allah (may peace be upon him) finished his prayer. he begged forgiveness three times and said: O Allah! Thou art Peace, and peace comes from Thee; Blessed art Thou, O Possessor of Glory and Honour. Walid reported: I said to Auza'i: How Is the seeking of forgiveness? He replied: You should say:, I beg forgiveness from Allah, 1 beg forgiveness from Allah.\"",
      "chain": [
        "30248",
        "20733",
        "20024",
        "130"
      ]
    },
    {
      "hadith_no": "1398",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني زهير بن حرب، حدثنا الوليد بن مسلم، حدثنا أبو عمرو، - يعني الأوزاعي - حدثنا الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة وصف الناس صفوفهم وخرج رسول الله صلى الله عليه وسلم فقام مقامه فأومأ إليهم بيده أن ‏\"‏ مكانكم ‏\"‏ ‏.‏ فخرج وقد اغتسل ورأسه ينطف الماء فصلى بهم ‏.‏",
      "text_en": " Abu Salama reported Abu Huraira as saying:                      Iqama was pronounced. ant the people had formed themselves into rows. The Messenger of Allah (may peace be upon him) came out and stood at his place, and then pointed out with his hand that we should stand at our places. He then went away and took a bath and water trickled from his head and then led them in prayer.",
      "chain": [
        "30022",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إبراهيم بن موسى، أخبرنا الوليد بن مسلم، عن الأوزاعي، عن الزهري، قال حدثني أبو سلمة، عن أبي هريرة، أن الصلاة، كانت تقام لرسول الله صلى الله عليه وسلم فيأخذ الناس مصافهم قبل أن يقوم النبي صلى الله عليه وسلم مقامه ‏.‏",
      "text_en": " Abu Salama reported on the authority of Abu Huraira that when Iqama was pronounced for the Messenger of Allah (may peace be upon him), the people occupied their places in the rows before the Apostle of Allah (way peace be upon him) stood up at his place.",
      "chain": [
        "30309",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1446",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن أبي النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي العصر مع رسول الله صلى الله عليه وسلم ثم تنحر الجزور فتقسم عشر قسم ثم تطبخ فنأكل لحما نضيجا قبل مغيب الشمس ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      We used to say the afternoon prayer with the Messenger of Allah (may peace be upon him), and then the camel was slaughtered and ten parts of it were distributed; then it was cooked and then we ate this cooked meat before the sinking of the sun.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    }
  ],
  "total_hadiths": 356
}