{
  "id": "20738",
  "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
  "full_name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "202",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  4  -  صدوق له أوهام ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28069",
      "name": "Bilal bin Ka'b al-Ky بلال بن كعب العكي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24155",
      "name": "al-Sry bin Yahya bin Iyas السري بن يحيى بن إياس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18414",
      "name": "Sharyh bin 'Ubaid شريح بن عبيد بن شريح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19154",
      "name": "Yahya bin Abi 'Amr يحيى بن أبي عمرو السيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20715",
      "name": "'Abdullah bin Shwdhb عبد الله بن شوذب الخراساني أبو عبد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28391",
      "name": "'Uthman bin 'Ata' bin Abi Muslim عثمان بن عطاء",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "38062",
      "name": "Ahmed bin Hashim bin Aby أحمد بن هاشم بن أبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38177",
      "name": "al-Husain bin Abi Sari الحسين بن أبي السري العسقلاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34144",
      "name": "'Ubaidullah bin al-Jhm عبيد الله بن الجهم الأنماطي البصري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38429",
      "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38443",
      "name": "'Isa bin Muhammad bin al-Nahas عيسى بن محمد بن النحاس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31463",
      "name": "Ahmed bin al-Farj bin Sulaiman أحمد بن الفرج بن سليمان",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2535",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا أسد بن موسى، حدثنا معاوية بن صالح، حدثني ضمرة، أن ابن زغب الإيادي، حدثه قال ‏:‏ نزل على عبد الله بن حوالة الأزدي فقال لي ‏:‏ بعثنا رسول الله صلى الله عليه وسلم لنغنم على أقدامنا فرجعنا فلم نغنم شيئا وعرف الجهد في وجوهنا فقام فينا فقال ‏:‏ ‏\"‏ اللهم لا تكلهم إلى فأضعف عنهم، ولا تكلهم إلى أنفسهم فيعجزوا عنها، ولا تكلهم إلى الناس فيستأثروا عليهم ‏\"‏ ‏.‏ ثم وضع يده على رأسي - أو قال ‏:‏ على هامتي - ثم قال ‏:‏ ‏\"‏ يا ابن حوالة إذا رأيت الخلافة قد نزلت أرض المقدسة فقد دنت الزلازل والبلابل والأمور العظام، والساعة يومئذ أقرب من الناس من يدي هذه من رأسك ‏\"‏ ‏.‏ قال أبو داود ‏:‏ عبد الله بن حوالة حمصي ‏.‏",
      "text_en": " Narrated Abdullah ibn Hawalah al-Azdi:                     The Messenger of Allah (ﷺ) sent us on foot to get spoil, but we returned without getting any. When he saw the signs of distress on our faces, he stood up on our faces and said: O Allah, do not put them under my care, for I would be too weak to care for them; do not put them in care of themselves, for they would be incapable of that, and do not put them in the care of men, for they would choose the best things for themselves. He then placed his hand on my head and said: Ibn Hawalah, when you see the caliphate has settled in the holy land, earthquakes, sorrows and serious matters will have drawn near and on that day the Last Hour will be nearer to mankind than this hand of mine is to your head.Abu Dawud said: 'Abd Allah b. Hawalah belongs to Hims.",
      "chain": [
        "30226",
        "28040",
        "20675",
        "20738"
      ]
    },
    {
      "hadith_no": "3710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عيسى بن محمد، حدثنا ضمرة، عن السيباني، عن عبد الله بن الديلمي، عن أبيه، قال أتينا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله قد علمت من نحن ومن أين نحن فإلى من نحن قال ‏\"‏ إلى الله وإلى رسوله ‏\"‏ ‏.‏ فقلنا يا رسول الله إن لنا أعنابا ما نصنع بها قال ‏\"‏ زببوها ‏\"‏ ‏.‏ قلنا ما نصنع بالزبيب قال ‏\"‏ انبذوه على غدائكم واشربوه على عشائكم وانبذوه على عشائكم واشربوه على غدائكم وانبذوه في الشنان ولا تنبذوه في القلل فإنه إذا تأخر عن عصره صار خلا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ad-Daylami:                     We came to the Prophet (ﷺ) and said to him: Messenger of Allah, you know who we are, from where we are and to whom we have come. He said: To Allah and His Apostle. We said: Messenger of Allah, we have grapes; what should we do with them? He said: Make them raisins. We then asked: What should we do with raisins? He replied: Steep them in the morning and drink in the evening, and steep them in the evening and drink in the morning. Steep them in skin vessels and do not steep them in earthen jar, for it it is delayed in pressing, it becomes vinegar.",
      "chain": [
        "20738",
        "19340",
        "5136",
        "5229"
      ]
    },
    {
      "hadith_no": "3964",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عيسى بن محمد الرملي، حدثنا ضمرة، عن إبراهيم بن أبي عبلة، عن الغريف بن الديلمي، قال أتينا واثلة بن الأسقع فقلنا له حدثنا حديثا، ليس فيه زيادة ولا نقصان فغضب وقال إن أحدكم ليقرأ ومصحفه معلق في بيته فيزيد وينقص ‏.‏ قلنا إنما أردنا حديثا سمعته من النبي صلى الله عليه وسلم ‏.‏ قال أتينا رسول الله صلى الله عليه وسلم في صاحب لنا أوجب - يعني - النار بالقتل فقال ‏\"‏ أعتقوا عنه يعتق الله بكل عضو منه عضوا منه من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Wathilah ibn al-Asqa:                     Al-Arif ibn ad-Daylami said: We went to Wathilah ibn al-Asqa and said to him: Tell us a tradition which has not addition or omission. He became angry and replied: One of you recites when his copy of a Qur'an is hung up in his house, and he makes additions and omissions. We said: All we mean is a tradition you have heard from the Messenger of Allah (ﷺ). He said: We went to the Prophet (ﷺ) about a friend of ours who deserved. Hell for murder. He said: Emancipate a slave on his behalf; Allah will set free from Hell a member of the body for every member of his.",
      "chain": [
        "38443",
        "20738",
        "11667"
      ]
    },
    {
      "hadith_no": "4302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عيسى بن محمد الرملي، حدثنا ضمرة، عن السيباني، عن أبي سكينة، - رجل من المحررين - عن رجل، من أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ دعوا الحبشة ما ودعوكم واتركوا الترك ما تركوكم ‏\"‏ ‏.‏",
      "text_en": " Narrated from Abi Sukainah One of the Companions:                     The Prophet (ﷺ) said: Let the Abyssinians alone as long as they let you alone, and let the Turks alone as long as they leave you alone.",
      "chain": [
        "38443",
        "20738",
        "19340"
      ]
    },
    {
      "hadith_no": "4322",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عيسى بن محمد، حدثنا ضمرة، عن السيباني، عن عمرو بن عبد الله، عن أبي أمامة، عن النبي صلى الله عليه وسلم نحوه وذكر الصلوات مثل معناه ‏.‏",
      "text_en": " A similar tradition has been transmitted by Abu Umamah from the prophet (ﷺ) through a different chain of narrators. In this version he mentioned the prayers to the same effect.",
      "chain": [
        "20738",
        "19340",
        "405"
      ]
    },
    {
      "hadith_no": "4066",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا الحسن بن واقع الرملي، حدثنا ضمرة بن ربيعة، عن عبد الله بن شوذب، عن عبد الله بن القاسم، عن كثير، مولى عبد الرحمن بن سمرة عن عبد الرحمن بن سمرة، قال جاء عثمان إلى النبي صلى الله عليه وسلم بألف دينار - قال الحسن بن واقع وكان في موضع آخر من كتابي في كمه حين جهز جيش العسرة فنثرها في حجره ‏.‏ قال عبد الرحمن فرأيت النبي صلى الله عليه وسلم يقلبها في حجره ويقول ‏\"‏ ما ضر عثمان ما عمل بعد اليوم ‏\"‏ ‏.‏ مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Samurah:                     that 'Uthman went to the Prophet (ﷺ) with one-thousand Dinar\" - Al-Hasan bin Waqi (one of the narrators) said: \"And in another place in my book: 'In his garment when the 'army of distress' was being prepared. So he poured them into his lap.'\" - 'Abdur-Rahman said: \"So I saw the Prophet (ﷺ) turning them over in his lap, saying: 'Whatever 'Uthman does after today will not harm him,' two times.\"",
      "chain": [
        "34188",
        "20738",
        "20715",
        "18563",
        "955"
      ]
    },
    {
      "hadith_no": "2688",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عيسى بن محمد أبو عمير، عن ضمرة، عن الأوزاعي، عن الزهري، عن عروة، عن عائشة، قالت طيبت رسول الله صلى الله عليه وسلم لإحلاله وطيبته لإحرامه طيبا لا يشبه طيبكم هذا تعني ليس له بقاء ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I put perfume on the Messenger of Allah for his exiting Ihram, and I put perfume on him for his Ihram, perfume which was not like this perfume of yours\" she meant that it does not last.(Shah)",
      "chain": [
        "20738",
        "20024",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3176",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عيسى بن يونس، قال حدثنا ضمرة، عن أبي زرعة السيباني، عن أبي سكينة، - رجل من المحررين - عن رجل، من أصحاب النبي صلى الله عليه وسلم قال لما أمر النبي صلى الله عليه وسلم بحفر الخندق عرضت لهم صخرة حالت بينهم وبين الحفر فقام رسول الله صلى الله عليه وسلم وأخذ المعول ووضع رداءه ناحية الخندق وقال ‏\"‏ ‏{‏ تمت كلمة ربك صدقا وعدلا لا مبدل لكلماته وهو السميع العليم ‏}‏ ‏\"‏ ‏.‏ فندر ثلث الحجر وسلمان الفارسي قائم ينظر فبرق مع ضربة رسول الله صلى الله عليه وسلم برقة ثم ضرب الثانية وقال ‏\"‏ ‏{‏ تمت كلمة ربك صدقا وعدلا لا مبدل لكلماته وهو السميع العليم ‏}‏ ‏\"‏ ‏.‏ فندر الثلث الآخر فبرقت برقة فرآها سلمان ثم ضرب الثالثة وقال ‏\"‏ ‏{‏ تمت كلمة ربك صدقا وعدلا لا مبدل لكلماته وهو السميع العليم ‏}‏ ‏\"‏ ‏.‏ فندر الثلث الباقي وخرج رسول الله صلى الله عليه وسلم فأخذ رداءه وجلس ‏.‏ قال سلمان يا رسول الله رأيتك حين ضربت ما تضرب ضربة إلا كانت معها برقة ‏.‏ قال له رسول الله صلى الله عليه وسلم ‏\"‏ يا سلمان رأيت ذلك ‏\"‏ ‏.‏ فقال إي والذي بعثك بالحق يا رسول الله ‏.‏ قال ‏\"‏ فإني حين ضربت الضربة الأولى رفعت لي مدائن كسرى وما حولها ومدائن كثيرة حتى رأيتها بعينى ‏\"‏ ‏.‏ قال له من حضره من أصحابه يا رسول الله ادع الله أن يفتحها علينا ويغنمنا ديارهم ويخرب بأيدينا بلادهم ‏.‏ فدعا رسول الله صلى الله عليه وسلم بذلك ‏\"‏ ثم ضربت الضربة الثانية فرفعت لي مدائن قيصر وما حولها حتى رأيتها بعينى ‏\"‏ ‏.‏ قالوا يا رسول الله ادع الله أن يفتحها علينا ويغنمنا ديارهم ويخرب بأيدينا بلادهم ‏.‏ فدعا رسول الله صلى الله عليه وسلم بذلك ‏\"‏ ثم ضربت الثالثة فرفعت لي مدائن الحبشة ‏.‏ وما حولها من القرى حتى رأيتها بعينى ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ دعوا الحبشة ما ودعوكم واتركوا الترك ما تركوكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sukainah, a man from among the Muharririn,[1] that a man among the Companions of the the Prophet (ﷺ) said:                      \"When the Prophet (ﷺ) commanded them to dig the trench (Al-Khandaq), there was a rock in their way preventing them from digging. The Messenger of Allah (ﷺ) stood, picked up a pickaxe, put his Rida' (upper garment) at the edge of the ditch and said: 'And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.' [1] One-third of the rock broke off while Salman Al-Farisi was standing there watching, and there was a flash of light when the Messenger of Allah (ﷺ)struck (the rock). Then he struck it again and said: 'And the Word of your Lord has been fulfilled in truth and in justice. Nonce can change His Words. Ans He is the All-Hearer, the All-Knower' And another third of the rock broke off and there was another flash of light, which Salman saw. Then he struck (the rock) a third time and said: 'And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.' The last third fell, and the Messenger of Allah (ﷺ) came out, picked up his Rida' and sat down. Salman said: 'O Messenger of Allah, Each time you struck the rock there was a flash of light.' The Messenger of Allah (ﷺ) said to him: 'O Salman, did you see that?' He said: 'Yes, by the One Who sent you with the truth, O Messenger of Allah.' He said: 'When I struck the first blow, the cities of Kisra and their environs were shown to me, and many other cities, and I saw them with my own eyes.' Those of his Companions who were present said: 'O Messenger of Allah, pray to Allah to grant us victory and to give us their land as spoils of war, and to destroy their lands at our hands.' So the Messenger of Allah (ﷺ) prayed for that. (Then he said:) 'Then I struck the second blow and the cities of Caesar and their environs were shown to me, and I saw them with my own eyes.' They said: 'O Messenger of Allah, pray to Allah to grant us victory and to give us their lands as spoils of war, and to destroy their lands at our hands.' So the Messenger of Allah (ﷺ) prayed for that. (Then he said:) 'Then I struck the third blow and the cities of Ethiopia were shown to me, and the villages around them, and I saw them with my own eyes.' But the Messenger of Allah (ﷺ) said at that point: 'Leave the Ethiopians alone so long as they leave you alone, and leave the Turks alone so long as they leave you alone.'\"[1] An-An'am 6:115.",
      "chain": [
        "20347",
        "20738"
      ]
    },
    {
      "hadith_no": "3877",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عيسى بن محمد، - وهو أبو عمير بن النحاس - وعيسى بن يونس - هو الفاخوري - قالا حدثنا ضمرة، عن ابن شوذب، عن مطر، عن عطاء، عن جابر بن عبد الله، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏‏\"‏‏ من كانت له أرض فليزرعها أو ليزرعها ولا يؤاجرها ‏‏\"‏‏‏.‏‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                      \"The Messenger of Allah addressed us and said: 'Whoever has land, let him cultivate it or give it to someone else to cultivate, and let him not rent it out.'\"",
      "chain": [
        "20738",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4730",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عيسى بن يونس، قال حدثنا ضمرة، عن عبد الله بن شوذب، عن ثابت البناني، عن أنس بن مالك، أن رجلا، أتى بقاتل وليه رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى فقال ‏\"‏ خذ الدية ‏\"‏ ‏.‏ فأبى قال ‏\"‏ اذهب فاقتله فإنك مثله ‏\"‏ ‏.‏ فذهب فلحق الرجل فقيل له إن رسول الله صلى الله عليه وسلم قال ‏\"‏ اقتله فإنك مثله ‏\"‏ ‏.‏ فخلى سبيله فمر بي الرجل وهو يجر نسعته ‏.‏",
      "text_en": " It was narrated from Ans bin Malik that a man brought the killer of his kinsman to the Messenger of Allah and the Prophet said:                     \"Forgive him.\" But he refused. He said: \"Take the Diyah,\" but he refused. He said: \"Go and kill him then, for you are just like him.\" So he went away, but some people caught up with the man and told him that the Messenger of Allah had said: \"Messenger of Allah had said: \"Kill him for you are just like him.\" So he let him go, and the man passed by me dragging his string.",
      "chain": [
        "20347",
        "20738",
        "20715",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4805",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عيسى بن يونس، قال حدثنا ضمرة، عن إسماعيل بن عياش، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عقل المرأة مثل عقل الرجل حتى يبلغ الثلث من ديتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said: 'The blood money of a woman (in the event of injury) is like the blood money of a man, up to one-third of the Diyah (for her life).\"",
      "chain": [
        "20347",
        "20738",
        "20736",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "5736",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عيسى بن محمد أبو عمير بن النحاس، عن ضمرة، عن الشيباني، عن ابن الديلمي، عن أبيه، قال قلنا يا رسول الله إن لنا أعنابا فماذا نصنع بها قال ‏\"‏ زببوها ‏\"‏ ‏.‏ قلنا فما نصنع بالزبيب قال ‏\"‏ انبذوه على غدائكم واشربوه على عشائكم وانبذوه على عشائكم واشربوه على غدائكم وانبذوه في الشنان ولا تنبذوه في القلال فإنه إن تأخر صار خلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Al-Dailami that his father said:                     \"We said: 'O Messenger of Allah, we have grapevines; what should we do with them?' He said: 'Make raisins.' We said: 'What should we do with the raisins?' He said: 'Soak them in the morning and drink them in the evening, and soak them in the evening and drink them in the morning.' I said: 'Can we leave it until it gets stronger?' He said: 'Do not put it in clay vessels, rather put it in skins, for if it stays there for a long time, it will turn into vinegar.'\"",
      "chain": [
        "20738",
        "11352",
        "5136",
        "5229"
      ]
    },
    {
      "hadith_no": "2149",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا حيوة بن شريح الحضرمي، عن ضمرة بن ربيعة، عن ابن عطاء، عن أبيه، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ أربع من النساء لا ملاعنة بينهن النصرانية تحت المسلم واليهودية تحت المسلم والحرة تحت المملوك والمملوكة تحت الحر ‏\"‏ ‏.‏",
      "text_en": " It was nanated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     the Prophet (ﷺ) said: \"There are four kinds of women for whom there is no Li'an: a Christian woman married to a Muslim, a Jewish woman married to a Muslim, a free woman married to a slave, and a slave woman married to a free man.\"",
      "chain": [
        "11222",
        "26010",
        "20738",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2548",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا ضمرة بن ربيعة، عن ابن شوذب، عن مطر، عن عطاء، عن جابر بن عبد الله، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ من كانت له أرض فليزرعها أو ليزرعها ولا يؤاجرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     “The Messenger of Allah (ﷺ) addressed us and said: 'Whoever has land, let him cultivate it or allow someone else to cultivate it, and not rent it out.' ”",
      "chain": [
        "10581",
        "20738",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2621",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا راشد بن سعيد الرملي، وعبيد الله بن الجهم الأنماطي، قالا حدثنا ضمرة بن ربيعة، عن سفيان، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ملك ذا رحم محرم فهو حر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Umar that the Messenger of Allah (ﷺ) said:                     “Whoever becomes the master of a Mahram relative, he becomes free.”",
      "chain": [
        "34144",
        "20738",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "2793",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو عمير، عيسى بن محمد النحاس وعيسى بن يونس والحسين بن أبي السري العسقلاني قالوا حدثنا ضمرة بن ربيعة، عن ابن شوذب، عن ثابت البناني، عن أنس بن مالك، قال أتى رجل بقاتل وليه إلى رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اعف ‏\"‏ ‏.‏ فأبى فقال ‏\"‏ خذ أرشك ‏\"‏ ‏.‏ فأبى ‏.‏ قال ‏\"‏ اذهب فاقتله فإنك مثله ‏\"‏ ‏.‏ قال فلحق به فقيل له إن رسول الله صلى الله عليه وسلم قد قال ‏\"‏ اقتله فإنك مثله ‏\"‏ ‏.‏ فخلى سبيله ‏.‏ قال فرئي يجر نسعته ذاهبا إلى أهله ‏.‏ قال كأنه قد كان أوثقه ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “A man brought the killer of his relative to the Messenger of Allah (ﷺ) and the Messenger of Allah (ﷺ) said: 'Pardon him,' but the refused. He said: 'Take the blood money,' but he refused. He said: 'Go and kill him, but then you will be like him.’ Someone caught up with him and reminded him that the Messenger of Allah (ﷺ) had said: 'Go and kill him, but then you will be like him.’ So he let him go.",
      "chain": [
        "20738",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3332",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عمير، عيسى بن محمد النحاس وعيسى بن يونس الرملي قالا حدثنا ضمرة بن ربيعة، عن الأوزاعي، عن يحيى بن سعيد، عن سعيد بن المسيب، عن أبي ثعلبة الخشني، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ كل ما ردت عليك قوسك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Tha’labah that the Prophet (ﷺ) said:                      “Eatwhat your bow brings you.”",
      "chain": [
        "20738",
        "20024",
        "11062",
        "11002",
        "4056"
      ]
    },
    {
      "hadith_no": "3463",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو عمير، عيسى بن محمد بن النحاس الرملي حدثنا ضمرة بن ربيعة، عن ابن عطاء، عن أبيه، قال زار أبو هريرة قومه بيبنا فأتوه برقاق من رقاق الأول فبكى وقال ما رأى رسول الله  صلى الله عليه وسلم  هذا بعينه قط ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Ata that his father said:                      “Abu Hurairahvisited his people, meaning, a village” – I (one of thenarrators)think he said: “Yuna” – “And they brought him someof the first thinloaves of bread. He wept and said: ‘The Messengerof Allah (ﷺ) neversaw such a thing with his own eyes.’”",
      "chain": [
        "20738"
      ]
    }
  ],
  "total_hadiths": 18
}