{
  "id": "20732",
  "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
  "full_name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "116",
      "date_gregorian": "NA",
      "date_display": [
        "116 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus",
      "Beruit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "B.Umayya",
      "Client",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20399",
      "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20710",
      "name": "Sa'id bin Basahyr al-Azdi سعيد بن بشير الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27506",
      "name": "Khalid bin D'hqan al-Quraishi خالد بن دهقان القرشي مولاهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28325",
      "name": "'Abdur Rahman bin Hsan عبد الرحمن بن حسان الكناني أبو سعيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27500",
      "name": "Ibrahim bin Sulaiman al-Afts إبراهيم بن سليمان الأفطس الدمشقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "12740",
      "name": "S'aid bin 'Abdur Rahman bin Raqaysh سعيد بن عبد الرحمن بن رقيش المدني",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "27530",
      "name": "'Uthman bin Abi al-Atk'h عثمان بن أبي العاتكة سليمان الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20401",
      "name": "Mua'wiya bin Salam",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12391",
      "name": "'Umar bin 'Abdullah عمر بن عبد الله المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11674",
      "name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19154",
      "name": "Yahya bin Abi 'Amr يحيى بن أبي عمرو السيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19947",
      "name": "al-Mughira bin Ziyad al-Bjly المغيرة بن زياد البجلي أبو هشام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19894",
      "name": "Yahya bin al-Harith al-Dhamari يحيى بن الحارث الذماري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "17545",
      "name": "al-Nu'man bin al-Mndhr al-Ghsany النعمان بن المنذر الغساني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30283",
      "name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30587",
      "name": "Sulaiman bin 'Abdur Rahman سليمان بن عبد الرحمن بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37511",
      "name": "Safwan bin Salah bin Safwan صفوان بن صالح بن صفوان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38589",
      "name": "Muhammad bin Masfa bin Bahlwal محمد بن مصفى بن بهلول",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38613",
      "name": "Muhammad bin Hashim bin Sa'id محمد بن هاشم بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38659",
      "name": "Mu'ml bin al-Fadl مؤمل بن الفضل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38662",
      "name": "Nsr bin 'Asim al-Antaky نصر بن عاصم الأنطاكي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30288",
      "name": "Hisham bin 'Ammar bin Nasayr هشام بن عمار بن نصير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "36610",
      "name": "'Isa bin Msawr al-Jwhry عيسى بن مساور الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38366",
      "name": "Abd'h bin Abd al-Rhym عبدة بن عبد الرحيم بن حسان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30029",
      "name": "Muhammad bin 'Abdullah bin 'Ammar محمد بن عبد الله بن عمار",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "337",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا محمد بن شعيب، أخبرني الأوزاعي، أنه بلغه عن عطاء بن أبي رباح، أنه سمع عبد الله بن عباس، قال أصاب رجلا جرح في عهد رسول الله صلى الله عليه وسلم ثم احتلم فأمر بالاغتسال فاغتسل فمات فبلغ رسول الله صلى الله عليه وسلم فقال ‏\"‏ قتلوه قتلهم الله ألم يكن شفاء العي السؤال ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man was injured during the lifetime of the Messenger of Allah (ﷺ); he then had a sexual dream, and he was advised to wash and he washed himself. Consequently he died. When this was reported to the Messenger of Allah (ﷺ) he said: They killed him; may Allah kill them! Is not inquiry the cure of ignorance?",
      "chain": [
        "38662",
        "20732",
        "20024",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يزيد بن محمد الدمشقي، حدثنا هشام بن إسماعيل، حدثنا محمد بن شعيب، أخبرنا عبد الله بن العلاء بن زبر، عن سالم بن عبد الله، عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم صلى صلاة فقرأ فيها فلبس عليه فلما انصرف قال لأبى ‏\"‏ أصليت معنا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فما منعك ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar said :                      The Prophet (ﷺ) prayed and recited the Qur’an in it. He wa then confused in it (in his recitation). When he finished (his prayer), he said to Ubayy(b. Ka’b): Did you pray along with us? He said: yes. He said: What prevented you(from correcting me)?",
      "chain": [
        "37539",
        "20732",
        "20399",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1228",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا محمود بن خالد، حدثنا محمد بن شعيب، عن النعمان بن المنذر، عن عطاء بن أبي رباح، أنه سأل عائشة - رضى الله عنها - هل رخص للنساء أن يصلين على الدواب قالت لم يرخص لهن في ذلك في شدة ولا رخاء ‏.‏ قال محمد هذا في المكتوبة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Ata' ibn AbuRabah asked Aisha: Can women offer prayer on a riding beast? She replied: They were not permitted to do so in hardship or comfort. Muhammad ibn Shu'ayb said: This (prohibition) applies to the obligatory prayers.",
      "chain": [
        "37534",
        "20732",
        "17545",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "1269",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا محمد بن شعيب، عن النعمان، عن مكحول، عن عنبسة بن أبي سفيان، قال قالت أم حبيبة زوج النبي صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم ‏\"‏ من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرم على النار ‏\"‏ ‏.‏ قال أبو داود رواه العلاء بن الحارث وسليمان بن موسى عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Umm Habibah:                     The Prophet (ﷺ) said: If anyone keeps on praying regularly four rak'ahs before and four after the noon prayer, he will not enter the Hell-fire.Abu Dawud said: Al-'Ala' bin Al-Harith and Sulaiman bin Musa reported it from Makhul with his chain, similarly.",
      "chain": [
        "38659",
        "20732",
        "274",
        "11066",
        "846"
      ]
    },
    {
      "hadith_no": "1717",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا محمد بن شعيب، عن المغيرة بن زياد، عن أبي الزبير المكي، أنه حدثه عن جابر بن عبد الله، قال رخص لنا رسول الله صلى الله عليه وسلم في العصا والسوط والحبل وأشباهه يلتقطه الرجل ينتفع به ‏.‏ قال أبو داود رواه النعمان بن عبد السلام عن المغيرة أبي سلمة بإسناده ورواه شبابة عن مغيرة بن مسلم عن أبي الزبير عن جابر قال كانوا لم يذكر النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) gave us licence to use (for our purpose) a stick, a rope, a whip and things of that type which a man picked up; he may benefit from them.",
      "chain": [
        "30587",
        "20732",
        "19947",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2676",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق بن إبراهيم الدمشقي أبو النضر، حدثنا محمد بن شعيب، أخبرني أبو زرعة، يحيى بن أبي عمرو السيباني عن عمرو بن عبد الله، أنه حدثه عن واثلة بن الأسقع، قال نادى رسول الله صلى الله عليه وسلم في غزوة تبوك فخرجت إلى أهلي فأقبلت وقد خرج أول صحابة رسول الله صلى الله عليه وسلم فطفقت في المدينة أنادي ألا من يحمل رجلا له سهمه فنادى شيخ من الأنصار قال لنا سهمه على أن نحمله عقبة وطعامه معنا قلت نعم ‏.‏ قال فسر على بركة الله تعالى ‏.‏ قال فخرجت مع خير صاحب حتى أفاء الله علينا فأصابني قلائص فسقتهن حتى أتيته فخرج فقعد على حقيبة من حقائب إبله ثم قال سقهن مدبرات ‏.‏ ثم قال سقهن مقبلات ‏.‏ فقال ما أرى قلائصك إلا كراما - قال - إنما هي غنيمتك التي شرطت لك ‏.‏ قال خذ قلائصك يا ابن أخي فغير سهمك أردنا ‏.‏",
      "text_en": " Narrated Wathilah ibn al-Asqa:                     The Messenger of Allah (ﷺ) announced to go on expedition for Tabuk. I went to my family and then proceeded (on journey). The vanguard of the Companions of the Messenger of Allah (ﷺ) had already proceeded. So I began to announce loudly in Medina: Is there anyone who takes a man on his ride, and he will get his share (from the booty? An old man from the Ansar (Helpers) spoke loudly: We shall have his share if we take him with us on our mount by turns, and he will have his meal with us. I said: Yes. He said: So go on journey with Allah's blessing. I then proceeded along with my best companion and Allah gave us booty. Some she-camels were given to me as my share of booty. I drove them till I reached him. He came out and sat on the rear part of the saddle of his camel. He then said: Drive them backward. He again said: Drive them forward. He then said: I find your she-camels very gentle. He said: This is your booty which I stipulated for you. He replied: Take your she-camels, my nephew; we did not intend (to get) your portion.",
      "chain": [
        "30123",
        "20732",
        "4049"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا محمد بن شعيب، أخبرني الأوزاعي، عن الزهري، عن عروة، عن جابر، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أعمر عمرى فهي له ولعقبه يرثها من يرثه من عقبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: If anyone is given life-tenancy, it belongs to him and to his descendants. His descendants who inherit him will inherit from it.",
      "chain": [
        "38659",
        "20732",
        "20024",
        "11013",
        "10511",
        "34"
      ]
    },
    {
      "hadith_no": "3839",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا نصر بن عاصم، حدثنا محمد بن شعيب، أخبرنا عبد الله بن العلاء بن زبر، عن أبي عبيد الله، مسلم بن مشكم عن أبي ثعلبة الخشني، أنه سأل رسول الله صلى الله عليه وسلم قال إنا نجاور أهل الكتاب وهم يطبخون في قدورهم الخنزير ويشربون في آنيتهم الخمر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن وجدتم غيرها فكلوا فيها واشربوا وإن لم تجدوا غيرها فارحضوها بالماء وكلوا واشربوا ‏\"‏ ‏.‏",
      "text_en": " Abu  Tha’labah al-khushani said that he asked the Messenger of Allah(ﷺ):                      We live in the neighbourhood of the People of the Book and they cook in their pots(the flesh of) swine and drink wine in their vessels. The Messenger of Allah(ﷺ) said: If you find any other pots, then eat in them and drink. But if you do not find any others, then wash them with water and eat and drink (In them).",
      "chain": [
        "10724",
        "20732",
        "20399",
        "4056"
      ]
    },
    {
      "hadith_no": "4270",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا محمد بن شعيب، عن خالد بن دهقان، قال كنا في غزوة القسطنطينية بذلقية فأقبل رجل من أهل فلسطين - من أشرافهم وخيارهم يعرفون ذلك له يقال له هانئ بن كلثوم بن شريك الكناني - فسلم على عبد الله بن أبي زكريا وكان يعرف له حقه قال لنا خالد فحدثنا عبد الله بن أبي زكريا قال سمعت أم الدرداء تقول سمعت أبا الدرداء يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل ذنب عسى الله أن يغفره إلا من مات مشركا أو مؤمن قتل مؤمنا متعمدا ‏\"‏ ‏.‏ فقال هانئ بن كلثوم سمعت محمود بن الربيع يحدث عن عبادة بن الصامت أنه سمعه يحدث عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من قتل مؤمنا فاعتبط بقتله لم يقبل الله منه صرفا ولا عدلا ‏\"‏ ‏.‏ قال لنا خالد ثم حدثني ابن أبي زكريا عن أم الدرداء عن أبي الدرداء أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزال المؤمن معنقا صالحا ما لم يصب دما حراما فإذا أصاب دما حراما بلح ‏\"‏ ‏.‏ وحدث هانئ بن كلثوم عن محمود بن الربيع عن عبادة بن الصامت عن رسول الله صلى الله عليه وسلم مثله سواء ‏.‏",
      "text_en": " Narrated AbudDarda' and Ubadah ibn as-Samit:                     Khalid ibn Dihqan said: When we were engaged in the battle of Constantinople at Dhuluqiyyah, a man of the people of Palestine, who was one of their nobility and elite and whose rank was known to them, came forward. He was called Hani ibn Kulthum ibn Sharik al-Kinani. He greeted Abdullah ibn Zakariyya who knew his rank.  Khalid said to us: Abdullah ibn AbuZakariyya told us: I heard Umm ad-Darda' say: I heard AbudDarda' say: I heard the Messenger of Allah (ﷺ) say: It is hoped that Allah may forgive every sin, except in the case of one who dies a polytheist, or one who purposely kills a believer.  Hani ibn Kulthum ar-Rabi' then said: I heard Mahmud ibn ar-Rabi' transmitting a tradition from Ubadah ibn as-Samit who transmitted from the Messenger of Allah (ﷺ) who said: If a man kills a believer unjustly, Allah will not accept any action or duty of his, obligatory or supererogatory. Khalid then said to us: Ibn AbuZakariyya transmitted a tradition to us from Umm ad-Darda' on the authority of AbudDarda' from the Messenger of Allah (ﷺ) who said: A believer will continue to go on quickly and well so long as he does not shed unlawful blood; when he sheds unlawful blood, he becomes slow and heavy-footed. A similar tradition has been transmitted by Hani ibn Kulthum from Mahmud ibn ar-Rabi' on the authority of Ubadah ibn as-Samit from the Messenger of Allah (ﷺ).",
      "chain": [
        "38659",
        "20732",
        "27506"
      ]
    },
    {
      "hadith_no": "4681",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا محمد بن شعيب بن شابور، عن يحيى بن الحارث، عن القاسم، عن أبي أمامة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من أحب لله وأبغض لله وأعطى لله ومنع لله فقد استكمل الإيمان ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: If anyone loves for Allah's sake, hates for Allah's sake, gives for Allah's sake and withholds for Allah's sake, he will have perfect faith.",
      "chain": [
        "38659",
        "20732",
        "19894",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "5079",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إسحاق بن إبراهيم أبو النضر الدمشقي، حدثنا محمد بن شعيب، قال أخبرني أبو سعيد الفلسطيني عبد الرحمن بن حسان، عن الحارث بن مسلم، أنه أخبره عن أبيه، مسلم بن الحارث التميمي عن رسول الله صلى الله عليه وسلم أنه أسر إليه فقال ‏\"‏ إذا انصرفت من صلاة المغرب فقل اللهم أجرني من النار ‏.‏ سبع مرات فإنك إذا قلت ذلك ثم مت في ليلتك كتب لك جوار منها وإذا صليت الصبح فقل كذلك فإنك إن مت في يومك كتب لك جوار منها ‏\"‏ ‏.‏ أخبرني أبو سعيد عن الحارث أنه قال أسرها إلينا رسول الله صلى الله عليه وسلم فنحن نخص بها إخواننا ‏.‏",
      "text_en": " Al-Harith b. Muslim al-Tamimi quoted his father Muslim b. al-Harith al-Tamimi as saying that the Messenger of Allah (ﷺ) told him secretly:                      When you finish the sunset prayer, say: 'O Allah, protect me from Hell\" seven times; for if you say that and die that night, protection from it would be recorded for you; and when you finish the dawn prayer, say it in a similar way, for if you die that day, protection from it would be recorded for you. AbuSa'id told me that al-Harith said: The Messenger of Allah (ﷺ) said this to us secretly, so we confine it to our brethren.",
      "chain": [
        "30123",
        "20732",
        "5290"
      ]
    },
    {
      "hadith_no": "3125",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، أخبرنا هشام بن إسماعيل أبو عبد الملك العطار، حدثنا محمد بن شعيب، حدثنا إبراهيم بن سليمان، عن الوليد بن عبد الرحمن، أنه حدثهم عن جبير بن نفير، عن نواس بن سمعان، عن النبي صلى الله عليه وسلم قال ‏\"‏ يأتي القرآن وأهله الذين يعملون به في الدنيا تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ قال نواس وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ تأتيان كأنهما غيايتان وبينهما شرق أو كأنهما غمامتان سوداوان أو كأنهما ظلة من طير صواف تجادلان عن صاحبهما ‏\"‏ ‏.‏ وفي الباب عن بريدة وأبي أمامة ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ ومعنى هذا الحديث عند أهل العلم أنه يجيء ثواب قراءته كذا فسر بعض أهل العلم هذا الحديث وما يشبه هذا من الأحاديث أنه يجيء ثواب قراءة القرآن ‏.‏ وفي حديث النواس عن النبي صلى الله عليه وسلم ما يدل على ما فسروا إذ قال النبي صلى الله عليه وسلم ‏\"‏ وأهله الذين يعملون به في الدنيا ‏\"‏ ‏.‏ ففي هذا دلالة أنه يجيء ثواب العمل ‏.‏",
      "text_en": " Narrated An-Nawwas bin Sam'an:                     that the Prophet (ﷺ) said: \"The Qur'an shall come, and its people who acted according to it in the world. Surat Al-Baqarah and Al 'Imran shall be in front of it. An-Nawwas said: \"The Messenger of Allah (ﷺ) stated three parables about them which I have not since forgotten, he said: \"They will come as if they are two shades between which there is illumination, or as if they are two shady clouds, or as if they are shadows of lines of birds arguing on behalf of their people.\"",
      "chain": [
        "34188",
        "37539",
        "20732",
        "10975",
        "4097"
      ]
    },
    {
      "hadith_no": "1190",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن هاشم البعلبكي، قال حدثنا محمد بن شعيب بن شابور، عن عمرو بن الحارث، قال أخبرني أبو الزبير، عن جابر، قال بعثني النبي صلى الله عليه وسلم فأتيته وهو يسير مشرقا أو مغربا فسلمت عليه فأشار بيده ثم سلمت عليه فأشار بيده فانصرفت فناداني ‏\"‏ يا جابر ‏\"‏ ‏.‏ فناداني الناس يا جابر ‏.‏ فأتيته فقلت يا رسول الله إني سلمت عليك فلم ترد على ‏.‏ فقال ‏\"‏ إني كنت أصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah (ﷺ) sent me on an errand, then I came back to him while he was facing the east or the west. I greeted him with salam and he gestured to me. Then when he finished he called me and said: \"O Jabir!\" So I came and said: \"O Messenger of Allah, I greeted you with Salam but you did not answer.\" He said: 'I was praying.'",
      "chain": [
        "38613",
        "20732",
        "20377",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عمران بن يزيد بن خالد، قال حدثنا محمد بن شعيب، قال أنبأنا الأوزاعي، عن يحيى، قال حدثني أبو سلمة، قال أخبرني أبو هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يتقدمن أحد الشهر بيوم ولا يومين إلا أحد كان يصوم صياما قبله فليصمه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messengre of Allah said:                     \"None should fast one or two days ahead of the month except, someone who had a prior habit for fasting, in which case let him fast.\" '",
      "chain": [
        "20732",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2254",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن خالد، عن محمد بن شعيب، قال أخبرني يحيى بن الحارث، عن القاسم أبي عبد الرحمن، أنه حدثه عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله عز وجل باعد الله منه جهنم مسيرة مائة عام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                     \"Whoever fasts one day in the cause of Allah, the mighty and sublime, Allah will separate him the distance of one hundred years from the fire.\"",
      "chain": [
        "37534",
        "20732",
        "19894",
        "11648",
        "189"
      ]
    },
    {
      "hadith_no": "2265",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمران بن يزيد، قال حدثنا محمد بن شعيب، قال أخبرني الأوزاعي، عن يحيى، أنه حدثه عن أبي سلمة، قال بينما رسول الله صلى الله عليه وسلم يتغدى بمر الظهران ومعه أبو بكر وعمر فقال ‏\"‏ الغداء ‏\"‏ ‏.‏ مرسل ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                     \"When the Messenger of Allah was eating breakfast in Marr Az-Zahran, and Abu Bakr and 'Umar were with him, he said: '(Come and eat) breakfast.\" (Daif) He narrated it in Mursal form.",
      "chain": [
        "20732",
        "20024",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "2267",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عبدة بن عبد الرحيم، عن محمد بن شعيب، قال حدثنا الأوزاعي، عن يحيى، عن أبي سلمة، قال أخبرني عمرو بن أمية الضمري، قال قدمت على رسول الله صلى الله عليه وسلم من سفر فقال ‏\"‏ انتظر الغداء يا أبا أمية ‏\"‏ ‏.‏ فقلت إني صائم ‏.‏ فقال ‏\"‏ تعال ادن مني حتى أخبرك عن المسافر إن الله عز وجل وضع عنه الصيام ونصف الصلاة ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Umayyah Ad-Damri said:                     \"I came to the Messenger of Allah from a journey and he said: 'Stay and have a meal to break the fast, O Abu Umayyah.' I said: 'I am fasting.' He said: 'Come close to me and I will tell you about the traveler. Allah, the mighty and sublime, has waived fasting and half of the prayer for him.\"'",
      "chain": [
        "38366",
        "20732",
        "20024",
        "11449",
        "10567",
        "4011"
      ]
    },
    {
      "hadith_no": "2437",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عيسى بن مساور، قال حدثنا محمد بن شعيب بن شابور، عن معاوية بن سلام، عن أخيه، زيد بن سلام أنه أخبره عن جده أبي سلام، عن عبد الرحمن بن غنم، أن أبا مالك الأشعري، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إسباغ الوضوء شطر الإيمان والحمد لله تملأ الميزان والتسبيح والتكبير يملأ السموات والأرض والصلاة نور والزكاة برهان والصبر ضياء والقرآن حجة لك أو عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Ghanm that Abu Malik Al-Ash'ari told him that the Messenger of Allah said:                     \"Isbagh Al-Wudu is half of faith; Alhamdu lillah (praise be to Allah) fills the balance; the Tasbih and the Takbir fill the heavens and Earth; the Salah is light; the Zakah is a sign (of sincerity); patience is an illuminating torch; and the Qur'an is proof, either for you or against you.\"",
      "chain": [
        "36610",
        "20732",
        "20401",
        "5152"
      ]
    },
    {
      "hadith_no": "3658",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن صدقة الحمصي، قال حدثنا محمد بن شعيب، عن الأوزاعي، عن الزهري، أخبره عن عبيد الله بن عبد الله، عن ابن عباس، عن سعد بن عبادة، أنه استفتى النبي صلى الله عليه وسلم في نذر كان على أمه فماتت قبل أن تقضيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقضه عنها ‏\"‏‏.‏",
      "text_en": " It was narrated from Sa'd bin 'Ubadah that he consulted the Prophet about a vow which his mother had to fulfill, but she died before doing so. The Messenger of Allah said:                      \"Fulfill it on her behalf.\"",
      "chain": [
        "20732",
        "20024",
        "11013",
        "11004",
        "17",
        "35"
      ]
    },
    {
      "hadith_no": "10",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب، حدثنا سعيد بن بشير، عن قتادة، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يزال طائفة من أمتي على الحق منصورين لا يضرهم من خالفهم حتى يأتي أمر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that:                     The Messenger of Allah (ﷺ) said: \"A group among my Ummah will continue to follow the truth and prevail, and those who oppose them will not be able to harm them, until the command of Allah comes to pass.\"",
      "chain": [
        "30288",
        "20732",
        "20710",
        "11019",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا محمد بن شعيب بن شابور، أخبرني معاوية بن سلام، عن أخيه، أنه أخبره عن جده أبي سلام، عن عبد الرحمن بن غنم، عن أبي مالك الأشعري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إسباغ الوضوء شطر الإيمان والحمد لله تملأ الميزان والتسبيح والتكبير ملء السموات والأرض والصلاة نور والزكاة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Malik Ash'ari that:                     The Messenger of Allah said: \"Performing ablution properly is half of faith, saying Al-Hamdu Lillah fills the Scale (of good deeds), saying Subhan-Allah and Allahu Akbar fills the heavens and the earth, prayer is light, Zakat is proof, patience is brightness and the Qur'an is proof for you or against you. Every person goes out in the morning to sell his soul, so he either frees it or destroys it.'\"",
      "chain": [
        "30285",
        "20732",
        "20401",
        "10912",
        "5152",
        "5372"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب، حدثنا عثمان بن أبي العاتكة، عن علي بن يزيد، عن القاسم، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تسوكوا فإن السواك مطهرة للفم مرضاة للرب وما جاءني جبريل إلا أوصاني بالسواك حتى لقد خشيت أن يفرض على وعلى أمتي ولولا أني أخاف أن أشق على أمتي لفرضته لهم وإني لأستاك حتى لقد خشيت أن أحفي مقادم فمي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     The Messenger of Allah said: \"Use the tooth stick, for the tooth stick purifies the mouth and is pleasing to the Lord. Jibril never came to me but he advised me to use the tooth stick, until I feared that it would be made obligatory for me and my Ummah. Were it not that I fear that it would be too difficult for my Ummah, I would have enjoined it upon them. And I use the tooth stick until I fear that I may make the front of my mouth sore.' (i.e. my gums) (or cause my teeth to fall out due to brushing them so often).\"",
      "chain": [
        "30288",
        "20732",
        "27530",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "1475",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب، حدثنا يزيد بن أبي مريم، عن قزعة، عن أبي سعيد، وعبد الله بن عمرو بن العاص، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا تشد الرحال إلا إلى ثلاثة مساجد إلى المسجد الحرام وإلى المسجد الأقصى وإلى مسجدي هذا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed and ‘Abdullah bin ‘Amr bin ‘As thatthe Messenger of Allah (ﷺ) said:                      “Do not prepare a mount (travel)tovisit any mosque except three: the Sacred Mosque, Aqsa Mosque, andthis mosque of mine.”",
      "chain": [
        "30288",
        "20732",
        "11674",
        "38",
        "29"
      ]
    },
    {
      "hadith_no": "2490",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن عمار، وعبد الرحمن بن إبراهيم الدمشقيان، قالا حدثنا محمد بن شعيب، عن عبد الرحمن بن يزيد، عن سعيد بن أبي سعيد، عن أنس بن مالك، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العارية مؤداة والمنحة مردودة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “I heard the Messenger of Allah (ﷺ) say: 'Borrowed items are to be returned and an animal borrowed for milking is to be returned.' ”",
      "chain": [
        "30288",
        "20732",
        "20395",
        "11168",
        "19"
      ]
    },
    {
      "hadith_no": "2818",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب بن شابور، حدثنا عبد الرحمن بن يزيد بن جابر، عن سعيد بن أبي سعيد، أنه حدثه عن أنس بن مالك، قال إني لتحت ناقة رسول الله صلى الله عليه وسلم يسيل على لعابها فسمعته يقول ‏\"‏ إن الله قد أعطى كل ذي حق حقه ألا لا وصية لوارث ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “I was under the she-camel of the Messenger of Allah (ﷺ) and its saliva was dripping between my shoulders, and I heard him say: 'Allah (SWT) has given each person who has rights his rights, but there is no bequest for an heir.”",
      "chain": [
        "30288",
        "20732",
        "20395",
        "11168",
        "19"
      ]
    },
    {
      "hadith_no": "2875",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عيسى بن يونس الرملي، حدثنا محمد بن شعيب بن شابور، عن سعيد بن خالد بن أبي الطويل، قال سمعت أنس بن مالك، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ حرس ليلة في سبيل الله أفضل من صيام رجل وقيامه في أهله ألف سنة السنة ثلاثمائة وستون يوما واليوم كألف سنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Sa’eed bin Khalid bin Abu Tuwail said:                      I heardAnasbin Malik saying: I heard the Messenger of Allah (ﷺ) say:“Standingguard one night in the cause of Allah is better than a manfastingand praying, among his family, for a thousand years. The yearisthree hundred and sixty days and a day is like a thousand years.”",
      "chain": [
        "20347",
        "20732",
        "19"
      ]
    },
    {
      "hadith_no": "3249",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا محمد بن شعيب، أخبرني سعيد بن عبد العزيز، حدثنا يونس بن ميسرة بن حلبس، قال خرجنا مع أبي سعيد الزرقي - صاحب رسول الله  صلى الله عليه وسلم  - إلى شراء الضحايا ‏.‏ قال يونس فأشار أبو سعيد إلى كبش أدغم ليس بالمرتفع ولا المتضع في جسمه فقال لي اشتر لي هذا ‏.‏ كأنه شبهه بكبش رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Yunusbin Maisarah bin Halbas said:                      “I went out with Abu Sa’eedAz-Zuraqi, the Companion of the Messenger of Allah (ﷺ), to buyanimalsor sacrifice.” Yunus said: “Abu Sa’eed pointed to a ramthat had someblackness around its ears and jaw, and was neither toobig nor toosmall, and said to me: ‘Buy this one for them, as itseems to resemblethe ram of the Messenger of Allah (ﷺ).’”",
      "chain": [
        "30285",
        "20732",
        "20638",
        "19201"
      ]
    },
    {
      "hadith_no": "4087",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب بن شابور، حدثنا سعيد بن بشير، عن قتادة، أنه حدثهم عن أبي قلابة الجرمي عبد الله بن زيد، عن أبي أسماء الرحبي، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ زويت لي الأرض حتى رأيت مشارقها ومغاربها وأعطيت الكنزين الأصفر - أو الأحمر - والأبيض - يعني الذهب والفضة - وقيل لي إن ملكك إلى حيث زوي لك وإني سألت الله عز وجل ثلاثا أن لا يسلط على أمتي جوعا فيهلكهم به عامة وأن لا يلبسهم شيعا ويذيق بعضهم بأس بعض وإنه قيل لي إذا قضيت قضاء فلا مرد له وإني لن أسلط على أمتك جوعا فيهلكهم فيه ولن أجمع عليهم من بين أقطارها حتى يفني بعضهم بعضا ويقتل بعضهم بعضا ‏.‏ وإذا وضع السيف في أمتي فلن يرفع عنهم إلى يوم القيامة وإن مما أتخوف على أمتي أئمة مضلين وستعبد قبائل من أمتي الأوثان وستلحق قبائل من أمتي بالمشركين وإن بين يدى الساعة دجالين كذابين قريبا من ثلاثين كلهم يزعم أنه نبي ولن تزال طائفة من أمتي على الحق منصورين لا يضرهم من خالفهم حتى يأتي أمر الله عز وجل ‏\"‏ ‏.‏ قال أبو الحسن لما فرغ أبو عبد الله من هذا الحديث قال ما أهوله ‏.‏",
      "text_en": " It was narrated from Thawban, the freed slave of the Messenger ofAllah (ﷺ), that the Messenger of Allah (ﷺ) said:                      “The earth wasbrought together for me so that I could see the east and the west,andI was given two treasures, the yellow (or the red) and the white–meaning gold and silver. And it was said to me: ‘Your dominionwillextend as far as has been shown to you.’ I asked Allah forthreethings: That my nation would not be overwhelmed by famine thatwoulddestroy them all, and that they would not be rent by schism andfightone another, but it was said to me: ‘When I (Allah) issue Mydecree itcannot be revoked. But I will never cause your nation to beoverwhelmed by famine that would destroy them all, and I will notgather their enemies against them (and destroy them) until theyannihilate one another and kill one another.’ Once they start tofightamongst themselves, that will continue until the Day ofResurrection.What I fear most for my nation is misguiding leaders.Some tribesamong my nation will worship idols and some tribes amongmy nationwill join the idolaters. Before the Hour comes there willbe nearlythirty Dajjals (great liars), each of them claiming to be aProphet.But a group among my nation will continue to adhere to thetruth andbe victorious, and those who oppose them will not harmthem, until thecommand of Allah comes to pass.’”",
      "chain": [
        "30288",
        "20732",
        "20710",
        "11019",
        "11047",
        "10883"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب بن شابور، حدثنا الأوزاعي، عن قرة بن عبد الرحمن بن حيوئيل، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حسن إسلام المرء تركه ما لا يعنيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Part of a person’s goodness in Islam is his leaving alonethatwhich does not concern him.”",
      "chain": [
        "30288",
        "20732",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 29
}