{
  "id": "20736",
  "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
  "full_name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": [
        "110 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "182",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ي  4  -  صدوق ]"
    ],
    "tags": [
      "al-'Ansi",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11720",
      "name": "Muhammad bin Ziyad al-Alhani محمد بن زياد الألهاني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18459",
      "name": "Damdam bin Zar'ah ضمضم بن زرعة بن ثوب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10942",
      "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20459",
      "name": "Muhammad bin al-Walid al-Zubaidi محمد بن الوليد بن عامر الزبيدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20729",
      "name": "Hisham bin al-Ghaz bin Rabi'ya هشام بن الغاز بن ربيعة الجرشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27053",
      "name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "17036",
      "name": "Shrhbyl bin Muslim bin Hamd شرحبيل بن مسلم بن حامد الخولاني الشامي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28090",
      "name": "Habib bin Salah حبيب بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28326",
      "name": "'Abdur Rahman bin Ziyad عبد الرحمن بن زياد بن أنعم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "89",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا زكرياء بن عدي، قال قال لي أبو إسحاق الفزاري اكتب عن بقية، ما روى عن المعروفين، ولا تكتب عنه ما روى عن غير المعروفين، ولا تكتب عن إسماعيل بن عياش، ما روى عن المعروفين، ولا عن غيرهم، ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "30464",
        "20405",
        "20736"
      ]
    },
    {
      "hadith_no": "1333",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ الجاهر بالقرآن كالجاهر بالصدقة، والمسر بالقرآن كالمسر بالصدقة ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir al-Juhani:                     The Prophet (ﷺ) said: One who recites the Qur'an in a loud voice is like one who gives alms openly; and one who recites the Qur'an quietly is one who gives alms secretly.",
      "chain": [
        "30203",
        "20736",
        "11422",
        "19940",
        "189"
      ]
    },
    {
      "hadith_no": "1486",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن عبد الحميد البهراني، قال قرأته في أصل إسماعيل - يعني ابن عياش - حدثني ضمضم عن شريح حدثنا أبو ظبية أن أبا بحرية السكوني حدثه عن مالك بن يسار السكوني ثم العوفي أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا سألتم الله فاسألوه ببطون أكفكم ولا تسألوه بظهورها ‏\"‏ ‏.‏ قال أبو داود قال سليمان بن عبد الحميد له عندنا صحبة يعني مالك بن يسار ‏.‏",
      "text_en": " Narrated Malik ibn Yasar as-Sakuni, al-Awfi:                     The Prophet (ﷺ) said: When you make requests to Allah, do so with the palms of your hands, and not backs, upwards.Abu Dawud said: The narrator Sulaiman b. 'Abd al-Hamid said: according to us Malik b. Yasar was a Companion of the Prophet (ﷺ).",
      "chain": [
        "38250",
        "20736",
        "18459",
        "18414",
        "19302",
        "19921",
        "5270"
      ]
    },
    {
      "hadith_no": "2281",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن عبد الحميد البهراني، حدثني يحيى بن صالح، حدثنا إسماعيل بن عياش، حدثني عمرو بن مهاجر، عن أبيه، عن أسماء بنت يزيد بن السكن الأنصارية، أنها طلقت على عهد رسول الله صلى الله عليه وسلم ولم يكن للمطلقة عدة فأنزل الله عز وجل حين طلقت أسماء بالعدة للطلاق فكانت أول من أنزلت فيها العدة للمطلقات ‏.‏",
      "text_en": " Amr ibn Muhajir reported on the authority of his father:                      Asma', daughter of Yazid ibn as-Sakan al-Ansariyyah, was divorced in the time of the Messenger of Allah (ﷺ). No waiting period was prescribed for a divorced woman (at that time). When Asma' was divorced, Allah, the Exalted, sent down the injunction of waiting period for divorce. She is the first of the divorced women about whom the verse relating to waiting period was sent down.",
      "chain": [
        "20470",
        "20736",
        "17532",
        "17066",
        "84"
      ]
    },
    {
      "hadith_no": "2629",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن عياش، عن أسيد بن عبد الرحمن الخثعمي، عن فروة بن مجاهد اللخمي، عن سهل بن معاذ بن أنس الجهني، عن أبيه، قال غزوت مع نبي الله صلى الله عليه وسلم غزوة كذا وكذا فضيق الناس المنازل وقطعوا الطريق فبعث نبي الله صلى الله عليه وسلم مناديا ينادي في الناس أن من ضيق منزلا أو قطع طريقا فلا جهاد له ‏.‏",
      "text_en": " Narrated Mu'adh ibn Anas al-Juhani:                     I fought along with the Prophet (ﷺ) in such and such battles. The people occupied much space and encroached on the road. The Prophet (ﷺ) sent an announcer to announce among the people: Those who occupy much space or encroach on the road will not be credited with jihad.",
      "chain": [
        "30116",
        "20736",
        "18053",
        "5225"
      ]
    },
    {
      "hadith_no": "2721",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن عياش، عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، وخالد بن الوليد، أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل ولم يخمس السلب ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i ; Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) gave judgement that the killer should have what was taken from the man he killed, and did not make this subject to division into fifths.",
      "chain": [
        "30116",
        "20736",
        "10921",
        "10942",
        "3051",
        "22"
      ]
    },
    {
      "hadith_no": "2723",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، قال حدثنا إسماعيل بن عياش، عن محمد بن الوليد الزبيدي، عن الزهري، أن عنبسة بن سعيد، أخبره أنه، سمع أبا هريرة، يحدث سعيد بن العاص أن رسول الله صلى الله عليه وسلم بعث أبان بن سعيد بن العاص على سرية من المدينة قبل نجد فقدم أبان بن سعيد وأصحابه على رسول الله صلى الله عليه وسلم بخيبر بعد أن فتحها وإن حزم خيلهم ليف فقال أبان اقسم لنا يا رسول الله ‏.‏ قال أبو هريرة فقلت لا تقسم لهم يا رسول الله ‏.‏ فقال أبان أنت بها يا وبر تحدر علينا من رأس ضال ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اجلس يا أبان ‏\"‏ ‏.‏ ولم يقسم لهم رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Sa'id ibn al-'As:                     The Messenger of Allah (ﷺ) sent AbuSa'id ibn al-'As with an expedition from Medina towards Najd. Aban ibn Sa'id and his companions came to the Messenger of Allah (ﷺ) at Khaybar after it had been captured. The girths of their horses were made of palm fibres. Aban said: Give us a share (from the booty), Messenger of Allah. AbuHurayrah said: I said: Do not give them a share, Messenger of Allah. Aban said: Why are you talking so, Wabr. You have come to us from the peak of Dal. The Prophet (ﷺ) said: Sit down, Aban. The Messenger of Allah (ﷺ) did not give any share to them (from the booty).",
      "chain": [
        "30116",
        "20736",
        "20459",
        "11013",
        "25221",
        "13",
        "989"
      ]
    },
    {
      "hadith_no": "2901",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد السلام بن عتيق الدمشقي، حدثنا محمد بن المبارك، حدثنا إسماعيل بن عياش، عن يزيد بن حجر، عن صالح بن يحيى بن المقدام، عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أنا وارث من لا وارث له أفك عانيه وأرث ماله والخال وارث من لا وارث له يفك عانيه ويرث ماله ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam:                     I heard the Messenger of Allah (ﷺ) say: I am the heirs of Him who has none, freeing him from his liabilities, and inheriting what he possesses. A maternal uncle is the heir of Him who has none, freeing him from his liabilities, and inheriting his property.",
      "chain": [
        "30382",
        "20736",
        "17038"
      ]
    },
    {
      "hadith_no": "3522",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا عبد الله بن عبد الجبار، - يعني الخبائري - حدثنا إسماعيل، - يعني ابن عياش - عن الزبيدي، - قال أبو داود وهو محمد بن الوليد أبو الهذيل الحمصي - عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه قال ‏\"‏ فإن كان قضاه من ثمنها شيئا فما بقي فهو أسوة الغرماء وأيما امرئ هلك وعنده متاع امرئ بعينه اقتضى منه شيئا أو لم يقتض فهو أسوة الغرماء ‏\"‏ ‏.‏ قال أبو داود حديث مالك أصح ‏.‏",
      "text_en": " A similar tradition (to the No. 3513) has been transmitted by AbuHurayrah from the Prophet (ﷺ). This version has:                      If he paid something from its price, then he will be equal to the creditors in the remaining price. If a man dies and he has the very property of a man (i.e. seller), he is equal to the creditors whether he (the buyer) pays him (the price) or not.Abu Dawud said: Malik's version of this tradition is sounder.",
      "chain": [
        "38566",
        "28292",
        "20736",
        "20459",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "3874",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، أخبرنا إسماعيل بن عياش، عن ثعلبة بن مسلم، عن أبي عمران الأنصاري، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أنزل الداء والدواء وجعل لكل داء دواء فتداووا ولا تداووا بحرام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu al-Darda:                     The Prophet (ﷺ) said: Allah has sent down both the disease and the cure, and He has appointed a cure for every disease, so treat yourselves medically, but use nothing unlawful.",
      "chain": [
        "30378",
        "20472",
        "20736",
        "17010",
        "17096",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عثمان الدمشقي، حدثنا إسماعيل بن عياش، عن شرحبيل بن مسلم، عن شفعة، عن عبد الله بن عمرو بن العاص، قال رآني رسول الله صلى الله عليه وسلم - قال أبو علي اللؤلؤي أراه - وعلى ثوب مصبوغ بعصفر مورد فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ فانطلقت فأحرقته فقال النبي صلى الله عليه وسلم ‏\"‏ ما صنعت بثوبك ‏\"‏ ‏.‏ فقلت أحرقته ‏.‏ قال ‏\"‏ أفلا كسوته بعض أهلك ‏\"‏ ‏.‏ قال أبو داود رواه ثور عن خالد فقال مورد وطاوس قال معصفر ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) saw me. The version of AbuAli al-Lula' has: I think I wore a garment dyed with a reddish yellow colour. He asked: What is this? So I went and burnt it. The Prophet (ﷺ) said: What have you done with your garment?  I replied: I burnt it. He said: Why did you not give it to one of your women to wear?Abu Dawud said: Thawr transmitted it from Khalid and said: \"Pink (muwarrad)\" while Tawus said: \"Reddish yellow colour (mu'asfar)\".",
      "chain": [
        "38550",
        "20736",
        "17036",
        "29"
      ]
    },
    {
      "hadith_no": "4889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سعيد بن عمرو الحضرمي، حدثنا إسماعيل بن عياش، حدثنا ضمضم بن زرعة، عن شريح بن عبيد، عن جبير بن نفير، وكثير بن مرة، وعمرو بن الأسود، والمقدام بن معديكرب، وأبي، أمامة عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الأمير إذا ابتغى الريبة في الناس أفسدهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Miqdam ibn Ma'dikarib ; AbuUmamah:                     The Prophet (ﷺ) said: When a ruler seeks to make imputations against the people, he corrupts them.",
      "chain": [
        "11509",
        "20736",
        "18459",
        "18414",
        "4097",
        "19940",
        "11714",
        "405"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، والحسن بن عرفة، قالا حدثنا إسماعيل بن عياش، عن موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقرإ الحائض ولا الجنب شيئا من القرآن ‏\"‏ ‏.‏ قال وفي الباب عن علي ‏.‏ قال أبو عيسى حديث ابن عمر حديث لا نعرفه إلا من حديث إسماعيل بن عياش عن موسى بن عقبة عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقرإ الجنب ولا الحائض ‏\"‏ ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم مثل سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق قالوا لا تقرأ الحائض ولا الجنب من القرآن شيئا إلا طرف الآية والحرف ونحو ذلك ورخصوا للجنب والحائض في التسبيح والتهليل ‏.‏ قال وسمعت محمد بن إسماعيل يقول إن إسماعيل بن عياش يروي عن أهل الحجاز وأهل العراق أحاديث مناكير ‏.‏ كأنه ضعف روايته عنهم فيما ينفرد به ‏.‏ وقال إنما حديث إسماعيل بن عياش عن أهل الشأم ‏.‏ وقال أحمد بن حنبل إسماعيل بن عياش أصلح من بقية ولبقية أحاديث مناكير عن الثقات ‏.‏ قال أبو عيسى حدثني أحمد بن الحسن قال سمعت أحمد بن حنبل يقول ذلك ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Prophet said: \"The menstruating woman does not recite - nor the Junub - anything from the Qur'an.\"  [He said:] There is narration on this topic from Ali",
      "chain": [
        "20387",
        "36540",
        "20736",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، حدثني حبيب بن صالح، عن يزيد بن شريح، عن أبي حى المؤذن الحمصي، عن ثوبان، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرئ أن ينظر في جوف بيت امرئ حتى يستأذن فإن نظر فقد دخل ولا يؤم قوما فيخص نفسه بدعوة دونهم فإن فعل فقد خانهم ولا يقوم إلى الصلاة وهو حقن ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأبي أمامة ‏.‏ قال أبو عيسى حديث ثوبان حديث حسن ‏.‏ وقد روي هذا الحديث عن معاوية بن صالح عن السفر بن نسير عن يزيد بن شريح عن أبي أمامة عن النبي صلى الله عليه وسلم ‏.‏ وروي هذا الحديث عن يزيد بن شريح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وكأن حديث يزيد بن شريح عن أبي حى المؤذن عن ثوبان في هذا أجود إسنادا وأشهر ‏.‏",
      "text_en": " Thawban narrated that :                     the Prophet said: \"It is not allowed for a man to look into the interior of a man's house until he has been given permission, for if he looks, then he has entered. And one who leads people (in Salat) should not supplicate for himself alone with the exclusion of his congregation. If he does, then he has betrayed them. And one is not to stand for Salat while he has to urinate.\"",
      "chain": [
        "20387",
        "20736",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "475",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو جعفر السمناني، حدثنا أبو مسهر، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن أبي الدرداء، وأبي، ذر عن رسول الله صلى الله عليه وسلم ‏\"‏ عن الله، عز وجل أنه قال ابن آدم اركع لي من أول النهار أربع ركعات أكفك آخره ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Jubair narrated from Abu Ad-Darda, or Abu Dharr, that :                     Allah's Messenger narrated that Allah, Blessed and Most High said: \"Son of Adam: Perform four Rak'ah for Me in the beginning of the day it will suffice you for the latter part of it.\"",
      "chain": [
        "30284",
        "20736",
        "11422",
        "4097",
        "37",
        "23"
      ]
    },
    {
      "hadith_no": "670",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد، حدثنا إسماعيل بن عياش، حدثنا شرحبيل بن مسلم الخولاني، عن أبي أمامة الباهلي، قال سمعت رسول الله صلى الله عليه وسلم في خطبته عام حجة الوداع يقول ‏\"‏ لا تنفق امرأة شيئا من بيت زوجها إلا بإذن زوجها ‏\"‏ ‏.‏ قيل يا رسول الله ولا الطعام قال ‏\"‏ ذاك أفضل أموالنا ‏\"‏ ‏.‏ وفي الباب عن سعد بن أبي وقاص وأسماء بنت أبي بكر وأبي هريرة وعبد الله بن عمرو وعائشة ‏.‏ قال أبو عيسى حديث أبي أمامة حديث حسن ‏.‏",
      "text_en": " Abu Umamah Al-Bahili said:                     \"During a sermon of his in the year of the Farewell Hajj, I heard the Messenger of Allah say: 'A woman is not to spend anything from her husbands house without her husband's permission.' They said: 'O Messenger of Allah! What about food?' He said: 'That is our most virtuous wealth.'\"",
      "chain": [
        "30480",
        "20736",
        "17036",
        "4048"
      ]
    },
    {
      "hadith_no": "828",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا هناد، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يلبي إلا لبى من عن يمينه أو عن شماله من حجر أو شجر أو مدر حتى تنقطع الأرض من ها هنا وها هنا ‏\"‏ ‏.‏ حدثنا الحسن بن محمد الزعفراني، وعبد الرحمن بن الأسود أبو عمرو البصري، قالا حدثنا عبيدة بن حميد، عن عمارة بن غزية، عن أبي حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم نحو حديث إسماعيل بن عياش ‏.‏ قال وفي الباب عن ابن عمر وجابر ‏.‏ قال أبو عيسى حديث أبي بكر حديث غريب لا نعرفه إلا من حديث ابن أبي فديك عن الضحاك بن عثمان ‏.‏ ومحمد بن المنكدر لم يسمع من عبد الرحمن بن يربوع وقد روى محمد بن المنكدر عن سعيد بن عبد الرحمن بن يربوع عن أبيه غير هذا الحديث ‏.‏ وروى أبو نعيم الطحان ضرار بن صرد هذا الحديث عن ابن أبي فديك عن الضحاك بن عثمان عن محمد بن المنكدر عن سعيد بن عبد الرحمن بن يربوع عن أبيه عن أبي بكر عن النبي صلى الله عليه وسلم ‏.‏ وأخطأ فيه ضرار ‏.‏ قال أبو عيسى سمعت أحمد بن الحسن يقول قال أحمد بن حنبل من قال في هذا الحديث عن محمد بن المنكدر عن ابن عبد الرحمن بن يربوع عن أبيه فقد أخطأ ‏.‏ قال وسمعت محمدا يقول وذكرت له حديث ضرار بن صرد عن ابن أبي فديك فقال هو خطأ ‏.‏ فقلت قد رواه غيره عن ابن أبي فديك أيضا مثل روايته ‏.‏ فقال لا شىء إنما رووه عن ابن أبي فديك ولم يذكروا فيه عن سعيد بن عبد الرحمن ‏.‏ ورأيته يضعف ضرار بن صرد ‏.‏ والعج هو رفع الصوت بالتلبية ‏.‏ والثج هو نحر البدن ‏.‏",
      "text_en": " Sahl bin Sa'd narrated that :                     the Messenger of Allah said: \"There is no Muslim who says the Talbiyah except that - on his right and left, until the end f the land, from here to there - the rocks, or trees, or mud say the Talbiyah.\"",
      "chain": [
        "30480",
        "20736",
        "11894",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1207",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة الحضرمي، عن معاذ بن جبل، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تؤذي امرأة زوجها في الدنيا إلا قالت زوجته من الحور العين لا تؤذيه قاتلك الله فإنما هو عندك دخيل يوشك أن يفارقك إلينا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ ورواية إسماعيل بن عياش عن الشاميين أصلح وله عن أهل الحجاز وأهل العراق مناكير ‏.‏",
      "text_en": " Mu’adh bin Jabal narrated that The Prophet said:                      “No woman annoys her husband in the world except that his wife among the Al-Huril-Ain said: ‘Do not annoy him, may Allah destroy you, he is only like a guest with, soon he will part from you for us.’”",
      "chain": [
        "36540",
        "20736",
        "11422",
        "19940",
        "32"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، وعلي بن حجر، قالا حدثنا إسماعيل بن عياش، عن شرحبيل بن مسلم الخولاني، عن أبي أمامة، قال سمعت النبي صلى الله عليه وسلم يقول في خطبته عام حجة الوداع ‏\"‏ العارية مؤداة والزعيم غارم والدين مقضي ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن سمرة وصفوان بن أمية وأنس ‏.‏ قال وحديث أبي أمامة حديث حسن ‏.‏ وقد روي عن أبي أمامة عن النبي صلى الله عليه وسلم أيضا من غير هذا الوجه ‏.‏",
      "text_en": " Narrated Abu Umamah:                     \"During the year of the Farewell Pilgrimage, I heard the Prophet (ﷺ) saying during the Khutbah: \"The borrowed is to be returned, and the guarantor is responsible, and the debt is to be repaid.\"[Abu 'Eisa said:] There are narrations on this topic from Samurah, Safwan bin Umayyah, and Anas. [He said:] The Hadith of Abu Umamah is a Hasan Gharib Hadith. It has also been reported through other routes besides this, from Abu Umamah, from the Prophet (ﷺ).",
      "chain": [
        "30480",
        "20387",
        "20736",
        "17036",
        "405"
      ]
    },
    {
      "hadith_no": "1399",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، حدثنا المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، عن سراقة بن مالك بن جعشم، قال حضرت رسول الله صلى الله عليه وسلم يقيد الأب من ابنه ولا يقيد الابن من أبيه ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث سراقة إلا من هذا الوجه وليس إسناده بصحيح رواه إسماعيل بن عياش عن المثنى بن الصباح ‏.‏ والمثنى بن الصباح يضعف في الحديث ‏.‏ وقد روى هذا الحديث أبو خالد الأحمر عن الحجاج بن أرطاة عن عمرو بن شعيب عن أبيه عن جده عن عمر عن النبي صلى الله عليه وسلم وقد روي هذا الحديث عن عمرو بن شعيب مرسلا وهذا حديث فيه اضطراب ‏.‏ والعمل على هذا عند أهل العلم أن الأب إذا قتل ابنه لا يقتل به وإذا قذف ابنه لا يحد ‏.‏",
      "text_en": " Narrated Suraqah bin Malik bin [Ju'shum]:                     \"The Messenger of Allah (ﷺ) judged that the son is to suffer retaliation for [killing] his father, but the father is not to suffer retaliation for [killing] his son.\"",
      "chain": [
        "20387",
        "20736",
        "19934",
        "19911",
        "471"
      ]
    },
    {
      "hadith_no": "2166",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن عياش، عن عمارة بن غزية، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعطي عطاء فوجد فليجز به ومن لم يجد فليثن فإن من أثنى فقد شكر ومن كتم فقد كفر ومن تحلى بما لم يعطه كان كلابس ثوبى زور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وفي الباب عن أسماء بنت أبي بكر وعائشة ‏.‏ ومعنى قوله ‏\"‏ ومن كتم فقد كفر ‏\"‏ ‏.‏ يقول قد كفر تلك النعمة ‏.‏",
      "text_en": " Jabir narrated that the Prophet (s.a.w) said:                     \"Whoever is given a gift, then if he finds something let him reciprocate. If he has nothing, then let him mention some praise. For whoever has mentioned some praise, then he has expressed his gratitude. And whoever refrains (from doing so) then he has committed Kufr. And whoever pretends to be satisfied by that which he was not given, he is like the one who wears a garment of falsehood.\" (Dai'f)",
      "chain": [
        "20387",
        "20736",
        "11894",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2266",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Wasaya (Wills and Testament) - كتاب الوصايا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن حجر، وهناد، قالا حدثنا إسماعيل بن عياش، حدثنا شرحبيل بن مسلم الخولاني، عن أبي أمامة الباهلي، قال سمعت رسول الله صلى الله عليه وسلم في خطبته عام حجة الوداع ‏\"‏ إن الله قد أعطى كل ذي حق حقه فلا وصية لوارث الولد للفراش وللعاهر الحجر وحسابهم على الله ومن ادعى إلى غير أبيه أو انتمى إلى غير مواليه فعليه لعنة الله التابعة إلى يوم القيامة لا تنفق امرأة من بيت زوجها إلا بإذن زوجها ‏\"‏ ‏.‏ قيل يا رسول الله ولا الطعام قال ‏\"‏ ذلك أفضل أموالنا ‏\"‏ ‏.‏ ثم قال ‏\"‏ العارية مؤداة والمنحة مردودة والدين مقضي والزعيم غارم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمرو بن خارجة وأنس بن مالك ‏.‏ وهو حديث حسن صحيح وقد روي عن أبي أمامة عن النبي صلى الله عليه وسلم من غير هذا الوجه ‏.‏ ورواية إسماعيل بن عياش عن أهل العراق وأهل الحجاز ليس بذلك فيما تفرد به لأنه روى عنهم مناكير وروايته عن أهل الشام أصح هكذا قال محمد بن إسماعيل ‏.‏ قال سمعت أحمد بن الحسن يقول قال أحمد بن حنبل إسماعيل بن عياش أصلح حديثا من بقية ولبقية أحاديث مناكير عن الثقات ‏.‏ وسمعت عبد الله بن عبد الرحمن يقول سمعت زكريا بن عدي يقول قال أبو إسحاق الفزاري خذوا عن بقية ما حدث عن الثقات ولا تأخذوا عن إسماعيل بن عياش ما حدث عن الثقات ولا عن غير الثقات ‏.‏",
      "text_en": " Abu Ummah said:                     \"During the year of the Farewell Pilgrimage, I heard the Messenger of Allah (S.A.W) saying in the Khutbah: 'Indeed Allah, Most Blessed and Most High, has given the right due to everyone deserving a right. So there is no will for an heir, the child is for the bed, and for the fornicator is the stone, and their reckoning is for Allah, Most High. And whoever claims someone other than his father, or an affiliation with other than his Mawali, then upon him is the continued curse of Allah until the Day of Judgment. The wife is not to spend from her husband's house except with her husband's permission.' They said: 'O Messenger of Allah! Not even food?' He said: 'That is the most virtuous of our wealth.' And he said: 'The borrowed is to be returned, the endowment is to be refunded and the debt is to be repaid, and the guarantor is responsible.'\"",
      "chain": [
        "20387",
        "30480",
        "20736",
        "17036",
        "4048"
      ]
    },
    {
      "hadith_no": "2380",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا إسماعيل بن عياش، حدثني أبو سلمة الحمصي، وحبيب بن صالح، عن يحيى بن جابر الطائي، عن مقدام بن معديكرب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما ملأ آدمي وعاء شرا من بطن بحسب ابن آدم أكلات يقمن صلبه فإن كان لا محالة فثلث لطعامه وثلث لشرابه وثلث لنفسه ‏\"‏ ‏.‏  حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، نحوه ‏.‏ وقال المقدام بن معديكرب عن النبي صلى الله عليه وسلم ولم يذكر فيه سمعت النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Miqdam bin Ma'dikarib said:                      \"I heard the Messenger of Allah (S.a.w) saying:'The human does not fill any container that is worse than his stomach. It is sufficient for the son of Adam to eat what will support his back. If this is not possible, then a third for food, a third for drink, and third for his breath.\"",
      "chain": [
        "38265",
        "20025",
        "20736",
        "28090",
        "10978"
      ]
    },
    {
      "hadith_no": "2624",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن محمد بن زياد الألهاني، قال سمعت أبا أمامة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ وعدني ربي أن يدخل الجنة من أمتي سبعين ألفا لا حساب عليهم ولا عذاب مع كل ألف سبعون ألفا وثلاث حثيات من حثياته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Umamah narrated the Messenger of Allah (s.a.w)said:                     \"My Lord promised me that seventy thousand of my Ummah shall be admitted into Paradise without a reckoning against them, Nor any punishment. With every thousand, are seventy thousand and three measures from the measures of my Lord.\"",
      "chain": [
        "36540",
        "20736",
        "11720",
        "4048"
      ]
    },
    {
      "hadith_no": "2695",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، عن تميم بن عطية، قال كثيرا ما كنت أسمع مكحولا يسأل فيقول ندانم ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20736"
      ]
    },
    {
      "hadith_no": "2642",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، قال سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل خلق خلقه في ظلمة فألقى عليهم من نوره فمن أصابه من ذلك النور اهتدى ومن أخطأه ضل فلذلك أقول جف القلم على علم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah, the Blessed and Exalted, created His creation in darkness, then He cast His Light upon them, so whoever is touched by that light he is guided, and whoever is not, he goes astray. It is for this reason that I say that the pens have dried with Allah's knowledge.\"",
      "chain": [
        "36540",
        "20736",
        "19154",
        "5136",
        "29"
      ]
    },
    {
      "hadith_no": "3169",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة الحضرمي، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الجاهر بالقرآن كالجاهر بالصدقة والمسر بالقرآن كالمسر بالصدقة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ومعنى هذا الحديث أن الذي يسر بقراءة القرآن أفضل من الذي يجهر بقراءة القرآن لأن صدقة السر أفضل عند أهل العلم من صدقة العلانية وإنما معنى هذا عند أهل العلم لكى يأمن الرجل من العجب لأن الذي يسر العمل لا يخاف عليه العجب ما يخاف عليه من علانيته ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     that the Messenger of Allah (ﷺ) said: \"The one who recites the Qur'an aloud is like the one who gives charity publicly, and the one who recites the Qur'an quietly is like the one who gives charity secretly.\"",
      "chain": [
        "36540",
        "20736",
        "11422",
        "19940",
        "189"
      ]
    },
    {
      "hadith_no": "3345",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن أبي بكر بن أبي مريم الغساني، عن راشد بن سعد، عن سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم في هذه الآية‏:‏  ‏(‏قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم ‏)‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما إنها كائنة ولم يأت تأويلها بعد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Sa'd bin Abi Waqqas:                     from the Prophet (ﷺ), regarding this Ayah \"Say: He has the power to send torment on you from above or from under your feet...' the Prophet (ﷺ) said \"Indeed they shall be, even though they have not occurred as of yet.\"",
      "chain": [
        "36540",
        "20736",
        "19909",
        "9"
      ]
    },
    {
      "hadith_no": "3518",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن عبد الرحمن بن زياد بن أنعم، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التسبيح نصف الميزان والحمد لله يملؤه ولا إله إلا الله ليس لها دون الله حجاب حتى تخلص إليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏ وعبد الرحمن بن زياد بن أنعم هو الإفريقي وقد ضعفه أحمد بن حنبل ويحيى بن معين وعبد الله بن يزيد هو أبو عبد الرحمن الحبلي ‏.‏",
      "text_en": " Abdullah bin Amr narrated that the Messenger of Allah said:                     “At-Tasbih is half of the Scale, and All praise is due to Allah (Al-Hamdulillah)’ fills it, and (as for) None has the right to be worshipped but Allah (La Ilaha Illallah)’ - there is no barrier to it from Allah until it reaches Him.”",
      "chain": [
        "36540",
        "20736",
        "28326",
        "1945",
        "29"
      ]
    },
    {
      "hadith_no": "3526",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن عبد الله بن عبد الرحمن بن أبي حسين، عن شهر بن حوشب، عن أبي أمامة الباهلي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أوى إلى فراشه طاهرا يذكر الله حتى يدركه النعاس لم ينقلب ساعة من الليل يسأل الله شيئا من خير الدنيا والآخرة إلا أعطاه الله إياه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وقد روي هذا أيضا عن شهر بن حوشب عن أبي ظبية عن عمرو بن عبسة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Umamah Al-Bahili said:                     “I heard the Messenger of Allah saying: “Whoever goes to his, while in a state of purity and remembering Allah, until slumber overtakes him, he shall not get up at any hour of the night and ask Allah for something from the good of the world and the Hereafter except that Allah shall grant it to him.’”",
      "chain": [
        "36540",
        "20736",
        "11251",
        "11044",
        "4048"
      ]
    },
    {
      "hadith_no": "3528",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا فزع أحدكم في النوم فليقل أعوذ بكلمات الله التامة من غضبه وعقابه وشر عباده ومن همزات الشياطين وأن يحضرون ‏.‏ فإنها لن تضره ‏\"‏ ‏.‏ قال وكان عبد الله بن عمرو يلقنها من بلغ من ولده ومن لم يبلغ منهم كتبها في صك ثم علقها في عنقه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Amr bin Shu’aib narrated from his father, from his grandfather, that the Messenger of Allah said:                     “When one of you becomes frightened during sleep, then let him say: ‘I seek refuge in Allah’s Perfect Words from His anger, His punishment, and the evil of His creatures, from the whisperings of the Shayatin, and that they should come (A’udhu Bikalimatillahit-Tammati Min Ghadabihi Wa Iqabihi Wa Sharri Ibadih, Wa Min Hamzatish-Shayatini Wa An Yahdurun).’ For verily, they shall not harm him.’”He said: “So Abdullah bin Amr used to teach it to those of his children who attained maturity, and those of them who did  not, he would write it on a sheet and then hang it around his neck.”",
      "chain": [
        "20387",
        "20736",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن محمد بن زياد، عن أبي راشد الحبراني، قال أتيت عبد الله بن عمرو بن العاصي فقلت له حدثنا مما، سمعت من، رسول الله صلى الله عليه وسلم ‏.‏ فألقى إلى صحيفة فقال هذا ما كتب لي رسول الله صلى الله عليه وسلم قال فنظرت فيها فإذا فيها إن أبا بكر الصديق رضى الله عنه قال يا رسول الله علمني ما أقول إذا أصبحت وإذا أمسيت ‏.‏ فقال ‏\"‏ يا أبا بكر قل اللهم فاطر السموات والأرض عالم الغيب والشهادة لا إله إلا أنت رب كل شيء ومليكه أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن أقترف على نفسي سوءا أو أجره إلى مسلم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Rashid Al-Hubrani said:                     “I came to Abdullah bin Amr and said to him: ‘Report something to me that you heard from the Messenger of Allah,’ so he set forth before me a scroll and said: ’This is what the Messenger of Allah wrote for me.’” He said: “So I looked in it and found in it: ‘Indeed, Abu Bakr As-Siddiq, may Allah be pleased with him, said: “O Messenger of Allah, teach me what to say at morning and afternoon.” He said: “O Abu Bakr, say: ‘O Allah, Creator of the heavens and the earth, Knower of the unseen and the seen, there is none worthy of worship except You, Lord of everything and its Owner, I seek refuge in You from the evil of my soul and from the evil of Shaitan and his Shirk, or that I should do some evil to myself or bring it upon a Muslim (Allahumma Fatiras-Samawati Wal-Ardi, Alimal-Ghaibi Wash-Shahdati, La Ilaha Illa Anta, Rabba Kulli Shai’in Wa Malikahu, A’udhu Bika Min Sharri Nafsi Wa Min Sharrish-Shaitani Wa Shirkihi, Wa An Aqtarifa Ala Nafsi Su’an, Aw Ajurrahu Ila Muslim).’”",
      "chain": [
        "36540",
        "20736",
        "11216",
        "17089"
      ]
    },
    {
      "hadith_no": "4144",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن عبد الله بن عثمان بن خثيم، عن سعيد بن راشد، عن يعلى بن مرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حسين مني وأنا من حسين أحب الله من أحب حسينا حسين سبط من الأسباط ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وإنما نعرفه من حديث عبد الله بن عثمان بن خثيم وقد رواه غير واحد عن عبد الله بن عثمان بن خثيم ‏.‏",
      "text_en": " Narrated Ya'la bin Murrah:                     that the Messenger of Allah (ﷺ) said: \"Husain is from me, and I am from Husain. Allah loves whoever loves Husain. Husain is a Sibt among the Asbat.\" [Asbat, plural of Sibt: A great tribe. Meaning, Al-Husain would have many offspring, such that they would become a great tribe. And this has indeed occurred. See Tuhfat Al-Ahwadhi (4/341).]",
      "chain": [
        "36540",
        "20736",
        "10644"
      ]
    },
    {
      "hadith_no": "4805",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عيسى بن يونس، قال حدثنا ضمرة، عن إسماعيل بن عياش، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عقل المرأة مثل عقل الرجل حتى يبلغ الثلث من ديتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said: 'The blood money of a woman (in the event of injury) is like the blood money of a man, up to one-third of the Diyah (for her life).\"",
      "chain": [
        "20347",
        "20738",
        "20736",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "78",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو عثمان البخاري، سعيد بن سعد قال حدثنا الهيثم بن خارجة، حدثنا إسماعيل، - يعني ابن عياش - عن عبد الوهاب بن مجاهد، عن مجاهد، عن أبي هريرة، وابن، عباس قالا الإيمان يزيد وينقص ‏.‏",
      "text_en": " It was narrated that Abu Hurairah and Ibn 'Abbas said:                     \"Faith increases and decreases.\"",
      "chain": [
        "30281",
        "20736",
        "11028",
        "13",
        "17"
      ]
    },
    {
      "hadith_no": "135",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، ح وحدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، وإسماعيل بن عياش، عن يحيى بن سعيد، عن سعيد بن المسيب، قال سمعت سعد بن أبي وقاص، يقول لقد جمع لي رسول الله  صلى الله عليه وسلم  يوم أحد أبويه فقال ‏\"‏ ارم سعد فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Musayyab said:                     \"I heard Sa'd bin Abu Waqqas say: 'The Messenger of Allah mentioned his parents together for me on the Day of Uhud. He said: 'Shoot, Sa'd! May my father and mother be sacrificed for you!'\"",
      "chain": [
        "30490",
        "20023",
        "30288",
        "20159",
        "20736",
        "11062",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن كثير بن مرة الحضرمي، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله اتخذني خليلا كما اتخذ إبراهيم خليلا فمنزلي ومنزل إبراهيم في الجنة يوم القيامة تجاهين والعباس بيننا مؤمن بين خليلين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah said: 'Allah has taken me as a close friend (Khalil) as He took Ibrahim as a close friend. So my house and the house of Ibrahim will be opposite to one another on the Day of Resurrection, and 'Abbas will be in between us, a believer between two close friends.'\" (Maudu')",
      "chain": [
        "38361",
        "20736",
        "10921",
        "10942",
        "19940",
        "29"
      ]
    },
    {
      "hadith_no": "556",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل بن عياش، عن عبد العزيز بن عبيد الله، عن محمد بن عمرو بن عطاء، قال رأيت السائب بن يزيد يشم ثوبه فقلت مم ذلك قال إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا وضوء إلا من ريح أو سماع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin 'Ata' said:                     \"I saw Sa'ib bin Khabbab sniffinf his garment, and I said: 'Why (are you doing) that?' He said: 'I heard the Messenger of Allah say: \"No ablution (is needed) unless there ia an odor or a sound.\"",
      "chain": [
        "30201",
        "20736",
        "28358",
        "11220"
      ]
    },
    {
      "hadith_no": "638",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقرأ القرآن الجنب ولا الحائض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: 'No one who is sexually impure and no woman who is menstruating should recite Qur'an.'\"",
      "chain": [
        "30288",
        "20736",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "639",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن وحدثنا أبو حاتم، حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقرأ الجنب والحائض شيئا من القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: 'No one who is sexually impure and no woman who is menstruating should recite anything of the Qur'an.'\"",
      "chain": [
        "38473",
        "30288",
        "20736",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "772",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، وعبد الوهاب بن الضحاك، قالا حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دخل أحدكم المسجد فليسلم على النبي  صلى الله عليه وسلم  ثم ليقل اللهم افتح لي أبواب رحمتك ‏.‏ وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"The Messenger of Allah said: 'When anyone of you enters the mosque, let him send peace upon the prophet, then let him say: \"Allahummaftah li abwaba rahmatika (O Allah, open to me the gates of Your mercy).\" And when he leaves, let him say: \"Allahumma inni as'aluka min fadlika. (O Allah, I ask of you from Your bounty).\"",
      "chain": [
        "10581",
        "38361",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    },
    {
      "hadith_no": "798",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن أنس بن مالك، عن عمر بن الخطاب، عن النبي  صلى الله عليه وسلم  أنه كان يقول ‏\"‏ من صلى في مسجد جماعة أربعين ليلة لا تفوته الركعة الأولى من صلاة العشاء كتب الله له بها عتقا من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that:                     The Prophet used to say: \"Whoever performs prayer in congregation at the mosque for forty nights, never missing the first Rak'ah of the 'Isha' prayer, Allah will thereby decree for him salvation from the Fire.\"",
      "chain": [
        "30203",
        "20736",
        "11894",
        "19",
        "3"
      ]
    },
    {
      "hadith_no": "909",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وهشام بن عمار، قالا حدثنا إسماعيل بن عياش، عن صالح بن كيسان، عن عبد الرحمن الأعرج، عن أبي هريرة، قال رأيت رسول الله  صلى الله عليه وسلم  يرفع يديه في الصلاة حذو منكبيه حين يفتتح الصلاة وحين يركع وحين يسجد ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “I saw the Messenger of Allah(ﷺ) raising his hands during prayer until they were parallel withhis shoulders when he started to pray, when he bowed and when heprostrated.”",
      "chain": [
        "30203",
        "30288",
        "20736",
        "11176",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "974",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا أبو بكر الهذلي، عن قتادة، عن الحسن، عن سمرة بن جندب، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا سلم الإمام فردوا عليه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Samurah bin Jundub that the Prophet (ﷺ) said:                     “Whenthe Imam says the Salam, then respond to him.”",
      "chain": [
        "30288",
        "20736",
        "19225",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "1048",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله وملائكته يصلون على الذين يصلون الصفوف ومن سد فرجة رفعه الله بها درجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)said:‘Allah and His angels send blessings upon those who complete therows, and whoever fills a gap, Allah will raise him one degree instatus thereby.’”",
      "chain": [
        "30288",
        "20736",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1220",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال أتانا رسول الله  صلى الله عليه وسلم  في بني عبد الأشهل فصلى بنا المغرب في مسجدنا ثم قال ‏\"‏ اركعوا هاتين الركعتين في بيوتكم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We came to the MessengerofAllah (ﷺ) with Banu ‘Abdul-Ashhal, and he led us in praying theMaghrib in our mosque. Then he said: ‘Pray these two Rak’ah inyourhouses.’”",
      "chain": [
        "38361",
        "20736",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "1276",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، وعثمان بن أبي شيبة، قالا حدثنا إسماعيل بن عياش، عن عبيد الله بن عبيد، عن زهير بن سالم العنسي، عن عبد الرحمن بن جبير بن نفير، عن ثوبان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ في كل سهو سجدتان بعد ما يسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban said:                      “I heard the Messenger of Allah(ﷺ)say: ‘For every mistake there are two prostrations, after sayingthe Salam.’”",
      "chain": [
        "30288",
        "30203",
        "20736",
        "17023",
        "10942",
        "130"
      ]
    },
    {
      "hadith_no": "1278",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا الهيثم بن خارجة، حدثنا إسماعيل بن عياش، عن ابن جريج، عن ابن أبي مليكة، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أصابه قىء أو رعاف أو قلس أو مذى فلينصرف فليتوضأ ثم ليبن على صلاته وهو في ذلك لا يتكلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)said:‘Whoever vomits, has a nosebleed, belches, or emits prostaticfluid, should stop praying; perform ablution, then resume his prayer,and while he is in that state he should not speak.”",
      "chain": [
        "11222",
        "30281",
        "20736",
        "11070",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، حدثنا صفوان بن عمرو، عن يزيد بن خمير، عن عبد الله بن بسر، أنه خرج مع الناس يوم فطر أو أضحى فأنكر إبطاء الإمام وقال إن كنا لقد فرغنا ساعتنا هذه وذلك حين التسبيح ‏.‏",
      "text_en": " Yazidbin Khumair narrated that ‘Abdullah bin Busr went out with thepeople on the Day of Fitr or Adha, and he objected to the Imam’sdelay. He said:                      “We would have finished by this time.” And thatwasthe time of Tasbih.",
      "chain": [
        "38361",
        "20736",
        "10921",
        "10981",
        "3650"
      ]
    },
    {
      "hadith_no": "1617",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا ليث بن أبي سليم، عن نافع، عن ابن عمر، عن النبي  صلى الله عليه وسلم  ح وحدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، حدثنا الحجاج، عن نافع، عن ابن عمر، قال كان النبي  صلى الله عليه وسلم  إذا أدخل الميت القبر قال ‏\"‏ بسم الله وعلى ملة رسول الله ‏\"‏ ‏.‏ وقال أبو خالد مرة إذا وضع الميت في لحده قال ‏\"‏ بسم الله وعلى سنة رسول الله ‏\"‏ ‏.‏ وقال هشام في حديثه ‏\"‏ بسم الله وفي سبيل الله وعلى ملة رسول الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “When the deceased was placed inthe grave, the Prophet (ﷺ) would say: ‘Bismillah, wa ‘alamillatirasul-illah (In the Name of Allah and according to thereligion of theMessenger of Allah).’” Abu Khalid said on oneoccasion, when thedeceased was placed in the grave: “Bismillah wa‘ala sunnati rasul-illah (In the Name of Allah and according to theSunnah of theMessenger of Allah).” Hisham said in his narration:“Bismillah, wa fisabil-illah, wa ‘ala millati rasul-illah (Inthe Name of Allah, forthe sake of Allah and according to thereligion of the Messenger ofAllah).”",
      "chain": [
        "30288",
        "20736",
        "10957",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1647",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا عبد الله بن دينار، حدثنا حريز، مولى معاوية قال خطب معاوية بحمص فذكر في خطبته أن رسول الله  صلى الله عليه وسلم  نهى عن النوح ‏.‏",
      "text_en": " Jarir,the freed slave of Mu’awiyah, said:                      “Mu’awiyah delivered asermon in Hims, and in his sermon he mentioned that the Messenger ofAllah (ﷺ) forbade wailing.”",
      "chain": [
        "30288",
        "20736",
        "11183"
      ]
    },
    {
      "hadith_no": "1665",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا ثابت بن عجلان، عن القاسم، عن أبي أمامة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ يقول الله سبحانه ابن آدم إن صبرت واحتسبت عند الصدمة الأولى لم أرض لك ثوابا دون الجنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Umamah that the Prophet (ﷺ) said:                      “Allahsays:‘O son of Adam! If you are patient and seek reward at the momentoffirst shock, I will not approve of any reward for you less thanParadise.’”",
      "chain": [
        "30288",
        "20736",
        "11676",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "1887",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن محمد بن عبيد الله، عن عمرو بن شعيب، عن أبيه، عن جده، قال إنما سن رسول الله  صلى الله عليه وسلم  الزكاة في هذه الخمسة في الحنطة والشعير والتمر والزبيب والذرة ‏.‏",
      "text_en": " It was narrated from Amr bin:                     Shu'aib, form his father, that his grandfather said: “The Messenger of Allah only prescribed Zakat on these five things: wheat, barley, dates, raisins and corn.”",
      "chain": [
        "30288",
        "20736",
        "30213",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2070",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثني سليمان بن سليم الكلبي، عن يحيى بن جابر، عن حكيم بن معاوية، عن عمه، مخمر بن معاوية قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا شؤم وقد يكون اليمن في ثلاثة في المرأة والفرس والدار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hakim bin Mu'awiyah that his paternal uncle Mikhmar bin Mu'awiyah said:                     \"I heard the Messenger of Allah say: 'Do not believe in omens, and good fortune is only to be found in three things: A woman, a horse and a house.\"'",
      "chain": [
        "30288",
        "20736",
        "20730",
        "10978",
        "18212"
      ]
    },
    {
      "hadith_no": "2085",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا شرحبيل بن مسلم، قال سمعت أبا أمامة الباهلي، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الولد للفراش وللعاهر الحجر ‏\"‏ ‏.‏",
      "text_en": " Shurahbil bin Muslim said:                     \"I heard Abu Um Amah Al-Bahili say: 'I heard the Messenger of Allah say: \"The child is for the bed and the fornicator gets nothing.\"",
      "chain": [
        "30288",
        "20736",
        "17036",
        "4048"
      ]
    },
    {
      "hadith_no": "2092",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة، عن معاذ بن جبل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تؤذي امرأة زوجها إلا قالت زوجته من الحور العين لا تؤذيه قاتلك الله فإنما هو عندك دخيل أوشك أن يفارقك إلينا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin Jabal that:                     the Messenger of Allah said: \"No woman annoys her husband but his wife among houris (of Paradise) safs: 'Do not annoy him, may Allah destroy you, for he is just a temporary guest with you and soon he will leave you and join us.\"'",
      "chain": [
        "38361",
        "20736",
        "11422",
        "19940",
        "32"
      ]
    },
    {
      "hadith_no": "2221",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب الزبيدي، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ما كسب الرجل كسبا أطيب من عمل يده وما أنفق الرجل على نفسه وأهله وولده وخادمه فهو صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miqdam bin Ma'dikarib (Ar- Zubaidi) that the Messenger of Allah (ﷺ) said:                     \"No man earns anything better than that which he earns with his own hands, and what a man spends on himself, his wife, his child and his servant, then it is charity.\"",
      "chain": [
        "30288",
        "20736",
        "11422"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أجملوا في طلب الدنيا فإن كلا ميسر لما خلق له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that the Messenger of Allah (ﷺ) said:                     Be moderate in seeking worldly things, for everyone will be facilitated for which he was created.\"",
      "chain": [
        "30288",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    },
    {
      "hadith_no": "2293",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، ح وحدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، قالا حدثنا محمد بن إسحاق، عن معبد بن كعب بن مالك، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إياكم والحلف في البيع فإنه ينفق ثم يمحق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah that the Messenger of Allah (ﷺ), said:                     \"Beware of swearing oaths when selling, for it may help you to make a sale but it destroys the blessing.\"'",
      "chain": [
        "30460",
        "20246",
        "30288",
        "20736",
        "11107",
        "1134",
        "391"
      ]
    },
    {
      "hadith_no": "2316",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا محمد بن عبد الرحمن اليحصبي، عن عبد الله بن بسر المازني، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ كيلوا طعامكم يبارك لكم فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah bin Busr Al-Mazini said:                     \"I heard the Messenger of Allah (ﷺ) say: 'Measure your food, may you be blessed therein.\"'",
      "chain": [
        "30288",
        "20736",
        "3650"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثني شرحبيل بن مسلم الخولاني، قال سمعت أبا أمامة الباهلي، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تنفق المرأة من بيتها شيئا إلا بإذن زوجها ‏\"‏ ‏.‏ قالوا يا رسول الله ولا الطعام قال ‏\"‏ ذلك أفضل أموالنا ‏\"‏ ‏.‏",
      "text_en": " Shurahbil bin Muslim Al-Khawlani said:                     I heard Abu Umamah Al-Bahili say: I heard the Messenger of Allah (ﷺ) say: \" No woman should spend anything from her house without her husband's permission.\" They said: \"O Messenger of Allah, not even food?\" He said: \"That is among the best of our wealth.\"",
      "chain": [
        "30288",
        "20736",
        "17036",
        "4048"
      ]
    },
    {
      "hadith_no": "2359",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن موسى بن عقبة، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما رجل باع سلعة فأدرك سلعته بعينها عند رجل وقد أفلس ولم يكن قبض من ثمنها شيئا فهي له ‏.‏ وإن كان قبض من ثمنها شيئا فهو أسوة الغرماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Any man who sells a product with the man who has become bankrupt, and he has not taken any of its price, it belongs to him, but if he had taken any of its price, then he is like any other creditor.”",
      "chain": [
        "30288",
        "20736",
        "11106",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "2489",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا شرحبيل بن مسلم، قال سمعت أبا أمامة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العارية مؤداة والمنحة مردودة ‏\"‏ ‏.‏",
      "text_en": " Shurahbil Muslim said:                      I heard Abu Umamah say:“I heard the Messenger of Allah (ﷺ) say: 'Borrowed items are to be returned and an animal borrowed for milking is to be returned.”",
      "chain": [
        "30288",
        "20736",
        "17036",
        "4048"
      ]
    },
    {
      "hadith_no": "2497",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن عمار، والحسن بن عرفة، قالا حدثنا إسماعيل بن عياش، حدثني شرحبيل بن مسلم الخولاني، قال سمعت أبا أمامة الباهلي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الزعيم غارم والدين مقضي ‏\"‏ ‏.‏",
      "text_en": " Shurahbil bin Muslim Al-Khawlani said:                     I heard Abu Umamah Al-Bahil say: “I heard the Messenger of Allah(ﷺ) say: “The guarantor is responsible and the debt must be repaid.' ”",
      "chain": [
        "30288",
        "36540",
        "20736",
        "17036",
        "4048"
      ]
    },
    {
      "hadith_no": "2526",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثني عتبة بن حميد الضبي، عن يحيى بن أبي إسحاق الهنائي، قال سألت أنس بن مالك الرجل منا يقرض أخاه المال فيهدي له قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقرض أحدكم قرضا فأهدى له أو حمله على الدابة فلا يركبها ولا يقبله إلا أن يكون جرى بينه وبينه قبل ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Yahya bin Abu Ishaq Al-Huna'i said:                     “I asked Anas bin Malik: 'What if a man gives his brother a loan, then (the borrower) give him a gift?’ The Messenger of Allah (ﷺ) said: ‘If anyone of you borrow something then he gives (the lender) a gift or  gives him a ride on his riding-beast, he should not accept the gift or the ride, unless they used to treat each other in that manner beforehand.'”",
      "chain": [
        "30288",
        "20736",
        "14262",
        "19138",
        "19"
      ]
    },
    {
      "hadith_no": "2700",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا عباد بن كثير، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تعزروا فوق عشرة أسواط ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Do not punish with more than ten whips.”",
      "chain": [
        "30288",
        "20736",
        "24224",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2766",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا ابن الطباع، حدثنا إسماعيل بن عياش، عن إسحاق بن عبد الله بن أبي فروة، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، وعن عمرو بن شعيب، عن أبيه، عن جده، قال قتل رجل عبده عمدا متعمدا فجلده رسول الله صلى الله عليه وسلم مائة ونفاه سنة ومحا سهمه من المسلمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     “A man killed his slave deliberately and with malice aforethought, so the Messenger of Allah (ﷺ) gave him one hundred lashes, banished him for one year, and cancelled his share from among the Muslims.”",
      "chain": [
        "11222",
        "20736",
        "12009",
        "11150",
        "11181",
        "5",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2817",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا شرحبيل بن مسلم الخولاني، سمعت أبا أمامة الباهلي، يقول سمعت رسول الله صلى الله عليه وسلم يقول في خطبته عام حجة الوداع ‏\"‏ إن الله قد أعطى كل ذي حق حقه فلا وصية لوارث ‏\"‏ ‏.‏",
      "text_en": " Shurahbil bin Muslim Al-Khawlani narrated from Abu Umamah Al-Bahili that the heard :                     the Messenger of Allah (ﷺ) say in his sermon, during the year of the Farewell pilgrimage: “Allah (SWT) has given each person who has rights his rights, and there is no bequest for in heir.”",
      "chain": [
        "30288",
        "20736",
        "17036",
        "4048"
      ]
    },
    {
      "hadith_no": "2905",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثني بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ للشهيد عند الله ست خصال يغفر له في أول دفعة من دمه ويرى مقعده من الجنة ويجار من عذاب القبر ويأمن من الفزع الأكبر ويحلى حلة الإيمان ويزوج من الحور العين ويشفع في سبعين إنسانا من أقاربه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Miqdam bin Ma’dikarib that the Messenger ofAllah(ﷺ) said:                      “The martyr has six things (in store) with Allah: Heisforgiven from the first drop of his blood that is shed; he is shownhis place in Paradise; he is spared the torment of the grave; he iskept safe from the Great Fright; he is adorned with a garment offaith; he is married to (wives) from among the wide-eyed houris; andhe is permitted to intercede for seventy of his relatives.”",
      "chain": [
        "30288",
        "20736",
        "11422"
      ]
    },
    {
      "hadith_no": "2975",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، ح وحدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، قالا حدثنا عبد الله بن عثمان بن خثيم، عن القاسم بن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، عن جده عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ سيلي أموركم بعدي رجال يطفئون السنة ويعملون بالبدعة ويؤخرون الصلاة عن مواقيتها ‏\"‏ فقلت يا رسول الله إن أدركتهم كيف أفعل قال ‏\"‏ تسألني يا ابن أم عبد كيف تفعل لا طاعة لمن عصى الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Prophet (ﷺ)said:                     “Among those in charge of you, after I am gone, will be men whoextinguish the Sunnah and follow innovation. They will delay theprayer from its proper time.” I said: “O Messenger of Allah, if Iliveto see them, what should I do?” He said: “You ask me, O Ibn‘Abd, whatyou should do? There is no obedience to one who disobeysAllah.”",
      "chain": [
        "30547",
        "20204",
        "30288",
        "20736",
        "10644",
        "11648",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "3033",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا عمارة بن غزية الأنصاري، عن أبي حازم، عن سهل بن سعد الساعدي، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ما من ملب يلبي إلا لبى ما عن يمينه وشماله من حجر أو شجر أو مدر حتى تنقطع الأرض من ها هنا وها هنا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Sa’d As-Sa’idi that the Messenger ofAllah(ﷺ) said:                      “There is no (pilgrim) who recites the Talbiyah butthat which is to his right and left also recites it, rocks and treesand hills, to the farthest ends of the earth in each direction, fromhere and from there.”",
      "chain": [
        "30288",
        "20736",
        "11894",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3070",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا حميد بن أبي سوية، قال سمعت ابن هشام، يسأل عطاء بن أبي رباح عن الركن اليماني، وهو يطوف بالبيت فقال عطاء حدثني أبو هريرة أن النبي  صلى الله عليه وسلم  قال ‏\"‏ وكل به سبعون ملكا فمن قال اللهم إني أسألك العفو والعافية في الدنيا والآخرة ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار - قالوا آمين ‏\"‏ ‏.‏ فلما بلغ الركن الأسود قال يا أبا محمد ما بلغك في هذا الركن الأسود فقال عطاء حدثني أبو هريرة أنه سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من فاوضه فإنما يفاوض يد الرحمن ‏\"‏ ‏.‏ قال له ابن هشام يا أبا محمد فالطواف قال عطاء حدثني أبو هريرة أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ من طاف بالبيت سبعا ولا يتكلم إلا بسبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولاقوة إلا بالله محيت عنه عشر سيئات وكتبت له عشر حسنات ورفع له بها عشر درجات ومن طاف فتكلم وهو في تلك الحال خاض في الرحمة برجليه كخائض الماء برجليه ‏\"‏ ‏.‏",
      "text_en": " Humaidbin Abu Sawiyyah said:                      I heard Ibn Hisham asking ‘Ata’ bin AbuRabah about the Yemenite Corner, when he was performing Tawaf aroundthe House. ‘Ata’ said: Abu Hurairah told me that the Prophet(ﷺ) said: “Seventy angels have been appointed over it. Whoeversays: Allahumma inni as’alukal-‘afwa wal-‘afiyah fid-dunyawal-akhirah; Rabbana atina fid-dunya hasanah, wa fil-akhiratihasanah, wa qina ‘adhaban-Nar (O Allah, I ask You for pardon andwell-being in this world and in the Hereafter. Our Lord, give us goodin this world and good in the Hereafter and protect us from thetorment of the Fire), they say: Amin.” When he reached the BlackCorner (where the Black Stone is), he said: O Abu Muhammad! What haveyou heard about this Black Corner? ‘Ata’ said: Abu Hurairah toldme that he heard the Messenger of Allah (ﷺ) say: “Whoever facesit is facing the Hand of the Most Merciful.’”Ibn Hisham said to him: O Abu Muhammad, what about Tawaf? ‘Ata’ said: Abu Hurairah told me that he heard the Prophet (ﷺ) say: “Whoever performs Tawaf around the House seven times and does not say anything except: Subhan Allah wal-hamdu lillah, wa la ilaha illallah wa Allahu Akbar, wa la hawla wa la quwwata illa billah (Glory is to Allah, praise is to Allah, none has the right to be worshipping but Allah, and there is no power nor strength except with Allah), ten bad deeds will be erased from him, ten merits will be recorded for him, and he will be raised ten degrees in status. Whoever performs Tawaf and talks when he is in that situation, is wading in mercy like one who wades in water.”",
      "chain": [
        "30288",
        "20736",
        "13"
      ]
    },
    {
      "hadith_no": "3240",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا محمد بن إسحاق، عن يزيد بن أبي حبيب، عن أبي عياش الزرقي، عن جابر بن عبد الله، قال ضحى رسول الله  صلى الله عليه وسلم  يوم عيد بكبشين فقال حين وجههما ‏\"‏ إني وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين اللهم منك ولك عن محمد وأمته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) sacrificed two rams on the Day of ‘Eid. When he turnedthemto face towards the prayer direction he said: ‘Verily, I haveturned my face towards Him Who has created the heavens and the earth,as a monotheist, and I am not of the polytheists. Verily, my prayer,my sacrifice, my living, and my dying are for Allah, the Lord of allthat exists. He has no partner. And of this I have been commanded,andI am the first of the Muslims. [6:79,162-163] O Allah, from YoutoYou, on behalf of Muhammad and his nation.’”",
      "chain": [
        "30288",
        "20736",
        "11107",
        "11411",
        "34"
      ]
    },
    {
      "hadith_no": "3243",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا ابن عون، عن محمد بن سيرين، قال سألت ابن عمر عن الضحايا، أواجبة هي قال ضحى رسول الله  صلى الله عليه وسلم  والمسلمون من بعده وجرت به السنة ‏.‏",
      "text_en": " It wasnarrated that Muhammad bin Sirin said:                      “I asked Ibn ‘Umaraboutsacrifices and whether they are obligatory. He said: ‘TheMessengerof Allah (ﷺ) and the Muslims after him offered sacrifices,and thisis the Sunnah.’”",
      "chain": [
        "30288",
        "20736",
        "11071",
        "11035",
        "18"
      ]
    },
    {
      "hadith_no": "3244",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا الحجاج بن أرطاة، حدثنا جبلة بن سحيم، قال سألت ابن عمر ‏.‏ فذكر مثله سواء ‏.‏",
      "text_en": "",
      "chain": [
        "30288",
        "20736",
        "20580",
        "11329"
      ]
    },
    {
      "hadith_no": "3338",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا أبو بكر الهذلي، عن شهر بن حوشب، عن تميم الداري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يكون في آخر الزمان قوم يجبون أسنمة الإبل ويقطعون أذناب الغنم ألا فما قطع من حى فهو ميت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Tamim Dari said:                      “The Messenger of Allah (ﷺ)said:‘At the end of time there will be people who will cut offcamels’humps and sheep’s tails. But what is cut from a living animalisdead.’”",
      "chain": [
        "30288",
        "20736",
        "19225",
        "11044",
        "382"
      ]
    },
    {
      "hadith_no": "3447",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا ابن جريج، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أطعمه الله طعاما فليقل اللهم بارك لنا فيه وارزقنا خيرا منه ‏.‏ ومن سقاه الله لبنا فليقل اللهم بارك لنا فيه وزدنا منه فإني لا أعلم ما يجزئ من الطعام والشراب إلا اللبن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Whoever is given food by Allah, let him say: Allahumma bariklanafihi wa arzuqna khairan minhu (O Allah, bless it for us andprovideus with something better than it). And whoever is given milkto drinkby Allah, let him say: Allahumma barik lana fihi wa zidnaminhu (OAllah, bless it for us and give us more of it). For I do notknow ofany food or drink that suffices, apart from milk.”",
      "chain": [
        "30288",
        "20736",
        "11070",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3465",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك السلمي أبو الحارث، حدثنا إسماعيل بن عياش، حدثنا محمد بن طلحة، عن عثمان بن يحيى، عن ابن عباس، قال أول ما سمعنا بالفالوذج، أن جبريل، عليه السلام أتى النبي  صلى الله عليه وسلم  فقال إن أمتك تفتح عليهم الأرض فيفاض عليهم من الدنيا حتى إنهم ليأكلون الفالوذج ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ وما الفالوذج ‏\"‏ ‏.‏ قال يخلطون السمن والعسل جميعا ‏.‏ فشهق النبي  صلى الله عليه وسلم  لذلك شهقة ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The first we heard ofFaludhaj*was when Jibril (as) came to the Prophet (ﷺ) and said:‘The worldwill be opened for your nation and they will conquer theworld, untilthey eat Faludhaj.’ The Prophet (ﷺ) said: ‘What isFaludhaj?’He said: ‘They mix ghee and honey together.’ At that, theProphet(ﷺ) sobbed.”",
      "chain": [
        "20736",
        "20604",
        "18718",
        "17"
      ]
    },
    {
      "hadith_no": "3552",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا ابن جريج، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، قال أتي رسول الله  صلى الله عليه وسلم  بلبن وعن يمينه ابن عباس وعن يساره خالد بن الوليد فقال رسول الله  صلى الله عليه وسلم  لابن عباس ‏\"‏ أتأذن لي أن أسقي خالدا ‏\"‏ ‏.‏ قال ابن عباس ما أحب أن أوثر بسؤر رسول الله  صلى الله عليه وسلم  على نفسي أحدا ‏.‏ فأخذ ابن عباس فشرب وشرب خالد ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)wasbrought some milk. On his right was Ibn ‘Abbas and on his left wasKhalid bin Walid. The Messenger of Allah (ﷺ) said to Ibn ‘Abbas:‘Will you permit me to give Khalid to drink?’ Ibn ‘Abbas said:‘Iwould not like to give preference to anyone over myself when itcomesto the leftover drink of the Messenger of Allah (ﷺ). So Ibn‘Abbastook it and drank some, then Khalid drank some.”",
      "chain": [
        "30288",
        "20736",
        "11070",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3661",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن الله يوصيكم بأمهاتكم - ثلاثا - إن الله يوصيكم بآبائكم إن الله يوصيكم بالأقرب فالأقرب ‏\"‏ ‏.‏",
      "text_en": " Miqdam bin Ma'dikarib, may Allah be pleased with them, narrated that:                     Allah's Messenger said: \"Allah enjoins you to treat your mother's kindly\"-three times- \"Allah enjoins you to treat your fathers kindly, Allah enjoins you to treat the closest and the next closest kindly.\"",
      "chain": [
        "30288",
        "20736",
        "11422"
      ]
    },
    {
      "hadith_no": "3693",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل بن عياش، عن محمد بن زياد، عن أبي أمامة، قال أمرنا نبينا  صلى الله عليه وسلم  أن نفشي السلام ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"Our Prophet(ﷺ) commanded us to spread (the greeting of) peace.\"",
      "chain": [
        "30201",
        "20736",
        "11216",
        "405"
      ]
    },
    {
      "hadith_no": "4231",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، وإسماعيل بن عياش، قالا حدثنا أبو بكر بن أبي مريم، عن الوليد بن سفيان بن أبي مريم، عن يزيد بن قطيب السكوني، - وقال الوليد يزيد بن قطبة - عن أبي بحرية، عن معاذ بن جبل، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الملحمة الكبرى وفتح القسطنطينية وخروج الدجال في سبعة أشهر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin Jabal that the Prophet (ﷺ) said:                     \"The great fierce battle, the conquest of Constantinople and theemergence of Dajjal, will all happen within seven months.\"",
      "chain": [
        "30288",
        "20733",
        "20736",
        "27053",
        "17080",
        "19179",
        "19921",
        "32"
      ]
    }
  ],
  "total_hadiths": 82
}