{
  "id": "20743",
  "name": "Malazm bin 'Amr - Lazaym ملازم بن عمرو اليمامي - لزيم",
  "full_name": "Malazm bin 'Amr - Lazaym ملازم بن عمرو اليمامي - لزيم",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Yamama"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "al-Yemami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19919",
      "name": "'Abdullah bin Bdr bin 'Umayrh عبد الله بن بدر بن عميرة بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18585",
      "name": "'Abdullah bin al-N'man عبد الله بن النعمان السحيمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19053",
      "name": "Musa bin Njd'h al-Hnfy موسى بن نجدة الحنفي اليمامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22695",
      "name": "Hudhah bin Qays bin Talq هوذة بن قيس بن طلق",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "22529",
      "name": "Sraj bin 'Uqba bin Tlq سراج بن عقبة",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "25257",
      "name": "Muhammad bin Jabir bin Syar محمد بن جابر بن سيار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "29396",
      "name": "Zufar bin Abi Kathir al-Shaymi al-Hanfi زفر بن أبي كثير السحيمي الحنفي",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "students": [
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20193",
      "name": "Sulaiman bin Harb سليمان بن حرب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36649",
      "name": "Muhammad bin 'Isa bin al-Tibaa' محمد بن عيسى بن الطباع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30121",
      "name": "Ahmed bin al-Miqdam أحمد بن المقدام",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-182",
      "hadith_no": "182",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا ملازم بن عمرو الحنفي، حدثنا عبد الله بن بدر، عن قيس بن طلق، عن أبيه، قال قدمنا على نبي الله صلى الله عليه وسلم فجاء رجل كأنه بدوي فقال يا نبي الله ما ترى في مس الرجل ذكره بعد ما يتوضأ فقال ‏\"‏ هل هو إلا مضغة منه ‏\"‏ ‏.‏ أو قال - ‏\"‏ بضعة منه ‏\"‏ ‏.‏ قال أبو داود رواه هشام بن حسان وسفيان الثوري وشعبة وابن عيينة وجرير الرازي عن محمد بن جابر عن قيس بن طلق ‏.‏",
      "text_en": " Narrated Talq:                     We came upon the Prophet of Allah (ﷺ). A man came to him: he seemed to be a bedouin. He said: Prophet of Allah, what do you think about a man who touches his penis after performing ablution? He (ﷺ)  replied: That is only a part of his body.Abu Dawud said: The tradition has been transmitted through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20743",
        "19919",
        "19937",
        "5103"
      ]
    },
    {
      "id": "sunan-abi-daud-629",
      "hadith_no": "629",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا ملازم بن عمرو الحنفي، حدثنا عبد الله بن بدر، عن قيس بن طلق، عن أبيه، قال قدمنا على نبي الله صلى الله عليه وسلم فجاء رجل فقال يا نبي الله ما ترى في الصلاة في الثوب الواحد قال فأطلق رسول الله صلى الله عليه وسلم إزاره طارق به رداءه فاشتمل بهما ثم قام فصلى بنا نبي الله صلى الله عليه وسلم فلما أن قضى الصلاة قال ‏\"‏ أوكلكم يجد ثوبين ‏\"‏ ‏.‏",
      "text_en": " Narrated Talq ibn Ali al-Hanafi:                     We came to the Prophet (ﷺ), and a man came and said: Prophet of Allah, what do you say if one prays in a single garment? The Messenger of Allah (ﷺ) then took off his wrapper and combined it with his sheet, and put it on them. He got up and the Prophet of Allah (ﷺ) led us in prayer. When he finished the prayer, he said: Does every one of you have two garments?",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20743",
        "19919",
        "19937",
        "5103"
      ]
    },
    {
      "id": "sunan-abi-daud-1439",
      "hadith_no": "1439",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا ملازم بن عمرو، حدثنا عبد الله بن بدر، عن قيس بن طلق، قال زارنا طلق بن علي في يوم من رمضان وأمسى عندنا وأفطر ثم قام بنا تلك الليلة وأوتر بنا ثم انحدر إلى مسجده فصلى بأصحابه حتى إذا بقي الوتر قدم رجلا فقال أوتر بأصحابك فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا وتران في ليلة ‏\"‏ ‏.‏",
      "text_en": " Narrated Talq ibn Ali:                     Qays ibn Talq said: Talq ibn Ali visited us on a certain day during Ramadan. He remained with us till evening and broke fast with us. He then stood up and led us in the witr prayer. He then went to his mosque and led them in prayer. When the witr remained, he put forward another man and said: Lead your companions in the witr prayer, for I heard the Messenger of Allah (ﷺ) as saying: There are no two witrs during one night.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20743",
        "19919",
        "19937",
        "5103"
      ]
    },
    {
      "id": "sunan-abi-daud-2348",
      "hadith_no": "2348",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ملازم بن عمرو، عن عبد الله بن النعمان، حدثني قيس بن طلق، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا واشربوا ولا يهيدنكم الساطع المصعد فكلوا واشربوا حتى يعترض لكم الأحمر ‏\"‏ ‏.‏ قال أبو داود هذا مما تفرد به أهل اليمامة ‏.‏",
      "text_en": " Narrated Talq ibn Ali al-Yamami:                     The Messenger of Allah (ﷺ) said: Eat and drink; let not the white and ascending light prevent you from (eating and drinking); so eat and drink until the red light spreads horizontally.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20743",
        "18585",
        "19937",
        "5103"
      ]
    },
    {
      "id": "sunan-abi-daud-3575",
      "hadith_no": "3575",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عباس العنبري، حدثنا عمر بن يونس، حدثنا ملازم بن عمرو، حدثني موسى بن نجدة، عن جده، يزيد بن عبد الرحمن - وهو أبو كثير - قال حدثني أبو هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من طلب قضاء المسلمين حتى يناله ثم غلب عدله جوره فله الجنة ومن غلب جوره عدله فله النار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone seeks the office of judge among Muslims till he gets it and his justice prevails over his tyranny, he will go to Paradise; but the man whose tyranny prevails over his justice will go to Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20450",
        "20743",
        "19053",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-85",
      "hadith_no": "85",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا ملازم بن عمرو، عن عبد الله بن بدر، عن قيس بن طلق بن علي، هو الحنفي عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ وهل هو إلا مضغة منه أو بضعة منه ‏\"‏ ‏.‏ قال وفي الباب عن أبي أمامة ‏.‏ قال أبو عيسى وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم وبعض التابعين أنهم لم يروا الوضوء من مس الذكر وهو قول أهل الكوفة وابن المبارك ‏.‏ وهذا الحديث أحسن شيء روي في هذا الباب ‏.‏ وقد روى هذا الحديث أيوب بن عتبة ومحمد بن جابر عن قيس بن طلق عن أبيه ‏.‏ وقد تكلم بعض أهل الحديث في محمد بن جابر وأيوب بن عتبة ‏.‏ وحديث ملازم بن عمرو عن عبد الله بن بدر أصح وأحسن ‏.‏",
      "text_en": " Qais bin Talq bin Ali - [and he is] Al-Hanafi narrated from his father, that:                     the Prophet said: 'Is it other than a piece of his flesh?\" Or: \"part of him?\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20743",
        "19919",
        "19937",
        "5103"
      ]
    },
    {
      "id": "jami-al-tirmidhi-470",
      "hadith_no": "470",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا هناد، حدثنا ملازم بن عمرو، حدثني عبد الله بن بدر، عن قيس بن طلق بن علي، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا وتران في ليلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ واختلف أهل العلم في الذي يوتر من أول الليل ثم يقوم من آخره فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم نقض الوتر وقالوا يضيف إليها ركعة ويصلي ما بدا له ثم يوتر في آخر صلاته لأنه ‏\"‏ لا وتران في ليلة ‏\"‏ ‏.‏ وهو الذي ذهب إليه إسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا أوتر من أول الليل ثم نام ثم قام من آخر الليل فإنه يصلي ما بدا له ولا ينقض وتره ويدع وتره على ما كان ‏.‏ وهو قول سفيان الثوري ومالك بن أنس وابن المبارك والشافعي وأهل الكوفة وأحمد ‏.‏ وهذا أصح لأنه قد روي من غير وجه أن النبي صلى الله عليه وسلم قد صلى بعد الوتر ‏.‏",
      "text_en": " Qais bin Talq bin Ali narrated that :                     his father said: I heard Allah's Messenger saying: \"There are no two Witr in one night.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20743",
        "19919",
        "19937",
        "5103"
      ]
    },
    {
      "id": "jami-al-tirmidhi-705",
      "hadith_no": "705",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا ملازم بن عمرو، حدثني عبد الله بن النعمان، عن قيس بن طلق، حدثني أبي طلق بن علي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كلوا واشربوا ولا يهيدنكم الساطع المصعد وكلوا واشربوا حتى يعترض لكم الأحمر ‏\"‏ ‏.‏ قال وفي الباب عن عدي بن حاتم وأبي ذر وسمرة ‏.‏ قال أبو عيسى حديث طلق بن علي حديث حسن غريب من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم أنه لا يحرم على الصائم الأكل والشرب حتى يكون الفجر الأحمر المعترض ‏.‏ وبه يقول عامة أهل العلم ‏.‏",
      "text_en": " Ali bin Tariq narrated that :                     the Messenger of Allah said: \"Eat and drink, and do not be disturbed by the rising glow, eat and drink until the redness appears t you on the horizon.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20743",
        "18585",
        "19937"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1193",
      "hadith_no": "1193",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا هناد، حدثنا ملازم بن عمرو، قال حدثني عبد الله بن بدر، عن قيس بن طلق، عن أبيه، طلق بن علي قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا الرجل دعا زوجته لحاجته فلتأته وإن كانت على التنور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Talq bin Ali narrated that The Messenger of Allah said:                      “When a man calls his wife to fulfill his need, then let her come, even if she is at the oven.”",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20743",
        "19919",
        "19937"
      ]
    },
    {
      "id": "sunan-an-nasai-1679",
      "hadith_no": "1679",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هناد بن السري، عن ملازم بن عمرو، قال حدثني عبد الله بن بدر، عن قيس بن طلق، قال زارنا أبي طلق بن علي في يوم من رمضان فأمسى بنا وقام بنا تلك الليلة وأوتر بنا ثم انحدر إلى مسجد فصلى بأصحابه حتى بقي الوتر ثم قدم رجلا فقال له أوتر بهم فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا وتران في ليلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Talq said:                     \"My father, Talq bin 'Ali visited me one day in Ramadan and stayed with us until the evening. He led us in praying Qiyam that night and prayed witr with us. Then he went down to a masjid and led his companions in prayer until only witr was left. Then he told a man to go forward and said to him: 'Lead them in praying witr, for I heard the Messenger of Allah (ﷺ) say: There should not be two witrs in one night.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20743",
        "19919",
        "19937"
      ]
    },
    {
      "id": "sunan-ibn-majah-920",
      "hadith_no": "920",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ملازم بن عمرو، عن عبد الله بن بدر، أخبرني عبد الرحمن بن علي بن شيبان، عن أبيه، ‏.‏ علي بن شيبان - وكان من الوفد - قال خرجنا حتى قدمنا على رسول الله  صلى الله عليه وسلم  فبايعناه وصلينا خلفه فلمح بمؤخر عينه رجلا لا يقيم صلاته - يعني صلبه - في الركوع والسجود فلما قضى النبي  صلى الله عليه وسلم  الصلاة قال ‏\"‏ يا معشر المسلمين لا صلاة لمن لا يقيم صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Shaiban who was part of a delegation(to theProphet (ﷺ)) said:                      “We set out until we came to theMessenger ofAllah (ﷺ), and we gave him our oath of allegiance andperformedprayer behind him. He glanced out of the corner of his eyeat a manwho was not settling his spine when he bowed and prostrated.When theProphet (ﷺ) finished the prayer, he said: ‘O Muslims, thereis noprayer for the one who does not settle his spine when bowing andprostrating.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20743",
        "19919"
      ]
    },
    {
      "id": "sunan-ibn-majah-1056",
      "hadith_no": "1056",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ملازم بن عمرو، عن عبد الله بن بدر، حدثني عبد الرحمن بن علي بن شيبان، عن أبيه، علي بن شيبان - وكان من الوفد - قال خرجنا حتى قدمنا على النبي  صلى الله عليه وسلم  فبايعناه وصلينا خلفه ثم صلينا وراءه صلاة أخرى فقضى الصلاة فرأى رجلا فردا يصلي خلف الصف ‏.‏ قال فوقف عليه نبي الله  صلى الله عليه وسلم  حين انصرف قال ‏\"‏ استقبل صلاتك لا صلاة للذي خلف الصف ‏\"‏ ‏.‏",
      "text_en": " ‘Abdur-Rahman bin ‘Ali bin Shaiban narrated that his father, ‘AlibinShaiban, who was part of the delegation, said:                      “We set outuntil wecame to the Prophet (ﷺ). We gave him our oath ofallegiance andperformed prayer behind him. Then we offered anotherprayer behindhim. He finished the prayer and saw a man on his own,praying behindthe row.” He said: “The Prophet of Allah (ﷺ)stood beside him andwhen he finished he said: ‘Repeat your prayer;there is no prayer forthe one who is behind the row.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20743",
        "19919"
      ]
    }
  ],
  "total_hadiths": 12
}