{
  "id": "20746",
  "name": "Abu Ja'far al-Razi أبو جعفر الرازي",
  "full_name": "Abu Ja'far al-Razi أبو جعفر الرازي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "90",
      "date_gregorian": "NA",
      "date_display": [
        "90 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Merv",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra",
      "al-Ray",
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  4  -  صدوق ]"
    ],
    "tags": [
      "al-Tamimi",
      "B.Taym",
      "Client",
      "al-Mervazi",
      "al-Ray"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "28281",
      "name": "'Abdullah bin Abi Ja'far al-Razi عبد الله بن أبي جعفر الرازي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "19844",
      "name": "al-Rabi' bin Anas al-Bakry الربيع بن أنس البكري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30588",
      "name": "'Abdur Rahman bin Abd عبد الرحمن بن عبد الله بن سعد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28221",
      "name": "Salmah bin al-Fadl al-Abrash سلمة بن الفضل الأبرش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24332",
      "name": "'Umar bin Shqyq bin Asma'a عمر بن شقيق بن أسماء الجرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20310",
      "name": "Ishaq bin Sulaiman al-Razi إسحاق بن سليمان الرازي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1182",
      "hadith_no": "1182",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن الفرات بن خالد أبو مسعود الرازي، أخبرنا محمد بن عبد الله بن أبي جعفر الرازي، عن أبيه، عن أبي جعفر الرازي، قال أبو داود وحدثت عن عمر بن شقيق، حدثنا أبو جعفر الرازي، - وهذا لفظه وهو أتم - عن الربيع بن أنس، عن أبي العالية، عن أبى بن كعب، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم وإن النبي صلى الله عليه وسلم صلى بهم فقرأ بسورة من الطول وركع خمس ركعات وسجد سجدتين ثم قام الثانية فقرأ سورة من الطول وركع خمس ركعات وسجد سجدتين ثم جلس كما هو مستقبل القبلة يدعو حتى انجلى كسوفها ‏.‏",
      "text_en": " Narrated Ubayy b. Ka'b:                     An eclipse of the sun took place in the time of the Messenger of Allah (ﷺ).  The Prophet (ﷺ) led them in prayer.  He recited one of the long surahs, bowing five times and prostrating himself twice.  He then stood up for the second rak'ah, recited one of the long surahs, bowed firve times, prostrated himself twice, then sat where he was facing the qiblah and made the supplication till the eclipse was over.",
      "usc_msa_ref": "",
      "chain": [
        "38044",
        "38528",
        "28281",
        "20746",
        "24332",
        "20746",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "id": "sunan-abi-daud-2571",
      "hadith_no": "2571",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن علي، حدثنا خالد بن يزيد، حدثنا أبو جعفر الرازي، عن الربيع بن أنس، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عليكم بالدلجة فإن الأرض تطوى بالليل ‏\"‏ ‏.‏",
      "text_en": " Anas reported the Apostle of Allaah(ﷺ) as saying “Keep to travelling by night, for the earth is traversed (more easily) by night.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "11408",
        "20746",
        "19844",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2983",
      "hadith_no": "2983",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عباس بن عبد العظيم، حدثنا يحيى بن أبي بكير، حدثنا أبو جعفر الرازي، عن مطرف، عن عبد الرحمن بن أبي ليلى، قال سمعت عليا، يقول ولاني رسول الله صلى الله عليه وسلم خمس الخمس فوضعته مواضعه حياة رسول الله صلى الله عليه وسلم وحياة أبي بكر وحياة عمر فأتي بمال فدعاني فقال خذه ‏.‏ فقلت لا أريده ‏.‏ قال خذه فأنتم أحق به ‏.‏ قلت قد استغنينا عنه فجعله في بيت المال ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Abi Laila:                     I heard 'Ali say: The Messenger of Allah (ﷺ) assigned me the fifth (of the booty). I spent it on its beneficiaries during the lifetime of the Messenger of Allah (ﷺ) and Abu Bakr and of 'Umar. Some property was brought to him ('Umar) and he called me and said: Take it. I said: I dod not want it. He said: Take it ; you have right to it. I said: We do not need it. So he deposited in the government treasury.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20365",
        "20746",
        "11395",
        "11196",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-4178",
      "hadith_no": "4178",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا زهير بن حرب الأسدي، حدثنا محمد بن عبد الله بن حرب الأسدي، حدثنا أبو جعفر الرازي، عن الربيع بن أنس، عن جديه، قالا سمعنا أبا موسى، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقبل الله تعالى صلاة رجل في جسده شىء من خلوق ‏\"‏ ‏.‏ قال أبو داود جداه زيد وزياد ‏.‏",
      "text_en": " Al-Rabi' b. Anas, quoting his two grandfathers, said:                      We heard Abu Musa say: The Messenger of Allah (ﷺ) said: Allah does not  accept the prayer of a man who has any khaluq (perfume composed of saffron) on his body.Abu Dawud said: His grandfathers were Zaid and Ziyad.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20746",
        "19844"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2647-2",
      "hadith_no": "2647",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا نصر بن علي، قال حدثنا خالد بن يزيد العتكي، عن أبي جعفر الرازي، عن الربيع بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خرج في طلب العلم فهو في سبيل الله حتى يرجع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ورواه بعضهم فلم يرفعه ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"Whoever goes out seeking knowledge, then he is in Allah's cause until he returns.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "11408",
        "20746",
        "19844",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3300",
      "hadith_no": "3300",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبد الرحمن بن سعد، عن أبي جعفر الرازي، عن عطاء بن السائب، عن أبي عبد الرحمن السلمي، عن علي بن أبي طالب، قال صنع لنا عبد الرحمن بن عوف طعاما فدعانا وسقانا من الخمر فأخذت الخمر منا وحضرت الصلاة فقدموني فقرأت ‏:‏ ‏(‏ قل يا أيها الكافرون ‏)‏ لا أعبد ما تعبدون ونحن نعبد ما تعبدون ‏.‏ قال فأنزل الله تعالى ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى حتى تعلموا ما تقولون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abu 'Abdur-Rahman As-Sulami:                     that 'Ali bin Abi Talib said: \"'Abdur-Rahman bin 'Awf prepared some food for which he invited us, and he gave us some wine to drink. The wine began to affect us when it was time for Salat. So they encouraged me (to lead) and I recited: 'Say: O you disbelievers! I do not worship what you worship, and we worship what you worship' - so Allah, Most High, revealed: O you who believe! Do not approach Salat when you are in a drunken state until you know what you are saying (4:43).\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20746",
        "11068",
        "11359",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3690",
      "hadith_no": "3690",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو سعد، هو الصغاني عن أبي جعفر الرازي، عن الربيع بن أنس، عن أبي العالية، عن أبى بن كعب، أن المشركين، قالوا لرسول الله صلى الله عليه وسلم انسب لنا ربك ‏.‏ فأنزل الله ‏:‏ ‏(‏ قل هو الله أحد * الله الصمد ‏)‏ فالصمد الذي لم يلد ولم يولد لأنه ليس شيء يولد إلا سيموت وليس شيء يموت إلا سيورث وإن الله عز وجل لا يموت ولا يورث ‏:‏ ‏(‏ لم يكن له كفوا أحد ‏)‏ قال ‏\"‏ لم يكن له شبيه ولا عدل وليس كمثله شيء ‏\"‏ ‏.‏",
      "text_en": " Abu Al-Aliyah narrated from Ubayy bin Ka’b:                     “The idolaters were saying to the Messenger of Allah: ‘Name the lineage of your Lord for us.’ So Allah, Most High, revealed: Say: “He is Allah, the One. Allah As-Samad.” So As-Samad is ‘the One Who does not beget, nor is He begotten,’ because there is nothing born except it will die, and there is nothing that dies except that it will be inherited from, and verily. Allah, the Mighty and Sublime, does not die, nor is He inherited from. ‘And there is none comparable to Him.’ He said: ‘There is nothing similar to Him, nor equal to Him, nor is there anything like Him.’”",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20746",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3691",
      "hadith_no": "3691",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن أبي جعفر الرازي، عن الربيع، عن أبي العالية، أن النبي صلى الله عليه وسلم ذكر آلهتهم فقالوا انسب لنا ربك ‏.‏ قال فأتاه جبريل بهذه السورة ‏:‏ ‏(‏ قل هو الله أحد ‏)‏ ‏.‏ فذكر نحوه ولم يذكر فيه عن أبى بن كعب وهذا أصح من حديث أبي سعد وأبو سعد اسمه محمد بن ميسر وأبو جعفر الرازي اسمه عيسى وأبو العالية اسمه رفيع وكان عبدا أعتقته امرأة صابئة ‏.‏",
      "text_en": " Abu Al-Aliyah narrated:                     “The Prophet mentioned their (the idolater’s) gods, so they said: ‘Then name your Lord’s lineage for us.’” He said: “So Jibril, peace be upon him, came to him with this Surat: Say: “He is Allah, the One.” So he mentioned similarly, but he did not say in it: “From Ubayy bin Ka’b.” And this is more correct than the narration of Abu Sa’eed (no. 3364). Abu Sa’eed’s name is Muhammad bin Muyassar.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20340",
        "20746",
        "11618"
      ]
    },
    {
      "id": "sunan-an-nasai-1730",
      "hadith_no": "1730",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن موسى، قال حدثنا عبد الرحمن بن عبد الله بن سعد، قال حدثنا أبو جعفر الرازي، عن الأعمش، عن زبيد، وطلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ خالفهما حصين فرواه عن ذر عن ابن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Sa'eed bin Abdur-Rahman bin Abza narrated from his father, that:                     Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20746",
        "11060",
        "11335",
        "11356",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "id": "sunan-an-nasai-1785",
      "hadith_no": "1785",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أبو داود، قال حدثنا محمد بن سليمان، قال حدثنا أبو جعفر الرازي، عن محمد بن المنكدر، عن سعيد بن جبير، عن الأسود بن يزيد، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له صلاة صلاها من الليل فنام عنها كان ذلك صدقة تصدق الله عز وجل عليه وكتب له أجر صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'd bin Jubair, from Al-Aswad bin Yazid, that Aishah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever has the habit of praying at night but he sleeps and misses it, that is a charity that Allah (SWT) has given to him, and the reward of his prayer will be recorded for him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20746",
        "11048",
        "11050",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1786",
      "hadith_no": "1786",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن نصر، قال حدثنا يحيى بن أبي بكير، قال حدثنا أبو جعفر الرازي، عن محمد بن المنكدر، عن سعيد بن جبير، عن عائشة، أن رسول الله صلى الله عليه وسلم قال فذكر نحوه ‏.‏ قال أبو عبد الرحمن أبو جعفر الرازي ليس بالقوي في الحديث ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Jubair, from Aishah, that:                     The Messenger of Allah (ﷺ) said: and he mentioned something similar.",
      "usc_msa_ref": "",
      "chain": [
        "20365",
        "20746",
        "11048",
        "11050",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-73",
      "hadith_no": "73",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا أبو جعفر الرازي، عن الربيع بن أنس، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من فارق الدنيا على الإخلاص لله وحده وعبادته لا شريك له وإقام الصلاة وإيتاء الزكاة مات والله عنه راض ‏\"‏ ‏.‏ قال أنس وهو دين الله الذي جاءت به الرسل وبلغوه عن ربهم قبل هرج الأحاديث واختلاف الأهواء وتصديق ذلك في كتاب الله في آخر ما نزل يقول الله {فإن تابوا}‏ قال خلعوا الأوثان وعبادتها {وأقاموا الصلاة وآتوا الزكاة}‏ وقال في آية أخرى ‏{فإن تابوا وأقاموا الصلاة وآتوا الزكاة فإخوانكم في الدين}‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever departs this wold with sincerity towards Allah, worshipping Him alone with no partner, establishing regular prayer and paying Zakat, he dies while Allah is pleased with him.'\" Anas said: \"This is the religion of Allah which was brought by the Messengers, and which they conveyed from their Lord before there arose the confusion of people's chattering and conflicting desires.This is confirmed in the Book of Allah, in one of the Last Verses to be revealed, where Allah says: \"But if they repent.\" Renounce their idols and worshipping them; \"And establish Salat and give Zakat.\" And Allah says in another Verse.\" But if they repent, perform Salat and give Zakat, then they are your brethren in religion.\" (Da'if)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20355",
        "20746",
        "19844",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-74",
      "hadith_no": "74",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو حاتم، حدثنا عبيد الله بن موسى العبسي، حدثنا أبو جعفر الرازي، عن الربيع بن أنس، مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "20340",
        "20746"
      ]
    },
    {
      "id": "sunan-ibn-majah-2252",
      "hadith_no": "2252",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن محمد بن يحيى بن سعيد القطان، حدثنا هاشم بن القاسم، حدثنا أبو جعفر الرازي، عن عاصم، عن أبي المهلب، عن عبيد الله الإفريقي، عن أبي أمامة، قال نهى رسول الله  صلى الله عليه وسلم  عن بيع المغنيات وعن شرائهن وعن كسبهن وعن أكل أثمانهن ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"The Messenger of Allah, forbade selling or buying singing girls, and their wages, and consuming their price.\"",
      "usc_msa_ref": "",
      "chain": [
        "34011",
        "20390",
        "20746",
        "11080",
        "405"
      ]
    },
    {
      "id": "sunan-ibn-majah-3642",
      "hadith_no": "3642",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا إسحاق بن سليمان، عن أبي جعفر الرازي، عن حصين، عن الشعبي، عن بريدة بن الحصيب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا رقية إلا من عين أو حمة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Buraidah that the Messenger of Allah (ﷺ) said:                     “Thereis no Ruqyah except for the evil eye or from the sting of ascorpion.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20310",
        "20746",
        "15097",
        "11052",
        "3131"
      ]
    }
  ],
  "total_hadiths": 15
}