{
  "id": "22",
  "name": "Khalid bin al-Walid ( خالد بن الوليد بن المغيرة ( رضي الله عنه",
  "full_name": "Khalid bin al-Walid ( خالد بن الوليد بن المغيرة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "30",
      "date_gregorian": "592",
      "date_display": [
        "30 BH",
        "592 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "21",
      "date_gregorian": "642",
      "date_display": null,
      "place": "Hims, Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Commander",
      "Narrator [ خ  م  س  ق  -  صحابة ]"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "Late Muslim",
      "Mu'ta",
      "Conquest",
      "Hunain",
      "Scribe"
    ]
  },
  "parents": [
    {
      "id": "141",
      "name": "Lubaba bint al-Harith بنت الحارث ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "2026",
      "name": "Asma bint Anas al-Khatha'miyya ( أسماء بنت أنس بن مدرك الخثعمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "80",
      "name": "Najiyah/'Atika/Fakhta bint al-Walid ( ناجية/عاتكة/فاختة بنت الوليد بن المغيرة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2030",
      "name": "al-Walid bin al-Walid ( الوليد بن الوليد بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2032",
      "name": "Hurmila bin al-Walid ( حرملة بن الوليد بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2033",
      "name": "Hisham bin al-Walid ( هشام بن الوليد بن المغيرة المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2034",
      "name": "'Ammara bin al-Walid ( عمارة بن الوليد بن المغيرة المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "454",
      "name": "Fatima bint al-Walid b. al-Mughirah ( فاطمة بنت الوليد بن المغيرة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "2024",
      "name": "Suliaman bin Khalid bin al-Walid ( سليمان بن خالد بن الوليد المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2021",
      "name": "al-Muhajir bin Khalid bin al-Walid ( المهاجر بن خالد بن الوليد المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2022",
      "name": "'Abdur Rahman bin Khalid bin al-Walid ( عبد الرحمن بن خالد بن الوليد المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2023",
      "name": "'Abdullah bin Khalid bin al-Walid ( عبد الله بن خالد بن الوليد المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5304",
      "name": "al-Miqdam bin Ma'di Karb ( المقدام بن معدي كرب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4310",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن إسماعيل، عن قيس بن أبي حازم، قال سمعت خالد بن الوليد، يقول لقد انقطعت في يدي يوم موتة تسعة أسياف، فما بقي في يدي إلا صفيحة يمانية‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     On the day (of the battle of) Mu'tah, nine swords were broken in my hand, and nothing was left in my hand except a Yemenite sword of mine.",
      "chain": [
        "20348",
        "20012",
        "11418",
        "11046",
        "22"
      ]
    },
    {
      "hadith_no": "4311",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، قال سمعت خالد بن الوليد، يقول لقد دق في يدي يوم موتة تسعة أسياف، وصبرت في يدي صفيحة لي يمانية‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     On the day of Mu'tah, nine swords were broken in my hand and only a Yemenite sword of mine remained in my hand.",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "22"
      ]
    },
    {
      "hadith_no": "5445",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني أبو أمامة بن سهل بن حنيف الأنصاري، أن ابن عباس، أخبره أن خالد بن الوليد الذي يقال له سيف الله أخبره أنه، دخل مع رسول الله صلى الله عليه وسلم على ميمونة  وهى خالته وخالة ابن عباس  فوجد عندها ضبا محنوذا، قدمت به أختها حفيدة بنت الحارث من نجد، فقدمت الضب لرسول الله صلى الله عليه وسلم وكان قلما يقدم يده لطعام حتى يحدث به ويسمى له، فأهوى رسول الله صلى الله عليه وسلم يده إلى الضب، فقالت امرأة من النسوة الحضور أخبرن رسول الله صلى الله عليه وسلم ما قدمتن له، هو الضب يا رسول الله‏.‏ فرفع رسول الله صلى الله عليه وسلم يده عن الضب، فقال خالد بن الوليد أحرام الضب يا رسول الله قال ‏\"‏ لا ولكن لم يكن بأرض قومي فأجدني أعافه ‏\"‏‏.‏ قال خالد فاجتررته فأكلته ورسول الله صلى الله عليه وسلم ينظر إلى‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     That he went with Allah's Apostle to the house of Maimuna, who was his and Ibn `Abbas' aunt. He found with her a roasted mastigure which her sister Hufaida bint Al-Harith had brought from Najd. Maimuna presented the mastigure before Allah's Apostle who rarely started eating any (unfamiliar) food before it was described and named for him. (But that time) Allah's Apostle stretched his hand towards the (meat of the) mastigure whereupon a lady from among those who were present, said, \"You should inform Allah's Apostle of what you have presented to him. O Allah's Apostle! It is the meat of a mastigure.\" (On learning that) Allah's Apostle withdrew his hand from the meat of the mastigure. Khalid bin Al-Walid said, \"O Allah's Apostle! Is this unlawful to eat?\" Allah's Apostle replied, \"No, but it is not found in the land of my people, so I do not like it.\" Khalid said, \"Then I pulled the mastigure (meat) towards me and ate it while Allah's Apostle was looking at me.",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "5455",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي أمامة بن سهل، عن ابن عباس، عن خالد بن الوليد، قال أتي النبي صلى الله عليه وسلم بضب مشوي، فأهوى إليه ليأكل فقيل له إنه ضب، فأمسك يده، فقال خالد أحرام هو قال ‏\"‏ لا، ولكنه لا يكون بأرض قومي، فأجدني أعافه ‏\"‏‏.‏ فأكل خالد ورسول الله صلى الله عليه وسلم ينظر‏.‏ قال مالك عن ابن شهاب بضب محنوذ‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     \"A roasted mastigure was brought to the Prophet who stretched his hand towards it to eat it. But it was said to him, \"It is a mastigure.\" So he withdrew his hand. Khalid asked, \"Is it unlawful to eat?\" the Prophet said, \"No, but it is not found in the land of my people and that is why I do not like eating it.\" So Khalid started eating (it) while Allah's Apostle was looking at him. An-Nadr said: 'Al-Khazira' (is prepared) from bran while 'Al-Harira' is prepared from milk.",
      "chain": [
        "30026",
        "20467",
        "20115",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "5147",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أبو الطاهر، وحرملة، جميعا عن ابن وهب، قال حرملة أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي أمامة بن سهل بن حنيف الأنصاري، أن عبد الله، بن عباس أخبره أن خالد بن الوليد الذي يقال له سيف الله أخبره أنه، دخل مع رسول الله صلى الله عليه وسلم على ميمونة زوج النبي صلى الله عليه وسلم وهي خالته وخالة ابن عباس فوجد عندها ضبا محنوذا قدمت به أختها حفيدة بنت الحارث من نجد فقدمت الضب لرسول الله صلى الله عليه وسلم وكان قلما يقدم إليه طعام حتى يحدث به ويسمى له فأهوى رسول الله صلى الله عليه وسلم يده إلى الضب فقالت امرأة من النسوة الحضور أخبرن رسول الله صلى الله عليه وسلم بما قدمتن له ‏.‏ قلن هو الضب يا رسول الله ‏.‏ فرفع رسول الله صلى الله عليه وسلم يده فقال خالد بن الوليد أحرام الضب يا رسول الله قال ‏\"‏ لا ولكنه لم يكن بأرض قومي فأجدني أعافه ‏\"‏ ‏.‏ قال خالد فاجتررته فأكلته ورسول الله صلى الله عليه وسلم ينظر فلم ينهني ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported that Khalid b. Walid who is called the Sword of Allah had informed him that he visited Maimuna, the wife of Allah's Apostle (may peace be upon him), in the company of Allah's Messenger (may peace be upon him), and she was the sister of his mother (that of Khalid) and that of 'Ibn Abbas, and he found with her a roasted lizard which her sister Hufaida the daughter of al-Harith had brought from Najd, and she presented that lizard to Allah's Messenger (may peace be upon him). It was rare that some food was presented to the Holy Prophet (may peace be upon him) and it was not mentioned or named. While Allah's Messenger (may peace be upon him) was about to stretch forth his hand towards the lizard, a woman from amongst the women present there informed the Messenger of Allah (may peace be upon him) what they had presented to him. They said:                      Messenger of Allah, it is a lizard. Allah's Messenger (may peace be upon him) withdrew his hand, whereupon Khalid b. Walid said: Messenger of Allah, is a lizard forbidden? There opon he said: No, but it is not found in the land of my people, and I feel that I have no liking for it. Khalid said: I then chewed and ate it, and Allah's Messenger (may peace be upon him) was looking at me and he did not forbid (me to eat it).",
      "chain": [
        "20029",
        "30487",
        "20029",
        "20475",
        "11013",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "5148",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أبو بكر بن النضر، وعبد بن حميد، قال عبد أخبرني وقال أبو بكر، حدثنا  يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح بن كيسان، عن ابن شهاب، عن أبي، أمامة بن سهل عن ابن عباس، أنه أخبره أن خالد بن الوليد أخبره أنه، دخل مع رسول الله صلى الله عليه وسلم على ميمونة بنت الحارث وهى خالته فقدم إلى رسول الله صلى الله عليه وسلم لحم ضب جاءت به أم حفيد بنت الحارث من نجد وكانت تحت رجل من بني جعفر وكان رسول الله صلى الله عليه وسلم لا يأكل شيئا حتى يعلم ما هو ‏.‏ ثم ذكر بمثل حديث يونس وزاد في آخر الحديث وحدثه ابن الأصم عن ميمونة وكان في حجرها ‏.‏",
      "text_en": " Khalid b. Walid reported that he visited Maimuna daughter of al-Harith with the Messenger of Allah (may peace be upon him), and she was the sister of his mother. She presented to Allah's Messenger (may peace be upon him) the flesh of a lizard which Umm Hufaid daughter of al-Harith had brought from Najd, and she had been married to a person belonging to Banu Ja'far. It was the habit of Allah's Messenger (may peace be upon him) not to eat anything until he knew what that was. The rest of the hadith is the same but with this (addition):                     \" Ibn al-Asamm narrated it from Maimuna and he was under her care.\"",
      "chain": [
        "14443",
        "30553",
        "20436",
        "20184",
        "20150",
        "11176",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "2721",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن عياش، عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، وخالد بن الوليد، أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل ولم يخمس السلب ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i ; Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) gave judgement that the killer should have what was taken from the man he killed, and did not make this subject to division into fifths.",
      "chain": [
        "30116",
        "20736",
        "10921",
        "10942",
        "3051",
        "22"
      ]
    },
    {
      "hadith_no": "3790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن شبيب، وحيوة بن شريح الحمصي، قال حيوة حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير - زاد حيوة - وكل ذي ناب من السباع ‏.‏ قال أبو داود وهو قول مالك ‏.‏ قال أبو داود لا بأس بلحوم الخيل وليس العمل عليه ‏.‏ قال أبو داود وهذا منسوخ قد أكل لحوم الخيل جماعة من أصحاب النبي صلى الله عليه وسلم منهم ابن الزبير وفضالة بن عبيد وأنس بن مالك وأسماء ابنة أبي بكر وسويد بن غفلة وعلقمة وكانت قريش في عهد رسول الله صلى الله عليه وسلم تذبحها ‏.‏",
      "text_en": " Narrated Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) forbade us to eat horse-flesh, the flesh of mules and of asses. The narrator Haywah added: Every beast of prey with a fang.Abu Dawud said: This view is held by Malik.Abu Dawud said: There is no harm in (eating) horse-flesh and this tradition is not practised.Abu Dawud said: This tradition has been abrogated. A body of Companions of the Prophet (ﷺ) had eaten horse-flesh. OF them are: Ibn al-Zubair, Fudalah bin 'Ubaid, Anas bin Malik, Asma' daughter of Abu Bakr, Suwaid bin Ghaflah, 'Alqamah; the Quraish used to slaughter them (horses) during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "26010",
        "26010",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن أبي أمامة بن سهل بن حنيف، عن عبد الله بن عباس، عن خالد بن الوليد، أنه دخل مع رسول الله صلى الله عليه وسلم بيت ميمونة فأتي بضب محنوذ فأهوى إليه رسول الله صلى الله عليه وسلم بيده فقال بعض النسوة اللاتي في بيت ميمونة أخبروا النبي صلى الله عليه وسلم بما يريد أن يأكل منه فقالوا هو ضب ‏.‏ فرفع رسول الله صلى الله عليه وسلم يده ‏.‏ قال فقلت أحرام هو يا رسول الله قال ‏\"‏ لا ولكنه لم يكن بأرض قومي فأجدني أعافه ‏\"‏ ‏.‏ قال خالد فاجتررته فأكلته ورسول الله صلى الله عليه وسلم ينظر ‏.‏",
      "text_en": " Ibn ‘Abbas said on the authority of Khalid b. al-Walid that he entered the house of Maimunah along with the Messenger of Allah (ﷺ). A roasted lizard was offered to him. The Messenger of Allah (ﷺ) stretched his hand for it. Some of the women is going to eat. They said:                      It is a lizard. The Messenger of Allah (ﷺ) raised his hand. I (Khalid) asked: Is it forbidden, Messenger of Allah? He replied, No, but it is not found in the land of my people, so I find it distasteful. Khalid said: I then pulled it and ate it while The Messenger of Allah (ﷺ) was seeing.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "3806",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، حدثني أبو سلمة، سليمان بن سليم عن صالح بن يحيى بن المقدام، عن جده المقدام بن معديكرب، عن خالد بن الوليد، قال غزوت مع رسول الله صلى الله عليه وسلم خيبر فأتت اليهود فشكوا أن الناس قد أسرعوا إلى حظائرهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا لا تحل أموال المعاهدين إلا بحقها وحرام عليكم حمر الأهلية وخيلها وبغالها وكل ذي ناب من السباع وكل ذي مخلب من الطير ‏\"‏ ‏.‏",
      "text_en": " Narrated Khalid ibn al-Walid:                     I went with the Messenger of Allah (ﷺ) to fight at the battle of Khaybar, and the Jews came and complained that the people had hastened to take their protected property (as a booty), so the Messenger of Allah (ﷺ) said: The property of those who have been given a mules, every fanged beast of prey, and every bird with a talon are forbidden for you.",
      "chain": [
        "10581",
        "30373",
        "17038",
        "22"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، بهذا الإسناد نحوه ‏.‏ وفي الباب عن عوف بن مالك، وخالد بن الوليد، وأنس، وسمرة بن جندب، ‏.‏ وهذا حديث حسن صحيح ‏.‏ وأبو محمد هو نافع مولى أبي قتادة ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول الأوزاعي والشافعي وأحمد ‏.‏ وقال بعض أهل العلم للإمام أن يخرج من السلب الخمس ‏.‏ وقال الثوري النفل أن يقول الإمام من أصاب شيئا فهو له ومن قتل قتيلا فله سلبه فهو جائز وليس فيه الخمس ‏.‏ وقال إسحاق السلب للقاتل إلا أن يكون شيئا كثيرا فرأى الإمام أن يخرج منه الخمس كما فعل عمر بن الخطاب ‏.‏",
      "text_en": " Another Chain with similar meaningThere are narrations on this topic from 'Awf bin Malik, Khalid bin Al-Walid, Anas, and Samurah.This Hadith is Hasan Sahih. Abu Muhammad is Nafi' the freed slave of Abu Qatadah.This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. It is the view of Al-Awza'i, Ash-Shafi'i and Ahmad.Some of the people of knowledge said that the Imam takes Khumus from those goods. Ath-Thawri said:                      \"The Nafl is when the Imam says: 'Whoever got something, then it is his. And whoever killed a fighter, then his goods are his.' So it is allowed, and there is no Khumus taken from it.\" Ishaq said: \"The goods are for the one who did the killing, unless it is something that is a large amount.\" So he saw that the Imam could take the Khumus from that, just as 'Umar bin Al-Khattab did.",
      "chain": [
        "30421",
        "20005",
        "11062",
        "10805",
        "22",
        "19",
        "394"
      ]
    },
    {
      "hadith_no": "4316",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا كثير بن عبيد، عن محمد بن حرب، عن الزبيدي، قال أخبرني الزهري، عن أبي أمامة بن سهل، عن عبد الله بن عباس، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم أتي بضب مشوي فقرب إليه فأهوى إليه بيده ليأكل منه قال له من حضر يا رسول الله إنه لحم ضب ‏.‏ فرفع يده عنه فقال له خالد بن الوليد يا رسول الله أحرام الضب قال ‏\"‏ لا ولكن لم يكن بأرض قومي فأجدني أعافه ‏\"‏ ‏.‏ فأهوى خالد إلى الضب فأكل منه ورسول الله صلى الله عليه وسلم ينظر ‏.‏",
      "text_en": " It was narrated form Khaild bin Al-Walid that:                     a grilled mastigure was brought ot the Messenger of Allah and was placed near to him. He reached out his hand to eat it,m and someone who was present said: \"O Messenger of Allah, it is the meat of a mastigure: \" He withdrew his hand and Khaild bin Al-Walid said to him: \"O Messenger of Allah, is mastigure Haram?\" He said: \"No, but it is not found in the land of my p0eople, and I find it distasteful.\" He said: \"Then Khalid bent over the mastigure and ate some of it, and the Messenger of Allah was looking at him.\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "4317",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يعقوب بن إبراهيم، قال حدثنا أبي، عن صالح، عن ابن شهاب، عن أبي أمامة بن سهل، عن ابن عباس، أنه أخبره أن خالد بن الوليد أخبره أنه، دخل مع رسول الله صلى الله عليه وسلم على ميمونة بنت الحارث - وهي خالته - فقدم إلى رسول الله صلى الله عليه وسلم لحم ضب - وكان رسول الله صلى الله عليه وسلم لا يأكل شيئا حتى يعلم ما هو - فقال بعض النسوة ألا تخبرن رسول الله صلى الله عليه وسلم ما يأكل فأخبرته أنه لحم ضب فتركه قال خالد سألت رسول الله صلى الله عليه وسلم أحرام هو قال ‏\"‏ لا ولكنه طعام ليس في أرض قومي فأجدني أعافه ‏\"‏ ‏.‏ قال خالد فاجتررته إلى فأكلته ورسول الله صلى الله عليه وسلم ينظر ‏.‏ وحدثه ابن الأصم عن ميمونة وكان في حجرها ‏.‏",
      "text_en": " It was narrated from Ibn ' Abbas that:                     Khalid bin Al-Walid said that he entered upon Maimunah bint Al-Harith, who was his maternal aunt, with the Messenger of Allah, and some meat of a mastigure was offered to the Messenger of Allah The Messenger of Allah would not eat anything until he knew what it was. One of the women said: \"Why don't you tell the Messenger of Allah what he is eating?\" So she told him that it was the meat of a mastigure, and he stopped eating. Khalid said: \"I asked the Messenger of Allah 'Is it Haram?' He said: \"No but it is a food that is no9t known in the land of my people, and I find it distasteful.\"\" Khalid said: \" I pulled it over toward myself and ate it, and the Messenger of Allah was watching me.\" And Ibn Al-Asamm narrated it from Maimunah, and he was in her apartment.",
      "chain": [
        "30002",
        "20184",
        "20150",
        "11176",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "4331",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا بقية بن الوليد، قال حدثني ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل أكل لحوم الخيل والبغال والحمير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khalid bin al-walid that he heard the Messe4nger of Allah say:                     \"It is not permissible to eat the flesh of horses, mules or donkeys.\"",
      "chain": [
        "30123",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "4332",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير وكل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Khalid bin Al-Walid that:                     the Messenger of Allah forbade eating the flesh of horses, mules and donkeys, and any predator that has fangs.",
      "chain": [
        "38462",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا العباس بن عثمان، وعثمان بن إسماعيل الدمشقيان، قالا حدثنا الوليد بن مسلم، حدثنا شيبة بن الأحنف، عن أبي سلام الأسود، عن أبي صالح الأشعري، حدثني أبو عبد الله الأشعري، عن خالد بن الوليد، ويزيد بن أبي سفيان، وشرحبيل ابن حسنة، وعمرو بن العاص، كل هؤلاء سمعوا من، رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أتموا الوضوء ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khalid bin Walid, Yazid bin Abu Sufyan, Shurahbil bin Hasanah and 'Amr bin 'As that:                     They all heard the Messenger of Allah say: 'Complete the ablution. Woe to the heels because of Hell-fire.\"",
      "chain": [
        "20733",
        "27018",
        "10968",
        "17092",
        "17094",
        "22",
        "218",
        "722"
      ]
    },
    {
      "hadith_no": "3319",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، حدثني ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، قال نهى رسول الله  صلى الله عليه وسلم  عن لحوم الخيل والبغال والحمير ‏.‏",
      "text_en": " It wasnarrated that Khalid bin Walid said:                      “The Messenger of Allah(ﷺ)forbade the flesh of horses, mules and donkeys.”",
      "chain": [
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "3364",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، عن الزهري، عن أبي أمامة بن سهل بن حنيف، عن عبد الله بن عباس، عن خالد بن الوليد، أن رسول الله  صلى الله عليه وسلم  أتي بضب مشوي فقرب إليه فأهوى بيده ليأكل منه فقال له من حضره يا رسول الله إنه لحم ضب ‏.‏ فرفع يده عنه فقال له خالد يا رسول الله أحرام الضب قال ‏\"‏ لا ولكنه لم يكن بأرضي فأجدني أعافه ‏\"‏ ‏.‏ قال فأهوى خالد إلى الضب فأكل منه ورسول الله  صلى الله عليه وسلم  ينظر إليه ‏.‏",
      "text_en": " It wasnarrated from Khalid bin Walid that a grilled mastigure wasbroughtto the Messenger of Allah (ﷺ) and placed near him. Hestretched outhis hand to eat (some of it), then those who werepresent said:                      “OMessenger of Allah, it is the flesh of a mastigure.”He took hishand away, and Khalid said to him: “O Messenger of Allah,is amastigure unlawful?” He said: “No, but it is not found in my landand I find it distasteful.” He said: “Then Khalid bent over themastigure and ate some of it, and the Messenger of Allah (ﷺ) waslooking at him.”",
      "chain": [
        "30373",
        "20459",
        "11013",
        "405",
        "17",
        "22"
      ]
    }
  ],
  "total_hadiths": 18
}