{
  "id": "22016",
  "name": "Ishaq bin Ibrahim al-Hunaini إسحاق بن إبراهيم الحنيني",
  "full_name": "Ishaq bin Ibrahim al-Hunaini إسحاق بن إبراهيم الحنيني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "216",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Tursus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Madni",
      "Tursus"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "22172",
      "name": "Kathir bin 'Abdullah كثير بن عبد الله بن عمرو بن عوف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    }
  ],
  "students": [
    {
      "id": "30244",
      "name": "al-Hasan bin al-Sbah al-Bzar الحسن بن الصباح البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38412",
      "name": "'Ali bin Maymun al-Rqy علي بن ميمون الرقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38610",
      "name": "Muhammad bin al-Ndr bin Msawr محمد بن النضر بن مساور",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3063",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن النضر، قال سمعت الحنيني، قال قرأته غير مرة يعني كتاب قطيعة النبي صلى الله عليه وسلم ‏.‏ قال أبو داود وحدثنا غير واحد عن حسين بن محمد أخبرنا أبو أويس حدثني كثير بن عبد الله عن أبيه عن جده أن النبي صلى الله عليه وسلم أقطع بلال بن الحارث المزني معادن القبلية جلسيها وغوريها - قال ابن النضر وجرسها وذات النصب ثم اتفقا - وحيث يصلح الزرع من قدس ‏.‏ ولم يعط بلال بن الحارث حق مسلم وكتب له النبي صلى الله عليه وسلم ‏\"‏ هذا ما أعطى رسول الله صلى الله عليه وسلم بلال بن الحارث المزني أعطاه معادن القبلية جلسها وغورها وحيث يصلح الزرع من قدس ولم يعطه حق مسلم ‏\"‏ ‏.‏ قال أبو أويس حدثني ثور بن زيد عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم مثله زاد ابن النضر وكتب أبى بن كعب ‏.‏",
      "text_en": " Narrated Amr ibn Awf al-Muzani:                     The Prophet (ﷺ) assigned as a fief to Bilal ibn Harith al-Muzani the mines of al-Qabaliyyah, both those which lay on the upper side those and which lay on the lower side. The narrator, Ibn an-Nadr, added: \"also Jars and Dhat an-Nusub.\" The agreed version reads: \"and (the land) which is suitable for cultivation at Quds\". He did not assign to Bilal ibn al-Harith the right of any Muslim. The Prophet (ﷺ) wrote a document to him:  \"This is what the Messenger of Allah (ﷺ) assigned to Bilal ibn al-Harith al-Muzani. He gave him the mines of al-Qabaliyyah both those which lay on the upper and lower side, and that which is fit for cultivation at Quds. He did not give him the right of any Muslim.\"  The narrator AbuUways said: A similar tradition has been transmitted to me by Thawr ibn Zayd from Ikrimah on the authority of Ibn Abbas from the Prophet (ﷺ). Ibn an-Nadr added: Ubayy ibn Ka'b wrote it.",
      "chain": [
        "30386",
        "22016"
      ]
    }
  ],
  "total_hadiths": 1
}