{
  "id": "2201",
  "name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
  "full_name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "2",
      "date_gregorian": "NA",
      "date_display": [
        "2 AH"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah ",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحبة ]"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "2200",
      "name": "Makhrama bin Nawfal ( مخرمة بن نوفل القرشي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "590",
      "name": "'Atika bint 'Awf ( عاتكة بنت عوف بن عبد عوف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "2202",
      "name": "al-Salat bin Makhrama bin Nawfal ( الصلت بن مخرمة بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2203",
      "name": "Safwan bin Makhrama bin Nawfal ( صفوان بن مخرمة القرشي الزهري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2204",
      "name": "'Amir bin Makhrama bin Nawfal ( عامر بن مخرمة بن نوفل القرشي الزهري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "19535",
      "name": "Umm Bakr bint al-Miswar bin Makhrama أم بكر بنت المسور بن مخرمة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2200",
      "name": "Makhrama bin Nawfal ( مخرمة بن نوفل القرشي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "764",
      "name": "'Umayr/'Amr bin 'Auf ( عمير بن عوف مولى سهيل بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "167",
      "name": "Muhammad Ibn Maslama ( محمد بن مسلمة بن سلمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19535",
      "name": "Umm Bakr bint al-Miswar bin Makhrama أم بكر بنت المسور بن مخرمة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "858",
      "name": "Marwan bin al-Hakam bin Abi al-'As ( مروان بن الحكم بن أبي العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11717",
      "name": "'Auf bin al-Harith bin al-Tufayl عوف بن الحارث بن الطفيل بن سخبرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-926",
      "hadith_no": "926",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال حدثني علي بن حسين، عن المسور بن مخرمة، قال قام رسول الله صلى الله عليه وسلم فسمعته حين تشهد يقول ‏\"‏ أما بعد ‏\"‏‏.‏ تابعه الزبيدي عن الزهري‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     Once Allah's Apostle got up for delivering the Khutba and I heard him after \"Tashah-hud\" saying \"Amma ba'du.\"",
      "usc_msa_ref": "48",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11045",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-1233",
      "hadith_no": "1233",
      "source": "Sahih Bukhari",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، أن ابن عباس، والمسور بن مخرمة، وعبد الرحمن بن أزهر  رضى الله عنهم  أرسلوه إلى عائشة  رضى الله عنها  فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد صلاة العصر وقل لها إنا أخبرنا أنك تصلينهما وقد بلغنا أن النبي صلى الله عليه وسلم نهى عنها‏.‏ وقال ابن عباس وكنت أضرب الناس مع عمر بن الخطاب عنهما‏.‏ فقال كريب فدخلت على عائشة  رضى الله عنها  فبلغتها ما أرسلوني‏.‏ فقالت سل أم سلمة‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة‏.‏ فقالت أم سلمة  رضى الله عنها  سمعت النبي صلى الله عليه وسلم ينهى عنها ثم رأيته يصليهما حين صلى العصر، ثم دخل على وعندي نسوة من بني حرام من الأنصار فأرسلت إليه الجارية فقلت قومي بجنبه قولي له تقول لك أم سلمة يا رسول الله سمعتك تنهى عن هاتين وأراك تصليهما‏.‏ فإن أشار بيده فاستأخري عنه‏.‏ ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر وإنه أتاني ناس من عبد القيس فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏‏.‏",
      "text_en": " Narrated Kuraib:                     I was sent to Aisha by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar . They told me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr prayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the Prophet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to beat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha said, \"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They then told me to go to Um Salama with the same question with which t sent me to `Aisha. Um Salama replied, \"I heard the Prophet forbidding them. Later I saw him offering them immediately after he prayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the tribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand beside him and tell him that Um Salama says to you, \"O Allah's Apostle! I have heard you forbidding the offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves his hand then wait for him.' The slave girl did that. The Prophet beckoned her with his hand and she waited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have asked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to me and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that I have just prayed) are for those (missed) ones.",
      "usc_msa_ref": "325",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2201",
        "2216"
      ]
    },
    {
      "id": "sahih-bukhari-1719",
      "hadith_no": "1719",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، ومروان، قالا خرج النبي صلى الله عليه وسلم من المدينة زمن الحديبية في بضع عشرة مائة من أصحابه، حتى إذا كانوا بذي الحليفة قلد النبي صلى الله عليه وسلم الهدى وأشعر وأحرم بالعمرة‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama and Marwan:                     The Prophet set out from Medina with over one thousand of his companions (at the time of the Treaty of Hudaibiya) and when they reached Dhul-Hulaifa, the Prophet garlanded his Hadi and marked it and assumed Ihram for `Umra.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "20115",
        "11013",
        "10511",
        "2201",
        "20201"
      ]
    },
    {
      "id": "sahih-bukhari-1871",
      "hadith_no": "1871",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن إبراهيم بن عبد الله بن حنين، عن أبيه، أن عبد الله بن العباس، والمسور بن مخرمة، اختلفا بالأبواء، فقال عبد الله بن عباس يغسل المحرم رأسه‏.‏ وقال المسور لا يغسل المحرم رأسه‏.‏ فأرسلني عبد الله بن العباس إلى أبي أيوب الأنصاري، فوجدته يغتسل بين القرنين، وهو يستر بثوب، فسلمت عليه فقال من هذا فقلت أنا عبد الله بن حنين، أرسلني إليك عبد الله بن العباس، أسألك كيف كان رسول الله صلى الله عليه وسلم يغسل رأسه، وهو محرم، فوضع أبو أيوب يده على الثوب، فطأطأه حتى بدا لي رأسه ثم قال لإنسان يصب عليه اصبب‏.‏ فصب على رأسه، ثم حرك رأسه بيديه فأقبل بهما وأدبر وقال هكذا رأيته صلى الله عليه وسلم يفعل‏.‏",
      "text_en": " Narrated `Abdullah bin Hunain:                     `Abdullah bin Al-Abbas and Al-Miswar bin Makhrama differed at Al-Abwa'; Ibn `Abbas said that a Muhrim could wash his head; while Al-Miswar maintained that he should not do so. `Abdullah bin `Abbas sent me to Abu Aiyub Al-Ansari and I found him bathing between the two wooden posts (of the well) and was screened with a sheet of cloth. I greeted him and he asked who I was. I replied, \"I am `Abdullah bin Hunain and I have been sent to you by Ibn `Abbas to ask you how Allah's Apostle used to wash his head while in the state of lhram.\" Abu Aiyub Al-Ansari caught hold of the sheet of cloth and lowered it till his head appeared before me, and then told somebody to pour water on his head. He poured water on his head, and he (Abu Aiyub) rubbed his head with his hands by bringing them from back to front and from front to back and said, \"I saw the Prophet doing like this.\"",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11150",
        "11181",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2308",
      "hadith_no": "2308",
      "source": "Sahih Bukhari",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال وزعم عروة أن مروان بن الحكم، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ أحب الحديث إلى أصدقه‏.‏ فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بهم ‏\"‏‏.‏ وقد كان رسول الله صلى الله عليه وسلم انتظرهم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد فإن إخوانكم هؤلاء قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب بذلك فليفعل، ومن أحب منكم أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك لرسول الله صلى الله عليه وسلم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن، فارجعوا حتى يرفعوا إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم، ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakam and Al-Miswar bin Makhrama:                     When the delegates of the tribe of Hawazin after embracing Islam, came to Allah's Apostle, he got up. They appealed to him to return their properties and their captives. Allah's Apostle said to them, \"The most beloved statement to me is the true one. So, you have the option of restoring your properties or your captives, for I have delayed distributing them.\" The narrator added, Allah's Apostle c had been waiting for them for more than ten days on his return from Taif. When they realized that Allah's Apostle would return to them only one of two things, they said, \"We choose our captives.\" So, Allah's Apostle got up in the gathering of the Muslims, praised Allah as He deserved, and said, \"Then after! These brethren of yours have come to you with repentance and I see it proper to return their captives to them. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you wants to stick to his share till we pay him from the very first booty which Allah will give us then he can do so.\" The people replied, \"We agree to give up our shares willingly as a favor for Allah's Apostle.\" Then Allah's Apostle said, \"We don't know who amongst you has agreed and who hasn't. Go back and your chiefs may tell us your opinion.\" So, all of them returned and their chiefs discussed the matter with them and then they (i.e. their chiefs) came to Allah's Apostle to tell him that they (i.e. the people) had given up their shares gladly and willingly.",
      "usc_msa_ref": "503",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "858",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2539",
      "hadith_no": "2539",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا ابن أبي مريم، قال أخبرني الليث، عن عقيل، عن ابن شهاب، ذكر عروة أن مروان، والمسور بن مخرمة، أخبراه أن النبي صلى الله عليه وسلم قام حين جاءه وفد هوازن، فسألوه أن يرد إليهم أموالهم وسبيهم فقال ‏\"‏ إن معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما المال، وإما السبى، وقد كنت استأنيت بهم ‏\"‏‏.‏ وكان النبي صلى الله عليه وسلم انتظرهم بضع عشرة ليلة حين قفل من الطائف، فلما تبين لهم أن النبي صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام النبي صلى الله عليه وسلم في الناس، فأثنى على الله بما هو أهله، ثم قال ‏\"‏ أما بعد فإن إخوانكم جاءونا تائبين، وإني رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس طيبنا ذلك‏.‏ قال ‏\"‏ إنا لا ندري من أذن منكم ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس، فكلمهم عرفاؤهم، ثم رجعوا إلى النبي صلى الله عليه وسلم فأخبروه أنهم طيبوا وأذنوا، فهذا الذي بلغنا عن سبى هوازن‏.‏ وقال أنس قال عباس للنبي صلى الله عليه وسلم فاديت نفسي، وفاديت عقيلا‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegates of the tribe of Hawazin came to the Prophet and they requested him to return their properties and captives. The Prophet stood up and said to them, \"I have other people with me in this matter (as you see) and the most beloved statement to me is the true one; you may choose either the properties or the prisoners as I have delayed their distribution.\" The Prophet had waited for them for more than ten days since his arrival from Ta'if. So, when it became evident to them that the Prophet was not going to return them except one of the two, they said, \"We choose our prisoners.\" The Prophet got up amongst the people and glorified and praised Allah as He deserved and said, \"Then after, these brethren of yours have come to us with repentance, and I see it logical to return them the captives. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you likes to stick to his share till we recompense him from the very first war booty which Allah will give us, then he can do so (i.e. give up the present captives).\" The people unanimously said, \"We do that (return the captives) willingly.\" The Prophet said, \"We do not know which of you has agreed to it and which have not, so go back and let your leaders forward us your decision.\" So, all the people then went back and discussed the matter with their leaders who returned and informed the Prophet that all the people had willingly given their consent to return the captives. This is what has reached us about the captives of Hawazin. Narrated Anas that `Abbas said to the Prophet, \"I paid for my ransom and `Aqil's ransom.\"",
      "usc_msa_ref": "716",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2583",
      "hadith_no": "2583",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا الليث، قال حدثني عقيل، عن ابن شهاب، قال ذكر عروة أن المسور بن مخرمة، رضى الله عنهما ومروان أخبراه أن النبي صلى الله عليه وسلم حين جاءه وفد هوازن قام في الناس، فأثنى على الله بما هو أهله، ثم قال ‏\"‏ أما بعد، فإن إخوانكم جاءونا تائبين، وإني رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا ‏\"‏‏.‏ فقال الناس طيبنا لك‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama and Marwan:                     When the delegates of the tribe of Hawazin came to the Prophet he stood up amongst the people, Glorified and Praised Allah as He deserved, and said, \"Then after: Your brethren have come to you with repentance and I see it logical to return to them their captives; so whoever amongst you likes to do that as a favor, then he can do it, and whoever of you like to stick to his share till we give him his right from the very first Fai (war booty) (1) which Allah will bestow on us, then (he can do so).\" The people replied, \"We do that (to return the captives) willingly as a favor for your sake.\"",
      "usc_msa_ref": "",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2599",
      "hadith_no": "2599",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة  رضى الله عنهما  قال قسم رسول الله صلى الله عليه وسلم أقبية، ولم يعط مخرمة منها شيئا، فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم‏.‏ فانطلقت معه، فقال ادخل فادعه لي‏.‏ قال فدعوته له فخرج إليه، وعليه قباء منها، فقال ‏\"‏ خبأنا هذا لك ‏\"‏‏.‏ قال فنظر إليه، فقال رضي مخرمة‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     Allah's Apostle distributed some cloaks but did not give anything thereof to Makhrama. Makhrama said (to me), \"O son! accompany me to Allah's Apostle.\" When I went with him, he said, \"Call him to me.\" I called him (i.e. the Prophet ) for my father. He came out wearing one of those cloaks and said, \"We kept this (cloak) for you, (Makhrama).\" Makhrama looked at the cloak and said, \"Makhrama is pleased,\" (or the Prophet said), \"Is Makhrama pleased?\"",
      "usc_msa_ref": "771",
      "chain": [
        "30367",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2607",
      "hadith_no": "2607",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، أن مروان بن الحكم، والمسور بن مخرمة، أخبراه أن النبي صلى الله عليه وسلم قال حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم فقال لهم ‏\"‏ معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى وإما المال، وقد كنت استأنيت ‏\"‏‏.‏ وكان النبي صلى الله عليه وسلم انتظرهم بضع عشرة ليلة حين قفل من الطائف، فلما تبين لهم أن النبي صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام في المسلمين فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد فإن إخوانكم هؤلاء جاءونا تائبين، وإني رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس طيبنا يا رسول الله لهم‏.‏ فقال لهم ‏\"‏ إنا لا ندري من أذن منكم فيه ممن لم يأذن، فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم، ثم رجعوا إلى النبي صلى الله عليه وسلم فأخبروه أنهم طيبوا وأذنوا‏.‏ وهذا الذي بلغنا من سبى هوازن هذا آخر قول الزهري، يعني فهذا الذي بلغنا‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakam and Al-Miswar bin Makhrama:                     When the delegates of the tribe of Hawazin came to the Prophet they requested him to return their property and their captives. He said to them, \"This concerns also other people along with me as you see, and the best statement to me is the true one, so you may choose one of two alternatives; either the captives or the property and (I have not distributed the booty for) I have been waiting for you.\" When the Prophet had returned from Ta'if, he waited for them for more than ten nights. When they came to know that the Prophet would not return except one of the two, they chose their captives. The Prophet then stood up amongst the Muslims, Glorified and Praised Allah as He deserved, and then said, \"Then after: These brothers of yours have come to you with repentance and I see it proper to return their captives, so whoever amongst you likes to do that as a favor, then he can do it, and whoever of you wants to stick to his share till we pay him from the very first Fai (i.e. war booty) which Allah will give us, then he can do so.\" The people said, \"We return (the captives) to them willingly as a favor, O Allah's Apostle!\" The Prophet said, \"I do not know who of you has given his consent and who has not; so go back and your leaders may present your decision to me.\" The people went away, and their leaders discussed the matter with them, and then came to the Prophet to tell him that all of them had given their consent (to return the captives) willingly. (Az-Zuhn, the sub-narrator said, \"This is what we know about the captives, of Hawazin.\")",
      "usc_msa_ref": "778",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "858",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2657",
      "hadith_no": "2657",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا زياد بن يحيى، حدثنا حاتم بن وردان، حدثنا أيوب، عن عبد الله بن أبي مليكة، عن المسور بن مخرمة  رضى الله عنهما  قال قدمت على النبي صلى الله عليه وسلم أقبية فقال لي أبي مخرمة انطلق بنا إليه عسى أن يعطينا منها شيئا‏.‏ فقام أبي على الباب فتكلم، فعرف النبي صلى الله عليه وسلم صوته فخرج النبي صلى الله عليه وسلم ومعه قباء وهو يريه محاسنه وهو يقول ‏\"‏ خبأت هذا لك، خبأت هذا لك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     Some outer garments were received the Prophet and my father (Makhrama) said to me, \"Let us go to the Prophet so that he may give us something from the garments.\" So, my father stood at the door and spoke. The Prophet recognized his voice and came out carrying a garment and telling Makhrama the good qualities of that garment, adding, \"I have kept this for you, I have sent this for you.\"",
      "usc_msa_ref": "825",
      "chain": [
        "20217",
        "11015",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2711",
      "hadith_no": "2711",
      "source": "Sahih Bukhari",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عروة بن الزبير، أنه سمع مروان، والمسور بن مخرمة، رضى الله عنهما يخبران عن أصحاب، رسول الله صلى الله عليه وسلم قال لما كاتب سهيل بن عمرو يومئذ كان فيما اشترط سهيل بن عمرو على النبي صلى الله عليه وسلم أنه لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ فكره المؤمنون ذلك، وامتعضوا منه، وأبى سهيل إلا ذلك، فكاتبه النبي صلى الله عليه وسلم على ذلك، فرد يومئذ أبا جندل على أبيه سهيل بن عمرو، ولم يأته أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاء المؤمنات مهاجرات، وكانت أم كلثوم بنت عقبة بن أبي معيط ممن خرج إلى رسول الله صلى الله عليه وسلم يومئذ وهى عاتق، فجاء أهلها يسألون النبي صلى الله عليه وسلم أن يرجعها إليهم، فلم يرجعها إليهم لما أنزل الله فيهن ‏{‏إذا جاءكم المؤمنات مهاجرات فامتحنوهن الله أعلم بإيمانهن‏}‏ إلى قوله ‏{‏ولا هم يحلون لهن‏}‏‏.‏",
      "text_en": " Narrated Marwan and al-Miswar bin Makhrama:                     (from the companions of Allah's Apostle) When Suhail bin `Amr agreed to the Treaty (of Hudaibiya), one of the things he stipulated then, was that the Prophet should return to them (i.e. the pagans) anyone coming to him from their side, even if he was a Muslim; and would not interfere between them and that person. The Muslims did not like this condition and got disgusted with it. Suhail did not agree except with that condition. So, the Prophet agreed to that condition and returned Abu Jandal to his father Suhail bin `Amr. Thenceforward the Prophet returned everyone in that period (of truce) even if he was a Muslim. During that period some believing women emigrants including Um Kulthum bint `Uqba bin Abu Muait who came to Allah's Apostle and she was a young lady then. Her relative came to the Prophet and asked him to return her, but the Prophet did not return her to them for Allah had revealed the following Verse regarding women: \"O you who believe! When the believing women come to you as emigrants. Examine them, Allah knows best as to their belief, then if you know them for true believers, Send them not back to the unbelievers, (for) they are not lawful (wives) for the disbelievers, Nor are the unbelievers lawful (husbands) for them (60.10)",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-2732",
      "hadith_no": "2732",
      "source": "Sahih Bukhari",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، قال أخبرني الزهري، قال أخبرني عروة بن الزبير، عن المسور بن مخرمة، ومروان، يصدق كل واحد منهما حديث صاحبه قال خرج رسول الله صلى الله عليه وسلم زمن الحديبية، حتى كانوا ببعض الطريق قال النبي صلى الله عليه وسلم ‏\"‏ إن خالد بن الوليد بالغميم في خيل لقريش طليعة فخذوا ذات اليمين ‏\"‏‏.‏ فوالله ما شعر بهم خالد حتى إذا هم بقترة الجيش، فانطلق يركض نذيرا لقريش، وسار النبي صلى الله عليه وسلم حتى إذا كان بالثنية التي يهبط عليهم منها، بركت به راحلته‏.‏ فقال الناس حل حل‏.‏ فألحت، فقالوا خلأت القصواء، خلأت القصواء‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما خلأت القصواء، وما ذاك لها بخلق، ولكن حبسها حابس الفيل، ثم قال والذي نفسي بيده لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها ‏\"‏‏.‏ ثم زجرها فوثبت، قال فعدل عنهم حتى نزل بأقصى الحديبية، على ثمد قليل الماء يتبرضه الناس تبرضا، فلم يلبثه الناس حتى نزحوه، وشكي إلى رسول الله صلى الله عليه وسلم العطش، فانتزع سهما من كنانته، ثم أمرهم أن يجعلوه فيه، فوالله ما زال يجيش لهم بالري حتى صدروا عنه، فبينما هم كذلك، إذ جاء بديل بن ورقاء الخزاعي في نفر من قومه من خزاعة، وكانوا عيبة نصح رسول الله صلى الله عليه وسلم من أهل تهامة، فقال إني تركت كعب بن لؤى وعامر بن لؤى نزلوا أعداد مياه الحديبية، ومعهم العوذ المطافيل، وهم مقاتلوك وصادوك عن البيت‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لم نجئ لقتال أحد، ولكنا جئنا معتمرين، وإن قريشا قد نهكتهم الحرب، وأضرت بهم، فإن شاءوا ماددتهم مدة، ويخلوا بيني وبين الناس، فإن أظهر فإن شاءوا أن يدخلوا فيما دخل فيه الناس فعلوا، وإلا فقد جموا، وإن هم أبوا فوالذي نفسي بيده، لأقاتلنهم على أمري هذا حتى تنفرد سالفتي، ولينفذن الله أمره ‏\"‏‏.‏ فقال بديل سأبلغهم ما تقول‏.‏ قال فانطلق حتى أتى قريشا قال إنا قد جئناكم من هذا الرجل، وسمعناه يقول قولا، فإن شئتم أن نعرضه عليكم فعلنا، فقال سفهاؤهم لا حاجة لنا أن تخبرنا عنه بشىء‏.‏ وقال ذوو الرأى منهم هات ما سمعته يقول‏.‏ قال سمعته يقول كذا وكذا، فحدثهم بما قال النبي صلى الله عليه وسلم‏.‏ فقام عروة بن مسعود فقال أى قوم ألستم بالوالد قالوا بلى‏.‏ قال أولست بالولد قالوا بلى‏.‏ قال فهل تتهموني‏.‏ قالوا لا‏.‏ قال ألستم تعلمون أني استنفرت أهل عكاظ، فلما بلحوا على جئتكم بأهلي وولدي ومن أطاعني قالوا بلى‏.‏ قال فإن هذا قد عرض لكم خطة رشد، اقبلوها ودعوني آته‏.‏ قالوا ائته‏.‏ فأتاه فجعل يكلم النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم نحوا من قوله لبديل، فقال عروة عند ذلك أى محمد، أرأيت إن استأصلت أمر قومك هل سمعت بأحد من العرب اجتاح أهله قبلك وإن تكن الأخرى، فإني والله لأرى وجوها، وإني لأرى أوشابا من الناس خليقا أن يفروا ويدعوك‏.‏ فقال له أبو بكر امصص بظر اللات، أنحن نفر عنه وندعه فقال من ذا قالوا أبو بكر‏.‏ قال أما والذي نفسي بيده لولا يد كانت لك عندي لم أجزك بها لأجبتك‏.‏ قال وجعل يكلم النبي صلى الله عليه وسلم فكلما تكلم أخذ بلحيته، والمغيرة بن شعبة قائم على رأس النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر، فكلما أهوى عروة بيده إلى لحية النبي صلى الله عليه وسلم ضرب يده بنعل السيف، وقال له أخر يدك عن لحية رسول الله صلى الله عليه وسلم‏.‏ فرفع عروة رأسه فقال من هذا قالوا المغيرة بن شعبة‏.‏ فقال أى غدر، ألست أسعى في غدرتك وكان المغيرة صحب قوما في الجاهلية، فقتلهم، وأخذ أموالهم، ثم جاء فأسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أما الإسلام فأقبل، وأما المال فلست منه في شىء ‏\"‏‏.‏ ثم إن عروة جعل يرمق أصحاب النبي صلى الله عليه وسلم بعينيه‏.‏ قال فوالله ما تنخم رسول الله صلى الله عليه وسلم نخامة إلا وقعت في كف رجل منهم فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره، وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، فرجع عروة إلى أصحابه، فقال أى قوم، والله لقد وفدت على الملوك، ووفدت على قيصر وكسرى والنجاشي والله إن رأيت ملكا قط، يعظمه أصحابه ما يعظم أصحاب محمد صلى الله عليه وسلم محمدا، والله إن تنخم نخامة إلا وقعت في كف رجل منهم، فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، وإنه قد عرض عليكم خطة رشد، فاقبلوها‏.‏ فقال رجل من بني كنانة دعوني آته‏.‏ فقالوا ائته‏.‏ فلما أشرف على النبي صلى الله عليه وسلم وأصحابه، قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا فلان، وهو من قوم يعظمون البدن فابعثوها له ‏\"‏‏.‏ فبعثت له واستقبله الناس يلبون، فلما رأى ذلك قال سبحان الله ما ينبغي لهؤلاء أن يصدوا عن البيت، فلما رجع إلى أصحابه قال رأيت البدن قد قلدت وأشعرت، فما أرى أن يصدوا عن البيت‏.‏ فقام رجل منهم يقال له مكرز بن حفص‏.‏ فقال دعوني آته‏.‏ فقالوا ائته‏.‏ فلما أشرف عليهم قال النبي صلى الله عليه وسلم ‏\"‏ هذا مكرز وهو رجل فاجر ‏\"‏‏.‏ فجعل يكلم النبي صلى الله عليه وسلم، فبينما هو يكلمه إذ جاء سهيل بن عمرو‏.‏ قال معمر فأخبرني أيوب عن عكرمة، أنه لما جاء سهيل بن عمرو قال النبي صلى الله عليه وسلم ‏\"‏ لقد سهل لكم من أمركم ‏\"‏‏.‏ قال معمر قال الزهري في حديثه فجاء سهيل بن عمرو فقال هات، اكتب بيننا وبينكم كتابا، فدعا النبي صلى الله عليه وسلم الكاتب، فقال النبي صلى الله عليه وسلم ‏\"‏ بسم الله الرحمن الرحيم ‏\"‏‏.‏ قال سهيل أما الرحمن فوالله ما أدري ما هو ولكن اكتب باسمك اللهم‏.‏ كما كنت تكتب‏.‏ فقال المسلمون والله لا نكتبها إلا بسم الله الرحمن الرحيم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اكتب باسمك اللهم ‏\"‏‏.‏ ثم قال ‏\"‏ هذا ما قاضى عليه محمد رسول الله ‏\"‏‏.‏ فقال سهيل والله لو كنا نعلم أنك رسول الله ما صددناك عن البيت ولا قاتلناك، ولكن اكتب محمد بن عبد الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والله إني لرسول الله وإن كذبتموني‏.‏ اكتب محمد بن عبد الله ‏\"‏‏.‏ قال الزهري وذلك لقوله ‏\"‏ لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها ‏\"‏‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ على أن تخلوا بيننا وبين البيت فنطوف به ‏\"‏‏.‏ فقال سهيل والله لا تتحدث العرب أنا أخذنا ضغطة ولكن ذلك من العام المقبل فكتب‏.‏ فقال سهيل وعلى أنه لا يأتيك منا رجل، وإن كان على دينك، إلا رددته إلينا‏.‏ قال المسلمون سبحان الله كيف يرد إلى المشركين وقد جاء مسلما فبينما هم كذلك إذ دخل أبو جندل بن سهيل بن عمرو يرسف في قيوده، وقد خرج من أسفل مكة، حتى رمى بنفسه بين أظهر المسلمين‏.‏ فقال سهيل هذا يا محمد أول ما أقاضيك عليه أن ترده إلى‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنا لم نقض الكتاب بعد ‏\"‏‏.‏ قال فوالله إذا لم أصالحك على شىء أبدا‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فأجزه لي ‏\"‏‏.‏ قال ما أنا بمجيزه لك‏.‏ قال ‏\"‏ بلى، فافعل ‏\"‏‏.‏ قال ما أنا بفاعل‏.‏ قال مكرز بل قد أجزناه لك‏.‏ قال أبو جندل أى معشر المسلمين، أرد إلى المشركين وقد جئت مسلما ألا ترون ما قد لقيت وكان قد عذب عذابا شديدا في الله‏.‏ قال فقال عمر بن الخطاب فأتيت نبي الله صلى الله عليه وسلم فقلت ألست نبي الله حقا قال ‏\"‏ بلى ‏\"‏‏.‏ قلت ألسنا على الحق وعدونا على الباطل قال ‏\"‏ بلى ‏\"‏‏.‏ قلت فلم نعطي الدنية في ديننا إذا قال ‏\"‏ إني رسول الله، ولست أعصيه وهو ناصري ‏\"‏‏.‏ قلت أوليس كنت تحدثنا أنا سنأتي البيت فنطوف به قال ‏\"‏ بلى، فأخبرتك أنا نأتيه العام ‏\"‏‏.‏ قال قلت لا‏.‏ قال ‏\"‏ فإنك آتيه ومطوف به ‏\"‏‏.‏ قال فأتيت أبا بكر فقلت يا أبا بكر، أليس هذا نبي الله حقا قال بلى‏.‏ قلت ألسنا على الحق وعدونا على الباطل قال بلى‏.‏ قلت فلم نعطي الدنية في ديننا إذا قال أيها الرجل، إنه لرسول الله صلى الله عليه وسلم وليس يعصي ربه وهو ناصره، فاستمسك بغرزه، فوالله إنه على الحق‏.‏ قلت أليس كان يحدثنا أنا سنأتي البيت ونطوف به قال بلى، أفأخبرك أنك تأتيه العام قلت لا‏.‏ قال فإنك آتيه ومطوف به‏.‏ قال الزهري قال عمر فعملت لذلك أعمالا‏.‏ قال فلما فرغ من قضية الكتاب قال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ قوموا فانحروا، ثم احلقوا ‏\"‏‏.‏ قال فوالله ما قام منهم رجل حتى قال ذلك ثلاث مرات، فلما لم يقم منهم أحد دخل على أم سلمة، فذكر لها ما لقي من الناس‏.‏ فقالت أم سلمة يا نبي الله، أتحب ذلك اخرج ثم لا تكلم أحدا منهم كلمة حتى تنحر بدنك، وتدعو حالقك فيحلقك‏.‏ فخرج فلم يكلم أحدا منهم، حتى فعل ذلك نحر بدنه، ودعا حالقه فحلقه‏.‏ فلما رأوا ذلك، قاموا فنحروا، وجعل بعضهم يحلق بعضا، حتى كاد بعضهم يقتل بعضا غما، ثم جاءه نسوة مؤمنات فأنزل الله تعالى ‏{‏يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن‏}‏ حتى بلغ ‏{‏بعصم الكوافر‏}‏ فطلق عمر يومئذ امرأتين كانتا له في الشرك، فتزوج إحداهما معاوية بن أبي سفيان، والأخرى صفوان بن أمية، ثم رجع النبي صلى الله عليه وسلم إلى المدينة، فجاءه أبو بصير  رجل من قريش  وهو مسلم فأرسلوا في طلبه رجلين، فقالوا العهد الذي جعلت لنا‏.‏ فدفعه إلى الرجلين، فخرجا به حتى بلغا ذا الحليفة، فنزلوا يأكلون من تمر لهم، فقال أبو بصير لأحد الرجلين والله إني لأرى سيفك هذا يا فلان جيدا‏.‏ فاستله الآخر فقال أجل، والله إنه لجيد، لقد جربت به ثم جربت‏.‏ فقال أبو بصير أرني أنظر إليه، فأمكنه منه، فضربه حتى برد، وفر الآخر، حتى أتى المدينة، فدخل المسجد يعدو‏.‏ فقال رسول الله صلى الله عليه وسلم حين رآه ‏\"‏ لقد رأى هذا ذعرا ‏\"‏‏.‏ فلما انتهى إلى النبي صلى الله عليه وسلم قال قتل والله صاحبي وإني لمقتول، فجاء أبو بصير فقال يا نبي الله، قد والله أوفى الله ذمتك، قد رددتني إليهم ثم أنجاني الله منهم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ويل أمه مسعر حرب، لو كان له أحد ‏\"‏‏.‏ فلما سمع ذلك عرف أنه سيرده إليهم، فخرج حتى أتى سيف البحر‏.‏ قال وينفلت منهم أبو جندل بن سهيل، فلحق بأبي بصير، فجعل لا يخرج من قريش رجل قد أسلم إلا لحق بأبي بصير، حتى اجتمعت منهم عصابة، فوالله ما يسمعون بعير خرجت لقريش إلى الشأم إلا اعترضوا لها، فقتلوهم، وأخذوا أموالهم، فأرسلت قريش إلى النبي صلى الله عليه وسلم تناشده بالله والرحم لما أرسل، فمن أتاه فهو آمن، فأرسل النبي صلى الله عليه وسلم إليهم، فأنزل الله تعالى ‏{‏وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏}‏ حتى بلغ ‏{‏الحمية حمية الجاهلية‏}‏ وكانت حميتهم أنهم لم يقروا أنه نبي الله، ولم يقروا ببسم الله الرحمن الرحيم، وحالوا بينهم وبين البيت‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama and Marwan:                     (whose narrations attest each other) Allah's Apostle set out at the time of Al-Hudaibiya (treaty), and when they proceeded for a distance, he said, \"Khalid bin Al-Walid leading the cavalry of Quraish constituting the front of the army, is at a place called Al-Ghamim, so take the way on the right.\" By Allah, Khalid did not perceive the arrival of the Muslims till the dust arising from the march of the Muslim army reached him, and then he turned back hurriedly to inform Quraish. The Prophet went on advancing till he reached the Thaniya (i.e. a mountainous way) through which one would go to them (i.e. people of Quraish). The she-camel of the Prophet sat down. The people tried their best to cause the she-camel to get up but in vain, so they said, \"Al-Qaswa' (i.e. the she-camel's name) has become stubborn! Al-Qaswa' has become stubborn!\" The Prophet said, \"Al-Qaswa' has not become stubborn, for stubbornness is not her habit, but she was stopped by Him Who stopped the elephant.\" Then he said, \"By the Name of Him in Whose Hands my soul is, if they (i.e. the Quraish infidels) ask me anything which will respect the ordinances of Allah, I will grant it to them.\" The Prophet then rebuked the she-camel and she got up. The Prophet changed his way till he dismounted at the farthest end of Al-Hudaibiya at a pit (i.e. well) containing a little water which the people used in small amounts, and in a short while the people used up all its water and complained to Allah's Apostle; of thirst. The Prophet took an arrow out of his arrow-case and ordered them to put the arrow in that pit. By Allah, the water started and continued sprouting out till all the people quenched their thirst and returned with satisfaction. While they were still in that state, Budail bin Warqa-al- Khuza`i came with some persons from his tribe Khuza`a and they were the advisers of Allah's Apostle who would keep no secret from him and were from the people of Tihama. Budail said, \"I left Ka`b bin Luai and 'Amir bin Luai residing at the profuse water of Al-Hudaibiya and they had milch camels (or their women and children) with them, and will wage war against you, and will prevent you from visiting the Ka`ba.\" Allah's Apostle said, \"We have not come to fight anyone, but to perform the `Umra. No doubt, the war has weakened Quraish and they have suffered great losses, so if they wish, I will conclude a truce with them, during which they should refrain from interfering between me and the people (i.e. the 'Arab infidels other than Quraish), and if I have victory over those infidels, Quraish will have the option to embrace Islam as the other people do, if they wish; they will at least get strong enough to fight. But if they do not accept the truce, by Allah in Whose Hands my life is, I will fight with them defending my Cause till I get killed, but (I am sure) Allah will definitely make His Cause victorious.\" Budail said, \"I will inform them of what you have said.\" So, he set off till he reached Quraish and said, \"We have come from that man (i.e. Muhammad) whom we heard saying something which we will disclose to you if you should like.\" Some of the fools among Quraish shouted that they were not in need of this information, but the wiser among them said, \"Relate what you heard him saying.\" Budail said, \"I heard him saying so-and-so,\" relating what the Prophet had told him. `Urwa bin Mas`ud got up and said, \"O people! Aren't you the sons? They said, \"Yes.\" He added, \"Am I not the father?\" They said, \"Yes.\" He said, \"Do you mistrust me?\" They said, \"No.\" He said, \"Don't you know that I invited the people of `Ukaz for your help, and when they refused I brought my relatives and children and those who obeyed me (to help you)?\" They said, \"Yes.\" He said, \"Well, this man (i.e. the Prophet) has offered you a reasonable proposal, you'd better accept it and allow me to meet him.\" They said, \"You may meet him.\" So, he went to the Prophet and started talking to him. The Prophet told him almost the same as he had told Budail. Then `Urwa said, \"O Muhammad! Won't you feel any scruple in extirpating your relations? Have you ever heard of anyone amongst the Arabs extirpating his relatives before you? On the other hand, if the reverse should happen, (nobody will aid you, for) by Allah, I do not see (with you) dignified people, but people from various tribes who would run away leaving you alone.\" Hearing that, Abu Bakr abused him and said, \"Do you say we would run and leave the Prophet alone?\" `Urwa said, \"Who is that man?\" They said, \"He is Abu Bakr.\" `Urwa said to Abu Bakr, \"By Him in Whose Hands my life is, were it not for the favor which you did to me and which I did not compensate, I would retort on you.\" `Urwa kept on talking to the Prophet and seizing the Prophet's beard as he was talking while Al-Mughira bin Shu`ba was standing near the head of the Prophet, holding a sword and wearing a helmet. Whenever `Urwa stretched his hand towards the beard of the Prophet, Al-Mughira would hit his hand with the handle of the sword and say (to `Urwa), \"Remove your hand from the beard of Allah's Apostle.\" `Urwa raised his head and asked, \"Who is that?\" The people said, \"He is Al-Mughira bin Shu`ba.\" `Urwa said, \"O treacherous! Am I not doing my best to prevent evil consequences of your treachery?\" Before embracing Islam Al-Mughira was in the company of some people. He killed them and took their property and came (to Medina) to embrace Islam. The Prophet said (to him, \"As regards your Islam, I accept it, but as for the property I do not take anything of it. (As it was taken through treason). `Urwa then started looking at the Companions of the Prophet. By Allah, whenever Allah's Apostle spat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) who would rub it on his face and skin; if he ordered them they would carry his orders immediately; if he performed ablution, they would struggle to take the remaining water; and when they spoke to him, they would lower their voices and would not look at his face constantly out of respect. `Urwa returned to his people and said, \"O people! By Allah, I have been to the kings and to Caesar, Khosrau and An- Najashi, yet I have never seen any of them respected by his courtiers as much as Muhammad is respected by his companions. By Allah, if he spat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) who would rub it on his face and skin; if he ordered them, they would carry out his order immediately; if he performed ablution, they would struggle to take the remaining water; and when they spoke, they would lower their voices and would not look at his face constantly out of respect.\" `Urwa added, \"No doubt, he has presented to you a good reasonable offer, so please accept it.\" A man from the tribe of Bani Kinana said, \"Allow me to go to him,\" and they allowed him, and when he approached the Prophet and his companions, Allah's Apostle said, \"He is so-and-so who belongs to the tribe that respects the Budn (i.e. camels of the sacrifice). So, bring the Budn in front of him.\" So, the Budn were brought before him and the people received him while they were reciting Talbiya. When he saw that scene, he said, \"Glorified be Allah! It is not fair to prevent these people from visiting the Ka`ba.\" When he returned to his people, he said, 'I saw the Budn garlanded (with colored knotted ropes) and marked (with stabs on their backs). I do not think it is advisable to prevent them from visiting the Ka`ba.\" Another person called Mikraz bin Hafs got up and sought their permission to go to Muhammad, and they allowed him, too. When he approached the Muslims, the Prophet said, \"Here is Mikraz and he is a vicious man.\" Mikraz started talking to the Prophet and as he was talking, Suhail bin `Amr came. When Suhail bin `Amr came, the Prophet said, \"Now the matter has become easy.\" Suhail said to the Prophet \"Please conclude a peace treaty with us.\" So, the Prophet called the clerk and said to him, \"Write: By the Name of Allah, the most Beneficent, the most Merciful.\" Suhail said, \"As for 'Beneficent,' by Allah, I do not know what it means. So write: By Your Name O Allah, as you used to write previously.\" The Muslims said, \"By Allah, we will not write except: By the Name of Allah, the most Beneficent, the most Merciful.\" The Prophet said, \"Write: By Your Name O Allah.\" Then he dictated, \"This is the peace treaty which Muhammad, Allah's Apostle has concluded.\" Suhail said, \"By Allah, if we knew that you are Allah's Apostle we would not prevent you from visiting the Ka`ba, and would not fight with you. So, write: \"Muhammad bin `Abdullah.\" The Prophet said, \"By Allah! I am Apostle of Allah even if you people do not believe me. Write: Muhammad bin `Abdullah.\" (Az-Zuhri said, \"The Prophet accepted all those things, as he had already said that he would accept everything they would demand if it respects the ordinance of Allah, (i.e. by letting him and his companions perform `Umra.)\" The Prophet said to Suhail, \"On the condition that you allow us to visit the House (i.e. Ka`ba) so that we may perform Tawaf around it.\" Suhail said, \"By Allah, we will not (allow you this year) so as not to give chance to the 'Arabs to say that we have yielded to you, but we will allow you next year.\" So, the Prophet got that written. Then Suhail said, \"We also stipulate that you should return to us whoever comes to you from us, even if he embraced your religion.\" The Muslims said, \"Glorified be Allah! How will such a person be returned to the pagans after he has become a Muslim? While they were in this state Abu- Jandal bin Suhail bin `Amr came from the valley of Mecca staggering with his fetters and fell down amongst the Muslims. Suhail said, \"O Muhammad! This is the very first term with which we make peace with you, i.e. you shall return Abu Jandal to me.\" The Prophet said, \"The peace treaty has not been written yet.\" Suhail said, \"I will never allow you to keep him.\" The Prophet said, \"Yes, do.\" He said, \"I won't do.: Mikraz said, \"We allow you (to keep him).\" Abu Jandal said, \"O Muslims! Will I be returned to the pagans though I have come as a Muslim? Don't you see how much I have suffered?\" (continued...) (continuing... 1): -3.891:... ... Abu Jandal had been tortured severely for the Cause of Allah. `Umar bin Al-Khattab said, \"I went to the Prophet and said, 'Aren't you truly the Apostle of Allah?' The Prophet said, 'Yes, indeed.' I said, 'Isn't our Cause just and the cause of the enemy unjust?' He said, 'Yes.' I said, 'Then why should we be humble in our religion?' He said, 'I am Allah's Apostle and I do not disobey Him, and He will make me victorious.' I said, 'Didn't you tell us that we would go to the Ka`ba and perform Tawaf around it?' He said, 'Yes, but did I tell you that we would visit the Ka`ba this year?' I said, 'No.' He said, 'So you will visit it and perform Tawaf around it?' \" `Umar further said, \"I went to Abu Bakr and said, 'O Abu Bakr! Isn't he truly Allah's Prophet?' He replied, 'Yes.' I said, 'Then why should we be humble in our religion?' He said, 'Indeed, he is Allah's Apostle and he does not disobey his Lord, and He will make him victorious. Adhere to him as, by Allah, he is on the right.' I said, 'Was he not telling us that we would go to the Ka`ba and perform Tawaf around it?' He said, 'Yes, but did he tell you that you would go to the Ka`ba this year?' I said, 'No.' He said, \"You will go to Ka`ba and perform Tawaf around it.\" (Az-Zuhri said, \" `Umar said, 'I performed many good deeds as expiation for the improper questions I asked them.' \") When the writing of the peace treaty was concluded, Allah's Apostle said to his companions, \"Get up and' slaughter your sacrifices and get your head shaved.\" By Allah none of them got up, and the Prophet repeated his order thrice. When none of them got up, he left them and went to Um Salama and told her of the people's attitudes towards him. Um Salama said, \"O the Prophet of Allah! Do you want your order to be carried out? Go out and don't say a word to anybody till you have slaughtered your sacrifice and call your barber to shave your head.\" So, the Prophet went out and did not talk to anyone of them till he did that, i.e. slaughtered the sacrifice and called his barber who shaved his head. Seeing that, the companions of the Prophet got up, slaughtered their sacrifices, and started shaving the heads of one another, and there was so much rush that there was a danger of killing each other. Then some believing women came (to the Prophet ); and Allah revealed the following Divine Verses:-- \"O you who believe, when the believing women come to you as emigrants examine them . . .\" (60.10) `Umar then divorced two wives of his who were infidels. Later on Muawiya bin Abu Sufyan married one of them, and Safwan bin Umaiya married the other. When the Prophet returned to Medina, Abu Basir, a new Muslim convert from Quraish came to him. The Infidels sent in his pursuit two men who said (to the Prophet ), \"Abide by the promise you gave us.\" So, the Prophet handed him over to them. They took him out (of the City) till they reached Dhul-Hulaifa where they dismounted to eat some dates they had with them. Abu Basir said to one of them, \"By Allah, O so-and-so, I see you have a fine sword.\" The other drew it out (of the scabbard) and said, \"By Allah, it is very fine and I have tried it many times.\" Abu Basir said, \"Let me have a look at it.\" When the other gave it to him, he hit him with it till he died, and his companion ran away till he came to Medina and entered the Mosque running. When Allah's Apostle saw him he said, \"This man appears to have been frightened.\" When he reached the Prophet he said, \"My companion has been murdered and I would have been murdered too.\" Abu Basir came and said, \"O Allah's Apostle, by Allah, Allah has made you fulfill your obligations by your returning me to them (i.e. the Infidels), but Allah has saved me from them.\" The Prophet said, \"Woe to his mother! what excellent war kindler he would be, should he only have supporters.\" When Abu Basir heard that he understood that the Prophet would return him to them again, so he set off till he reached the seashore. Abu Jandal bin Suhail got himself released from them (i.e. infidels) and joined Abu Basir. So, whenever a man from Quraish embraced Islam he would follow Abu Basir till they formed a strong group. By Allah, whenever they heard about a caravan of Quraish heading towards Sham, they stopped it and attacked and killed them (i.e. infidels) and took their properties. The people of Quraish sent a message to the Prophet requesting him for the Sake of Allah and Kith and kin to send for (i.e. Abu Basir and his companions) promising that whoever (amongst them) came to the Prophet would be secure. So the Prophet sent for them (i.e. Abu Basir's companions) and Allah I revealed the following Divine Verses: \"And it is He Who Has withheld their hands from you and your hands From them in the midst of Mecca, After He made you the victorious over them. ... the unbelievers had pride and haughtiness, in their hearts ... the pride and haughtiness of the time of ignorance.\" (48.24-26) And their pride and haughtiness was that they did not confess (write in the treaty) that he (i.e. Muhammad) was the Prophet of Allah and refused to write: \"In the Name of Allah, the most Beneficent, the Most Merciful,\" and they (the mushriks) prevented them (the Muslims) from visiting the House (the Ka`bah).",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-3158",
      "hadith_no": "3158",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عروة بن الزبير، عن المسور بن مخرمة، أنه أخبره أن عمرو بن عوف الأنصاري وهو حليف لبني عامر بن لؤى وكان شهد بدرا أخبره أن رسول الله صلى الله عليه وسلم بعث أبا عبيدة بن الجراح إلى البحرين يأتي بجزيتها، وكان رسول الله صلى الله عليه وسلم هو صالح أهل البحرين وأمر عليهم العلاء بن الحضرمي، فقدم أبو عبيدة بمال من البحرين، فسمعت الأنصار بقدوم أبي عبيدة فوافت صلاة الصبح مع النبي صلى الله عليه وسلم، فلما صلى بهم الفجر انصرف، فتعرضوا له، فتبسم رسول الله صلى الله عليه وسلم حين رآهم وقال ‏\"‏ أظنكم قد سمعتم أن أبا عبيدة قد جاء بشىء ‏\"‏‏.‏ قالوا أجل يا رسول الله‏.‏ قال ‏\"‏ فأبشروا وأملوا ما يسركم، فوالله لا الفقر أخشى عليكم، ولكن أخشى عليكم أن تبسط عليكم الدنيا كما بسطت على من كان قبلكم، فتنافسوها كما تنافسوها وتهلككم كما أهلكتهم ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin `Auf Al-Ansari:                     (who was an ally of Bam `Amr bin Lu'ai and one of those who had taken part in (the Ghazwa of) Badr): Allah's Apostle sent Abu 'Ubaida bin Al-Jarreh to Bahrain to collect the Jizya. Allah's Apostle had established peace with the people of Bahrain and appointed Al-`Ala' bin Al-Hadrami as their governor. When Abu 'Ubaida came from Bahrain with the money, the Ansar heard of Abu 'Ubaida's arrival which coincided with the time of the morning prayer with the Prophet. When Allah's Apostle led them in the morning prayer and finished, the Ansar approached him, and he looked at them and smiled on seeing them and said, \"I feel that you have heard that Abu. 'Ubaida has brought something?\" They said, \"Yes, O Allah's Apostle' He said, \"Rejoice and hope for what will please you! By Allah, I am not afraid of your poverty but I am afraid that you will lead a life of luxury as past nations did, whereupon you will compete with each other for it, as they competed for it, and it will destroy you as it destroyed them.\"",
      "usc_msa_ref": "385",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "2201",
        "30154"
      ]
    },
    {
      "id": "sahih-bukhari-3737",
      "hadith_no": "3737",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن ابن أبي مليكة، عن المسور بن مخرمة، قال لما طعن عمر جعل يألم، فقال له ابن عباس  وكأنه يجزعه  يا أمير المؤمنين، ولئن كان ذاك لقد صحبت رسول الله صلى الله عليه وسلم فأحسنت صحبته، ثم فارقته وهو عنك راض، ثم صحبت أبا بكر فأحسنت صحبته، ثم فارقته وهو عنك راض، ثم صحبت صحبتهم فأحسنت صحبتهم، ولئن فارقتهم لتفارقنهم وهم عنك راضون‏.‏ قال أما ما ذكرت من صحبة رسول الله صلى الله عليه وسلم ورضاه، فإنما ذاك من من الله تعالى من به على، وأما ما ذكرت من صحبة أبي بكر ورضاه، فإنما ذاك من من الله جل ذكره من به على، وأما ما ترى من جزعي، فهو من أجلك وأجل أصحابك، والله لو أن لي طلاع الأرض ذهبا لافتديت به من عذاب الله عز وجل قبل أن أراه‏.‏ قال حماد بن زيد حدثنا أيوب، عن ابن أبي مليكة، عن ابن عباس، دخلت على عمر بهذا‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     When `Umar was stabbed, he showed signs of agony. Ibn `Abbas, as if intending to encourage `Umar, said to him, \"O Chief of the believers! Never mind what has happened to you, for you have been in the company of Allah's Apostle and you kept good relations with him and you parted with him while he was pleased with you. Then you were in the company of Abu Bakr and kept good relations with him and you parted with him (i.e. he died) while he was pleased with you. Then you were in the company of the Muslims, and you kept good relations with them, and if you leave them, you will leave them while they are pleased with you.\" `Umar said, (to Ibn \"Abbas), \"As for what you have said about the company of Allah's Apostle and his being pleased with me, it is a favor, Allah did to me; and as for what you have said about the company of Abu Bakr and his being pleased with me, it is a favor Allah did to me; and concerning my impatience which you see, is because of you and your companions. By Allah! If (at all) I had gold equal to the earth, I would have ransomed myself with it from the Punishment of Allah before I meet Him.\"",
      "usc_msa_ref": "41",
      "chain": [
        "30140",
        "20208",
        "11015",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-3743",
      "hadith_no": "3743",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني أحمد بن شبيب بن سعيد، قال حدثني أبي، عن يونس، قال ابن شهاب أخبرني عروة، أن عبيد الله بن عدي بن الخيار، أخبره أن المسور بن مخرمة وعبد الرحمن بن الأسود بن عبد يغوث قالا ما يمنعك أن تكلم عثمان لأخيه الوليد فقد أكثر الناس فيه‏.‏ فقصدت لعثمان حتى خرج إلى الصلاة، قلت إن لي إليك حاجة، وهي نصيحة لك‏.‏ قال يا أيها المرء  قال معمر أراه قال  أعوذ بالله منك‏.‏ فانصرفت، فرجعت إليهم إذ جاء رسول عثمان فأتيته، فقال ما نصيحتك فقلت إن الله سبحانه بعث محمدا صلى الله عليه وسلم بالحق، وأنزل عليه الكتاب، وكنت ممن استجاب لله ولرسوله، فهاجرت الهجرتين، وصحبت رسول الله صلى الله عليه وسلم ورأيت هديه، وقد أكثر الناس في شأن الوليد‏.‏ قال أدركت رسول الله صلى الله عليه وسلم قلت لا ولكن خلص إلى من علمه ما يخلص إلى العذراء في سترها‏.‏ قال أما بعد فإن الله بعث محمدا صلى الله عليه وسلم بالحق، فكنت ممن استجاب لله ولرسوله وآمنت بما بعث به، وهاجرت الهجرتين كما قلت، وصحبت رسول الله صلى الله عليه وسلم وبايعته، فوالله ما عصيته ولا غششته حتى توفاه الله، ثم أبو بكر مثله، ثم عمر مثله، ثم استخلفت، أفليس لي من الحق مثل الذي لهم قلت بلى‏.‏ قال فما هذه الأحاديث التي تبلغني عنكم أما ما ذكرت من شأن الوليد، فسنأخذ فيه بالحق إن شاء الله، ثم دعا عليا فأمره أن يجلده فجلده ثمانين‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     Al-Miswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth said (to me), \"What forbids you to talk to `Uthman about his brother Al-Walid because people have talked much about him?\" So I went to `Uthman and when he went out for prayer I said (to him), \"I have something to say to you and it is a piece of advice for you \" `Uthman said, \"O man, from you.\" (`Umar said: I see that he said, \"I seek Refuge with Allah from you.\") So I left him and went to them. Then the messenger of `Uthman came and I went to him (i.e. `Uthman), `Uthman asked, \"What is your advice?\" I replied, \"Allah sent Muhammad with the Truth, and revealed the Divine Book (i.e. Qur'an) to him; and you were amongst those who followed Allah and His Apostle, and you participated in the two migrations (to Ethiopia and to Medina) and enjoyed the company of Allah's Apostle and saw his way. No doubt, the people are talking much about Al-Walid.\" `Uthman said, \"Did you receive your knowledge directly from Allah's Apostle ?\" I said, \"No, but his knowledge did reach me and it reached (even) to a virgin in her seclusion.\" `Uthman said, \"And then Allah sent Muhammad with the Truth and I was amongst those who followed Allah and His Apostle and I believed in what ever he (i.e. the Prophet) was sent with, and participated in two migrations, as you have said, and I enjoyed the company of Allah's Apostle and gave the pledge of allegiance him. By Allah! I never disobeyed him, nor did I cheat him till Allah took him unto Him. Then I treated Abu Bakr and then `Umar similarly and then I was made Caliph. So, don't I have rights similar to theirs?\" I said, \"Yes.\" He said, \"Then what are these talks reaching me from you people? Now, concerning what you mentioned about the question of Al-Walid, Allah willing, I shall deal with him according to what is right.\" Then he called `Ali and ordered him to flog him, and `Ali flogged him (i.e. Al-Walid) eighty lashes.",
      "usc_msa_ref": "45",
      "chain": [
        "30120",
        "20238",
        "20475",
        "11013",
        "10511",
        "880",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-3761",
      "hadith_no": "3761",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا أبو الوليد، حدثنا ابن عيينة، عن عمرو بن دينار، عن ابن أبي مليكة، عن المسور بن مخرمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فاطمة بضعة مني، فمن أغضبها أغضبني ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     Allah's Apostle said, \"Fatima is a part of me, and he who makes her angry, makes me angry.\"",
      "usc_msa_ref": "61",
      "chain": [
        "20296",
        "20005",
        "11081",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-3775",
      "hadith_no": "3775",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني علي بن حسين، أن المسور بن مخرمة، قال إن عليا خطب بنت أبي جهل، فسمعت بذلك، فاطمة، فأتت رسول الله صلى الله عليه وسلم فقالت يزعم قومك أنك لا تغضب لبناتك، هذا علي ناكح بنت أبي جهل، فقام رسول الله صلى الله عليه وسلم فسمعته حين تشهد يقول ‏\"‏ أما بعد أنكحت أبا العاص بن الربيع، فحدثني وصدقني، وإن فاطمة بضعة مني، وإني أكره أن يسوءها، والله لا تجتمع بنت رسول الله صلى الله عليه وسلم وبنت عدو الله عند رجل واحد ‏\"‏‏.‏ فترك علي الخطبة‏.‏ وزاد محمد بن عمرو بن حلحلة عن ابن شهاب عن علي عن مسور، سمعت النبي صلى الله عليه وسلم وذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني، ووعدني فوفى لي ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     `Ali demanded the hand of the daughter of Abu Jahl. Fatima heard of this and went to Allah's Apostle saying, \"Your people think that you do not become angry for the sake of your daughters as `Ali is now going to marry the daughter of Abu Jahl. \"On that Allah's Apostle got up and after his recitation of Tashah-hud. I heard him saying, \"Then after! I married one of my daughters to Abu Al-`As bin Al- Rabi` (the husband of Zainab, the daughter of the Prophet ) before Islam and he proved truthful in whatever he said to me. No doubt, Fatima is a part of me, I hate to see her being troubled. By Allah, the daughter of Allah's Apostle and the daughter of Allah's Enemy cannot be the wives of one man.\" So `Ali gave up that engagement. 'Al-Miswar further said: I heard the Prophet talking and he mentioned a son-in-law of his belonging to the tribe of Bani `Abd-Shams. He highly praised him concerning that relationship and said (whenever) he spoke to me, he spoke the truth, and whenever he promised me, he fulfilled his promise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11045",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-3813",
      "hadith_no": "3813",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا أبو الوليد، حدثنا ابن عيينة، عن عمرو بن دينار، عن ابن أبي مليكة، عن المسور بن مخرمة  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فاطمة بضعة مني، فمن أغضبها أغضبني ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     Allah's Apostle said, \"Fatima is a part of me, and whoever makes her angry, makes me angry.\"",
      "usc_msa_ref": "111",
      "chain": [
        "20296",
        "20005",
        "11081",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-3920",
      "hadith_no": "3920",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا هشام، أخبرنا معمر، عن الزهري، حدثنا عروة بن الزبير، أن عبيد الله بن عدي بن الخيار، أخبره أن المسور بن مخرمة وعبد الرحمن بن الأسود بن عبد يغوث قالا له ما يمنعك أن تكلم خالك عثمان في أخيه الوليد بن عقبة وكان أكثر الناس فيما فعل به‏.‏ قال عبيد الله فانتصبت لعثمان حين خرج إلى الصلاة فقلت له إن لي إليك حاجة وهى نصيحة‏.‏ فقال أيها المرء، أعوذ بالله منك، فانصرفت، فلما قضيت الصلاة جلست إلى المسور وإلى ابن عبد يغوث، فحدثتهما بالذي قلت لعثمان وقال لي‏.‏ فقالا قد قضيت الذي كان عليك‏.‏ فبينما أنا جالس معهما، إذ جاءني رسول عثمان، فقالا لي قد ابتلاك الله‏.‏ فانطلقت حتى دخلت عليه، فقال ما نصيحتك التي ذكرت آنفا قال فتشهدت ثم قلت إن الله بعث محمدا صلى الله عليه وسلم وأنزل عليه الكتاب، وكنت ممن استجاب لله ورسوله صلى الله عليه وسلم وآمنت به، وهاجرت الهجرتين الأوليين، وصحبت رسول الله صلى الله عليه وسلم ورأيت هديه، وقد أكثر الناس في شأن الوليد بن عقبة، فحق عليك أن تقيم عليه الحد‏.‏ فقال لي يا ابن أخي أدركت رسول الله صلى الله عليه وسلم قال قلت لا، ولكن قد خلص إلى من علمه ما خلص إلى العذراء في سترها‏.‏ قال فتشهد عثمان فقال إن الله قد بعث محمدا صلى الله عليه وسلم بالحق وأنزل عليه الكتاب، وكنت ممن استجاب لله ورسوله صلى الله عليه وسلم وآمنت بما بعث به محمد صلى الله عليه وسلم‏.‏ وهاجرت الهجرتين الأوليين كما قلت، وصحبت رسول الله صلى الله عليه وسلم وبايعته، والله ما عصيته ولا غششته حتى توفاه الله، ثم استخلف الله أبا بكر فوالله ما عصيته ولا غششته، ثم استخلف عمر، فوالله ما عصيته ولا غششته، ثم استخلفت، أفليس لي عليكم مثل الذي كان لهم على قال بلى‏.‏ قال فما هذه الأحاديث التي تبلغني عنكم فأما ما ذكرت من شأن الوليد بن عقبة، فسنأخذ فيه إن شاء الله بالحق قال فجلد الوليد أربعين جلدة، وأمر عليا أن يجلده، وكان هو يجلده‏.‏ وقال يونس وابن أخي الزهري عن الزهري أفليس لي عليكم من الحق مثل الذي كان لهم‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth had said to him, \"What prevents you from speaking to your uncle `Uthman regarding his brother Al-Walid bin `Uqba?\" The people were speaking against the latter for what he had done. 'Ubaidullah said, \"So I kept waiting for `Uthman, and when he went out for the prayer, I said to him, 'I have got something to say to you as a piece of advice.' `Uthman said, 'O man! I seek Refuge with Allah from you. So I went away. When I finished my prayer, I sat with Al-Miswar and Ibn 'Abu Yaghutb and talked to both of them of what I had said to `Uthman and what he had said to me. They said, 'You have done your duty.' So while I was sitting with them. `Uthman's Messenger came to me. They said, 'Allah has put you to trial.\" I set out and when I reached `Uthman, he said, 'What is your advice which you mentioned a while ago?' I recited Tashahhud and added, 'Allah has sent Muhammad and has revealed the Holy Book (i.e. Qur'an) to him. You (O `Uthman!) were amongst those who responded to the call of Allah and His Apostle and had faith in him. And you took part in the first two migrations (to Ethiopia and to Medina), and you enjoyed the company of Allah's Apostle and learned his traditions and advice. Now the people are talking much about Al-Walid bin `Uqba and so it is your duty to impose on him the legal punishment.' `Uthman then said to me, 'O my nephew! Did you ever meet Allah's Apostle ?' I said, 'No, but his knowledge has reached me as it has reached the virgin in her seclusion.' `Uthman then recited Tashahhud and said, 'No doubt, Allah has sent Muhammad with the Truth and has revealed to him His Holy Book (i.e. Qur'an) and I was amongst those who responded to the call of Allah and His Apostle and I had faith in Muhammad's Mission, and I had performed the first two migrations as you have said, and I enjoyed the company of Allah's Apostle and gave the pledge of allegiance to him. By Allah, I never disobeyed him and never cheated him till Allah caused him to die. Then Allah made Abu Bakr Caliph, and by Allah, I was never disobedient to him, nor did I cheat him. Then `Umar became Caliph, and by Allah, I was never disobedient to him, nor did I cheat him. Then I became Caliph. Have I not then the same rights over you as they had over me?' I replied in the affirmative. `Uthman further said, 'The what are these talks which are reaching me from you? As for what you ha mentioned about Al-Walid bin 'Uqb; Allah willing, I shall give him the leg; punishment justly. Then `Uthman ordered that Al-Walid be flogged fort lashes. He ordered `Ali to flog him an he himself flogged him as well.\"",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "10511",
        "880",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-4064",
      "hadith_no": "4064",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا معمر، ويونس، عن الزهري، عن عروة بن الزبير، أنه أخبره أن المسور بن مخرمة أخبره أن عمرو بن عوف وهو حليف لبني عامر بن لؤى، وكان شهد بدرا مع النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم بعث أبا عبيدة بن الجراح إلى البحرين يأتي بجزيتها، وكان رسول الله صلى الله عليه وسلم هو صالح أهل البحرين، وأمر عليهم العلاء بن الحضرمي، فقدم أبو عبيدة بمال من البحرين فسمعت الأنصار بقدوم أبي عبيدة، فوافوا صلاة الفجر مع النبي صلى الله عليه وسلم، فلما انصرف تعرضوا له، فتبسم رسول الله صلى الله عليه وسلم حين رآهم ثم قال ‏\"‏ أظنكم سمعتم أن أبا عبيدة قدم بشىء ‏\"‏‏.‏ قالوا أجل يا رسول الله‏.‏ قال ‏\"‏ فأبشروا وأملوا ما يسركم، فوالله ما الفقر أخشى عليكم، ولكني أخشى أن تبسط عليكم الدنيا كما بسطت على من قبلكم، فتنافسوها كما تنافسوها، وتهلككم كما أهلكتهم ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     That `Amr bin `Auf, who was an ally of Bani 'Amir bin Luai and one of those who fought at Badr in the company of the Prophet , said, \"Allah's Apostle sent Abu 'Ubaida bin Al-Jarrah to Bahrain to bring the Jizya taxation from its people, for Allah's Apostle had made a peace treaty with the people of Bahrain and appointed Al-`Ala' bin Al-Hadrami as their ruler. So, Abu 'Ubaida arrived with the money from Bahrain. When the Ansar heard of the arrival of Abu 'Ubaida (on the next day) they offered the morning prayer with the Prophet and when the morning prayer had finished, they presented themselves before him. On seeing the Ansar, Allah's Apostle smiled and said, \"I think you have heard that Abu 'Ubaida has brought something?\" They replied, \"Indeed, it is so, O Allah's Apostle!\" He said, \"Be happy, and hope for what will please you. By Allah, I am not afraid that you will be poor, but I fear that worldly wealth will be bestowed upon you as it was bestowed upon those who lived before you. So you will compete amongst yourselves for it, as they competed for it and it will destroy you as it did them.\"",
      "usc_msa_ref": "351",
      "chain": [
        "30349",
        "20025",
        "20115",
        "20475",
        "11013",
        "10511",
        "2201",
        "30154"
      ]
    },
    {
      "id": "sahih-bukhari-4210",
      "hadith_no": "4210",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن عروة، عن مروان، والمسور بن مخرمة، قالا خرج النبي صلى الله عليه وسلم عام الحديبية في بضع عشرة مائة من أصحابه، فلما كان بذي الحليفة قلد الهدى وأشعر وأحرم منها‏.‏ لا أحصي كم سمعته من سفيان حتى سمعته يقول لا أحفظ من الزهري الإشعار والتقليد، فلا أدري  يعني  موضع الإشعار والتقليد، أو الحديث كله‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     The Prophet went out in the company of 1300 to 1500 of his companions in the year of Al-Hudaibiya, and when they reached Dhul-Hulaifa, he garlanded and marked his Hadi and assumed the state of Ihram.",
      "usc_msa_ref": "477",
      "chain": [
        "30026",
        "20005",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-4229",
      "hadith_no": "4229",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، قال سمعت الزهري، حين حدث هذا الحديث،، حفظت بعضه، وثبتني معمر عن عروة بن الزبير، عن المسور بن مخرمة، ومروان بن الحكم، يزيد أحدهما على صاحبه قالا خرج النبي صلى الله عليه وسلم عام الحديبية في بضع عشرة مائة من أصحابه، فلما أتى ذا الحليفة قلد الهدى، وأشعره، وأحرم منها بعمرة، وبعث عينا له من خزاعة، وسار النبي صلى الله عليه وسلم حتى كان بغدير الأشطاط، أتاه عينه قال إن قريشا جمعوا لك جموعا، وقد جمعوا لك الأحابيش، وهم مقاتلوك وصادوك عن البيت ومانعوك‏.‏ فقال ‏\"‏ أشيروا أيها الناس على، أترون أن أميل إلى عيالهم وذراري هؤلاء الذين يريدون أن يصدونا عن البيت، فإن يأتونا كان الله عز وجل قد قطع عينا من المشركين، وإلا تركناهم محروبين ‏\"‏‏.‏ قال أبو بكر يا رسول الله، خرجت عامدا لهذا البيت، لا تريد قتل أحد ولا حرب أحد، فتوجه له، فمن صدنا عنه قاتلناه‏.‏ قال ‏\"‏ امضوا على اسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama and Marwan bin Al-Hakam:                     (one of them said more than his friend): The Prophet set out in the company of more than onethousand of his companions in the year of Al-Hudaibiya, and when he reached Dhul-Hulaifa, he garlanded his Hadi (i.e. sacrificing animal), assumed the state of Ihram for `Umra from that place and sent a spy of his from Khuzi'a (tribe). The Prophet proceeded on till he reached (a village called) Ghadir-al-Ashtat. There his spy came and said, \"The Quraish (infidels) have collected a great number of people against you, and they have collected against you the Ethiopians, and they will fight with you, and will stop you from entering the Ka`ba and prevent you.\" The Prophet said, \"O people! Give me your opinion. Do you recommend that I should destroy the families and offspring of those who want to stop us from the Ka`ba? If they should come to us (for peace) then Allah will destroy a spy from the pagans, or otherwise we will leave them in a miserable state.\" On that Abu Bakr said, \"O Allah Apostle! You have come with the intention of visiting this House (i.e. Ka`ba) and you do not want to kill or fight anybody. So proceed to it, and whoever should stop us from it, we will fight him.\" On that the Prophet said, \"Proceed on, in the Name of Allah !\"",
      "usc_msa_ref": "495",
      "chain": [
        "30351",
        "20005",
        "10511",
        "2201",
        "858"
      ]
    },
    {
      "id": "sahih-bukhari-4363",
      "hadith_no": "4363",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني ليث، حدثني عقيل، عن ابن شهاب،‏.‏ وحدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب،، قال محمد بن شهاب وزعم عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم، فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بكم ‏\"‏‏.‏ وكان أنظرهم رسول الله صلى الله عليه وسلم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب منكم أن يكون على حظه، حتى نعطيه إياه من أول ما يفيء الله علينا، فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏ هذا الذي بلغني عن سبى هوازن‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegate of Hawazin came to Allah's Apostle declaring their conversion to Islam and asked him to return their properties and captives, Allah's Apostle got up and said to them, \"There Is involved in this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So choose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. have not distributed the booty).\" Allah's Apostle had delayed the distribution of their booty over ten nights after his return from Ta'if. So when they came to know that Allah's Apostle was not going to return to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Apostle got up amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have come to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to do that as a favor then he can do it. And whoever of you likes to stick to his share till we give him from the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that (i.e. return the captives) willingly as a favor, 'O Allah's Apostle!\" Allah's Apostle said, \"We do not know which of you have agreed to it and which have not; so go back and let your chiefs forward us your decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to Allah's Apostle and informed him that all of them had agreed (to give up their captives) with pleasure, and had given their permission (i.e. that the captives be returned to their people). (The sub-narrator said, \"That is what has reached me about the captives of Hawazin tribe.\")",
      "usc_msa_ref": "608",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-5043",
      "hadith_no": "5043",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال حدثني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، حدثاه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته فإذا هو يقرأ على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم فكدت أساوره في الصلاة فتصبرت حتى سلم فلببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرأ‏.‏ قال أقرأنيها رسول الله صلى الله عليه وسلم‏.‏ فقلت كذبت فإن رسول الله صلى الله عليه وسلم قد أقرأنيها على غير ما قرأت، فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ بسورة الفرقان على حروف لم تقرئنيها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله اقرأ يا هشام ‏\"‏‏.‏ فقرأ عليه القراءة التي سمعته يقرأ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت ‏\"‏‏.‏ ثم قال ‏\"‏ اقرأ يا عمر ‏\"‏‏.‏ فقرأت القراءة التي أقرأني، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت، إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Hisham bin Hakim reciting Surat Al-Furqan during the lifetime of Allah's Apostle and I listened to his recitation and noticed that he recited in several different ways which Allah's Apostle had not taught me. I was about to jump over him during his prayer, but I controlled my temper, and when he had completed his prayer, I put his upper garment around his neck and seized him by it and said, \"Who taught you this Sura which I heard you reciting?\" He replied, \"Allah's Apostle taught it to me.\" I said, \"You have told a lie, for Allah's Apostle has taught it to me in a different way from yours.\" So I dragged him to Allah's Apostle and said (to Allah's Apostle), \"I heard this person reciting Surat Al-Furqan in a way which you haven't taught me!\" On that Allah's Apostle said, \"Release him, (O `Umar!) Recite, O Hisham!\" Then he recited in the same way as I heard him reciting. Then Allah's Apostle said, \"It was revealed in this way,\" and added, \"Recite, O `Umar!\" I recited it as he had taught me. Allah's Apostle then said, \"It was revealed in this way. This Qur'an has been revealed to be recited in seven different ways, so recite of it whichever (way) is easier for you (or read as much of it as may be easy for you).",
      "usc_msa_ref": "514",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10511",
        "2201",
        "3195",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-5285",
      "hadith_no": "5285",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، قال سمعت رسول الله صلى الله عليه وسلم يقول وهو على المنبر ‏\"‏ إن بني هشام بن المغيرة استأذنوا في أن ينكحوا ابنتهم علي بن أبي طالب فلا آذن، ثم لا آذن، ثم لا آذن، إلا أن يريد ابن أبي طالب أن يطلق ابنتي وينكح ابنتهم، فإنما هي بضعة مني، يريبني ما أرابها ويؤذيني ما آذاها ‏\"‏‏.‏ هكذا قال‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     I heard Allah's Apostle who was on the pulpit, saying, \"Banu Hisham bin Al-Mughira have requested me to allow them to marry their daughter to `Ali bin Abu Talib, but I don't give permission, and will not give permission unless `Ali bin Abi Talib divorces my daughter in order to marry their daughter, because Fatima is a part of my body, and I hate what she hates to see, and what hurts her, hurts me.\"",
      "usc_msa_ref": "157",
      "chain": [
        "30367",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-5333",
      "hadith_no": "5333",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا أبو الوليد، حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن بني المغيرة استأذنوا في أن ينكح علي ابنتهم، فلا آذن ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama Az-Zuhri:                     I heard the Prophet saying, \"Banu Al-Mughira have asked my leave to let `Ali marry their daughter, but I give no leave to this effect.\"",
      "usc_msa_ref": "201",
      "chain": [
        "20296",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-5377",
      "hadith_no": "5377",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن هشام بن عروة، عن أبيه، عن المسور بن مخرمة، أن سبيعة الأسلمية، نفست بعد وفاة زوجها، بليال فجاءت النبي صلى الله عليه وسلم فاستأذنته أن تنكح، فأذن لها، فنكحت‏.‏",
      "text_en": " Narrated Al-Miswer bin Makhrama:                     Subai'a Al-Aslamiya gave birth to a child a few days after the death of her husband. She came to the Prophet and asked permission to remarry, and the Prophet gave her permission, and she got married.",
      "usc_msa_ref": "241",
      "chain": [
        "30119",
        "20001",
        "11065",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-5860",
      "hadith_no": "5860",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، قال قسم رسول الله صلى الله عليه وسلم أقبية، ولم يعط مخرمة شيئا فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم فانطلقت معه فقال ادخل فادعه لي‏.‏ قال فدعوته له، فخرج إليه وعليه قباء منها فقال ‏\"‏ خبأت هذا لك ‏\"‏‏.‏ قال فنظر إليه فقال رضي مخرمة‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     Allah's Apostle distributed some Qaba's but he did not give anything to Makhrama. Makhrama said (to me), \"O my son! Let us go to Allah's Apostle.\" So I proceeded with him and he said, \"Go in and call him 'or me.\" So I called the Prophet for him The Prophet came out to him, wearing one of those Qaba's and said, (to Makhrama), \"I have kept this for you \" Makhrama looked at it and said, \"Makhrama is satisfied now.\"",
      "usc_msa_ref": "692",
      "chain": [
        "30367",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-5923",
      "hadith_no": "5923",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال الليث حدثني ابن أبي مليكة، عن المسور بن مخرمة، أن أباه، مخرمة قال له يا بنى إنه بلغني أن النبي صلى الله عليه وسلم قدمت عليه أقبية فهو يقسمها، فاذهب بنا إليه، فذهبنا فوجدنا النبي صلى الله عليه وسلم في منزله، فقال لي يا بنى ادع لي النبي صلى الله عليه وسلم فأعظمت ذلك‏.‏ فقلت أدعو لك رسول الله صلى الله عليه وسلم فقال يا بنى إنه ليس بجبار‏.‏ فدعوته فخرج وعليه قباء من ديباج مزرر بالذهب، فقال ‏\"‏ يا مخرمة هذا خبأناه لك ‏\"‏‏.‏ فأعطاه إياه‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-6501",
      "hadith_no": "6501",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إسماعيل بن إبراهيم بن عقبة، عن موسى بن عقبة، قال ابن شهاب حدثني عروة بن الزبير، أن المسور بن مخرمة، أخبره أن عمرو بن عوف وهو حليف لبني عامر بن لؤى كان شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أن رسول الله صلى الله عليه وسلم بعث أبا عبيدة بن الجراح إلى البحرين يأتي بجزيتها، وكان رسول الله صلى الله عليه وسلم هو صالح أهل البحرين، وأمر عليهم العلاء بن الحضرمي، فقدم أبو عبيدة بمال من البحرين، فسمعت الأنصار بقدومه فوافته صلاة الصبح مع رسول الله صلى الله عليه وسلم فلما انصرف تعرضوا له فتبسم حين رآهم وقال ‏\"‏ أظنكم سمعتم بقدوم أبي عبيدة، وأنه جاء بشىء ‏\"‏‏.‏ قالوا أجل يا رسول الله‏.‏ قال ‏\"‏ فأبشروا وأملوا ما يسركم، فوالله ما الفقر أخشى عليكم، ولكن أخشى عليكم أن تبسط عليكم الدنيا، كما بسطت على من كان قبلكم، فتنافسوها كما تنافسوها وتلهيكم كما ألهتهم ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin `Auf:                     (An ally of the tribe of Bani 'Amir bin Lu'ai and one of those who had witnessed the battle of Badr with Allah's Apostle) Allah's Apostle sent Abu 'Ubaida bin AlJarrah to Bahrain to collect the Jizya tax. Allah's Apostle had concluded a peace treaty with the people of Bahrain and appointed Al 'Ala bin Al-Hadrami as their chief; Abu Ubaida arrived from Bahrain with the money. The Ansar heard of Abu 'Ubaida's arrival which coincided with the Fajr (morning) prayer led by Allah's Apostle. When the Prophet finished the prayer, they came to him. Allah's Apostle smiled when he saw them and said, \"I think you have heard of the arrival of Abu 'Ubaida and that he has brought something.\" They replied, \"Yes, O Allah's Apostle! \" He said, \"Have the good news, and hope for what will please you. By Allah, I am not afraid that you will become poor, but I am afraid that worldly wealth will be given to you in abundance as it was given to those (nations) before you, and you will start competing each other for it as the previous nations competed for it, and then it will divert you (from good) as it diverted them.\" '",
      "usc_msa_ref": "433",
      "chain": [
        "30103",
        "20154",
        "11106",
        "11013",
        "10511",
        "2201",
        "30154"
      ]
    },
    {
      "id": "sahih-bukhari-7022",
      "hadith_no": "7022",
      "source": "Sahih Bukhari",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "قال أبو عبد الله وقال الليث حدثني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، أخبراه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته، فإذا هو يقرؤها على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم كذلك، فكدت أساوره في الصلاة فانتظرته حتى سلم، ثم لببته بردائه أو بردائي فقلت من أقرأك هذه السورة قال أقرأنيها رسول الله صلى الله عليه وسلم قلت له كذبت فوالله إن رسول الله صلى الله عليه وسلم أقرأني هذه السورة التي سمعتك تقرؤها‏.‏ فانطلقت أقوده إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ بسورة الفرقان على حروف لم تقرئنيها، وأنت أقرأتني سورة الفرقان‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله يا عمر، اقرأ يا هشام ‏\"‏‏.‏ فقرأ عليه القراءة التي سمعته يقرؤها‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا عمر ‏\"‏‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت ‏\"‏‏.‏ ثم قال ‏\"‏ إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20023",
        "20475",
        "11013",
        "10511",
        "2201",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-7264",
      "hadith_no": "7264",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، حدثني إسماعيل بن إبراهيم، عن عمه، موسى بن عقبة قال ابن شهاب حدثني عروة بن الزبير، أن مروان بن الحكم، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قال حين أذن لهم المسلمون في عتق سبى هوازن ‏\"‏ إني لا أدري من أذن منكم ممن لم يأذن، فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم، فرجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أن الناس قد طيبوا وأذنوا‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Marwan bin Al-Hakam and Al-Miswar bin Makhrama told him that when the Muslims were permitted to set free the captives of Hawazin, Allah's Apostle said, \"I do not know who amongst you has agreed (to it) and who has not. Go back so that your 'Urafa' may submit your decision to us.\" So the people returned and their 'Urafa' talked to them and then came back to Allah's Apostle and told him that the people had given their consent happily and permitted (their captives to be freed).",
      "usc_msa_ref": "288",
      "chain": [
        "30103",
        "20208",
        "11106",
        "11013",
        "10511",
        "858",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-7293",
      "hadith_no": "7293",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن حميد بن عبد الرحمن، أخبره أن المسور بن مخرمة أخبره‏.‏ أن الرهط الذين ولاهم عمر اجتمعوا فتشاوروا، قال لهم عبد الرحمن لست بالذي أنافسكم على هذا الأمر، ولكنكم إن شئتم اخترت لكم منكم‏.‏ فجعلوا ذلك إلى عبد الرحمن، فلما ولوا عبد الرحمن أمرهم فمال الناس على عبد الرحمن، حتى ما أرى أحدا من الناس يتبع أولئك الرهط ولا يطأ عقبه، ومال الناس على عبد الرحمن يشاورونه تلك الليالي حتى إذا كانت الليلة التي أصبحنا منها، فبايعنا عثمان قال المسور طرقني عبد الرحمن بعد هجع من الليل فضرب الباب حتى استيقظت فقال أراك نائما، فوالله ما اكتحلت هذه الليلة بكبير نوم، انطلق فادع الزبير وسعدا، فدعوتهما له فشاورهما ثم دعاني فقال ادع لي عليا‏.‏ فدعوته فناجاه حتى ابهار الليل، ثم قام علي من عنده، وهو على طمع، وقد كان عبد الرحمن يخشى من علي شيئا، ثم قال ادع لي عثمان، فدعوته فناجاه حتى فرق بينهما المؤذن بالصبح، فلما صلى للناس الصبح واجتمع أولئك الرهط عند المنبر، فأرسل إلى من كان حاضرا من المهاجرين والأنصار، وأرسل إلى أمراء الأجناد وكانوا وافوا تلك الحجة مع عمر، فلما اجتمعوا تشهد عبد الرحمن ثم قال أما بعد يا علي، إني قد نظرت في أمر الناس فلم أرهم يعدلون بعثمان، فلا تجعلن على نفسك سبيلا‏.‏ فقال أبايعك على سنة الله ورسوله والخليفتين من بعده‏.‏ فبايعه عبد الرحمن، وبايعه الناس المهاجرون والأنصار وأمراء الأجناد والمسلمون‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     The group of people whom `Umar had selected as candidates for the Caliphate gathered and consulted each other. `Abdur-Rahman said to them, \"I am not going to compete with you in this matter, but if you wish, I would select for you a caliph from among you.\" So all of them agreed to let `Abdur-Rahman decide the case. So when the candidates placed the case in the hands of `Abdur-Rahman, the people went towards him and nobody followed the rest of the group nor obeyed any after him. So the people followed `Abdur-Rahman and consulted him all those nights till there came the night we gave the oath of allegiance to `Uthman. Al-Miswar (bin Makhrama) added: `Abdur-Rahman called on me after a portion of the night had passed and knocked on my door till I got up, and he said to me, \"I see you have been sleeping! By Allah, during the last three nights I have not slept enough. Go and call Az-Zubair and Sa`d.' So I called them for him and he consulted them and then called me saying, 'Call `Ali for me.\" I called `Ali and he held a private talk with him till very late at night, and then 'Al, got up to leave having had much hope (to be chosen as a Caliph) but `Abdur-Rahman was afraid of something concerning `Ali. `Abdur-Rahman then said to me, \"Call `Uthman for me.\" I called him and he kept on speaking to him privately till the Mu'adh-dhin put an end to their talk by announcing the Adhan for the Fajr prayer. When the people finished their morning prayer and that (six men) group gathered near the pulpit, `Abdur-Rahman sent for all the Muhajirin (emigrants) and the Ansar present there and sent for the army chief who had performed the Hajj with `Umar that year. When all of them had gathered, `Abdur- Rahman said, \"None has the right to be worshipped but Allah,\" and added, \"Now then, O `Ali, I have looked at the people's tendencies and noticed that they do not consider anybody equal to `Uthman, so you should not incur blame (by disagreeing).\" Then `Abdur-Rahman said (to `Uthman), \"I gave the oath of allegiance to you on condition that you will follow Allah's Laws and the traditions of Allah's Apostle and the traditions of the two Caliphs after him.\" So `Abdur-Rahman gave the oath of allegiance to him, and so did the people including the Muhajirin (emigrants) and the Ansar and the chiefs of the army staff and all the Muslims.",
      "usc_msa_ref": "",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "10561",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-7645",
      "hadith_no": "7645",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثني عروة، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، حدثاه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته، فإذا هو يقرأ على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم، فكدت أساوره في الصلاة، فتصبرت حتى سلم، فلببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرأ قال أقرأنيها رسول الله صلى الله عليه وسلم فقلت كذبت، أقرأنيها على غير ما قرأت‏.‏ فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ سورة الفرقان على حروف لم تقرئنيها‏.‏ فقال ‏\"‏ أرسله، اقرأ يا هشام ‏\"‏‏.‏ فقرأ القراءة التي سمعته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا عمر ‏\"‏‏.‏ فقرأت التي أقرأني فقال ‏\"‏ كذلك أنزلت، إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Hisham bin Hakim reciting Surat-al-Furqan during the lifetime of Allah's Apostle, I listened to his recitation and noticed that he was reciting in a way that Allah's Apostle had not taught me. I was about to jump over him while He was still in prayer, but I waited patiently and when he finished his prayer, I put my sheet round his neck (and pulled him) and said, \"Who has taught you this Sura which I have heard you reciting?\" Hisham said, \"Allah's Apostle taught it to me.\" I said, \"You are telling a lie, for he taught it to me in a way different from the way you have recited it!\" Then I started leading (dragged) him to Allah's Apostle and said (to the Prophet), \" I have heard this man reciting Surat-al- Furqan in a way that you have not taught me.\" The Prophet said: \"(O `Umar) release him! Recite, O Hisham.\" Hisham recited in the way I heard him reciting. Allah's Apostle said, \"It was revealed like this.\" Then Allah's Apostle said, \"Recite, O `Umar!\" I recited in the way he had taught me, whereupon he said, \"It was revealed like this,\" and added, \"The Qur'an has been revealed to be recited in seven different ways, so recite of it whichever is easy for you .\" (See Hadith No. 514, Vol. 6)",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "2201",
        "3195",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-341-2",
      "hadith_no": "341",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا سعيد بن يحيى الأموي، حدثني أبي، حدثنا عثمان بن حكيم بن عباد بن حنيف الأنصاري، أخبرني أبو أمامة بن سهل بن حنيف، عن المسور بن مخرمة، قال أقبلت بحجر أحمله ثقيل وعلى إزار خفيف - قال - فانحل إزاري ومعي الحجر لم أستطع أن أضعه حتى بلغت به إلى موضعه فقال رسول الله صلى الله عليه وسلم ‏\"‏ ارجع إلى ثوبك فخذه ولا تمشوا عراة ‏\"‏ ‏.‏",
      "text_en": " Al-Miswar b. Makhrama reported:                      I was carrying a heavy stone and my lower garment was loose, and it, therefore, slipped off (so soon) that I could not place the stone (on the ground) and carry to its proper place. Upon this the Messenger of Allah (may peace be upon him) said: Return to your cloth (lower garment), take it (and tie it around your waist) and do not walk naked.",
      "usc_msa_ref": "",
      "chain": [
        "30254",
        "20367",
        "11889",
        "405",
        "2201"
      ]
    },
    {
      "id": "sahih-muslim-1937",
      "hadith_no": "1937",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، أخبراه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم ‏.‏ وساق الحديث بمثله وزاد فكدت أساوره في الصلاة فتصبرت حتى سلم ‏.‏",
      "text_en": " This hadith has been transmitted by Zuhri.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10511",
        "2201",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-2478",
      "hadith_no": "2478",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن أبي مليكة، عن المسور بن مخرمة، أنه قال قسم رسول الله صلى الله عليه وسلم أقبية ولم يعط مخرمة شيئا فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم ‏.‏ فانطلقت معه قال ادخل فادعه لي ‏.‏ قال فدعوته له فخرج إليه وعليه قباء منها فقال ‏\"‏ خبأت هذا لك ‏\"‏ ‏.‏ قال فنظر إليه فقال ‏\"‏ رضي مخرمة ‏\"‏ ‏.‏",
      "text_en": " Miswar b. Makhrama reported that the Messenger of Allah (may peace be upon him) distributed some cloaks but did not bestow one upon Makhrama. Upon this Makhrama said:                      0 my son, come along with me to the Messenger of Allah (may peace be upon him). So I went with him. He said: Enter the house and call him (to come out) for me. So I called him and he (the Holy Prophet) came out, and there was a cloak (from those already distributed) on him. He (the Holy Prophet) said: I had kept it for you. He (Makhrama), looked at it and was pleased.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-muslim-2479",
      "hadith_no": "2479",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الخطاب، زياد بن يحيى الحساني حدثنا حاتم بن وردان أبو صالح، حدثنا أيوب السختياني، عن عبد الله بن أبي مليكة، عن المسور بن مخرمة، قال قدمت على النبي صلى الله عليه وسلم أقبية فقال لي أبي مخرمة انطلق بنا إليه عسى أن يعطينا منها شيئا ‏.‏ قال فقام أبي على الباب فتكلم فعرف النبي صلى الله عليه وسلم صوته فخرج ومعه قباء وهو يريه محاسنه وهو يقول ‏\"‏ خبأت هذا لك خبأت هذا لك ‏\"‏ ‏.‏",
      "text_en": " Miswar b. Makhrama reported:                      Some cloaks were presented to the Messenger of Allah (may peace be upon him). My father Makhrama said to me: Come along with me to him; perhaps we may be able to get anything out of that (stock of cloaks). My father stood at the door and began to talk. The Apostle of Allah (may peace be upon him) recognised him by his voice and came out and there was a cloak with him, and he was showing its beauties and saying: I kept it for you, I kept it for you.",
      "usc_msa_ref": "",
      "chain": [
        "30135",
        "20217",
        "11015",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-muslim-4491",
      "hadith_no": "4491",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم - واللفظ لأبي بكر - قال إسحاق أخبرنا وقال الآخران، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن المسور بن مخرمة، قال استشار عمر بن الخطاب الناس في إملاص المرأة فقال المغيرة بن شعبة شهدت النبي صلى الله عليه وسلم قضى فيه بغرة عبد أو أمة ‏.‏ قال فقال عمر ائتني بمن يشهد معك قال فشهد له محمد بن مسلمة ‏.‏",
      "text_en": " Miswar b. Makhrama reported that 'Umar b. Khattab consulted people about the diyat of abortion of an unboam child. Mughira b. Shu'ba said:                      I bear witness to the fact that Allah's Messenger (may peace be upon him) gave judgment about it that a good quality of slave or female slave should be given for it. Thereupon 'Umar said: Bring one who may bear witness to you. Then Muhammad b. Maslama bore witness to him.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30312",
        "20032",
        "11065",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sahih-muslim-6461",
      "hadith_no": "6461",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو معمر، إسماعيل بن إبراهيم الهذلي حدثنا سفيان، عن عمرو، عن  ابن أبي مليكة، عن المسور بن مخرمة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما فاطمة بضعة مني يؤذيني ما آذاها ‏\"‏ ‏.‏",
      "text_en": " Miswar b. Makhramah reported Allah's Messenger (may peace be upon him) as saying:                      Fatima is a part of me. He in fact tortures me who tortures her.",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11081",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sahih-muslim-6463",
      "hadith_no": "6463",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن  الزهري، أخبرني علي بن حسين، أن المسور بن مخرمة، أخبره أن علي بن أبي طالب خطب بنت أبي جهل وعنده فاطمة بنت رسول الله صلى الله عليه وسلم فلما سمعت بذلك فاطمة أتت النبي صلى الله عليه وسلم فقالت له إن قومك يتحدثون أنك لا تغضب لبناتك وهذا علي ناكحا ابنة أبي جهل ‏.‏ قال المسور فقام النبي صلى الله عليه وسلم فسمعته حين تشهد ثم قال ‏\"‏ أما بعد فإني أنكحت أبا العاص بن الربيع فحدثني فصدقني وإن فاطمة بنت محمد مضغة مني وإنما أكره أن يفتنوها وإنها والله لا تجتمع بنت رسول الله وبنت عدو الله عند رجل واحد أبدا ‏\"‏ ‏.‏ قال فترك علي الخطبة ‏.‏",
      "text_en": " 'Ali b. Husain reported that Miswar b. Makhramah informed him that 'Ali b. Abi Talib sent the proposal of marriage to the daughter of Abu Jahl as he had Fatima, the daughter of Allah's Messenger (may peace be upon him), (as his wife). When Fatima heard about it, she came to Allah's Apostle (may peace be upon him) and said:                      The people say that you never feel angry on account of your daughters and now 'Ali is going to marry the daughter of Abu Jahl. Makhramah said: Thereupon Allah's Messenger (may peace be upon him) rose up and I heard him reciting Tashahhud and say: Now to the point. I gave a daughter of mine (Zainab) to Abu'l-'As b. Rabi, and he spoke to me and spoke the truth. Verily Fatima, the daughter of Muhammad, is a part of me and I do not approve that she may be put to any trial and by Allah, the daughter of Allah's Messenger cannot be combined with the daughter of God's enemy (as the co-wives) of one person. Thereupon 'Ali gave up (the idea of his intended) marriage. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30330",
        "20428",
        "11013",
        "11045",
        "2201"
      ]
    },
    {
      "id": "sahih-muslim-7614",
      "hadith_no": "7614",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني حرملة بن يحيى بن عبد الله، - يعني ابن حرملة بن عمران التجيبي - أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة بن الزبير، أن المسور بن مخرمة، أخبره أن عمرو بن عوف وهو حليف بني عامر بن لؤى وكان شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أن رسول الله صلى الله عليه وسلم بعث أبا عبيدة بن الجراح إلى البحرين يأتي بجزيتها وكان رسول الله صلى الله عليه وسلم هو صالح أهل البحرين وأمر عليهم العلاء بن الحضرمي فقدم أبو عبيدة بمال من البحرين فسمعت الأنصار بقدوم أبي عبيدة فوافوا صلاة الفجر مع رسول الله صلى الله عليه وسلم فلما صلى رسول الله صلى الله عليه وسلم انصرف فتعرضوا له فتبسم رسول الله صلى الله عليه وسلم حين رآهم ثم قال ‏\"‏ أظنكم سمعتم أن أبا عبيدة قدم بشىء من البحرين ‏\"‏ ‏.‏ فقالوا أجل يا رسول الله قال ‏\"‏ ‏\"‏ فأبشروا وأملوا ما يسركم فوالله ما الفقر أخشى عليكم ‏.‏ ولكني أخشى عليكم أن تبسط الدنيا عليكم كما بسطت على من كان قبلكم فتنافسوها كما تنافسوها وتهلككم كما أهلكتهم ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. 'Auf, who was an ally of Banu 'Amir b. Luwayy (and he was one amongst them) who participated in Badr along with Allah's Messenger (way peace be upon him). reported that, Allah's Messenger (may peace be upon him) sent Abu Ubaida b. Jarrah to Bahrain for collecting Jizya and Allah's Messenger (may peace be upon him) had made a truce with the people of Bahrain and had appointed 'Ala' b. Hadrami and Abu Ubaida (for this purpose). They came with wealth from Bahrain and the Ansar beard about the arrival of Abu Ubaida and they had observed the dawn prayer along with Allah's Messenger (may peace be upon him), and when Allah's Messenger (may peace be upon him) had finished the prayer they (the Ansar) came before him and Allah's Messenger (may peace be upon him) smiled as he saw them and then said:                      I think you have heard about the arrival of Abu Ubaida with goods from Bahrain. They said: Allah's Messenger. yes, it is so. Thereupon he said: Be happy and be hopeful of that what gives you delight. By Allah, it is not the poverty about which I fear in regard to you but I am afraid in your case that (the worldly) riches way be given to you as were given to those who had gone before you and you begin to vie with one another for them as they vied for them. and these may destroy you as these destroyed them.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10511",
        "2201",
        "30154"
      ]
    },
    {
      "id": "sunan-abi-daud-1754",
      "hadith_no": "1754",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا سفيان بن عيينة، عن الزهري، عن عروة، عن المسور بن مخرمة، ومروان، أنهما قالا خرج رسول الله صلى الله عليه وسلم عام الحديبية فلما كان بذي الحليفة قلد الهدى وأشعره وأحرم ‏.‏",
      "text_en": " Al-Miswar bin Makhramah and al-Marwan said the Messenger of Allah (SWAS) proceeded in the year of al-Hudaibiyyah (to Makkah).  When he reached Dhu al-Hulaifah, he tied (garlanded) something in the neck of the sacrificial camel (which He took along with him), and made incision in its hump and put on Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30146",
        "20005",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-1840",
      "hadith_no": "1840",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن إبراهيم بن عبد الله بن حنين، عن أبيه، أن عبد الله بن عباس، والمسور بن مخرمة، اختلفا بالأبواء فقال ابن عباس يغسل المحرم رأسه وقال المسور لا يغسل المحرم رأسه فأرسله عبد الله بن عباس إلى أبي أيوب الأنصاري فوجده يغتسل بين القرنين وهو يستر بثوب قال فسلمت عليه فقال من هذا قلت أنا عبد الله بن حنين أرسلني إليك عبد الله بن عباس أسألك كيف كان رسول الله صلى الله عليه وسلم يغسل رأسه وهو محرم قال فوضع أبو أيوب يده على الثوب فطأطأه حتى بدا لي رأسه ثم قال لإنسان يصب عليه اصبب ‏.‏ قال فصب على رأسه ثم حرك أبو أيوب رأسه بيديه فأقبل بهما وأدبر ثم قال هكذا رأيته يفعل صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘Abd Allah bin Hunain said ‘Abd Allah bin Abbas and Miswar bin Makhramah differed amongst themselves (on the question of washing the head in the sacred state) at al Abwa. ‘Ibn Abbas said A pilgrim in the sacred state (while wearing ihram) can wash his head. Al Miswar said A pilgrim in the sacred state(wearing ihram) cannot wash his head. ‘Abd Allah bin Abbas then sent him (‘Abd Allah bin Hunain) to Abu Ayyub Al Ansari. He found him taking a bath between two woods erected at the edge of the well and he was hiding himself with a cloth (curtain). He (the narrator) said I saluted him. He asked Who is this? I said I am ‘Abd Allah bin Hunain. ‘Abd Allah bin Abbas has sent me to you asking you how the Apostle of Allaah(ﷺ) used to wash his head while he was wearing ihram. Abu Ayyub then put his hand on the cloth and removed it till his head appeared to me. He then said to a person who was pouring water on him:                      Pour water. He poured water on his head and Abu Ayyub moved his head with his hands. He carried his hands forward and backward. He then said I saw him doing similarly.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11150",
        "11181",
        "17",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-2071",
      "hadith_no": "2071",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن يونس، وقتيبة بن سعيد، - المعنى - قال أحمد حدثنا الليث، حدثني عبد الله بن عبيد الله بن أبي مليكة القرشي التيمي، أن المسور بن مخرمة، حدثه أنه، سمع رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ إن بني هشام بن المغيرة استأذنوني أن ينكحوا ابنتهم من علي بن أبي طالب فلا آذن ثم لا آذن ثم لا آذن إلا أن يريد ابن أبي طالب أن يطلق ابنتي وينكح ابنتهم فإنما ابنتي بضعة مني يريبني ما أرابها ويؤذيني ما آذاها ‏\"‏ ‏.‏ والإخبار في حديث أحمد ‏.‏",
      "text_en": " Al Miswar bin Makramah said that he heard the Apostle of Allaah(ﷺ) say on the pulpit Banu Hashim bin Al Mughirah sought permission from me to marry their daughter  to ‘Ali bin Abi Talib. But I do not permit, again, I do not permit, again, I do not permit except that Ibn Abi Talib divorces my daughter and marries their daughter. My daughter is my part, what makes her uneasy makes me uneasy and what troubles her troubles me. The full information rests with the tradition narrated by Ahmad.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "30367",
        "30007",
        "20023",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-2693",
      "hadith_no": "2693",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن أبي مريم، حدثنا عمي، - يعني سعيد بن الحكم - قال أخبرنا الليث بن سعد، عن عقيل، عن ابن شهاب، قال وذكر عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قال حين جاءه وفد هوازن مسلمين فسألوه أن يرد إليهم أموالهم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون وأحب الحديث إلى أصدقه فاختاروا إما السبى وإما المال ‏\"‏ ‏.‏ فقالوا نختار سبينا فقام رسول الله صلى الله عليه وسلم فأثنى على الله ثم قال ‏\"‏ أما بعد فإن إخوانكم هؤلاء جاءوا تائبين وإني قد رأيت أن أرد إليهم سبيهم فمن أحب منكم أن يطيب ذلك فليفعل ومن أحب منكم أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏ ‏.‏ فقال الناس قد طيبنا ذلك لهم يا رسول الله ‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏ ‏.‏ فرجع الناس فكلمهم عرفاؤهم فأخبروهم أنهم قد طيبوا وأذنوا ‏.‏",
      "text_en": " Marwan and Al Miswar bin Makhramah told that when the deputation of the Hawazin came to the Muslims and asked the Apostle of Allaah(ﷺ) to return to them their property, the Apostle of Allaah(ﷺ) said to them “with me are those whom you see”. The speech dearest to me is the one which is true, so choose (one of the two) either the captives or the property. They said “We choose our captives. The Apostle of Allaah(ﷺ) stood up, extolled Allaah and then said “To proceed, your brethren have come repentant I have considered that I should return their captives to them, so let those of you who are willing to release the captives act accordingly, but those who wish to hold on to what they have till we give them some of the first booty Allaah gives us may do so. The people said “We are willing for that (to release their captives), Apostle of Allaah. The Apostle of Allaah(ﷺ) said “We cannot distinguish between those of you who have granted that and those who have not , so return till your headmen may tell us about your affair. The people then returned and their headmen spoke to them, then they informed that they were agreeable and had given their permission.",
      "usc_msa_ref": "",
      "chain": [
        "20023",
        "11207",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-2765",
      "hadith_no": "2765",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عبيد، أن محمد بن ثور، حدثهم عن معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، قال خرج النبي صلى الله عليه وسلم زمن الحديبية في بضع عشرة مائة من أصحابه حتى إذا كانوا بذي الحليفة قلد الهدى وأشعره وأحرم بالعمرة ‏.‏ وساق الحديث قال وسار النبي صلى الله عليه وسلم حتى إذا كان بالثنية التي يهبط عليهم منها بركت به راحلته فقال الناس حل حل خلأت القصواء ‏.‏ مرتين فقال النبي صلى الله عليه وسلم ‏\"‏ ما خلأت وما ذلك لها بخلق ولكن حبسها حابس الفيل ‏\"‏ ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لا يسألوني اليوم خطة يعظمون بها حرمات الله إلا أعطيتهم إياها ‏\"‏ ‏.‏ ثم زجرها فوثبت فعدل عنهم حتى نزل بأقصى الحديبية على ثمد قليل الماء فجاءه بديل بن ورقاء الخزاعي ثم أتاه - يعني عروة بن مسعود - فجعل يكلم النبي صلى الله عليه وسلم فكلما كلمه أخذ بلحيته والمغيرة بن شعبة قائم على النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر فضرب يده بنعل السيف وقال أخر يدك عن لحيته ‏.‏ فرفع عروة رأسه فقال من هذا قالوا المغيرة بن شعبة ‏.‏ فقال أى غدر أولست أسعى في غدرتك وكان المغيرة صحب قوما في الجاهلية فقتلهم وأخذ أموالهم ثم جاء فأسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما الإسلام فقد قبلنا وأما المال فإنه مال غدر لا حاجة لنا فيه ‏\"‏ ‏.‏ فذكر الحديث فقال النبي صلى الله عليه وسلم ‏\"‏ اكتب هذا ما قاضى عليه محمد رسول الله ‏\"‏ ‏.‏ وقص الخبر فقال سهيل وعلى أنه لا يأتيك منا رجل وإن كان على دينك إلا رددته إلينا ‏.‏ فلما فرغ من قضية الكتاب قال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ قوموا فانحروا ثم احلقوا ‏\"‏ ‏.‏ ثم جاء نسوة مؤمنات مهاجرات الآية فنهاهم الله أن يردوهن وأمرهم أن يردوا الصداق ثم رجع إلى المدينة فجاءه أبو بصير رجل من قريش - يعني فأرسلوا في طلبه - فدفعه إلى الرجلين فخرجا به حتى إذا بلغا ذا الحليفة نزلوا يأكلون من تمر لهم فقال أبو بصير لأحد الرجلين والله إني لأرى سيفك هذا يا فلان جيدا ‏.‏ فاستله الآخر فقال أجل قد جربت به فقال أبو بصير أرني أنظر إليه فأمكنه منه فضربه حتى برد وفر الآخر حتى أتى المدينة فدخل المسجد يعدو فقال النبي صلى الله عليه وسلم ‏\"‏ لقد رأى هذا ذعرا ‏\"‏ ‏.‏ فقال قد قتل والله صاحبي وإني لمقتول فجاء أبو بصير فقال قد أوفى الله ذمتك فقد رددتني إليهم ثم نجاني الله منهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ويل أمه مسعر حرب لو كان له أحد ‏\"‏ ‏.‏ فلما سمع ذلك عرف أنه سيرده إليهم فخرج حتى أتى سيف البحر وينفلت أبو جندل فلحق بأبي بصير حتى اجتمعت منهم عصابة ‏.‏",
      "text_en": " Al Miswar bin Makhramah said :                      The Messenger of Allah (ﷺ) came out in the year of al-Hudaibbiyyah with over ten hundreds of Companions and when he came to Dhu al Hulaifah. He garlanded and marked the sacrificial animals, and entered the sacred state of Umrah. He then went on with the tradition. The Prophet moved on and when he came to the mountain, pass by which one descends (to Mecca) to them, his riding-beast knelt down, and the people said twice: Go on, go on, al-Qaswa has become jaded. The Prophet (May peace be upon him) said: She has not become jaded and that is not a characteristic of hers, but He Who restrained the elephant has restrained her. He then said: By Him in Whose hand my soul is, they will not ask any me good thing by which they honor which God has made sacred without my giving them it. He then urged her and she leaped up and he turned aside from them, and stopped at the farthest side of al-Hudaibiyyah at a pool with little water. Meanwhile Budail bin Warqa al-Khuza’I came, and ‘Urwah bin Mas’ud joined him. He began to speak to the Prophet (ﷺ). Whenever he spoke to the Prophet (ﷺ), he caught his beard. Al Mughriah bin Shu’bah was standing beside the Prophet (ﷺ).He had a sword with him, wearing a helmet. He (Al Mughriah) struck his (‘Urwah’s) hand with the lower end of his sheath, and said: Keep away your hand from his beard. ‘Urwah then raised his hand and asked: Who is this? They replied: Al-Mughirah bin Shu’bah. He said: O treacherous one! Did I not use my offices in your treachery? In pre-Islamic days Al-Mughirah bin Shu’bah accompanied some people and murdered them, and took their property. He then came (to the Prophet) and embraced Islam. The Prophet (ﷺ) said: As for Islam we accepted it, but as to the property, as it has been taken by treachery, we have no need of it. He went on with the tradition the Prophet (ﷺ) said: Write down: This is what Muhammad, the Messenger of Allah, has decided. He then narrated the tradition. Suhail then said: And that a man will not come to you from us, even if he follows your religion, without you sending him back to us. When he finished drawing up the document, the Prophet (ﷺ) said to his Companions: Get up and sacrifice and then shave. Thereafter some believing women who were immigrants came. (Allah sent down: O yea who believe, when believing women come to you as emigrants). Allah most high forbade them to send them back, but ordered them to restore the dower. He then returned to Medina. Abu Basir a man from the Quraish (who was a Muslim), came to him. And they sent (two men) to look for him; so he handed him over to the two men. They took him away, and when they reached Dhu Al Hulaifah and alighted to eat some dates which they had, Abu Basir said to one of the men : I swear by Allah so-and-so, that I think this sword of yours is a fine one; the other drew the sword and said : Yes I have tried it. Abu Basir said: Let me look at it. He let him have it and he struck him till he died, whereupon the other fled and came to Medina, and running entered the mosque. The Prophet ( may peace be upon him) said: This man has seen something frightful. He said: I swear by Allah that my Companion has been killed, and im as good as dead. Abu Basir then arrived and said: Allah has fulfilled your covenant. You returned me to them, but Allah saved me from them. The Prophet (ﷺ) said: Woe to his mother, stirrer up of war! Would that he had someone (i.e. some kinsfolk). When he heard that he knew that he would send him back to them, so he went out and came to the seashore. Abu Jandal escaped and joined Abu Basir till a band of them collected.",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-2766",
      "hadith_no": "2766",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن إدريس، قال سمعت ابن إسحاق، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، ومروان بن الحكم، أنهم اصطلحوا على وضع الحرب عشر سنين يأمن فيهن الناس وعلى أن بيننا عيبة مكفوفة وأنه لا إسلال ولا إغلال ‏.‏",
      "text_en": " Al Miswar bin Makhramah and Marwan bin Al Hakam said “They agreed to abandon war for ten years during which the people which have security on the basis that there should be sincerity between them and that there should be not theft or treachery.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20102",
        "11107",
        "11013",
        "10511",
        "2201",
        "858"
      ]
    },
    {
      "id": "sunan-abi-daud-4016",
      "hadith_no": "4016",
      "source": "Sunan Abi Da'ud",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن إبراهيم، حدثنا يحيى بن سعيد الأموي، عن عثمان بن حكيم، عن أبي أمامة بن سهل، عن المسور بن مخرمة، قال حملت حجرا ثقيلا فبينا أمشي فسقط عني ثوبي فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ خذ عليك ثوبك ولا تمشوا عراة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miswar b. Makhramah:                     I lifted a heavy stone. While I was walking my garment fell down. The Messenger of Allah (ﷺ) said to me: Take you garment upon you, and do not walk naked.",
      "usc_msa_ref": "",
      "chain": [
        "20208",
        "20367",
        "11889",
        "405",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-4028",
      "hadith_no": "4028",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن موهب، - المعنى - أن الليث، - يعني ابن سعد - حدثهم عن عبد الله بن عبيد الله بن أبي مليكة، عن المسور بن مخرمة، أنه قال قسم رسول الله صلى الله عليه وسلم أقبية ولم يعط مخرمة شيئا فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم فانطلقت معه قال ادخل فادعه لي قال فدعوته فخرج إليه وعليه قباء منها فقال ‏\"‏ خبأت هذا لك ‏\"‏ ‏.‏ قال فنظر إليه - زاد ابن موهب - مخرمة - ثم اتفقا - قال رضي مخرمة ‏.‏ قال قتيبة عن ابن أبي مليكة لم يسمه ‏.‏",
      "text_en": " Narrated Al-Miswar b. Makhramah:                     The Messenger of Allah (ﷺ) distributed outer garments with full-length sleeves but did not give Makhramah anything. Makhramah said: Go with us to the Messenger of Allah (ﷺ). So I went with him and he said: Enter and call him for me. I then called him. He came out to him and he had an outer garment with full-length sleeves over him from those garments. He said: I kept it for you. He looked at it, meaning Makhramah according to the addition of Ibn Mawhab. The agreed version then says: He said: Makhramah was pleased. Ibn Qutaibah said: From Ibn Abi Mulaikah, but he did not name it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "38715",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-4570",
      "hadith_no": "4570",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وهارون بن عباد الأزدي، - المعنى - قالا حدثنا وكيع، عن هشام، عن عروة، عن المسور بن مخرمة، أن عمر، استشار الناس في إملاص المرأة فقال المغيرة بن شعبة شهدت رسول الله صلى الله عليه وسلم قضى فيها بغرة عبد أو أمة ‏.‏ فقال ائتني بمن يشهد معك ‏.‏ فأتاه بمحمد بن مسلمة - زاد هارون - فشهد له يعني ضرب الرجل بطن امرأته ‏.‏ قال أبو داود بلغني عن أبي عبيد إنما سمي إملاصا لأن المرأة تزلقه قبل وقت الولادة وكذلك كل ما زلق من اليد وغيره فقد ملص ‏.‏",
      "text_en": " Narrated Al-Miswar b. Makhramah:                     'Umar consulted the people about the compensation of abortion of woman. Al-Mughirah b. Shu'bah said: I was present with the Messenger of Allah (ﷺ) when he gave judgement that a male or female slave should testify you. So he brought Muhammad b. Maslamah to him. Harun added: He then testified him.Imlas means a man striking the belly of his wife.Abu Dawud said: I have been informed that Abu 'Ubaid said: It (abortion) is called imlas because the woman causes it to slip before the time of delivery. Similarly, anything which slips from the hand or from some other thing is called malasa (slipped).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "20295",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-4655",
      "hadith_no": "4655",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عبيد، أن محمد بن ثور، حدثهم عن معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، قال خرج النبي صلى الله عليه وسلم زمن الحديبية فذكر الحديث ‏.‏ قال فأتاه - يعني عروة بن مسعود - فجعل يكلم النبي صلى الله عليه وسلم فكلما كلمه أخذ بلحيته والمغيرة بن شعبة قائم على رأس النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر فضرب يده بنعل السيف وقال أخر يدك عن لحيته ‏.‏ فرفع عروة رأسه فقال من هذا قالوا المغيرة بن شعبة ‏.‏",
      "text_en": " Al-Miswar b. Makhramah said :                      The prophet (ﷺ) went out during the time of (treaty of) al-Hudaibiyyah. He then mentioned the rest of the tradition. He said : ‘Urwah b. Mas’ud then came to him and began to speak to the Prophet (ﷺ). Whenever he talk to him, he caught his beard ; and al-Mughirah b. Shu’bah was standing near the head of the Prophet (ﷺ) with a sword with him and a helmet on him. He then struck his hand with the handle of the sword, saying : Keep away your hand from his beard. ‘Urwah then raised his head and said : Who is this ? The prophet said : Al-Mughirah b. Shu’bah.",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2650",
      "hadith_no": "2650",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن معمر، ويونس، عن الزهري، أن عروة بن الزبير، أخبره أن المسور بن مخرمة أخبره أن عمرو بن عوف وهو حليف بني عامر بن لؤى وكان شهد بدرا مع رسول الله صلى الله عليه وسلم - أخبره أن رسول الله صلى الله عليه وسلم بعث أبا عبيدة بن الجراح فقدم بمال من البحرين وسمعت الأنصار بقدوم أبي عبيدة فوافوا صلاة الفجر مع رسول الله صلى الله عليه وسلم فلما صلى رسول الله صلى الله عليه وسلم انصرف فتعرضوا له فتبسم رسول الله صلى الله عليه وسلم حين رآهم ثم قال ‏\"‏ أظنكم سمعتم أن أبا عبيدة قدم بشيء ‏\"‏ ‏.‏ قالوا أجل يا رسول الله ‏.‏ قال ‏\"‏ فأبشروا وأملوا ما يسركم فوالله ما الفقر أخشى عليكم ولكني أخشى أن تبسط الدنيا عليكم كما بسطت على من قبلكم فتنافسوها كما تنافسوها فتهلككم كما أهلكتهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Al-Mustawrad bin Makhramah narrated that 'Amir bin 'Awf informed him- and he was an ally of Banu 'Amr bin Lu'ay who had participated with The Messenger of Allah (s.a.w) at(the battle of ) Badr, he said:                     \"The Messenger of Allah (s.a.w) had dispatched Abu 'Ubaidah bin Al-Jarrah, so he arrived with the wealth from Al-Bahrain. When the Ansar had heard of the arrival of Abu 'Ubaidah they were attending Salat Al-Fajr. So the the Messenger of Allah (s.a.w)  performed the Salat and when he finished, they assembled before him. The Messenger of Allah (s.a.w) smiled when he saw them, then he said: 'I think that you heard that Abu 'Ubaidah has arrived with something?' They said: 'Yes O Messenger of Allah! 'He said: 'Then receive good news, and hope for what will please you. By Allah! It is not poverty that I fear for you, but what I fear for you is that the world will be presented for you just as it was presented for those before you,then you will compete for it, just as  they competed  for it, and it will destroy you, just as it destroyed them.'''",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20115",
        "20475",
        "11013",
        "10511",
        "2201",
        "30154"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3050",
      "hadith_no": "3050",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، أن رسول الله صلى الله عليه وسلم قسم أقبية ولم يعط مخرمة شيئا فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم فانطلقت معه قال ادخل فادعه لي فدعوته له فخرج النبي صلى الله عليه وسلم وعليه قباء منها فقال ‏\"‏ خبأت لك هذا ‏\"‏ ‏.‏ قال فنظر إليه فقال ‏\"‏ رضي مخرمة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وابن أبي مليكة اسمه عبد الله بن عبيد الله بن أبي مليكة ‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhramah:                     \"The Messenger of Allah (ﷺ) distributed some cloaks but he did not give anything to Makhramah. Makhramah said: 'O my son! Let us go to the Messenger of Allah (ﷺ).' So I went with him. He said: 'Enter and call him for me.'So I called the Prophet (ﷺ) for him, then the Prophet (ﷺ) came out wearing one of the cloaks. He (ﷺ) said: 'I kept this one for you.'\" He said: \"So he looked at him and said: 'Makhramah is pleased.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3195",
      "hadith_no": "3195",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا الحسن بن علي الخلال، وغير، واحد، قالوا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، أخبراه أنهما، سمعا عمر بن الخطاب، يقول مررت بهشام بن حكيم بن حزام وهو يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت قراءته فإذا هو يقرأ على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم فكدت أساوره في الصلاة فنظرته حتى سلم فلما سلم لببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرؤها فقال أقرأنيها رسول الله صلى الله عليه وسلم قال ‏.‏ قلت له كذبت والله إن رسول الله صلى الله عليه وسلم لهو أقرأني هذه السورة التي تقرؤها ‏.‏ فانطلقت أقوده إلى النبي صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على حروف لم تقرئنيها وأنت أقرأتني سورة الفرقان ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أرسله يا عمر اقرأ يا هشام ‏\"‏ ‏.‏ فقرأ القراءة التي سمعته فقال النبي صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ اقرأ يا عمر ‏\"‏ ‏.‏ فقرأت القراءة التي أقرأني النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روى مالك بن أنس عن الزهري بهذا الإسناد نحوه إلا أنه لم يذكر فيه المسور بن مخرمة ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     \"I passed by Hisham bin Hakim bin Hizam while he was reciting Surat Al-Furqan during the lifetime of the Messenger of Allah (ﷺ). I listened to his recitation and noticed that he recited it in several different ways, which the Messenger of Allah (ﷺ) had not taught me. I was about to jump over him during his Salat, but waited until he said the Salam. When he had said the Salam, I strangled him with his upper-garment and said: 'Who taught you this Surah which I heard you reciting?' He said: 'The Messenger of Allah (ﷺ) taught it to me.' I said to him: 'You lie! By Allah! The Messenger of Allah (ﷺ) taught me this Surah which you were reciting.' I dragged him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah! I heard this one reciting Surat Al-Furqan in a manner different from how you taught me, and you taught me Surat Al-Furqan.' The Prophet (ﷺ) said: 'Release him O 'Umar! Recite O Hisham.' So he recited it for him as I had heard him reciting. Then the Prophet (ﷺ) said to me: 'This is how it was revealed.' Then the Prophet (ﷺ) said to me, 'Recite O 'Umar.' So I recited the recitation which the Prophet (ﷺ) taught me. The Prophet (ﷺ) said: 'This is how it was revealed.' Then the Prophet (ﷺ) said 'Indeed this Qur'an was revealed in seven modes, so recite of it what is easier for you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "20115",
        "11013",
        "10511",
        "2201",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4241",
      "hadith_no": "4241",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، قال سمعت النبي صلى الله عليه وسلم يقول وهو على المنبر ‏\"‏ إن بني هشام بن المغيرة استأذنوني في أن ينكحوا ابنتهم علي بن أبي طالب فلا آذن ثم لا آذن ثم لا آذن إلا أن يريد ابن أبي طالب أن يطلق ابنتي وينكح ابنتهم فإنها بضعة مني يريبني ما رابها ويؤذيني ما آذاها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه عمرو بن دينار عن ابن أبي مليكة عن المسور بن مخرمة نحو هذا ‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhramah:                     \"While he was on the Minbar, I heard the Prophet (ﷺ) saying: 'Indeed Banu Hisham bin Al-Mughirah asked me if they could marry their daughter to 'Ali bin Abi Talib. But I do not allow it, I do not allow it, I do not allow it - unless 'Ali bin Abi Talib wishes to divorce my daughter and marry their daughter, because she is a part of me. I am displeased by what displeases her, and I am harmed by what harms her.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sunan-an-nasai-938",
      "hadith_no": "938",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، أخبراه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته فإذا هو يقرؤها على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم فكدت أساوره في الصلاة فتصبرت حتى سلم فلما سلم لببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرؤها فقال أقرأنيها رسول الله صلى الله عليه وسلم ‏.‏ فقلت كذبت ‏.‏ فوالله إن رسول الله صلى الله عليه وسلم هو أقرأني هذه السورة التي سمعتك تقرؤها فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على حروف لم تقرئنيها وأنت أقرأتني سورة الفرقان ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله يا عمر اقرأ يا هشام ‏\"‏ ‏.‏ فقرأ عليه القراءة التي سمعته يقرؤها قال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا عمر ‏\"‏ ‏.‏ فقرأت القراءة التي أقرأني قال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذا القرآن أنزل على سبعة أحرف ‏{‏ فاقرءوا ما تيسر منه ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Urwah bin Az-Zubair narrated that Al-Miswar bin Makhramah and AbdurRahman bin Abdul-Qari told him that:                     They heard Umar bin Al-Khattab say: \"I heard Hisham bin Hakim bin Hizam reciting Surat Al-Furqan during the lifetime of the Messenger of Allah (ﷺ), so I listened to his recitation and he was reciting it in a way that the Messenger of Allah (ﷺ) had not taught me. I was about to jump on him while he was praying, but I waited patiently until he said the Salam (at the end of the prayer). When he had said the Salam I grabbed him by his garment and said: 'Who taught you this Surah that I heard you reciting?' He said: 'The Messenger of Allah (ﷺ) taught me it. I said: 'You are lying, by Allah! The Messenger of Allah (ﷺ) is the one who taught me this Surah that I heard you reciting.' I took him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, I heard this man reciting Surat Al-Furqan in a way that you did not teach me, but you taught me Surat Al-Furqan.' The Messenger of Allah (ﷺ) said:' Let him go, O Umar. Recite, O Hisham.' So I recited it to him in the way that I had heard him recite. The Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then the Messenger of Allah (ﷺ) said: 'Recite, O Umar.' So I recited it in the way that he had taught me. The Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then the Messenger of Allah (ﷺ) said: 'This Quran has been revealed to be recited in seven different modes, so recite as much of the Quran as may be easy for you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "10511",
        "2201",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-2665",
      "hadith_no": "2665",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن زيد بن أسلم، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن عبد الله بن عباس، والمسور بن مخرمة، أنهما اختلفا بالأبواء فقال ابن عباس يغسل المحرم رأسه ‏.‏ وقال المسور لا يغسل رأسه ‏.‏ فأرسلني ابن عباس إلى أبي أيوب الأنصاري أسأله عن ذلك فوجدته يغتسل بين قرنى البئر وهو مستتر بثوب فسلمت عليه وقلت أرسلني إليك عبد الله بن عباس أسألك كيف كان رسول الله صلى الله عليه وسلم يغسل رأسه وهو محرم فوضع أبو أيوب يده على الثوب فطأطأه حتى بدا رأسه ثم قال لإنسان يصب على رأسه ثم حرك رأسه بيديه فأقبل بهما وأدبر وقال هكذا رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas and Al-Miswar bin Makhramah that:                     they had a difference of opinion in al-Abwa. Ibn 'Abbas said: \"The Muhrim (Pilgrim in Ihram) may wash his head.\" Al-Miswar said: \"He should not wash his head.\"Ibn 'Abbas sent me (the narrator) to Abu Ayyub Al-Ansari to ask him about that. I found him performing Ghusl in front of the well, screened with a cloth. I greeted him with Salam and said: \"Abdullah bin 'Abbas has sent me to you to ask you how the Messenger of Allah used to wash his head when he was in Ihram.\" Abu put his hand on the cloth and lowered it, until his head appeared, then he told someone to puor water on his head. Then he rubbed his head with his hands, back and forth, and said: \"This is what I saw the Messenger of Allah do.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11163",
        "11150",
        "11181",
        "17",
        "2201"
      ]
    },
    {
      "id": "sunan-an-nasai-2771",
      "hadith_no": "2771",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا محمد بن ثور، عن معمر، عن الزهري، عن عروة، عن المسور بن مخرمة، قال خرج رسول الله صلى الله عليه وسلم ح وأنبأنا يعقوب بن إبراهيم قال حدثنا يحيى بن سعيد قال حدثنا عبد الله بن المبارك قال حدثنا معمر عن الزهري عن عروة عن المسور بن مخرمة ومروان بن الحكم قالا خرج رسول الله صلى الله عليه وسلم زمن الحديبية في بضع عشرة مائة من أصحابه حتى إذا كانوا بذي الحليفة قلد الهدى وأشعر وأحرم بالعمرة ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Al-Miswar bin Makhramah and Marwan bin Al-Hakam said:                     \"The Messenger of Allah went out during the time of Al-Hudabiyah with between one-thousand and three-hundred, and one-thousand and five-hundred of his Companions. Then, when they were in Dhul-Hulaifah, he garlanded and marked the Hadi and began the Talbiyah for 'Umrah (Abridged).",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "28500",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-an-nasai-3506",
      "hadith_no": "3506",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - قالا أنبأنا ابن القاسم، عن مالك، عن هشام بن عروة، عن أبيه، عن المسور بن مخرمة، أن سبيعة الأسلمية، نفست بعد وفاة زوجها بليال فجاءت رسول الله صلى الله عليه وسلم فاستأذنت أن تنكح فأذن لها فنكحت ‏.‏",
      "text_en": " It was narrated from Al-Miswar bin Makhramah that Subai'ah Al-Aslamiyyah gave birth one day after her husband died. She came to the Messenger of Allah and asked his permission to marry, and he gave her permission to marry and she married.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11065",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-an-nasai-3507",
      "hadith_no": "3507",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا نصر بن علي بن نصر، عن عبد الله بن داود، عن هشام بن عروة، عن أبيه، عن المسور بن مخرمة، أن النبي صلى الله عليه وسلم أمر سبيعة أن تنكح إذا تعلت من نفاسها ‏.‏",
      "text_en": " It was narrated from Al-Miswar bin Makhramah that the Prophet commanded Sabai'ah to get married when her Nifas ended.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20330",
        "11065",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-an-nasai-5324",
      "hadith_no": "5324",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، قال قسم رسول الله صلى الله عليه وسلم أقبية ولم يعط مخرمة شيئا فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم ‏.‏ فانطلقت معه قال ادخل فادعه لي ‏.‏ قال فدعوته فخرج إليه وعليه قباء منها فقال ‏\"‏ خبأت هذا لك ‏\"‏ ‏.‏ فنظر إليه فلبسه مخرمة ‏.‏",
      "text_en": " It was narrated that Miswar bin Makhramah said:                     \"The Messenger of Allah [SAW] distributed some Qaba's but he did not give anything to Makhramah. Makhramah said: 'O my son, let us go to the Messenger of Allah [SAW].' So I went with him and he said: 'Go in and call him for me.' So I called him, and he came out wearing one of the Qaba's. He said: 'I kept this for you.' And he looked at him, and Makhramah put it on.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2076",
      "hadith_no": "2076",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عيسى بن حماد المصري، أنبأنا الليث بن سعد، عن عبد الله بن أبي مليكة، عن المسور بن مخرمة، قال سمعت رسول الله  صلى الله عليه وسلم  وهو على المنبر يقول ‏\"‏ إن بني هشام بن المغيرة استأذنوني أن ينكحوا ابنتهم علي بن أبي طالب فلا آذن لهم ثم لا آذن لهم ثم لا آذن لهم إلا أن يريد علي بن أبي طالب أن يطلق ابنتي وينكح ابنتهم فإنما هي بضعة مني يريبني ما رابها ويؤذيني ما آذاها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mishwar bin Makhramah said:                     \"I heard the Messenger of Allah when he was on the pulpit, say: 'Banu Hisham bin Mughirah asked me for permission to marry their daughter to 'Ali bin Abu Talib, but I will not give them permission, and I will not give them permission, and I will not give them permission, unless 'Ali bin Abu Talib wants to divorce my daughter and marry their daughter, for she is a part of me, and what bothers her bothers me, and what upsets her upsets me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2077",
      "hadith_no": "2077",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو اليمان، أنبأنا شعيب، عن الزهري، أخبرني علي بن الحسين، أن المسور بن مخرمة، أخبره أن علي بن أبي طالب خطب بنت أبي جهل وعنده فاطمة بنت النبي  صلى الله عليه وسلم  فلما سمعت بذلك، فاطمة أتت النبي  صلى الله عليه وسلم  فقالت إن قومك يتحدثون أنك لا تغضب لبناتك وهذا علي ناكحا ابنة أبي جهل ‏.‏ قال المسور فقام النبي  صلى الله عليه وسلم  فسمعته حين تشهد ثم قال ‏\"‏ أما بعد فإني قد أنكحت أبا العاص بن الربيع فحدثني فصدقني وإن فاطمة بنت محمد بضعة مني وأنا أكره أن تفتنوها وإنها والله لا تجتمع بنت رسول الله وبنت عدو الله عند رجل واحد أبدا ‏\"‏ ‏.‏ قال فنزل علي عن الخطبة ‏.‏",
      "text_en": " 'Ali bin Husain said that Miswar bin Makhramah told him that:                     'Ali bin Abu Talib proposed to the daughter of Abu Jahl, when he was married to Fatimah the daughter of the Prophet. When Fatimah heard of that she went to the Prophet, and said: \"Your people are saying that you do not feel angry for your daughters. This 'Ali is going to marry the daughter of Abu lahl.\" Miswar said: \"The Prophet stood up, and I heard him when he bore witness (i.e., said the Shahddah), then he said: 'I married my daughter (Zainab) to Abul-As bin Rabi', and he spoke to me and was speaking the truth. Fatimah bint Mulfimmad is a part of me, and I hate to see her faced with troubles. By Allah, the daughter of the Messenger of Allah and the daughter of the enemy of Allah will never be joined together in marriage to one man.\"He said: So, 'Ali abandoned the marriage proposal.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30330",
        "20428",
        "11013",
        "11045",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2107",
      "hadith_no": "2107",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا نصر بن علي، ومحمد بن بشار، قالا حدثنا عبد الله بن داود، حدثنا هشام بن عروة، عن أبيه، عن المسور بن مخرمة، أن النبي  صلى الله عليه وسلم  أمر سبيعة أن تنكح إذا تعلت من نفاسها ‏.‏",
      "text_en": " It was narrated from Miswar bin Makhramah that:                     the Prophet (ﷺ) told Subai'ah to get married, when her postnatal bleeding ended.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "30160",
        "20330",
        "11065",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2126",
      "hadith_no": "2126",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا علي بن الحسين بن واقد، حدثنا هشام بن سعد، عن الزهري، عن عروة، عن المسور بن مخرمة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا طلاق قبل نكاح ولا عتق قبل ملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miswar bin Makharamah that the Prophet (ﷺ) said:                     \"There is no divorce before marriage, and no manumission before taking possession.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30555",
        "20519",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2742",
      "hadith_no": "2742",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن المسور بن مخرمة، قال استشار عمر بن الخطاب الناس في إملاص المرأة يعني سقطها فقال المغيرة بن شعبة شهدت رسول الله صلى الله عليه وسلم قضى فيه بغرة عبد أو أمة ‏.‏ فقال عمر ائتني بمن يشهد معك ‏.‏ فشهد معه محمد بن مسلمة ‏.‏",
      "text_en": " It was narrated that Miswar bin Makhramah said:                     “Umar bin Khattab consulted the people concerning a woman who had been caused to miscarry. Al-Mughirah bin Shu'bah said: 'I saw the messenger of Allah (ﷺ) rule that a slave, male or female, be given as blood money (for a fetus).' 'Umar said: 'Bring me someone who will testify alongside you. So he brought Muhammad bin Maslamah to testify along with him.'”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11065",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2856",
      "hadith_no": "2856",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا مروان بن محمد، حدثنا سليمان بن بلال، حدثني يحيى بن سعيد، عن سعيد بن المسيب، عن جابر بن عبد الله، والمسور بن مخرمة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يرث الصبي حتى يستهل صارخا ‏\"‏ ‏.‏ قال واستهلاله أن يبكي ويصيح أو يعطس ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah and Miswar bin Makhrumahthat theMessenger of Allah (ﷺ) said:                      “No child inherits until heraiseshis voice or cries.”",
      "usc_msa_ref": "",
      "chain": [
        "20640",
        "20160",
        "11062",
        "11002",
        "34",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-3046",
      "hadith_no": "3046",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مصعب، حدثنا مالك، عن زيد بن أسلم، عن إبراهيم بن عبد الله بن حنين، عن أبيه، أن عبد الله بن عباس، والمسور بن مخرمة، اختلفا بالأبواء فقال عبد الله بن عباس يغسل المحرم رأسه ‏.‏ وقال المسور بن مخرمة لا يغسل المحرم رأسه ‏.‏ فأرسلني ابن عباس إلى أبي أيوب الأنصاري أسأله عن ذلك، فوجدته يغتسل بين القرنين وهو يستتر بثوب فسلمت عليه فقال من هذا قلت أنا عبد الله بن حنين أرسلني إليك عبد الله بن عباس أسألك كيف كان رسول الله  صلى الله عليه وسلم  يغسل رأسه وهو محرم قال فوضع أبو أيوب يده على الثوب فطأطأه حتى بدا لي رأسه ثم قال لإنسان يصب عليه اصبب ‏.‏ فصب على رأسه ثم حرك رأسه بيديه فأقبل بهما وأدبر ‏.‏ ثم قال هكذا رأيته  صلى الله عليه وسلم  يفعل ‏.‏",
      "text_en": " It wasnarrated from Ibrahim bin ‘Abdullah bin Hunain, from his father,that ‘Abdullah bin ‘Abbas and Miswar bin Makhramah disagreed atAbwa’. Abdullah bin ‘Abbas said that the Muhrim may wash hishead, and Miswar said that the Muhrim may not wash his head.Ibn ‘Abbas sent me to Abu Ayyub Al-Ansari to ask him about that, and I found him taking a bath near the well, screened with a piece of cloth. I greeted him with Salam, and he said:                      “Who is this?” I said: “I am ‘Abdullah bin Hunain. ‘Abdullah bin ‘Abbas sent me to you to ask you how the Messenger of Allah (ﷺ) used to wash his head when he was in Ihram.” He said: “Abu Ayyub put his hand on the cloth and lowered it until his head appeared, then he said to someone who was pouring water for him, Pour water. So he poured water on his head. Then he rubbed his head with his hands, forwards and backwards, and said: ‘This is what I saw him (ﷺ) doing.’”",
      "usc_msa_ref": "",
      "chain": [
        "30100",
        "20001",
        "11163",
        "11150",
        "11181",
        "17",
        "2201",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-4132",
      "hadith_no": "4132",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا يونس بن عبد الأعلى المصري، أخبرني ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة بن الزبير، ‏.‏ أن المسور بن مخرمة، أخبره عن عمرو بن عوف، - وهو حليف بني عامر بن لؤى وكان شهد بدرا مع رسول الله  صلى الله عليه وسلم  - أن رسول الله  صلى الله عليه وسلم  بعث أبا عبيدة بن الجراح إلى البحرين يأتي بجزيتها وكان النبي  صلى الله عليه وسلم  هو صالح أهل البحرين وأمر عليهم العلاء بن الحضرمي فقدم أبو عبيدة بمال من البحرين فسمعت الأنصار بقدوم أبي عبيدة فوافوا صلاة الفجر مع رسول الله  صلى الله عليه وسلم  فلما صلى رسول الله  صلى الله عليه وسلم  انصرف فتعرضوا له فتبسم رسول الله  صلى الله عليه وسلم  حين رآهم ثم قال ‏\"‏ أظنكم سمعتم أن أبا عبيدة قدم بشىء من البحرين ‏\"‏ ‏.‏ قالوا أجل يا رسول الله ‏.‏ قال ‏\"‏ أبشروا وأملوا ما يسركم فوالله ما الفقر أخشى عليكم ولكني أخشى عليكم أن تبسط الدنيا عليكم كما بسطت على من كان قبلكم فتنافسوها كما تنافسوها فتهلككم كما أهلكتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Amr bin ‘Awf, who was an ally of Banu ‘AmirbinLu’ai and was present at (the battle of) Badr with theMessenger ofAllah (ﷺ), that the Messenger of Allah (ﷺ) sent‘Ubaidah binJarrah to Bahrain to collect the Jizyah, and theProphet (ﷺ) hadmade a treaty with the people of Bahrain, and heappointed as theirgovernor ‘Ala’ bin Hadrami. Abu ‘Ubaidancame with the wealth fromBahrain and the Ansar heard that Abu‘Ubaidah had come, so theyattended the Fajr prayer with theMessenger of Allah (ﷺ). When theMessenger of Allah (ﷺ) hadprayed, he went away, so they interceptedhim. The Messenger of Allah(ﷺ) smiled  when he saw them, then hesaid:                      ‘I think you haveheard that Abu ‘Ubaidah has brought somethingfrom Bahrain?’ Theysaid: ‘Yes, O Messenger of Allah.’ He said: ‘Be ofgood cheerand hope for that which will make you happy. By Allah, I donot fearpoverty for you, rather I fear that you will enjoy ease andplentylike those who came before you, and that you will compete withoneanother as they did, and you will be destroyed as they were.’”",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20475",
        "11013",
        "10511",
        "2201",
        "30154"
      ]
    }
  ],
  "total_hadiths": 70
}