{
  "id": "22024",
  "name": "Isma'il bin Rafa'i bin Awymr إسماعيل بن رافع بن عويمر",
  "full_name": "Isma'il bin Rafa'i bin Awymr إسماعيل بن رافع بن عويمر",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ بخ  ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni",
      "al-Basra"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Weak] [ بخ  ت  ق  -  ضعيف ]",
        "ar": "Narrator[Grade:Weak] [ بخ  ت  ق  -  ضعيف ]",
        "ckb": "Narrator[Grade:Weak] [ بخ  ت  ق  -  ضعيف ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      },
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "Ansar",
        "ar": "الأنصار",
        "ckb": "ئەنسار"
      },
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      },
      {
        "en": "al-Basra",
        "ar": "al-Basra",
        "ckb": "al-Basra"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11428",
      "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "12321",
      "name": "Abd al-Whab bin Bkht عبد الوهاب بن بخت",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20202",
      "name": "Makki bin Ibrahim bin Bashayr مكي بن إبراهيم بن بشير",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-1666",
      "hadith_no": "1666",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا علي بن حجر، حدثنا الوليد بن مسلم، عن إسماعيل بن رافع، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لقي الله بغير أثر من جهاد لقي الله وفيه ثلمة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث الوليد بن مسلم عن إسماعيل بن رافع ‏.‏ وإسماعيل بن رافع قد ضعفه بعض أصحاب الحديث ‏.‏ قال وسمعت محمدا يقول هو ثقة مقارب الحديث ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وحديث سلمان إسناده ليس بمتصل محمد بن المنكدر لم يدرك سلمان الفارسي ‏.‏ وقد روي هذا الحديث عن أيوب بن موسى عن مكحول عن شرحبيل بن السمط عن سلمان عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Whoever meets Allah without any traces from Jihad he meets Allah with a defect.[Abu 'Eisa said:] This Hadith is Gharib as a narration of Al-Walid bin Muslim from Isma'il bin Rafi'. Isma'il bin Rafi' was graded weak by some of the people of Hadith. I heard Muhammad saying: \"He is trustworthy, average (Muqarib) in Hadith.\"This Hadith has been reported from Abu Hurairah from the Prophet (ﷺ) through other than this route. Regarding the Hadith of Salman, its chain is not connected, Muhammad bin Al-Munkadir did not see Salman Al-Farisi.This Hadith has been reported from Ayyub bin Musa, from Makhul, from Shurahbil bin As-Simt from Salman, from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20733",
        "22024",
        "11428",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-2208",
      "hadith_no": "2208",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا إسماعيل بن رافع، عن خالد بن يزيد، عن عقبة بن عامر الجهني، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من نذر نذرا ولم يسمه فكفارته كفارة يمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amit Al-Juhani that the Messenger of Allah (ﷺ) said:                     \"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. \"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "22024",
        "11408",
        "189"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4215",
      "hadith_no": "4215",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الرحمن المحاربي، عن إسماعيل بن رافع أبي رافع، عن أبي زرعة السيباني، يحيى بن أبي عمرو عن أبي أمامة الباهلي، قال خطبنا رسول الله  صلى الله عليه وسلم  فكان أكثر خطبته حديثا حدثناه عن الدجال وحذرناه فكان من قوله أن قال ‏\"‏ إنه لم تكن فتنة في الأرض منذ ذرأ الله ذرية آدم أعظم من فتنة الدجال وإن الله لم يبعث نبيا إلا حذر أمته الدجال وأنا آخر الأنبياء وأنتم آخر الأمم وهو خارج فيكم لا محالة وإن يخرج وأنا بين ظهرانيكم فأنا حجيج لكل مسلم وإن يخرج من بعدي فكل امرئ حجيج نفسه والله خليفتي على كل مسلم وإنه يخرج من خلة بين الشام والعراق فيعيث يمينا ويعيث شمالا ‏.‏ يا عباد الله أيها الناس فاثبتوا فإني سأصفه لكم صفة لم يصفها إياه نبي قبلي إنه يبدأ فيقول أنا نبي ولا نبي بعدي ثم يثني فيقول أنا ربكم ‏.‏ ولا ترون ربكم حتى تموتوا وإنه أعور وإن ربكم ليس بأعور وإنه مكتوب بين عينيه كافر يقرؤه كل مؤمن كاتب أو غير كاتب وإن من فتنته أن معه جنة ونارا فناره جنة وجنته نار فمن ابتلي بناره فليستغث بالله وليقرأ فواتح الكهف فتكون عليه بردا وسلاما كما كانت النار على إبراهيم وإن من فتنته أن يقول لأعرابي أرأيت إن بعثت لك أباك وأمك أتشهد أني ربك فيقول نعم ‏.‏ فيتمثل له شيطانان في صورة أبيه وأمه فيقولان يا بنى اتبعه فإنه ربك ‏.‏ وإن من فتنته أن يسلط على نفس واحدة فيقتلها وينشرها بالمنشار حتى يلقى شقتين ثم يقول انظروا إلى عبدي هذا فإني أبعثه الآن ثم يزعم أن له ربا غيري ‏.‏ فيبعثه الله ويقول له الخبيث من ربك فيقول ربي الله وأنت عدو الله أنت الدجال والله ما كنت بعد أشد بصيرة بك مني اليوم ‏\"‏ ‏.‏ قال أبو الحسن الطنافسي فحدثنا المحاربي حدثنا عبيد الله بن الوليد الوصافي عن عطية عن أبي سعيد قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ذلك الرجل أرفع أمتي درجة في الجنة ‏\"‏ ‏.‏ قال قال أبو سعيد والله ما كنا نرى ذلك الرجل إلا عمر بن الخطاب حتى مضى لسبيله ‏.‏ قال المحاربي ثم رجعنا إلى حديث أبي رافع قال ‏\"‏ وإن من فتنته أن يأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت وإن من فتنته أن يمر بالحى فيكذبونه فلا تبقى لهم سائمة إلا هلكت وإن من فتنته أن يمر بالحى فيصدقونه فيأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت حتى تروح مواشيهم من يومهم ذلك أسمن ما كانت وأعظمه وأمده خواصر وأدره ضروعا وإنه لا يبقى شىء من الأرض إلا وطئه وظهر عليه إلا مكة والمدينة لا يأتيهما من نقب من نقابهما إلا لقيته الملائكة بالسيوف صلتة حتى ينزل عند الظريب الأحمر عند منقطع السبخة فترجف المدينة بأهلها ثلاث رجفات فلا يبقى منافق ولا منافقة إلا خرج إليه فتنفي الخبث منها كما ينفي الكير خبث الحديد ويدعى ذلك اليوم يوم الخلاص ‏\"‏ ‏.‏ فقالت أم شريك بنت أبي العكر يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم يومئذ قليل وجلهم ببيت المقدس وإمامهم رجل صالح فبينما إمامهم قد تقدم يصلي بهم الصبح إذ نزل عليهم عيسى ابن مريم الصبح فرجع ذلك الإمام ينكص يمشي القهقرى ليتقدم عيسى يصلي بالناس فيضع عيسى يده بين كتفيه ثم يقول له تقدم فصل فإنها لك أقيمت ‏.‏ فيصلي بهم إمامهم فإذا انصرف قال عيسى عليه السلام افتحوا الباب ‏.‏ فيفتح ووراءه الدجال معه سبعون ألف يهودي كلهم ذو سيف محلى وساج فإذا نظر إليه الدجال ذاب كما يذوب الملح في الماء وينطلق هاربا ويقول عيسى عليه السلام إن لي فيك ضربة لن تسبقني بها ‏.‏ فيدركه عند باب اللد الشرقي فيقتله فيهزم الله اليهود فلا يبقى شىء مما خلق الله يتوارى به يهودي إلا أنطق الله ذلك الشىء لا حجر ولا شجر ولا حائط ولا دابة - إلا الغرقدة فإنها من شجرهم لا تنطق - إلا قال يا عبد الله المسلم هذا يهودي فتعال اقتله ‏\"‏ ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ وإن أيامه أربعون سنة السنة كنصف السنة والسنة كالشهر والشهر كالجمعة وآخر أيامه كالشررة يصبح أحدكم على باب المدينة فلا يبلغ بابها الآخر حتى يمسي ‏\"‏ ‏.‏ فقيل له يا رسول الله كيف نصلي في تلك الأيام القصار قال ‏\"‏ تقدرون فيها الصلاة كما تقدرونها في هذه الأيام الطوال ثم صلوا ‏\"‏ ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فيكون عيسى ابن مريم عليه السلام في أمتي حكما عدلا وإماما مقسطا يدق الصليب ويذبح الخنزير ويضع الجزية ويترك الصدقة فلا يسعى على شاة ولا بعير وترفع الشحناء والتباغض وتنزع حمة كل ذات حمة حتى يدخل الوليد يده في في الحية فلا تضره وتفر الوليدة الأسد فلا يضرها ويكون الذئب في الغنم كأنه كلبها وتملأ الأرض من السلم كما يملأ الإناء من الماء وتكون الكلمة واحدة فلا يعبد إلا الله وتضع الحرب أوزارها وتسلب قريش ملكها وتكون الأرض كفاثور الفضة تنبت نباتها بعهد آدم حتى يجتمع النفر على القطف من العنب فيشبعهم ويجتمع النفر على الرمانة فتشبعهم ويكون الثور بكذا وكذا من المال وتكون الفرس بالدريهمات ‏\"‏ ‏.‏ قالوا يا رسول الله وما يرخص الفرس قال ‏\"‏ لا تركب لحرب أبدا ‏\"‏ ‏.‏ قيل له فما يغلي الثور قال ‏\"‏ تحرث الأرض كلها وإن قبل خروج الدجال ثلاث سنوات شداد يصيب الناس فيها جوع شديد يأمر الله السماء في السنة الأولى أن تحبس ثلث مطرها ويأمر الأرض فتحبس ثلث نباتها ثم يأمر السماء في السنة الثانية فتحبس ثلثى مطرها ويأمر الأرض فتحبس ثلثى نباتها ثم يأمر الله السماء في السنة الثالثة فتحبس مطرها كله فلا تقطر قطرة ويأمر الأرض فتحبس نباتها كله فلا تنبت خضراء فلا تبقى ذات ظلف إلا هلكت إلا ما شاء الله ‏\"‏ ‏.‏ قيل فما يعيش الناس في ذلك الزمان قال ‏\"‏ التهليل والتكبير والتسبيح والتحميد ويجرى ذلك عليهم مجرى الطعام ‏\"‏ ‏.‏ قال أبو عبد الله سمعت أبا الحسن الطنافسي يقول سمعت عبد الرحمن المحاربي يقول ينبغي أن يدفع هذا الحديث إلى المؤدب حتى يعلمه الصبيان في الكتاب ‏.‏",
      "text_en": " It was narrated that Abu Umamah Al-Bahili said:                      \"The Messengerof Allah (ﷺ) addressed us, and most of his speech had to do withtelling us about Dajjal. He warned about him, and among the things hesaid was: 'There will not be any tribulation on earth, since the timeAllah created the offspring of Adam, that will be greater than thetribulation of Dajjal. Allah has not sent any Prophet but he warnedhis nation about Dajjal. I am the last of the Prophets, and you arethe last of the nations. He will undoubtedly appear among you. If heappears while I am among you, I will contend with him on behalf ofevery Muslim, and if he appears while I am not among you, then eachman must fend for himself and Allah will take care of every Muslim onmy behalf. He will emerge from Al-Khallah, between Sham and Iraq, andwill wreak havoc right and left. O slaves of Allah, remain steadfast.I will describe him to you in a manner in which none of the Prophetshas described him before me. He will start by saying \"I am aProphet,\" and there is no Prophet after me. Then a second timehe will say: \"I am your Lord.\" But you will not see yourLord until you die. He is one-eyed, and your Lord is not one-eyed,and written between his eyes is Kafir. Every believer will read it,whether he is literate or illiterate. Part of his Fitnah will be thathe will have with him Paradise and Hell, but his Hell will be aParadise and his Paradise a Hell. Whoever is tested with his fire(hell), let him seek the help of Allah and recite the first Verses ofAl-Kahf, then it will be cool and safe for him, as the fire was forIbrahim. Part of his Fitnah will be that he will say to a Bedouin:\"What do you think, if I resurrect your father and mother foryou, will you bear witness that I am your Lord?\" He will say:\"Yes.\" Then two devils will appear to him in the form ofhis father and mother and will say: \"O my son, follow him, forhe is your Lord.\" And part of his Fitnah will be that he willoverpower a single soul and kill him, then he will cut him with a sawuntil he falls in two pieces. Then he will say: \"Look at thisslave of mine; I will resurrect him now, then he will claim that hehas a Lord other than me.\" Then Allah will resurrect him and theevil one will say to him: \"Who is your Lord?\" and he willsay: \"Allah is my Lord, and you are the enemy of Allah, you areDajjal. By Allah, I have never had more insight about you than I havetoday.\"(An addition) Abul-Hasan Tanafisi said: \"Muharibi told us: 'Ubaidullah bin al-Walid Al-Wassafi told us, from 'Atiyyah, that Abu Sa'eed said: \"The Messenger of Allah (ﷺ) said: 'That man will be the highest in status in my nation in Paradise'\" - He said: \"Abu Sa'eed said: 'By Allah, we did not think that man would be anyone other than 'Umar bin Khattab, until he passed away. -  Muharibi said: \"Then we went back to the narration of Abu Rafi'.\" He said: - 'Part of his Fitnah will be that he will command the sky to rain, and it will rain, and he will command the earth to bring forth vegetation and it will do so. And part of his Fitnah will be that he will pass by a clan and they will disbelieve in him, so all their flocks will perish and none will be left. And part of his Fitnah will be that he will pass by a clan who will believe in him, so he will command the sky to rain, and it will rain, and he will command the earth to bring forth vegetation and it will do so, until their flocks will come back in the evening of that day, bigger and fatter than they have ever been, with their flanks stretched and their udders full of milk. There will be no part of the earth left that he does not enter and prevail over, except for Makkah and Al-Madinah, for he will not approach them on any of their mountain paths but he will be met by angels with unsheathed swords, until he will stop at the red hill at the end of the marsh. Then Al-Madinah will be shaken with its people three times, and no hypocrite, male or female, will be left, all will come out to him. Thus it will be cleansed of impurity just as the bellows cleanses the iron of dross. And that day will be called the Day of Deliverance.'\"Umm Sharik bint Abi 'akar said: 'O Messenger of Allah, where will the Arabs be that day?' He said: 'On that day they will be few, and most of them will be in Baitul-Maqdis (Jerusalem), and their leader will be a righteous man. When their leader has stepped forward to lead them in subh prayer, 'Eisa bin Maryam will come down to them. Their leader will step backwards so that 'Eisa can come forward and lead the people in prayer, but 'Eisa will place his hand between his shoulders and say to him: \"Go forward and pray, for the Iqamah was given for you.\" Then their leader will lead them in prayer. When he has finished, 'Eisa (as), will say: \"Open the gate.\" So they will open it and behind it will be Dajjal with seventy thousand Jews, each of them carrying an adorned sword and wearing a greenish cloak. When Dajjal looks at him, he will start to melt as salt melts in water. He will run away, and 'Eisa (as), will say: \"I have only one blow for you, which you will not be able to escape!\" He will catch up with him at the eastern gate of Ludd, and will kill him. Then Allah will defeat the Jews, and there will be nothing left that Allah has created which the Jews will be able to hide behind, except that Allah will cause it to speak - no stone, no tree, no wall, no animal - except for Al-Gharqad (the box-thorn), for it is one of their trees, and will not speak - except that it will say: \"O Muslim slave of Allah, here is a Jews, come and kill him!\"\"The Messenger of Allah (ﷺ) said: 'His (Dajjal's) days will number forty years: a year like half a year, a year like a month, a month like a week, and the rest of his days will be like sparks from a fire (i.e., they will pass quickly). One of you will enter the gate of Al-Madinah in the morning and not reach its other gate until evening comes.' It was said: 'O Messenger of Allah, how should we pray on those short days?' He said: 'Estimate (the times of) the prayer, as you do on these long days, then pray.' The Messenger of Allah (ﷺ) said: \"Eisa bin Maryam (as), will be a just judge and a just ruler among my nation. He will break the cross, slaughter the pigs, abolish the Jizyah and charity will be left. No one will be appointed to (collect the Zakah of) sheep and camels. Grudges and mutual hatred will disappear and the venom of every venomous creature will be removed, so that a baby boy will but his hand in a snake and it will not harm him, and a baby girl will make a lion run away, and it will not harm her; and the wolf will be among the sheep like their sheepdog. The earth will be filled with peace just as a vessel is filled with water. The people will be united and none will be worshipped except Allah. War will cease and Quraish will no longer be in power. The earth will be like a silver platter, with its vegetation growing as it did at the time of Adam, until a group of people will gather around one bunch of grapes and it will suffice them, and a group will gather around a single pomegranate and it will suffice them. An ox will be sold for such and such amount of money, and a horse will be sold for a few Dirham.' They said: 'O Messenger of Allah, why will horses be so cheap?' He said: 'They will never be ridden in war again.' It was said to him: 'Why will oxen be so expensive?' He said: 'Because all the land will be tilled. Before Dajjal appears there will be three difficult years in which the people will suffer severe famine. In the first year, Allah will command the sky to withhold one third of its rain and the earth to withhold one third of its produce. In the second year, He will command the sky to withhold two thirds of its rain and the earth to withhold two-thirds of its produce. In the third year, he will command the sky to withhold all of its rain, and not a single drop will fall, and the earth to withhold all of its produce, and nothing will grow. All cloven-hoofed animals will die, except those that Allah wills.' It was said: 'What will the people live on at that time?' He said: 'Tahlil, Takbir, Tasbih and Tahmid. That will take the place of food for them.'\"Abu 'Abdullah (Ibn Majah) said: \"I heard Abul-Hasan Tanafisi say: 'I heard 'Abdur-Rahman Al-Muharibi say: \"This Hadith should be sent to every teacher so that they can teach it to the children in the schools.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20333",
        "22024",
        "4048"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 3,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}