{
  "id": "22025",
  "name": "Isma'il bin Muslima إسماعيل بن مسلمة بن قعنب الحارثي القعنب",
  "full_name": "Isma'il bin Muslima إسماعيل بن مسلمة بن قعنب الحارثي القعنب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "209",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "B.Haritha",
      "al-Madni",
      "Egypt"
    ]
  },
  "parents": [
    {
      "id": "24428",
      "name": "Muslimah bin Qa'nab al-Harithi مسلمة بن قعنب الحارثي البصري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "24428",
      "name": "Muslimah bin Qa'nab al-Harithi مسلمة بن قعنب الحارثي البصري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24241",
      "name": "'Abdullah bin Arad'h عبد الله بن عرادة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38132",
      "name": "Ja'far bin Msafr bin Rashid جعفر بن مسافر بن راشد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30583",
      "name": "al-Rabi' bin Sulaiman الربيع بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "39615",
      "name": "'Abdullah bin Ahmed bin Zakaria عبد الله بن أحمد بن زكريا",
      "grade": "3rd Century AH"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-256-2",
      "hadith_no": "256",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد بن حميد، حدثنا أبو نعيم، حدثنا إسماعيل بن مسلم، حدثنا أبو المتوكل، أن ابن عباس، حدثه أنه، بات عند النبي صلى الله عليه وسلم ذات ليلة فقام نبي الله صلى الله عليه وسلم من آخر الليل فخرج فنظر في السماء ثم تلا هذه الآية في آل عمران ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار‏}‏ حتى بلغ ‏{‏ فقنا عذاب النار‏}‏ ثم رجع إلى البيت فتسوك وتوضأ ثم قام فصلى ثم اضطجع ثم قام فخرج فنظر إلى السماء فتلا هذه الآية ثم رجع فتسوك فتوضأ ثم قام فصلى ‏.‏",
      "text_en": " Ibn 'Abbas reported that he spent a night at the house of the Apostle of Allah (may peace be upon him), The Apostle of Allah (way peace be upon him) got up for prayer in the latter part of the night. He went out and looked towards the sky and then recited this verse (190th) of AI-i-'Imran:                     \" Verily in the creation of the heavens and the earth and the alternation of night and day.\" up to the (words)\" save us from the torment of Hell.\" He then returned to his house, used the tooth-stick, performed the ablution, and then got up and offered the prayer. He than lay down on the bed. and again got up and went out and looked towards the sky and recited this verse (mentioned above), then returned, used the tooth-stick, performed ablution and again offered the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20348",
        "22025",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5268",
      "hadith_no": "5268",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنيه أبو بكر بن إسحاق، حدثنا روح بن عبادة، حدثنا إسماعيل بن مسلم، العبدي بهذا الإسناد قال نهانا رسول الله صلى الله عليه وسلم أن نخلط بسرا بتمر أو زبيبا بتمر أو زبيبا ببسر ‏.‏ وقال ‏\"‏ من شربه منكم ‏\"‏ ‏.‏ فذكر بمثل حديث وكيع ‏.‏",
      "text_en": " Isma'il b. Muslim al-'Abadi reported on the authority of the same chain of transmitters:                      Allah's Messenger (may peace be upon him) prohibited us that we should mix dry dates with unripe dates or (mix) grapes with dry dates (and prepare Nabidh). He also said: He who amongst you drinks-the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "20229",
        "22025"
      ]
    },
    {
      "id": "jami-al-tirmidhi-233",
      "hadith_no": "233",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، محمد بن بشار حدثنا محمد بن أبي عدي، قال أنبأنا إسماعيل بن مسلم، عن الحسن، عن سمرة بن جندب، قال أمرنا رسول الله صلى الله عليه وسلم إذا كنا ثلاثة أن يتقدمنا أحدنا ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود وجابر وأنس بن مالك ‏.‏ قال أبو عيسى وحديث سمرة حديث حسن غريب ‏.‏ والعمل على هذا عند أهل العلم قالوا إذا كانوا ثلاثة قام رجلان خلف الإمام ‏.‏ وروي عن ابن مسعود أنه صلى بعلقمة والأسود فأقام أحدهما عن يمينه والآخر عن يساره ورواه عن النبي صلى الله عليه وسلم ‏.‏ وقد تكلم بعض الناس في إسماعيل بن مسلم المكي من قبل حفظه ‏.‏",
      "text_en": " Samurah bin Jundub narrated:                     \"Allah's Messenger ordered us that when we were three, then one of us should stand forward.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "22025",
        "11016",
        "394"
      ]
    },
    {
      "id": "jami-al-tirmidhi-879",
      "hadith_no": "879",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عبد الله بن الأجلح، عن إسماعيل بن مسلم، عن عطاء، عن ابن عباس، قال صلى بنا رسول الله صلى الله عليه وسلم بمنى الظهر والعصر والمغرب والعشاء والفجر ثم غدا إلى عرفات ‏.‏ قال أبو عيسى وإسماعيل بن مسلم قد تكلموا فيه من قبل حفظه ‏.‏",
      "text_en": " Ata reported that Ibn Abbas narrated:                     \"The Messenger of Allah led us in Salat at Mina for Zuhr, Asr, Maghrib, Isha, and Fajr, then he left in the morning to Arafat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "25138",
        "22025",
        "11029",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1401",
      "hadith_no": "1401",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن إسماعيل بن مسلم، عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقام الحدود في المساجد ولا يقتل الوالد بالولد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه بهذا الإسناد مرفوعا إلا من حديث إسماعيل بن مسلم ‏.‏ وإسماعيل بن مسلم المكي قد تكلم فيه بعض أهل العلم من قبل حفظه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Prophet (ﷺ) said: 'The Hudud are not carried in the Masjid, and the father is not killed for the son.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "22025",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1460",
      "hadith_no": "1460",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن إسماعيل بن مسلم، عن الحسن، عن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حد الساحر ضربة بالسيف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ وإسماعيل بن مسلم المكي يضعف في الحديث وإسماعيل بن مسلم العبدي البصري قال وكيع هو ثقة ‏.‏ ويروى عن الحسن أيضا والصحيح عن جندب موقوف ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول مالك بن أنس ‏.‏ وقال الشافعي إنما يقتل الساحر إذا كان يعمل في سحره ما يبلغ به الكفر فإذا عمل عملا دون الكفر فلم نر عليه قتلا ‏.‏",
      "text_en": " Narrated Jundab:                     That he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20354",
        "22025",
        "11016",
        "4053"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1489",
      "hadith_no": "1489",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي، حدثنا أبي، عن الأعمش، عن إسماعيل بن مسلم، عن الحسن، عن عبد الله بن مغفل، قال إني لممن يرفع أغصان الشجرة عن وجه رسول الله صلى الله عليه وسلم وهو يخطب فقال ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها فاقتلوا منها كل أسود بهيم وما من أهل بيت يرتبطون كلبا إلا نقص من عملهم كل يوم قيراط إلا كلب صيد أو كلب حرث أو كلب غنم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وقد روي هذا الحديث من غير وجه عن الحسن عن عبد الله بن مغفل عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mughaffal:                     \"I was one of those who held up the branches from the tree away from the face of the Messenger of Allah (ﷺ) while he was delivering the Khutbah saying: 'If it were not that dogs were a nation among nations, then I would order that they be killed. So kill every one among them that is all black. There is one inhabiting a home in which they keep a dog but their deeds are decreased by one Qirat every day - except for a hunting dog, or a farm dog, or a sheep dog.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11060",
        "22025",
        "11016",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1522",
      "hadith_no": "1522",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن إسماعيل بن مسلم، عن الحسن، عن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الغلام مرتهن بعقيقته يذبح عنه يوم السابع ويسمى ويحلق رأسه ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     That the Messenger of Allah (ﷺ) said: \"The boy is mortgaged by his 'Aqiqah; slaughtering should be done for him on the seventh day, he should be given a name, and his head should be shaved.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "22025",
        "11016",
        "394"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1792",
      "hadith_no": "1792",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن إسماعيل بن مسلم، عن عبد الكريم بن أبي المخارق أبي أمية، عن حبان بن جزء، عن أخيه، خزيمة بن جزء قال سألت رسول الله صلى الله عليه وسلم عن أكل الضبع فقال ‏\"‏ أويأكل الضبع أحد ‏\"‏ ‏.‏ وسألته عن أكل الذئب فقال ‏\"‏ أويأكل الذئب أحد فيه خير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بالقوي لا نعرفه إلا من حديث إسماعيل بن مسلم عن عبد الكريم أبي أمية ‏.‏ وقد تكلم بعض أهل الحديث في إسماعيل وعبد الكريم أبي أمية وهو عبد الكريم بن قيس بن أبي المخارق وعبد الكريم بن مالك الجزري ثقة ‏.‏",
      "text_en": " Narrated Khuzaimah bin Jaz':                     \"I asked the Messenger of Allah (ﷺ) about eating badger. He said: 'Does anyone eat badger?' So I asked him about eating wolf' He said: 'Does anyone who has any good in him eat wolf?'\"[Abu 'Eisa said:] The chain for this Hadith is not strong. We do not know of it except as a narration of Isma'il bin Muslim from 'Abdul-Karim Abi Umayyah. Some of the people of Hadith have criticized Isma'il and 'Abdul Karim Abi Umayyah. And he is 'Abdul-Karim bin Qais, who is Ibn Abi Al-Mukhariq. While 'Abdul-Karim bin Malik Al-Jazari is trustworthy.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "22025",
        "10648",
        "4131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2614",
      "hadith_no": "2614",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا ابن المبارك، أخبرنا إسماعيل بن مسلم، عن الحسن، وقتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يجاء بابن آدم يوم القيامة كأنه بذج فيوقف بين يدى الله فيقول الله له أعطيتك وخولتك وأنعمت عليك فماذا صنعت ‏.‏ فيقول يا رب جمعته وثمرته فتركته أكثر ما كان فارجعني آتك به ‏.‏ فيقول له أرني ما قدمت ‏.‏ فيقول يا رب جمعته وثمرته فتركته أكثر ما كان فارجعني آتك به ‏.‏ فإذا عبد لم يقدم خيرا فيمضى به إلى النار ‏\"‏ ‏.‏ قال أبو عيسى وقد روى هذا الحديث غير واحد عن الحسن قوله ولم يسندوه ‏.‏ وإسماعيل بن مسلم يضعف في الحديث من قبل حفظه ‏.‏ وفي الباب عن أبي هريرة وأبي سعيد الخدري ‏.‏",
      "text_en": " Anas narrated that the Prophet (s.a.w)said:                     \"The son of Adam will be brought on the Day of Judgement as if he is a goat kid to be stood before Allah, Most High. Allah will say to him: 'I gave to you, I granted you, and I bestowed favors upon you. So what did you do?' So he says: 'I collected it, increased it, and left it as more than what it was. So return me and I shall give it all to You.' So He will say to him: 'Show me what you have prepared.'So he says: 'My Lord! I collected it, increased it and left it more than it was, So return me and I shall give it all to You.' So when the servant does not present any good he will be entered into the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "22025",
        "11016",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-2728",
      "hadith_no": "2728",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو داود، قال حدثنا مسلم بن إبراهيم، قال حدثنا إسماعيل بن مسلم، قال حدثنا محمد بن واسع، عن مطرف بن عبد الله، قال قال لي عمران بن حصين تمتعنا مع رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن إسماعيل بن مسلم ثلاثة هذا أحدهم لا بأس به وإسماعيل بن مسلم شيخ يروي عن أبي الطفيل لا بأس به وإسماعيل بن مسلم يروي عن الزهري والحسن متروك الحديث ‏.‏",
      "text_en": " It was narrated that Mutarrif bin 'Abdullah said:                     \"Imran bnin Husain said to me: 'We performed Tamattu' with the Messenger of",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20285",
        "22025",
        "11305"
      ]
    },
    {
      "id": "sunan-an-nasai-2739",
      "hadith_no": "2739",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا عثمان بن عمر، قال حدثنا إسماعيل بن مسلم، عن محمد بن واسع، عن مطرف، قال قال لي عمران بن حصين إن رسول الله صلى الله عليه وسلم قد تمتع وتمتعنا معه قال فيها قائل برأيه ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"Imran bin Husain said to me; 'The Messenger of Allah performed 'Umrah and Hajj together, and we performed 'Umrah and Hajj together with him, and whoever says anything different, that is his own personal opinion.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20262",
        "22025",
        "11395",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-5569",
      "hadith_no": "5569",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن خالد، قال حدثنا شعيب بن حرب، قال حدثنا إسماعيل بن مسلم، قال حدثنا أبو المتوكل الناجي، قال حدثني أبو سعيد الخدري، أن النبي صلى الله عليه وسلم نهى أن يخلط بسرا بتمر أو زبيبا بتمر أو زبيبا ببسر وقال ‏\"‏ من شرب منكم فليشرب كل واحد منه فردا ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا أبو المتوكل اسمه علي بن داود ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Prophet [SAW] forbade mixing Al-Busr with dried dates, or raisins with dried dates, or raisins with Al-Busr, and he said: \"Whoever among you (wants to) drink them, let him drink each one on its own.\"",
      "usc_msa_ref": "",
      "chain": [
        "20194",
        "22025",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-5571",
      "hadith_no": "5571",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، - يعني ابن عمران - عن إسماعيل بن مسلم، عن أبي المتوكل، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم نهى أن ينبذ التمر والزبيب والتمر والبسر وقال ‏\"‏ انتبذوا الزبيب فردا والتمر فردا والبسر فردا ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو كثير اسمه يزيد بن عبد الرحمن ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Prophet [SAW] forbade soaking dried dates and raisins, and dried dates and Al-Busr, and he said: \"Soak raisins on their own, and dried dates on their own, and Al-Busr on their own.\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "22025",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-320",
      "hadith_no": "320",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هارون بن إسحاق، حدثنا عبد الرحمن المحاربي، عن إسماعيل بن مسلم، عن الحسن، وقتادة، عن أنس بن مالك، قال كان النبي  صلى الله عليه وسلم  إذا خرج من الخلاء قال ‏\"‏ الحمد لله الذي أذهب عني الأذى وعافاني ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"Whenever the Prophet exited the toilet, he would say: 'Al-hamdu lillahilladhi adhhaba 'annial-adha wa 'afani (Praise is to Allah Who has relieved me of impurity and given me good health).'\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20333",
        "22025",
        "11016",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-1169",
      "hadith_no": "1169",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحمن المحاربي، عن إسماعيل بن مسلم، عن الحسن، عن جابر بن عبد الله، أن رجلا، دخل المسجد يوم الجمعة ورسول الله  صلى الله عليه وسلم  يخطب فجعل يتخطى الناس فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ اجلس فقد آذيت وآنيت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that a man entered themosque oneFriday when the Messenger of Allah (ﷺ) was delivering thesermon.He started stepping over the people’s shoulders, and theMessengerof Allah (ﷺ) said:                      ‘Sit down, for you have annoyed(people) andyou are late.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20333",
        "22025",
        "11016",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1348",
      "hadith_no": "1348",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو بحر، حدثنا إسماعيل بن مسلم، حدثنا أبو الزبير، عن جابر، قال خرج رسول الله  صلى الله عليه وسلم  يوم فطر أو أضحى فخطب قائما ثم قعد قعدة ثم قام ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ) wentout onthe Day of Al-Fitr or Al-Adha, and delivered a sermon standingup.Then he sat down briefly, then stood up again.”",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "22025",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2697",
      "hadith_no": "2697",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، ح وحدثنا الحسن بن عرفة، حدثنا أبو حفص الأبار، جميعا عن إسماعيل بن مسلم، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقام الحدود في المساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Messenger of Allah (ﷺ) said:                     “Do not carry out the legal punishment in the mosque.”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20345",
        "36540",
        "25208",
        "22025",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2763",
      "hadith_no": "2763",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن إسماعيل بن مسلم، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقتل بالولد الوالد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:                     “A father should not be killed for his son.”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20345",
        "22025",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3182",
      "hadith_no": "3182",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، وهناد بن السري، قالا حدثنا أبو معاوية، عن إسماعيل بن مسلم، عن عطاء، عن ابن عباس، قال لم يرخص النبي  صلى الله عليه وسلم  لأحد يبيت بمكة إلا للعباس من أجل السقاية ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Prophet (ﷺ) did notallowanyone to stay overnight in Makkah apart from ‘Abbas, for thepurpose of supplying water to the pilgrims.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "30480",
        "20354",
        "22025",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3625",
      "hadith_no": "3625",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن إسماعيل بن مسلم، عن محمد بن المنكدر، عن جابر، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ عليكم بالإثمد عند النوم فإنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “I heard the Messenger of Allah(ﷺ)say: ‘You should use antimony when you go to sleep, for itimprovesthe eyesight and makes the hair (eyelashes) grow.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "22025",
        "11048",
        "34"
      ]
    }
  ],
  "total_hadiths": 21
}