{
  "id": "22038",
  "name": "al-Husain bin Bashyr bin Salam الحسين بن بشير بن سلام",
  "full_name": "al-Husain bin Bashyr bin Salam الحسين بن بشير بن سلام",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ س  -  مقبول ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "529",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثنا خارجة بن عبد الله بن سليمان بن زيد بن ثابت، قال حدثني الحسين بن بشير بن سلام، عن أبيه، قال دخلت أنا ومحمد بن علي، على جابر بن عبد الله الأنصاري فقلنا له أخبرنا عن صلاة، رسول الله صلى الله عليه وسلم وذاك زمن الحجاج بن يوسف ‏.‏ قال خرج رسول الله صلى الله عليه وسلم فصلى الظهر حين زالت الشمس وكان الفىء قدر الشراك ثم صلى العصر حين كان الفىء قدر الشراك وظل الرجل ثم صلى المغرب حين غابت الشمس ثم صلى العشاء حين غاب الشفق ثم صلى الفجر حين طلع الفجر ثم صلى من الغد الظهر حين كان الظل طول الرجل ثم صلى العصر حين كان ظل الرجل مثليه قدر ما يسير الراكب سير العنق إلى ذي الحليفة ثم صلى المغرب حين غابت الشمس ثم صلى العشاء إلى ثلث الليل أو نصف الليل - شك زيد - ثم صلى الفجر فأسفر ‏.‏",
      "text_en": " Al-Husain bin Bashir bin Sallam narrated that his father said:                      \"Muhammad bin 'Ali and I entered upon Jabir bin 'Abdullah Al-Ansari. We said to him: 'Tell us about the prayer of the Messenger of Allah (ﷺ).' That was at the time of Al-Hajjaj bin Yusuf. He said: 'The Messenger of Allah (ﷺ) came out and prayed Zuhr when the sun had passed its zenith and the shadow (of a thing) was the length of a sandal-strap. Then he prayed 'Asr when the shadow of a man was the length of a sandal-strap plus his height. Then he prayed Maghrib when the sun had set. Then he prayed 'Isha' when the twilight disappeared. Then he prayed Fajr when dawn broke. The next day he prayed Zuhr when a man's shadow was equal to his height. Then he prayed 'Asr when a man's shadow was twice his height, and (the time between the prayer and sunset) lasted as long as it takes a swift rider to reach Dhul-Hulaifah. Then he prayed Maghrib when the sun set, then he prayed 'Isha' when one-third or one-half of the night had passed'\" - (One of the narrators) Zaid, was not sure - \"then he prayed Fajr when it had become bright.\"",
      "chain": [
        "38022",
        "20650",
        "22047",
        "22038"
      ]
    }
  ],
  "total_hadiths": 1
}