{
  "id": "22061",
  "name": "Zayd bin Jubayra bin Mahmud زيد بن جبيرة",
  "full_name": "Zayd bin Jubayra bin Mahmud زيد بن جبيرة",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ ت  ق  -  متروك ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11160",
      "name": "Da'ud bin al-Husain al-Amwy داود بن الحصين الأموي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "27517",
      "name": "Suwayd bin 'Abdul 'Aziz سويد بن عبد العزيز بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20456",
      "name": "Muhammad bin Humayr bin Anis محمد بن حمير بن أنيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1547",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، قال حدثني زيد بن جبير، أنه أتى عبد الله بن عمر  رضى الله عنهما  في منزله وله فسطاط وسرادق، فسألته من أين يجوز أن أعتمر قال فرضها رسول الله صلى الله عليه وسلم لأهل نجد قرنا، ولأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة‏.‏",
      "text_en": " Narrated Zaid bin Jubair:                     I went to visit `Abdullah bin `Umar at his house which contained many tents made of cotton cloth and these were encircled with Suradik (part of the tent). I asked him from where, should one assume Ihram for Umra. He said, \"Allah's Apostle had fixed as Miqat (singular of Mawaqit) Qarn for the people of Najd, Dhul-Hulaifa for the people of Medina, and Al-Juhfa for the people of Sham.\"",
      "chain": [
        "20357",
        "20321",
        "22061"
      ]
    },
    {
      "hadith_no": "1858",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن زيد بن جبير، قال سمعت ابن عمر  رضى الله عنهما  يقول حدثتني إحدى، نسوة النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم ‏\"‏ يقتل المحرم ‏\"‏‏.‏",
      "text_en": " One of the wives of the Prophet narrated:                     The Prophet said, \"A Muhrim can kill (five kinds of animals.)\"",
      "chain": [
        "30175",
        "20469",
        "22061",
        "18"
      ]
    },
    {
      "hadith_no": "2927",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا زيد بن جبير، أن رجلا، سأل ابن عمر ما يقتل المحرم من الدواب فقال أخبرتني إحدى نسوة رسول الله صلى الله عليه وسلم أنه أمر - أو أمر - أن تقتل الفارة والعقرب والحدأة والكلب العقور والغراب ‏.‏",
      "text_en": " Zaid b. Jubair reported:                      A person asked Ibn Umar which beast a Muhrim could kill. Thereupon he said: One of the wives of Allah's Apostle (may peace be upon him) told me: He (the Holy Prophet) commanded to kill rat, scorpion, kite, voracious dog and crow.",
      "chain": [
        "30184",
        "20321",
        "22061"
      ]
    },
    {
      "hadith_no": "2928",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو عوانة، عن زيد بن جبير، قال سأل رجل ابن عمر ما يقتل الرجل من الدواب وهو محرم قال حدثتني إحدى نسوة النبي صلى الله عليه وسلم أنه كان يأمر بقتل الكلب العقور والفارة والعقرب والحديا والغراب والحية ‏.‏ قال وفي الصلاة أيضا ‏.‏",
      "text_en": " Zaid b. Jubair reported:                      A person asked Ibn 'Umar which beast a Mubrim could kill, whereupon he said: One of the wives of Allab's Apostle (may peace be upon him) told me: He (the Holy Prophet) commanded to kill voracious dcg, rat, scorpion, kite, crow, and snake (and this is allowed) likewise in prayer.",
      "chain": [
        "20656",
        "20469",
        "22061"
      ]
    },
    {
      "hadith_no": "4545",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الحجاج، عن زيد بن جبير، عن خشف بن مالك الطائي، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في دية الخطإ عشرون حقة وعشرون جذعة وعشرون بنت مخاض وعشرون بنت لبون وعشرون بني مخاض ذكر ‏\"‏ ‏.‏ وهو قول عبد الله ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: The blood-wit for accidental killing should be twenty she-camels which had entered their fourth year, twenty she-camels which had entered their fifth year, twenty she-camels which had entered their second year, twenty she-camels which had entered their third year, and twenty male camels which had entered their second year. It does not beyond Ibn Mas'ud.",
      "chain": [
        "30175",
        "20256",
        "20381",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "346",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا المقرئ، حدثنا يحيى بن أيوب، عن زيد بن جبيرة، عن داود بن الحصين، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى أن يصلى في سبعة مواطن في المزبلة والمجزرة والمقبرة وقارعة الطريق وفي الحمام وفي معاطن الإبل وفوق ظهر بيت الله ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet prohibited Salat from being performed in seven places: the dung heap, the slaughtering area, the graveyard, the commonly used road, the wash area, in the area that camels rest at, and above the House of Allah (the Ka'bah).\"",
      "chain": [
        "30277",
        "20379",
        "22061",
        "11160",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا سويد بن عبد العزيز، عن زيد بن جبيرة، عن داود بن حصين، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال وفي الباب عن أبي مرثد وجابر وأنس ‏.‏ أبو مرثد اسمه كناز بن حصين ‏.‏ قال أبو عيسى وحديث ابن عمر إسناده ليس بذاك القوي ‏.‏ وقد تكلم في زيد بن جبيرة من قبل حفظه ‏.‏ قال أبو عيسى وزيد بن جبير الكوفي أثبت من هذا وأقدم وقد سمع من ابن عمر ‏.‏ وقد روى الليث بن سعد هذا الحديث عن عبد الله بن عمر العمري عن نافع عن ابن عمر عن عمر عن النبي صلى الله عليه وسلم مثله ‏.‏ وحديث داود عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم أشبه وأصح من حديث الليث بن سعد ‏.‏ وعبد الله بن عمر العمري ضعفه بعض أهل الحديث من قبل حفظه منهم يحيى بن سعيد القطان ‏.‏",
      "text_en": " Ibn Umar narrated:                     (Another chain with a similar narration)",
      "chain": [
        "20387",
        "27517",
        "22061",
        "11160",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، أخبرنا ابن أبي زائدة، عن الحجاج، عن زيد بن جبير، عن خشف بن مالك، قال سمعت ابن مسعود، قال قضى رسول الله صلى الله عليه وسلم في دية الخطإ عشرين بنت مخاض وعشرين بني مخاض ذكورا وعشرين بنت لبون وعشرين جذعة وعشرين حقة ‏.‏ قال وفي الباب عن عبد الله بن عمرو ‏.‏  حدثنا أبو هشام الرفاعي، أخبرنا ابن أبي زائدة، وأبو خالد الأحمر عن الحجاج بن أرطاة، نحوه ‏.‏ قال أبو عيسى حديث ابن مسعود لا نعرفه مرفوعا إلا من هذا الوجه وقد روي عن عبد الله موقوفا ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وهو قول أحمد وإسحاق ‏.‏ وقد أجمع أهل العلم على أن الدية تؤخذ في ثلاث سنين في كل سنة ثلث الدية ورأوا أن دية الخطإ على العاقلة ‏.‏ ورأى بعضهم أن العاقلة قرابة الرجل من قبل أبيه ‏.‏ وهو قول مالك والشافعي ‏.‏ وقال بعضهم إنما الدية على الرجال دون النساء والصبيان من العصبة يحمل كل رجل منهم ربع دينار ‏.‏ وقد قال بعضهم إلى نصف دينار فإن تمت الدية وإلا نظر إلى أقرب القبائل منهم فألزموا ذلك ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"The Messenger of Allah (ﷺ) judged for the accidental blood-Money: Twenty Bint Makhad, twenty make Ibn Makhad, twenty Bint Labunm twenty Jadha'ah, and twenty Hiqqah.(Another chain) with similar meaning.",
      "chain": [
        "38401",
        "20366",
        "20381",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "4802",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا علي بن سعيد بن مسروق، قال حدثنا يحيى بن زكريا بن أبي زائدة، عن حجاج، عن زيد بن جبير، عن خشف بن مالك، قال سمعت ابن مسعود، يقول قضى رسول الله صلى الله عليه وسلم دية الخطإ عشرين بنت مخاض وعشرين ابن مخاض ذكورا وعشرين بنت لبون وعشرين جذعة وعشرين حقة ‏.‏",
      "text_en": " In Mas'ud said:                     \"The Messenger of Allah ruled that the Diyah for accidental killing is twenty Bint Makhad, twenty Bin Makhad, twenty Bint Labur, twenty Jadh'ah, and twenty Hiqqah.\"",
      "chain": [
        "35093",
        "20366",
        "20219",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "5696",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن أبي عوانة، عن زيد بن جبير، عن ابن عمر، أن رجلا، سأل عن الأشربة، فقال اجتنب كل شىء ينش ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     A man asked about drinks and he said: \"Avoid everything that intoxicates.\"",
      "chain": [
        "38265",
        "20025",
        "20469",
        "22061",
        "18"
      ]
    },
    {
      "hadith_no": "5697",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا قتيبة، قال أنبأنا أبو عوانة، عن زيد بن جبير، قال سألت ابن عمر عن الأشربة، فقال اجتنب كل شىء ينش ‏.‏",
      "text_en": " It was narrated that Zaid bin Jubair said:                     \"I asked Ibn 'Umar about drinks and he said: 'Avoid everything that intoxicates.'\"",
      "chain": [
        "30367",
        "20469",
        "22061",
        "18"
      ]
    },
    {
      "hadith_no": "676",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن سفيان، عن زيد بن جبير، عن خشف بن مالك، عن أبيه، عن عبد الله بن مسعود، قال شكونا إلى النبي  صلى الله عليه وسلم  حر الرمضاء فلم يشكنا ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"We complained to the Messenger of Allah about the heat of the sunbaked ground, but he did not respond to our complaint.\"",
      "chain": [
        "30216",
        "20609",
        "20012",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "746",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن إبراهيم الدمشقي، حدثنا عبد الله بن يزيد، عن يحيى بن أيوب، عن زيد بن جبيرة، عن داود بن الحصين، عن نافع، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  أن يصلى في سبع مواطن في المزبلة والمجزرة والمقبرة وقارعة الطريق والحمام ومعاطن الإبل وفوق الكعبة ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Allah's Messenger prohibited prayer from being performed in seven places: The garbage dump, the slaughtering area, the graveyard, the commonly used road, the bathroom, in the area that camels rest at, and above the Ka'bah.\"",
      "chain": [
        "11213",
        "1945",
        "20379",
        "22061",
        "11160",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "748",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا محمد بن حمير، حدثنا زيد بن جبيرة الأنصاري، عن داود بن الحصين، عن نافع، عن ابن عمر، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ خصال لا تنبغي في المسجد لا يتخذ طريقا ولا يشهر فيه سلاح ولا ينبض فيه بقوس ولا ينشر فيه نبل ولا يمر فيه بلحم نيء ولا يضرب فيه حد ولا يقتص فيه من أحد ولا يتخذ سوقا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah said: \"There are things which are not befitting for the mosque: it should not be taken as a thoroughfare; weapons should not be unsheathed in it; bows should not be drawn nor arrows shot in it; no one should pass through it carrying raw meat; no prescribed punishment or retaliatory punishment should be carried out in it; and it should not be used as a marketplace.\"",
      "chain": [
        "38705",
        "20456",
        "22061",
        "11160",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1756",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن إسرائيل، عن زيد بن جبير، عن أبي يزيد الضني، عن ميمونة، مولاة النبي  صلى الله عليه وسلم  قالت سئل النبي  صلى الله عليه وسلم  عن رجل قبل امرأته وهما صائمان قال ‏\"‏ قد أفطرا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Maimunah the freed (female) slave of theMessenger ofAllah (ﷺ), said:                      “The Prophet (ﷺ) was asked about aman whokissed his wife when they were both fasting. He said: ‘Theyhavebroken their fast.’”",
      "chain": [
        "30201",
        "20348",
        "20311",
        "22061"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، حدثنا إسرائيل، عن زيد بن جبير، عن أبي يزيد الضني، عن ميمونة بنت سعد، - مولاة النبي صلى الله عليه وسلم - أن رسول الله صلى الله عليه وسلم سئل عن ولد الزنا فقال ‏\"‏ نعلان أجاهد فيهما خير من أن أعتق ولد الزنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Maimunah bint Sa`d, the freed slave woman of the Prophet (ﷺ) that :                     the Messenger of Allah (ﷺ) was asked about illegitimate children. He said: “Two sandals in which I wage Jihad are better than freeing an illegitimate child.”",
      "chain": [
        "30201",
        "20348",
        "20311",
        "22061"
      ]
    },
    {
      "hadith_no": "2733",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد السلام بن عاصم، حدثنا الصباح بن محارب، حدثنا حجاج بن أرطاة، حدثنا زيد بن جبير، عن خشف بن مالك الطائي، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في دية الخطإ عشرون حقة وعشرون جذعة وعشرون بنت مخاض وعشرون بنت لبون وعشرون بني مخاض ذكور ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Masud that the Messenger of Allah (ﷺ) said:                     “The blood money of one who killed by mistake is twenty Hiqqah (three-year-old she camels), twenty Jadha'ah (four year old she camels), twenty Bint Makhad (one year old she camel), twenty Bint Labun (two year old she camels), and twenty Bani Makhad (one year old she camels).”",
      "chain": [
        "20580",
        "22061",
        "19907",
        "16"
      ]
    }
  ],
  "total_hadiths": 17
}