{
  "id": "22074",
  "name": "Salah bin Hasaan al-Nadri صالح بن حسان النضري",
  "full_name": "Salah bin Hasaan al-Nadri صالح بن حسان النضري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ ت  ق  -  متروك ]"
    ],
    "tags": [
      "al-Nadri",
      "al-Madni",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25107",
      "name": "Sa'id bin Muhammad al-Wraq سعيد بن محمد الوراق الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20332",
      "name": "'Abdul Hameed bin 'Abdur Rahman al-Haman عبد الحميد بن عبد الرحمن أبو يحيى الحمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20668",
      "name": "'Umar bin Sa'd bin 'Ubaid عمر بن سعد بن عبيد أبو داود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1780",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن محمد الوراق، وأبو يحيى الحماني قالا حدثنا صالح بن حسان، عن عروة، عن عائشة، قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أردت اللحوق بي فليكفيك من الدنيا كزاد الراكب وإياك ومجالسة الأغنياء ولا تستخلقي ثوبا حتى ترقعيه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث صالح بن حسان ‏.‏ قال وسمعت محمدا يقول صالح بن حسان منكر الحديث وصالح بن أبي حسان الذي روى عنه ابن أبي ذئب ثقة ‏.‏ قال أبو عيسى ومعنى قوله ‏\"‏ وإياك ومجالسة الأغنياء ‏\"‏ ‏.‏ هو نحو ما روي عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من رأى من فضل عليه في الخلق والرزق فلينظر إلى من هو أسفل منه ممن فضل هو عليه فإنه أجدر أن لا يزدري نعمة الله عليه ‏\"‏ ‏.‏ ويروى عن عون بن عبد الله بن عتبة قال صحبت الأغنياء فلم أر أحدا أكثر هما مني أرى دابة خيرا من دابتي وثوبا خيرا من ثوبي وصحبت الفقراء فاسترحت ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The Messenger of Allah (ﷺ) said to me: 'If you want to stick with me, then suffice yourself in the world with the provisions of the rider. And beware of gatherings of the rich, and do not consider a garment to be worn out until it has been patched.'\" [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except as a narration of Salih bin Hassan. He said: I heard Muhammad bin Isma'il saying: \"Salih bin Hassan is Munkar is Hadith.\" And Salih bin Hassan - the one who Ibn Abi Dhi'b reports from - is trustworthy.[Abu 'Eisa said:] The meaning of this saying: \"And beware of gathering of the rich\" is similar to what was related from Abu Hurairah from the Prophet (ﷺ), that he said: \"Whoever sees one that has been more favored than him in appearance and provision, then let him look at the one who is less than him, rather than one who is favored more than him. For indeed it is more appropriate so that he not scorn Allah's favors [upon him].\"And it has been related from 'Awn bin 'Abdullah who said: \"I accompanied the rich, and did not see anyone with more troubles than me. I saw a beast that was better than my beast, and a garment that was better than my garment. And I accompanied the poor, and felt at ease.\"",
      "chain": [
        "30221",
        "25107",
        "20332",
        "22074",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1237",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، ومحمد بن الصباح، قالا حدثنا عائذ بن حبيب، عن صالح بن حسان الأنصاري، عن محمد بن كعب القرظي، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دعوت الله فادع بباطن كفيك ولا تدع بظهورهما فإذا فرغت فامسح بهما وجهك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)said: ‘When you call upon Allah, then do so with the palms of yourhands (upwards). Do not do so with the back of your hands (upwards).And when you finish, then wipe your face with them.’”",
      "chain": [
        "30216",
        "30269",
        "25136",
        "22074",
        "11221",
        "17"
      ]
    },
    {
      "hadith_no": "3866",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عائذ بن حبيب، عن صالح بن حسان، عن محمد بن كعب القرظي، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دعوت الله فادع ببطون كفيك ولا تدع بظهورهما فإذا فرغت فامسح بهما وجهك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Messenger of Allah (saas) said: \"When you supplicate to Allah, supplicate with your palms uppermost, not with the backs of your hands uppermost, and when you finish, wipe your face with them.\"",
      "chain": [
        "30269",
        "25136",
        "22074",
        "11221",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}