{
  "id": "22137",
  "name": "'Abdul Malik bin Qadama bin Ibrahim عبد الملك بن قدامة بن إبراهيم بن محمد",
  "full_name": "'Abdul Malik bin Qadama bin Ibrahim عبد الملك بن قدامة بن إبراهيم بن محمد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ ق  -  ضعيف ]"
    ],
    "tags": [
      "Quraish",
      "B.Jumah",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "18860",
      "name": "Qadama bin Ibrahim bin Muhammad قدامة بن إبراهيم بن محمد",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "12004",
      "name": "Ibrahim bin Muhammad bin Hatib إبراهيم بن محمد بن حاطب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22076",
      "name": "Salah bin Qadama bin Ibrahim صالح بن قدامة بن إبراهيم بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "18860",
      "name": "Qadama bin Ibrahim bin Muhammad قدامة بن إبراهيم بن محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "22019",
      "name": "Ishaq bin Abi al-Frat إسحاق بن أبي الفرات بكر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22016",
      "name": "Ishaq bin Ibrahim al-Hunaini إسحاق بن إبراهيم الحنيني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38338",
      "name": "'Abdur Rahman bin Mqatl عبد الرحمن بن مقاتل التستري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1666",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا عبد الملك بن قدامة الجمحي، عن أبيه، عن عمر بن أبي سلمة، عن أم سلمة، أن أبا سلمة، حدثها أنه، سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من مسلم يصاب بمصيبة فيفزع إلى ما أمر الله به من قوله إنا لله وإنا إليه راجعون اللهم عندك احتسبت مصيبتي فأجرني فيها وعضني منها - إلا آجره الله عليها وعاضه خيرا منها ‏\"‏ ‏.‏ قالت فلما توفي أبو سلمة ذكرت الذي حدثني عن رسول الله  صلى الله عليه وسلم  فقلت إنا لله وإنا إليه راجعون اللهم عندك احتسبت مصيبتي هذه فأجرني عليها ‏.‏ فإذا أردت أن أقول وعضني خيرا منها قلت في نفسي أعاض خيرا من أبي سلمة ثم قلتها فعاضني الله محمدا  صلى الله عليه وسلم  ‏.‏ وآجرني في مصيبتي ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that Abu Salamah told her that heheard theMessenger of Allah (ﷺ) say:                      “There is no Muslim who isstrickenwith a calamity and reacts by saying as Allah has commanded:‘Innalillahi, wa inna ilayhi raji’un. Allahumma indakah-tasabtumusibati, fajurni iha, wa ‘awwidni minha (Truly, to Allah we belongand truly, to Him we shall return. O Allah, with You I seek rewardformy calamity, so reward me for it and compensate me),’ but Allahwillreward him for that and compensate him with something betterthan it.”She said: “When Abu Salamah died, I remembered what hehad told mefrom the Messenger of Allah (ﷺ) and I said: ‘Innalillahi, wa innailayhi raji’un. Allahumma indakah-tasabtumusibati, fajurni ihaiha(Truly, to Allah we belong and truly, to Himwe shall return. O Allah,with You I seek reward for my calamity, soreward me for it).’ Butwhen I wanted to say wa ‘awwidni minha(and compensate me withbetter), I said to myself: ‘How can I becompensated with somethingbetter than Abu Salamah?’ Then I saidit, and Allah compensated mewith Muhammad (ﷺ) and rewarded me formy calamity.”",
      "chain": [
        "30201",
        "20472",
        "22137",
        "18860",
        "246",
        "56"
      ]
    },
    {
      "hadith_no": "4172",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا عبد الملك بن قدامة الجمحي، عن إسحاق بن أبي الفرات، عن المقبري، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ سيأتي على الناس سنوات خداعات يصدق فيها الكاذب ويكذب فيها الصادق ويؤتمن فيها الخائن ويخون فيها الأمين وينطق فيها الرويبضة قيل وما الرويبضة قال الرجل التافه في أمر العامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “There will come to the people years of treachery, when theliarwill be regarded as honest, and the honest man will be regardedas aliar; the traitor will be regarded as faithful, and the faithfulmanwill be regarded as a traitor; and the Ruwaibidah will decidematters.’ It was said: ‘Who are the Ruwaibidah?’ He said: ‘Vileandbase men who control the affairs of the people.’”",
      "chain": [
        "30201",
        "20472",
        "22137",
        "11168",
        "13"
      ]
    }
  ],
  "total_hadiths": 2
}