{
  "id": "2216",
  "name": "'Abdur Rahman bin Azhar bin 'Abd 'Awf ( عبد الرحمن بن أزهر بن عبد عوف الزهري ( رضي الله عنه",
  "full_name": "'Abdur Rahman bin Azhar bin 'Abd 'Awf ( عبد الرحمن بن أزهر بن عبد عوف الزهري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "63",
      "date_gregorian": "680",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ د  س  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Late Muslim",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "2215",
      "name": "Azhar bin 'Abd 'Awf ( أزهر بن عبد عوف الزهري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "766",
      "name": "al-Muttalib bin Azhar ( المطلب بن أزهر بن عبد عوف الزهري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "769",
      "name": "Tulayb bin Azhar ( طليب بن أزهر بن عبد عوف الزهري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "12228",
      "name": "'Abdullah bin 'Abdur Rahman bin Azhar عبد الله بن عبد الرحمن بن أزهر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12843",
      "name": "'Abdul Hameed bin 'Abdur Rahman عبد الحميد بن عبد الرحمن بن أزهر",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "17899",
      "name": "Mwhb bin 'Abdur Rahman bin Azhar موهب بن عبد الرحمن بن أزهر أخو عب",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "871",
      "name": "Jubayr bin Mut'im ( جبير بن مطعم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12228",
      "name": "'Abdullah bin 'Abdur Rahman bin Azhar عبد الله بن عبد الرحمن بن أزهر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12843",
      "name": "'Abdul Hameed bin 'Abdur Rahman عبد الحميد بن عبد الرحمن بن أزهر",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1233",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، أن ابن عباس، والمسور بن مخرمة، وعبد الرحمن بن أزهر  رضى الله عنهم  أرسلوه إلى عائشة  رضى الله عنها  فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد صلاة العصر وقل لها إنا أخبرنا أنك تصلينهما وقد بلغنا أن النبي صلى الله عليه وسلم نهى عنها‏.‏ وقال ابن عباس وكنت أضرب الناس مع عمر بن الخطاب عنهما‏.‏ فقال كريب فدخلت على عائشة  رضى الله عنها  فبلغتها ما أرسلوني‏.‏ فقالت سل أم سلمة‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة‏.‏ فقالت أم سلمة  رضى الله عنها  سمعت النبي صلى الله عليه وسلم ينهى عنها ثم رأيته يصليهما حين صلى العصر، ثم دخل على وعندي نسوة من بني حرام من الأنصار فأرسلت إليه الجارية فقلت قومي بجنبه قولي له تقول لك أم سلمة يا رسول الله سمعتك تنهى عن هاتين وأراك تصليهما‏.‏ فإن أشار بيده فاستأخري عنه‏.‏ ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر وإنه أتاني ناس من عبد القيس فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏‏.‏",
      "text_en": " Narrated Kuraib:                     I was sent to Aisha by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar . They told me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr prayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the Prophet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to beat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha said, \"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They then told me to go to Um Salama with the same question with which t sent me to `Aisha. Um Salama replied, \"I heard the Prophet forbidding them. Later I saw him offering them immediately after he prayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the tribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand beside him and tell him that Um Salama says to you, \"O Allah's Apostle! I have heard you forbidding the offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves his hand then wait for him.' The slave girl did that. The Prophet beckoned her with his hand and she waited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have asked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to me and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that I have just prayed) are for those (missed) ones.",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2201",
        "2216"
      ]
    },
    {
      "hadith_no": "1273",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن كريب، مولى ابن عباس أن عبد الله بن عباس، وعبد الرحمن بن أزهر، والمسور بن مخرمة، أرسلوه إلى عائشة زوج النبي صلى الله عليه وسلم فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد العصر وقل إنا أخبرنا أنك تصلينهما وقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عنهما ‏.‏ فدخلت عليها فبلغتها ما أرسلوني به فقالت سل أم سلمة ‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة فقالت أم سلمة سمعت رسول الله صلى الله عليه وسلم ينهى عنهما ثم رأيته يصليهما أما حين صلاهما فإنه صلى العصر ثم دخل وعندي نسوة من بني حرام من الأنصار فصلاهما فأرسلت إليه الجارية فقلت قومي بجنبه فقولي له تقول أم سلمة يا رسول الله أسمعك تنهى عن هاتين الركعتين وأراك تصليهما فإن أشار بيده فاستأخري عنه ‏.‏ قالت ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر إنه أتاني ناس من عبد القيس بالإسلام من قومهم فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏ ‏.‏",
      "text_en": " Narrated Kuraib, the client of Ibn 'Abbas:                     That 'Abd Allah b. Abbas, 'Abd al-Rahman b. Azhar and al-Miswar b. Makhramah sent him to 'Aishah, wife of the Prophet (ﷺ). They said: Convey our regards to her from all of us and ask her about the two rak'ahs after the 'Asr prayer, and tell her that we have been informed that she prays them, and we are told that the Messenger of Allah (ﷺ) prohibited them. I entered upon her and told her that for which they had sent me to her. She said: Ask Umm Salamah. I returned to them (Ibn 'Abbas and others) and informed them about her opinion. They sent me back to Umm Salamah with the same mission for which they had sent me to 'Aishah. Umm Salamah said: I heard the Messenger of Allah (ﷺ) prohibiting them, but later on I saw him praying them. When he prayed them, he had offered the 'Asr prayer. He then came to me while a number of women from Banu Haram from the Ansar were sitting with me. He prayed these two rak'ahs. I sent a slave girl to him and I told her: Stand beside him and tell him that Umm Salamah has asked: Messenger of Allah (ﷺ), I heard you prohibiting these two rak'ahs (after the afternoon prayer) but I see you praying them yourself. If he makes a sign with his hand, step backward from him. The slave girl did so. When he finished prayer, he said: O daughter of Abu Umayyah, you asked about the praying of two rak'ahs after the 'Asr prayer, in fact, some people of 'Abd al-Qais has come to me with the news that their people had embraced Islam. They hindered me from praying the two rak'ahs after Zuhr prayer. It is those two rak'ahs (which I offered after the 'Asr prayer)",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2216"
      ]
    },
    {
      "hadith_no": "4487",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا سليمان بن داود المهري المصري ابن أخي، رشدين بن سعد أخبرنا ابن وهب، أخبرنا أسامة بن زيد، أن ابن شهاب، حدثه عن عبد الرحمن بن أزهر، قال كأني أنظر إلى رسول الله صلى الله عليه وسلم الآن وهو في الرحال يلتمس رحل خالد بن الوليد فبينما هو كذلك إذ أتي برجل قد شرب الخمر فقال للناس ‏\"‏ اضربوه ‏\"‏ ‏.‏ فمنهم من ضربه بالنعال ومنهم من ضربه بالعصا ومنهم من ضربه بالميتخة - قال ابن وهب الجريدة الرطبة - ثم أخذ رسول الله صلى الله عليه وسلم ترابا من الأرض فرمى به في وجهه ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Azhar:                     I can still picture myself looking at the Messenger of Allah (ﷺ) who was among the camps of the Companions seeking the camp of Khalid ibn al-Walid, when a man who had drunk wine was brought before him. He asked the people: Beat him. Some struck him with sandals, some with sticks and some with fresh branches of the palm-tree (mitakhah). Ibn Wahb said: This (mitakhah) means green palm fronds. Then the apostle of Allah (ﷺ) took some dust from the ground and threw it on his face.",
      "chain": [
        "30584",
        "20029",
        "50",
        "11013",
        "2216"
      ]
    },
    {
      "hadith_no": "4489",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عثمان بن عمر، حدثنا أسامة بن زيد، عن الزهري، عن عبد الرحمن بن أزهر، قال رأيت رسول الله صلى الله عليه وسلم غداة الفتح وأنا غلام شاب يتخلل الناس يسأل عن منزل خالد بن الوليد فأتي بشارب فأمرهم فضربوه بما في أيديهم فمنهم من ضربه بالسوط ومنهم من ضربه بعصا ومنهم من ضربه بنعله وحثى رسول الله صلى الله عليه وسلم التراب فلما كان أبو بكر أتي بشارب فسألهم عن ضرب النبي صلى الله عليه وسلم الذي ضربه فحزروه أربعين فضرب أبو بكر أربعين فلما كان عمر كتب إليه خالد بن الوليد إن الناس قد انهمكوا في الشرب وتحاقروا الحد والعقوبة ‏.‏ قال هم عندك فسلهم ‏.‏ وعنده المهاجرون الأولون فسألهم فأجمعوا على أن يضرب ثمانين ‏.‏ قال وقال علي إن الرجل إذا شرب افترى فأرى أن يجعله كحد الفرية ‏.‏ قال أبو داود أدخل عقيل بن خالد بين الزهري وبين ابن الأزهر في هذا الحديث عبد الله بن عبد الرحمن بن الأزهر عن أبيه ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Azhar:                     I saw the Messenger of Allah (ﷺ) on the morning of the conquest of Mecca when I was a young boy. He was walking among the people, seeking the camp of Khalid ibn al-Walid. A man who had drunk wine was brought (before him) and he ordered them (to beat him). So they beat him with what they had in their hands. Some struck him with whips, some with sticks and some with sandals. The Messenger of Allah (ﷺ) threw some dust on his face.  When a man who had drunk wine was brought before AbuBakr, he asked them (i.e. the people) about the number of beatings which they gave him. They numbered it forty. So AbuBakr gave him forty lashes.  When Umar came to power, Khalid ibn al-Walid wrote to him: The people have become addicted to drinking wine and they look down upon the prescribed punishment and its penalty.  He said: They are with you, ask them. The immigrants who embraced Islam in the beginning were with him. He asked them and they agreed on the fact that (a drunkard) should be given eighty lashes.  Ali said: When a man drinks wine, he tells lies. I, therefore, think that he should be prescribed punishment that is prescribed for telling lies..Abu Dawud said: 'Uqail b. Khalid included in the chain of this tradition: \"Abd Allah b. Abd al-Rahman b. al-Azhar from his father\" between al-Zuhri and Ibn al-Azhar.",
      "chain": [
        "30115",
        "20262",
        "50",
        "11013",
        "2216"
      ]
    }
  ],
  "total_hadiths": 4
}