{
  "id": "22172",
  "name": "Kathir bin 'Abdullah كثير بن عبد الله بن عمرو بن عوف",
  "full_name": "Kathir bin 'Abdullah كثير بن عبد الله بن عمرو بن عوف",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Mazni",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "22055",
      "name": "Rabi' bin 'Abdur Rahman ربيح بن عبد الرحمن بن أبي سعيد الخدري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30411",
      "name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "22007",
      "name": "Ibrahim bin 'Ali bin Hasan إبراهيم بن علي بن حسن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28032",
      "name": "Ishaq bin Ja'far bin Muhammad إسحاق بن جعفر بن محمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "33500",
      "name": "'Abdur Rahman bin 'Abdullah al-Salami عبد الرحمن بن عبد الله السلمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30581",
      "name": "Muhammad bin Khalid bin Athmh محمد بن خالد بن عثمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "536",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا مسلم بن عمرو أبو عمرو الحذاء المديني، حدثنا عبد الله بن نافع الصائغ، عن كثير بن عبد الله، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم كبر في العيدين في الأولى سبعا قبل القراءة وفي الآخرة خمسا قبل القراءة ‏.‏ قال وفي الباب عن عائشة وابن عمر وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث جد كثير حديث حسن وهو أحسن شيء روي في هذا الباب عن النبي عليه السلام واسمه عمرو بن عوف المزني ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏ وهكذا روي عن أبي هريرة أنه صلى بالمدينة نحو هذه الصلاة وهو قول أهل المدينة ‏.‏ وبه يقول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وروي عن عبد الله بن مسعود أنه قال في التكبير في العيدين تسع تكبيرات في الركعة الأولى خمسا قبل القراءة وفي الركعة الثانية يبدأ بالقراءة ثم يكبر أربعا مع تكبيرة الركوع ‏.‏ وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم نحو هذا وهو قول أهل الكوفة وبه يقول سفيان الثوري ‏.‏",
      "text_en": " Kathir bin Abdullah narrated from this father, from his grandfather:                     \"The Prophet said the Takbir in the first (Rak'ah) sever (times) before the recitation, and in the last, five (times) before the recitation.\"",
      "chain": [
        "30411",
        "22172"
      ]
    },
    {
      "hadith_no": "2677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن عيينة، عن مروان بن معاوية الفزاري، عن كثير بن عبد الله، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال لبلال بن الحارث ‏\"‏ اعلم ‏\"‏ ‏.‏ قال ما أعلم يا رسول الله قال ‏\"‏ اعلم يا بلال ‏\"‏ ‏.‏ قال ما أعلم يا رسول الله قال ‏\"‏ أنه من أحيا سنة من سنتي قد أميتت بعدي فإن له من الأجر مثل من عمل بها من غير أن ينقص من أجورهم شيئا ومن ابتدع بدعة ضلالة لا يرضاها الله ورسوله كان عليه مثل آثام من عمل بها لا ينقص ذلك من أوزار الناس شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومحمد بن عيينة هو مصيصي شامي وكثير بن عبد الله هو ابن عمرو بن عوف المزني ‏.‏",
      "text_en": " Narrated Narrated Kathir bin 'Abdullah [and he is Ibn 'Amr bin 'Awf Al-Musani]:                     narrated from his father, from his grandfather that the Prophet (ﷺ) said to Bilal bin Al-Harith: \"Know.\" He said: \"I am ready to know O Messenger of Allah!\" He (ﷺ) said: \"That indeed whoever revives a Sunnah from my Sunnah which has died after me, then for him is a reward similar to whoever acts upon it without diminishing anything from their rewards. And whoever introduces an erroneous innovation which Allah is not pleased with, nor His Messenger, then he shall receive sins similar to whoever acts upon it, without that diminishing anything from the sins of the people.'\"",
      "chain": [
        "30025",
        "38569",
        "20201",
        "22172"
      ]
    },
    {
      "hadith_no": "170",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، حدثني كثير بن عبد الله بن عمرو بن عوف، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ رحم الله الأنصار وأبناء الأنصار وأبناء أبناء الأنصار ‏\"‏ ‏.‏",
      "text_en": " Kathir bin 'Abdullah bin 'Amr bin 'Awf narrated from his father:                     That his grandfather said: \"The Messenger of Allah said: 'May Allah have mercy on the Ansar, and the children of the Ansar, and the grandchildren of the Ansar.'\"",
      "chain": [
        "30201",
        "30463",
        "22172"
      ]
    },
    {
      "hadith_no": "215",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا إسماعيل بن أبي أويس، حدثني كثير بن عبد الله، عن أبيه، عن جده، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من أحيا سنة من سنتي قد أميتت بعدي فإن له من الأجر مثل أجر من عمل بها من الناس لا ينقص من أجور الناس شيئا ومن ابتدع بدعة لا يرضاها الله ورسوله فإن عليه مثل إثم من عمل بها من الناس لا ينقص من آثام الناس شيئا ‏\"‏ ‏.‏",
      "text_en": " Kathir bin 'Abdullah narrated from his father, that his grandfather said:                     \"I heard the Messenger of Allah say: 'Whoever revives a Sunnah of mine that dies out after I am gone, he will have a reward equivalent to that of those among the people who act upon it, without that detracting from their reward in the slightest. Whoever introduces an innovation (Bid'ah) with which Allah and his Messenger are not pleased, he will have a (burden of) sin equivalent to that of those among the people who act upon it, without that detracting from their sins in the slightest.'\"",
      "chain": [
        "11222",
        "30103",
        "22172"
      ]
    },
    {
      "hadith_no": "1338",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مسعود، محمد بن عبد الله بن عبيد بن عقيل حدثنا محمد بن خالد بن عثمة، حدثنا كثير بن عبد الله بن عمرو بن عوف، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  كبر في العيدين سبعا في الأولى وخمسا في الآخرة ‏.‏",
      "text_en": " Kathirbin ‘Abdullah bin ‘Amr bin ‘Awf narrated, from his father,fromhis grandfather, that the Messenger of Allah (ﷺ) said theTakbir inthe ‘Eid prayers, seven times in the first Rak’ah and fivetimesin the second.",
      "chain": [
        "30581",
        "22172"
      ]
    },
    {
      "hadith_no": "1573",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا إبراهيم بن علي الرافعي، عن كثير بن عبد الله، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  كبر خمسا ‏.‏",
      "text_en": " It wasnarrated from Kathir bin ‘Abdullah, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said the Takbir fivetimes.",
      "chain": [
        "30308",
        "22007",
        "22172"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، حدثنا كثير بن عبد الله بن عمرو بن عوف، عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الصلح جائز بين المسلمين إلا صلحا حرم حلالا أو أحل حراما ‏\"‏ ‏.‏",
      "text_en": " Kathir bin 'Abdullah bin 'Amr bin 'Awf narrated from his father that his grandfather said:                     “I heard the Messenger of Allah (ﷺ) say: 'Reconciling between Muslims is permissible, except reconciliation that forbids something that is allowed, or allows something that is forbidden.'”",
      "chain": [
        "30201",
        "30463",
        "22172"
      ]
    },
    {
      "hadith_no": "2776",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، حدثنا كثير بن عبد الله بن عمرو بن عوف، عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العجماء جرحها جبار والمعدن جبار ‏\"‏ ‏.‏",
      "text_en": " Khathir bin 'Abdullah bin 'Amr bin 'Awf narrated that his grandfather said:                     “I heard the Messenger of Allah (ﷺ) say: 'The injuries cause by the beast are without liability, and mines are without liability.”",
      "chain": [
        "30201",
        "30463",
        "22172"
      ]
    },
    {
      "hadith_no": "4233",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا أبو يعقوب الحنيني، عن كثير بن عبد الله بن عمرو بن عوف، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تقوم الساعة حتى تكون أدنى مسالح المسلمين ببولاء ‏\"‏ ‏.‏ ثم قال  صلى الله عليه وسلم  ‏\"‏ يا علي يا علي يا علي ‏\"‏ ‏.‏ قال بأبي وأمي ‏.‏ قال ‏\"‏ إنكم ستقاتلون بني الأصفر ويقاتلهم الذين من بعدكم حتى تخرج إليهم روقة الإسلام أهل الحجاز الذين لا يخافون في الله لومة لائم فيفتتحون القسطنطينية بالتسبيح والتكبير فيصيبون غنائم لم يصيبوا مثلها حتى يقتسموا بالأترسة ويأتي آت فيقول إن المسيح قد خرج في بلادكم ألا وهي كذبة فالآخذ نادم والتارك نادم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kathir bin ‘Abdullah bin ‘Amr bin ‘Awf,from hisfather, that his grandfather said:                      “The Messenger of Allah(ﷺ) said:‘The Hour will not begin until the closest Muslimoutpost will be atBaula’.’ Then he said: ‘O ‘Ali, O ‘Ali,O ‘Ali.’ He (‘Ali) said: ‘Maymy father and mother beransomed for you.’ He said: ‘You will fightBanu Asfar (theRomans) and those who come after you will fight them,until the bestof the Muslims go out to fight them, the people ofHijaz who do notfear the blame of anyone for the sake of Allah. Theywill conquerConstantinople with Tasbih and Takbir and will acquiresuch spoils ofwar as has never been seen before, which they willdistribute by theshieldful. Someone will come and say: “Masih hasappeared in yourland!” But he will be lying, so the one who takes(some of thespoils) will regret it, and the one who leaves it behindwill regretit too.’”",
      "chain": [
        "38412",
        "22172"
      ]
    }
  ],
  "total_hadiths": 9
}