{
  "id": "22207",
  "name": "Mjm' bin Y'aqub bin Mjm' مجمع بن يعقوب بن مجمع بن يزيد",
  "full_name": "Mjm' bin Y'aqub bin Mjm' مجمع بن يعقوب بن مجمع بن يزيد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  -  صدوق ]"
    ],
    "tags": [
      "Ansar"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "22001",
      "name": "Ibrahim bin Isma'il bin Mjm' إبراهيم بن إسماعيل بن مجمع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12461",
      "name": "Muhammad bin Sulaiman محمد بن سليمان بن سلمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18279",
      "name": "Rabi'ya bin 'Abdur Rahman ربيعة بن عبد الرحمن بن حصن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12740",
      "name": "S'aid bin 'Abdur Rahman bin Raqaysh سعيد بن عبد الرحمن بن رقيش المدني",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36649",
      "name": "Muhammad bin 'Isa bin al-Tibaa' محمد بن عيسى بن الطباع",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2736",
      "hadith_no": "2736",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا مجمع بن يعقوب بن مجمع بن يزيد الأنصاري، قال سمعت أبي يعقوب بن مجمع، يذكر عن عمه عبد الرحمن بن يزيد الأنصاري، عن عمه، مجمع بن جارية الأنصاري وكان أحد القراء الذين قرءوا القرآن قال شهدنا الحديبية مع رسول الله صلى الله عليه وسلم فلما انصرفنا عنها إذا الناس يهزون الأباعر فقال بعض الناس لبعض ما للناس قالوا أوحي إلى رسول الله صلى الله عليه وسلم ‏.‏ فخرجنا مع الناس نوجف فوجدنا النبي صلى الله عليه وسلم واقفا على راحلته عند كراع الغميم فلما اجتمع عليه الناس قرأ عليهم ‏{‏ إنا فتحنا لك فتحا مبينا ‏}‏ فقال رجل يا رسول الله أفتح هو قال ‏\"‏ نعم والذي نفس محمد بيده إنه لفتح ‏\"‏ ‏.‏ فقسمت خيبر على أهل الحديبية فقسمها رسول الله صلى الله عليه وسلم على ثمانية عشر سهما وكان الجيش ألفا وخمسمائة فيهم ثلاثمائة فارس فأعطى الفارس سهمين وأعطى الراجل سهما ‏.‏ قال أبو داود حديث أبي معاوية أصح والعمل عليه وأرى الوهم في حديث مجمع أنه قال ثلاثمائة فارس وكانوا مائتى فارس ‏.‏",
      "text_en": " Narrated Mujammi' ibn Jariyah al-Ansari:                     Mujammi' was one of the Qur'an-reciters (qaris), and he said: We were present with the Messenger of Allah (ﷺ) at al-Hudaybiyyah. When we returned, the people were driving their camels quickly.  The people said to one another: What is the matter with them?  They said: Revelation has come down to the Prophet (ﷺ). We also proceeded with the people, galloping (our camels). We found the Prophet (ﷺ) standing on his riding-animal at Kura' al-Ghamim.  When the people gathered near him, he recited: \"Verily We have granted thee a manifest victory.  A man asked: Is this a victory, Messenger of Allah?  He replied: Yes. By Him in Whose hands the soul of Muhammad is, this is a victory. Khaybar was divided among those who had been at al-Hudaybiyyah, and the Messenger of Allah (ﷺ) divided it into eighteen portions. The army consisted of one thousand five hundred men, of which three hundred were cavalry, and he gave two shares to a horseman and one to a foot-soldier.Abu Dawud said: Abu Mu'awiyah's tradition is sounder, and it is one which is followed. I think the error is in the tradition of Mujammi', because he said: \"three hundred horsemen.\" when there were only two hundred.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "22207"
      ]
    },
    {
      "id": "sunan-abi-daud-3015",
      "hadith_no": "3015",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا مجمع بن يعقوب بن مجمع بن يزيد الأنصاري، قال سمعت أبي يعقوب بن مجمع، يذكر لي عن عمه عبد الرحمن بن يزيد الأنصاري، عن عمه، مجمع بن جارية الأنصاري - وكان أحد القراء الذين قرءوا القرآن - قال قسمت خيبر على أهل الحديبية فقسمها رسول الله صلى الله عليه وسلم على ثمانية عشر سهما وكان الجيش ألفا وخمسمائة فيهم ثلاثمائة فارس فأعطى الفارس سهمين وأعطى الراجل سهما ‏.‏",
      "text_en": " Narrated Mujammi' ibn Jariyah al-Ansari,:                     Khaybar was divided among the people of al-Hudaybiyyah. The Messenger of Allah (ﷺ) divided it into eighteen portions. The army contained one thousand and five hundred people. There were three hundred horsemen among them. He gave double share to the horsemen, and a single to the footmen.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "22207"
      ]
    },
    {
      "id": "sunan-an-nasai-699",
      "hadith_no": "699",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، قال حدثنا مجمع بن يعقوب، عن محمد بن سليمان الكرماني، قال سمعت أبا أمامة بن سهل بن حنيف، قال قال أبي قال رسول الله صلى الله عليه وسلم ‏\"‏ من خرج حتى يأتي هذا المسجد مسجد قباء فصلى فيه كان له عدل عمرة ‏\"‏ ‏.‏",
      "text_en": " Abu Umamah bin Sahl bin Hunaif said:                      \"My father said: 'The Messenger of Allah (ﷺ) said: 'Whoever goes out to his Masjid - the Masjid of Quba' and prays therein, that will be equivalent to 'Umrah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "22207",
        "12461",
        "405",
        "403"
      ]
    }
  ],
  "total_hadiths": 3
}