{
  "id": "2230",
  "name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
  "full_name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
  "grade": "Comp.(RA) [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "38",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "HIjaz, al-Hurooria",
      "reason": "NA"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ت  س  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Zuhrah",
      "B.Tamim",
      "Child",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "149",
      "name": "Khabbab ibn al-Aratt ( خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2233",
      "name": "Mulayka wife Khabbab ( مليكة امرأة خباب بن الأرت ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "2231",
      "name": "'Abdur Rahman bin Khabbab ibn al-Aratt ( عبد الرحمن بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2232",
      "name": "Zaynab bint Khabbab ibn al-Aratt ( زينب بنت خباب بن الأرت ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "149",
      "name": "Khabbab ibn al-Aratt ( خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4046",
      "name": "'Abdur Rahman bin Abza ( عبد الرحمن بن أبزى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10787",
      "name": "'Abdullah bin Abi al-Hadhayl عبد الله بن أبي الهذيل",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2175",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان بن راشد، يحدث عن الزهري، عن عبد الله بن الحارث، عن عبد الله بن خباب بن الأرت، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم صلاة فأطالها قالوا يا رسول الله صليت صلاة لم تكن تصليها قال ‏\"‏ أجل إنها صلاة رغبة ورهبة إني سألت الله فيها ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يهلك أمتي بسنة فأعطانيها وسألته أن لا يسلط عليهم عدوا من غيرهم فأعطانيها وسألته أن لا يذيق بعضهم بأس بعض فمنعنيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وفي الباب عن سعد وابن عمر ‏.‏",
      "text_en": " 'Abdullah bin Khabbab bin Al-Aratt narrated from his father:                     \"The Messenger of Allah (s.a.w) performed Salat, making it long. They said: 'O Messenger of Allah! You have performed Salat (in a manner) which you do not ordinarily perform it.' He said: 'Yes, It was a prayer of hope and fear. In it I asked Allah for three things. He granted me two, and withheld one from me. I asked him that my Ummah not be destroyed by drought. He granted that. I asked him that they not be overcome by enemies from other then them. He granted that. And I asked him that some of them not suffer from the harm of others, and He withheld that.\"'",
      "chain": [
        "30160",
        "20298",
        "11272",
        "10971",
        "11013",
        "912",
        "2230",
        "149"
      ]
    },
    {
      "hadith_no": "1638",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي وبقية، قالا حدثنا ابن أبي حمزة، قال حدثني الزهري، قال أخبرني عبيد الله بن عبد الله بن الحارث بن نوفل، عن عبد الله بن خباب بن الأرت، عن أبيه، وكان، قد شهد بدرا",
      "text_en": " It was narrated from 'Abdullah bin Khabbab bin Al-Aratt, from his father who had been present at Badr with the Messenger of Allah (ﷺ), that:                     He watched the Messenger of Allah (ﷺ) one night when he prayed all night until Fajr time. When the Messenger of Allah (ﷺ) said the taslim at the end of his prayer, Khabbab said to him: 'May my father and mother be ransomed for you O Messenger of Allah, last night you offered a prayer the like of which I have never seen you offer.\" The Messenger of Allah (ﷺ) said: \"Yes indeed. This is a prayer of hope and fear in which I asked my Lord, the Mighty and Sublime, for three things, of which He gave me two and did not grant me one. I asked my Lord not to destroy us with which he destroyed the nations before us, and He granted me that. And I asked my Lord not to let an enemy from without prevail over us, and He granted me that. And I asked my Lord not to divide us into warring factions and He did not grant me that.\"",
      "chain": [
        "38429",
        "11013",
        "11513",
        "2230",
        "149"
      ]
    }
  ],
  "total_hadiths": 2
}