{
  "id": "224",
  "name": "Fatima bint Qays ( فاطمة بنت قيس ( رضي الله عنها",
  "full_name": "Fatima bint Qays ( فاطمة بنت قيس ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah",
      "place_display": {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    },
    "death": {
      "date_hijri": "65",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufah",
      "reason": "Natural",
      "place_display": {
        "en": "Kufah",
        "ar": "الكوفةh",
        "ckb": "كوفەh"
      }
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Kufah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Fihr"
    ],
    "area_of_interest_display": [
      {
        "en": "Recitation/Quran",
        "ar": "تلاوة القرآن",
        "ckb": "خوێندنەوە/قورئان"
      },
      {
        "en": "Narrator [ ع  -  صحابي ]",
        "ar": "Narrator [ ع  -  صحابي ]",
        "ckb": "Narrator [ ع  -  صحابي ]"
      },
      {
        "en": "Fiqh",
        "ar": "فقه",
        "ckb": "فیقهـ"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      },
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      },
      {
        "en": "Kufah",
        "ar": "Kufah",
        "ckb": "Kufah"
      }
    ],
    "tags_display": [
      {
        "en": "Female",
        "ar": "أنثى",
        "ckb": "مێ"
      },
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "B.Fihr",
        "ar": "B.Fihr",
        "ckb": "B.Fihr"
      }
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "482",
      "name": "Abu 'Amr bin Hafs ( أبو عمرو بن حفص بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "siblings": [
    {
      "id": "225",
      "name": "Ad-Dahhak bin Qays ( الضحاك بن قيس بن خالد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "587",
      "name": "Khayra bint Qays ( خيرة بنت قيس ( رضي الله عنها",
      "grade": "Comp.(RA)",
      "grade_display": {
        "en": "Companion (RA)",
        "ar": "صحابي (رضي الله عنه)",
        "ckb": "هاوەڵ (رەزای خوای لێبێت)"
      }
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    }
  ],
  "students": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "13389",
      "name": "Abu Bakr bin Abi al-Jhm أبو بكر بن أبي الجهم بن صخير العد",
      "grade": "Follower(Tabi')",
      "grade_display": {
        "en": "Follower (Tabi')",
        "ar": "تابعي",
        "ckb": "شوێنكەوتوو (تابعی)"
      }
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [1st Generation]",
        "ar": "تابعي [الجيل الأول]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10939",
      "name": "'Abdullah bin Yasar al-Bahi عبد الله البهي مولى مصعب",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11218",
      "name": "Muhammad bin 'AR bin Thauban محمد بن عبد الرحمن بن ثوبان",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-3770",
      "hadith_no": "3770",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، عن فاطمة بنت قيس، أن أبا عمرو بن حفص، طلقها البتة وهو غائب فأرسل إليها وكيله بشعير فسخطته فقال والله ما لك علينا من شىء ‏.‏ فجاءت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ ليس لك عليه نفقة ‏\"‏ ‏.‏ فأمرها أن تعتد في بيت أم شريك ثم قال ‏\"‏ تلك امرأة يغشاها أصحابي اعتدي عند ابن أم مكتوم فإنه رجل أعمى تضعين ثيابك فإذا حللت فآذنيني ‏\"‏ ‏.‏ قالت فلما حللت ذكرت له أن معاوية بن أبي سفيان وأبا جهم خطباني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أبو جهم فلا يضع عصاه عن عاتقه وأما معاوية فصعلوك لا مال له انكحي أسامة بن زيد ‏\"‏ ‏.‏ فكرهته ثم قال ‏\"‏ انكحي أسامة ‏\"‏ ‏.‏ فنكحته فجعل الله فيه خيرا واغتبطت به ‏.‏",
      "text_en": " Fatima bint Qais reported that Abu 'Amr b. Hafs divorced her absolutely when he was away from home, and he sent his agent to her with some barley. She was displeased with him and when he said:                      I swear by Allah that you have no claim on us. she went to Allah's Messenger (may peace be upon him) and mentioned that to him. He said: There is no maintenance due to you from him, and he commanded her to spend the 'Idda in the house of Umm Sharik, but then said: That is a woman whom my companions visit. So better spend this period in the house of Ibn Umm Maktum, for he is a blind man and yon can put off your garments. And when the 'Idda is over, inform me. She said: When my period of 'Idda was over, I mentioned to him that Mu'awiya b. Abu Sufyan and Jahm had sent proposal of marriage to me, whereupon Allah's Messenger (may peace be upon him) said: As for Abu Jahm, he does not put down his staff from his shoulder, and as for Mu'awiya, he is a poor man having no property; marry Usama b. Zaid. I objected to him, but he again said: Marry Usama; so I married him. Allah blessed there in and I was envied (by others).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11189",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3771",
      "hadith_no": "3771",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم وقال قتيبة أيضا حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - كلاهما عن أبي حازم، عن أبي، سلمة عن فاطمة بنت قيس، أنه طلقها زوجها في عهد النبي صلى الله عليه وسلم وكان أنفق عليها نفقة دون فلما رأت ذلك قالت والله لأعلمن رسول الله صلى الله عليه وسلم فإذا كان لي نفقة أخذت الذي يصلحني وإن لم تكن لي نفقة لم آخذ منه شيئا قالت فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لا نفقة لك ولا سكنى ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported that her husband divorced her during the life time of Allah's Prophet (may peace be upon him) and gave her a meagre maintenance allowance. When she saw that, she said:                      By Allah, I will inform Allah's Messenger (may peace be upon him), and if maintenance allowance is due to me then I will accept that which will suffice me, and if it is not due to me, I will not accept anything from him. She said: I made a mention of that to Allah's Messenger (may peace be upon him) and he said: There is neither maintenance allowance for you nor lodging.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20165",
        "11172",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3772",
      "hadith_no": "3772",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن عمران بن أبي أنس، عن أبي سلمة، أنه قال سألت فاطمة بنت قيس فأخبرتني أن زوجها المخزومي طلقها فأبى أن ينفق عليها فجاءت إلى رسول الله صلى الله عليه وسلم فأخبرته فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا نفقة لك فانتقلي فاذهبي إلى ابن أم مكتوم فكوني عنده فإنه رجل أعمى تضعين ثيابك عنده ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported that her husband al-Makhzulmi divorced her and refused to pay her maintenance allowance. So she came to Allah's Messenger (may peace he upon him) and informed him, whereupon he said:                      There is no maintenance allowance for you, and you better go to the house of Ibn Umm Maktum and live with him for he is a blind man and you can put off your clothes in his house (i. e. you shall not face much difficulty in observing purdah there).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10605",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3773",
      "hadith_no": "3773",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن رافع، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، - وهو ابن أبي كثير - أخبرني أبو سلمة، أن فاطمة بنت قيس، أخت الضحاك بن قيس أخبرته أن أبا حفص بن المغيرة المخزومي طلقها ثلاثا ثم انطلق إلى اليمن فقال لها أهله ليس لك علينا نفقة ‏.‏ فانطلق خالد بن الوليد في نفر فأتوا رسول الله صلى الله عليه وسلم في بيت ميمونة فقالوا إن أبا حفص طلق امرأته ثلاثا فهل لها من نفقة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليست لها نفقة وعليها العدة ‏\"‏ ‏.‏ وأرسل إليها ‏\"‏ أن لا تسبقيني بنفسك ‏\"‏ ‏.‏ وأمرها أن تنتقل إلى أم شريك ثم أرسل إليها ‏\"‏ أن أم شريك يأتيها المهاجرون الأولون فانطلقي إلى ابن أم مكتوم الأعمى فإنك إذا وضعت خمارك لم يرك ‏\"‏ ‏.‏ فانطلقت إليه فلما مضت عدتها أنكحها رسول الله صلى الله عليه وسلم أسامة بن زيد بن حارثة.",
      "text_en": " Abu Salama reported that Fatima bint Qais, the sister of al-Dahhak b. Qais informed him that Abu Hafs b. Mughira al-Makhzumi divorced her three times and then he proceeded on to the Yemen. The members of his family said to her:                      There is no maintenance allowance due to you from us. Khalid b. Walid along with a group of persons visited Allah's Messenger (may peace be upon him) in the house of Maimuna and they said: Abu Hafs has divorced his wife with three pronouncements; is there any maintenance allowance due to her? Thereupon Allah's Messenger (may peace be upon him) said: No maintenance allowance is due to her, but she is required to spend the 'Idda; and he sent her the message that she should not be hasty in making a decision about herself and commanded her to move to the house of Umm Sharik, and then sent her the message that as the first immigrants (frequently) visit the house of Umm Sharik, she should better go to the house of Ibn Umm Maktum, the blind, (and further said: In case you put off your head-dress, he (Ibn Umm Makhtum) will not see you. So she went to his house, and when the 'Idda was over, Allah's Messenger (may peace be upon him) married her to Usama b. Zaid b. Haritha.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20384",
        "20240",
        "11449",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3774",
      "hadith_no": "3774",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن محمد بن عمرو، عن أبي سلمة، عن فاطمة بنت قيس، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن فاطمة بنت قيس، قال كتبت ذلك من فيها كتابا قالت كنت عند رجل من بني مخزوم فطلقني البتة فأرسلت إلى أهله أبتغي النفقة ‏.‏ واقتصوا الحديث بمعنى حديث يحيى بن أبي كثير عن أبي سلمة ‏.‏ غير أن في حديث محمد بن عمرو ‏\"‏ لا تفوتينا بنفسك ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported:                      I had been married to a person from Banu Makhzum and he divorced me with irrevocable divorce. I sent a message to his family asking for maintenance allowance, and the rest of the hadith has been transmitted with a slight change of words.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "11220",
        "10567",
        "224",
        "30201",
        "20352",
        "11220",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3775",
      "hadith_no": "3775",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا حسن بن علي الحلواني، وعبد بن حميد، جميعا عن يعقوب بن إبراهيم، بن سعد حدثنا أبي، عن صالح، عن ابن شهاب، أن أبا سلمة بن عبد الرحمن بن عوف، أخبره أن فاطمة بنت قيس أخبرته أنها، كانت تحت أبي عمرو بن حفص بن المغيرة فطلقها آخر ثلاث تطليقات فزعمت أنها جاءت رسول الله صلى الله عليه وسلم تستفتيه في خروجها من بيتها فأمرها أن تنتقل إلى ابن أم مكتوم الأعمى فأبى مروان أن يصدقه في خروج المطلقة من بيتها وقال عروة إن عائشة أنكرت ذلك على فاطمة بنت قيس.‏",
      "text_en": "  Fatima bint Qais (Allah be pleased with her) reported that she had been married to Abu 'Amr b. Hafs b. al-Mughira and he divorced her with three pronouncements. She stated that she went to Allah's Messenger (may peace be upon him) asking him about abandoning that house. He commanded her to move to the house of Ibn Umm Maktum, the blind. Marwan refused to testify the divorced woman abandoning her house (before the 'Idda was over). 'Urwa said that 'A'isha objected to (the words of) Fatima bint Qais.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3781",
      "hadith_no": "3781",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن سلمة بن كهيل، عن الشعبي، عن فاطمة بنت قيس، عن النبي صلى الله عليه وسلم في المطلقة ثلاثا قال ‏\"‏ ليس لها سكنى ولا نفقة ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported from Allah's Messenger (may peace be upon him) that there is no lodging and maintenance allowance for a woman who has been given irrevocable divorce.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20033",
        "20012",
        "11350",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3782",
      "hadith_no": "3782",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا عمار بن، رزيق عن أبي إسحاق، عن الشعبي، عن فاطمة بنت قيس، قالت طلقني زوجي ثلاثا فأردت النقلة فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ انتقلي إلى بيت ابن عمك عمرو بن أم مكتوم فاعتدي عنده ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported:                      My husband divorced me with three pronouncements. I decided to move (from his house to another place). So I came to Allah's Messenger (may peace be upon him), and he said: Move to the house of your cousin 'Amr b. Umm Maktum and spend your period of 'Idda there.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20364",
        "20595",
        "11049",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3785",
      "hadith_no": "3785",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، عن أبي بكر بن أبي، الجهم بن صخير العدوي قال سمعت فاطمة بنت قيس، تقول إن زوجها طلقها ثلاثا فلم يجعل لها رسول الله صلى الله عليه وسلم سكنى ولا نفقة قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا حللت فآذنيني ‏\"‏ ‏.‏ فآذنته فخطبها معاوية وأبو جهم وأسامة بن زيد ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما معاوية فرجل ترب لا مال له وأما أبو جهم فرجل ضراب للنساء ولكن أسامة بن زيد ‏\"‏ ‏.‏ فقالت بيدها هكذا أسامة أسامة فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ طاعة الله وطاعة رسوله خير لك ‏\"‏ ‏.‏ قالت فتزوجته فاغتبطت ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported that her husband divorced her with three, pronouncements and Allah's Messenger (may peace be upon him) made no provision for her lodging and maintenance allowance. She (further said):                      Allah's Messenger (may peace be upon him) said to me: When your period of 'Idda is over, inform me. So I informed him. (By that time) Mu'awiya, Abu Jahm and Usama b. Zaid had given her the proposal of marriage. Allah's Messenger (may peace be upon him) said: So far as Mu'awiya is concerned, he is a poor man without any property. So far as Abu Jahm is concerned, he is a great beater of women, but Usama b. Zaid... She pointed with her hand (that she did not approve of the idea of marrying) Usama. But Allah's Messenger (may peace be upon himn) said: Obedience to Allah and obedience to His Messenger is better for thee. She said: So I married him, and I became an object of envy.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3786",
      "hadith_no": "3786",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا عبد الرحمن، عن سفيان، عن أبي بكر بن، أبي الجهم قال سمعت فاطمة بنت قيس، تقول أرسل إلى زوجي أبو عمرو بن حفص بن المغيرة عياش بن أبي ربيعة بطلاقي وأرسل معه بخمسة آصع تمر وخمسة آصع شعير فقلت أما لي نفقة إلا هذا ولا أعتد في منزلكم قال لا ‏.‏ قالت فشددت على ثيابي وأتيت رسول الله صلى الله عليه وسلم فقال ‏\"‏ كم طلقك ‏\"‏ ‏.‏ قلت ثلاثا ‏.‏ قال ‏\"‏ صدق ليس لك نفقة ‏.‏ اعتدي في بيت ابن عمك ابن أم مكتوم فإنه ضرير البصر تلقي ثوبك عنده فإذا انقضت عدتك فآذنيني ‏\"‏ ‏.‏ قالت فخطبني خطاب منهم معاوية وأبو الجهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن معاوية ترب خفيف الحال وأبو الجهم منه شدة على النساء - أو يضرب النساء أو نحو هذا - ولكن عليك بأسامة بن زيد ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported:                      My husband Abu 'Amr b. Hafs b. al-Mughira sent 'Ayyish b. Abu Rabi'a to me with a divorce, and he also sent through him five si's of dates and five si's of barley. I said: Is there no maintenance allowance for me but only this, and I cannot even spend my 'Idda period in your house? He said: No. She said: I dressed myself and came to Allah's Messenger (may peace be upon him). He said: How many pronouncements of divorce have been made for you? I said: Three. He said what he ('Ayyish b. Abu Rabi'a) had stated was true. There is no maintenance allowance for you. Spend 'Idda period in the house of your cousin, Ibn Umm Maktum. He is blind and you can put off your garment in his presence. And when you have spent your Idda period, you inform me. She said: Mu'awiya and Abu'l-Jahm (Allah be pleased with them) were among those who had given me the proposal of marriage. Thereupon Allah's Apostle (may peace be upon him) said: Mu'awiya is destitute and in poor condition and Abu'l-Jahm is very harsh with women (or he beats women, or like that), you should take Usama b. Zaid (as your husband).",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20012",
        "10988",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3789",
      "hadith_no": "3789",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني حسن بن علي الحلواني، حدثنا يحيى بن آدم، حدثنا حسن بن صالح، عن السدي، عن البهي، عن فاطمة بنت قيس، قالت طلقني زوجي ثلاثا فلم يجعل لي رسول الله صلى الله عليه وسلم سكنى ولا نفقة ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported:                      My husband divorced me with three pronouncements and Allah's Messenger (may peace be upon him) made no provision for lodging and maintenance allowance.",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "10743",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3791",
      "hadith_no": "3791",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا حفص بن غياث، حدثنا هشام، عن أبيه، عن فاطمة، بنت قيس قالت قلت يا رسول الله زوجي طلقني ثلاثا وأخاف أن يقتحم على ‏.‏ قال فأمرها فتحولت ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported that she said:                      Allah's Messenger, my husband has divorcee me with three pronouncements and I am afraid that I may be put to hardship, and so he commanded her and so she moved (to another house).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20317",
        "11065",
        "10511",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7575",
      "hadith_no": "7575",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، وأحمد بن عثمان النوفلي، قالا حدثنا وهب، بن جرير حدثنا أبي قال، سمعت غيلان بن جرير، يحدث عن الشعبي، عن فاطمة بنت، قيس قالت قدم على رسول الله صلى الله عليه وسلم تميم الداري فأخبر رسول الله صلى الله عليه وسلم أنه ركب البحر فتاهت به سفينته فسقط إلى جزيرة فخرج إليها يلتمس الماء فلقي إنسانا يجر شعره ‏.‏ واقتص الحديث وقال فيه ثم قال أما إنه لو قد أذن لي في الخروج قد وطئت البلاد كلها غير طيبة ‏.‏ فأخرجه رسول الله صلى الله عليه وسلم إلى الناس فحدثهم قال ‏\"‏ هذه طيبة وذاك الدجال ‏\"‏ ‏.‏",
      "text_en": " Tamim Dari came to Allah's Messenger (may peace be upon him) and informed Allah's Messenger (may peace be upon him) that he sailed in an ocean and his ship lost direction and thus landed at an island. They moved about in that land in search of water. There they saw a person who had been pulling his hair. The rest of the hadith is the same. And he (Dajjal) said:                      If I were to be permitted to set out I would have covered all the lands except Taiba. Then Allah's Messerger (may peace be upon him) brought (Tamim Dari) before the public and he narrated to them and said: That is Taiba and that is the Dajjal.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30185",
        "20298",
        "11272",
        "11300",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7576",
      "hadith_no": "7576",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني أبو بكر بن إسحاق، حدثنا يحيى بن بكير، حدثنا المغيرة، - يعني الحزامي - عن أبي الزناد، عن الشعبي، عن فاطمة بنت قيس، أن رسول الله صلى الله عليه وسلم قعد على المنبر فقال ‏\"‏ أيها الناس حدثني تميم الداري أن أناسا من قومه كانوا في البحر في سفينة لهم فانكسرت بهم فركب بعضهم على لوح من ألواح السفينة فخرجوا إلى جزيرة في البحر ‏\"‏ ‏.‏ وساق الحديث",
      "text_en": " Fatima b. Qais reported that Allah's Messenger (may peace be upon him) sat on the pulpit and said:                      O people, Tamim Dari has reported to me that some persons of his tribe sailed in the ocean in a boat and it capsised and then some of them travelled on one of the planks of the boat and they went to an island in the ocean. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "30399",
        "11061",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-2284",
      "hadith_no": "2284",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، عن فاطمة بنت قيس، أن أبا عمرو بن حفص، طلقها البتة وهو غائب فأرسل إليها وكيله بشعير فتسخطته فقال والله ما لك علينا من شىء ‏.‏ فجاءت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال لها ‏\"‏ ليس لك عليه نفقة ‏\"‏ ‏.‏ وأمرها أن تعتد في بيت أم شريك ثم قال ‏\"‏ إن تلك امرأة يغشاها أصحابي اعتدي في بيت ابن أم مكتوم فإنه رجل أعمى تضعين ثيابك وإذا حللت فآذنيني ‏\"‏ ‏.‏ قالت فلما حللت ذكرت له أن معاوية بن أبي سفيان وأبا جهم خطباني فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أبو جهم فلا يضع عصاه عن عاتقه وأما معاوية فصعلوك لا مال له انكحي أسامة بن زيد ‏\"‏ ‏.‏ قالت فكرهته ثم قال ‏\"‏ انكحي أسامة بن زيد ‏.‏ فنكحته فجعل الله تعالى فيه خيرا كثيرا واغتبطت به ‏.‏",
      "text_en": " Abu Salamah bin ‘Abd Al Rahman reported on the authority of Fatimah daughter of Qais Abu ‘Amr bin Hafs divorced her (Fathima daughter of Qais) absolutely when he was away from home and his agent sent her home barely. She was displeased with it. He said “I swear by Allaah, you have no claim on us. She then came to Apostle of Allaah(ﷺ) and mentioned that to him. He said to her “No maintenance is due to you for from him. He ordered her to spend the waiting period in the house of Umm Sharik but he said afterwards “that is a woman whom my Companions visits spend the waiting period in the house of Ibn Umm Maktum for he is blind and you can undress. Then when you are in a position of being remarried, tell me.” She said “When I was in a position to remarry, I mentioned to him that Mu’awiyah bin Abi Sufyan and Abu Jahm had asked me in marriage. The Apostle of Allaah(ﷺ)said “As for Abu Jahm, he does not put down his stick from his shoulder, and as for Mu’awiyah he is a poor man who has no property; marry Usamah bin Zaid. I disliked him but he said “Maary Usamah bin Zaid. So, I married him. And Allaah prospered him very much and I was envied.”",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11189",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2285",
      "hadith_no": "2285",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان بن يزيد العطار، حدثنا يحيى بن أبي كثير، حدثني أبو سلمة بن عبد الرحمن، أن فاطمة بنت قيس، حدثته أن أبا حفص بن المغيرة طلقها ثلاثا وساق الحديث فيه وأن خالد بن الوليد ونفرا من بني مخزوم أتوا النبي صلى الله عليه وسلم فقالوا يا نبي الله إن أبا حفص بن المغيرة طلق امرأته ثلاثا وإنه ترك لها نفقة يسيرة فقال ‏\"‏ لا نفقة لها ‏\"‏ ‏.‏ وساق الحديث وحديث مالك أتم ‏.‏",
      "text_en": " Abu Salamah bin ‘Abd Al Rahman said that Fatimah daughter of Qais told him that Abu Hafs Al Mughirah divorced her three times. He then narrated the rest of the tradition. The version has Khalid bin Walid and some people of Banu Makhzum came to the Prophet (ﷺ) and said Prophet of Allaah (ﷺ) Abu Hafs Al Mughirah divorced his wife three times and he has left a little for her. He said “No maintenance is necessary for her. He then transmitted the rest of the tradition. The tradition narrated by Malik is more perfect.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20205",
        "11449",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2286",
      "hadith_no": "2286",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، حدثنا أبو عمرو، عن يحيى، حدثني أبو سلمة، حدثتني فاطمة بنت قيس، أن أبا عمرو بن حفص المخزومي، طلقها ثلاثا وساق الحديث وخبر خالد بن الوليد قال فقال النبي صلى الله عليه وسلم ‏\"‏ ليست لها نفقة ولا مسكن ‏\"‏ ‏.‏ قال فيه وأرسل إليها النبي صلى الله عليه وسلم أن لا تسبقيني بنفسك ‏.‏",
      "text_en": " Abu Salamah reported on the authority of Fatimah daughter of Qais that Abu ‘Amr bin Hafs Al Makhzumi divorced her three times. He then narrated the rest of the tradition. He then mentioned about Khalid bin Walid and said that the Prophet (ﷺ) said “There are no maintenance and dwelling for her.” This version has “The Apostle of Allaah(ﷺ) sent a message to her “Do not give her consent for marriage without my permission.””",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11449",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2287",
      "hadith_no": "2287",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، أن إسماعيل بن جعفر، حدثهم حدثنا محمد بن عمرو، عن يحيى، عن أبي سلمة، عن فاطمة بنت قيس، قالت كنت عند رجل من بني مخزوم فطلقني البتة ثم ساق نحو حديث مالك قال فيه ‏\"‏ ولا تفوتيني بنفسك ‏\"‏ ‏.‏ قال أبو داود وكذلك رواه الشعبي والبهي وعطاء عن عبد الرحمن بن عاصم وأبو بكر بن أبي الجهم كلهم عن فاطمة بنت قيس أن زوجها طلقها ثلاثا ‏.‏",
      "text_en": " Fatimah daughter of Qais said “I was married to a man of Banu Makhzum. He divorced me absolutely. The narrator then transmitted the rest of the tradition like that of Malik. This version has “Do not marry yourself without my permission.”Abu Dawud said Al Sha’bi, Al Bahiyy and ata from abd Al Rahman bin asim and Abu Bakr bin Abi Al Jahm all narrated on the authority of Fatimah daughter of Qais that her husband had divorced her three times.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20155",
        "11220",
        "20031",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2288",
      "hadith_no": "2288",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا سلمة بن كهيل، عن الشعبي، عن فاطمة بنت قيس، أن زوجها، طلقها ثلاثا فلم يجعل لها النبي صلى الله عليه وسلم نفقة ولا سكنى ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Al Sha’bi through a different chain of narrators.  This version has “The husband of Fathima daughter of Qais pronounced her triple divorce. The Prophet (ﷺ) did not allow her to have maintenance and dwelling.”",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11350",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4325",
      "hadith_no": "4325",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا النفيلي، حدثنا عثمان بن عبد الرحمن، حدثنا ابن أبي ذئب، عن الزهري، عن أبي سلمة، عن فاطمة بنت قيس، أن رسول الله صلى الله عليه وسلم أخر العشاء الآخرة ذات ليلة ثم خرج فقال ‏\"‏ إنه حبسني حديث كان يحدثنيه تميم الداري عن رجل كان في جزيرة من جزائر البحر فإذا أنا بامرأة تجر شعرها قال ما أنت قالت أنا الجساسة اذهب إلى ذلك القصر فأتيته فإذا رجل يجر شعره مسلسل في الأغلال ينزو فيما بين السماء والأرض فقلت من أنت قال أنا الدجال خرج نبي الأميين بعد قلت نعم ‏.‏ قال أطاعوه أم عصوه قلت بل أطاعوه ‏.‏ قال ذاك خير لهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Fatimah, daughter of Qays:                     The Messenger of Allah (ﷺ) once delayed the congregational night prayer.  He came out and said: The talk of Tamim ad-Dari detained me. He transmitted it to me from a man who was on of of the islands of the sea. All of a sudden he found a woman who was trailing her hair. He asked: Who are you?  She said: I am the Jassasah. Go to that castle. So I came to it and found a man who was trailing his hair, chained in iron collars, and leaping between Heaven and Earth.  I asked: Who are you?  He replied: I am the Dajjal (Antichrist). Has the Prophet of the unlettered people come forth now?  I replied: Yes.  He said: Have they obeyed him or disobeyed him?  I said: No, they have obeyed him.  He said: That is better for them.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "28389",
        "20177",
        "11013",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4326",
      "hadith_no": "4326",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا عبد الصمد، حدثنا أبي قال، سمعت حسينا المعلم، حدثنا عبد الله بن بريدة، حدثنا عامر بن شراحيل الشعبي، عن فاطمة بنت قيس، قالت سمعت منادي، رسول الله صلى الله عليه وسلم ينادي أن الصلاة جامعة ‏.‏ فخرجت فصليت مع رسول الله صلى الله عليه وسلم فلما قضى رسول الله صلى الله عليه وسلم الصلاة جلس على المنبر وهو يضحك قال ‏\"‏ ليلزم كل إنسان مصلاه ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون لم جمعتكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ إني ما جمعتكم لرهبة ولا رغبة ولكن جمعتكم أن تميما الداري كان رجلا نصرانيا فجاء فبايع وأسلم وحدثني حديثا وافق الذي حدثتكم عن الدجال حدثني أنه ركب في سفينة بحرية مع ثلاثين رجلا من لخم وجذام فلعب بهم الموج شهرا في البحر وأرفئوا إلى جزيرة حين مغرب الشمس فجلسوا في أقرب السفينة فدخلوا الجزيرة فلقيتهم دابة أهلب كثيرة الشعر قالوا ويلك ما أنت قالت أنا الجساسة انطلقوا إلى هذا الرجل في هذا الدير فإنه إلى خبركم بالأشواق ‏.‏ قال لما سمت لنا رجلا فرقنا منها أن تكون شيطانة فانطلقنا سراعا حتى دخلنا الدير فإذا فيه أعظم إنسان رأيناه قط خلقا وأشده وثاقا مجموعة يداه إلى عنقه ‏\"‏ ‏.‏ فذكر الحديث وسألهم عن نخل بيسان وعن عين زغر وعن النبي الأمي قال إني أنا المسيح وإنه يوشك أن يؤذن لي في الخروج قال النبي صلى الله عليه وسلم ‏\"‏ وإنه في بحر الشام أو بحر اليمن لا بل من قبل المشرق ما هو ‏\"‏ ‏.‏ مرتين وأومأ بيده قبل المشرق قالت حفظت هذا من رسول الله صلى الله عليه وسلم ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Fatimah, daughter of Qais, said:                      I heard the crier of the Messenger of Allah (ﷺ) calling : Assemble for the prayer. I Then came out and prayed along with the Messenger of Allah (ﷺ): When the Messenger of Allah (ﷺ) finished his prayer, he sat on the pulpit laughing, and he said : Everyone should remain where he had said his prayer. He then asked : Do you know why I have assembled you because Tamim al-Dari, a Christian, who came and accepted Islam, told me something which agrees with what I was telling you about Lakhm and judhism and that they were storm-tossed for a month. They drew near to an island when the sun was setting. They sat in a boat nearest to them and entered the island where they were met by a very hairy beast. They said: Woe to you! What can you be ? It repled : I am the Jassasah. Go to this man in the monastery, for he is anxious to get news of  you. He said :  When it named a man to us we were afraid of it least it should be a she-devil. So we went off quickly and entered the monastery, where we found a man with the hugest and strongest frame we had ever seen with his hand joined to his neck. He then narrated the rest of the tradition. He asked them about the palm-trees of Baisan and the spring of Zughar  and about the unlettered prophet. He said : I am the messiah (the Antichrist) and will be soon Syrian sea or the Yemen sea : no , on the contrary , it is towards the east that he is . He said it teice and ponted his hand to the east. She said : I memorized this (tradition) from the Messenger of Allah (ﷺ) , And she narrated the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "20250",
        "20258",
        "11432",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4327",
      "hadith_no": "4327",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن صدران، حدثنا المعتمر، حدثنا إسماعيل بن أبي خالد، عن مجالد بن سعيد، عن عامر، قال حدثتني فاطمة بنت قيس، أن النبي صلى الله عليه وسلم صلى الظهر ثم صعد المنبر وكان لا يصعد عليه إلا يوم جمعة قبل يومئذ ثم ذكر هذه القصة ‏.‏ قال أبو داود وابن صدران بصري غرق في البحر مع ابن مسور لم يسلم منهم غيره ‏.‏",
      "text_en": " Fatimah, daughter of Qais, said:                      The prophet (ﷺ) offered the noon prayer and ascended the pulpit. Before this day he did not ascend it except on Friday. He then narrated this story.Abu Dawud said: Ibn Sudran belongs to Basrah. He was drowned in the sea along with Ibn Miswar, and no one could escape except him.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11418",
        "10820",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-659",
      "hadith_no": "659",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن أحمد بن مدويه، حدثنا الأسود بن عامر، عن شريك، عن أبي حمزة، عن الشعبي، عن فاطمة بنت قيس، قالت سألت أو سئل النبي صلى الله عليه وسلم عن الزكاة فقال ‏\"‏ إن في المال لحقا سوى الزكاة ‏\"‏ ‏.‏ ثم تلا هذه الآية التي في البقرة ‏(‏ ليس البر أن تولوا وجوهكم ‏)‏ الآية ‏.‏",
      "text_en": " Fatimah bint Qais narrated that :                     she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is in Al-Baqarah: 'It is not Al-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)",
      "usc_msa_ref": "",
      "chain": [
        "20380",
        "20587",
        "20458",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-660",
      "hadith_no": "660",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن الطفيل، عن شريك، عن أبي حمزة، عن عامر الشعبي، عن فاطمة بنت قيس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في المال حقا سوى الزكاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إسناده ليس بذاك ‏.‏ وأبو حمزة ميمون الأعور يضعف ‏.‏ وروى بيان وإسماعيل بن سالم عن الشعبي هذا الحديث قوله وهذا أصح ‏.‏",
      "text_en": " Fatimah bint Qais narrated that :                     the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20587",
        "20458",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2253-2",
      "hadith_no": "2253",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثنا أبي، عن قتادة، عن الشعبي، عن فاطمة بنت قيس، أن نبي الله صلى الله عليه وسلم صعد المنبر فضحك فقال ‏\"‏ إن تميما الداري حدثني بحديث ففرحت فأحببت أن أحدثكم حدثني أن ناسا من أهل فلسطين ركبوا سفينة في البحر فجالت بهم حتى قذفتهم في جزيرة من جزائر البحر فإذا هم بدابة لباسة ناشرة شعرها فقالوا ما أنت قالت أنا الجساسة ‏.‏ قالوا فأخبرينا ‏.‏ قالت لا أخبركم ولا أستخبركم ولكن ائتوا أقصى القرية فإن ثم من يخبركم ويستخبركم ‏.‏ فأتينا أقصى القرية فإذا رجل موثق بسلسلة فقال أخبروني عن عين زغر ‏.‏ قلنا ملأى تدفق ‏.‏ قال أخبروني عن البحيرة قلنا ملأى تدفق ‏.‏ قال أخبروني عن نخل بيسان الذي بين الأردن وفلسطين هل أطعم قلنا نعم ‏.‏ قال أخبروني عن النبي هل بعث قلنا نعم ‏.‏ قال أخبروني كيف الناس إليه قلنا سراع ‏.‏ قال فنز نزوة حتى كاد ‏.‏ قلنا فما أنت قال إنه الدجال وإنه يدخل الأمصار كلها إلا طيبة ‏.‏ وطيبة المدينة ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث صحيح غريب من حديث قتادة عن الشعبي وقد رواه غير واحد عن الشعبي عن فاطمة بنت قيس ‏.‏",
      "text_en": " Fatimah bint Qais narrated that Allah's Prophet(s.a.w) ascended the Minbar, he laughed, and said:                     \"Verily, Tamim Ad-Dari narrated a story to me, and it made me happy, so I wanted to narrate it to you[what he narrated to me]. Some people among the inhabitants of Palestine traveled by boat in the sea, taking them here and there, until it cast them on an island among the islands at sea. There they found a beast, clothed with its hair flowing out. They said: 'What are you?' It said: 'I am Al-Jassasah.' They said: 'Give us some news.' It said: 'I shall not give you any news, nor do I want any of your news. But go to the furthest village, for there is someone who will give you news and seek your news.' So we went to the furthest village, and there was a man fettered with chains. He said: 'Inform me about the spring of Zughar.' We said: '\tIt is full and flowing.' He said: 'Inform me about Al-Buhairah.' We said,'It is full and flowing.' He said: 'Inform me about the date groves of Baysan which is between Jordan and Palestine, do they produce food?' We said: 'Yes.' He said: 'Inform me about the Prophet, has he been sent?' We said: 'Yes.' He said: 'Inform me how the people came to him.' We said: 'Quickly.' He leaped up to try and escape.' We said: 'What are you?' He said: 'I am the Dajjal.'\" (The Prophet(s.a.w) said) \"He will enter all of the lands except At-Taibah, and At-Taibah is Al-Madinah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-202",
      "hadith_no": "202",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمران بن يزيد، قال حدثنا إسماعيل بن عبد الله العدوي، قال حدثنا الأوزاعي، قال حدثنا يحيى بن سعيد، قال حدثني هشام بن عروة، عن عروة، عن فاطمة بنت قيس، من بني أسد قريش أنها أتت النبي صلى الله عليه وسلم فذكرت أنها تستحاض فزعمت أنه قال لها ‏\"‏ إنما ذلك عرق فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك الدم ثم صلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Fatimah bint Qais from Banu Asad Quraish that she came to the Prophet (ﷺ) and mentioned that she suffered from Istihadah (non-menstrual vaginal bleeding). She said that he said to her:                      \"That is (bleeding from) a vein, so when the time of menstruation comes, stop praying, and when it goes, then wash the blood from yourself then pray.\"",
      "usc_msa_ref": "",
      "chain": [
        "20024",
        "11062",
        "11065",
        "10511",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-349",
      "hadith_no": "349",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عمران بن يزيد، قال حدثنا إسماعيل بن عبد الله، - وهو ابن سماعة - قال حدثنا الأوزاعي، قال حدثنا يحيى بن سعيد، قال أخبرني هشام بن عروة، عن عروة، أن فاطمة بنت قيس، من بني أسد قريش أنها أتت رسول الله صلى الله عليه وسلم فذكرت أنها تستحاض فزعمت أنه قال لها ‏\"‏ إنما ذلك عرق فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغتسلي واغسلي عنك الدم ثم صلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Fatimah bint Qais from Banu Asad Quraish that she came to the Prophet (ﷺ) and mentioned that she suffered from Istihadah. She said that he said to her:                      \"That is a vein, so when the time of menstruation comes, stop praying, and when it goes, take your bath and wash the blood from yourself then pray.\"",
      "usc_msa_ref": "",
      "chain": [
        "20024",
        "11062",
        "11065",
        "10511",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3237",
      "hadith_no": "3237",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني عبد الرحمن بن محمد بن سلام، قال حدثنا عبد الصمد بن عبد الوارث، قال سمعت أبي قال، حدثنا حسين المعلم، قال حدثني عبد الله بن بريدة، قال حدثني عامر بن شراحيل الشعبي، أنه سمع فاطمة بنت قيس، - وكانت من المهاجرات الأول - قالت خطبني عبد الرحمن بن عوف في نفر من أصحاب محمد صلى الله عليه وسلم وخطبني رسول الله صلى الله عليه وسلم على مولاه أسامة بن زيد وقد كنت حدثت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحبني فليحب أسامة ‏\"‏ ‏.‏ فلما كلمني رسول الله صلى الله عليه وسلم قلت أمري بيدك فأنكحني من شئت ‏.‏ فقال ‏\"‏ انطلقي إلى أم شريك ‏\"‏ ‏.‏ وأم شريك امرأة غنية من الأنصار عظيمة النفقة في سبيل الله عز وجل ينزل عليها الضيفان فقلت سأفعل ‏.‏ قال ‏\"‏ لا تفعلي فإن أم شريك كثيرة الضيفان فإني أكره أن يسقط عنك خمارك أو ينكشف الثوب عن ساقيك فيرى القوم منك بعض ما تكرهين ولكن انتقلي إلى ابن عمك عبد الله بن عمرو بن أم مكتوم ‏\"‏ ‏.‏ وهو رجل من بني فهر فانتقلت إليه ‏.‏ مختصر ‏.‏",
      "text_en": " Narrated 'Amir bin Shurahbil Ash-Sha'bi:                     'Amir bin Shurahbil Ash-Sha'bi narrated that he heard Fatimah bint Qais--who was one of the first Muhajir women-- say: 'Abdur-Rahman bin 'Awf proposed marriage to me, along with others of the Companions of Muhammad. And the Messenger of Allah proposed that I marry his freed slave, Usamah bin Zaid. I was told that the Messenger of Allah had said: 'Whoever loves me, let him love Usamah.' When the Messenger of Allah spoke to me I said: 'My affairs are in your hands; marry me to whomever you wish.' He said: 'Go to Umm Sharik.' Umm Sharik was a rich Ansari woman who used to spend a great deal in the cause of Allah, and she always had a lot of guests. I said: 'I will do that.' He said: 'Do not do that, for Umm Sharik has a lot of guests, and I would not like your Khimar to fall off, or your shins to become uncovered, and the people to see something of you that you do not want them to see. Rather go to your cousin (son of your paternal uncle) 'Abdullah bin 'Amr bin Umm Maktum, who is a man of Banu Fihr.' So I went to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20250",
        "20258",
        "11278",
        "11432",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3245",
      "hadith_no": "3245",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - عن ابن القاسم، عن مالك، عن عبد الله بن يزيد، عن أبي سلمة بن عبد الرحمن، عن فاطمة بنت قيس، أن أبا عمرو بن حفص، طلقها البتة وهو غائب فأرسل إليها وكيله بشعير فسخطته ‏.‏ فقال والله ما لك علينا من شىء ‏.‏ فجاءت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ ليس لك نفقة ‏\"‏ ‏.‏ فأمرها أن تعتد في بيت أم شريك ثم قال ‏\"‏ تلك امرأة يغشاها أصحابي فاعتدي عند ابن أم مكتوم فإنه رجل أعمى تضعين ثيابك فإذا حللت فآذنيني ‏\"‏ ‏.‏ قالت فلما حللت ذكرت له أن معاوية بن أبي سفيان وأبا جهم خطباني فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أبو جهم فلا يضع عصاه عن عاتقه وأما معاوية فصعلوك لا مال له ولكن انكحي أسامة بن زيد ‏\"‏ ‏.‏ فكرهته ثم قال ‏\"‏ انكحي أسامة بن زيد ‏\"‏ ‏.‏ فنكحته فجعل الله عز وجل فيه خيرا واغتبطت به ‏.‏",
      "text_en": " It was narrated from Fatimah bint Qais that Abu 'Amr bin Hafs issued a final divorce to her while he was absent. His deputy sent some barley to her but she did not like it. He said:                      \"By Allah, you have no rights over us.\" She went to the Messenger of Allah and told him about that, and he said: \"You have no right to maintenance.\" He told her to observe her 'Iddah in the house of Umm Sharik, then he said: \"She is a woman whose house is frequented by my Companions. Observe your 'Iddah in the house of Ibn Umm Maktum, for he is a blind man and you can take off your garment. And when your 'Iddah is over, let me know.\" She said: \"When my 'Iddah was over I told him that Mu'awiyah bin Abi Sufyan and Abu Jahm had proposed marriage to me. The Messenger of Allah said: 'As for Abu Jahm, his stick never leaves his shoulder, and as for Mu'awiyah he is a poor man who has no wealth. Rather you should marry Usamah bin Zaid.' I did not like the idea, then he said: 'Marry Usamah bin Zaid.' So I married him and Allah created a lot of good in him, and others felt jealous of my good fortune.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "1945",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3403",
      "hadith_no": "3403",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أحمد بن يحيى، قال حدثنا أبو نعيم، قال حدثنا سعيد بن يزيد الأحمسي، قال حدثنا الشعبي، قال حدثتني فاطمة بنت قيس، قالت أتيت النبي صلى الله عليه وسلم فقلت أنا بنت آل خالد وإن زوجي فلانا أرسل إلى بطلاقي وإني سألت أهله النفقة والسكنى فأبوا على ‏.‏ قالوا يا رسول الله إنه قد أرسل إليها بثلاث تطليقات ‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما النفقة والسكنى للمرأة إذا كان لزوجها عليها الرجعة ‏\"‏ ‏.‏",
      "text_en": " Fatimah bint Qais said:                      \"I came to the Prophet and said: 'I am the daughter of Ali Khalid and my husband, so and so, sent word to me divorcing me. I asked his family for provision and shelter but they refused.' They said: 'O Messenger of Allah, he sent word to her divorcing her thrice.'\" She said: \"The Messenger of Allah said: 'The woman is still entitled to provision and shelter if the husband can still take her back.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20348",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3404",
      "hadith_no": "3404",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سلمة، عن الشعبي، عن فاطمة بنت قيس، عن النبي صلى الله عليه وسلم ‏\"‏ المطلقة ثلاثا ليس لها سكنى ولا نفقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Fatimah bint Qais that the Prophet said:                      \"The thrice-divorced woman is not entitled to provision and shelter.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "237",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3405",
      "hadith_no": "3405",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن أبي عمرو، - وهو الأوزاعي - قال حدثنا يحيى، قال حدثني أبو سلمة، قال حدثتني فاطمة بنت قيس، أن أبا عمرو بن حفص المخزومي، طلقها ثلاثا فانطلق خالد بن الوليد في نفر من بني مخزوم إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أبا عمرو بن حفص طلق فاطمة ثلاثا فهل لها نفقة فقال ‏\"‏ ليس لها نفقة ولا سكنى ‏\"‏ ‏.‏",
      "text_en": " Fatimah bint Qais narrated that Abu 'Amr bin Hafs Al-Makhzumi divorced her thrice. Khalid bin Al-Walid went with a group of (the tribe of) Makhzum to the Messenger of Allah and said:                      \"O Messenger of Allah! Abu 'Amr bin Hafs has divorced Fatimah thrice, is she entitled to provision?\" He said: \"She is not entitled to provision nor shelter.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "20031",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3545",
      "hadith_no": "3545",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبد الحميد بن محمد، قال حدثنا مخلد، قال حدثنا ابن جريج، عن عطاء، قال أخبرني عبد الرحمن بن عاصم، أن فاطمة بنت قيس، أخبرته وكانت، عند رجل من بني مخزوم أنه طلقها ثلاثا وخرج إلى بعض المغازي وأمر وكيله أن يعطيها بعض النفقة فتقالتها فانطلقت إلى بعض نساء النبي صلى الله عليه وسلم فدخل رسول الله صلى الله عليه وسلم وهي عندها فقالت يا رسول الله هذه فاطمة بنت قيس طلقها فلان فأرسل إليها ببعض النفقة فردتها وزعم أنه شىء تطول به ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فانتقلي إلى أم كلثوم فاعتدي عندها ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن أم كلثوم امرأة يكثر عوادها فانتقلي إلى عبد الله ابن أم مكتوم فإنه أعمى ‏\"‏ ‏.‏ فانتقلت إلى عبد الله فاعتدت عنده حتى انقضت عدتها ثم خطبها أبو الجهم ومعاوية بن أبي سفيان فجاءت رسول الله صلى الله عليه وسلم تستأمره فيهما فقال ‏\"‏ أما أبو الجهم فرجل أخاف عليك قسقاسته للعصا وأما معاوية فرجل أملق من المال ‏\"‏ ‏.‏ فتزوجت أسامة بن زيد بعد ذلك ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Asim narrated that Fatimah bint Qais -who was married to a man of Banu Makhzum- told him that he divorced her three times. He went out on a military campaign and told his representative to give her some provision. She thought it was too little, so she went to one of the wives of the Prophet, and the Messenger of Allah came in while she was with her. She said:                      \"O Messenger of Allah, this is Fatimah bint Qais who has been divorced by so-and-so. He sent her some provision but she rejected it. He said that it was something he did not have to do (a favor).\" He said: \"He is telling the truth.\" The Prophet said: \"Go to Umm Kulthum and observe your 'Iddah in her house.\" Then he said: \"Umm Kulthum is a woman who has a lot of visitors. Go to 'Abdullah bin Umm Maktum for he is blind.\" So she went to 'Abdullah and observed her 'Iddah in his house, until her 'Iddah was over. Then Abu Al-Jahm and Mu'awiyah bin Abi Sufyan proposed to her. So she came to the Messenger of Allah to consult him about them. He said: \"As for Abu Al-Jahm, he is a man the waving of whose stick I fear for you. And as for Mu'awiyah he is a man who does not have any money.\" So she married Usamah bin Zaid after that.",
      "usc_msa_ref": "",
      "chain": [
        "20462",
        "11070",
        "11029",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3546",
      "hadith_no": "3546",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا حجين بن المثنى، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن فاطمة بنت قيس، أنها أخبرته أنها، كانت تحت أبي عمرو بن حفص بن المغيرة فطلقها آخر ثلاث تطليقات ‏.‏ فزعمت فاطمة أنها جاءت رسول الله صلى الله عليه وسلم فاستفتته في خروجها من بيتها فأمرها أن تنتقل إلى ابن أم مكتوم الأعمى فأبى مروان أن يصدق فاطمة في خروج المطلقة من بيتها ‏.‏ قال عروة أنكرت عائشة ذلك على فاطمة ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin 'Abdur-Rahman that Fatimah bint Qais told him that she was married to Abu 'Amr bin Hafs bin Al-Mughirah, who divorced her by giving her the last of three divorces. Fatimah said that she came to the Messenger of Allah and consulted him about leaving her house. He told her to move to the house of Ibn Umm Maktum, the blind man. Marwan refused to believe Fatimah about the divorced woman leaving her house. 'Urwah said:                      \"Aishah denounced Fatimah for that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20382",
        "20023",
        "11207",
        "11013",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3549",
      "hadith_no": "3549",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني أبو بكر بن إسحاق الصاغاني، قال حدثنا أبو الجواب، قال حدثنا عمار، - هو ابن رزيق - عن أبي إسحاق، عن الشعبي، عن فاطمة بنت قيس، قالت طلقني زوجي فأردت النقلة فأتيت رسول الله صلى الله عليه وسلم فقال ‏\"‏ انتقلي إلى بيت ابن عمك عمرو ابن أم مكتوم فاعتدي فيه ‏\"‏ ‏.‏ فحصبه الأسود وقال ويلك لم تفتي بمثل هذا ‏.‏ قال عمر إن جئت بشاهدين يشهدان أنهما سمعاه من رسول الله صلى الله عليه وسلم وإلا لم نترك كتاب الله لقول امرأة ‏{‏ لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة ‏}‏ ‏.‏",
      "text_en": " It was narrated that Fatimah bint Qais said:                      \"My husband divorced me and I wanted to move, so I went to the Messenger of Allah and he said: 'Move to the house of your paternal cousin 'Amr bin Umm Maktum, and observe your 'Iddah there.'\" Al-Aswad hit him (Ash-Sha'bi) with a pebble and said: \"Woe be to you! Why do you issue such a Fatwa? 'Umar said: 'If you bring two witnesses who will testify that they heard that from the Messenger of Allah (we will believe you), otherwise, we will not leave the Book of Allah for the word of a woman.' 'And turn them not out of their (husband's) homes nor shall they (themselves) leave, except in case they are guilty of some open Fahishah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20578",
        "20595",
        "11049",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1861",
      "hadith_no": "1861",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا يحيى بن آدم، عن شريك، عن أبي حمزة، عن الشعبي، عن فاطمة بنت قيس، أنها سمعته - تعني النبي،  صلى الله عليه وسلم  - يقول ‏\"‏ ليس في المال حق سوى الزكاة ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais narrated that:                     she heard him, meaning the Prophet say: “There is nothing due on wealth other then Zakat.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20364",
        "20587",
        "20458",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1942",
      "hadith_no": "1942",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا سفيان، عن أبي بكر بن أبي الجهم بن صخير العدوي، قال سمعت فاطمة بنت قيس، تقول قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا حللت فآذنيني ‏\"‏ ‏.‏ فآذنته فخطبها معاوية وأبو الجهم بن صخير وأسامة بن زيد فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أما معاوية فرجل ترب لا مال له وأما أبو الجهم فرجل ضراب للنساء ولكن أسامة ‏\"‏ ‏.‏ فقالت بيدها هكذا أسامة أسامة ‏.‏ فقال لها رسول الله  صلى الله عليه وسلم  ‏\"‏ طاعة الله وطاعة رسوله خير لك ‏\"‏ ‏.‏ قالت فتزوجته فاغتبطت به ‏.‏",
      "text_en": " It was narrated that:                     Abu Bakr bin Abu Jahm bin Sukhair Al-Adawi said: “I heard Fathima bint Qais say: 'The Messenger of Allah said to me: “When you become lawful, tell me.” So I told him.' Then Muawiyah, Abu Jahm bin Sukhair and Usamah bin Zaid proposed marriage to her. The Messenger of Allah said: 'As for Muawiyah, he is a poor man who has no money. As from Abu Jahm he is a man who habitually beats woman. But Usamah (is good).' She gestured with her hand, saying: 'Usamah, Usaman!?' The Messenger of Allah said to her: 'Obedience to Allah and obedience to His Messenger is better for you.' She said: 'So I married him and I was pleased with him.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "224"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2113",
      "hadith_no": "2113",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا سفيان، عن أبي بكر بن أبي الجهم بن صخير العدوي، قال سمعت فاطمة بنت قيس، تقول إن زوجها طلقها ثلاثا فلم يجعل لها رسول الله  صلى الله عليه وسلم  سكنى ولا نفقة ‏.‏",
      "text_en": " It was narrated that Abu Bakr bin Abu Jahm bin Sukhair Al-'Adawi said:                     \"I heard Fatimah bint Qais say that her husband divorced her ttree times, and the Messenger of Allah (ﷺ) did not say that she was entitled to accommodation and maintenance.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "224"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4212",
      "hadith_no": "4212",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل بن أبي خالد، عن مجالد، عن الشعبي، عن فاطمة بنت قيس، قالت صلى رسول الله  صلى الله عليه وسلم  ذات يوم وصعد المنبر وكان لا يصعد عليه قبل ذلك إلا يوم الجمعة فاشتد ذلك على الناس فمن بين قائم وجالس فأشار إليهم بيده أن اقعدوا ‏\"‏ فإني والله ما قمت مقامي هذا لأمر ينفعكم لرغبة ولا لرهبة ولكن تميما الداري أتاني فأخبرني خبرا منعني القيلولة من الفرح وقرة العين فأحببت أن أنشر عليكم فرح نبيكم ألا إن ابن عم لتميم الداري أخبرني أن الريح ألجأتهم إلى جزيرة لا يعرفونها فقعدوا في قوارب السفينة فخرجوا فيها فإذا هم بشىء أهدب أسود قالوا له ما أنت قال أنا الجساسة ‏.‏ قالوا أخبرينا ‏.‏ قالت ما أنا بمخبرتكم شيئا ولا سائلتكم ولكن هذا الدير قد رمقتموه فأتوه فإن فيه رجلا بالأشواق إلى أن تخبروه ويخبركم فأتوه فدخلوا عليه فإذا هم بشيخ موثق شديد الوثاق يظهر الحزن شديد التشكي فقال لهم من أين قالوا من الشام ‏.‏ قال ما فعلت العرب قالوا نحن قوم من العرب عم تسأل قال ما فعل هذا الرجل الذي خرج فيكم قالوا خيرا ناوى قوما فأظهره الله عليهم فأمرهم اليوم جميع إلههم واحد ودينهم واحد قال ما فعلت عين زغر قالوا خيرا يسقون منها زروعهم ويستقون منها لسقيهم قال فما فعل نخل بين عمان وبيسان قالوا يطعم ثمره كل عام ‏.‏ قال فما فعلت بحيرة الطبرية قالوا تدفق جنباتها من كثرة الماء ‏.‏ قال فزفر ثلاث زفرات ثم قال لو انفلت من وثاقي هذا لم أدع أرضا إلا وطئتها برجلى هاتين إلا طيبة ليس لي عليها سبيل ‏\"‏ ‏.‏ قال النبي  صلى الله عليه وسلم  ‏\"‏ إلى هذا ينتهي فرحي هذه طيبة والذي نفسي بيده ما فيها طريق ضيق ولا واسع ولا سهل ولا جبل إلا وعليه ملك شاهر سيفه إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Fatimah bint Qais said:                      \"The Messenger ofAllah(ﷺ) prayed one day, and ascended the pulpit, and he neverused toascend it, before that, except on Fridays. The people werealarmed bythat, and some were standing and some were sitting. Hegestured tothem with his hand, telling them to sit. (Then he said:)'By Allah, Iam not standing here for something that will benefityou, anexhortation or warning. Rather Tamim Dari has come to me andtold mesomething that prevented me from taking a rest because of thejoy anddelight (I felt), and I wanted to spread that joy among you.A cousinof Tamim Dari told me that the wind drove them to an islandthat theydid not know, so they sat in the rowing boats of the shipand set out.There they saw something black, with long eyelashes.They said to it:\"What are you?\" It said: \"I amJassasah,\" They said: \"Tell us.\" Itsaid: \"I willnot tell you anything or ask you anything. Rather thereis thismonastery that you have looked at. Go to it, for there is aman therewho is longing to hear your news and tell you news.\" So theywent there and entered upon him, and they saw an old man firmlyshackled, with a sorrowful appearance and complaining a great deal.Hesaid to them: \"Where have you come from?\" They said:\"From Sham.\" Hesaid: \"How are the Arabs faring?\"They said: \"We are from among theArabs. What do you want to askabout?\" He said: \"What has this mandone who has appearedamong you?\" They said: \"(He has done) well. Hemade enemiesof some people, but Allah supported him against them andnow theyhave become one, with one God and one religion.\" He said:\"Whathappened to the spring of Zughar?\" They said: \"It is good;weirrigate out crops from it and drink from it.\" He said: \"Whathappenedto the date-palms between 'Amman and Baisan?\" Theysaid: \"They bearfruit every year.\" He said: \"Whathappened to the Lake of Tiberias?\"They said: \"It overflowsbecause of the abundance of water.\" He gavethree deep sighs,then he said: \"If I were to free myself from thesechains, Iwould not leave any land without entering it on these twofeet ofmine, except for Taibah, for I have no way to enter it.\" TheProphet (ﷺ) said: 'My joy is so great. This (Al-Madinah) is Taibah,and by the One in Whose Hand is my soul, there is no narrow or broadroad in it, or any plain or mountain, but there is an angel(standing)over it with his sword unsheathed, until the Day ofResurrection.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11418",
        "10820",
        "11052",
        "224"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 39,
  "grade_display": {
    "en": "Companion (RA) [1st Generation]",
    "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
    "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
  }
}