{
  "id": "227",
  "name": "Abu Burzah al-Aslami ( أبو برزة الأسلمي ( رضي الله عنه",
  "full_name": "Abu Burzah al-Aslami ( أبو برزة الأسلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "HIjaz"
    },
    "death": {
      "date_hijri": "65",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Basra",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Governor"
    ],
    "tags": [
      "al-Aslami",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "19028",
      "name": "al-Mughira bin Abi Brzh المغيرة بن أبي برزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19028",
      "name": "al-Mughira bin Abi Brzh المغيرة بن أبي برزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19527",
      "name": "Munyah bint 'Ubaid bin Abi Burzah منية بنت عبيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11290",
      "name": "Siyar bin Salaama, Abu al-Minhal سيار بن سلامة الرياحي أبو المنهال",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11574",
      "name": "al-Azrq bin Qays al-Harithy الأزرق بن قيس الحارثي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11424",
      "name": "Rafi' bin Mahran Abi al-Aliya رفيع بن مهران أبي العالية الرياحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10713",
      "name": "Knanh bin N'ym al-Dwy كنانة بن نعيم العدوي أبو بكر البصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18490",
      "name": "'Aabad bin Nsyb عباد بن نسيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11617",
      "name": "Abu al-Swar al-Dwy al-'Abbassri أبو السوار العدوي البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "14242",
      "name": "Abd al-Salam bin Aby عبد السلام بن أبي حازم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-541",
      "hadith_no": "541",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي المنهال، عن أبي برزة، كان النبي صلى الله عليه وسلم يصلي الصبح وأحدنا يعرف جليسه، ويقرأ فيها ما بين الستين إلى المائة، ويصلي الظهر إذا زالت الشمس، والعصر وأحدنا يذهب إلى أقصى المدينة ثم يرجع والشمس حية، ونسيت ما قال في المغرب، ولا يبالي بتأخير العشاء إلى ثلث الليل‏.‏ ثم قال إلى شطر الليل‏.‏ وقال معاذ قال شعبة ثم لقيته مرة فقال أو ثلث الليل‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     Abu Barza said, \"The Prophet used to offer the Fajr (prayer) when one could recognize the person sitting by him (after the prayer) and he used to recite between 60 to 100 Ayat (verses) of the Qur'an. He used to offer the Zuhr prayer as soon as the sun declined (at noon) and the `Asr at a time when a man might go and return from the farthest place in Medina and find the sun still hot. (The sub-narrator forgot what was said about the Maghrib). He did not mind delaying the `Isha prayer to one third of the night or the middle of the night.\"",
      "usc_msa_ref": "516",
      "chain": [
        "30329",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "id": "sahih-bukhari-568",
      "hadith_no": "568",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا عبد الوهاب الثقفي، قال حدثنا خالد الحذاء، عن أبي المنهال، عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يكره النوم قبل العشاء والحديث بعدها‏.‏",
      "text_en": " Narrated Abu Barza:                     Allah's Apostle disliked to sleep before the `Isha' prayer and to talk after it.",
      "usc_msa_ref": "543",
      "chain": [
        "30376",
        "20259",
        "11282",
        "11290",
        "227"
      ]
    },
    {
      "id": "sahih-bukhari-7357",
      "hadith_no": "7357",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن صباح، حدثنا معتمر، قال سمعت عوفا، أن أبا المنهال، حدثه أنه، سمع أبا برزة، قال إن الله يغنيكم أو نغشكم بالإسلام وبمحمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abal Minhal:                     Abu Barza said, \"(O people!) Allah makes you self-sufficient or has raised you high with Islam and with Muhammad",
      "usc_msa_ref": "376",
      "chain": [
        "30142",
        "20288",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-461-2",
      "hadith_no": "461",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن التيمي، عن أبي المنهال، عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الغداة من الستين إلى المائة ‏.‏",
      "text_en": " Abu Barza reported:                      The Messenger of Allah (may peace be upon him) used to recite in the morning prayer from sixty to one hundred verses.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-461-3",
      "hadith_no": "461",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن خالد الحذاء، عن أبي المنهال، عن أبي برزة الأسلمي، قال كان رسول الله صلى الله عليه وسلم يقرأ في الفجر ما بين الستين إلى المائة آية ‏.‏",
      "text_en": " Abu Barza Aslami reported:                      The Messenger of Allah (may peace be upon him) used to recite from sixty to one hundred verses in the morning prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20012",
        "11282",
        "11290",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-1495",
      "hadith_no": "1495",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سيار بن سلامة، قال سمعت أبا برزة، يقول كان رسول الله صلى الله عليه وسلم لا يبالي بعض تأخير صلاة العشاء إلى نصف الليل وكان لا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته مرة أخرى فقال أو ثلث الليل ‏.‏",
      "text_en": " Sayyar b. Salama reported:                      I heard Abu Barza saying that the Messenger of Allah (may peace be upon him) did not mind some delay in the 'Isha' prayer even up to midnight and he did not like sleeping before (observing it) and talking after it. Shu'ba said: I again met him (Sayyar b. Salama) for the second time and he said: Even up to the third (part) of the night.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-6512",
      "hadith_no": "6512",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن عمر بن سليط، حدثنا حماد بن سلمة، عن ثابت، عن كنانة، بن نعيم عن أبي برزة، أن النبي صلى الله عليه وسلم كان في مغزى له فأفاء الله عليه فقال لأصحابه ‏\"‏ هل تفقدون من أحد ‏\"‏ ‏.‏ قالوا نعم فلانا وفلانا وفلانا ‏.‏ ثم قال ‏\"‏ هل تفقدون من أحد ‏\"‏ ‏.‏ قالوا نعم فلانا وفلانا وفلانا ‏.‏ ثم قال ‏\"‏ هل تفقدون من أحد ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ لكني أفقد جليبيبا فاطلبوه ‏\"‏ ‏.‏ فطلب في القتلى فوجدوه إلى جنب سبعة قد قتلهم ثم قتلوه فأتى النبي صلى الله عليه وسلم فوقف عليه فقال ‏\"‏ قتل سبعة ثم قتلوه هذا مني وأنا منه هذا مني وأنا منه ‏\"‏ ‏.‏ قال فوضعه على ساعديه ليس له إلا ساعدا النبي صلى الله عليه وسلم قال فحفر له ووضع في قبره ‏.‏ ولم يذكر غسلا ‏.‏",
      "text_en": " Abu Barza reported that Allah's Apostle (may peace be upon him) was there in a battlefield that Allah conferred upon him the spoils of war. He said to his Companions:                      Is anyone missing amongst you? They said: So and so and so. He again said: Is there anyone missing amongst you? They said: So and so and so. He then said: Is there anyone missing amongst you? They said: No. Thereupon he (the Holy Prophet) said: But I am missing Julaibib. They (his Companions) searched him amongst those who had been killed and they found him by the side of seven (dead bodies) whom he had killed and he had been killed (by the oppoments). Allah's Apostle (may peace be upon him) came there and stood (by his side) and said: He killed seven (persons). Then (his opponents) killed him. He is mine and I am his. He then placed him upon his hands and there was none else to lift but Allah's Apostle (may peace be upon him). Then the grave was dug for him and he was placed in the grave and no mention is made of a bath.",
      "usc_msa_ref": "",
      "chain": [
        "30427",
        "20021",
        "11269",
        "10713",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-6659",
      "hadith_no": "6659",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا مهدي بن ميمون، عن أبي الوازع، جابر بن عمرو الراسبي سمعت أبا برزة، يقول بعث رسول الله صلى الله عليه وسلم رجلا إلى حى من أحياء العرب فسبوه وضربوه فجاء إلى رسول الله صلى الله عليه وسلم فأخبره فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو أن أهل عمان أتيت ما سبوك ولا ضربوك ‏\"‏ ‏.‏",
      "text_en": " Abu Barza reported that Allah's Messenger (may peace be upon him) sent a person to a tribe amongst the tribes of Arabia. They reviled him and beat him. He came to Allah's Messenger (may peace be upon him) and narrated to him (the story of atrocities perpetrated upon him by the people of the tribe). Thereupon he (the Holy Prophet) said:                      If you were to come to the people of 'Uman, they would have neither reviled you nor beaten you.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "11307",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-6771",
      "hadith_no": "6771",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كامل الجحدري، فضيل بن حسين حدثنا يزيد، - يعني ابن زريع - حدثنا التيمي، عن أبي عثمان، عن أبي برزة الأسلمي، قال بينما جارية على ناقة عليها بعض متاع القوم إذ بصرت بالنبي صلى الله عليه وسلم وتضايق بهم الجبل فقالت حل اللهم العنها ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ لا تصاحبنا ناقة عليها لعنة ‏\"‏ ‏.‏",
      "text_en": " Abu Burza al-Aslami reported that a slave-girl was riding a dromedary and there was also the luggage of people upon it. that she suddenly saw Allah's Apostle (may peace be upon him). The way of the mountain was narrow and she said (to that dromedary):                      Go ahead (but that dromedary did not move). She (that slave-girl), out of anger, said: O Allah, let that (dromedary) be damned. Thereupon Allah's Apostle (may peace be upon him) said: Let the dromedary on which the curse has been invoked not proceed with us.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20304",
        "11289",
        "11113",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-6839",
      "hadith_no": "6839",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن أبان بن صمعة، حدثني أبو الوازع حدثني أبو برزة، قال قلت يا نبي الله علمني شيئا أنتفع به قال ‏\"‏ اعزل الأذى عن طريق المسلمين ‏\"‏ ‏.‏",
      "text_en": " Abu Barza reported:                      I said: Allah's Messenger, teach me something so that I may derive benefit from it. He said: Remove the troublesome thing from the paths of the Muslims.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20031",
        "20529",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-6840",
      "hadith_no": "6840",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو بكر بن شعيب بن الحبحاب، عن أبي الوازع، الراسبي عن أبي برزة الأسلمي، أن أبا برزة، قال قلت لرسول الله صلى الله عليه وسلم يا رسول الله إني لا أدري لعسى أن تمضي وأبقى بعدك فزودني شيئا ينفعني الله به ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ افعل كذا افعل كذا - أبو بكر نسيه - وأمر الأذى عن الطريق ‏\"‏ ‏.‏",
      "text_en": " Abu Barza reported that he said to Allah's Messenger (may peace be upon him):                      Allah's Messenger, I do not know whether I would survive after you, so confer upon me something by which Allah should benefit me. Thereupon Allah's Messenger (may peace be upon him) said: Do this and that and remove the troublesome things from the paths.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20575",
        "227",
        "227"
      ]
    },
    {
      "id": "sunan-abi-daud-398",
      "hadith_no": "398",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي المنهال، عن أبي برزة، قال كان رسول الله صلى الله عليه وسلم يصلي الظهر إذا زالت الشمس ويصلي العصر وإن أحدنا ليذهب إلى أقصى المدينة ويرجع والشمس حية ونسيت المغرب وكان لا يبالي تأخير العشاء إلى ثلث الليل ‏.‏ قال ثم قال إلى شطر الليل ‏.‏ قال وكان يكره النوم قبلها والحديث بعدها وكان يصلي الصبح وما يعرف أحدنا جليسه الذي كان يعرفه وكان يقرأ فيها من الستين إلى المائة ‏.‏",
      "text_en": " Abu Barzah reported:                      The Messenger of Allah (ﷺ) would offer the Zuhr prayer when the sun had passed the meridian; he would offer 'Asr prayer after which one of us would visit the skirts of Medina and return him while the sun was still bright; I forgot what he said about the Maghrib prayer; he did not fear postponing the Isha prayer until a third of night had passed, or he said: until the midnight had passed. He would dislike sleeping before it or talking after it. And he would offer the Fajr prayer when a man could recognize his neighbor whom he recognized well; and he would recite from sixty to a hundred verses during it.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-abi-daud-3186",
      "hadith_no": "3186",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو كامل، حدثنا أبو عوانة، عن أبي بشر، حدثني نفر، من أهل البصرة عن أبي برزة الأسلمي، أن رسول الله صلى الله عليه وسلم لم يصل على ماعز بن مالك ولم ينه عن الصلاة عليه ‏.‏",
      "text_en": " Narrated AbuBarzah al-Aslami:                     The Messenger of Allah (ﷺ) did not pray over Ma'iz ibn Malik, and he did not prohibit to pray over him.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11419",
        "227"
      ]
    },
    {
      "id": "sunan-abi-daud-4849",
      "hadith_no": "4849",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عوف، قال حدثني أبو المنهال، عن أبي برزة، قال كان رسول الله صلى الله عليه وسلم ينهى عن النوم قبلها والحديث بعدها ‏.‏",
      "text_en": " ABU BARZAH SAID:                      THE APOSTLE OF ALLAH(MAY PEACE BE UPON HIM) FORBADE SLEEPING BEFORE THE NIGHT PRAYER AND TALKING AFTER IT.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-abi-daud-4859",
      "hadith_no": "4859",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن حاتم الجرجرائي، وعثمان بن أبي شيبة، - المعنى - أن عبدة بن سليمان، أخبرهم عن الحجاج بن دينار، عن أبي هاشم، عن أبي العالية، عن أبي برزة الأسلمي، قال كان رسول الله صلى الله عليه وسلم يقول بأخرة إذا أراد أن يقوم من المجلس ‏\"‏ سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ فقال رجل يا رسول الله إنك لتقول قولا ما كنت تقوله فيما مضى ‏.‏ قال ‏\"‏ كفارة لما يكون في المجلس ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBarzah al-Aslami:                     When the Messenger of Allah (ﷺ) intended to get up from the assembly he used to say in the last. Glory be to Thee. O Allah, and I begin with praise of Thee, I testify that there is no god but Thou; I ask Thy pardon, and return to Thee in repentance. The man asked: Messenger of Allah! you utter the words now which you did not do in the past? He replied: (This is an) atonement for what takes place in the assembly.",
      "usc_msa_ref": "",
      "chain": [
        "38489",
        "30203",
        "20337",
        "20737",
        "11454",
        "11618",
        "227"
      ]
    },
    {
      "id": "sunan-abi-daud-4880",
      "hadith_no": "4880",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا الأسود بن عامر، حدثنا أبو بكر بن عياش، عن الأعمش، عن سعيد بن عبد الله بن جريج، عن أبي برزة الأسلمي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر من آمن بلسانه ولم يدخل الإيمان قلبه لا تغتابوا المسلمين ولا تتبعوا عوراتهم فإنه من اتبع عوراتهم يتبع الله عورته ومن يتبع الله عورته يفضحه في بيته ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBarzah al-Aslami:                     The Prophet (ﷺ) said: O community of people, who believed by their tongue, and belief did not enter their hearts, do not back-bite Muslims, and do not search for their faults, for if anyone searches for their faults, Allah will search for his fault, and if Allah searches for the fault of anyone, He disgraces him in his house.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20380",
        "20373",
        "11060",
        "227"
      ]
    },
    {
      "id": "jami-al-tirmidhi-168",
      "hadith_no": "168",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا عوف، قال أحمد وحدثنا عباد بن عباد، هو المهلبي وإسماعيل ابن علية جميعا عن عوف، عن سيار بن سلامة، هو أبو المنهال الرياحي عن أبي برزة، قال كان النبي صلى الله عليه وسلم يكره النوم قبل العشاء والحديث بعدها ‏.‏ قال وفي الباب عن عائشة وعبد الله بن مسعود وأنس ‏.‏ قال أبو عيسى حديث أبي برزة حديث حسن صحيح ‏.‏ وقد كره أكثر أهل العلم النوم قبل صلاة العشاء والحديث بعدها ورخص في ذلك بعضهم ‏.‏ وقال عبد الله بن المبارك أكثر الأحاديث على الكراهية ‏.‏ ورخص بعضهم في النوم قبل صلاة العشاء في رمضان ‏.‏ وسيار بن سلامة هو أبو المنهال الرياحي ‏.‏",
      "text_en": " Abu Barzah narrated:                     \"The Prophet would dislike to sleep before Isha and to talk after it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11298",
        "30007",
        "20243",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2602",
      "hadith_no": "2602",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا الأسود بن عامر، حدثنا أبو بكر بن عياش، عن الأعمش، عن سعيد بن عبد الله بن جريج، عن أبي برزة الأسلمي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزول قدما عبد يوم القيامة حتى يسأل عن عمره فيما أفناه وعن علمه فيما فعل وعن ماله من أين اكتسبه وفيما أنفقه وعن جسمه فيما أبلاه ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وسعيد بن عبد الله بن جريج هو بصري وهو مولى أبي برزة وأبو برزة اسمه نضلة بن عبيد ‏.‏",
      "text_en": " Abu Barzah Al-Aslami narrated that the Messenger of Allah (s.a.w) said:                     \"The feet of the slave of Allah shall not move [on the Day of Judgement] until he is asked about five things: about his life and what he did with it, about his knowledge and what he did with it, about his wealth and how he earned it and where he spent it on, about his body and for what did he wear it out.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20380",
        "20373",
        "11060",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-948",
      "hadith_no": "948",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا سليمان التيمي، عن سيار، - يعني ابن سلامة - عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الغداة بالستين إلى المائة ‏.‏",
      "text_en": " It was narrated from Abu Barzah that:                     The Messenger of Allah (ﷺ) used to recite between sixty and one hundred verses in Al-Ghadah (Subh) prayer.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20472",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4071",
      "hadith_no": "4071",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا معاذ بن معاذ، قال حدثنا شعبة، عن توبة العنبري، عن عبد الله بن قدامة بن عنزة، عن أبي برزة الأسلمي، قال أغلظ رجل لأبي بكر الصديق فقلت أقتله فانتهرني وقال ليس هذا لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"A man spoke harshly to Abu Bakr As-Siddiq, and I said: 'Shall I kill him?' He told me off, and said: 'That is not for anyone after the Messenger of Allah [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20286",
        "20020",
        "11579",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4072",
      "hadith_no": "4072",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أبي برزة، قال تغيظ أبو بكر على رجل فقلت من هو يا خليفة رسول الله قال لم قلت لأضرب عنقه إن أمرتني بذلك ‏.‏ قال أفكنت فاعلا قلت نعم ‏.‏ قال فوالله لأذهب عظم كلمتي التي قلت غضبه ثم قال ما كان لأحد بعد محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah said:                     \"Abu Bakr got infuriated with a man, and I said: 'Who is he, O Khalifah of the Messenger of Allah?' He said: 'Why?' I said: 'So that I might strike his neck (killing him) if you tell me to.' He said: 'Would you really do that?' I said: 'Yes. By Allah,' the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "11342",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4073",
      "hadith_no": "4073",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يعلى، قال حدثنا الأعمش، عن عمرو بن مرة، عن أبي البختري، عن أبي برزة، قال مررت على أبي بكر وهو متغيظ على رجل من أصحابه فقلت يا خليفة رسول الله من هذا الذي تغيظ عليه قال ولم تسأل قلت أضرب عنقه ‏.‏ قال فوالله لأذهب عظم كلمتي غضبه ثم قال ما كانت لأحد بعد محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah said:                     \"I passed by Abu Bakr and he was furious with one of his companions. I said: 'O Khalifah of the Messenger of Allah, who is the one with whom you are furious?' He said: 'Why are you asking about him?' I said: 'I will strike his neck (kill him).' By Allah, the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20372",
        "11060",
        "11381",
        "11347",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4074",
      "hadith_no": "4074",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، عن يحيى بن حماد، قال حدثنا أبو عوانة، عن سليمان، عن عمرو بن مرة، عن أبي البختري، عن أبي برزة، قال تغيظ أبو بكر على رجل فقال لو أمرتني لفعلت ‏.‏ قال أما والله ما كانت لبشر بعد محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah said:                     \"Abu Bakr became infuriated with a man.\" He said: \"If you tell me to, I will do it.\" He said: \"By Allah, that is not for any human being after Muhammad [SAW].\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20574",
        "20469",
        "11060",
        "11381",
        "11347",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4075",
      "hadith_no": "4075",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا معاوية بن صالح الأشعري، قال حدثنا عبد الله بن جعفر، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن أبي نضرة، عن أبي برزة، قال غضب أبو بكر على رجل غضبا شديدا حتى تغير لونه قلت يا خليفة رسول الله والله لئن أمرتني لأضربن عنقه فكأنما صب عليه ماء بارد فذهب غضبه عن الرجل ‏.‏ قال ثكلتك أمك أبا برزة وإنها لم تكن لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب أبو نصر واسمه حميد بن هلال خالفه شعبة ‏.‏",
      "text_en": " It was narrated from Abu Nadrah, that Abu Barzah said:                     \"Abu Bakr got very angry with a man, so much so that his color changed. I said: 'O Khalifah of the Messenger of Allah, if you tell me to, I will strike his neck (kill him).' It was as if cold water had been poured on him and he became calm. He said: 'May your mother be bereft of you, Abu Barzah! That is not for anyone after the Messenger of Allah [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "37535",
        "108",
        "11201",
        "15",
        "11381",
        "10721",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4076",
      "hadith_no": "4076",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، عن أبي داود، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا نصر، يحدث عن أبي برزة، قال أتيت على أبي بكر وقد أغلظ لرجل فرد عليه فقلت ألا أضرب عنقه فانتهرني ‏.‏ فقال إنها ليست لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن أبو نصر حميد بن هلال ‏.‏ ورواه عنه يونس بن عبيد فأسنده ‏.‏",
      "text_en": " Abu Nasr narrated from Abu Barzah, that he said:                     \"I came to Abu Bakr when he had spoken harshly to a man who had answered back. I said: 'Shall I not strike his neck (kill him)?' He rebuked me, and said: 'That is not for anyone after the Messenger of Allah [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11381",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4077",
      "hadith_no": "4077",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني أبو داود، قال حدثنا عفان، قال حدثنا يزيد بن زريع، قال حدثنا يونس بن عبيد، عن حميد بن هلال، عن عبد الله بن مطرف بن الشخير، عن أبي برزة الأسلمي، أنه قال كنا عند أبي بكر الصديق فغضب على رجل من المسلمين فاشتد غضبه عليه جدا فلما رأيت ذلك قلت يا خليفة رسول الله أضرب عنقه فلما ذكرت القتل أضرب عن ذلك الحديث أجمع إلى غير ذلك من النحو فلما تفرقنا أرسل إلى فقال يا أبا برزة ما قلت ونسيت الذي قلت قلت ذكرنيه ‏.‏ قال أما تذكر ما قلت قلت لا والله ‏.‏ قال أرأيت حين رأيتني غضبت على رجل فقلت أضرب عنقه يا خليفة رسول الله أما تذكر ذلك أوكنت فاعلا ذلك قلت نعم والله والآن إن أمرتني فعلت ‏.‏ قال والله ما هي لأحد بعد محمد صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن هذا الحديث أحسن الأحاديث وأجودها والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated from Yunus bin 'Ubaid, from Humaid bin Hilal, from 'Abdullah bin Mutarrif bin Ash-Shikhkhir, from Abu Barzah Al-Aslami, that he said:                     \"We were with Abu Bakr As-Siddiq, and he got angry with a man from among the Muslims, and became very angry indeed. When I saw that, I said: 'O Khalifah of the Messenger of Allah, shall I strike his neck?' When I mentioned killing him, he stopped being angry with him and changed the subject. When we parted, he sent for me and said: 'O Abu Barzah, what did you say?' I said: 'I have forgotten what I said; remind me.' He said: 'Do you not remember what you said?' I said: 'No, by Allah.' He said: 'Don't you remember, when you saw me angry with a man, and said, 'I will strike his neck O Khalifah of the Messenger of Allah?' Don't you remember that? Would you really have done that?' I said: 'Yes, by Allah, and if you tell me to do it now, I will do it.' He said: 'By Allah, that is not for anyone after Muhammad [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "30106",
        "20304",
        "11075",
        "11281",
        "227"
      ]
    },
    {
      "id": "sunan-ibn-majah-674-2",
      "hadith_no": "674",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن عوف بن أبي جميلة، عن سيار بن سلامة، عن أبي برزة الأسلمي، قال كان النبي  صلى الله عليه وسلم  يصلي صلاة الهجير التي تدعونها الظهر إذا دحضت الشمس ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"The Prophet used to pray the Hajir prayer, which you call 'Zuhr', when the sun had passed its zenith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-ibn-majah-701-2",
      "hadith_no": "701",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وعبد الوهاب، قالوا حدثنا عوف، عن أبي المنهال، سيار بن سلامة عن أبي برزة الأسلمي، قال كان رسول الله  صلى الله عليه وسلم  يستحب أن يؤخر العشاء وكان يكره النوم قبلها والحديث بعدها ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"The Messenger of Allah used to like to delay the 'Isha', and he disliked sleeping before it, and engaging in conversation after it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20259",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-ibn-majah-867",
      "hadith_no": "867",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عباد بن العوام، عن عوف، عن أبي المنهال، عن أبي برزة، ح وحدثنا سويد، حدثنا معتمر بن سليمان، عن أبيه، حدثه أبو المنهال، عن أبي برزة، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في الفجر ما بين الستين إلى المائة ‏.‏",
      "text_en": " It wasnarrated from Abu Barzah that the Messenger of Allah (ﷺ)used torecite between sixty and one hundred (Verses) in Fajr prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20431",
        "11298",
        "11290",
        "227",
        "20288",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-ibn-majah-1552",
      "hadith_no": "1552",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرني عمرو بن النعمان، حدثنا علي بن الحزور، عن نفيع، عن عمران بن الحصين، وأبي، برزة قالا خرجنا مع رسول الله  صلى الله عليه وسلم  في جنازة فرأى قوما قد طرحوا أرديتهم يمشون في قمص فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أبفعل الجاهلية تأخذون - أو بصنع الجاهلية تشبهون - لقد هممت أن أدعو عليكم دعوة ترجعون في غير صوركم ‏\"‏ ‏.‏ قال فأخذوا أرديتهم ولم يعودوا لذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Imran bin Husain and Abu Barzah said:                      “We wentoutwith the Messenger of Allah (ﷺ) to attend a funeral, and he sawsome people who had cast aside their upper sheets and were walking intheir shirts only. The Messenger of Allah (ﷺ) said: ‘Are youadopting the practice of the days of ignorance?’ or; ‘Are youimitating the behaviour of the days of ignorance? I was about tosupplicate against you that you would return in a different form.’Sothey put their sheets back on and never did that again.”",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "15383",
        "227"
      ]
    },
    {
      "id": "sunan-ibn-majah-2266",
      "hadith_no": "2266",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن عبدة، وأحمد بن المقدام، قالا حدثنا حماد بن زيد، عن جميل بن مرة، عن أبي الوضيء، عن أبي برزة الأسلمي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ البيعان بالخيار ما لم يتفرقا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Barzah Al-Aslami that the Messenger of Allah (ﷺ) said:                     ”The two parties to a transaction have the choice (of annulling it) so long as they have not yet parted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "30121",
        "20022",
        "227"
      ]
    },
    {
      "id": "sunan-ibn-majah-3681-2",
      "hadith_no": "3681",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن أبان بن صمعة، عن أبي الوازع الراسبي، عن أبي برزة الأسلمي، قال قلت يا رسول الله دلني على عمل أنتفع به ‏.‏ قال ‏\"‏ اعزل الأذى عن طريق المسلمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"O Messenger of Allah! Tell me of an action by which I may benefit.' He said: 'Remove harmful things from the path of the Muslims.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20529",
        "227"
      ]
    }
  ],
  "total_hadiths": 32
}