{
  "id": "229",
  "name": "Abu Talha Ansari ( أبو طلحة الأنصاري زيد بن سهل بن الأسود ( رضي الله عنه",
  "full_name": "Abu Talha Ansari ( أبو طلحة الأنصاري زيد بن سهل بن الأسود ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "34",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "Aqaba 2",
      "Ridwan",
      "Badr",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "83",
      "name": "Umm Sulaym bint Milhan ( أم سليم بنت ملحان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "219",
      "name": "Abu 'Umair bin Abi Talha ( أبو عمير بن أبي طلحة زيد بن سهل الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "422",
      "name": "'Abdullah bin Abi Talha ( عبد الله بن أبي طلحة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "422",
      "name": "'Abdullah bin Abi Talha ( عبد الله بن أبي طلحة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3625",
      "name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3195",
      "name": "'Abdur Rahman bin 'Abd al-Qari ( عبد الرحمن بن عبد القاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11151",
      "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3065",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا روح بن عبادة، حدثنا سعيد، عن قتادة، قال ذكر لنا أنس بن مالك عن أبي طلحة  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه كان إذا ظهر على قوم أقام بالعرصة ثلاث ليال‏.‏ تابعه معاذ وعبد الأعلى حدثنا سعيد عن قتادة عن أنس عن أبي طلحة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Talha:                     Whenever the Prophet conquered some people, he would stay in their town for three days.",
      "chain": [
        "30272",
        "20229",
        "11168",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "3322",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال حفظته من الزهري كما أنك ها هنا أخبرني عبيد الله عن ابن عباس عن أبي طلحة  رضى الله عنهم  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Talha:                     The Prophet said, \"Angels do not enter a house that has either a dog or a picture in it.\"",
      "chain": [
        "30026",
        "20005",
        "11201",
        "17",
        "229"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، سمع روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن قتادة، قال ذكر لنا أنس بن مالك عن أبي طلحة، أن نبي الله صلى الله عليه وسلم أمر يوم بدر بأربعة وعشرين رجلا من صناديد قريش فقذفوا في طوي من أطواء بدر خبيث مخبث، وكان إذا ظهر على قوم أقام بالعرصة ثلاث ليال، فلما كان ببدر اليوم الثالث، أمر براحلته فشد عليها رحلها، ثم مشى واتبعه أصحابه وقالوا ما نرى ينطلق إلا لبعض حاجته، حتى قام على شفة الركي، فجعل يناديهم بأسمائهم وأسماء آبائهم ‏\"‏ يا فلان بن فلان، ويا فلان بن فلان، أيسركم أنكم أطعتم الله ورسوله فإنا قد وجدنا ما وعدنا ربنا حقا، فهل وجدتم ما وعد ربكم حقا ‏\"‏‏.‏ قال فقال عمر يا رسول الله، ما تكلم من أجساد لا أرواح لها فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفس محمد بيده، ما أنتم بأسمع لما أقول منهم ‏\"‏‏.‏ قال قتادة أحياهم الله حتى أسمعهم قوله توبيخا وتصغيرا ونقيمة وحسرة وندما‏.‏",
      "text_en": " Narrated Abu Talha:                     On the day of Badr, the Prophet ordered that the corpses of twenty four leaders of Quraish should be thrown into one of the dirty dry wells of Badr. (It was a habit of the Prophet that whenever he conquered some people, he used to stay at the battle-field for three nights. So, on the third day of the battle of Badr, he ordered that his she-camel be saddled, then he set out, and his companions followed him saying among themselves.\" \"Definitely he (i.e. the Prophet) is proceeding for some great purpose.\" When he halted at the edge of the well, he addressed the corpses of the Quraish infidels by their names and their fathers' names, \"O so-and-so, son of so-and-so and O so-and-so, son of so-andso! Would it have pleased you if you had obeyed Allah and His Apostle? We have found true what our Lord promised us. Have you too found true what your Lord promised you? \"`Umar said, \"O Allah's Apostle! You are speaking to bodies that have no souls!\" Allah's Apostle said, \"By Him in Whose Hand Muhammad's soul is, you do not hear, what I say better than they do.\" (Qatada said, \"Allah brought them to life (again) to let them hear him, to reprimand them and slight them and take revenge over them and caused them to feel remorseful and regretful.\")",
      "chain": [
        "30351",
        "20229",
        "11073",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "4117",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس، عن أبي طلحة  رضى الله عنهما  قال كنت فيمن تغشاه النعاس يوم أحد، حتى سقط سيفي من يدي مرارا، يسقط وآخذه، ويسقط فآخذه‏.‏",
      "text_en": "",
      "chain": [
        "30132",
        "20304",
        "11168",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "6013",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا آدم، حدثنا ابن أبي ذئب، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، عن أبي طلحة  رضى الله عنهم  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا تصاوير ‏\"‏‏.‏",
      "text_en": " Narrated Abu Talha:                     The Prophet said, \"Angels do not enter a house in which there is a dog or there are pictures.\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11004",
        "17",
        "229"
      ]
    },
    {
      "hadith_no": "5636",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وعمرو الناقد وإسحاق بن إبراهيمقال يحيى وإسحاق أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن الزهري، عن عبيد،الله عن ابن عباس، عن أبي طلحة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكةبيتا فيه كلب ولا صورة ‏\"‏ ‏.‏",
      "text_en": " Abu Talha reported Allah's Apostle (may peace be upon him) having said:                      Angels do not enter a house in which there is a dog or a picture.",
      "chain": [
        "30399",
        "20005",
        "11013",
        "17",
        "229"
      ]
    },
    {
      "hadith_no": "7405",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنيه محمد بن حاتم، حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن  قتادة، قال ذكر لنا أنس بن مالك عن أبي طلحة، قال لما كان يوم بدر وظهر عليهم نبي الله صلى الله عليه وسلم أمر ببضعة وعشرين رجلا - وفي حديث روح بأربعة وعشرين رجلا - من صناديد قريش فألقوا في طوي من أطواء بدر ‏.‏ وساق الحديث بمعنى حديث ثابت عن أنس ‏.‏",
      "text_en": " Aba Talha reported:                      When it was the Day of Badr and Allah's Apostle (may peace be upon him) had gained victory over them (the Meccans), he commanded more than twenty persons, and in another hadith these are counted as twenty-four persons, from the non-believers of the Quraish to be thrown into the well of Badr. The rest of the hadith is the same.",
      "chain": [
        "20229",
        "11073",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "2695",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا معاذ بن معاذ، ح وحدثنا هارون بن عبد الله، قال حدثنا روح، قال حدثنا سعيد، عن قتادة، عن أنس، عن أبي طلحة، قال كان رسول الله صلى الله عليه وسلم إذا غلب على قوم أقام بالعرصة ثلاثا ‏.‏ قال ابن المثنى إذا غلب قوما أحب أن يقيم بعرصتهم ثلاثا ‏.‏ قال أبو داود كان يحيى بن سعيد يطعن في هذا الحديث لأنه ليس من قديم حديث سعيد لأنه تغير سنة خمس وأربعين ولم يخرج هذا الحديث إلا بأخرة ‏.‏ قال أبو داود يقال إن وكيعا حمل عنه في تغيره ‏.‏",
      "text_en": " Abu Talhah said “When the Apostle of Allaah(ﷺ) prevailed on any people, he stayed three nights in the field. Ibn Al Muthanna said “When he prevailed over people, he liked to stay three nights in the field.”Abu Dawud said “Yahya bin Sa’id used to object to this tradition for this is not from his early traditions because his memory was spoiled at the age of forty five. He narrated this tradition in the last days of his age.”Abu Dawud said “ It is said that Waki ‘ recived this tradition from him when his memory was spoiled.”",
      "chain": [
        "30170",
        "20286",
        "30524",
        "20229",
        "11168",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن سهيل، - يعني ابن أبي صالح - عن سعيد بن يسار الأنصاري، عن زيد بن خالد الجهني، عن أبي طلحة الأنصاري، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا تمثال ‏\"‏ ‏.‏ وقال انطلق بنا إلى أم المؤمنين عائشة نسألها عن ذلك ‏.‏ فانطلقنا فقلنا يا أم المؤمنين إن أبا طلحة حدثنا عن رسول الله صلى الله عليه وسلم بكذا وكذا فهل سمعت النبي صلى الله عليه وسلم يذكر ذلك قالت لا ولكن سأحدثكم بما رأيته فعل خرج رسول الله صلى الله عليه وسلم في بعض مغازيه وكنت أتحين قفوله فأخذت نمطا كان لنا فسترته على العرض فلما جاء استقبلته فقلت السلام عليك يا رسول الله ورحمة الله وبركاته الحمد لله الذي أعزك وأكرمك فنظر إلى البيت فرأى النمط فلم يرد على شيئا ورأيت الكراهية في وجهه فأتى النمط حتى هتكه ثم قال ‏\"‏ إن الله لم يأمرنا فيما رزقنا أن نكسو الحجارة واللبن ‏\"‏ ‏.‏ قالت فقطعته وجعلته وسادتين وحشوتهما ليفا فلم ينكر ذلك على ‏.‏",
      "text_en": " Narrated Abu Talhat al-Ansari:                     I heard the Prophet (ﷺ) say: The angels do not enter a house which contains a dog or a picture. Zaid b. Khalid al-Juhani said to Sa'id b. Yasar al-Ansari, the transmitter of this tradition: Go with me to 'Aishah, Mother of Faithful, so that we ask about it. So we went and said to her: Mother of Faithful, Abu Talhah has transmitted to us a tradition so-and-so. Have you heard the Prophet (ﷺ) mentioning that ? She replied: No but I tell what I saw him doing. The Messenger of Allah (ﷺ) went on an expedition and I was waiting for his return. I got a carpet which I hung as a screen on a stick over the door. When he came I received him and said: Peace be upon you, Messenger of Allah, His mercy and His blessings. Praise to be Allah Who gave you dominance and respect. Then he looked at the house and saw the carpet; and he did not respond to me at all. I found (signs of) disapproval in his face. He then came to the carpet and tore it down. He then said: Allah has not commanded us to clothe stones and clay out of the sustenance He has given us. She said: I then cut it to pieces and made two pillows out of it and stuffed them with palm fibre, and he did not disapprove of it to me.",
      "chain": [
        "30569",
        "20423",
        "11173",
        "11170",
        "3625",
        "229"
      ]
    },
    {
      "hadith_no": "4155",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن بكير، عن بسر بن سعيد، عن زيد بن خالد، عن أبي طلحة، أنه قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه صورة ‏\"‏ ‏.‏ قال بسر ثم اشتكى زيد فعدناه فإذا على بابه ستر فيه صورة فقلت لعبيد الله الخولاني ربيب ميمونة زوج النبي صلى الله عليه وسلم ألم يخبرنا زيد عن الصور يوم الأول فقال عبيد الله ألم تسمعه حين قال إلا رقما في ثوب ‏.‏",
      "text_en": " Narrated Abu Talhah:                     The Messenger of Allah (ﷺ) as saying: The angels do not enter the house which contains a picture. Busr (b. Sa'id), the transmitter of this tradition, said: Zaid (b. Khalid al-Juhani) then fell it and we paid him a sick visit. There was a curtain with a picture hanging at his door. I then said to 'Ubaid Allah al-Khawlani', the step-son of Maimunah, wife of the Prophet (ﷺ): Did Zaid not tell us about pictures on the first day ? 'Ubaid Allah said: Did you not hear him when he said: Except a figure on a garment.",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153",
        "3625",
        "229"
      ]
    },
    {
      "hadith_no": "4884",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إسحاق بن الصباح، حدثنا ابن أبي مريم، أخبرنا الليث، قال حدثني يحيى بن سليم، أنه سمع إسماعيل بن بشير، يقول سمعت جابر بن عبد الله، وأبا، طلحة بن سهل الأنصاري يقولان قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من امرئ يخذل امرأ مسلما في موضع تنتهك فيه حرمته وينتقص فيه من عرضه إلا خذله الله في موطن يحب فيه نصرته وما من امرئ ينصر مسلما في موضع ينتقص فيه من عرضه وينتهك فيه من حرمته إلا نصره الله في موطن يحب نصرته ‏\"‏ ‏.‏ قال يحيى وحدثنيه عبيد الله بن عبد الله بن عمر وعقبة بن شداد ‏.‏ قال أبو داود يحيى بن سليم هذا هو ابن زيد مولى النبي صلى الله عليه وسلم وإسماعيل بن بشير مولى بني مغالة وقد قيل عتبة بن شداد موضع عقبة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah ; AbuTalhah ibn Sahl al-Ansari:                     The Prophet (ﷺ) said: No (Muslim) man will desert a man who is a Muslim in a place where his respect may be violated and his honour aspersed without Allah deserting him in a place here he wishes his help; and no (Muslim) man who will help a Muslim in a place where his honour may be aspersed and his respect violated without Allah helping him in a place where he wishes his help.Yahya said: 'Ubaid Allah b. 'Abd Allah b. 'Umar and 'Uqbah b. Shaddad transmitted it to me.Abu Dawud said: This yahya b. Sulaim is the son of Zaid, the freed slave of the Prophet (ﷺ), and Isma'il b. Bashir is the freed slave of Banu Maghalah. Sometimes the name of 'Utbah b. Shaddad is mentioned instead of 'Uqbah.",
      "chain": [
        "35013",
        "30232",
        "20023",
        "20204",
        "12013",
        "34",
        "229"
      ]
    },
    {
      "hadith_no": "1293",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا المعتمر بن سليمان، قال سمعت ليثا، يحدث عن يحيى بن عباد، عن أنس، عن أبي طلحة، أنه قال يا نبي الله إني اشتريت خمرا لأيتام في حجري ‏.‏ قال ‏\"‏ أهرق الخمر واكسر الدنان ‏\"‏ ‏.‏ قال وفي الباب عن جابر وعائشة وأبي سعيد وابن مسعود وابن عمر وأنس ‏.‏ قال أبو عيسى حديث أبي طلحة روى الثوري هذا الحديث عن السدي عن يحيى بن عباد عن أنس أن أبا طلحة كان عنده ‏.‏ وهذا أصح من حديث الليث ‏.‏",
      "text_en": " Narrated Anas:                     From Abu Talhah that he said: \"O Prophet of Allah! I had purchased some wine for the orphans under my care. He said: 'Spill out the wine, and break the jugs.'\"[He said:] There are narrations on this topic from Jabir, 'Aishah, Abu Sa'eed, Ibn Mas'ud, Ibn 'Umar, and Anas.[Abu 'Eisa said:] The Hadith of Abu Talhah, Ath-Thawri reported this Hadith from As-Suddi, from Yahya bin 'Abbad, from Anas: \"That Abu Talhah was with him\" and this is more correct than the narration of Al-laith (no. 1293).",
      "chain": [
        "30430",
        "20288",
        "20023",
        "10840",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "1551",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، ومحمد بن بشار، قالا حدثنا معاذ بن معاذ، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، عن أبي طلحة، أن النبي صلى الله عليه وسلم كان إذا ظهر على قوم أقام بعرصتهم ثلاثا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وحديث حميد عن أنس حديث حسن صحيح ‏.‏ وقد رخص قوم من أهل العلم في الغارة بالليل وأن يبيتوا وكرهه بعضهم ‏.‏ وقال أحمد وإسحاق لا بأس أن يبيت العدو ليلا ‏.‏ ومعنى قوله وافق محمد الخميس يعني به الجيش ‏.‏",
      "text_en": " Narrated Abu Talhah:                     \"When the Prophet (ﷺ) overtook a people he would stay at the outskirts of their city for three nights.\"",
      "chain": [
        "30367",
        "30160",
        "20286",
        "11073",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا سيار بن حاتم، عن سهل بن أسلم، عن يزيد بن أبي منصور، عن أنس بن مالك، عن أبي طلحة، قال شكونا إلى رسول الله صلى الله عليه وسلم الجوع ورفعنا عن بطوننا عن حجر حجر فرفع رسول الله صلى الله عليه وسلم عن حجرين ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik narrated from Abu Talhah who said:                     \"We complained to the Messenger of Allah(s.a.w) of hunger and we raised(our garments ) from our stomachs (exposing) a stone (on each of us). So the Messenger of Allah(s.a.w) raised (his garment exposing) two stones.\"",
      "chain": [
        "24196",
        "10727",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "3277",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا روح بن عبادة، عن حماد بن سلمة، عن ثابت، عن أنس، عن أبي طلحة، قال رفعت رأسي يوم أحد فجعلت أنظر وما منهم يومئذ أحد إلا يميد تحت حجفته من النعاس فذلك قوله عز وجل ‏:‏ ‏(‏فأنزل عليكم من بعد الغم أمنة نعاسا ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas:                     that Abu Talhah said: \"I raised my head to look around on the Day of Uhud, and there was not one of them that day except that he was swaying under his shield due to drowsiness. Allah said about that: Then He sent down upon you - after the distress - a slumber of security (3:154).",
      "chain": [
        "30553",
        "20229",
        "20021",
        "11269",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "4279",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي البصري، حدثنا أبو داود، وعبد الصمد، قالا حدثنا محمد بن ثابت البناني، عن أبيه، عن أنس بن مالك، عن أبي طلحة، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ قومك السلام فإنهم ما علمت أعفة صبر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Talhah:                     \"The Messenger of Allah (ﷺ) said to me: 'Convey my Salam to your people, because I know them to be modest and patient.'\"",
      "chain": [
        "30149",
        "20547",
        "20250",
        "24389",
        "11269",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "178",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وهارون بن عبد الله، قالا حدثنا حرمي، - وهو ابن عمارة بن أبي حفصة - قال حدثنا شعبة، عن عمرو بن دينار، قال سمعت يحيى بن جعدة، يحدث عن عبد الله بن عمرو القاري، عن أبي طلحة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ توضئوا مما غيرت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that the Messenger of Allah (ﷺ) said:                      \"Perform Wudu' from that which has been altered by fire.\"",
      "chain": [
        "30359",
        "30524",
        "20221",
        "20020",
        "11081",
        "229"
      ]
    },
    {
      "hadith_no": "179",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن أبي بكر بن حفص، عن ابن شهاب، عن ابن أبي طلحة، عن أبي طلحة، أن النبي صلى الله عليه وسلم قال ‏\"‏ توضئوا مما أنضجت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that the Prophet (ﷺ) said:                      \"Perform Wudu' from that which has been heated with fire.\"",
      "chain": [
        "30524",
        "20221",
        "20020",
        "11180",
        "11013",
        "229"
      ]
    },
    {
      "hadith_no": "1283",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن منصور الكوسج، قال أنبأنا عفان، قال حدثنا حماد، قال حدثنا ثابت، قال قدم علينا سليمان مولى الحسن بن علي زمن الحجاج فحدثنا عن عبد الله بن أبي طلحة عن أبيه أن رسول الله صلى الله عليه وسلم جاء ذات يوم والبشرى في وجهه فقلنا إنا لنرى البشرى في وجهك ‏.‏ فقال ‏\"‏ إنه أتاني الملك فقال يا محمد إن ربك يقول أما يرضيك أنه لا يصلي عليك أحد إلا صليت عليه عشرا ولا يسلم عليك أحد إلا سلمت عليه عشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Abi Talha, from his father, that:                     The Messenger of Allah (ﷺ) came one day with a cheerful expression on his face, and we said: \"We see you looking cheerful\". He said: \"The Angel came to me and said: 'O Muhammad, your Lord says: 'Will it not please you (to know) that no one will send salah upon you that I will send salah upon him tenfold, and no one will send salams upon you but I will send salams upon him tenfold?'\"",
      "chain": [
        "30313",
        "30106",
        "20022",
        "11269",
        "422",
        "229"
      ]
    },
    {
      "hadith_no": "1295",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، - يعني ابن المبارك - قال أنبأنا حماد بن سلمة، عن ثابت، عن سليمان، مولى الحسن بن علي عن عبد الله بن أبي طلحة، عن أبيه، أن رسول الله صلى الله عليه وسلم جاء ذات يوم والبشر يرى في وجهه فقال ‏\"‏ إنه جاءني جبريل صلى الله عليه وسلم فقال أما يرضيك يا محمد أن لا يصلي عليك أحد من أمتك إلا صليت عليه عشرا ولا يسلم عليك أحد من أمتك إلا سلمت عليه عشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Abi Talhah, from his father, that:                     The Messenger of Allah (ﷺ) came one day with a joyful expression on his face. He said: \"Jibril came to me and said: 'Will it not please you, O Muhammad, (to know) that no one of your Ummah will send salah upon you but I will send salah upon him tenfold, and no one will send salams upon you but I will send salams upon him tenfold?\"",
      "chain": [
        "38265",
        "20025",
        "20021",
        "11269",
        "21275",
        "422",
        "229"
      ]
    },
    {
      "hadith_no": "4282",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، وإسحاق بن منصور، عن سفيان، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن أبي طلحة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Talhah said:                     \"The Messenger of Allah said: '; The angels do not enter a house in which there is a dog or a picture.\"",
      "chain": [
        "30367",
        "30313",
        "20005",
        "11013",
        "11004",
        "17",
        "229"
      ]
    },
    {
      "hadith_no": "5347",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن أبي طلحة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that:                     The Prophet [SAW] said: \"The angels do not enter a house in which there is a dog or an image.\"",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11004",
        "17",
        "229"
      ]
    },
    {
      "hadith_no": "5348",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أنبأنا محمد بن عبد الملك بن أبي الشوارب، قال حدثنا يزيد، قال حدثنا معمر، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن أبي طلحة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة تماثيل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Talhah said:                     \"I heard the Messenger of Allah [SAW] say: 'The angels do not enter a house in which there is a dog or an image of an animate being.'\"",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013",
        "11004",
        "17",
        "229"
      ]
    },
    {
      "hadith_no": "5350",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عيسى بن حماد، قال حدثنا الليث، قال حدثني بكير، عن بسر بن سعيد، عن زيد بن خالد، عن أبي طلحة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ‏\"‏ ‏.‏ قال بسر ثم اشتكى زيد فعدناه فإذا على بابه ستر فيه صورة قلت لعبيد الله الخولاني ألم يخبرنا زيد عن الصورة يوم الأول قال قال عبيد الله ألم تسمعه يقول ‏\"‏ إلا رقما في ثوب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that:                     The Messenger of Allah [SAW] said: \"The angels do not enter any house in which there is an image.\" Busr said: \"Then Zaid fell sick and we went to visit him, and on his door there was a curtain on which there was an image. I said to 'Ubaidullah Al-Khawlani: 'Didn't Zaid tell us about images yesterday?' 'Ubaidullah said: 'Didn't you hear him say: Except for patterns on fabrics?'\"",
      "chain": [
        "30412",
        "20023",
        "11154",
        "11153",
        "3625",
        "229"
      ]
    },
    {
      "hadith_no": "3780",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن أبي طلحة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Talhah that the Prophet (ﷺ) said:                      “Theangelsdo not enter a house in which there is a dog or an image.”",
      "chain": [
        "30201",
        "20005",
        "11013",
        "11004",
        "17",
        "229"
      ]
    }
  ],
  "total_hadiths": 25
}