{
  "id": "23",
  "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
  "full_name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "32",
      "date_gregorian": "652",
      "date_display": null,
      "place": "Al-Rabathah near Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "Medina",
      "Syria",
      "Al-Rabathah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Ghaffari",
      "Early Muslim",
      "Client",
      "Servant",
      "Emigrant"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "3132",
      "name": "Umm Dhur ( أم ذر امرأة أبي ذر الغفاري ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "3133",
      "name": "Anis bin Junadah al-Ghaffari ( أنيس بن جنادة الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18253",
      "name": "Khalid bin Wahban bin Khalh خالد بن وهبان بن خالة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "4026",
      "name": "Kharsha bin al-Hurr al-Fazari ( خرشة بن الحر الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11112",
      "name": "al-Ahnaf bin Qays الأحنف بن قيس بن معاوية",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10695",
      "name": "'Abdullah bin al-Samit عبد الله بن الصامت",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15165",
      "name": "Zayd bin Zbyan زيد بن ظبيان",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11609",
      "name": "Qays bin 'Aabad al-Qaysi قيس بن عباد القيسي الضبعي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10883",
      "name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11114",
      "name": "Abu al-Aswad al-Du'ali أبو الأسود الديلي/الدؤلي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11397",
      "name": "al-Ma'rur bin Suwayd al-Asadi المعرور بن سويد الأسدي أبو أمية الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11405",
      "name": "Yazid bin Sharayk bin Tariq يزيد بن شريك بن طارق التيمي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "4087",
      "name": "Hamil/Jamil bin Basra ( حميل بن بصرة أبو بصرة الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10858",
      "name": "Sufyan bin Han'i, Abu Salam al-Jayshani سفيان بن هانئ أبو سالم الجيشاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11337",
      "name": "Zar bin Habaysh bin Habasha زر بن حبيش بن حباشة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10867",
      "name": "'Abdur Rahman bin Shmas'h عبد الرحمن بن شماسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19856",
      "name": "'Amr bin Bjdan عمرو بن بجدان",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10866",
      "name": "'Abdur Rahman bin Hujayrah عبد الرحمن بن حجيرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-349",
      "hadith_no": "349",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن يونس، عن ابن شهاب، عن أنس بن مالك، قال كان أبو ذر يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج عن سقف بيتي وأنا بمكة، فنزل جبريل ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا، فأفرغه في صدري ثم أطبقه، ثم أخذ بيدي فعرج بي إلى السماء الدنيا، فلما جئت إلى السماء الدنيا قال جبريل لخازن السماء افتح‏.‏ قال من هذا قال هذا جبريل‏.‏ قال هل معك أحد قال نعم معي محمد صلى الله عليه وسلم‏.‏ فقال أرسل إليه قال نعم‏.‏ فلما فتح علونا السماء الدنيا، فإذا رجل قاعد على يمينه أسودة وعلى يساره أسودة، إذا نظر قبل يمينه ضحك، وإذا نظر قبل يساره بكى، فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت لجبريل من هذا قال هذا آدم‏.‏ وهذه الأسودة عن يمينه وشماله نسم بنيه، فأهل اليمين منهم أهل الجنة، والأسودة التي عن شماله أهل النار، فإذا نظر عن يمينه ضحك، وإذا نظر قبل شماله بكى، حتى عرج بي إلى السماء الثانية فقال لخازنها افتح‏.‏ فقال له خازنها مثل ما قال الأول ففتح ‏\"‏‏.‏ قال أنس فذكر أنه وجد في السموات آدم وإدريس وموسى وعيسى وإبراهيم  صلوات الله عليهم  ولم يثبت كيف منازلهم، غير أنه ذكر أنه وجد آدم في السماء الدنيا، وإبراهيم في السماء السادسة‏.‏ قال أنس فلما مر جبريل بالنبي صلى الله عليه وسلم بإدريس قال مرحبا بالنبي الصالح والأخ الصالح‏.‏ فقلت من هذا قال هذا إدريس‏.‏ ثم مررت بموسى فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال هذا موسى‏.‏ ثم مررت بعيسى فقال مرحبا بالأخ الصالح والنبي الصالح‏.‏ قلت من هذا قال هذا عيسى‏.‏ ثم مررت بإبراهيم فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا قال هذا إبراهيم صلى الله عليه وسلم ‏\"‏‏.‏ قال ابن شهاب فأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال النبي صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع فيه صريف الأقلام ‏\"‏‏.‏ قال ابن حزم وأنس بن مالك قال النبي صلى الله عليه وسلم ‏\"‏ ففرض الله على أمتي خمسين صلاة، فرجعت بذلك حتى مررت على موسى فقال ما فرض الله لك على أمتك قلت فرض خمسين صلاة‏.‏ قال فارجع إلى ربك، فإن أمتك لا تطيق ذلك‏.‏ فراجعت فوضع شطرها، فرجعت إلى موسى قلت وضع شطرها‏.‏ فقال راجع ربك، فإن أمتك لا تطيق، فراجعت فوضع شطرها، فرجعت إليه فقال ارجع إلى ربك، فإن أمتك لا تطيق ذلك، فراجعته‏.‏ فقال هي خمس وهى خمسون، لا يبدل القول لدى‏.‏ فرجعت إلى موسى فقال راجع ربك‏.‏ فقلت استحييت من ربي‏.‏ ثم انطلق بي حتى انتهى بي إلى سدرة المنتهى، وغشيها ألوان لا أدري ما هي، ثم أدخلت الجنة، فإذا فيها حبايل اللؤلؤ، وإذا ترابها المسك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Allah's Apostle said, \"While I was at Mecca the roof of my house was opened and Gabriel descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the nearest heaven, when I reached the nearest heaven, Gabriel said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'Who is it?' Gabriel answered: 'Gabriel.' He asked, 'Is there anyone with you?' Gabriel replied, 'Yes, Muhammad I is with me.' He asked, 'Has he been called?' Gabriel said, 'Yes.' So the gate was opened and we went over the nearest heaven and there we saw a man sitting with some people on his right and some on his left. When he looked towards his right, he laughed and when he looked toward his left he wept. Then he said, 'Welcome! O pious Prophet and pious son.' I asked Gabriel, 'Who is he?' He replied, 'He is Adam and the people on his right and left are the souls of his offspring. Those on his right are the people of Paradise and those on his left are the people of Hell and when he looks towards his right he laughs and when he looks towards his left he weeps.' Then he ascended with me till he reached the second heaven and he (Gabriel) said to its gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven had said and he opened the gate. Anas said: \"Abu Dhar added that the Prophet met Adam, Idris, Moses, Jesus and Abraham, he (Abu Dhar) did not mention on which heaven they were but he mentioned that he (the Prophet ) met Adam on the nearest heaven and Abraham on the sixth heaven. Anas said, \"When Gabriel along with the Prophet passed by Idris, the latter said, 'Welcome! O pious Prophet and pious brother.' The Prophet asked, 'Who is he?' Gabriel replied, 'He is Idris.\" The Prophet added, \"I passed by Moses and he said, 'Welcome! O pious Prophet and pious brother.' I asked Gabriel, 'Who is he?' Gabriel replied, 'He is Moses.' Then I passed by Jesus and he said, 'Welcome! O pious brother and pious Prophet.' I asked, 'Who is he?' Gabriel replied, 'He is Jesus. Then I passed by Abraham and he said, 'Welcome! O pious Prophet and pious son.' I asked Gabriel, 'Who is he?' Gabriel replied, 'He is Abraham. The Prophet added, 'Then Gabriel ascended with me to a place where I heard the creaking of the pens.\" Ibn Hazm and Anas bin Malik said: The Prophet said, \"Then Allah enjoined fifty prayers on my followers when I returned with this order of Allah, I passed by Moses who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty prayers on them.' Moses said, 'Go back to your Lord (and appeal for reduction) for your followers will not be able to bear it.' (So I went back to Allah and requested for reduction) and He reduced it to half. When I passed by Moses again and informed him about it, he said, 'Go back to your Lord as your followers will not be able to bear it.' So I returned to Allah and requested for further reduction and half of it was reduced. I again passed by Moses and he said to me: 'Return to your Lord, for your followers will not be able to bear it. So I returned to Allah and He said, 'These are five prayers and they are all (equal to) fifty (in reward) for My Word does not change.' I returned to Moses and he told me to go back once again. I replied, 'Now I feel shy of asking my Lord again.' Then Gabriel took me till we '' reached Sidrat-il-Muntaha (Lote tree of; the utmost boundary) which was shrouded in colors, indescribable. Then I was admitted into Paradise where I found small (tents or) walls (made) of pearls and its earth was of musk.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-535",
      "hadith_no": "535",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن المهاجر أبي الحسن، سمع زيد بن وهب، عن أبي ذر، قال أذن مؤذن النبي صلى الله عليه وسلم الظهر فقال ‏\"‏ أبرد أبرد  أو قال  انتظر انتظر ‏\"‏‏.‏ وقال ‏\"‏ شدة الحر من فيح جهنم، فإذا اشتد الحر فأبردوا عن الصلاة ‏\"‏‏.‏ حتى رأينا فىء التلول‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Mu'adh-dhin (call-maker) of the Prophet pronounced the Adhan (call) for the Zuhr prayer but the Prophet said, \"Let it be cooler, let it be cooler.\" Or said, 'Wait, wait, because the severity of heat is from the raging of the Hell-fire. In severe hot weather, pray when it becomes (a bit) cooler and the shadows of hillocks appear.\"",
      "usc_msa_ref": "511",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-539",
      "hadith_no": "539",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال حدثنا مهاجر أبو الحسن، مولى لبني تيم الله قال سمعت زيد بن وهب، عن أبي ذر الغفاري، قال كنا مع النبي صلى الله عليه وسلم في سفر، فأراد المؤذن أن يؤذن للظهر فقال النبي صلى الله عليه وسلم ‏\"‏ أبرد ‏\"‏‏.‏ ثم أراد أن يؤذن فقال له ‏\"‏ أبرد ‏\"‏‏.‏ حتى رأينا فىء التلول، فقال النبي صلى الله عليه وسلم ‏\"‏ إن شدة الحر من فيح جهنم، فإذا اشتد الحر فأبردوا بالصلاة ‏\"‏‏.‏ وقال ابن عباس تتفيأ تتميل‏.‏",
      "text_en": " Narrated Abu Dhar Al-Ghifar:                     We were with the Prophet on a journey and the Mu'adh-dhin (call maker for the prayer) wanted to pronounce the Adhan (call) for the Zuhr prayer. The Prophet said, 'Let it become cooler.\" He again (after a while) wanted to pronounce the Adhan but the Prophet said to him, \"Let it become cooler till we see the shadows of hillocks.\" The Prophet added, \"The severity of heat is from the raging of the Hell-fire, and in very hot weather pray (Zuhr) when it becomes cooler.\"",
      "usc_msa_ref": "514",
      "chain": [
        "20404",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-629",
      "hadith_no": "629",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن المهاجر أبي الحسن، عن زيد بن وهب، عن أبي ذر، قال كنا مع النبي صلى الله عليه وسلم في سفر فأراد المؤذن أن يؤذن فقال له ‏\"‏ أبرد ‏\"‏‏.‏ ثم أراد أن يؤذن فقال له ‏\"‏ أبرد ‏\"‏‏.‏ ثم أراد أن يؤذن‏.‏ فقال له ‏\"‏ أبرد ‏\"‏‏.‏ حتى ساوى الظل التلول فقال النبي صلى الله عليه وسلم ‏{‏إن شدة الحر من فيح جهنم‏}‏",
      "text_en": " Narrated Abu Dhar:                     We were in the company of the Prophet on a journey and the Mu'adh-dhin wanted to pronounce the Adhan for the (Zuhr) prayer. The Prophet said to him, \"Let it become cooler.\" Then he again wanted to pronounce the Adhan but the Prophet; said to him, \"Let it become cooler.\" The Mu'adh-dhin again wanted to pronounce the Adhan for the prayer but the Prophet said, \"Let it become cooler,\" till the shadows of the hillocks become equal to their sizes. The Prophet added, \"The severity of the heat is from the raging of Hell.\"",
      "usc_msa_ref": "602",
      "chain": [
        "20285",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-1237",
      "hadith_no": "1237",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا مهدي بن ميمون، حدثنا واصل الأحدب، عن المعرور بن سويد، عن أبي ذر  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني آت من ربي فأخبرني  أو قال بشرني  أنه من مات من أمتي لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Allah's Apostle said, \"Someone came to me from my Lord and gave me the news (or good tidings) that if any of my followers dies worshipping none (in any way) along with Allah, he will enter Paradise.\" I asked, \"Even if he committed illegal sexual intercourse (adultery) and theft?\" He replied, \"Even if he committed illegal sexual intercourse (adultery) and theft.\"",
      "usc_msa_ref": "329",
      "chain": [
        "20040",
        "11307",
        "11401",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-1483",
      "hadith_no": "1483",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر  رضى الله عنه  قال انتهيت إلى النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده  أو والذي لا إله غيره، أو كما حلف  ما من رجل تكون له إبل أو بقر أو غنم لا يؤدي حقها إلا أتي بها يوم القيامة أعظم ما تكون وأسمنه، تطؤه بأخفافها، وتنطحه بقرونها، كلما جازت أخراها ردت عليه أولاها، حتى يقضى بين الناس ‏\"‏‏.‏ رواه بكير عن أبي صالح عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Dhar:                     Once I went to him (the Prophet ) and he said, \"By Allah in Whose Hands my life is (or probably said, 'By Allah, except Whom none has the right to be worshipped) whoever had camels or cows or sheep and did not pay their Zakat, those animals will be brought on the Day of Resurrection far bigger and fatter than before and they will tread him under their hooves, and will butt him with their horns, and (those animals will come in circle): When the last does its turn, the first will start again, and this punishment will go on till Allah has finished the judgments amongst the people.\"",
      "usc_msa_ref": "539",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-1661",
      "hadith_no": "1661",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال عبدان أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أنس بن مالك كان أبو ذر  رضى الله عنه  يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقفي وأنا بمكة، فنزل جبريل  عليه السلام  ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا، فأفرغها في صدري، ثم أطبقه، ثم أخذ بيدي فعرج إلى السماء الدنيا‏.‏ قال جبريل لخازن السماء الدنيا افتح‏.‏ قال من هذا قال جبريل ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik that Abu Dhar said:                      Allah's Messenger  () said, \"The roof of my house was made open while I was at Makkah (on the night of Mi'raj) and Jibril descended. He opened up my chest and washed it with the water of Zamzam. The he brought the golden tray full of Wisdom and Belief and poured it in my chest and then closed it. The he took hold of my hand and ascended to the nearest heaven. Jibril told the gatekeeper of the nearest heaven to open the gate. The gatekeeper asked, \"Who is it?\" Jibril replied, \"I am Jibril.\" (See Hadith No. 349 Vol.1)",
      "usc_msa_ref": "",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-2388",
      "hadith_no": "2388",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الأعمش، عن زيد بن وهب، عن أبي ذر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم فلما أبصر  يعني أحدا  قال ‏\"‏ ما أحب أنه يحول لي ذهبا يمكث عندي منه دينار فوق ثلاث، إلا دينارا أرصده لدين ‏\"‏‏.‏ ثم قال ‏\"‏ إن الأكثرين هم الأقلون، إلا من قال بالمال هكذا وهكذا ‏\"‏‏.‏ وأشار أبو شهاب بين يديه وعن يمينه وعن شماله  وقليل ما هم  وقال مكانك‏.‏ وتقدم غير بعيد، فسمعت صوتا، فأردت أن آتيه، ثم ذكرت قوله مكانك حتى آتيك، فلما جاء قلت يا رسول الله، الذي سمعت أو قال الصوت الذي سمعت قال ‏\"‏ وهل سمعت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أتاني جبريل  عليه السلام  فقال من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن فعل كذا وكذا قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not like to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains of it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar which I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have little reward in the Hereafter except those who spend their money here and there (in Allah's Cause), and they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a voice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his return I said, \"O Allah's Apostle! (What was) that noise which I heard?\" He said, \"Did you hear anything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers dies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such things (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"",
      "usc_msa_ref": "573",
      "chain": [
        "30184",
        "11613",
        "11060",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-2518",
      "hadith_no": "2518",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن موسى، عن هشام بن عروة، عن أبيه، عن أبي مراوح، عن أبي ذر  رضى الله عنه  قال سألت النبي صلى الله عليه وسلم أى العمل أفضل، قال ‏\"‏ إيمان بالله، وجهاد في سبيله ‏\"‏‏.‏ قلت فأى الرقاب أفضل قال ‏\"‏ أغلاها ثمنا، وأنفسها عند أهلها ‏\"‏‏.‏ قلت فإن لم أفعل‏.‏ قال ‏\"‏ تعين صانعا أو تصنع لأخرق ‏\"‏‏.‏ قال فإن لم أفعل‏.‏ قال ‏\"‏ تدع الناس من الشر، فإنها صدقة تصدق بها على نفسك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     I asked the Prophet, \"What is the best deed?\" He replied, \"To believe in Allah and to fight for His Cause.\" I then asked, \"What is the best kind of manumission (of slaves)?\" He replied, \"The manumission of the most expensive slave and the most beloved by his master.\" I said, \"If I cannot afford to do that?\" He said, \"Help the weak or do good for a person who cannot work for himself.\" I said, \"If I cannot do that?\" He said, \"Refrain from harming others for this will be regarded as a charitable deed for your own good.\"",
      "usc_msa_ref": "694",
      "chain": [
        "20340",
        "11065",
        "10511",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-3199",
      "hadith_no": "3199",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لأبي ذر حين غربت الشمس ‏\"‏ تدري أين تذهب ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب حتى تسجد تحت العرش، فتستأذن فيؤذن لها، ويوشك أن تسجد فلا يقبل منها، وتستأذن فلا يؤذن لها، يقال لها ارجعي من حيث جئت‏.‏ فتطلع من مغربها، فذلك قوله تعالى ‏{‏والشمس تجري لمستقر لها ذلك تقدير العزيز العليم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Prophet asked me at sunset, \"Do you know where the sun goes (at the time of sunset)?\" I replied, \"Allah and His Apostle know better.\" He said, \"It goes (i.e. travels) till it prostrates Itself underneath the Throne and takes the permission to rise again, and it is permitted and then (a time will come when) it will be about to prostrate itself but its prostration will not be accepted, and it will ask permission to go on its course but it will not be permitted, but it will be ordered to return whence it has come and so it will rise in the west. And that is the interpretation of the Statement of Allah: \"And the sun Runs its fixed course For a term (decreed). that is The Decree of (Allah) The Exalted in Might, The All- Knowing.\" (36.38)",
      "usc_msa_ref": "",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-3222",
      "hadith_no": "3222",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن حبيب بن أبي ثابت، عن زيد بن وهب، عن أبي ذر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ قال لي جبريل من مات من أمتك لا يشرك بالله شيئا دخل الجنة، أو لم يدخل النار، قال وإن زنى وإن سرق قال وإن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Prophet said, \"Gabriel said to me, 'Whoever amongst your followers die without having worshipped others besides Allah, will enter Paradise (or will not enter the (Hell) Fire).\" The Prophet asked. \"Even if he has committed illegal sexual intercourse or theft?\" He replied, \"Even then.\"",
      "usc_msa_ref": "445",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11331",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-3258",
      "hadith_no": "3258",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن مهاجر أبي الحسن، قال سمعت زيد بن وهب، يقول سمعت أبا ذر  رضى الله عنه  يقول كان النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ أبرد ‏\"‏‏.‏ ثم قال ‏\"‏ أبرد ‏\"‏‏.‏ حتى فاء الفىء، يعني للتلول، ثم قال ‏\"‏ أبردوا بالصلاة، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     While the Prophet was on a journey, he said (regarding the performance of the Zuhr prayer), \"Wait till it (i.e. the weather) gets cooler.\" He said the same again till the shade of the hillocks extended. Then he said, \"Delay the (Zuhr) Prayer till it gets cooler, for the severity of heat is from the increase in heat of Hell (fire).",
      "usc_msa_ref": "480",
      "chain": [
        "20296",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-3342",
      "hadith_no": "3342",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "قال عبدان أخبرنا عبد الله، أخبرنا يونس، عن الزهري، ح حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال أنس كان أبو ذر  رضى الله عنه  يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقف بيتي وأنا بمكة، فنزل جبريل، ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا فأفرغها في صدري، ثم أطبقه ثم أخذ بيدي، فعرج بي إلى السماء، فلما جاء إلى السماء الدنيا، قال جبريل لخازن السماء افتح‏.‏ قال من هذا قال هذا جبريل‏.‏ قال معك أحد قال معي محمد‏.‏ قال أرسل إليه قال نعم، فافتح‏.‏ فلما علونا السماء إذا رجل عن يمينه أسودة، وعن يساره أسودة، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا يا جبريل قال هذا آدم، وهذه الأسودة عن يمينه، وعن شماله نسم بنيه، فأهل اليمين منهم أهل الجنة، والأسودة التي عن شماله أهل النار، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى، ثم عرج بي جبريل، حتى أتى السماء الثانية، فقال لخازنها افتح‏.‏ فقال له خازنها مثل ما قال الأول، ففتح ‏\"‏‏.‏ قال أنس فذكر أنه وجد في السموات إدريس وموسى وعيسى وإبراهيم، ولم يثبت لي كيف منازلهم، غير أنه قد ذكر أنه وجد آدم في السماء الدنيا، وإبراهيم في السادسة‏.‏ وقال أنس فلما مر جبريل بإدريس‏.‏ قال مرحبا بالنبي الصالح والأخ الصالح‏.‏ فقلت من هذا قال هذا إدريس، ثم مررت بموسى فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال هذا موسى‏.‏ ثم مررت بعيسى، فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال عيسى‏.‏ ثم مررت بإبراهيم، فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا قال هذا إبراهيم‏.‏ قال وأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال النبي صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع صريف الأقلام ‏\"‏‏.‏ قال ابن حزم وأنس بن مالك  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ ففرض الله على خمسين صلاة، فرجعت بذلك حتى أمر بموسى، فقال موسى ما الذي فرض على أمتك قلت فرض عليهم خمسين صلاة‏.‏ قال فراجع ربك، فإن أمتك لا تطيق ذلك‏.‏ فرجعت فراجعت ربي فوضع شطرها، فرجعت إلى موسى، فقال راجع ربك، فذكر مثله، فوضع شطرها، فرجعت إلى موسى، فأخبرته فقال راجع ربك، فإن أمتك لا تطيق ذلك، فرجعت فراجعت ربي فقال هي خمس، وهى خمسون، لا يبدل القول لدى‏.‏ فرجعت إلى موسى، فقال راجع ربك‏.‏ فقلت قد استحييت من ربي، ثم انطلق، حتى أتى السدرة المنتهى، فغشيها ألوان لا أدري ما هي، ثم أدخلت ‏{‏الجنة‏}‏ فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك ‏\"‏‏.‏",
      "text_en": " Narrated Anas (ra):                      Abu Dhar (ra) used to say that Allah's  Messenger () said, \"While I was at Makkah, the roof of my house was opened and Jibril descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith, and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the heaven. When Jibril reached the nearest heaven, he said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'who is it?' Jibril answered, 'Jibril'. He asked, 'Is there anyone with you?' Jibril replied, 'Muhammad () is with me.' He asked, 'Has he been called?', Jibril said, 'Yes'. So, the gate was opened and we went over the nearest heaven, and there we saw a man sitting with Aswida (a large number of people) of his right and Aswida on his left. When he looked towards his right, he laughed and when he looked towards his left he wept. He said (to me), 'Welcome, O pious Prophet and pious son'. I said, 'Who is this man O Jibril?' Jibril replied, 'He is Adam, and the people on his right and left are the souls of his offspring. Those on the right are the people of Paradise, and those on the left are the people of the (Hell) Fire. So, when he looks to the right, he laughs, and when he looks to the left he weeps.' Then Jibril ascended with me till he reached the second heaven and said to the gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven has said, and he opened the gate.\"Anas added: Abu Dhar mentioned that Prophet () met Idris, Musa (Moses), 'Isa (Jesus) and Ibrahim (Abraham) over the heavens, but he did not specify their places (i.e., on which heavens each of them was), but he mentioned that he (the Prophet ()) had met Adam on the nearest heaven, and Ibrahim on the sixth. Anas said, \"When Jibril and the Prophet () passed by Idris, the latter said, 'Welcome, O pious Prophet and pious brother!' the Prophet () asked, 'Who is he?' Jibril said, 'He is Idris.' \" The Prophet () added, \"Then I passed by Musa who said, 'Welcome, O pious Prophet  and pious brother!' I said, 'Who is he?' Jibril said, 'He is Musa.' Then I passed by 'Isa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' He replied, 'He is 'Isa.' Then I passed by the Prophet Ibrahim who said, 'Welcome, O pious Prophet and pious son!' I said, 'Who is he?' Jibril replied, 'He is Ibrahim'.\"Narrated Ibn 'Abbas and Abu Haiyya Al-Ansari: The Prophet () said, \"Then Jibril ascended with me to a place where I heard the creaking of pens.\" Ibn Hazm and Anas bin Malik state the Prophet () said, \"Allah enjoined fifty Salat (prayers) on me. When I returned with this order of Allah, I passed by Musa who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty Salat (prayers) on them.' On the Musa said to me, 'Go back to your Lord (and appeal for reduction), for your followers will not be able to bear it.' So, I returned to my Lord and asked for some reduction, and He reduced it to half. When I passed by Musa again and informed him about it, he once more said to me, 'Go back to your Lord, for your followers will not be able to bear it.' So, I returned to my Lord similarly as before, and half of it was reduced. I again passed by Musa and he said to me, 'Go back to your Lord, for your followers will not be able to bear it.' I again returned to my Lord and He said, 'These are five (Salat-prayers) and they are all (equal to) fifty (in reward), for My Word does not change.' I returned to Musa, he again told me to return to my Lord (for further reduction) but I said to him 'I feel shy of asking my Lord now.' Then Jibril took me till we reached Sidrat-ul-Muntaha (i.e., lote tree of utmost boundary) which was shrouded in colors indescribable. Then I was admitted into Paradise where I found small tents (made) of pearls and its earth was musk (a kind of perfume).\"",
      "usc_msa_ref": "",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-3366",
      "hadith_no": "3366",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الأعمش، حدثنا إبراهيم التيمي، عن أبيه، قال سمعت أبا ذر  رضى الله عنه  قال قلت يا رسول الله، أى مسجد وضع في الأرض أول قال ‏\"‏ المسجد الحرام ‏\"‏‏.‏ قال قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏‏.‏ قلت كم كان بينهما قال ‏\"‏ أربعون سنة، ثم أينما أدركتك الصلاة بعد فصله، فإن الفضل فيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     I said, \"O Allah's Apostle! Which mosque was first built on the surface of the earth?\" He said, \"Al- Masjid-ul-,Haram (in Mecca).\" I said, \"Which was built next?\" He replied \"The mosque of Al-Aqsa ( in Jerusalem) .\" I said, \"What was the period of construction between the two?\" He said, \"Forty years.\" He added, \"Wherever (you may be, and) the prayer time becomes due, perform the prayer there, for the best thing is to do so (i.e. to offer the prayers in time).",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-3425",
      "hadith_no": "3425",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال قلت يا رسول الله‏.‏ أى مسجد وضع أول قال ‏\"‏ المسجد الحرام ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ ثم المسجد الأقصى ‏\"‏‏.‏ قلت كم كان بينهما قال ‏\"‏ أربعون ‏\"‏‏.‏ ثم قال ‏\"‏ حيثما أدركتك الصلاة فصل، والأرض لك مسجد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhaar:                     I said, \"O Allah's Apostle! Which mosque was built first?\" He replied, \"Al-Masjid-ul-Haram.\" I asked, \"Which (was built) next?\" He replied, \"Al-Masjid-ul-Aqs-a (i.e. Jerusalem).\" I asked, \"What was the period in between them?\" He replied, \"Forty (years).\" He then added, \"Wherever the time for the prayer comes upon you, perform the prayer, for all the earth is a place of worshipping for you.\"",
      "usc_msa_ref": "636",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-3548",
      "hadith_no": "3548",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، قال حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر، ومن ادعى قوما ليس له فيهم فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Prophet said, \"If somebody claims to be the son of any other than his real father knowingly, he but disbelieves in Allah, and if somebody claims to belong to some folk to whom he does not belong, let such a person take his place in the (Hell) Fire.\"",
      "usc_msa_ref": "711",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-4015",
      "hadith_no": "4015",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  قال نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ في ستة من قريش علي وحمزة وعبيدة بن الحارث وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Dhar:                     The following Holy Verse:-- \"These two opponents (believers & disbelievers) dispute with each other about their Lord,\" (22.19) was revealed concerning six men from Quraish, namely, `Ali, Hamza, 'Ubaida bin Al-Harith; Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "usc_msa_ref": "",
      "chain": [
        "20351",
        "20012",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-4017",
      "hadith_no": "4017",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن جعفر، أخبرنا وكيع، عن سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، سمعت أبا ذر  رضى الله عنه  يقسم لنزلت هؤلاء الآيات في هؤلاء الرهط الستة يوم بدر‏.‏ نحوه‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     I heard Abu Dhar swearing that these Holy Verses were revealed in connection with those six persons on the day of Badr.",
      "usc_msa_ref": "307",
      "chain": [
        "30397",
        "20032",
        "20012",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-4790",
      "hadith_no": "4790",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  أنه كان يقسم فيها إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم‏}‏ نزلت في حمزة وصاحبيه، وعتبة وصاحبيه يوم برزوا في يوم بدر رواه سفيان عن أبي هاشم‏.‏ وقال عثمان عن جرير عن منصور عن أبي هاشم عن أبي مجلز قوله‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     Abu Dharr used to take an oath confirming that the Verse: 'These two opponents (believers, and disbelievers) dispute with each other about their Lord.' (22.19) was Revealed in connection with Hamza and his two companions and `Utbah and his two companions on the day when they ease out of the battle of Badr.",
      "usc_msa_ref": "267",
      "chain": [
        "20219",
        "20468",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-4850",
      "hadith_no": "4850",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في المسجد عند غروب الشمس فقال ‏\"‏ يا أبا ذر أتدري أين تغرب الشمس ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب حتى تسجد تحت العرش، فذلك قوله تعالى ‏{‏والشمس تجري لمستقر لها ذلك تقدير العزيز العليم‏}‏‏\"‏",
      "text_en": " Narrated Abu Dharr:                     Once I was with the Prophet in the mosque at the time of sunset. The Prophet said, \"O Abu Dharr! Do you know where the sun sets?\" I replied, \"Allah and His Apostle know best.\" He said, \"It goes and prostrates underneath (Allah's) Throne; and that is Allah's Statement:-- 'And the sun runs on its fixed course for a term (decreed). And that is the decree of All-Mighty, the All-Knowing....' (36.38)",
      "usc_msa_ref": "326",
      "chain": [
        "20348",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-4851",
      "hadith_no": "4851",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا وكيع، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت النبي صلى الله عليه وسلم عن قوله تعالى ‏{‏والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     I asked the Prophet about the Statement of Allah:-- 'And the sun runs on fixed course for a term (decreed), ' (36.38) He said, \"Its course is underneath \"Allah's Throne.\" (Prostration of Sun trees, stars. mentioned in Qur'an and Hadith does not mean like our prostration but it means that these objects are obedient to their Creator (Allah) and they obey for what they have been created for).",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20032",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-5886",
      "hadith_no": "5886",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، عن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر  رضى الله عنه  حدثه قال أتيت النبي صلى الله عليه وسلم وعليه ثوب أبيض وهو نائم، ثم أتيته وقد استيقظ فقال ‏\"‏ ما من عبد قال لا إله إلا الله‏.‏ ثم مات على ذلك، إلا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق على رغم أنف أبي ذر ‏\"‏‏.‏ وكان أبو ذر إذا حدث بهذا قال وإن رغم أنف أبي ذر‏.‏ قال أبو عبد الله هذا عند الموت أو قبله، إذا تاب وندم وقال لا إله إلا الله‏.‏ غفر له‏.‏",
      "text_en": " Narrated Abu Dharr:                     I came to the Prophet while he was wearing white clothes and sleeping. Then I went back to him again after he had got up from his sleep. He said, \"Nobody says: 'None has the right to be worshipped but Allah' and then later on he dies while believing in that, except that he will enter Paradise.' I said, \"Even It he had committed illegal sexual intercourse and theft.\" I said. \"Even if he had committed illegal sexual intercourse and theft? He said. 'Even If he had committed illegal sexual intercourse and theft,\" I said, 'Even it he had committed illegal sexual intercourse and thefts.' He said, \"Even If he had committed Illegal sexual intercourse and theft, inspite of the Abu Dharrs dislikeness. Abu `Abdullah said, \"This is at the time of death or before it if one repents and regrets and says \"None has the right to be worshipped but Allah. He will be forgiven his sins.\"",
      "usc_msa_ref": "717",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-6114",
      "hadith_no": "6114",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا يرمي رجل رجلا بالفسوق، ولا يرميه بالكفر، إلا ارتدت عليه، إن لم يكن صاحبه كذلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     That he heard the Prophet saying, \"If somebody accuses another of Fusuq (by calling him 'Fasiq' i.e. a wicked person) or accuses him of Kufr, such an accusation will revert to him (i.e. the accuser) if his companion (the accused) is innocent.\"",
      "usc_msa_ref": "71",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-6119",
      "hadith_no": "6119",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن المعرور، عن أبي ذر، قال رأيت عليه بردا وعلى غلامه بردا فقلت لو أخذت هذا فلبسته كانت حلة، وأعطيته ثوبا آخر‏.‏ فقال كان بيني وبين رجل كلام، وكانت أمه أعجمية، فنلت منها فذكرني إلى النبي صلى الله عليه وسلم فقال لي ‏\"‏ أساببت فلانا ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أفنلت من أمه ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ إنك امرؤ فيك جاهلية ‏\"‏‏.‏ قلت على حين ساعتي هذه من كبر السن قال ‏\"‏ نعم، هم إخوانكم، جعلهم الله تحت أيديكم، فمن جعل الله أخاه تحت يده فليطعمه مما يأكل، وليلبسه مما يلبس، ولا يكلفه من العمل ما يغلبه، فإن كلفه ما يغلبه فليعنه عليه ‏\"‏‏.‏",
      "text_en": " Narrated Ma'rur:                     I saw Abu Dhar wearing a Burd (garment) and his slave too was wearing a Burd, so I said (to Abu Dhar), \"If you take this (Burda of your slave) and wear it (along with yours), you will have a nice suit (costume) and you may give him another garment.\" Abu Dhar said, \"There was a quarrel between me and another man whose mother was a non-Arab and I called her bad names. The man mentioned (complained about) me to the Prophet. The Prophet said, \"Did you abuse so-and-so?\" I said, \"Yes\" He said, \"Did you call his mother bad names?\" I said, \"Yes\". He said, \"You still have the traits of (the Pre-lslamic period of) ignorance.\" I said. \"(Do I still have ignorance) even now in my old age?\" He said, \"Yes, they (slaves or servants) are your brothers, and Allah has put them under your command. So the one under whose hand Allah has put his brother, should feed him of what he eats, and give him dresses of what he wears, and should not ask him to do a thing beyond his capacity. And if at all he asks him to do a hard task, he should help him therein.\"",
      "usc_msa_ref": "76",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-6398",
      "hadith_no": "6398",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن منصور، عن ربعي بن حراش، عن خرشة بن الحر، عن أبي ذر  رضى الله عنه  قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل قال ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏‏.‏ فإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Whenever the Prophet lay on his bed, he used to say: \"Allahumma bismika amutu wa ahya,\" and when he woke up he would say: \"Al-hamdu lil-lahilladhi ahyana ba'da ma an atana, wa ilaihi an-nushur.\"",
      "usc_msa_ref": "337",
      "chain": [
        "30349",
        "20458",
        "11067",
        "11334",
        "4026",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-6519",
      "hadith_no": "6519",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد العزيز بن رفيع، عن زيد بن وهب، عن أبي ذر  رضى الله عنه  قال خرجت ليلة من الليالي فإذا رسول الله صلى الله عليه وسلم يمشي وحده، وليس معه إنسان  قال  فظننت أنه يكره أن يمشي معه أحد  قال  فجعلت أمشي في ظل القمر فالتفت فرآني فقال ‏\"‏ من هذا ‏\"‏‏.‏ قلت أبو ذر جعلني الله فداءك‏.‏ قال ‏\"‏ يا أبا ذر تعاله ‏\"‏‏.‏ قال فمشيت معه ساعة فقال ‏\"‏ إن المكثرين هم المقلون يوم القيامة، إلا من أعطاه الله خيرا، فنفح فيه يمينه وشماله وبين يديه ووراءه، وعمل فيه خيرا ‏\"‏‏.‏ قال فمشيت معه ساعة فقال لي ‏\"‏ اجلس ها هنا ‏\"‏‏.‏ قال فأجلسني في قاع حوله حجارة فقال لي ‏\"‏ اجلس ها هنا حتى أرجع إليك ‏\"‏‏.‏ قال فانطلق في الحرة حتى لا أراه فلبث عني فأطال اللبث، ثم إني سمعته وهو مقبل وهو يقول ‏\"‏ وإن سرق وإن زنى ‏\"‏‏.‏ قال فلما جاء لم أصبر حتى قلت يا نبي الله جعلني الله فداءك من تكلم في جانب الحرة ما سمعت أحدا يرجع إليك شيئا‏.‏ قال ‏\"‏ ذلك جبريل  عليه السلام  عرض لي في جانب الحرة، قال بشر أمتك أنه من مات لا يشرك بالله شيئا دخل الجنة، قلت يا جبريل وإن سرق وإن زنى قال نعم‏.‏ قال قلت وإن سرق وإن زنى قال نعم، وإن شرب الخمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Once I went out at night and found Allah's Apostle walking all alone accompanied by nobody, and I thought that perhaps he disliked that someone should accompany him. So I walked in the shade, away from the moonlight, but the Prophet looked behind and saw me and said, \"Who is that?\" I replied, \"Abu Dhar, let Allah get me sacrificed for you!\" He said, \"O Abu Dhar, come here!\" So I accompanied him for a while and then he said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except him whom Allah gives wealth which he gives (in charity) to his right, left, front and back, and does good deeds with it. I walked with him a little longer. Then he said to me, \"Sit down here.\" So he made me sit in an open space surrounded by rocks, and said to me, \"Sit here till I come back to you.\" He went towards Al-Harra till I could not see him, and he stayed away for a long period, and then I heard him saying, while he was coming, \"Even if he had committed theft, and even if he had committed illegal sexual intercourse?\" When he came, I could not remain patient and asked him, \"O Allah's Prophet! Let Allah get me sacrificed for you! Whom were you speaking to by the side of Al-Harra? I did not hear anybody responding to your talk.\" He said, \"It was Gabriel who appeared to me beside Al-Harra and said, 'Give the good news to your followers that whoever dies without having worshipped anything besides Allah, will enter Paradise.' I said, 'O Gabriel! Even if he had committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes.' \"",
      "usc_msa_ref": "450",
      "chain": [
        "30367",
        "20028",
        "11257",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-6719",
      "hadith_no": "6719",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن المعرور، عن أبي ذر، قال انتهيت إليه وهو يقول في ظل الكعبة ‏\"‏ هم الأخسرون ورب الكعبة، هم الأخسرون ورب الكعبة ‏\"‏ قلت ما شأني أيرى في شىء ما شأني فجلست إليه وهو يقول، فما استطعت أن أسكت، وتغشاني ما شاء الله، فقلت من هم بأبي أنت وأمي يا رسول الله قال ‏\"‏ الأكثرون أموالا، إلا من قال هكذا وهكذا وهكذا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     I reached him (the Prophet ) while in the shade of the Ka`ba; he was saying, \"They are the losers, by the Lord of the Ka`ba! They are the losers, by the Lord of the Ka`ba!\" I said (to myself ), \"What is wrong with me? Is anything improper detected in me? What is wrong with me? Then I sat beside him and he kept on saying his statement. I could not remain quiet, and Allah knows in what sorrowful state I was at that time. So I said, ' Who are they (the losers)? Let My father and mother be sacrificed for you, O Allah's Apostle!\" He said, \"They are the wealthy people, except the one who does like this and like this and like this (i.e., spends of his wealth in Allah's Cause).",
      "usc_msa_ref": "633",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-7484",
      "hadith_no": "7484",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن ربعي بن حراش، عن خرشة بن الحر، عن أبي ذر، قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل قال ‏\"‏ باسمك نموت ونحيا، فإذا استيقظ قال الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     When the Prophet went to bed at night, he used to say: \"Bismika namutu wa nahya.\" And when he got up in the morning, he used to say, \"Al hamdu li l-lahi al-ladhi ahyana ba'da ma amatana, wa ilaihi-nnushur.\"",
      "usc_msa_ref": "",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11334",
        "4026",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-7513",
      "hadith_no": "7513",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم  هو التيمي  عن أبيه، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس، فلما غربت الشمس قال ‏\"‏ يا أبا ذر هل تدري أين تذهب هذه ‏\"‏‏.‏ قال قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب تستأذن في السجود فيؤذن لها، وكأنها قد قيل لها ارجعي من حيث جئت‏.‏ فتطلع من مغربها ‏\"‏‏.‏ ثم قرأ ‏{‏ذلك مستقر لها‏}‏ في قراءة عبد الله‏.‏",
      "text_en": " Narrated Abu Dharr:                     I entered the mosque while Allah's Apostle was sitting there. When the sun had set, the Prophet said, \"O Abu Dharr! Do you know where this (sun) goes?\" I said, \"Allah and His Apostle know best.\" He said, \"It goes and asks permission to prostrate, and it is allowed, and (one day) it, as if being ordered to return whence it came, then it will rise from the west.\" Then the Prophet recited, \"That: \"And the sun runs on its fixed course (for a term decreed),\" (36.38) as it is recited by `Abdullah.",
      "usc_msa_ref": "520",
      "chain": [
        "30397",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-7523",
      "hadith_no": "7523",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا وكيع، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت النبي صلى الله عليه وسلم عن قوله ‏{‏والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     I asked the Prophet regarding the Verse:--'And the sun runs on its fixed course for a term decreed for it.' (36.28) He said, \"Its fixed course is underneath Allah's Throne.\"",
      "usc_msa_ref": "",
      "chain": [
        "30157",
        "20032",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-7578",
      "hadith_no": "7578",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن واصل، عن المعرور، قال سمعت أبا ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل فبشرني أنه من مات لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن سرق وإن زنى قال ‏\"‏ وإن سرق وإن زنى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Prophet said, Gabriel came to me and gave me the glad tidings that anyone who died without worshipping anything besides Allah, would enter Paradise. I asked (Gabriel), 'Even if he committed theft, and even if he committed illegal sexual intercourse?' He said, '(Yes), even if he committed theft, and even if he Committed illegal sexual intercourse.\"",
      "usc_msa_ref": "579",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11401",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-226",
      "hadith_no": "226",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، حدثنا حسين المعلم، عن ابن بريدة، عن يحيى بن يعمر، أن أبا الأسود، حدثه عن أبي ذر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر ومن ادعى ما ليس له فليس منا وليتبوأ مقعده من النار ومن دعا رجلا بالكفر أو قال عدو الله ‏.‏ وليس كذلك إلا حار عليه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Dharr that he heard the Messenger of Allah (may peace and blessings be upon him) saying:                      No person who claimed knowingly anyone else as his father besides (his own) committed nothing but infidelity, and he who made a claim of anything, which (in fact) did not belong to him, is not amongst us; he should make his abode in Fire, and he who labeled anyone with unbelief or called him the enemy of Allah, and he was in fact not so, it rebounded on him.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-260",
      "hadith_no": "260",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو الربيع الزهراني، حدثنا حماد بن زيد، حدثنا هشام بن عروة، ح وحدثنا خلف بن هشام، - واللفظ له - حدثنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن أبي مراوح الليثي، عن أبي ذر، قال قلت يا رسول الله أى الأعمال أفضل قال ‏\"‏ الإيمان بالله والجهاد في سبيله ‏\"‏ ‏.‏ قال قلت أى الرقاب أفضل قال ‏\"‏ أنفسها عند أهلها وأكثرها ثمنا ‏\"‏ ‏.‏ قال قلت فإن لم أفعل قال ‏\"‏ تعين صانعا أو تصنع لأخرق ‏\"‏ ‏.‏ قال قلت يا رسول الله أرأيت إن ضعفت عن بعض العمل قال ‏\"‏ تكف شرك عن الناس فإنها صدقة منك على نفسك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I said: Messenger of Allah, which of the deeds is the best? He (the Holy Prophet) replied: Belief in Allah and Jihad in His cause. I again asked: Who is the slave whose emancipation is the best? He (the Holy Prophet) replied: One who is valuable for his master and whose price is high. I said: If I can't afford to do it? He (the Holy Prophet) replied: Help an artisan or make anything for the unskilled (labourer). I (Abu Dharr) said: Messenger of Allah, you see that I am helpless in doing some of these deeds. He (the Holy Prophet) replied: Desist from doing mischief to the people. That is the charity of your person on your behalf.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20022",
        "11065",
        "30503",
        "20022",
        "11065",
        "10511",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-261",
      "hadith_no": "261",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن حبيب، مولى عروة بن الزبير عن عروة بن الزبير، عن أبي مراوح، عن أبي ذر، عن النبي صلى الله عليه وسلم بنحوه غير أنه قال ‏\"‏ فتعين الصانع أو تصنع لأخرق ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Abu Rafi' narrated the hadith on the authority of Abu Dharr with a slight difference.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "10511",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-282",
      "hadith_no": "282",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن واصل الأحدب، عن المعرور بن سويد، قال سمعت أبا ذر، يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أتاني جبريل - عليه السلام - فبشرني أنه من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق ‏.‏ قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏",
      "text_en": " I heard Abu Dharr narrating it from the Apostle (may peace be upon him) that he observed:                      Gabriel came to me and gave me the tidings: Verily he who died amongst your Ummah without associating anything with Allah would enter Paradise. I (the narrator) said: Even if he committed adultery and theft. He (the Holy Prophet) said: (Yes), even if he committed adultery and theft.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11401",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-283",
      "hadith_no": "283",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وأحمد بن خراش، قالا حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي قال، حدثني حسين المعلم، عن ابن بريدة، أن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر حدثه قال أتيت النبي صلى الله عليه وسلم وهو نائم عليه ثوب أبيض ثم أتيته فإذا هو نائم ثم أتيته وقد استيقظ فجلست إليه فقال ‏\"‏ ما من عبد قال لا إله إلا الله ثم مات على ذلك إلا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ ثلاثا ثم قال في الرابعة ‏\"‏ على رغم أنف أبي ذر ‏\"‏ قال فخرج أبو ذر وهو يقول وإن رغم أنف أبي ذر ‏.‏",
      "text_en": " Abu Dharr reported,:                      I came to the Apostle (may peace be upon him ) and he was asleep with a white mantle over him. I again came, he was still asleep, I came again and he had awakened. I sat by his side and (the Holy Prophet) observed: There is none among the bondsmen who affirmed his faith in La illaha ill-Allah there is no God but Allah) and died in this state and did not enter Paradise. I (Abu Dharr) said: Even if he committed adultery and theft? He (the Holy Prophet) replied: (Yes) even though he committed adultery and theft. I (again said): Even if he committed adultery and theft? He replied: (Yes) even though he committed adultery and theft. (Th Holy Prophet repeated it three times) and said for the fourth time: In defiance of Abu Dharr. Abu Dharr then went out and he repeated (these words): In defiance of Abu Dharr.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-306",
      "hadith_no": "306",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد بن جعفر، عن شعبة، عن علي بن مدرك، عن أبي زرعة، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ قال فقرأها رسول الله صلى الله عليه وسلم ثلاث مرار ‏.‏ قال أبو ذر خابوا وخسروا من هم يا رسول الله قال ‏\"‏ المسبل والمنان والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It is narrated o the authority of Abu Dharr that the Messenger of Allah (may ace he upon him) observed:                      Three are the (persons) with whom Allah would neither speak on the Day of Resurrection, nor would look at them nor would absolve the and there is a painful chastisement for them. The Messenger of Allah (may peace be upon him) repeated it three times. Abu Dharr remarked: They failed and they lost; who are these persons, Messenger of Allah? Upon this he (the Holy) Prophet) observed: They are: the dragger of lower garment, the recounter of obligation the seller of goods by false oath.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-307",
      "hadith_no": "307",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو بكر بن خلاد الباهلي، حدثنا يحيى، - وهو القطان - حدثنا سفيان، حدثنا سليمان الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة المنان الذي لا يعطي شيئا إلا منه والمنفق سلعته بالحلف الفاجر والمسبل إزاره ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr who narrates that the Prophet (may peace be upon him) observed:                      Three are the persons with whom Allah would not speak on the Day of Resurrection: the bestower of gift who does not give anything but by laying obligation on him, the seller of goods who sells them by taking false oath and one who hangs low his lower garment.",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "20031",
        "20012",
        "11060",
        "5077",
        "4026",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-418",
      "hadith_no": "418",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وإسحاق بن إبراهيم، جميعا عن ابن علية، - قال ابن أيوب حدثنا ابن علية، - حدثنا يونس، عن إبراهيم بن يزيد التيمي، - سمعه فيما، أعلم - عن أبيه، عن أبي ذر، أن النبي صلى الله عليه وسلم قال يوما ‏\"‏ أتدرون أين تذهب هذه الشمس ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ إن هذه تجري حتى تنتهي إلى مستقرها تحت العرش فتخر ساجدة ولا تزال كذلك حتى يقال لها ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعة من مطلعها ثم تجري حتى تنتهي إلى مستقرها تحت العرش فتخر ساجدة ولا تزال كذلك حتى يقال لها ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعة من مطلعها ثم تجري لا يستنكر الناس منها شيئا حتى تنتهي إلى مستقرها ذاك تحت العرش فيقال لها ارتفعي أصبحي طالعة من مغربك فتصبح طالعة من مغربها ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتدرون متى ذاكم ذاك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr that the Messenger of Allah (may peace be upon him) one day said:                      Do you know where the sun goes? They replied: Allah and His Apostle know best. He (the Holy Prophet) observed: Verily it (the sun) glides till it reaches its resting place under the Throne. Then it falls prostrate and remains there until it is asked: Rise up and go to the place whence you came, and it goes back and continues emerging out from its rising place and then glides till it reaches its place of rest under the Throne and falls prostrate and remains in that state until it is asked: Rise up and return to the place whence you came, and it returns and emerges out from it rising place and the it glides (in such a normal way) that the people do not discern anything ( unusual in it) till it reaches its resting place under the Throne. Then it would be said to it: Rise up and emerge out from the place of your setting, and it will rise from the place of its setting. The Messenger of Allah (may peace be upon him) said. Do you know when it would happen? It would happen at the time when faith will not benefit one who has not previously believed or has derived no good from the faith.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30123",
        "20208",
        "20208",
        "20475",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-419",
      "hadith_no": "419",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبد الحميد بن بيان الواسطي، أخبرنا خالد، - يعني ابن عبد الله - عن يونس، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، أن النبي صلى الله عليه وسلم قال يوما ‏\"‏ أتدرون أين تذهب هذه الشمس ‏\"‏ بمثل معنى حديث ابن علية ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr that the Apostle of Allah (may peace be upon him) one day said:                      Do you know where the sun goes? The remaining part of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "20423",
        "20475",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-420",
      "hadith_no": "420",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس فلما غابت الشمس قال ‏\"‏ يا أبا ذر هل تدري أين تذهب هذه ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تذهب فتستأذن في السجود فيؤذن لها وكأنها قد قيل لها ارجعي من حيث جئت فتطلع من مغربها ‏\"‏ ‏.‏ قال ثم قرأ في قراءة عبد الله وذلك مستقر لها ‏.‏",
      "text_en": " Abu Dharr reported:                      I entered the mosque and the Messenger of Allah (may peace be upon him) was sitting there. When the sun disappeared (from the sight) he said: O Abu Dharr! Do you know where it goes? He (the narrator) said: Allah and His Apostle know best. He (the Holy Prophet) said. Verily it goes and begs permission, for prostration (to Allah) and the permission is granted to it. Once it would be said: Return to the place whence you came, and then it would rise from its setting place. Then he, after the recitation of 'Abdullah recited it: And that is its appointed term.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-421",
      "hadith_no": "421",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سعيد الأشج، وإسحاق بن إبراهيم، - قال إسحاق أخبرنا وقال الأشج، حدثنا - وكيع، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت رسول الله صلى الله عليه وسلم عن قول الله تعالى ‏{‏ والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I asked the Messenger of Allah (may peace be upon him) the (implication of the) words of Allah, the Exalted: The sun glides to its appointed resting place. He replied: Its appointed resting place is under the Throne.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "30123",
        "30312",
        "30200",
        "20032",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-433",
      "hadith_no": "433",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أنس بن مالك، قال كان أبو ذر يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقف بيتي وأنا بمكة فنزل جبريل صلى الله عليه وسلم ففرج صدري ثم غسله من ماء زمزم ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا فأفرغها في صدري ثم أطبقه ثم أخذ بيدي فعرج بي إلى السماء فلما جئنا السماء الدنيا قال جبريل - عليه السلام - لخازن السماء الدنيا افتح ‏.‏ قال من هذا قال هذا جبريل ‏.‏ قال هل معك أحد قال نعم معي محمد صلى الله عليه وسلم ‏.‏ قال فأرسل إليه قال نعم ففتح - قال - فلما علونا السماء الدنيا فإذا رجل عن يمينه أسودة وعن يساره أسودة - قال - فإذا نظر قبل يمينه ضحك وإذا نظر قبل شماله بكى - قال - فقال مرحبا بالنبي الصالح والابن الصالح - قال - قلت يا جبريل من هذا قال هذا آدم صلى الله عليه وسلم وهذه الأسودة عن يمينه وعن شماله نسم بنيه فأهل اليمين أهل الجنة والأسودة التي عن شماله أهل النار فإذا نظر قبل يمينه ضحك وإذا نظر قبل شماله بكى - قال - ثم عرج بي جبريل حتى أتى السماء الثانية ‏.‏ فقال لخازنها افتح - قال - فقال له خازنها مثل ما قال خازن السماء الدنيا ففتح ‏\"‏ ‏.‏ فقال أنس بن مالك فذكر أنه وجد في السموات آدم وإدريس وعيسى وموسى وإبراهيم - صلوات الله عليهم أجمعين - ولم يثبت كيف منازلهم غير أنه ذكر أنه قد وجد آدم - عليه السلام - في السماء الدنيا وإبراهيم في السماء السادسة ‏.‏ قال ‏\"‏ فلما مر جبريل ورسول الله صلى الله عليه وسلم بإدريس - صلوات الله عليه - قال مرحبا بالنبي الصالح والأخ الصالح - قال - ثم مر فقلت من هذا فقال هذا إدريس - قال - ثم مررت بموسى - عليه السلام - فقال مرحبا بالنبي الصالح والأخ الصالح - قال - قلت من هذا قال هذا موسى - قال - ثم مررت بعيسى فقال مرحبا بالنبي الصالح والأخ الصالح ‏.‏ قلت من هذا قال عيسى ابن مريم - قال - ثم مررت بإبراهيم - عليه السلام - فقال مرحبا بالنبي الصالح والابن الصالح - قال - قلت من هذا قال هذا إبراهيم ‏\"‏ ‏.‏ قال ابن شهاب وأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال رسول الله صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع فيه صريف الأقلام ‏\"‏ ‏.‏ قال ابن حزم و أنس بن مالك قال رسول الله صلى الله عليه وسلم ‏\"‏ ففرض الله على أمتي خمسين صلاة - قال - فرجعت بذلك حتى أمر بموسى فقال موسى عليه السلام ماذا فرض ربك على أمتك - قال - قلت فرض عليهم خمسين صلاة ‏.‏ قال لي موسى عليه السلام فراجع ربك فإن أمتك لا تطيق ذلك - قال - فراجعت ربي فوضع شطرها - قال - فرجعت إلى موسى - عليه السلام - فأخبرته قال راجع ربك فإن أمتك لا تطيق ذلك - قال - فراجعت ربي فقال هي خمس وهى خمسون لا يبدل القول لدى - قال - فرجعت إلى موسى فقال راجع ربك ‏.‏ فقلت قد استحييت من ربي - قال - ثم انطلق بي جبريل حتى نأتي سدرة المنتهى فغشيها ألوان لا أدري ما هي - قال - ثم أدخلت الجنة فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      Abu Dharr used to relate that the Messenger of Allah (may peace be upon him) said: The roof of my house was cleft when I was in Mecca and Gabriel descended and opened my heart and then washed it with the water of Zamzam. He then brought a gold basin full of wisdom and faith and after emptying it into my breast, he closed it up. Then taking me by he hand, he ascended with me to th heaven, and when we came to the lowest heaven, Gabriel said to the guardian of the lowest heaven: Open. He asked who was there? He replied. It is Gabriel. He again asked whe he there was someone with him. He replied: Yes, it is Muhammad with me. He was asked if he had been sent for, He (Gabriel) said: Yes. Then he opened (the gate). When we ascended the lowest heaven (I saw) a man seated with parties on his right side and parties on his left side. When he looked up to his right, he laughed and when he looked to his left, he wept. He said: Welcome to the righteous apostle and the righteous son. I asked Gabriel who he was and he replied: He is Adam (peace be upon him) and these parties on his right and on his left are the souls of his descendants. Those of them on his right are the inmates of Paradise and the parties which are on his left side are the inmates of Hell; so when he looked towards his right side, he laughed, and when he looked towards his left side, he wept. Then Gabriel ascended with me to the second heaven. He asked its guardian to open (its gate), and its guardian replied in the same way as the guardian of the lowest heaven had said. He (opened it). Anas b. Malik said: He (the Holy Prophet) mentioned that he found in the heavens Adam, Idris, Jesus, Moses and Abraham (may peace be on all of them), but he did not ascertain as to the nature of their abodes except that he had found Adam in the lowest heaven and Abraham in the sixth heaven. When Gabriel and the Messenger of Allah (may peace be upon him) passed by Idris (peace be upon him) he said: Welcome to the righteous apostle and righteous brother. He (the narrator) said: He then proceeded and said: Who is he? Gabriel replied: It is Idris. Then I passed by Moses (peace be upon him) and he said: Welcome tothe righteous apostle and righteous brother. I said to (Gabriel): Who is he? He replied: It is Moses. Then I passed by Jesus and he said: Welcome to the righteous apostle and righteous brother. I said (to Gabriel): Who is he? He replied: Jesus, son of Mary. He (the Holy Prophet) said: Then I went to Ibrahim (peace be upon him). He said: Welcome to the righteous apostle and righteous son. I asked: Who is he? He (Gabriel) replied: It is Abraham. Ibn Shihab said: Ibn Hazm told me that Ibn 'Abbas and Abd Habba al-Ansari used to say that the Messenger of Allah (may peace be upon him) said: Thereafter he ascended with me till I was taken to such a height where I heard the scraping of the pens. Ibn Hazm and Anas told that the Messenger of Allah (may peace be upon him) said: Allah then made fifty prayers obligatory for my Ummah and I returned with that and passed by Moses. Moses, (peace be upon him) said: What has thy Lord enjoined on thy people? I said: Fifty prayers have been made obligatory on them. Moses (peace be upon him) said: Return to thy Lord, for thy Ummah would not be able to bear this burden. Then I came back to my Lord and He remitted a portion out of thut. I then again went to Moses (peace be upon him) and informed him about it He said: Return to thy Lord, for thy Ummah shall not be able to bear this burden. I then went back to my Lord and He said: They are five and at the same time fifty, and what has been said will not be changed. I then returned to Moses and he said: Go back to thy Lord. whereupon I said: I feel ashamed of my Lord. Gabriel then travelled with me till we came to the farthest lote-tree Many a colour had covered it which I do not know. Then I was admitted to Paradise and saw in it domes of pearls, and its soil of musk.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-461",
      "hadith_no": "461",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن يزيد بن إبراهيم، عن قتادة، عن عبد الله بن شقيق، عن أبي ذر، قال سألت رسول الله صلى الله عليه وسلم هل رأيت ربك قال ‏\"‏ نور أنى أراه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr:                      I asked the Messenger of Allah (may peace be upon him): Did you see thy Lord? He said: He is a Light;. bow could I see Him?",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20303",
        "11019",
        "10694",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-487",
      "hadith_no": "487",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعلم آخر أهل الجنة دخولا الجنة وآخر أهل النار خروجا منها رجل يؤتى به يوم القيامة فيقال اعرضوا عليه صغار ذنوبه وارفعوا عنه كبارها ‏.‏ فتعرض عليه صغار ذنوبه فيقال عملت يوم كذا وكذا كذا وكذا وعملت يوم كذا وكذا كذا وكذا ‏.‏ فيقول نعم ‏.‏ لا يستطيع أن ينكر وهو مشفق من كبار ذنوبه أن تعرض عليه ‏.‏ فيقال له فإن لك مكان كل سيئة حسنة ‏.‏ فيقول رب قد عملت أشياء لا أراها ها هنا ‏\"‏ ‏.‏ فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) said:                      I know the last of the inhabitants of Paradise to enter it and the last of the inhabitants of Hell to come out of it. He is a man who would be brought on the Day of Resurrection and it will be said: Present his minor sins to him, and withhold from him his serious Sins. Then the minor sins would be placed before him, and it would be said: On such and such a day you did so and so and on such and such a day you did so and so. He would say: Yes. It will not be possible for him to deny, while he would be afraid lest serious sins chould be presented before him. It would be said to him: In place of every evil deed you will have good deed He will say: My Lord! I have done things I do not see here. I indeed saw the Messenger of Allah laugh till his front teeth were exposed.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-510-2",
      "hadith_no": "510",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، ح قال وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن يونس، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام أحدكم يصلي فإنه يستره إذا كان بين يديه مثل آخرة الرحل فإذا لم يكن بين يديه مثل آخرة الرحل فإنه يقطع صلاته الحمار والمرأة والكلب الأسود ‏\"‏ ‏.‏ قلت يا أبا ذر ما بال الكلب الأسود من الكلب الأحمر من الكلب الأصفر قال يا ابن أخي سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of 'Allah (may peace be upon him) said: When any one of you stands for prayer and there is a thing before him equal to the back of the saddle that covers him and in case there is not before him (a thing) equal to the back of the saddle, his prayer would be cut off by (passing of an) ass, woman, and black Dog. I said: O Abu Dharr, what feature is there in a black dog which distinguish it from the red dog and the yellow dog? He said: O, son of my brother, I asked the Messenger of Allah (may peace be upon him) as you are asking me, and he said: The black dog is a devil.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "30022",
        "20208",
        "20475",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1189",
      "hadith_no": "1189",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني أبو كامل الجحدري، حدثنا عبد الواحد، حدثنا الأعمش، ح قال وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال قلت يا رسول الله أى مسجد وضع في الأرض أول قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون سنة وأينما أدركتك الصلاة فصل فهو مسجد ‏\"‏ ‏.‏ وفي حديث أبي كامل ‏\"‏ ثم حيثما أدركتك الصلاة فصله فإنه مسجد ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I said: Messenger of Allah, which mosque was set up first on the earth? He said: Al-Masjid al-Haram (the sacred). I (again) said: Then which next? He said: It was the Masjid Aqsa. I (again) said: How long the space of time (between their setting up)? He (the Holy Prophet) said: It was forty years. And whenever the time comes for prayer, pray there, for that is a mosque; and in the hadith transmitted by Abu Kamil (the words are):\" Whenever time comes for prayer, pray, for that is a mosque (for you).\"",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "11060",
        "30201",
        "30216",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1190",
      "hadith_no": "1190",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا الأعمش، عن إبراهيم بن يزيد التيمي، قال كنت أقرأ على أبي القرآن في السدة فإذا قرأت السجدة سجد فقلت له يا أبت أتسجد في الطريق قال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم عن أول مسجد وضع في الأرض قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون عاما ثم الأرض لك مسجد فحيثما أدركتك الصلاة فصل ‏\"‏ ‏.‏",
      "text_en": " Ibrahim b. Yazid al-Tayml reported:                      I used to read the Qur'an with my father in the vestibule (before the door of the mosque). When I recited the ayat (verses) concerning prostration, he prostrated himself. I said to him: Father, do you prostrate yourself in the path? He said: I heard Abu Dharr saying: I asked the Messenger of Allah (may peace be upon him) about the mosque that was first set up on the earth. He said: Masjid Harim. I said: Then which next? He said: The Masjid al-Aqsa. I said: How long is the space of time between the two? He said: Forty years. He (then) further said: The earth is a mosque for you, so wherever you are at the time of prayer, pray there.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11322",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1261",
      "hadith_no": "1261",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء الضبعي، وشيبان بن فروخ، قالا حدثنا مهدي بن ميمون، حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ عرضت على أعمال أمتي حسنها وسيئها فوجدت في محاسن أعمالها الأذى يماط عن الطريق ووجدت في مساوي أعمالها النخاعة تكون في المسجد لا تدفن ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Apostle of Allah (may peace be upon him) said: The deeds of my people, good and bad, were presented before me, and I found the removal of something objectionable from the road among their good deeds, and the sputum mucus left unburied in the mosque among their evil deeds.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11307",
        "11729",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1431",
      "hadith_no": "1431",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت مهاجرا أبا الحسن، يحدث أنه سمع زيد بن وهب، يحدث عن أبي ذر، قال أذن مؤذن رسول الله صلى الله عليه وسلم بالظهر فقال النبي صلى الله عليه وسلم ‏\"‏ أبرد أبرد ‏\"‏ ‏.‏ أو قال ‏\"‏ انتظر انتظر ‏\"‏ ‏.‏ وقال ‏\"‏ إن شدة الحر من فيح جهنم فإذا اشتد الحر فأبردوا عن الصلاة ‏\"‏ ‏.‏ قال أبو ذر حتى رأينا فىء التلول ‏.‏",
      "text_en": " Abu Dharr reported:                      The Mu'adhdbin (the announcer of the hour of prayer) of the Messenger of Allah (may peace be upon him) called for the noon prayer. Upon this the Apostle of Allah (may peace be upon him) said: Let it cool down, let it cool down, or he said: Wait, wait for the intensity of heat is from the exhalation of Hell. When the heat is intense, delay the prayer till it becomes cooler. Abu Dharr said: (We waited) till we saw the shadow of the mounds.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1497",
      "hadith_no": "1497",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، ح قال وحدثني أبو الربيع الزهراني، وأبو كامل الجحدري قالا حدثنا حماد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله ‏\"‏ كيف أنت إذا كانت عليك أمراء يؤخرون الصلاة عن وقتها أو يميتون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قلت فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصل فإنها لك نافلة ‏\"‏ ‏.‏ ولم يذكر خلف عن وقتها ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: How would you act when you are under the rulers who would delay the prayer beyond its prescribed time, or they would make prayer a dead thing as far as its proper time is concerned? I said: What do you command? He (the Holy Prophet) said: Observe the prayer at Its proper time, and if you can say it along with them do so, for it would be a superetogatory prayer for you. Khalaf (one of the narrators in the above hadith) has not mentioned\" beyond their (prescribed) time\".",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "30137",
        "30559",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1498",
      "hadith_no": "1498",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا جعفر بن سليمان، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إنه سيكون بعدي أمراء يميتون الصلاة فصل الصلاة لوقتها فإن صليت لوقتها كانت لك نافلة وإلا كنت قد أحرزت صلاتك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: O Abu Dharr, you would soon find after me rulers who would make their prayers dead. You should say prayer at its prescribed time. If you say prayer at its prescribed time that would be a supererogatory prayer for you, otherwise you saved your prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20532",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1499",
      "hadith_no": "1499",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن شعبة، عن أبي عمران، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي أوصاني أن أسمع وأطيع وإن كان عبدا مجدع الأطراف وأن أصلي الصلاة لوقتها ‏\"‏ فإن أدركت القوم وقد صلوا كنت قد أحرزت صلاتك وإلا كانت لك نافلة ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      My friend (the Holy Prophet) bade me to hear and obey (the ruler) even if he is a slave having his feet and arms cut off, and observe prayer at its prescribed time. (And further said): It you find people having observed the prayer, you in fact saved your prayer, otherwise (if you join with them) that would be a Nafl prayer for you.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20020",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1500",
      "hadith_no": "1500",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) struck my thigh and said: How would you act if you survive among the people who would delay prayers beyond their (prescribed) time? He (Abu Dharr) said: What do you command (under this situation)? He (the Holy Prophet) slid: Observe prayer at its prescribed time, then go (to meet) your needs, and if the Iqama is pronounced, and you are present in the mosque, then observe prayer (along with the Jama'at).",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1502",
      "hadith_no": "1502",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي نعامة، عن عبد الله بن الصامت، عن أبي ذر، قال قال ‏\"‏ كيف أنتم - أو قال كيف أنت - إذا بقيت في قوم يؤخرون الصلاة عن وقتها فصل الصلاة لوقتها ثم إن أقيمت الصلاة فصل معهم فإنها زيادة خير ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      (The Messenger of Allah) said: How would you, or how would thou, act if you survive to live among people who defer prayer beyond the (prescribed) time? (The narrator said: Allah and His Messenger know best). whereupon he said: Observe prayer at its prescribed time, but if the Iqama is pronounced for (congregational) prayer, then observe prayer along with them. for herein is an excess of virtue.",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "20020",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1503",
      "hadith_no": "1503",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن مطر، عن أبي العالية البراء، قال قلت لعبد الله بن الصامت نصلي يوم الجمعة خلف أمراء فيؤخرون الصلاة - قال - فضرب فخذي ضربة أوجعتني وقال سألت أبا ذر عن ذلك فضرب فخذي وقال سألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ صلوا الصلاة لوقتها واجعلوا صلاتكم معهم نافلة ‏\"‏ ‏.‏ قال وقال عبد الله ذكر لي أن نبي الله صلى الله عليه وسلم ضرب فخذ أبي ذر ‏.‏",
      "text_en": " Abu'l-'Aliyat al-Bara' reported:                      I said to 'Abdullah b. Samit: We say our Jumu'a prayer behind those rulers who defer the prayer. He ('Abdullah b. Samit), struck. my thigh that I felt pain and said: I asked Abu Dharr about it, he struck my thigh and said: I asked the Messenger of Allah (may peace be upon him) about it. Upon this he said: Observe prayer at its prescribed time, and treat prayer along with them (along with those Imams who deter prayer) as Nafl. 'Abdullah said: It was narrated to me that the Messenger of Allah (may peace be upon him) struck the thigh of Abd Dharr.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11618",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1704",
      "hadith_no": "1704",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي، - وهو ابن ميمون - حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الدؤلي، عن أبي ذر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ يصبح على كل سلامى من أحدكم صدقة فكل تسبيحة صدقة وكل تحميدة صدقة وكل تهليلة صدقة وكل تكبيرة صدقة وأمر بالمعروف صدقة ونهى عن المنكر صدقة ويجزئ من ذلك ركعتان يركعهما من الضحى ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Apostle (may peace be upon him) as saying:                      In the morning charity is due from every bone in the body of every one of you. Every utterance of Allah's glorification is an act of charity. Every utterance of praise of Him is an act of charity, every utterance of profession of His Oneness is an act of charity, every utterance of profession of His Greatness is an act of charity, enjoining good is an act of charity, forbidding what is distreputable is an act of charity, and two rak'ahs which one prays in the forenoon will suffice.",
      "usc_msa_ref": "",
      "chain": [
        "11307",
        "11729",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-2347",
      "hadith_no": "2347",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال انتهيت إلى النبي صلى الله عليه وسلم وهو جالس في ظل الكعبة ‏.‏ فلما رآني قال ‏\"‏ هم الأخسرون ورب الكعبة ‏\"‏ ‏.‏ قال فجئت حتى جلست فلم أتقار أن قمت فقلت يا رسول الله فداك أبي وأمي من هم قال ‏\"‏ هم الأكثرون أموالا إلا من قال هكذا وهكذا وهكذا - من بين يديه ومن خلفه وعن يمينه وعن شماله - وقليل ما هم ما من صاحب إبل ولا بقر ولا غنم لا يؤدي زكاتها إلا جاءت يوم القيامة أعظم ما كانت وأسمنه تنطحه بقرونها وتطؤه بأظلافها كلما نفدت أخراها عادت عليه أولاها حتى يقضى بين الناس ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I went to the Apostle of Allah (may peace be upon him) and he was sitting under the shade of the Ka'ba. As he saw me he said: By the Lord of the Ka'ba, they are the losers. I came there till I sat and I could not stay (longer) and (then) stood up. I said: Messenger of Allah, let my father, be ransom for you, who are they (the losers)? He said: They are those having a huge amount of wealth except so and so and (those who spend their wealth generously on them whom they find in front of them, behind them and on their right side and on their left side) and they are a few. And no owner of camels, or cattle or goat and sheep, who does not pay Zakat (would be spared punishment) but these (camels, cattle, goats and sheep) would come on the Day of Resurrection wearing more flesh and would gore him with their horns and trample them with their hooves. And when the last one would pass away, the first one would return (to trample him) till judgment would be pronounced among people.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-2348",
      "hadith_no": "2348",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثناه أبو كريب، محمد بن العلاء حدثنا أبو معاوية، عن الأعمش، عن المعرور، عن أبي ذر، قال انتهيت إلى النبي صلى الله عليه وسلم وهو جالس في ظل الكعبة ‏.‏ فذكر نحو حديث وكيع غير أنه قال ‏\"‏ والذي نفسي بيده ما على الأرض رجل يموت فيدع إبلا أو بقرا أو غنما لم يؤد زكاتها ‏\"‏ ‏.‏",
      "text_en": " Abu Dbarr reported:                      I went to the Apostle of Allah (may peace be upon him) and he was sitting under the shade of the Ka'ba, and the rest of the hadith it the same but for this that he (the Holy Prophet) said:\" By Allah, in Whose hand is my life, no person on earth who dies and leaves behind camels, or cattle or goat and sheep, and does not pay Zakat (would be spared the punishment).\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-2351",
      "hadith_no": "2351",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وابن نمير وأبو كريب كلهم عن أبي معاوية، - قال يحيى أخبرنا أبو معاوية، - عن الأعمش، عن زيد بن وهب، عن أبي، ذر قال كنت أمشي مع النبي صلى الله عليه وسلم في حرة المدينة عشاء ونحن ننظر إلى أحد فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قال قلت لبيك يا رسول الله ‏.‏ قال ‏\"‏ ما أحب أن أحدا ذاك عندي ذهب أمسى ثالثة عندي منه دينار إلا دينارا أرصده لدين إلا أن أقول به في عباد الله هكذا - حثا بين يديه - وهكذا - عن يمينه - وهكذا - عن شماله ‏\"‏ ‏.‏ قال ثم مشينا فقال ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قال قلت لبيك يا رسول الله ‏.‏ قال ‏\"‏ إن الأكثرين هم الأقلون يوم القيامة إلا من قال هكذا وهكذا وهكذا ‏\"‏ ‏.‏ مثل ما صنع في المرة الأولى قال ثم مشينا قال ‏\"‏ يا أبا ذر كما أنت حتى آتيك ‏\"‏ ‏.‏ قال فانطلق حتى توارى عني - قال - سمعت لغطا وسمعت صوتا - قال - فقلت لعل رسول الله صلى الله عليه وسلم عرض له - قال - فهممت أن أتبعه قال ثم ذكرت قوله ‏\"‏ لا تبرح حتى آتيك ‏\"‏ ‏.‏ قال فانتظرته فلما جاء ذكرت له الذي سمعت - قال - فقال ‏\"‏ ذاك جبريل أتاني فقال من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏ ‏.‏ قال قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I walked with the Messenger of Allah (may peace be upon him) on the stony ground of Medina in the afternoon and we were looking at Uhud. The Messenger of Allah (way peace by upon him) said: Abu Dharr! I said: Messenger of Allah, I am here at thy beck and call. He said: What I desire is that Uhud be gold with me and three nights should pass and there is left with me any dinar but one coin which I would keep to pay debt. (I love) to spend it among the servants of Allah like this and he pointed in front of him, and on his right side and on his left side. We then proceeded on and he said: Abu Dharr. I said: At thy beck and call, Messenger of Allah. He (the Holy Prophet) said: The rich would be poor on the Day of Resurrection, but he who spent like this and like this and like this, and he pointed as at the first time. We again went on when he said. Abu Dharr, stay where you are till I come back to you. He (the Holy Prophet) then moved on till he disappeared from my sight He (Abu Dharr) said: I heard a sound and I heard a noise. I said (to myself): The Messenger of Allah (may peace be upon him) might have met (mishap or an enemy). I wished to follow him but I remembered his command for not departing till he would come back. So I waited for him, and when he came I made a mention of what I heard. He said: it was Gabriel, who came to me and said:\" He who dies among your Ummah without associating Anything with Allah would enter Paradise. I said: Even if he committed fornication or theft? He said: Even if he committed fornication or theft.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20354",
        "20031",
        "20354",
        "11060",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-2352",
      "hadith_no": "2352",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد العزيز، - وهو ابن رفيع - عن زيد بن وهب، عن أبي ذر، قال خرجت ليلة من الليالي فإذا رسول الله صلى الله عليه وسلم يمشي وحده ليس معه إنسان قال فظننت أنه يكره أن يمشي معه أحد - قال - فجعلت أمشي في ظل القمر فالتفت فرآني فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ فقلت أبو ذر جعلني الله فداءك ‏.‏ قال ‏\"‏ يا أبا ذر تعاله ‏\"‏ ‏.‏ قال فمشيت معه ساعة فقال ‏\"‏ إن المكثرين هم المقلون يوم القيامة إلا من أعطاه الله خيرا فنفح فيه يمينه وشماله وبين يديه ووراءه وعمل فيه خيرا ‏\"‏ ‏.‏ قال فمشيت معه ساعة فقال ‏\"‏ اجلس ها هنا ‏\"‏ ‏.‏ قال فأجلسني في قاع حوله حجارة فقال لي ‏\"‏ اجلس ها هنا حتى أرجع إليك ‏\"‏ ‏.‏ قال فانطلق في الحرة حتى لا أراه فلبث عني فأطال اللبث ثم إني سمعته وهو مقبل وهو يقول ‏\"‏ وإن سرق وإن زنى ‏\"‏ ‏.‏ قال فلما جاء لم أصبر فقلت يا نبي الله جعلني الله فداءك من تكلم في جانب الحرة ما سمعت أحدا يرجع إليك شيئا ‏.‏ قال ‏\"‏ ذاك جبريل عرض لي في جانب الحرة فقال بشر أمتك أنه من مات لا يشرك بالله شيئا دخل الجنة ‏.‏ فقلت يا جبريل وإن سرق وإن زنى قال نعم ‏.‏ قال قلت وإن سرق وإن زنى قال نعم ‏.‏ قال قلت وإن سرق وإن زنى قال نعم وإن شرب الخمر ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I went out one night (and found) the Messenger of Allah (may peace be upon him) walking all alone. There was no man with him. I thought that he did not like anyone walking along with him. So I began to walk in the light of the moon. He, however turned his attention to me and saw me and said: Who is this? I said: It is Abu Dharr. Let Allah make me as ransom for you. He said: Abu Dharr, come on. He (Abu Dharr) said: So I walked along with him for some time and he said: The wealthy persons would have little (reward) on the Day of Resurrection, except upon whom Allah conferred goodness (wealth). He dispensed it to his right, left, in front of him and at his back (just as the wind diffuses fragrance) and did good with it (riches). I went along with him for some time when He said: Sit here. And he made me sit at a safe place and there were stones around it, and he said to me: Sit here till I come to you. He went away on the stony ground till I could not see him. He stayed away from me, and he prolonged his stay. Then I heard him as he came back and he was saying: Even if he committed theft and even if he committed fornication. When he came I could not help asking him: Apostle of Allah, let Allah make me ransom for you, whom were you speaking on the stony ground? I heard nobody responding to you. He (the Holy Prophet) said: It was Gabriel who met me by the side of the stony ground and said: Give glad tidings to your Ummah that he who died without associating ought with Allah would go into Paradise. I said: Gabriel, even if he committed theft and fornication? He said: Yes. I said: Even it he committed theft and fornication? He said: Yes, I again said: Even if he committed theft and fornication? He said: Yes, even if he drank wine.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11257",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-2376",
      "hadith_no": "2376",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي بن ميمون، حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي، ذر أن ناسا، من أصحاب النبي صلى الله عليه وسلم قالوا للنبي صلى الله عليه وسلم يا رسول الله ذهب أهل الدثور بالأجور يصلون كما نصلي ويصومون كما نصوم ويتصدقون بفضول أموالهم ‏.‏ قال ‏\"‏ أوليس قد جعل الله لكم ما تصدقون إن بكل تسبيحة صدقة وكل تكبيرة صدقة وكل تحميدة صدقة وكل تهليلة صدقة وأمر بالمعروف صدقة ونهى عن منكر صدقة وفي بضع أحدكم صدقة ‏\"‏ ‏.‏ قالوا يا رسول الله أيأتي أحدنا شهوته ويكون له فيها أجر قال ‏\"‏ أرأيتم لو وضعها في حرام أكان عليه فيها وزر فكذلك إذا وضعها في الحلال كان له أجر ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      some of the people from among the Companions of the Apostle of Allah (may peace be upon him) said to him: Messenger of Allah, the rich have taken away (air the) reward. They observe prayer as we do; they keep the fasts as we keep, and tray give Sadaqa out of their surplus riches. Upon this he (the Holy Prophet) said: Has Allah not prescribed for you (a course) by following which you can (also) do sadaqa? In every declaration of the glorification of Allah (i. e. saying Subhan Allah) there is a Sadaqa, and every Takbir (i. e. saying Allah-O-Akbar) is a sadaqa, and every praise of His (saying al-Hamdu Lillah) is a Sadaqa and every declaration that He is One (La illha ill-Allah) is a sadaqa, and enjoining of good is a sadaqa, and forbidding of that which is evil is a Sadaqa, and in man's sexual Intercourse (with his wife, ) there is a Sadaqa. They (the Companions) said: Messenger of Allah, is there reward for him who satisfies his sexual passion among us? He said: Tell me, if he were to devote it to something forbidden, would it not be a sin on his part? Similarly, if he were to devote it to something lawful, he should have a reward.",
      "usc_msa_ref": "",
      "chain": [
        "11307",
        "11729",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-2518",
      "hadith_no": "2518",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بعدي من أمتي - أو سيكون بعدي من أمتي - قوم يقرءون القرآن لا يجاوز حلاقيمهم يخرجون من الدين كما يخرج السهم من الرمية ثم لا يعودون فيه هم شر الخلق والخليقة ‏\"‏ ‏.‏ فقال ابن الصامت فلقيت رافع بن عمرو الغفاري أخا الحكم الغفاري قلت ما حديث سمعته من أبي ذر كذا وكذا فذكرت له هذا الحديث فقال وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Verily there would arise from my Ummah after me or soon after me a group (of people) who would recite the Qar'an, but it would not go beyond their throats, and they would pass clean through their religion just as the arrow passes through the prey, and they would never come back to it. They would be the worst among the creation and the creatures. Ibn Samit (one of the narrators) said: I met Rafi' b. 'Amr Ghifari, the brother of Al-Hakam Ghifari and I said: What is this hadith that I heard from Abu Dharr, i. e. so and so? -and then I narrated that hadith to him and said: I heard it from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20236",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-3024",
      "hadith_no": "3024",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وأبو كريب قالوا حدثنا أبو معاوية عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، - رضى الله عنه - قال كانت المتعة في الحج لأصحاب محمد صلى الله عليه وسلم خاصة ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said that Tamattu' in Hajj was a special (concession) only for the Companions of Muhammad (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-3025",
      "hadith_no": "3025",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن عياش العامري، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، - رضى الله عنه - قال كانت لنا رخصة ‏.‏ يعني المتعة في الحج ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) reported:                      Tamattu' in Hajj was a special concession for us.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20033",
        "20012",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-3026",
      "hadith_no": "3026",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن فضيل، عن زبيد، عن إبراهيم التيمي، عن أبيه، قال قال أبو ذر رضى الله عنه لا تصلح المتعتان إلا لنا خاصة ‏.‏ يعني متعة النساء ومتعة الحج ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said:                      Two are the Mut'as which were not permissible but only for us, i. e. temporary marriage with women and Tamattu' in Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "20271",
        "11335",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-4823",
      "hadith_no": "4823",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي شعيب بن الليث، حدثني الليث، بن سعد حدثني يزيد بن أبي حبيب، عن بكر بن عمرو، عن الحارث بن يزيد الحضرمي، عن ابن حجيرة الأكبر، عن أبي ذر، قال قلت يا رسول الله ألا تستعملني قال فضرب بيده على منكبي ثم قال ‏\"‏ يا أبا ذر إنك ضعيف وإنها أمانة وإنها يوم القيامة خزى وندامة إلا من أخذها بحقها وأدى الذي عليه فيها ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Dharr who said:                      I said to the Holy Prophet (may peace be upon him): Messenger of Allah, will you not appoint me to a public office? He stroked my shoulder with his hand and said: Abu Dharr, thou art weak and authority is a trust. and on the Day of judgment it is a cause of humiliation and repentance except for one who fulfils its obligations and (properly) discharges the duties attendant thereon.",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "20023",
        "11411",
        "10850",
        "10853",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-4824",
      "hadith_no": "4824",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن المقرئ، قال زهير حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر القرشي، عن سالم، بن أبي سالم الجيشاني عن أبيه، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Abu Dharr that the Messenger of of Allah (may peace be upon him) said:                      Abu Dharr, I find that thou art weak and I like for thee what I like for myself. Do not rule over (even) two persons and do not manage the property of an orphan.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30123",
        "20321",
        "1945",
        "20375",
        "10913",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-4861",
      "hadith_no": "4861",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعبد الله بن براد الأشعري، وأبو كريب قالوا حدثنا ابن إدريس، عن شعبة، عن أبي عمران، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي أوصاني أن أسمع وأطيع وإن كان عبدا مجدع الأطراف ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Dharr who said:                      My friend (i. e. the Holy Prophet) advised me to listen (to the man in position of authority) and obey (him) even if he were a slave maimed (and disabled).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30549",
        "30216",
        "20102",
        "20020",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6129",
      "hadith_no": "6129",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وابن أبي عمر المكي، - واللفظ لابن أبي شيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا عبد العزيز بن عبد، الصمد العمي عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قلت يا رسول الله ما آنية الحوض قال ‏\"‏ والذي نفس محمد بيده لآنيته أكثر من عدد نجوم السماء وكواكبها ألا في الليلة المظلمة المصحية آنية الجنة من شرب منها لم يظمأ آخر ما عليه يشخب فيه ميزابان من الجنة من شرب منه لم يظمأ عرضه مثل طوله ما بين عمان إلى أيلة ماؤه أشد بياضا من اللبن وأحلى من العسل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr said:                      Allah's Messenger, what about the vessels of that Cistern? He said: By Him in Whose Hand is the life of Muhammad, the vessels would outnumber the stars in the sky and its planets shining on a dark cloudless night. These would be the vessels of Paradise. He who drinks out of it (the Cistern) would never feel thirsty. There would flow in it two spouts from Paradise and he who would drink out of it would not feel thirsty; and the distance between its (two corners) is that between 'Amman and Aila, and its water is whiter than milk and sweeter than honey.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30123",
        "30421",
        "30312",
        "20251",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6585",
      "hadith_no": "6585",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا هداب بن خالد، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن عبد، الله بن الصامت قال قال أبو ذر قال رسول الله صلى الله عليه وسلم ‏\"‏ غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Go to your people and say that the Messenger of Allah (may peace be upon him) says: Ghifar (is a tribe) to whom Allah granted pardon, and Aslam (is the tribe) to whom Allah granted safety.",
      "usc_msa_ref": "",
      "chain": [
        "20236",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6586",
      "hadith_no": "6586",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، ومحمد بن المثنى، وابن، بشار جميعا عن  ابن مهدي، قال قال ابن المثنى حدثني عبد الرحمن بن مهدي، حدثنا شعبة، عن أبي عمران، الجوني عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ائت قومك فقل إن رسول الله صلى الله عليه وسلم قال أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30170",
        "20033",
        "20033",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6657",
      "hadith_no": "6657",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني حرملة، ح وحدثني هارون بن، سعيد الأيلي حدثنا ابن وهب، حدثني حرملة، - وهو ابن عمران التجيبي - عن عبد الرحمن، بن شماسة المهري قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم ستفتحون أرضا يذكر فيها القيراط فاستوصوا بأهلها خيرا فإن لهم ذمة ورحما فإذا رأيتم رجلين يقتتلان في موضع لبنة فاخرج منها ‏\"‏ ‏.‏ قال فمر بربيعة وعبد الرحمن ابنى شرحبيل بن حسنة يتنازعان في موضع لبنة فخرج منها ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      You would soon conquer a land where people are in the habit of using foul language. They have a right of kinship upon you. And when you see two persons fighting for the space of a brick, then get out of that. He (Abu Dharr) then happened to pass by Rabila and 'Abd al-Rahman, the two sons of Shurahbil b. Hasana, and they had been disputing for the space of a brick. So he left the land.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "30487",
        "30492",
        "20029",
        "20622",
        "10867",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6658",
      "hadith_no": "6658",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا وهب بن جرير، حدثنا  أبي، سمعت حرملة المصري، يحدث عن عبد الرحمن بن شماسة، عن أبي بصرة، عن أبي، ذر قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم ستفتحون مصر وهي أرض يسمى فيها القيراط فإذا فتحتموها فأحسنوا إلى أهلها فإن لهم ذمة ورحما ‏\"‏ ‏.‏ أو قال ‏\"‏ ذمة وصهرا فإذا رأيت رجلين يختصمان فيها في موضع لبنة فاخرج منها ‏\"‏ ‏.‏ قال فرأيت عبد الرحمن بن شرحبيل بن حسنة وأخاه ربيعة يختصمان في موضع لبنة فخرجت منها ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      You would soon conquer Egypt and that is a land which is known (as the land of al-qirat). So when you conquer it, treat its inhabitants well. For there lies upon you the responsibility because of blood-tie or relationship of marriage (with them). And when you see two persons falling into dispute amongst themselves for the space of a brick, than get out of that. He (Abu Dharr) said: I saw Abd al-Rahman b. Shurahbil b. Hasana and his brother Rabi'a disputing with one another for the space of a brick. So I left that (land).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30359",
        "20298",
        "11272",
        "10867",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6737",
      "hadith_no": "6737",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن بن بهرام الدارمي، حدثنا مروان، - يعني ابن محمد الدمشقي - حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم فيما روى عن الله، تبارك وتعالى أنه قال ‏\"‏ يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعا فاستغفروني أغفر لكم يا عبادي إنكم لن تبلغوا ضري فتضروني ولن تبلغوا نفعي فتنفعوني يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد ما نقص ذلك من ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه ‏\"‏ ‏.‏ قال سعيد كان أبو إدريس الخولاني إذا حدث بهذا الحديث جثا على ركبتيه ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying that Allah, the Exalted and Glorious, said:                      My servants, I have made oppression unlawful for Me and unlawful for you, so do not commit oppression against one another. My servants, all of you are liable to err except one whom I guide on the right path, so seek right guidance from Me so that I should direct you to the right path. O My servants, all of you are hungry (needy) except one whom I feed, so beg food from Me, so that I may give that to you. O My servants, all of you are naked (need clothes) except one whom I provide garments, so beg clothes from Me, so that I should clothe you. O My servants, you commit error night and day and I am there to pardon your sins, so beg pardon from Me so that I should grant you pardon. O My servants, you can neither do Me any harm nor can you do Me any good. O My servants, even if the first amongst you and the last amongst you and even the whole of human race of yours, and that of jinns even, become (equal in) God-conscious like the heart of a single person amongst you, nothing would add to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of the Jinns too in unison become the most wicked (all beating) like the heart of a single person, it would cause no loss to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of jinns also all stand in one plain ground and you ask Me and I confer upon every person what he asks for, it would not. in any way, cause any loss to Me (even less) than that which is caused to the ocean by dipping the needle in it. My servants, these for you I shall reward you for thern, so he who deeds of yours which I am recording finds good should praise Allah and he who does not find that should not blame anyone but his ownself. Sa'id said that when Abu Idris Khaulini narrated this hadith he knelt upon his knees.",
      "usc_msa_ref": "",
      "chain": [
        "20640",
        "20638",
        "11414",
        "11027",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6740",
      "hadith_no": "6740",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، كلاهما عن عبد الصمد بن عبد، الوارث حدثنا همام، حدثنا قتادة، عن أبي قلابة، عن أبي أسماء، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم فيما يروي عن ربه تبارك وتعالى ‏\"‏ إني حرمت على نفسي الظلم وعلى عبادي فلا تظالموا ‏\"‏ ‏.‏ وساق الحديث بنحوه وحديث أبي إدريس الذي ذكرناه أتم من هذا ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying that he reported it from his Lord, the Exalted and Glorious:                      Verily I have made oppression unlawful for Me and for My servants too, so do not commit oppression. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30170",
        "20250",
        "20297",
        "11019",
        "11047",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6855",
      "hadith_no": "6855",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كامل الجحدري، وإسحاق بن إبراهيم، - واللفظ لإسحاق - قال أبو كامل حدثنا وقال، إسحاق أخبرنا عبد العزيز بن عبد الصمد العمي، حدثنا أبو عمران، الجوني عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إذا طبخت مرقة فأكثر ماءها وتعاهد جيرانك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Abu Dharr, when you prepare the broth, add water to that and give that (as a present) to your neighbour.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "30123",
        "30312",
        "20251",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6856",
      "hadith_no": "6856",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن إدريس، أخبرنا شعبة، ح وحدثنا أبو كريب حدثنا ابن إدريس، أخبرنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي صلى الله عليه وسلم أوصاني ‏\"‏ إذا طبخت مرقا فأكثر ماءه ثم انظر أهل بيت من جيرانك فأصبهم منها بمعروف ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) commanded me thus:                      Whenever you prepare a broth, add water to it, and have in your mind the members of the household of your neighbours and then give them out of this with courtesy.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20020",
        "30216",
        "20102",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6857",
      "hadith_no": "6857",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا عثمان بن عمر، حدثنا أبو عامر، - يعني الخزاز - عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ لا تحقرن من المعروف شيئا ولو أن تلقى أخاك بوجه طلق ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      Allah's Apostle (may peace be upon him) said to me: Don't consider anything insignificant out of good things even if it is that you meet your brother with a cheerful countenance.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6891",
      "hadith_no": "6891",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو الربيع، وأبو كامل فضيل بن حسين - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قيل لرسول الله صلى الله عليه وسلم أرأيت الرجل يعمل العمل من الخير ويحمده الناس عليه قال ‏\"‏ تلك عاجل بشرى المؤمن ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      It was said to Allah's Messenger (may peace be upon him): What is your opinion about the person who has done good deeds and the people praise him? He said: It is glad tidings for a believer (which he has received in this mortal world).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-7009",
      "hadith_no": "7009",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الله عز وجل من جاء بالحسنة فله عشر أمثالها وأزيد ومن جاء بالسيئة فجزاؤه سيئة مثلها أو أغفر ومن تقرب مني شبرا تقربت منه ذراعا ومن تقرب مني ذراعا تقربت منه باعا ومن أتاني يمشي أتيته هرولة ومن لقيني بقراب الأرض خطيئة لا يشرك بي شيئا لقيته بمثلها مغفرة ‏\"‏ ‏.‏ قال إبراهيم حدثنا الحسن بن بشر حدثنا وكيع بهذا الحديث ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying that Allah, the Exalted and Glorious, stated:                     \" He who comes with goodness, there are in store for him ten like those and even more than those: 'And he who comes with vice, ' it is only for that that he is called to account. I even forgive him (as I like) and he who draws close to Me by the span of a palm I draw close to him by the cubit, and he who draws close to Me by the cubit I draw close to him by the space (covered) by two hands, and he who walks towards Me I rush towards him, and he who meets Me in the state that his sins fill the earth, but not associating anything with Me, I would meet Him with the same (vastness) of pardon (on My behalf).\" This hadith has been transmitted on the authority of Waki'.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-7101",
      "hadith_no": "7101",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا زهير بن حرب، حدثنا حبان بن هلال، حدثنا وهيب، حدثنا سعيد الجريري، عن أبي عبد الله الجسري، عن ابن الصامت، عن أبي ذر، أن رسول الله صلى الله عليه وسلم سئل أى الكلام أفضل قال ‏\"‏ ما اصطفى الله لملائكته أو لعباده سبحان الله وبحمده ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) was asked as to which words were the best. He said:                      Those for which Allah made a choice for His Angels and His servants (and the words are):\" Hallowed be Allah and praise is due to Him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20218",
        "20299",
        "11286",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-7102",
      "hadith_no": "7102",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، عن شعبة، عن الجريري، عن أبي عبد الله الجسري، من عنزة عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبرك بأحب الكلام إلى الله ‏\"‏ ‏.‏ قلت يا رسول الله أخبرني بأحب الكلام إلى الله ‏.‏ فقال ‏\"‏ إن أحب الكلام إلى الله سبحان الله وبحمده ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) said:                      Should I not inform you about the words liked most by Allah? I said: Allah's Mes- senger, do inform me about the words liked most by Allah. He said: Verily, the words liked most by Allah are:\" hallowed be Allah and praise is due to Him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20365",
        "20020",
        "11286",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-332",
      "hadith_no": "332",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا خالد الواسطي، عن خالد الحذاء، عن أبي قلابة، ح وحدثنا مسدد، أخبرنا خالد، - يعني ابن عبد الله الواسطي - عن خالد الحذاء، عن أبي قلابة، عن عمرو بن بجدان، عن أبي ذر، قال اجتمعت غنيمة عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا أبا ذر ابد فيها ‏\"‏ ‏.‏ فبدوت إلى الربذة فكانت تصيبني الجنابة فأمكث الخمس والست فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ أبو ذر ‏\"‏ ‏.‏ فسكت فقال ‏\"‏ ثكلتك أمك أبا ذر لأمك الويل ‏\"‏ ‏.‏ فدعا لي بجارية سوداء فجاءت بعس فيه ماء فسترتني بثوب واستترت بالراحلة واغتسلت فكأني ألقيت عني جبلا فقال ‏\"‏ الصعيد الطيب وضوء المسلم ولو إلى عشر سنين فإذا وجدت الماء فأمسه جلدك فإن ذلك خير ‏\"‏ ‏.‏ وقال مسدد غنيمة من الصدقة ‏.‏ قال أبو داود وحديث عمرو أتم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbu Dharr said:                      A few goats got collected with the Messenger of Allah (ﷺ). He said: Abu Dharr, drive them to the wood. I drove them to Rabadhah (a place near Medina). I would have sexual defilement (during my stay there) and I would remain (in this condition) for five or six days. Then I came to the Messenger of Allah (ﷺ). He said: O Abu Dharr. I kept silence. He then said: May your mother bereave you, Abu Dharr: woe be to your mother. He then called a black slave-girl for me. She brought a vessel which contained water. She then concealed me by drawing a curtain and I concealed myself behind a she-camel, and took a bath. I felt as if I had thrown away a mountain from me. He said: Clean earth is a means for ablution for a Muslim, even for ten years (he does not find water); but when you find water, you should make it touch your skin, for that is better.The version of Musaddad has: \"the goats (were collected) from the alms,\" and the tradition reported by 'Amr is complete.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20423",
        "11282",
        "11047",
        "30175",
        "20423",
        "11282",
        "11047",
        "19856",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-401",
      "hadith_no": "401",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، أخبرني أبو الحسن، - قال أبو داود أبو الحسن هو مهاجر - قال سمعت زيد بن وهب، يقول سمعت أبا ذر، يقول كنا مع النبي صلى الله عليه وسلم فأراد المؤذن أن يؤذن الظهر فقال ‏\"‏ أبرد ‏\"‏ ‏.‏ ثم أراد أن يؤذن فقال ‏\"‏ أبرد ‏\"‏ ‏.‏ مرتين أو ثلاثا حتى رأينا فىء التلول ثم قال ‏\"‏ إن شدة الحر من فيح جهنم فإذا اشتد الحر فأبردوا بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr said:                      We were in the company of the Prophet (ﷺ). The mu'adhdhin intended to call for the Zuhr prayer. He said: Make it cooler. He then intended to call for prayer. He said twice or thrice: Make it cooler. We then witnessed the shadow of the mounds. He then said: The intensity of heat comes from the bubbling over of the Hell ; so when the heat is violent, offer (the Zuhr) prayer when it becomes cooler.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20020",
        "11341",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-431",
      "hadith_no": "431",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران، - يعني الجوني - عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر كيف أنت إذا كانت عليك أمراء يميتون الصلاة ‏\"‏ ‏.‏ أو قال ‏\"‏ يؤخرون الصلاة ‏\"‏ ‏.‏ قلت يا رسول الله فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصلها فإنها لك نافلة ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr said:                      \"The Messenger of Allah (ﷺ) asked me: 'How will you act, Abu Dharr, when you are under rulers who kill prayer or delay it (beyond its proper time) ?' I said: 'Messenger of Allah, what do you command me ?' He replied: 'Offer the prayer at its proper time, and if you say it along with them, say it, for it will be a supererogatory prayer for you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-489",
      "hadith_no": "489",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن مجاهد، عن عبيد الله بن عمير، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ جعلت لي الأرض طهورا ومسجدا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The earth has been made for me purifying and as a mosque (place for prayer).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11028",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-702",
      "hadith_no": "702",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، ح وحدثنا عبد السلام بن مطهر، وابن، كثير - المعنى - أن سليمان بن المغيرة، أخبرهم عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، - قال حفص - قال قال رسول الله صلى الله عليه وسلم وقالا عن سليمان قال أبو ذر ‏\"‏ يقطع صلاة الرجل - إذا لم يكن بين يديه قيد آخرة الرحل الحمار والكلب الأسود والمرأة ‏\"‏ ‏.‏ فقلت ما بال الأسود من الأحمر من الأصفر من الأبيض فقال يا ابن أخي سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " Hafs reported that the Messenger of Allah(ﷺ) as saying, and the other version of this tradition transmitted through a different chain has:                      Abu Dharr said (and not the Prophet): If there is not anything like the back of a saddle in front of a man who is praying, then a donkey, a black dog, and a woman cut off his prayer. I asked him: Why has the black dog been specified, distinguishing it from a red, a yellow and a white dog? He replied: My nephew, I also asked the Messenger of Allah(ﷺ) the same question as you asked me. He said: The black dog is a devil.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "20249",
        "20236",
        "11281",
        "10695",
        "23",
        "20317"
      ]
    },
    {
      "id": "sunan-abi-daud-909",
      "hadith_no": "909",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال سمعت أبا الأحوص، يحدثنا في مجلس سعيد بن المسيب قال قال أبو ذر قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الله عز وجل مقبلا على العبد وهو في صلاته ما لم يلتفت فإذا التفت انصرف عنه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: Allah, the Most High, continues to turn favourably towards a servant while he is engaged in prayer as long as he does not look to the side (by turning the neck), but if he does so, He turns away from him.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-1285",
      "hadith_no": "1285",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن منيع، عن عباد بن عباد، ح وحدثنا مسدد، حدثنا حماد بن زيد، - المعنى - عن واصل، عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ يصبح على كل سلامى من ابن آدم صدقة تسليمه على من لقي صدقة وأمره بالمعروف صدقة ونهيه عن المنكر صدقة وإماطته الأذى عن الطريق صدقة وبضعة أهله صدقة ويجزئ من ذلك كله ركعتان من الضحى ‏\"‏ ‏.‏ قال أبو داود وحديث عباد أتم ولم يذكر مسدد الأمر والنهى زاد في حديثه وقال كذا وكذا وزاد ابن منيع في حديثه قالوا يا رسول الله أحدنا يقضي شهوته وتكون له صدقة قال ‏\"‏ أرأيت لو وضعها في غير حلها ألم يكن يأثم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Prophet (ﷺ) as saying: In the morning alms are due for every bone in man's body. His salutation to everyone he meets is alms, his enjoining good is alms, his forbidding what is evil is alms, the removal of harmful thing from the way is alms, to have sexual intercourse with one's wife if alms, and two rak'ahs which one prays in the Duha serve instead of that.Abu Dawud said: The tradition narrated by 'Abbad is more perfect (than the version narrated by Musaddad). Musaddad did not mention in his version \"the command (of good) and the prohibition (of evil)\". Instead, he added in his version saying: \"Such and such.\" Ibn Ma'na added in his version: \"They (the people) said: Messenger of Allah, how is that one of us fulfills his desire and still there are alms for him (i.e. is rewarded)? He replied: What do you think if you had unlawful sexual intercourse, would he not have been a sinner ?",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20243",
        "30175",
        "20022",
        "10726",
        "11316",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-1375",
      "hadith_no": "1375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، أخبرنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا شيئا من الشهر حتى بقي سبع فقام بنا حتى ذهب ثلث الليل فلما كانت السادسة لم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال فقال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال فلما كانت الرابعة لم يقم فلما كانت الثالثة جمع أهله ونساءه والناس فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قال قلت ما الفلاح قال السحور ثم لم يقم بنا بقية الشهر ‏.‏",
      "text_en": " Narrated AbuDharr:                     We fasted with the Messenger of Allah (ﷺ) during Ramadan, but he did not make us get up at night for prayer at any time during the month till seven nights remained; then he made us get up for prayer till a third of the night had passed. When the sixth remaining night came, he did not make us get up for prayer. When the fifth remaining night came, he made us stand in prayer till a half of the night had gone.  So I said: Messenger of Allah, I wish you had led us in supererogatory prayers during the whole of tonight.  He said: When a man prays with an imam till he goes he is reckoned as having spent a whole night in prayer. On the fourth remaining night he did not make us get up. When the third remaining night came, he gathered his family, his wives, and the people and prayed with us till we were afraid we should miss the falah (success).  I said: What is falah?  He said: The meal before daybreak. Then he did not make us get up for prayer during the remainder of the month.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-1807",
      "hadith_no": "1807",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، - يعني ابن السري - عن ابن أبي زائدة، أخبرنا محمد بن إسحاق، عن عبد الرحمن بن الأسود، عن سليم بن الأسود، أن أبا ذر، كان يقول فيمن حج ثم فسخها بعمرة لم يكن ذلك إلا للركب الذين كانوا مع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr used to say about a person who makes the intention of Hajj but he repeal it for the ‘Umrah (that will not be valid). This cancellation of hajj for ‘Umrah was specially meant for the people who accompanied the Apostle of Allaah(ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20366",
        "11107",
        "11056",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-2868",
      "hadith_no": "2868",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عبد الرحمن المقرئ، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي فلا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏ قال أبو داود تفرد به أهل مصر ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Messenger of Allah (ﷺ) said to me: Abu Dharr, I see you weak, and I like for you what I like for myself. Do not be a leader of two (persons), and do not be a guardian of an orphan.Abu Dawud said: This has been narrated only by the people of Egypt.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-2962",
      "hadith_no": "2962",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا محمد بن إسحاق، عن مكحول، عن غضيف بن الحارث، عن أبي ذر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله وضع الحق على لسان عمر يقول به ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     I heard the Messenger of Allah (ﷺ) say: Allah, the Exalted, has placed truth on Umar's tongue and he speaks it.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "11107",
        "11066",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4002",
      "hadith_no": "4002",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وعبيد الله بن عمر بن ميسرة، - المعنى - قالا حدثنا يزيد بن هارون، عن سفيان بن حسين، عن الحكم بن عتيبة، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال كنت رديف رسول الله صلى الله عليه وسلم وهو على حمار والشمس عند غروبها فقال ‏\"‏ هل تدري أين تغرب هذه ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تغرب في عين حامية ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     I was sitting behind the Messenger of Allah (ﷺ) who was riding a donkey while the sun was setting. He asked: Do you know where this sets ? I replied: Allah and his Apostle know best. He said: It sets in a spring of warm water (Hamiyah).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20472",
        "20655",
        "11069",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4087",
      "hadith_no": "4087",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ثلاثة لا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ قلت من هم يا رسول الله قد خابوا وخسروا أعادها ثلاثا ‏.‏ قلت من هم يا رسول الله خابوا وخسروا فقال ‏\"‏ المسبل والمنان والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏ أو ‏\"‏ الفاجر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Prophet (ﷺ) as saying: There are three to whom Allah will not speak and at whom He will not look on the Day of Resurrection, and whom He will not declare pure, and they will have a painful punishment. I asked: Who are they, Messenger of Allah, they are losers and disappointed ? He repeated it three times. I asked: Who are they. Messenger of Allah, they are losers and disappointed ? He replied: The one who wears a trailing robe, the one who takes account of what he gives, and the one who produces a ready sale of a commodity by false swearing.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4088",
      "hadith_no": "4088",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم بهذا والأول أتم قال ‏\"‏ المنان الذي لا يعطي شيئا إلا منه ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Dharr though a different chain of narrators, but the former is more perfect. This version has:                      Mannan is the one takes account of anything he gives.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11060",
        "5077",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4205",
      "hadith_no": "4205",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، حدثنا معمر، عن سعيد الجريري، عن عبد الله بن بريدة، عن أبي الأسود الديلي، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحسن ما غير به هذا الشيب الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: The best things with which grey hair are changed are henna and katam.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "20115",
        "11286",
        "11432",
        "11114",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4261",
      "hadith_no": "4261",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك يا رسول الله وسعديك ‏.‏ فذكر الحديث قال فيه ‏\"‏ كيف أنت إذا أصاب الناس موت يكون البيت فيه بالوصيف ‏\"‏ ‏.‏ قلت الله ورسوله أعلم أو قال ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بالصبر ‏\"‏ ‏.‏ أو قال ‏\"‏ تصبر ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك وسعديك ‏.‏ قال ‏\"‏ كيف أنت إذا رأيت أحجار الزيت قد غرقت بالدم ‏\"‏ ‏.‏ قلت ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بمن أنت منه ‏\"‏ ‏.‏ قلت يا رسول الله أفلا آخذ سيفي وأضعه على عاتقي قال ‏\"‏ شاركت القوم إذا ‏\"‏ ‏.‏ قلت فما تأمرني قال ‏\"‏ تلزم بيتك ‏\"‏ ‏.‏ قلت فإن دخل على بيتي قال ‏\"‏ فإن خشيت أن يبهرك شعاع السيف فألق ثوبك على وجهك يبوء بإثمك وإثمه ‏\"‏ ‏.‏ قال أبو داود لم يذكر المشعث في هذا الحديث غير حماد بن زيد ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to me: O AbuDharr.  I replied: At thy service and at thy pleasure, Messenger of Allah.  He then mentioned the tradition in which he said: What will you do when there the death of the people (in Medina) and a house will reach the value of a slave (that is, a grave will be sold for a slave).  I replied: Allah and His Apostle know best. Or he said: What Allah and His Apostle choose for me.  He said: You must show endurance. Or he said; you may endure. He then said to me: What will you do, AbuDharr, when you see the Ahjar az-Zayt covered with blood?  I replied: What Allah and His Apostle choose for me.  He said: You must go to those who are like-minded.  I asked: Should I not take my sword and put it on my shoulder?  He replied: you would then associate yourself with the people.  I then asked: What do you order me to do?  You must stay at home.  I asked: (What should I do) if people enter my house and find me?  He replied: If you are afraid the gleam of the sword may dazzle you, put the end of your garment over your face in order that (the one who kills you) may bear the punishment of your sins and his.Abu Dawud said: No one mentioned al-Mush'ath in the chain of this tradition except Hammad b. Zaid.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4409",
      "hadith_no": "4409",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك يا رسول الله وسعديك ‏.‏ فقال ‏\"‏ كيف أنت إذا أصاب الناس موت يكون البيت فيه بالوصيف ‏\"‏ ‏.‏ يعني القبر ‏.‏ قلت الله ورسوله أعلم أو ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بالصبر ‏\"‏ ‏.‏ أو قال ‏\"‏ تصبر ‏\"‏ ‏.‏ قال أبو داود قال حماد بن أبي سليمان يقطع النباش لأنه دخل على الميت بيته ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to me: O AbuDharr: I replied: At your service and at your pleasure, Messenger of Allah! He said: how will you do when death smites people, and a house, meaning a grave, will cost as much as a slave. I said: Allah and His Apostle know best, or he said: What Allah and His Apostle choose for me. He said: Show endurance, or he said: You may show endurance.Abu Dawud said: Hammad b. Abi Sulaiman said: The hand of one who rifles a grave should be cut off because he had entered the deceased's house.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4599",
      "hadith_no": "4599",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا يزيد بن أبي زياد، عن مجاهد، عن رجل، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الأعمال الحب في الله والبغض في الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: The best of the actions is to love for the sake of Allah and to hate for the sake of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20423",
        "10844",
        "11028",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4698",
      "hadith_no": "4698",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن أبي فروة الهمداني، عن أبي زرعة بن عمرو بن جرير، عن أبي ذر، وأبي، هريرة قالا كان رسول الله صلى الله عليه وسلم يجلس بين ظهرى أصحابه فيجيء الغريب فلا يدري أيهم هو حتى يسأل فطلبنا إلى رسول الله صلى الله عليه وسلم أن نجعل له مجلسا يعرفه الغريب إذا أتاه - قال - فبنينا له دكانا من طين فجلس عليه وكنا نجلس بجنبتيه وذكر نحو هذا الخبر فأقبل رجل فذكر هيئته حتى سلم من طرف السماط فقال السلام عليك يا محمد ‏.‏ قال فرد عليه النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated AbuDharr and AbuHurayrah:                     The Messenger of Allah (ﷺ) used to sit among his Companions. A stranger would come and not recognize him (the Prophet) until he asked (about him). So we asked the Messenger of Allah (ﷺ) to make a place where he might take his seat so that when a stranger came, he might recognise him. So we built a terrace of soil on which he would take his seat, and we would sit beside him. He then mentioned something similar to this Hadith saying: A man came, and he described his appearance. He saluted from the side of the assembly, saying: Peace be upon you, Muhammad. The Prophet (ﷺ) then responded to him.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11406",
        "23",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4758",
      "hadith_no": "4758",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، وأبو بكر بن عياش ومندل عن مطرف، عن أبي جهم، عن خالد بن وهبان، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ من فارق الجماعة شبرا فقد خلع ربقة الإسلام من عنقه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: He who separates from the community within a span takes off the noose of Islam from his neck.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "11395",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4759",
      "hadith_no": "4759",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا مطرف بن طريف، عن أبي الجهم، عن خالد بن وهبان، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ كيف أنتم وأئمة من بعدي يستأثرون بهذا الفىء ‏\"‏ ‏.‏ قلت ‏:‏ إذا والذي بعثك بالحق أضع سيفي على عاتقي، ثم أضرب به حتى ألقاك أو ألحقك ‏.‏ قال ‏:‏ ‏\"‏ أولا أدلك على خير من ذلك تصبر حتى تلقاني ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported the Messenger of Allah (May peace be upon him) as saying :                      How will you deal with the rulers (imams) who appropriate to themselves this booty? I said : I swear by him who sent you with the truth that at that time I shall put my sword on my shoulder and smite with it till I meet you, or I join you. He said: shall I not guide you to something better than that? You must show endurance till you meet me.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11395",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4782",
      "hadith_no": "4782",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، حدثنا داود بن أبي هند، عن أبي حرب بن الأسود، عن أبي ذر، قال إن رسول الله صلى الله عليه وسلم قال لنا ‏\"‏ إذا غضب أحدكم وهو قائم فليجلس فإن ذهب عنه الغضب وإلا فليضطجع ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to us: When one of you becomes angry while standing, he should sit down. If the anger leaves him, well and good; otherwise he should lie down.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20354",
        "11585",
        "10729",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-5087",
      "hadith_no": "5087",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا المسعودي، حدثنا القاسم، قال كان أبو ذر يقول من قال حين يصبح اللهم ما حلفت من حلف أو قلت من قول أو نذرت من نذر فمشيئتك بين يدى ذلك كله ما شئت كان وما لم تشأ لم يكن اللهم اغفر لي وتجاوز لي عنه اللهم فمن صليت عليه فعليه صلاتي ومن لعنت فعليه لعنتي كان في استثناء يومه ذلك أو قال ذلك اليوم ‏.‏",
      "text_en": " Narrated AbuDharr:                     If anyone says in the morning: \"O Allah! whatever oath I take, whatever word I speak, and whatever vow I take, Thine will precedes all that: whatever Thou willeth, occurs, and whatever Thou dost not will, dost not occur. O Allah! pardon me and disregard me for it. O Allah! whomsoever Thou sendest thine blessing, to him my blessing is due, and whomsoever thou cursest, to him my curse is due, \" exemption from it will be granted to him that day.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20724",
        "10535",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-5126",
      "hadith_no": "5126",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا سليمان، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، أنه قال يا رسول الله الرجل يحب القوم ولا يستطيع أن يعمل كعملهم ‏.‏ قال ‏\"‏ أنت يا أبا ذر مع من أحببت ‏\"‏ ‏.‏ قال فإني أحب الله ورسوله ‏.‏ قال ‏\"‏ فإنك مع من أحببت ‏\"‏ ‏.‏ قال فأعادها أبو ذر فأعادها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘Abd Allah b. al-samit told that Abu Dharr said :                      Messenger of Allah! A man loves some people, but he cannot do work like their work. He replied; Yes, Abu Dharr, will be with those whom you love. Abu Dharr then repeated it. The Messenger of Allah (May peace be upon him) also repeated it.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20160",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-5161",
      "hadith_no": "5161",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا جرير، عن منصور، عن مجاهد، عن مورق، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لاءمكم من مملوكيكم فأطعموه مما تأكلون واكسوه مما تكتسون ومن لم يلائمكم منهم فبيعوه ولا تعذبوا خلق الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: Feed those of your slaves who please you from what you eat and clothe them with what you clothe yourselves, but sell those who do not please you and do not punish Allah's creatures.",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "20028",
        "11067",
        "11028",
        "11308",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-5226",
      "hadith_no": "5226",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا مسلم، حدثنا هشام، عن حماد، - يعنيان ابن أبي سليمان - عن زيد بن وهب، عن أبي ذر، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ فقلت لبيك وسعديك يا رسول الله وأنا فداؤك ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) addressed me, saying: O AbuDharr! I replied: At thy service and at thy pleasure, Messenger of Allah! may I be ransom for thee.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "20285",
        "20295",
        "11341",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-5243",
      "hadith_no": "5243",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، ح وحدثنا أحمد بن منيع، عن عباد بن عباد، - وهذا لفظه وهو أتم - عن واصل، عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ يصبح على كل سلامى من ابن آدم صدقة تسليمه على من لقي صدقة وأمره بالمعروف صدقة ونهيه عن المنكر صدقة وإماطته الأذى عن الطريق صدقة وبضعته أهله صدقة ‏\"‏ ‏.‏ قالوا يا رسول الله يأتي شهوته وتكون له صدقة قال ‏\"‏ أرأيت لو وضعها في غير حقها أكان يأثم ‏\"‏ ‏.‏ قال ‏\"‏ ويجزئ من ذلك كله ركعتان من الضحى ‏\"‏ ‏.‏ قال أبو داود لم يذكر حماد الأمر والنهى ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: In the morning alms are due from every bone in man's fingers and toes.  Salutation to everyone he meets is alms; enjoining good is alms; forbidding what is disreputable is alms; removing what is harmful from the road is alms; having sexual intercourse with his wife is alms. The people asked: He fulfils his desire, Messenger of Allah; is  it alms? He replied: Tell me if he fulfilled his desire where he had no right, would he commit a sin ? He then said: Two rak'ahs which one prays in the forenoon serve instead of all that.Abu Dawud said: Hammad did not mention enjoining good and forbidding what is disreputable.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "30242",
        "20243",
        "10726",
        "11316",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-5244",
      "hadith_no": "5244",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن واصل، عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي ذر، بهذا الحديث وذكر النبي صلى الله عليه وسلم في وسطه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Dharr through a different chain of narrators. In this version the transmitter mentioned the Prophet(ﷺ) in the middle of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-124",
      "hadith_no": "124",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، قالا حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن خالد الحذاء، عن أبي قلابة، عن عمرو بن بجدان، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الصعيد الطيب طهور المسلم وإن لم يجد الماء عشر سنين فإذا وجد الماء فليمسه بشرته فإن ذلك خير ‏\"‏ ‏.‏ وقال محمود في حديثه ‏\"‏ إن الصعيد الطيب وضوء المسلم ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعبد الله بن عمرو وعمران بن حصين ‏.‏ قال أبو عيسى وهكذا روى غير واحد عن خالد الحذاء عن أبي قلابة عن عمرو بن بجدان عن أبي ذر ‏.‏ وقد روى هذا الحديث أيوب عن أبي قلابة عن رجل من بني عامر عن أبي ذر ولم يسمه ‏.‏ قال وهذا حديث حسن صحيح ‏.‏ وهو قول عامة الفقهاء أن الجنب والحائض إذا لم يجدا الماء تيمما وصليا ‏.‏ ويروى عن ابن مسعود أنه كان لا يرى التيمم للجنب وإن لم يجد الماء ‏.‏ ويروى عنه أنه رجع عن قوله فقال يتيمم إذا لم يجد الماء ‏.‏ وبه يقول سفيان الثوري ومالك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abu Dharr narrated that :                     AlIah's Messenger said: \"Pure clean earth is a purifier for the Muslim; even if he did not find water for ten years. Then if he finds water, then let him use it (for purification) on his skin. For, that is better.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30277",
        "20355",
        "20012",
        "11282",
        "11047",
        "19856",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-158",
      "hadith_no": "158",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، قال أنبأنا شعبة، عن مهاجر أبي الحسن، عن زيد بن وهب، عن أبي ذر، أن رسول الله صلى الله عليه وسلم كان في سفر ومعه بلال فأراد بلال أن يقيم فقال ‏\"‏ أبرد ‏\"‏ ‏.‏ ثم أراد أن يقيم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبرد في الظهر ‏\"‏ ‏.‏ قال حتى رأينا فىء التلول ثم أقام فصلى فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن شدة الحر من فيح جهنم فأبردوا عن الصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"Allah's Messenger was on a journey and Bilal was with him. So he wanted to call for the prayer, but he (the Prophet) said: 'Let it get cooler.' Then he wanted to call for the prayer, so Allah's Messenger said: 'Let it get to the cooler time of Zuhr.'\" He (i.e., Abu Dharr) said: \"Until we saw the shadows of the hillocks, then he commanded that the Iqamah be called and then led the people in prayer. Allah's Messenger said: 'The severity of heat is from the raging of Hell, so wait until it becomes cooler for the (Zuhr) prayer.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-176",
      "hadith_no": "176",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا جعفر بن سليمان الضبعي، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا أبا ذر أمراء يكونون بعدي يميتون الصلاة فصل الصلاة لوقتها فإن صليت لوقتها كانت لك نافلة وإلا كنت قد أحرزت صلاتك ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن مسعود وعبادة بن الصامت ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن ‏.‏ وهو قول غير واحد من أهل العلم يستحبون أن يصلي الرجل الصلاة لميقاتها إذا أخرها الإمام ثم يصلي مع الإمام والصلاة الأولى هي المكتوبة عند أكثر أهل العلم ‏.‏ وأبو عمران الجوني اسمه عبد الملك بن حبيب ‏.‏",
      "text_en": " Abu Dharr narrated that :                     the Prophet said: \"O Abu Dharr! There will be leaders after me who cause the Salat to die; so perform the Salat during its time. If you pray (with them) during its time, then that will be voluntary Salat for you, if not, then you will have attained your Salat.\"",
      "usc_msa_ref": "",
      "chain": [
        "38602",
        "20532",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-338",
      "hadith_no": "338",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يونس بن عبيد، ومنصور بن زاذان، عن حميد بن هلال، عن عبد الله بن الصامت، قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى الرجل وليس بين يديه كآخرة الرحل أو كواسطة الرحل قطع صلاته الكلب الأسود والمرأة والحمار ‏\"‏ ‏.‏ فقلت لأبي ذر ما بال الأسود من الأحمر من الأبيض فقال يا ابن أخي سألتني كما سألت رسول الله صلى الله عليه وسلم فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد والحكم بن عمرو الغفاري وأبي هريرة وأنس ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إليه قالوا يقطع الصلاة الحمار والمرأة والكلب الأسود ‏.‏ قال أحمد الذي لا أشك فيه أن الكلب الأسود يقطع الصلاة وفي نفسي من الحمار والمرأة شيء ‏.‏ قال إسحاق لا يقطعها شيء إلا الكلب الأسود ‏.‏",
      "text_en": " Abu Dharr said that :                     Allah's Messenger said: \"When a man performs Salat, and there is nothing in front of him like the post of a saddle, or a camel saddle, then his Salat is severed by (passing of) a black dog, a woman, and a donkey.\" It was said to Abu Dharr: \"What is the problem with the black dog rather than the red or white one?\" He said: \"O my nephew! I asked Allah's Messenger just as you have asked me. He said: 'The black dog is a Shaitan (devil).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11075",
        "11444",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-379",
      "hadith_no": "379",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، حدثنا سفيان بن عيينة، عن الزهري، عن أبي الأحوص، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا قام أحدكم إلى الصلاة فلا يمسح الحصى فإن الرحمة تواجهه ‏\"‏ ‏.‏ قال وفي الباب عن معيقيب وعلي بن أبي طالب وحذيفة وجابر بن عبد الله ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كره المسح في الصلاة وقال ‏\"‏ إن كنت لا بد فاعلا فمرة واحدة ‏\"‏ ‏.‏ كأنه روي عنه رخصة في المرة الواحدة ‏.‏ والعمل على هذا عند أهل العلم ‏.‏",
      "text_en": " Abu Dharr narrated that :                     the Prophet (S) said: \"When one of you stands for Salat then he should not smoothen the pebbles, for indeed it is mercy that he is facing.\"",
      "usc_msa_ref": "",
      "chain": [
        "38231",
        "20005",
        "11013",
        "20327",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-475",
      "hadith_no": "475",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو جعفر السمناني، حدثنا أبو مسهر، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن أبي الدرداء، وأبي، ذر عن رسول الله صلى الله عليه وسلم ‏\"‏ عن الله، عز وجل أنه قال ابن آدم اركع لي من أول النهار أربع ركعات أكفك آخره ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Jubair narrated from Abu Ad-Darda, or Abu Dharr, that :                     Allah's Messenger narrated that Allah, Blessed and Most High said: \"Son of Adam: Perform four Rak'ah for Me in the beginning of the day it will suffice you for the latter part of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30284",
        "20736",
        "11422",
        "4097",
        "37",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-617",
      "hadith_no": "617",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد بن السري التميمي الكوفي، حدثنا أبو معاوية، عن الأعمش، عن المعرور بن سويد، عن أبي ذر، قال جئت إلى رسول الله صلى الله عليه وسلم وهو جالس في ظل الكعبة ‏.‏ قال فرآني مقبلا فقال ‏\"‏ هم الأخسرون ورب الكعبة يوم القيامة ‏\"‏ ‏.‏ قال فقلت ما لي لعله أنزل في شيء ‏.‏ قال قلت من هم فداك أبي وأمي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هم الأكثرون إلا من قال هكذا وهكذا وهكذا ‏\"‏ ‏.‏ فحثا بين يديه وعن يمينه وعن شماله ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لا يموت رجل فيدع إبلا أو بقرا لم يؤد زكاتها إلا جاءته يوم القيامة أعظم ما كانت وأسمنه تطؤه بأخفافها وتنطحه بقرونها كلما نفدت أخراها عادت عليه أولاها حتى يقضى بين الناس ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة مثله ‏.‏ وعن علي بن أبي طالب رضى الله عنه قال لعن مانع الصدقة ‏.‏ وعن قبيصة بن هلب عن أبيه وجابر بن عبد الله وعبد الله بن مسعود ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏ واسم أبي ذر جندب بن السكن ويقال ابن جنادة ‏.‏ حدثنا عبد الله بن منير عن عبيد الله بن موسى عن سفيان الثوري عن حكيم بن الديلم عن الضحاك بن مزاحم قال الأكثرون أصحاب عشرة آلاف ‏.‏ قال وعبد الله بن منير مروزي رجل صالح ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"I came to the Messenger of Allah while he was sitting in the shade of the Ka'bah.\" He said: \"He saw me approaching and he said: 'They are lost on the Day of Judgment! By the Lord of the Ka'bah!'\" He said: \"I said t myself: Woe is me! Perhaps something has been revealed about me!'\" He said: \"So I said: 'Who are they, and may my father and mother be ransomed for you.' So the Messenger of Allah said: 'They are those who have much, except for who says like this, and this, and this and motioned with his hand to his front, and t his right, and to his left.' Then he said: 'By the One in Whose Hand is my soul! No man will die, leaving a camel or a cow that he did not pay Zakat on, except that it will come on the Day of Judgment larger and fatter than it was, they will tread him under their hooves and butt him with their horns, all of them; such that when the last of them has had a turn, the first returns to him, until he is judged before the people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-761",
      "hadith_no": "761",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن الأعمش، قال سمعت يحيى بن سام، يحدث عن موسى بن طلحة، قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إذا صمت من الشهر ثلاثة أيام فصم ثلاث عشرة وأربع عشرة وخمس عشرة ‏\"‏ ‏.‏ وفي الباب عن أبي قتادة وعبد الله بن عمرو وقرة بن إياس المزني وعبد الله بن مسعود وأبي عقرب وابن عباس وعائشة وقتادة بن ملحان وعثمان بن أبي العاصي وجرير ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن ‏.‏ وقد روي في بعض الحديث أن ‏\"‏ من صام ثلاثة أيام من كل شهر كان كمن صام الدهر ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr narrated that :                     the Messenger of Allah said: \"O Abu Dharr! When you fast three days out of a month, then fast the thirteenth, fourteenth, and fifteenth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "30002",
        "20020",
        "11060",
        "19145",
        "579",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-762",
      "hadith_no": "762",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن عاصم الأحول، عن أبي عثمان النهدي، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام من كل شهر ثلاثة أيام فذلك صيام الدهر ‏\"‏ ‏.‏ فأنزل الله عز وجل تصديق ذلك في كتابه ‏:‏ ‏(‏من جاء بالحسنة فله عشر أمثالها ‏)‏ ‏.‏ اليوم بعشرة أيام ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى شعبة هذا الحديث عن أبي شمر وأبي التياح عن أبي عثمان عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"The Messenger of Allah said: 'Whoever fasts three days in every month, then that is (similar to) fasting every day.' Then Allah Mighty and Sublime is He, attested to that in His Book, by revealing: Whoever brings a good deed, shall have ten times the like thereof. So a day is like ten.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11080",
        "11113",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-806",
      "hadith_no": "806",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم فلم يصل بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة وقام بنا في الخامسة حتى ذهب شطر الليل فقلنا له يا رسول الله لو نفلتنا بقية ليلتنا هذه فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا حتى بقي ثلاث من الشهر وصلى بنا في الثالثة ودعا أهله ونساءه فقام بنا حتى تخوفنا الفلاح ‏.‏ قلت له وما الفلاح قال السحور ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ واختلف أهل العلم في قيام رمضان فرأى بعضهم أن يصلي إحدى وأربعين ركعة مع الوتر ‏.‏ وهو قول أهل المدينة والعمل على هذا عندهم بالمدينة ‏.‏ وأكثر أهل العلم على ما روي عن عمر وعلي وغيرهما من أصحاب النبي صلى الله عليه وسلم عشرين ركعة ‏.‏ وهو قول سفيان الثوري وابن المبارك والشافعي ‏.‏ وقال الشافعي وهكذا أدركت ببلدنا بمكة يصلون عشرين ركعة ‏.‏ وقال أحمد روي في هذا ألوان ‏.‏ ولم يقض فيه بشيء ‏.‏ وقال إسحاق بل نختار إحدى وأربعين ركعة على ما روي عن أبى بن كعب ‏.‏ واختار ابن المبارك وأحمد وإسحاق الصلاة مع الإمام في شهر رمضان ‏.‏ واختار الشافعي أن يصلي الرجل وحده إذا كان قارئا ‏.‏ وفي الباب عن عائشة والنعمان بن بشير وابن عباس ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1211-2",
      "hadith_no": "1211",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، قال أخبرني علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، يحدث عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ قلت من هم يا رسول الله فقد خابوا وخسروا فقال ‏\"‏ المنان والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وأبي هريرة وأبي أمامة بن ثعلبة وعمران بن حصين ومعقل بن يسار ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Prophet (ﷺ) said: \"There are three whom Allah will not look at on the Day of Judgement, nor will He purify them, and theirs is a painful punishment.\" We said: \"Who are they O Messenger of Allah ? For they have indeed failed and are lost!\" He sai: \"The Mannan, the one whose Izar hangs (below the ankels) and the one who promotes his merchandise with false oath.\" [He said:] There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Umamah bin Tha'labah, 'Imran bin Husain, and Ma'qil bin Yasar[Abu 'Eisa said:] The Hadith of Abu Dharr is a Hasan Sahih Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "30002",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1753",
      "hadith_no": "1753",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا ابن المبارك، عن الأجلح، عن عبد الله بن بريدة، عن أبي الأسود، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحسن ما غير به الشيب الحناء والكتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو الأسود الديلي اسمه ظالم بن عمرو بن سفيان ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Prophet (ﷺ) said: \"Indeed the best of what the gray may be changed with is Henna' and Katam.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Al-Aswad Ad-Dili's (a narrator in this chain) name is Zalim bin 'Amr bin Sufyan.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11432",
        "11105",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1833",
      "hadith_no": "1833",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسين بن علي بن الأسود البغدادي، حدثنا عمرو بن محمد العنقزي، حدثنا إسرائيل، عن صالح بن رستم أبي عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحقرن أحدكم شيئا من المعروف وإن لم يجد فليلق أخاه بوجه طليق وإن اشتريت لحما أو طبخت قدرا فأكثر مرقته واغرف لجارك منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه شعبة عن أبي عمران الجوني ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Messenger of Allah (ﷺ) said: \"Let one of you not consider any good to be insignificant. If he has nothing, then let him meet his brother with a smiling face. If you buy some meat or cook something in a pot, then increase its broth, and serve some of it to you neighbor.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported it from Abu 'Imran Al-Jawni.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20597",
        "20311",
        "17514",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2071",
      "hadith_no": "2071",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن واصل، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إخوانكم جعلهم الله فتية تحت أيديكم فمن كان أخوه تحت يده فليطعمه من طعامه وليلبسه من لباسه ولا يكلفه ما يغلبه فإن كلفه ما يغلبه فليعنه ‏\"‏ ‏.‏ قال وفي الباب عن علي وأم سلمة وابن عمر وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr  narrated that the Messenger of Allah said :                     \"Allah has made some of your brothers as slaves under your care. So whoever has his brother under his care, then let him feed him from his food, and let him clothe him from his clothes. And do not give him a duty that he cannot bear, and if you give him a duty he cannot bear, then assist him with it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11397",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2083",
      "hadith_no": "2083",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عباس بن عبد العظيم العنبري، حدثنا النضر بن محمد الجرشي اليمامي، حدثنا عكرمة بن عمار، حدثنا أبو زميل، عن مالك بن مرثد، عن أبيه، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تبسمك في وجه أخيك لك صدقة وأمرك بالمعروف ونهيك عن المنكر صدقة وإرشادك الرجل في أرض الضلال لك صدقة وبصرك للرجل الرديء البصر لك صدقة وإماطتك الحجر والشوكة والعظم عن الطريق لك صدقة وإفراغك من دلوك في دلو أخيك لك صدقة ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وجابر وحذيفة وعائشة وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو زميل اسمه سماك بن الوليد الحنفي ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah said :                     \"Your smiling in the face of your brother is charity, commanding good and forbidding evil is charity, your giving directions to a man lost in the land is charity for you. Your seeing for a man with bad sight is a charity for you, your removal of a rock, a thorn  or a bone from the road is charity for you. Your pouring what remains from your bucket into the bucket of your brother is charity for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "28603",
        "10704",
        "18966",
        "18973",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2115",
      "hadith_no": "2115",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اتق الله حيثما كنت وأتبع السيئة الحسنة تمحها وخالق الناس بخلق حسن ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr said:                      \"The Messenger of Allah said to me:'Have Taqwa of Allah wherever you are, and follow an evil deed with a good one to wipe it out, and treat the people with good behavior.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11331",
        "10834",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2186-2",
      "hadith_no": "2186",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال دخلت المسجد حين غابت الشمس والنبي صلى الله عليه وسلم جالس فقال ‏\"‏ يا أبا ذر أتدري أين تذهب هذه ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تذهب تستأذن في السجود فيؤذن لها وكأنها قد قيل لها اطلعي من حيث جئت فتطلع من مغربها ‏\"‏ ‏.‏ قال ثم قرأ ‏\"‏ وذلك مستقر لها ‏\"‏ ‏.‏ قال وذلك قراءة عبد الله بن مسعود ‏.‏ قال أبو عيسى وفي الباب عن صفوان بن عسال وحذيفة بن أسيد وأنس وأبي موسى ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr said:                     \"I entered the Masjid at sunset, and the Prophet(s.a.w) was sitting. He said: 'O Abu Dharr! Do you know where this(sun) goes?' I said:'Allah and His Messenger know better.' He said: 'Indeed it goes to seek permission to prostrate, so it is permitted. And it is as if it has been said to it: \"Rise from whence you came.\" So it shall rise from its setting place.' Then he recited: 'That is its fixed course.\"' He said: \"That is the recitation of 'Abdulla bim Mas'ud.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2312",
      "hadith_no": "2312",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن إبراهيم بن المهاجر، عن مجاهد، عن مورق، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني أرى ما لا ترون وأسمع ما لا تسمعون أطت السماء وحق لها أن تئط ما فيها موضع أربع أصابع إلا وملك واضع جبهته ساجدا لله لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا وما تلذذتم بالنساء على الفرش ولخرجتم إلى الصعدات تجأرون إلى الله ‏\"‏ ‏.‏ لوددت أني كنت شجرة تعضد ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة وابن عباس وأنس ‏.‏ قال هذا حديث حسن غريب ‏.‏ ويروى من غير هذا الوجه أن أبا ذر قال لوددت أني كنت شجرة تعضد ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah (s.a.w) said:",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20355",
        "20311",
        "11028",
        "11308",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2340",
      "hadith_no": "2340",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن المبارك، حدثنا عمرو بن واقد، حدثنا يونس بن حلبس، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزهادة في الدنيا ليست بتحريم الحلال ولا إضاعة المال ولكن الزهادة في الدنيا أن لا تكون بما في يديك أوثق مما في يدى الله وأن تكون في ثواب المصيبة إذا أنت أصبت بها أرغب فيها لو أنها أبقيت لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأبو إدريس الخولاني اسمه عائذ الله بن عبد الله ‏.‏ وعمرو بن واقد منكر الحديث ‏.‏",
      "text_en": " Abu Dharr narrated that the Prophet (s.a.w) said:                     \"Abstinence in the world is not by prohibiting (oneself) the lawful nor by neglecting wealth , but  abstinence in the world is that you not hold more firmly to what is in your hand than to what is in the hand of Allah, and that you be more hopeful of the rewards that come with an affliction that you may suffer if it remain with you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30382",
        "17533",
        "11027",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2633",
      "hadith_no": "2633",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عبد الصمد العمي عبد العزيز بن عبد الصمد، حدثنا أبو عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قلت يا رسول الله ما آنية الحوض قال ‏\"‏ والذي نفسي بيده لآنيته أكثر من عدد نجوم السماء وكواكبها في ليلة مظلمة مصحية من آنية الجنة من شرب منها شربة لم يظمأ آخر ما عليه عرضه مثل طوله ما بين عمان إلى أيلة ماؤه أشد بياضا من اللبن وأحلى من العسل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وفي الباب عن حذيفة بن اليمان وعبد الله بن عمرو وأبي برزة الأسلمي وابن عمر وحارثة بن وهب والمستورد بن شداد ‏.‏ - وروي عن ابن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ حوضي كما بين الكوفة إلى الحجر الأسود ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr narrated:                      \"I said: 'O Messenger of Allah! What about the vessels of the Hawd?' He said:'By the one in Whose Hand is my soul! Its vessels number more than the stars of the heavens and the planets on a clear dark night. (They are) among the vessels of Paradise, whoever drinks from them, he will never be thirsty again. Its longest breadth is the same as its length, like that which is between 'Amman to Aylah, its water is whiter than milk and sweeter than honey.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2683",
      "hadith_no": "2683",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن ليث، عن شهر بن حوشب، عن عبد الرحمن بن غنم، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الله تعالى يا عبادي كلكم ضال إلا من هديته فسلوني الهدى أهدكم وكلكم فقير إلا من أغنيت فسلوني أرزقكم وكلكم مذنب إلا من عافيت فمن علم منكم أني ذو قدرة على المغفرة فاستغفرني غفرت له ولا أبالي ولو أن أولكم وآخركم وحيكم وميتكم ورطبكم ويابسكم اجتمعوا على أتقى قلب عبد من عبادي ما زاد ذلك في ملكي جناح بعوضة ولو أن أولكم وآخركم وحيكم وميتكم ورطبكم ويابسكم اجتمعوا على أشقى قلب عبد من عبادي ما نقص ذلك من ملكي جناح بعوضة ولو أن أولكم وآخركم وحيكم وميتكم ورطبكم ويابسكم اجتمعوا في صعيد واحد فسأل كل إنسان منكم ما بلغت أمنيته فأعطيت كل سائل منكم ما سأل ما نقص ذلك من ملكي إلا كما لو أن أحدكم مر بالبحر فغمس فيه إبرة ثم رفعها إليه ذلك بأني جواد ماجد أفعل ما أريد عطائي كلام وعذابي كلام إنما أمري لشيء إذا أردته أن أقول له كن فيكون ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وروى بعضهم هذا الحديث عن شهر بن حوشب عن معديكرب عن أبي ذر عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah (s.a.w) said:                      \"Allah,Most High said:'O My Slaves! All of you are astray except whom I guide, so ask Me for guidance and I shall guide you. All of you are poor except whom I enrich, so ask Me and I shall provide you. All of you are sinners except whom I have pardoned, so whoever among you knows that I am the One  able to forgive, and seeks My forgiveness, I shall forgive him, without concern for Me (and it will not affect Me). If the first of you and the last of you, the living among you and the dead among you, the fresh among you and the dry among you were to gather together to help the heart with the most Taqwa among My slaves, that would not add a mosquito's wing to My sovereignty. If the first of you and the last of you, the living among you and the dead among you, the fresh among you and the dry among you were to gather together to help the worst heart  of My slaves, that would not diminish a mosquito's wing to My sovereignty. ll forgive him, without concern for Me (and it will not affect Me). If the first of you and the last of you, the living among you and the dead among you, the fresh among you and the dry among you were to gather together upon one plateau, and each person among them were to ask for his utmost desire, and I were to give each what he asked for, that would not diminish from My sovereignty, except as if one of you were to pass by an ocean and dip a needle into it and then remove it. That is because I am the Most Liberal without need, the Most Generous, doing as I will. I give by My speech and I punish by My speech, whenever I will something I only say: \"Be\" and it shall be.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20023",
        "11044",
        "5152",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2800",
      "hadith_no": "2800",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف آخر أهل النار خروجا من النار وآخر أهل الجنة دخولا الجنة يؤتى برجل فيقول سلوا عن صغار ذنوبه واخبئوا كبارها ‏.‏ فيقال له عملت كذا وكذا يوم كذا وكذا عملت كذا وكذا في يوم كذا وكذا ‏.‏ قال فيقال له فإن لك مكان كل سيئة حسنة ‏.‏ قال فيقول يا رب لقد عملت أشياء ما أراها ها هنا ‏\"‏ ‏.‏ قال فلقد رأيت رسول الله صلى الله عليه وسلم يضحك حتى بدت نواجذه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah(s.a.w) said:                     \" I know the last of the people of the Fire to depart from the Fire and the last of the people of Paradise to enter Paradise. A man will be brought forth and He (s.a.w) will say: 'Ask about his small sins and hide his large sins.' So it will be said to him: 'Did you do this and that on such and such a day, did you do this and that on  such- and",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2644-2",
      "hadith_no": "2644",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن حبيب بن أبي ثابت، وعبد العزيز بن رفيع، والأعمش، كلهم سمعوا زيد بن وهب، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل فبشرني فأخبرني أنه من مات لا يشرك بالله شيئا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي الدرداء ‏.‏",
      "text_en": " Narrated Abu Dharr:                     that the Messenger of Allah (ﷺ) said: \"Jibril came to me and gave me glad tidings, that whoever dies without associating  anything with Allah, then he will enter Paradise. I said: \"Even if he commits adultery and theft?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11331",
        "11257",
        "11060",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2707-2",
      "hadith_no": "2707",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عبيد الله بن أبي جعفر، عن أبي عبد الرحمن الحبلي، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كشف سترا فأدخل بصره في البيت قبل أن يؤذن له فرأى عورة أهله فقد أتى حدا لا يحل له أن يأتيه لو أنه حين أدخل بصره استقبله رجل ففقأ عينيه ما غيرت عليه وإن مر رجل على باب لا ستر له غير مغلق فنظر فلا خطيئة عليه إنما الخطيئة على أهل البيت ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وأبي أمامة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه مثل هذا إلا من حديث ابن لهيعة وأبو عبد الرحمن الحبلي اسمه عبد الله بن يزيد ‏.‏",
      "text_en": " Narrated Abu Dharr:                     that the Messenger of Allah (ﷺ) said: \"Whoever lifts the curtain so that his sight enters the house before he was given permission, and he seeks the nakedness of its inhabitants, then he has done something punishable which was not lawful for him to do. If it were that when he gazed into it, he was facing a man who lanced his eyes, there would be nothing wrong with him doing so. But if a man passes by a door that has no cover over it, and it is not closed and he looks, then there is no sin on him, the sin is only on the inhabitants of the house.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "11409",
        "10938",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3534",
      "hadith_no": "3534",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال دخلت المسجد حين غابت الشمس والنبي صلى الله عليه وسلم جالس فقال النبي صلى الله عليه وسلم ‏\"‏ أتدري يا أبا ذر أين تذهب هذه ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تذهب فتستأذن في السجود فيؤذن لها وكأنها قد قيل لها اطلعي من حيث جئت فتطلع من مغربها ‏\"‏ ‏.‏ قال ثم قرأ ‏:‏ ‏(‏وذلك مستقر لها ‏)‏ قال وذلك قراءة عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Dharr:                     \"I entered the Masjid when the sun had set, and the Prophet (ﷺ) was sitting. He said: 'O Abu Dharr! Do you know where this goes?' I said: 'Allah and His Messenger know better.' He said: 'Indeed it goes to seek permission to prostrate, so it is permitted. And it is as if it has been said to it: \"Rise from its setting place.' Then he recited: 'That is its fixed course.'\" He said: \"That is the recitation of 'Abdullah bin Mas'ud.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3474-2",
      "hadith_no": "3474",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا علي بن معبد المصري، حدثنا عبيد الله بن عمرو الرقي، عن زيد بن أبي أنيسة، عن شهر بن حوشب، عن عبد الرحمن بن غنم، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال في دبر صلاة الفجر وهو ثاني رجليه قبل أن يتكلم لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير عشر مرات كتب له عشر حسنات ومحي عنه عشر سيئات ورفع له عشر درجات وكان يومه ذلك في حرز من كل مكروه وحرس من الشيطان ولم ينبغ لذنب أن يدركه في ذلك اليوم إلا الشرك بالله ‏\"‏ ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Abu Dharr narrated that:                     The Messenger of Alah said: “Whoever says at the end of every Fajr prayer, while his feet are still folded, before speaking: ‘None has the right to be worshipped but Allah, Alone without partner, to Him belongs all that exists, and to Him is the praise, He gives life and causes death, and He is powerful over all things, (La Ilaha Illallah, Wahdahu La Sharika Lahu, Lahul-Mulku Wa Lahul-Hamdu, Yuhyi Wa Yumitu, Wa Huwa Ala Kulli Shai’in Qadir)’ ten times, then ten good deeds shall be wiped away from him, ten degrees shall be raised up for him, and he shall be in security all that day from every disliked thing, and he shall be in protection from Shaitan, and no sin will meet him or destroy him that day, except for associating partners with Allah.”",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "36046",
        "20445",
        "11340",
        "11044",
        "5152",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3593-2",
      "hadith_no": "3593",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا إسماعيل بن إبراهيم، أخبرنا الجريري، عن أبي عبد الله الجسري، عن عبد الله بن الصامت، عن أبي ذر، رضى الله عنه أن رسول الله صلى الله عليه وسلم عاده أو أن أبا ذر عاد رسول الله صلى الله عليه وسلم فقال بأبي أنت يا رسول الله أى الكلام أحب إلى الله عز وجل قال ‏\"‏ ما اصطفى الله لملائكته سبحان ربي وبحمده سبحان ربي وبحمده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah visited him, or that Abu Dharr visited the Messenger of Allah, and said:                     “May my father and my mother be ransomed for you, O Messenger of Allah! Which speech is most beloved to Allah [the Mighty and Sublime]?” So he said: “That which Allah selected for His angels (to say): ‘Glory to my Lord, and with His praise. Glory to my Lord, and with His praise. (Subhana Rabbi Wa Bihamdihi, Wa Subhana Rabbi Wa Bihamdihi).’”",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "20208",
        "11286",
        "10695",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4172",
      "hadith_no": "4172",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا العباس العنبري، حدثنا النضر بن محمد، حدثنا عكرمة بن عمار، حدثنا أبو زميل، هو سماك بن الوليد الحنفي عن مالك بن مرثد، عن أبيه، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أظلت الخضراء ولا أقلت الغبراء من ذي لهجة أصدق ولا أوفى من أبي ذر شبه عيسى ابن مريم عليه السلام ‏\"‏ ‏.‏ فقال عمر بن الخطاب كالحاسد يا رسول الله أفنعرف ذلك له قال ‏\"‏ نعم فاعرفوه له ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روى بعضهم هذا الحديث فقال ‏\"‏ أبو ذر يمشي في الأرض بزهد عيسى ابن مريم عليه السلام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     that the Messenger of Allah (ﷺ) said: \"There is no one more truthful in speech, nor in fulfilling of promises, that sky has covered and the earth has carried, than Abu Dharr, the likeness of 'Eisa bin Mariam.\" So 'Umar bin Al-Khattab said, as if out of envy: \"So do you acknowledge that for him, O Messenger of Allah?\" He said: \"Yes, so acknowledge it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "28603",
        "10704",
        "10771",
        "18966",
        "18973",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-324",
      "hadith_no": "324",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن هشام، قال حدثنا مخلد، عن سفيان، عن أيوب، عن أبي قلابة، عن عمرو بن بجدان، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصعيد الطيب وضوء المسلم وإن لم يجد الماء عشر سنين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah (ﷺ) said: 'Clean earth is the Wudu' of the Muslim, even if he does not find water for ten years.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38434",
        "20462",
        "20012",
        "11015",
        "11047",
        "19856",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-690-2",
      "hadith_no": "690",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، قال كنت أقرأ على أبي القرآن في السكة فإذا قرأت السجدة سجد فقلت يا أبت أتسجد في الطريق فقال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم أى مسجد وضع أولا قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت وكم بينهما قال ‏\"‏ أربعون عاما والأرض لك مسجد فحيثما أدركت الصلاة فصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibrahim said:                      \"I used to recite Qur'an to my father on the road, and if I recited a verse in which prostration was required, he would prostrate. I said: 'O my father, do you prostrate on the street?' He said: 'I heard Abu Dharr say: \"I asked the Messenger of Allah (ﷺ): 'Which Masjid was built first?' He said: 'Al-Masjid Al-Haram.' [1] I said: 'Then which?' He said: 'Al-Masjid Al-Aqsa.' [2] I said: 'How long was there between them?' He said: 'Forty years. And the earth is a Masjid (or a place of prostration) for you, so wherever you are when the time for prayer comes, pray.'\"[1] In Makkah.[2] \"Furthest Masjid\", meaning the Masjid in Jerulsalem.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11051",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-750",
      "hadith_no": "750",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يزيد، قال حدثنا يونس، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان أحدكم قائما يصلي فإنه يستره إذا كان بين يديه مثل آخرة الرحل فإن لم يكن بين يديه مثل آخرة الرحل فإنه يقطع صلاته المرأة والحمار والكلب الأسود ‏\"‏ ‏.‏ قلت ما بال الأسود من الأصفر من الأحمر فقال سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      The messenger of Allah(ﷺ) said: \"When anyone of you stands to pray, then he is screened if he has in front of him something as high as the back of a camel saddle. If he does not have something as high as the back of a camel saddle in front of him, then his prayer is nullified by a woman, a donkey or a black dog.\" I (one of the narrators)said: \"What is the difference between a black dog, a yellow one and a red one?\" He said: I asked the Messenger of Allah (ﷺ) just like you and he said:\"The black dog is a shaitan.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20472",
        "20475",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-859",
      "hadith_no": "859",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، ومحمد بن إبراهيم بن صدران، - واللفظ له - عن خالد بن الحارث، قال حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ahu Dharr said:                      \"The Messenger of A;;ah (ﷺ) said to me, and struck my thigh: 'What will you do if you stay among people who delay the prayer until its time is over?' He said: 'What do you command me to do?' He said: 'Offer the prayer on time, then go about your business, Then if the Iqamah for that prayer is saidand you are in the Masjid, then pray.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "11213",
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1010",
      "hadith_no": "1010",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا نوح بن حبيب، قال حدثنا يحيى بن سعيد القطان، قال حدثنا قدامة بن عبد الله، قال حدثتني جسرة بنت دجاجة، قالت سمعت أبا ذر، يقول قام النبي صلى الله عليه وسلم حتى أصبح بآية والآية ‏{‏ إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم ‏}‏ ‏.‏",
      "text_en": " Jasrah bint Dijajah said:                     \"I heard Abu Dharr say: 'The Prophet (ﷺ) stayed up all night repeating one verse. The verse was: 'If You punish them, they are Your slaves, and if You forgive them, verily, You, only You, are the All-Mighty, the All-Wise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38671",
        "20031",
        "19462",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1191",
      "hadith_no": "1191",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، والحسين بن حريث، - واللفظ له - عن سفيان، عن الزهري، عن أبي الأحوص، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام أحدكم في الصلاة فلا يمسح الحصى فإن الرحمة تواجهه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah (ﷺ) said: 'When any one of you stands in prayer, let him not smooth the pebbles, for he is facing Mercy.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30325",
        "20005",
        "11013",
        "20327",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1195",
      "hadith_no": "1195",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن يونس، عن الزهري، قال سمعت أبا الأحوص، يحدثنا في مجلس سعيد بن المسيب وابن المسيب جالس أنه سمع أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الله عز وجل مقبلا على العبد في صلاته ما لم يلتفت فإذا صرف وجهه انصرف عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Az-Zuhri said:                     \"I heard Abu Al-Ahwas saying to us in a gathering with Ibn Al-Musayyab when Ibn Al-Musayyab was sitting there, that he had heard Abu Dharr say: The Messenger of Allah (ﷺ) said: \"Allah (SWT) continues to look upon His slave while he is praying, so long as he does not turn away. If he turns his face away, He turns away from him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20475",
        "11013",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1364",
      "hadith_no": "1364",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا النبي صلى الله عليه وسلم حتى بقي سبع من الشهر فقام بنا حتى ذهب نحو من ثلث الليل ثم كانت سادسة فلم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب نحو من شطر الليل قلنا يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال ثم كانت الرابعة فلم يقم بنا فلما بقي ثلث من الشهر أرسل إلى بناته ونسائه وحشد الناس فقام بنا حتى خشينا أن يفوتنا الفلاح ثم لم يقم بنا شيئا من الشهر ‏.‏ قال داود قلت ما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted Ramadan with the Messenger of Allah (ﷺ), and the Prophet (ﷺ) did not lead us in Qiyam until there were seven days left of the month, then he led us in Qiyam until one-third of the night had passed. Then, when there were six days left, he did not lead us in Qiyam. When there were five days left, he led us in praying Qiyam until half the night had passed. We said: 'O Messenger of Allah (SA), why don't you lead us in praying Qiyam for the rest of the night?' He said: 'If a man prays with the Imam until he leaves, that will be continued for him as if he spent the whole night in prayer.' Then, when there were four days left, he did not lead us in praying Qiyam. When there were three days left he sent for his daughters and women, and gathered the people, and he led us in praying Qiyam until we feared that we would miss Al-Falah. Then he did not lead us in praying Qiyam for the rest of the month.\" Dawud (one of the narrators) said: \"I said: ' What is falah?' He said: 'Sahur.'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1605",
      "hadith_no": "1605",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم في رمضان فلم يقم بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة فقام بنا في الخامسة حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ قال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب الله له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا ولم يقم حتى بقي ثلاث من الشهر فقام بنا في الثالثة وجمع أهله ونساءه حتى تخوفنا أن يفوتنا الفلاح ‏.‏ قلت وما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted with the Messenger of Allah (ﷺ) in Ramadan and he did not lead us in praying Qiyam until there were seven days left in the month, when he led us in praying Qiyam until one-third of the night had passed. Then he did not lead us in praying Qiyam when there were six days left. Then he led us praying Qiyam when there were five days left until one-half of the night had passed. I said: \"O Messenger of Allah! What if we spend the rest of this night praying Nafl?\" He said: \"Whoever prays Qiyam with the Imam until he finishes, Allah (SWT) will record for him the Qiyam of a (whole) night.\" Then he did not lead us in prayer or pray Qiyam until there were three days of the month left. Then he led us in praying Qiyam when there were three days left. He gathered his family and wives (and led us in prayer) until we feared that we would miss Al-Falah. I (one of the narrators) said: \"What is Al-Falah?\" He said: \"The suhur\".",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1788",
      "hadith_no": "1788",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن سفيان الثوري، عن عبدة، قال سمعت سويد بن غفلة، عن أبي ذر، وأبي الدرداء، موقوفا ‏.‏",
      "text_en": " It was narrated from Sufyan, that 'Abdah said:                     \"I heard Suwaid bin Ghaflah (narrate it) from Abu Dharr and Abu Ad-Darda.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20012",
        "20337",
        "11174",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2086",
      "hadith_no": "2086",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن الوليد بن جميع، قال حدثنا أبو الطفيل، عن حذيفة بن أسيد، عن أبي ذر، قال إن الصادق المصدوق صلى الله عليه وسلم حدثني ‏\"‏ أن الناس يحشرون ثلاثة أفواج فوج راكبين طاعمين كاسين وفوج تسحبهم الملائكة على وجوههم وتحشرهم النار وفوج يمشون ويسعون يلقي الله الآفة على الظهر فلا يبقى حتى إن الرجل لتكون له الحديقة يعطيها بذات القتب لا يقدر عليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said;\"The truthful one whom people believe told me:                      'The people will be gathered in three groups: A group who will be riding, well fed and well clothed; a group whom the angels will drag on their faces and whom the fire will drive; and a group who will be walking with difficulty. Allah will send a disease to kill all the riding beasts and none will remain, until a man would give a garden for a she-camel but he will not be able to have it.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "3660",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2404",
      "hadith_no": "2404",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا محمد بن أبي حرملة، عن عطاء بن يسار، عن أبي ذر، قال أوصاني حبيبي صلى الله عليه وسلم بثلاثة لا أدعهن إن شاء الله تعالى أبدا أوصاني بصلاة الضحى وبالوتر قبل النوم وبصيام ثلاثة أيام من كل شهر ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"My beloved Prophet advised me to do three things which I will never give up, if Allah wills. He advised me to pray Duha, to pray Witr before sleeping, and to fast three days of each month.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11535",
        "11020",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2409",
      "hadith_no": "2409",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن الحسن اللاني، بالكوفة عن عبد الرحيم، - وهو ابن سليمان - عن عاصم الأحول، عن أبي عثمان، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام ثلاثة أيام من الشهر فقد صام الدهر كله ‏\"‏ ‏.‏ ثم قال ‏\"‏ صدق الله في كتابه ‏{‏ من جاء بالحسنة فله عشر أمثالها ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: 'Whoever fasts for three days of each month, he has fasted for a whole lifetime.' Then he said: Allah has spoken the truth in His book: Whoever brings a good deed shall have ten times the like thereof to his credit.",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11080",
        "11113",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2410",
      "hadith_no": "2410",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن عاصم، عن أبي عثمان، عن رجل، قال أبو ذر سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صام ثلاثة أيام من كل شهر فقد تم صوم الشهر أو فله صوم الشهر ‏\"‏ ‏.‏ شك عاصم ‏.‏",
      "text_en": " Abu 'Uthman reported from a man, that Abu Dharrr said:                     \"I heard the Messenger of Allah say: \"Whoever fasts three days of each month has fasted the month in full' or 'will have (the reward of) fasting the month.\"' 'Asim was in doubt.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11080",
        "11113",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2422",
      "hadith_no": "2422",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال أنبأنا الفضل بن موسى، عن فطر، عن يحيى بن سام، عن موسى بن طلحة، عن أبي ذر، قال أمرنا رسول الله صلى الله عليه وسلم أن نصوم من الشهر ثلاثة أيام البيض ثلاث عشرة وأربع عشرة وخمس عشرة ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah commanded us to fast the three days of Al-Bid, the thirteenth, fourteenth and fifteenth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30380",
        "20452",
        "19145",
        "579",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2423",
      "hadith_no": "2423",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا عبد الرحمن، قال حدثنا شعبة، عن الأعمش، قال سمعت يحيى بن سام، عن موسى بن طلحة، عن أبي ذر، قال أمرنا رسول الله صلى الله عليه وسلم أن نصوم من الشهر ثلاثة أيام البيض ثلاث عشرة وأربع عشرة وخمس عشرة ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah commanded us to fast three days of Al-Bid,  the thirteenth, fourteenth and fifteenth.\"",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "20020",
        "11060",
        "19145",
        "579",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2425",
      "hadith_no": "2425",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن منصور، عن سفيان، عن بيان بن بشر، عن موسى بن طلحة، عن ابن الحوتكية، عن أبي ذر، أن النبي صلى الله عليه وسلم قال لرجل ‏\"‏ عليك بصيام ثلاث عشرة وأربع عشرة وخمس عشرة ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ ليس من حديث بيان ولعل سفيان قال حدثنا اثنان فسقط الألف فصار بيان ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said to a man:                     \"You should fast the thirteenth, fourteenth and fifteenth.\" (Hasan)Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake, it is not a narration of Bayan; perhaps Sufyan said: \"It was narrated to us by two (Ithnan)\" and the 'Alif was dropped so it became Bayan.",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11326",
        "579",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2426",
      "hadith_no": "2426",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا سفيان، قال حدثنا رجلان، محمد وحكيم عن موسى بن طلحة، عن ابن الحوتكية، عن أبي ذر، أن النبي صلى الله عليه وسلم أمر رجلا بصيام ثلاث عشرة وأربع عشرة وخمس عشرة ‏.‏",
      "text_en": " It was narrated from Abu Dharr:                     That the Prophet commanded a man to fast on the thirteenth, fourteenth and fifteenth.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20005",
        "579",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2440",
      "hadith_no": "2440",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هناد بن السري، في حديثه عن أبي معاوية، عن الأعمش، عن المعرور بن سويد، عن أبي ذر، قال جئت إلى النبي صلى الله عليه وسلم وهو جالس في ظل الكعبة فلما رآني مقبلا قال ‏\"‏ هم الأخسرون ورب الكعبة ‏\"‏ ‏.‏ فقلت ما لي لعلي أنزل في شىء قلت من هم فداك أبي وأمي قال ‏\"‏ الأكثرون أموالا إلا من قال هكذا وهكذا وهكذا حتى بين يديه وعن يمينه وعن شماله ‏\"‏ ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لا يموت رجل فيدع إبلا أو بقرا لم يؤد زكاتها إلا جاءت يوم القيامة أعظم ما كانت وأسمنه تطؤه بأخفافها وتنطحه بقرونها كلما نفدت أخراها أعيدت أولاها حتى يقضى بين الناس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I come to the Prophet while he was sitting in the shade of the Ka'bah. When he saw me coming he said: 'They are the losers, by the Lord of the Ka'bah!' I said: 'what's happening? Perhaps something has been revealed concerning me.' I said: 'Who are they, may my father said mother be ransomed for you?' He said: \"those who have a lot of wealth, except one who does like this, and like this, and like this,' (motioning) in front of him, and to his right, and to his left. Then he said: 'By the One in Whose hand is my soul, no man dies leaving camels, or cattle, or sheep on which he did not pay the Zakah, but they will come on the Day of Resurrection as big and fat as they ever were, trampling him with their hooves and goring him with their horns. Every time the last of them runs over him, the first of them will come back, until judgment is passed among the people.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2456",
      "hadith_no": "2456",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من صاحب إبل ولا بقر ولا غنم لا يؤدي زكاتها إلا جاءت يوم القيامة أعظم ما كانت وأسمنه تنطحه بقرونها وتطؤه بأخفافها كلما نفذت أخراها أعادت عليه أولاها حتى يقضى بين الناس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: There is no owner of camels, cattle or sheep who does not give Zakah on them, but they will come on the Day of Resurrection as big and fast as they ever were, and will gore him with their horns and trample him with their hooves. Every time the last of them has run over him the first of them will come back to him, until judgment is passed among the people.\"",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2563",
      "hadith_no": "2563",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن علي بن المدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقرأها رسول الله صلى الله عليه وسلم فقال أبو ذر خابوا وخسروا خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنفق سلعته بالحلف الكاذب والمنان عطاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said:                     \"There are three to whom Allah will not speak on the Day of Resurrection, or look at them, or sanctify them, and theirs will be a painful torment.\" The Messenger of Allah repeated and Abu Dharr said: \"May they be lost and doomed.\" He said: \"The one who lets his garment hang beneath his ankles, a vendor who tries to sell his product by means of false oaths, and the one who reminds people of what he has given them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2564",
      "hadith_no": "2564",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، قال سمعت سليمان، - وهو الأعمش - عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم المنان بما أعطى والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: \"There are three to whom of Allah will not speak on the Day of Resurrection or look at them or purify them, and theirs will be a painful torment: the one who reminds people of what he has given them, the one who lets his garment hang beneath his ankles, and a vendor who tries to sell his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "5077",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2810",
      "hadith_no": "2810",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد، قال حدثنا شعبة، قال سمعت عبد الوارث بن أبي حنيفة، قال سمعت إبراهيم التيمي، يحدث عن أبيه، عن أبي ذر، قال في متعة الحج ليست لكم ولستم منها في شىء إنما كانت رخصة لنا أصحاب محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Dharr said concerning Tamattu' in Hajj:                     it is not for you, and you have nothing to do with it; it was only for us, the Companions of Muhammad.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20278",
        "20020",
        "25175",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2811",
      "hadith_no": "2811",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا بشر بن خالد، قال أنبأنا غندر، عن شعبة، عن سليمان، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال كانت المتعة رخصة لنا ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     Tamattu was just for us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-3129",
      "hadith_no": "3129",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن عبيد الله بن أبي جعفر، قال أخبرني عروة، عن أبي مراوح، عن أبي ذر، أنه سأل نبي الله صلى الله عليه وسلم أى العمل خير قال ‏\"‏ إيمان بالله وجهاد في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that he asked the prophet of Allah (ﷺ) which deed was best. He said:                      \"Belief in Allah and Jihad in the cause of Allah, the Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11409",
        "10511",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-3579",
      "hadith_no": "3579",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يحيى، قال حدثنا عبد الحميد بن جعفر، قال حدثني يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من فرس عربي إلا يؤذن له عند كل سحر بدعوتين اللهم خولتني من خولتني من بني آدم وجعلتني له فاجعلني أحب أهله وماله إليه أو من أحب ماله وأهله إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah said: 'There is no Arabian horse but it is allowed to offer two supplications every Sahar (end of the night): O Allah, You have caused me to be owned by whoever You wanted among the sons of Adam, and you have made me belong to him. Make me the dearest of his family and wealth to him, or among the dearest of his family and wealth to him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11875",
        "11411",
        "16165",
        "398",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-3667",
      "hadith_no": "3667",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا العباس بن محمد، قال حدثنا عبد الله بن يزيد، عن سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين على مال يتيم ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah said to me: 'O Abu Dharr, I think that you are weak, and I like for you what I like for myself. Do not accept a position of Amir over two people, and do not agree to be the guardian of an orphan's property.'\"",
      "usc_msa_ref": "",
      "chain": [
        "1945",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-4458",
      "hadith_no": "4458",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقرأها رسول الله صلى الله عليه وسلم قال أبو ذر خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنفق سلعته بالحلف الكاذب والمنان عطاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said:                     \"There are three to whom Allah will not speak on the Day of Resurrection, or will He look at them, or sanctify them, and theirs will be a painful torment: Abu Dharr said:\" May they be lost and doomed: He said: \"The one who drags his Izar (below the ankles) the one who sells his product by means of false oaths, and the one who reminds others (Al-Mannan) of what he has given to them\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-4459",
      "hadith_no": "4459",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثني سليمان الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم الذي لا يعطي شيئا إلا منه والمسبل إزاره والمنفق سلعته بالكذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said:                     \"There are three at whom Allah will not look on the Day of Resurrection, or will He sanctify them, and theirs will be a painful torment: the one ho does not give anything but he reminds (the recipient of his gift), the on who drags his Izar (below the ankles), and the one who sells his product by means of false oaths,\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11060",
        "5077",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-4991",
      "hadith_no": "4991",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن قدامة، عن جرير، عن أبي فروة، عن أبي زرعة، عن أبي هريرة، وأبي، ذر قالا كان رسول الله صلى الله عليه وسلم يجلس بين ظهرانى أصحابه فيجيء الغريب فلا يدري أيهم هو حتى يسأل فطلبنا إلى رسول الله صلى الله عليه وسلم أن نجعل له مجلسا يعرفه الغريب إذا أتاه فبنينا له دكانا من طين كان يجلس عليه وإنا لجلوس ورسول الله صلى الله عليه وسلم في مجلسه إذ أقبل رجل أحسن الناس وجها وأطيب الناس ريحا كأن ثيابه لم يمسها دنس حتى سلم في طرف البساط فقال السلام عليك يا محمد ‏.‏ فرد عليه السلام قال أدنو يا محمد قال ‏\"‏ ادنه ‏\"‏ ‏.‏ فما زال يقول أدنو مرارا ويقول له ‏\"‏ ادن ‏\"‏ ‏.‏ حتى وضع يده على ركبتى رسول الله صلى الله عليه وسلم قال يا محمد أخبرني ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتحج البيت وتصوم رمضان ‏\"‏ ‏.‏ قال إذا فعلت ذلك فقد أسلمت قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال صدقت ‏.‏ فلما سمعنا قول الرجل صدقت أنكرناه قال يا محمد أخبرني ما الإيمان قال ‏\"‏ الإيمان بالله وملائكته والكتاب والنبيين وتؤمن بالقدر ‏\"‏ ‏.‏ قال فإذا فعلت ذلك فقد آمنت قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا محمد أخبرني ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا محمد أخبرني متى الساعة قال فنكس فلم يجبه شيئا ثم أعاد فلم يجبه شيئا ثم أعاد فلم يجبه شيئا ورفع رأسه فقال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن لها علامات تعرف بها إذا رأيت الرعاء البهم يتطاولون في البنيان ورأيت الحفاة العراة ملوك الأرض ورأيت المرأة تلد ربها خمس لا يعلمها إلا الله ‏{‏ إن الله عنده علم الساعة ‏}‏ إلى قوله ‏{‏ إن الله عليم خبير ‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا والذي بعث محمدا بالحق هدى وبشيرا ما كنت بأعلم به من رجل منكم وإنه لجبريل عليه السلام نزل في صورة دحية الكلبي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah and Abu Dharr said:                     \"The Messenger of Allah [SAW] would sit among his Companions and if a stranger came, he would not know which of them was he (the Prophet [SAW]) until he asked. So we suggested to the Messenger of Allah [SAW] that we should make a dais for him so that any stranger would know him if he came to him. So we built for him a bench made of clay on which he used to sit. (One day) we were sitting and the Messenger of Allah [SAW] was sitting in his spot, when a man came along who was the most handsome and good-smelling of all people, and it was as if no dirt had ever touched his garments. He came near the edge of the rug and greeted him, saying: 'Peace be upon you, O Muhammad!' He returned the greeting, and he said: 'Shall I come closer, O Muhammad?' He came a little closer, and he kept telling him to come closer, until he put his hands on the knees of the Messenger of Allah [SAW]. He said: 'O Muhammad, tell me, what is Islam?' He said: 'Islam means to worship Allah and not associate anything with Him; to establish Salah, to pay Zakah, to perform Hajj to the House, and to fast Ramadan.' He said: 'If I do that, will I have submitted (be a Muslim)?' He said: 'Yes.' He said: 'You have spoken the truth,' we found it odd. He said: 'O Muhammad, tell me, what is faith?' He said: 'To believe in Allah [SWT], His Angels, the Book, the Prophets, and to believe in the Divine Decree.' He said: 'If I do that, will I have believed?' The Messenger of Allah [SAW] said: 'Yes.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me, what is Al-Ihsan?' He said: 'To worship Allah [SWT] as if you can see Him, for although you cannot see Him, He can see you.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me about the Hour.' He lowered his head and did not answer. Then he repeated the question, and he did not answer. Then he repeated the question (a third time) and he did not answer. Then he raised his head and said: 'The one who is being asked does not know more than the one who is asking. But it has signs, by which it may be known. When you see the herdsmen competing in building tall buildings, when you see the barefoot and naked ruling the Earth, when you see a woman giving birth to her mistress. Five things which no one knows except Allah [SWT]. Verily, Allah, with Him (alone) is the knowledge of the Hour up to His saying: 'Verily, Allah is All-Knower, All-Aware (of things).' Then he said: 'No, by the One who sent Muhammad with the truth, with guidance and glad tidings, I did not know him more than any man among you. That was Jibril, peace be upon you, who came down in the form of Dihyah Al-Kalbi.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11653",
        "11406",
        "13",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5077",
      "hadith_no": "5077",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن مسلم، قال حدثنا يحيى بن يعلى، قال حدثنا به أبي، عن غيلان، عن أبي إسحاق، عن ابن أبي ليلى، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل ما غيرتم به الشمط الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that:                     The Prophet [SAW] said: \"The best things with which you can change gray hair are Henna and Katam.\"",
      "usc_msa_ref": "",
      "chain": [
        "167",
        "11300",
        "11049",
        "11196",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5078",
      "hadith_no": "5078",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى بن سعيد، عن الأجلح، عن عبد الله بن بريدة، عن أبي الأسود الديلي، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحسن ما غيرتم به الشيب الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah [SAW] said: 'The best things with which you can change gray hair are Henna and Katam.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20031",
        "11432",
        "11114",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5079",
      "hadith_no": "5079",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الرحمن بن أشعث، قال حدثني محمد بن عيسى، قال حدثنا هشيم، قال أخبرني ابن أبي ليلى، عن الأجلح، فلقيت الأجلح فحدثني عن ابن بريدة، عن أبي الأسود الديلي، عن أبي ذر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن من أحسن ما غيرتم به الشيب الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I heard the Prophet [SAW] say: 'Some of the best things with which you can change gray hair are Henna and Katam.'\"",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20468",
        "11196",
        "11432",
        "11114",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5080",
      "hadith_no": "5080",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبثر، عن الأجلح، عن عبد الله بن بريدة، عن أبي الأسود الديلي، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحسن ما غيرتم به الشيب الحناء والكتم ‏\"‏ ‏.‏ خالفه الجريري وكهمس ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah [SAW] said: 'The best things with which you can change gray hair are Henna and Katam.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11432",
        "11114",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5333",
      "hadith_no": "5333",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، قال سمعت سليمان بن مهران الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا يزكيهم ولهم عذاب أليم المنان بما أعطى والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah [SAW] said: 'There are three to whom Allah (the Mighty and Sublime) will not speak on the Day of Resurrection, nor will He sanctify them, and theirs will be a painful torment: The one who reminds others of what he has given them (Al-Mannan), the one who lets his Izar come below his ankles, and the one who sells his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "5077",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5507",
      "hadith_no": "5507",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، قال حدثنا عبد الرحمن بن عبد الله، عن أبي عمر، عن عبيد بن خشخاش، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم فيه فجئت فجلست إليه فقال ‏\"‏ يا أبا ذر تعوذ بالله من شر شياطين الجن والإنس ‏\"‏ ‏.‏ قلت أوللإنس شياطين قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I entered the Masjid and the Messenger of Allah [SAW] was there, so I came and sat before him and he said: 'O Abu Dharr, seek refuge with Allah from the evils of the devils among the Jinn and mankind.' I said: 'Are there devils among mankind?' He said: 'Yes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20416",
        "20439",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-113",
      "hadith_no": "113",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا عبد الأعلى، عن محمد بن إسحاق، عن مكحول، عن غضيف بن الحارث، عن أبي ذر، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الله وضع الحق على لسان عمر يقول به ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I heard the Messenger of Allah say: 'Allah has placed the truth on the tongue of 'Umar, and he speaks with that (truth).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20246",
        "11107",
        "11066",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-175",
      "hadith_no": "175",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن سليمان بن المغيرة، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن بعدي من أمتي - أو سيكون بعدي من أمتي - قوما يقرءون القرآن لا يجاوز حلوقهم يمرقون من الدين كما يمرق السهم من الرمية ثم لا يعودون فيه هم شرار الخلق والخليقة ‏\"‏ ‏.‏ قال عبد الله بن الصامت فذكرت ذلك لرافع بن عمرو أخي الحكم بن عمرو الغفاري فقال وأنا أيضا قد سمعته من رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: 'There will be people among my Ummah (nation) after me who will recite the Qur'an, but it will not go any deeper than their throats. They will pass through Islam like an arrow passing through its target, then they will never return to it. They are the most evil of mankind and of all creation.' \" 'Abdullah bin Samit said: \"I mentioned to Rafi' bin 'Amr, the brother of Hakam bin 'Amr Ghifari and he said: 'I also heard that from the Messenger of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20236",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-224",
      "hadith_no": "224",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا العباس بن عبد الله الواسطي، حدثنا عبد الله بن غالب العباداني، عن عبد الله بن زياد البحراني، عن علي بن زيد، عن سعيد بن المسيب، عن أبي ذر، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ يا أبا ذر لأن تغدو فتعلم آية من كتاب الله خير لك من أن تصلي مائة ركعة ولأن تغدو فتعلم بابا من العلم عمل به أو لم يعمل خير لك من أن تصلي ألف ركعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said to me: 'O Abu Dharr! For you to come out in the morning and learn one Verse from the Book of Allah is better for you than praying one hundred Rak'ah, and for you to come out and learn a matter of knowledge, whether it is acted upon or not, is better for you than praying one thousand Rak'ah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28300",
        "14210",
        "10664",
        "11002",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-753",
      "hadith_no": "753",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا محمد بن عبيد، ح وحدثنا علي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر الغفاري، قال قلت يا رسول الله أى مسجد وضع أول قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قال قلت ثم أى قال ‏\"‏ ثم المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون عاما ثم الأرض لك مصلى فصل حيث ما أدركتك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr Al-Ghifari said:                     \"I said: 'O Messenger of Allah! Which mosque was built first?' He said: 'Al-Masjid Al-Haram (in Makkah).' I said: 'Then which?' He said: 'then Al-Masjid Al-Aqsa (in Jerusalem).' I said: 'How many years between them?' He said: 'Forty years, but the whole earth is a mosque for you, so pray wherever you are when the time for prayer comes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38412",
        "30213",
        "38409",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-980",
      "hadith_no": "980",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الحسين بن الحسن المروزي، حدثنا سفيان بن عيينة، عن بشر بن عاصم، عن أبيه، عن أبي ذر، قال قيل للنبي  صلى الله عليه وسلم  - وربما قال سفيان قلت - يا رسول الله ذهب أهل الأموال والدثور بالأجر يقولون كما نقول وينفقون ولا ننفق ‏.‏ قال لي ‏\"‏ ألا أخبركم بأمر إذا فعلتموه أدركتم من قبلكم وفتم من بعدكم تحمدون الله في دبر كل صلاة وتسبحونه وتكبرونه ثلاثا وثلاثين وثلاثا وثلاثين وأربعا وثلاثين ‏\"‏ ‏.‏ قال سفيان لا أدري أيتهن أربع ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “It was said to the Prophet(ﷺ) andperhaps (one of the narrators) Sufyan said: I said: OMessenger ofAllah! Those who have property and wealth have surpassedus inreward. They say the same as we do, and they spend but we do notspend.’ He said to me: ‘Shall I not tell you something which, ifyoudo it, you will catch up with those who have surpassed you andyouwill excel over those who come after you? Praise Allah (by sayingAl-Hamdu Lillah) after every prayer, and glorify Him (by sayingSubhan-Allah) and extol Him (by saying Allahu Akbar), thirty-three,thirty-three, and thirty-four times.’” Sufyan said: “I do notknow which ofthem was to be recited thirty-four times.”",
      "usc_msa_ref": "",
      "chain": [
        "20005",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1005",
      "hadith_no": "1005",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ يقطع الصلاة إذا لم يكن بين يدى الرجل مثل مؤخرة الرحل المرأة والحمار والكلب الأسود ‏\"‏ ‏.‏ قال قلت ما بال الأسود من الأحمر فقال سألت رسول الله  صلى الله عليه وسلم  كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Samit from Abu Dharr, that theProphet(ﷺ) said:                      “The prayer is severed by a woman, a donkey, and ablack dog, if there is not something like the handle of a saddle infront of a man.” I (‘Abdullah) said: “What is wrong with ablack dogand not a red one?” He (Abu Dharr) said: ‘I asked theMessenger ofAllah (ﷺ) the same question, and he said: “The blackdog is aShaitan (satan).”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1080",
      "hadith_no": "1080",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن الزهري، عن أبي الأحوص الليثي، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قام أحدكم إلى الصلاة فإن الرحمة تواجهه فلا يمسح الحصى ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “The Messenger of Allah (ﷺ)said:‘When anyone of you gets up to perform prayer, then indeed mercyisfacing him, so he should not smooth the pebbles.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "30269",
        "20005",
        "11013",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1151",
      "hadith_no": "1151",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سهل بن أبي سهل، وحوثرة بن محمد، قالا حدثنا يحيى بن سعيد القطان، عن ابن عجلان، عن سعيد المقبري، عن أبيه، عن عبد الله بن وديعة، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من اغتسل يوم الجمعة فأحسن غسله وتطهر فأحسن طهوره ولبس من أحسن ثيابه ومس ما كتب الله له من طيب أهله ثم أتى الجمعة ولم يلغ ولم يفرق بين اثنين غفر له ما بينه وبين الجمعة الأخرى ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “Whoevertakesa bath on a Friday and does it well, and purifies himself anddoes itwell, and puts on his best clothes, and puts on whatever Allahdecrees for him of the perfume of his family, then comes to themosqueand does not engage in idle talk or separate (pushing between)twopeople; he will be forgiven for (his sins) between that day andtheprevious Friday.”",
      "usc_msa_ref": "",
      "chain": [
        "38259",
        "20031",
        "10616",
        "11168",
        "11212",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1314",
      "hadith_no": "1314",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ صل الصلاة لوقتها فإن أدركت الإمام يصلي بهم فصل معهم وقد أحرزت صلاتك وإلا فهي نافلة لك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “Offerprayeron time, and if you reached the Imam leading them in prayers(ontime), then perform it with them, and you will be safe with yourprayer, otherwise it will be voluntary for you.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1388",
      "hadith_no": "1388",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير الحضرمي، عن أبي ذر، قال صمنا مع رسول الله  صلى الله عليه وسلم  رمضان فلم يقم بنا شيئا منه حتى بقي سبع ليال فقام بنا ليلة السابعة حتى مضى نحو من ثلث الليل ثم كانت الليلة السادسة التي تليها فلم يقمها حتى كانت الخامسة التي تليها ثم قام بنا حتى مضى نحو من شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف فإنه يعدل قيام ليلة ‏\"‏ ‏.‏ ثم كانت الرابعة التي تليها فلم يقمها حتى كانت الثالثة التي تليها ‏.‏ قال فجمع نساءه وأهله واجتمع الناس ‏.‏ قال فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قيل وما الفلاح قال السحور ‏.‏ قال ثم لم يقم بنا شيئا من بقية الشهر ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “We fasted Ramadan with theMessengerof Allah (ﷺ) and he did not lead us in praying Qiyam(prayers atnight) during any part of it, until there were sevennights left. Heled us in praying Qiyam on the seventh night untilapproximately onethird of the night had passed. Then on the sixthnight which followedit he did not lead us in prayer. Then he led usin praying Qiyam onthe fifth night which followed it until almosthalf the night hadpassed. I said: ‘O Messenger of Allah, would thatwe had offeredvoluntary prayers throughout the whole night.’ He said:‘Whoeverstands with the Imam until he finishes, it is equivalent tospendingthe whole night in prayer.’ Then on the fourth night whichfollowedit, he did not lead us in prayer, until the third night thatfollowedit, when he gathered his wives and family, and he peoplegathered,and he led us in prayer until we feared that we would misstheFalah.” It was asked: “What is the Falah?” He said: “Suhur.”Hesaid: “Then he did not lead us in prayer at night for the restof themonth.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20568",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1411",
      "hadith_no": "1411",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن قدامة بن عبد الله، عن جسرة بنت دجاجة، قالت سمعت أبا ذر، يقول قام النبي  صلى الله عليه وسلم  بآية حتى أصبح يرددها والآية ‏{إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم}‏ ‏.‏",
      "text_en": " It wasnarrated that Jasrah bint Dijajah said:                      “I heard Abu Dharrsay:‘The Prophet (ﷺ) stood reciting a Verse and repeating it untilmorning came. That Verse was: “If you punish them, they are Yourslaves, and if You forgive them, verily You, only You, are theAll-Mighty, the All-Wise.’”” [5:118]",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "19462",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1779",
      "hadith_no": "1779",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا سهل بن أبي سهل، حدثنا أبو معاوية، عن عاصم الأحول، عن أبي عثمان، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صام ثلاثة أيام من كل شهر فذلك صوم الدهر ‏\"‏ ‏.‏ فأنزل الله عز وجل تصديق ذلك في كتابه ‏{من جاء بالحسنة فله عشر أمثالها}‏ فاليوم بعشرة أيام ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Messenger of Allah (ﷺ)said:                     “Whoever fasts three days in every month, that is fasting for alifetime.” Then, in testimony of that, Allah revealed: “Whoeverbringsa good deed shall have ten time the like thereof to hiscredit.”[6:160] So one day is equivalent to ten (in reward).",
      "usc_msa_ref": "",
      "chain": [
        "38259",
        "20354",
        "11080",
        "11113",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1857",
      "hadith_no": "1857",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما من صاحب إبل ولا غنم ولا بقر لا يؤدي زكاتها إلا جاءت يوم القيامة أعظم ما كانت وأسمنه تنطحه بقرونها وتطؤه بأخفافها كلما نفدت أخراها عادت عليه أولاها ‏.‏ حتى يقضى بين الناس ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr narrated that:                     the Messenger of Allah said: “There is no now owner of camels, sheeps or cattle who does not pay Zakat on them, but they will come on the Day of Resurrection as big and as fat as they ever were, butting him with their horns and trampling him with their hooves. Every time the of them has passed, the first of them will come back to him, until judgment is passed upon the people.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2121",
      "hadith_no": "2121",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن محمد بن يوسف الفريابي، حدثنا أيوب بن سويد، حدثنا أبو بكر الهذلي، عن شهر بن حوشب، عن أبي ذر الغفاري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله تجاوز عن أمتي الخطأ والنسيان وما استكرهوا عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr Al-Ghifari that the Messenger of Allah (ﷺ) said:                     Allah has forgiven for me my nation their mistakes and forgetfulness, and what they are forced to do.\"",
      "usc_msa_ref": "",
      "chain": [
        "38080",
        "28053",
        "19225",
        "11044",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2292",
      "hadith_no": "2292",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن المسعودي، عن علي بن مدرك، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقلت من هم يا رسول الله فقد خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنان عطاءه والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet (ﷺ) said:                     \"There are three to whom Allah will not speak on the Day of Resurrection nor will He look at them or purify them, and theirs will be a painful torment.\" I said: \"Who are they, O Messenger of Allah? For they are indeed losers.\" He said: \"The one who lets his garment hang beneath his ankles, the one who reminds another of what he has given him, and the one who sells his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20724",
        "11377",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2319-2",
      "hadith_no": "2319",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الوارث بن عبد الصمد بن عبد الوارث بن سعيد أبو عبيدة، حدثني أبي قال، حدثني أبي، حدثني الحسين بن ذكوان، عن عبد الله بن بريدة، قال حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من ادعى ما ليس له فليس منا وليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that he heard the Messenger of Allah (ﷺ) say:                     “Whoever claims something that does not belong to him; he is not one of us, so let him take his place in Hell.”",
      "usc_msa_ref": "",
      "chain": [
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2619",
      "hadith_no": "2619",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو معاوية، حدثنا هشام بن عروة، عن أبيه، عن أبي مراوح، عن أبي ذر، قال قلت يا رسول الله أى الرقاب أفضل قال ‏\"‏ أنفسها عند أهلها وأغلاها ثمنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     “I said: 'O Messenger of Allah (ﷺ), which slave is best?' He said: ‘The one who is most precious to his master and most valuable in price.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20354",
        "11065",
        "10511",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2972",
      "hadith_no": "2972",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، أنه انتهى إلى الربذة وقد أقيمت الصلاة فإذا عبد يؤمهم فقيل هذا أبو ذر ‏.‏ فذهب يتأخر فقال أبو ذر أوصاني خليلي صلى الله عليه وسلم أن أسمع وأطيع وإن كان عبدا حبشيا مجدع الأطراف ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that he reached Rabadhah when theIqamah forthe prayer had already been given, and there was a slaveleading themin prayer. It was said:                      “This is Abu Dharr,” so he (theslave)started to move back. But Abu Dharr said: “My close friend(i.e.,the Prophet (ﷺ)) told me to listen and obey, even if (theleaderwas) an Ethiopian slave with amputated limbs.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3099",
      "hadith_no": "3099",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال كانت المتعة في الحج لأصحاب محمد  صلى الله عليه وسلم  خاصة ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “Tamattu’ in Hajj was for theCompanions of Muhammad (ﷺ) specifically.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3331",
      "hadith_no": "3331",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عبد الله، حدثنا وكيع، عن سليمان بن المغيرة، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال سألت رسول الله  صلى الله عليه وسلم  عن الكلب الأسود البهيم فقال ‏\"‏ شيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “I asked the Messenger of Allah(ﷺ)about the all-black dog and he said: ‘(It is) a devil.’”",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20236",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3487",
      "hadith_no": "3487",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا أبو عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا عملت مرقة فأكثر ماءها واغترف لجيرانك منها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “When youmakebroth, add more water and give some to your neighbor.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3739",
      "hadith_no": "3739",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا العباس بن يزيد البحراني، حدثنا وكيع بن محرز الناجي، حدثنا عثمان بن جهم، عن زر بن حبيش، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من لبس ثوب شهرة أعرض الله عنه حتى يضعه متى وضعه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “Whoeverwearsa garment of pride and vanity, Allah will turn away from himuntil hetakes it off.”",
      "usc_msa_ref": "",
      "chain": [
        "24479",
        "11337",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3753",
      "hadith_no": "3753",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، عن الأجلح، عن عبد الله بن بريدة، عن أبي الأسود الديلي، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أحسن ما غيرتم به الشيب الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Messenger of Allah (ﷺ)said:                      “Thebest things with which you change gray hair are henna andKatam.”*",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20102",
        "11432",
        "11114",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3683-2",
      "hadith_no": "3683",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا هشام بن حسان، عن واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال عرضت على أمتي بأعمالها حسنها وسيئها فرأيت في محاسن أعمالها الأذى ينحى عن الطريق ورأيت في سيئ أعمالها النخاعة في المسجد لا تدفن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet(ﷺ) said:                     \"My nation was shown to me with thier good deeds and bad deeds. Among their good deeds I saw a harmful thing being removed from the road. And among their bad deeds I saw sputum in the mosque that had not been removed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11311",
        "10726",
        "11316",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3690-2",
      "hadith_no": "3690",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إخوانكم جعلهم الله تحت أيديكم فأطعموهم مما تأكلون وألبسوهم مما تلبسون ولا تكلفوهم ما يغلبهم فإن كلفتموهم فأعينوهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dhar said:                     \"The Messenger of Allah said: '(Slaves are) your brothers whom Allah has put under your control, so feed them with the same food that you eat, clothe them with the same clothes you wear, and do not burden them with so much that htey are overwhelmed; if you do burden them, then help them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3724-2",
      "hadith_no": "3724",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا إسماعيل بن عبد الله، حدثنا محمد بن نعيم بن عبد الله المجمر، عن أبيه، عن ابن طخفة الغفاري، عن أبي ذر، قال مر بي النبي  صلى الله عليه وسلم  وأنا مضطجع على بطني فركضني برجله وقال ‏\"‏ يا جنيدب إنما هذه ضجعة أهل النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Prophet(ﷺ) passed by me and I was lying on my stomach. He nudged me with his foot and said: 'O Junaidib! This is how the people of Hell lie.'\"\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "30103",
        "20506",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3821",
      "hadith_no": "3821",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يقول الله تبارك وتعالى من جاء بالحسنة فله عشر أمثالها وأزيد ومن جاء بالسيئة فجزاء سيئة مثلها أو أغفر ومن تقرب مني شبرا تقربت منه ذراعا ومن تقرب مني ذراعا تقربت منه باعا ومن أتاني يمشي أتيته هرولة ومن لقيني بقراب الأرض خطيئة ثم لا يشرك بي شيئا لقيته بمثلها مغفرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that :                     the Messenger of Allah (saas) said: \"Allah, the Blessed and Exalted, said: 'Whoever does one good deed will have (the reward of) ten like it and more, and whoever does a bad deed will have one like it, or I will forgive him.  Whoever draws near to Me a hand span, I draw near to him an arm's length; whoever comes to Me a forearm's length, I draw near him an arm's length; whoever comes to Me walking, I come to him in a hurry.  Whoever meets Me with an earthful of sins, but does not associate anything in worship with Me, I will meet it (i.e., his sins) with forgiveness equal to that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3825",
      "hadith_no": "3825",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن أبي ذر، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا أدلك على كنز من كنوز الجنة ‏\"‏ ‏.‏ قلت بلى يا رسول الله ‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah (saas) said to me: \"Shall I not tell you of a treasure which is one of the treasures of Paradise?' I said: 'Yes, O Messenger of Allah.' He said: 'La hawla wa la quwwata illa billah (There is no power and no strength except with Allah).'\" (sahih)",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11028",
        "11196",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-4093",
      "hadith_no": "4093",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كيف أنت يا أبا ذر وموتا يصيب الناس حتى يقوم البيت بالوصيف ‏\"‏ ‏.‏ يعني القبر قلت ما خار الله لي ورسوله - أو قال الله ورسوله أعلم - قال ‏\"‏ تصبر ‏\"‏ ‏.‏ قال ‏\"‏ كيف أنت وجوعا يصيب الناس حتى تأتي مسجدك فلا تستطيع أن ترجع إلى فراشك ولا تستطيع أن تقوم من فراشك إلى مسجدك ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم أو - ما خار الله لي ورسوله - قال ‏\"‏ عليك بالعفة ‏\"‏ ‏.‏ ثم قال ‏\"‏ كيف أنت وقتلا يصيب الناس حتى تغرق حجارة الزيت بالدم ‏\"‏ ‏.‏ قلت ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ الحق بمن أنت منه ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا آخذ بسيفي فأضرب به من فعل ذلك قال ‏\"‏ شاركت القوم إذا ولكن ادخل بيتك ‏\"‏ ‏.‏ قلت يا رسول الله فإن دخل بيتي قال ‏\"‏ إن خشيت أن يبهرك شعاع السيف فألق طرف ردائك على وجهك فيبوء بإثمه وإثمك فيكون من أصحاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Messenger of Allah (ﷺ)said:                      “What will you do, O Abu Dharr, when death overwhelms thepeopleto such an extent that a grave will be equal in value to aslave?” Isaid: “Whatever Allah and His Messenger choose for me,or Allah andHis Messenger know best.” He said “Be patient.” Hesaid: ‘What willyou do when famine strikes the people so that youwill go to the placewhere you pray and will not be able to return toyour bed, or you willnot be able to get up from your bed to go tothe place where youpray?” He said: “I said: ‘Allah and HisMessenger know best, orwhatever Allah and His Messenger choose forme.” He said: “You mustrefrain from forbidden things.” Hesaid: “What will you do whenkilling befalls the people so thatHijaratuz-Zait*is covered withblood?” I said: “Whatever Allahand His Messenger choose for me.” Hesaid: “Stay with those whomyou belong to.” He said: “I said: ‘OMessenger of Allah, shouldI not take my sword and strike those who dothat?’” He said:“Then you will be just like the people. Rather enteryour house.”I said: “O Messenger of Allah, what if they enter myhouse?” Hesaid: “If you are afraid that the flashing of the swordwill dazzleyou, then put the edge of your garment over your face, andlet himcarry his own sin and your sin, and he will be one of thepeople ofthe Hellfire.”",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    }
  ],
  "total_hadiths": 204
}