{
  "id": "23011",
  "name": "al-Hasan bin Muhammad bin 'Ubaidullah الحسن بن محمد بن عبيد الله",
  "full_name": "al-Hasan bin Muhammad bin 'Ubaidullah الحسن بن محمد بن عبيد الله",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ت  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "23059",
      "name": "Muhammad bin Yazid bin Khnys محمد بن يزيد بن خنيس المخزومي مولاهم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "579",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا محمد بن يزيد بن خنيس، حدثنا الحسن بن محمد بن عبيد الله بن أبي يزيد، قال قال لي ابن جريج يا حسن أخبرني عبيد الله بن أبي يزيد، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني رأيتني الليلة وأنا نائم كأني أصلي خلف شجرة فسجدت فسجدت الشجرة لسجودي فسمعتها وهي تقول اللهم اكتب لي بها عندك أجرا وضع عني بها وزرا واجعلها لي عندك ذخرا وتقبلها مني كما تقبلتها من عبدك داود ‏.‏ قال الحسن قال لي ابن جريج قال لي جدك قال ابن عباس فقرأ النبي صلى الله عليه وسلم سجدة ثم سجد ‏.‏ قال فقال ابن عباس فسمعته وهو يقول مثل ما أخبره الرجل عن قول الشجرة ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عباس لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Al-Hasan bin Muhammad bin Ubaidullah bin Abi Yazid said:                     Ibn Juraij said to me: O Hasan! Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: \"A man came to the Prophet and said: 'O Messenger of Allah! I had a dream at night while I was sleeping in which I was praying behind a tree, when I prostrated the tree prostrated along with me. Then I heard it saying: (Allahummaktuh li biha indaka ajran, wad a anni biha wizran, waj'alha li biha indaka dhukhran, wa taqabbalha minni kama taqabbaltaha min abdiki Dawud.)\" (O Allah! Record for me, a reward with You for it, remove a sin for me by it, and store it away for me with You, and accept it from me as You accepted it from Your worshipper Dawud). Al-Hasan said: \"Ibn Juraij said to me: 'Your grandfather said to me: 'Ibn Abbas said: 'So the Prophet recited (an Ayah of) prostration then prostrated.'\" (He said) \"So Ibn Abbas said: 'I listened to him, and he was saying the same as the man informed that the tree had said.'\"",
      "chain": [
        "30367",
        "23059",
        "23011",
        "11258",
        "17"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا محمد بن يزيد بن خنيس، حدثنا الحسن بن محمد بن عبيد الله بن أبي يزيد، قال قال لي ابن جريج أخبرني عبيد الله بن أبي يزيد، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله رأيتني الليلة وأنا نائم كأني أصلي خلف شجرة فسجدت الشجرة لسجودي وسمعتها وهي تقول اللهم اكتب لي بها عندك أجرا وضع عني بها وزرا واجعلها لي عندك ذخرا وتقبلها مني كما تقبلتها من عبدك داود ‏.‏ قال ابن جريج قال لي جدك قال ابن عباس فقرأ النبي صلى الله عليه وسلم سجدة ثم سجد ‏.‏ قال ابن عباس فسمعته وهو يقول مثل ما أخبر الرجل عن قول الشجرة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وفي الباب عن أبي سعيد ‏.‏",
      "text_en": " Al-Hasan bin Muhammad bin Ubaidullah bin Abi Yazid said:                     “Ibn Juraij said to me: “Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: “A man came to the Prophet and said: ‘O Messenger of Allah! I had a dream at night while I was sleeping, in which I was praying behind a tree, when I prostrated, the tree prostrated along with me. Then I heard it saying: “O Allah! Record for me, a reward with You for it, remove a sin from me by it, and store it away for me with You for it, and accept it from me as You accepted it from Your worshipper Dawud (Allahumma Aktub Li Biha Indaka Ajran, Wada Anni Biha Wizran, Waj’alha Li Indaka Dhukhran, Wa Taqabbalta Min Abdiki Dawud).” Al-Hasan said: “Ibn Juraij said to me: ‘Your grandfather said to me: “Ibn Abbas said: ‘So the Prophet recited (an Ayah of) prostration them prostrated.’” [He said] “So Ibn Abbas said: ‘I listened to him, and he was saying the same as the man informed that the tree had said.’”",
      "chain": [
        "30367",
        "23059",
        "23011",
        "11070",
        "11258",
        "17"
      ]
    },
    {
      "hadith_no": "1106",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا محمد بن يزيد بن خنيس، عن الحسن بن محمد بن عبيد الله بن أبي يزيد، قال قال لي ابن جريج يا حسن أخبرني جدك، عبيد الله بن أبي يزيد عن ابن عباس، قال كنت عند النبي  صلى الله عليه وسلم  فأتاه رجل فقال إني رأيت البارحة فيما يرى النائم كأني أصلي إلى أصل شجرة فقرأت السجدة فسجدت فسجدت الشجرة لسجودي فسمعتها تقول اللهم احطط عني بها وزرا واكتب لي بها أجرا واجعلها لي عندك ذخرا ‏.‏ قال ابن عباس فرأيت النبي  صلى الله عليه وسلم  قرأ السجدة فسجد فسمعته يقول في سجوده مثل الذي أخبره الرجل عن قول الشجرة ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “I was with the Prophet (ﷺ),anda man came to him and said: ‘Last night while I was sleeping, Isawthat I was praying towards the base of a tree. I recited (an Ayahof)prostration and prostrated, and the tree prostrated when I did,and Iheard it saying: Allahummah-tut anni biha wizran, waktub li bihaajran, waj’al-ha li ‘indaka dhukhran (O Allah, reduce my burdenof sinthereby, reward me for it and store it for me with You).’Ibn ‘Abbassaid: “I saw the Prophet (ﷺ) recite (an Ayah of)prostration andthen prostrate, and I heard him saying in hisprostration somethinglike that which the man had told him the treesaid.”",
      "chain": [
        "30357",
        "23059",
        "23011",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}