{
  "id": "23034",
  "name": "'Abdul Jabbar bin al-Ward عبد الجبار بن الورد",
  "full_name": "'Abdul Jabbar bin al-Ward عبد الجبار بن الورد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ د  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "B.Makhzum",
      "Client",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "20527",
      "name": "Wuhayb bin al-Ward وهيب بن الورد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30146",
      "name": "'Abdul A'ala bin Hamad bin Nasr al-Bahli عبد الأعلى بن حماد بن نصر الباهلي النرسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30504",
      "name": "Da'ud bin 'Amr bin Zuhayr داود بن عمرو الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38256",
      "name": "Sulaiman bin Mnswr al-Blkhy سليمان بن منصور البلخي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1471",
      "hadith_no": "1471",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا عبد الجبار بن الورد، قال سمعت ابن أبي مليكة، يقول قال عبيد الله بن أبي يزيد مر بنا أبو لبابة فاتبعناه حتى دخل بيته فدخلنا عليه فإذا رجل رث البيت رث الهيئة فسمعته يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس منا من لم يتغن بالقرآن ‏\"‏ ‏.‏ قال فقلت لابن أبي مليكة يا أبا محمد أرأيت إذا لم يكن حسن الصوت قال يحسنه ما استطاع ‏.‏",
      "text_en": " Narrated AbuLubabah:                     Ubaydullah ibn Yazid said: AbuLubabah passed by us and we followed him till he entered his house, and we also entered it. There was a man in a rusty house and in shabby condition. I heard him say: I heard the Messenger of Allah (ﷺ) say: He is not one of us who does not chant the Qur'an. I (the narrator AbdulJabbar) said to Ibn AbuMulaykah: AbuMuhammad, what do you think if a person does not have pleasant voice? He said: He should recite with pleasant voice as much as possible.",
      "usc_msa_ref": "",
      "chain": [
        "30146",
        "23034",
        "11090"
      ]
    },
    {
      "id": "sunan-an-nasai-1858",
      "hadith_no": "1858",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سليمان بن منصور البلخي، قال حدثنا عبد الجبار بن الورد، سمعت ابن أبي مليكة، يقول لما هلكت أم أبان حضرت مع الناس فجلست بين عبد الله بن عمر وابن عباس فبكين النساء فقال ابن عمر ألا تنهى هؤلاء عن البكاء فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الميت ليعذب ببعض بكاء أهله عليه ‏\"‏ ‏.‏ فقال ابن عباس قد كان عمر يقول بعض ذلك خرجت مع عمر حتى إذا كنا بالبيداء رأى ركبا تحت شجرة فقال انظر من الركب فذهبت فإذا صهيب وأهله فرجعت إليه فقلت يا أمير المؤمنين هذا صهيب وأهله ‏.‏ فقال على بصهيب ‏.‏ فلما دخلنا المدينة أصيب عمر فجلس صهيب يبكي عنده يقول واأخياه واأخياه ‏.‏ فقال عمر يا صهيب لا تبك فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الميت ليعذب ببعض بكاء أهله عليه ‏\"‏ ‏.‏ قال فذكرت ذلك لعائشة فقالت أما والله ما تحدثون هذا الحديث عن كاذبين مكذبين ولكن السمع يخطئ وإن لكم في القرآن لما يشفيكم ‏{‏ ألا تزر وازرة وزر أخرى ‏}‏ ولكن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله ليزيد الكافر عذابا ببكاء أهله عليه ‏\"‏ ‏.‏",
      "text_en": " 'Abbul-Jabbar bin Al-Ward narrated:                     \"I heard Ibn Abi Mulaikah say: 'When Umm Aban died, I attended with the people. I sat in front of 'Abdullah bin 'Umar and Ibn 'Abbas, and the women wept. Ibn 'Umar said: 'Why don't you tell them not to weep? For I heard the Messenger of Allah say: The deceased is punished due to some of his family's weeping for him.\"' Ibn 'Abbas said: \"Umar used to narrate something like that. I went out with 'Umar and when we got to on uninhabited area, he saw a caravan beneath a tree. He said: 'See whose caravan this is.' I went and I found Suhaib and his family. I came back to him and said: 'O Commander of the Believers!  This is Suhaib and his family.' He said: 'Bring Suhaib to me.' When we entered Al-Madinah, 'Umar was attacked and Suhaib sat by him, weeping and saying, 'O my brother, O my brother.' 'Umar said: 'O Suhaib, do not weep, for I heard the Messenger of Allah say: The deceased is punished due to some of the weeping of his family for him. He said: I mentioned that to 'Aishah and she said: 'By Allah you are not narrating this Hadith from two liars who have disbelieved, but sometimes you mishear. And no bearer of burdens shall bear another's burden. And the Messenger of Allah said: 'Allah increases the punishment of the disbeliever because of his family's weeping for him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38256",
        "23034",
        "11090"
      ]
    }
  ],
  "total_hadiths": 2
}