{
  "id": "2308",
  "name": "'Abdullah bin Wahb bin Zam'a ( عبد الله بن وهب بن زمعة ( رضي الله عنه",
  "full_name": "'Abdullah bin Wahb bin Zam'a ( عبد الله بن وهب بن زمعة ( رضي الله عنه",
  "grade": "Comp.(RA) [3rd Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "2306",
      "name": "Wahb bin Zam'a bin al-Aswad ( وهب بن زمعة بن الأسود بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "11116",
      "name": "Karima bint al-Miqdad ibn al-Aswad كريمة بنت المقداد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "siblings": [
    {
      "id": "2307",
      "name": "'Abdullah bin Wahb bin Zam'a ( عبد الله الأكبر بن وهب بن زمعة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "22709",
      "name": "Yazid bin 'Abdullah bin Wahub يزيد بن عبد الله بن وهب",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "22717",
      "name": "Y'aqub bin 'Abdullah bin Wahub يعقوب بن عبد الله بن وهب",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "19512",
      "name": "Qrybh bint 'Abdullah bin Wahb قريبة بنت عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11116",
      "name": "Karima bint al-Miqdad ibn al-Aswad كريمة بنت المقداد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11227",
      "name": "Hashim bin Hashim bin 'Utba هاشم بن هاشم بن عتبة بن أبي وقاص",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19512",
      "name": "Qrybh bint 'Abdullah bin Wahb قريبة بنت عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20706",
      "name": "Musa bin Y'aqub bin 'Abdullah bin Wahb موسى بن يعقوب بن عبد الله بن وهب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4267",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن خالد ابن عثمة، حدثني موسى بن يعقوب الزمعي، عن هاشم بن هاشم، أن عبد الله بن وهب بن زمعة، أخبره أن أم سلمة أخبرته أن رسول الله صلى الله عليه وسلم دعا فاطمة عام الفتح فناجاها فبكت ثم حدثها فضحكت قالت فلما توفي رسول الله صلى الله عليه وسلم سألتها عن بكائها وضحكها ‏.‏ قالت أخبرني رسول الله صلى الله عليه وسلم أنه يموت فبكيت ثم أخبرني أني سيدة نساء أهل الجنة إلا مريم بنت عمران فضحكت ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm Salamah:                     that the Messenger of Allah (ﷺ) called for Fatimah in the Year of the Conquest to him to speak to her, and she cried. Then he spoke to her and she laughed. She said: \"When the Messenger of Allah (ﷺ) died I asked her about her crying and her laughing. She said: 'The Messenger of Allah (SAW0 informed me that he would (soon) die, so I cried. Then, he informed me that I was the master over all of the women among the inhabitants of Paradise, except for Mariam bint 'Imran, so I laughed.'\"",
      "chain": [
        "30160",
        "30581",
        "20706",
        "11227",
        "2308",
        "56"
      ]
    },
    {
      "hadith_no": "3719",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا وكيع، عن زمعة بن صالح، عن الزهري، عن وهب بن عبد بن زمعة، عن أم سلمة، ح وحدثنا علي بن محمد، حدثنا وكيع، حدثنا زمعة بن صالح، عن الزهري، عن عبد الله بن وهب بن زمعة، عن أم سلمة، قالت خرج أبو بكر في تجارة إلى بصرى قبل موت النبي  صلى الله عليه وسلم  بعام ومعه نعيمان وسويبط بن حرملة وكانا شهدا بدرا وكان نعيمان على الزاد وكان سويبط رجلا مزاحا فقال لنعيمان أطعمني ‏.‏ قال حتى يجيء أبو بكر ‏.‏ قال فلأغيظنك ‏.‏ قال فمروا بقوم فقال لهم سويبط تشترون مني عبدا لي قالوا نعم ‏.‏ قال إنه عبد له كلام وهو قائل لكم إني حر ‏.‏ فإن كنتم إذا قال لكم هذه المقالة تركتموه فلا تفسدوا على عبدي ‏.‏ قالوا لا بل نشتريه منك ‏.‏ فاشتروه منه بعشر قلائص ثم أتوه فوضعوا في عنقه عمامة أو حبلا ‏.‏ فقال نعيمان إن هذا يستهزئ بكم وإني حر لست بعبد ‏.‏ فقالوا قد أخبرنا خبرك ‏.‏ فانطلقوا به فجاء أبو بكر فأخبروه بذلك ‏.‏ قال فاتبع القوم ورد عليهم القلائص وأخذ نعيمان ‏.‏ قال فلما قدموا على النبي  صلى الله عليه وسلم  وأخبروه ‏.‏ قال فضحك النبي  صلى الله عليه وسلم  وأصحابه منه حولا ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"Abu Bakr went our to trade in Busra, one year before the Prophet(ﷺ) died, and with him were Nu'aiman and Suwaibit the sons of Harmalah, who had been present at Badr. Nu'iaman was in charge of the provisions, and Suwaibit was a man who joked a lot. He said to Nu'iman: 'Feed me'. He said: 'Not until Abu Bakr comes'. He said: 'Then I will have to annoy you'. Then they passed by some people, and Suwaibit said to them: 'Will you buy a slave from me?' They said: 'Yes'. He said ' He is a slave who talks a lot and he will tell you, \"I am a free man\". If you are going to let him go when says that to you, do not bother buying him.' They said: 'We will buy him from you.' So they bought him from him in return for ten young she-camels, then they brought him and tied a turban or a rope around his neck. Nu'aiman said: 'This man is making fun of you. I am a free man, not a slave.' They said: 'He has already told us about you; and they took him off.' THen Abu Bakr came and he (Suwaibit) told him about that. So he followed those people and returned their camels to them, and took Nu'iaman back. Whent hey came to the Prophet(ﷺ) they told him what had happened, and the Prophet(ﷺ) and his companions laughed about it for a year.\"",
      "chain": [
        "20436",
        "20032",
        "10636",
        "11013",
        "56",
        "38409",
        "20032",
        "10636",
        "11013",
        "2308",
        "56"
      ]
    }
  ],
  "total_hadiths": 2
}