{
  "id": "237",
  "name": "Salma ibn al-Akwa ( سلمة بن الأكوع ( رضي الله عنه",
  "full_name": "Salma ibn al-Akwa ( سلمة بن الأكوع ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "B.Khuza'a",
      "al-Aslami",
      "Mu'ta",
      "Ridwan",
      "Hijazi",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "329",
      "name": "'Amir ibn al-Akwa' ( عامر بن الأكوع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11152",
      "name": "Iyas bin Salmah bin al-Akwa إياس بن سلمة بن الأكوع",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11152",
      "name": "Iyas bin Salmah bin al-Akwa إياس بن سلمة بن الأكوع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11450",
      "name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11519",
      "name": "'Abdur Rahman bin 'Abdullah bin Ka'b عبد الرحمن بن عبد الله بن كعب بن مالك",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11156",
      "name": "al-Hasan bin Muhammad bin 'Ali الحسن بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-109",
      "hadith_no": "109",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مكي بن إبراهيم، قال حدثنا يزيد بن أبي عبيد، عن سلمة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من يقل على ما لم أقل فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     I heard the Prophet saying, \"Whoever (intentionally) ascribes to me what I have not said then (surely) let him occupy his seat in Hell-fire.\"",
      "usc_msa_ref": "109",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-497",
      "hadith_no": "497",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا المكي، قال حدثنا يزيد بن أبي عبيد، عن سلمة، قال كان جدار المسجد عند المنبر ما كادت الشاة تجوزها‏.‏",
      "text_en": " Narrated Salama:                     The distance between the wall of the mosque and the pulpit was hardly enough for a sheep to pass through.",
      "usc_msa_ref": "476",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-502",
      "hadith_no": "502",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا يزيد بن أبي عبيد، قال كنت آتي مع سلمة بن الأكوع فيصلي عند الأسطوانة التي عند المصحف‏.‏ فقلت يا أبا مسلم أراك تتحرى الصلاة عند هذه الأسطوانة‏.‏ قال فإني رأيت النبي صلى الله عليه وسلم يتحرى الصلاة عندها‏.‏",
      "text_en": " Narrated Yazid bin Al `Ubaid:                     I used to accompany Salama bin Al-Akwa` and he used to pray behind the pillar which was near the place where the Qur'ans were kept. I said, \"O Abu Muslim! I see you always seeking to pray behind this pillar.\" He replied, \"I saw Allah's Apostle always seeking to pray near that pillar.\"",
      "usc_msa_ref": "481",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-561",
      "hadith_no": "561",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا يزيد بن أبي عبيد، عن سلمة، قال كنا نصلي مع النبي صلى الله عليه وسلم المغرب إذا توارت بالحجاب‏.‏",
      "text_en": " Narrated Salama:                     We used to pray the Maghrib prayer with the Prophet when the sun disappeared from the horizon.",
      "usc_msa_ref": "536",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-1924",
      "hadith_no": "1924",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم بعث رجلا ينادي في الناس، يوم عاشوراء ‏\"‏ أن من أكل فليتم أو فليصم، ومن لم يأكل فلا يأكل ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Once the Prophet ordered a person on 'Ashura' (the tenth of Muharram) to announce, \"Whoever has eaten, should not eat any more, but fast, and who has not eaten should not eat, but complete his fast (till the end of the day).",
      "usc_msa_ref": "147",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2007",
      "hadith_no": "2007",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد، عن سلمة بن الأكوع  رضى الله عنه  قال أمر النبي صلى الله عليه وسلم رجلا من أسلم أن أذن في الناس ‏\"‏ أن من كان أكل فليصم بقية يومه، ومن لم يكن أكل فليصم، فإن اليوم يوم عاشوراء ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     The Prophet ordered a man from the tribe of Bani Aslam to announce amongst the people that whoever had eaten should fast the rest of the day, and whoever had not eaten should continue his fast, as that day was the day of 'Ashura' .",
      "usc_msa_ref": "225",
      "chain": [
        "20202",
        "20472",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2289",
      "hadith_no": "2289",
      "source": "Sahih Bukhari",
      "chapter": "Transferance of a Debt from One Person to Another (Al-Hawaala) - كتاب الحوالات",
      "chapter_no": "38",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال كنا جلوسا عند النبي صلى الله عليه وسلم إذ أتي بجنازة، فقالوا صل عليها‏.‏ فقال ‏\"‏ هل عليه دين ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ فهل ترك شيئا ‏\"‏‏.‏ قالوا لا‏.‏ فصلى عليه ثم أتي بجنازة أخرى، فقالوا يا رسول الله، صل عليها‏.‏ قال ‏\"‏ هل عليه دين ‏\"‏‏.‏ قيل نعم‏.‏ قال ‏\"‏ فهل ترك شيئا ‏\"‏‏.‏ قالوا ثلاثة دنانير‏.‏ فصلى عليها، ثم أتي بالثالثة، فقالوا صل عليها‏.‏ قال ‏\"‏ هل ترك شيئا ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ فهل عليه دين ‏\"‏‏.‏ قالوا ثلاثة دنانير‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏‏.‏ قال أبو قتادة صل عليه يا رسول الله، وعلى دينه‏.‏ فصلى عليه‏.‏",
      "text_en": "      Narrated Salama bin Al-Akwa:                          Once, while we were sitting in the company of Prophet, a dead man was      brought. The Prophet was requested to lead the funeral prayer for the      deceased. He said, \"Is he in debt?\" The people replied in the      negative. He said, \"Has he left any wealth?\" They said, \"No.\" So, he      led his funeral prayer. Another dead man was brought and the people      said, \"O Allah's Apostle! Lead his funeral prayer.\" The Prophet said,      \"Is he in debt?\" They said, \"Yes.\" He said, \"Has he left any wealth?\"      They said, ''Three Dinars.\" So, he led the prayer. Then a third dead      man was brought and the people said (to the Prophet ), Please lead his     funeral prayer.\" He said, \"Has he left any wealth?\" They said, \"No.\"      He asked, \"Is he in debt?\" They said, (\"Yes! He has to pay) three      Diners.', He (refused to pray and) said, \"Then pray for your (dead)      companion.\" Abu Qatada said, \"O Allah's Apostle! Lead his funeral      prayer, and I will pay his debt.\" So, he led the prayer.",
      "usc_msa_ref": "488",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2295",
      "hadith_no": "2295",
      "source": "Sahih Bukhari",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم أتي بجنازة، ليصلي عليها، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا لا‏.‏ فصلى عليه، ثم أتي بجنازة أخرى، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏‏.‏ قال أبو قتادة على دينه يا رسول الله‏.‏ فصلى عليه‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     A dead person was brought to the Prophet so that he might lead the funeral prayer for him. He asked, \"Is he in debt?\" When the people replied in the negative, he led the funeral prayer. Another dead person was brought and he asked, \"Is he in debt?\" They said, \"Yes.\" He (refused to lead the prayer and) said, \"Lead the prayer of your friend.\" Abu Qatada said, \"O Allah's Apostle! I undertake to pay his debt.\" Allah's Apostle then led his funeral prayer.",
      "usc_msa_ref": "492",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2305",
      "hadith_no": "2305",
      "source": "Sahih Bukhari",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سلمة، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال كان لرجل على النبي صلى الله عليه وسلم سن من الإبل فجاءه يتقاضاه فقال ‏\"‏ أعطوه ‏\"‏‏.‏ فطلبوا سنه فلم يجدوا له إلا سنا فوقها‏.‏ فقال ‏\"‏ أعطوه ‏\"‏‏.‏ فقال أوفيتني أوفى الله بك‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ إن خياركم أحسنكم قضاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet owed somebody a camel of a certain age. When he came to demand it back, the Prophet said (to some people), \"Give him (his due).\" When the people searched for a camel of that age, they found none, but found a camel one year older. The Prophet said, \"Give (it to) him.\" On that, the man remarked, \"You have given me my right in full. May Allah give you in full.\" The Prophet said, \"The best amongst you is the one who pays the rights of others generously.\"",
      "usc_msa_ref": "501",
      "chain": [
        "20348",
        "20012",
        "237",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2393",
      "hadith_no": "2393",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سلمة، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال كان لرجل على النبي صلى الله عليه وسلم سن من الإبل فجاءه يتقاضاه فقال صلى الله عليه وسلم ‏\"‏ أعطوه ‏\"‏‏.‏ فطلبوا سنه، فلم يجدوا له إلا سنا فوقها‏.‏ فقال ‏\"‏ أعطوه ‏\"‏‏.‏ فقال أوفيتني، وفى الله بك‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ إن خياركم أحسنكم قضاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet owed a camel of a certain age to a man who came to demand it back. The Prophet ordered his companions to give him. They looked for a camel of the same age but found nothing but a camel one year older. The Prophet told them to give it to him. The man said, \"You have paid me in full, and may Allah pay you in full.\" The Prophet said, \"The best amongst you is he who pays his debts in the most handsome manner.\"",
      "usc_msa_ref": "578",
      "chain": [
        "20348",
        "20012",
        "237",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2401",
      "hadith_no": "2401",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن سلمة، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أتى النبي صلى الله عليه وسلم رجل يتقاضاه فأغلظ له فهم به أصحابه‏.‏ فقال ‏\"‏ دعوه فإن لصاحب الحق مقالا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet and demanded his debts and used harsh words. The companions of the Prophet wanted to harm him, but the Prophet said, \"Leave him, as the creditor (owner of the right) has the right to speak.\"",
      "usc_msa_ref": "586",
      "chain": [
        "30175",
        "20031",
        "20020",
        "237",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2426",
      "hadith_no": "2426",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا آدم، حدثنا شعبة،‏.‏ وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سلمة، سمعت سويد بن غفلة، قال لقيت أبى بن كعب  رضى الله عنه  فقال أخذت صرة مائة دينار فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ عرفها حولا‏\"‏‏.‏ فعرفتها حولها فلم أجد من يعرفها، ثم أتيته فقال ‏\"‏ عرفها حولا ‏\"‏ فعرفتها فلم أجد، ثم أتيته ثلاثا فقال ‏\"‏ احفظ وعاءها وعددها ووكاءها، فإن جاء صاحبها، وإلا فاستمتع بها ‏\"‏‏.‏ فاستمتعت فلقيته بعد بمكة فقال لا أدري ثلاثة أحوال أو حولا واحدا‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     I found a purse containing one hundred Diners. So I went to the Prophet (and informed him about it), he said, \"Make public announcement about it for one year\" I did so, but nobody turned up to claim it, so I again went to the Prophet who said, \"Make public announcement for another year.\" I did, but none turned up to claim it. I went to him for the third time and he said, \"Keep the container and the string which is used for its tying and count the money it contains and if its owner comes, give it to him; otherwise, utilize it.\" The sub-narrator Salama said, \"I met him (Suwaid, another sub-narrator) in Mecca and he said, 'I don't know whether Ubai made the announcement for three years or just one year.' \"",
      "usc_msa_ref": "608",
      "chain": [
        "20404",
        "30160",
        "20278",
        "20020",
        "237",
        "11174"
      ]
    },
    {
      "id": "sahih-bukhari-2477",
      "hadith_no": "2477",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى نيرانا توقد يوم خيبر‏.‏ قال ‏\"‏ على ما توقد هذه النيران ‏\"‏‏.‏ قالوا على الحمر الإنسية‏.‏ قال ‏\"‏ اكسروها، وأهرقوها ‏\"‏‏.‏ قالوا ألا نهريقها ونغسلها قال ‏\"‏ اغسلوا ‏\"‏‏.‏ قال أبو عبد الله كان ابن أبي أويس يقول الحمر الأنسية بنصب الألف والنون",
      "text_en": " Narrated Salama bin Al-Akwa`:                     On the day of Khaibar the Prophet saw fires being lighted. He asked, \"Why are these fires being lighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and throw away their contents.\" The people said, \"Shall we throw away their contents and wash the pots (rather than break them)?\" He said, \"Wash them.\"",
      "usc_msa_ref": "657",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2484",
      "hadith_no": "2484",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا بشر بن مرحوم، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة  رضى الله عنه  قال خفت أزواد القوم وأملقوا، فأتوا النبي صلى الله عليه وسلم في نحر إبلهم فأذن لهم، فلقيهم عمر فأخبروه فقال ما بقاؤكم بعد إبلكم، فدخل على النبي صلى الله عليه وسلم فقال يا رسول الله ما بقاؤهم بعد إبلهم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ناد في الناس فيأتون بفضل أزوادهم ‏\"‏‏.‏ فبسط لذلك نطع، وجعلوه على النطع‏.‏ فقام رسول الله صلى الله عليه وسلم فدعا وبرك عليه ثم دعاهم بأوعيتهم فاحتثى الناس حتى فرغوا، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أشهد أن لا إله إلا الله وأني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Once the journey food diminished and the people were reduced to poverty. They went to the Prophet and asked his permission to slaughter their camels, and he agreed. `Umar met them and they told him about it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the Prophet and said, \"O Allah's Apostle! How would they survive after slaughtering their camels?\" Allah's Apostle ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A leather sheet was spread and al I the journey food was collected and heaped over it. Allah's Apostle stood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and they started taking from it till all of them got what was sufficient for them. Allah's Apostle then said, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle. \"",
      "usc_msa_ref": "664",
      "chain": [
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2606",
      "hadith_no": "2606",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن عثمان بن جبلة، قال أخبرني أبي، عن شعبة، عن سلمة، قال سمعت أبا سلمة، عن أبي هريرة  رضى الله عنه  قال كان لرجل على رسول الله صلى الله عليه وسلم دين فهم به أصحابه، فقال ‏\"‏ دعوه فإن لصاحب الحق مقالا‏.‏ وقال اشتروا له سنا فأعطوها إياه ‏\"‏‏.‏ فقالوا إنا لا نجد سنا إلا سنا هي أفضل من سنه‏.‏ قال ‏\"‏ فاشتروها فأعطوها إياه، فإن من خيركم أحسنكم قضاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle owed a man some debt (and that man demanded it very harshly). The companions of the Prophet wanted to harm him, but the Prophet said to them, \"Leave him, as the creditor has the right to speak harshly.\" He then added, \"Buy (a camel) of the same age and give it to him.\" They said, \"We cannot get except a camel of an older age than that of his.\" He said, \"Buy it and give it to him, as the best amongst you is he who pays back his debt in the most handsome way.'",
      "usc_msa_ref": "777",
      "chain": [
        "20020",
        "237",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2899",
      "hadith_no": "2899",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع  رضى الله عنه  قال مر النبي صلى الله عليه وسلم على نفر من أسلم ينتضلون فقال النبي صلى الله عليه وسلم ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا ارموا وأنا مع بني فلان ‏\"‏‏.‏ قال فأمسك أحد الفريقين بأيديهم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لكم لا ترمون ‏\"‏‏.‏ قالوا كيف نرمي وأنت معهم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ارموا فأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     The Prophet passed by some people of the tribe of Bani Aslam who were practicing archery. The Prophet said, \"O Bani Isma`il ! Practice archery as your father Isma`il was a great archer. Keep on throwing arrows and I am with Bani so-and-so.\" So one of the parties ceased throwing. Allah's Apostle said, \"Why do you not throw?\" They replied, \"How should we throw while you are with them (i.e. on their side)?\" On that the Prophet said, \"Throw, and I am with all of you.\"",
      "usc_msa_ref": "148",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2960",
      "hadith_no": "2960",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، عن سلمة  رضى الله عنه  قال بايعت النبي صلى الله عليه وسلم ثم عدلت إلى ظل الشجرة، فلما خف الناس قال ‏\"‏ يا ابن الأكوع، ألا تبايع ‏\"‏‏.‏ قال قلت قد بايعت يا رسول الله‏.‏ قال ‏\"‏ وأيضا ‏\"‏‏.‏ فبايعته الثانية،‏.‏ فقلت له يا أبا مسلم، على أى شىء كنتم تبايعون يومئذ قال على الموت‏.‏",
      "text_en": " Narrated Yazid bin Ubaid:                     Salama said, \"I gave the Pledge of allegiance (Al-Ridwan) to Allah's Apostle and then I moved to the shade of a tree. When the number of people around the Prophet diminished, he said, 'O Ibn Al-Akwa` ! Will you not give to me the pledge of Allegiance?' I replied, 'O Allah's Apostle! I have already given to you the pledge of Allegiance.' He said, 'Do it again.' So I gave the pledge of allegiance for the second time.\" I asked 'O Abu Muslim! For what did you give he pledge of Allegiance on that day?\" He replied, \"We gave the pledge of Allegiance for death.\"",
      "usc_msa_ref": "207",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2975",
      "hadith_no": "2975",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال كان علي  رضى الله عنه  تخلف عن النبي صلى الله عليه وسلم في خيبر، وكان به رمد، فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم فخرج علي فلحق بالنبي صلى الله عليه وسلم، فلما كان مساء الليلة التي فتحها في صباحها، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية  أو قال ليأخذن  غدا رجل يحبه الله ورسوله  أو قال يحب الله ورسوله  يفتح الله عليه ‏\"‏‏.‏ فإذا نحن بعلي، وما نرجوه، فقالوا هذا علي، فأعطاه رسول الله صلى الله عليه وسلم، ففتح الله عليه‏.‏",
      "text_en": "      Narrated Salama bin Al-Akwa:                          Ali remained behind the Prophet during the battle of Khaibar as he way     suffering from some eye trouble but then he said, \"How should I stay      behind Allah's Apostle?\" So, he set out till he joined the Prophet. On     the eve of the day of the conquest of Khaibar, Allah's Apostle said,      \"(No doubt) I will give the flag or, tomorrow, a man whom Allah and      His Apostle love or who loves Allah and His apostle will take the      flag. Allah will bestow victory upon him.\" Suddenly 'Ali joined us      though we were not expecting him. The people said, \"Here is 'Ali. \"So,     Allah's Apostle gave the flag to him and Allah bestowed victory upon      him.",
      "usc_msa_ref": "219",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2982",
      "hadith_no": "2982",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا بشر بن مرحوم، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة  رضى الله عنه قال خفت أزواد الناس وأملقوا، فأتوا النبي صلى الله عليه وسلم في نحر إبلهم، فأذن لهم، فلقيهم عمر فأخبروه فقال ما بقاؤكم بعد إبلكم فدخل عمر على النبي صلى الله عليه وسلم فقال يا رسول الله ما بقاؤهم بعد إبلهم قال رسول الله صلى الله عليه وسلم ‏\"‏ ناد في الناس يأتون بفضل أزوادهم ‏\"‏‏.‏ فدعا وبرك عليه، ثم دعاهم بأوعيتهم، فاحتثى الناس حتى فرغوا، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أشهد أن لا إله إلا الله، وأني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Once the journey-food of the people ran short and they were in great need. So, they came to the Prophet to take his permission for slaughtering their camels, and he permitted them. Then `Umar met them and they informed him about it. He said, \"What will sustain you after your camels (are finished)?\" Then `Umar went to the Prophet and said, \"O Allah's Apostle! What will sustain them after their camels (are finished)?\" Allah's Apostle said, \"Make an announcement amongst the people that they should bring all their remaining food (to me).\" (They brought it and) the Prophet invoked Allah and asked for His Blessings for it. Then he asked them to bring their food utensils and the people started filling their food utensils with their hands till they were satisfied. Allah's Apostle then said, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle. \"",
      "usc_msa_ref": "225",
      "chain": [
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3041",
      "hadith_no": "3041",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا المكي بن إبراهيم، أخبرنا يزيد بن أبي عبيد، عن سلمة، أنه أخبره قال خرجت من المدينة ذاهبا نحو الغابة، حتى إذا كنت بثنية الغابة لقيني غلام لعبد الرحمن بن عوف قلت ويحك، ما بك قال أخذت لقاح النبي صلى الله عليه وسلم‏.‏ قلت من أخذها قال غطفان وفزارة‏.‏ فصرخت ثلاث صرخات أسمعت ما بين لابتيها يا صباحاه، يا صباحاه‏.‏ ثم اندفعت حتى ألقاهم وقد أخذوها، فجعلت أرميهم وأقول أنا ابن الأكوع، واليوم يوم الرضع، فاستنقذتها منهم قبل أن يشربوا، فأقبلت بها أسوقها، فلقيني النبي صلى الله عليه وسلم فقلت يا رسول الله، إن القوم عطاش، وإني أعجلتهم أن يشربوا سقيهم، فابعث في إثرهم، فقال ‏\"‏ يا ابن الأكوع، ملكت فأسجح‏.‏ إن القوم يقرون في قومهم ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     I went out of Medina towards Al-Ghaba. When I reached the mountain path of Al-Ghaba, a slave of `Abdur-Rahman bin `Auf met me. I said to him, \"Woe to you! What brought you here?\" He replied, \"The she-camels of the Prophet have been taken away.\" I said, \"Who took them?\" He said, \"Ghatafan and Fazara.\" So, I sent three cries, \"O Sabaha-h ! O Sabahah !\" so loudly that made the people in between its (i.e. Medina's) two mountains hear me. Then I rushed till I met them after they had taken the camels away. I started throwing arrows at them saying, \"I am the son of Al-Akwa`\"; and today perish the mean people!\" So, I saved the she-camels from them before they (i.e. the robbers) could drink water. When I returned driving the camels, the Prophet met me, I said, \"O Allah's Apostle Those people are thirsty and I have prevented them from drinking water, so send some people to chase them.\" The Prophet said, \"O son of Al-Akwa`, you have gained power (over your enemy), so forgive (them). (Besides) those people are now being entertained by their folk.\"",
      "usc_msa_ref": "278",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3051",
      "hadith_no": "3051",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو نعيم، حدثنا أبو العميس، عن إياس بن سلمة بن الأكوع، عن أبيه، قال أتى النبي صلى الله عليه وسلم عين من المشركين وهو في سفر، فجلس عند أصحابه يتحدث ثم انفتل، فقال النبي صلى الله عليه وسلم ‏\"‏ اطلبوه واقتلوه ‏\"‏‏.‏ فقتله فنفله سلبه‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     \"An infidel spy came to the Prophet while he was on a journey. The spy sat with the companions of the Prophet and started talking and then went away. The Prophet said (to his companions), 'Chase and kill him.' So, I killed him.\" The Prophet then gave him the belongings of the killed spy (in addition to his share of the war booty).",
      "usc_msa_ref": "286",
      "chain": [
        "20348",
        "20342",
        "11152",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3373",
      "hadith_no": "3373",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال مر النبي صلى الله عليه وسلم على نفر من أسلم ينتضلون، فقال رسول الله صلى الله عليه وسلم ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا، وأنا مع بني فلان ‏\"‏‏.‏ قال فأمسك أحد الفريقين بأيديهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لكم لا ترمون ‏\"‏‏.‏ فقالوا يا رسول الله، نرمي وأنت معهم قال ‏\"‏ ارموا وأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     The Prophet passed by some persons of the tribe of Aslam practicing archery (i.e. the throwing of arrows) Allah's Apostle said, \"O offspring of Ishmael! Practice archery (i.e. arrow throwing) as your father was a great archer (i.e. arrow-thrower). I am with (on the side of) the son of so-and-so-.\" Hearing that, one of the two teams stopped throwing. Allah's Apostle asked them, ' Why are you not throwing?\" They replied, \"O Allah's Apostle! How shall we throw when you are with the opposite team?\" He said, \"Throw, for I am with you all.\"",
      "usc_msa_ref": "592",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3547",
      "hadith_no": "3547",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن يزيد بن أبي عبيد، حدثنا سلمة  رضى الله عنه  قال خرج رسول الله صلى الله عليه وسلم على قوم من أسلم، يتناضلون بالسوق، فقال ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا، وأنا مع بني فلان ‏\"‏‏.‏ لأحد الفريقين، فأمسكوا بأيديهم فقال ‏\"‏ ما لهم ‏\"‏‏.‏ قالوا وكيف نرمي وأنت مع بني فلان‏.‏ قال ‏\"‏ ارموا وأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Allah's Apostle passed by some people from the tribe of Aslam practicing archery. He said, \"O children of Ishmael! Throw (arrows), for your father was an archer. I am on the side of Bani so-andso,\" meaning one of the two teams. The other team stopped throwing, whereupon the Prophet said, \"What has happened to them?\" They replied, \"How shall we throw while you are with Bani so-andso?\" He said, \"Throw for I am with all of you.\"",
      "usc_msa_ref": "710",
      "chain": [
        "30175",
        "20031",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3749",
      "hadith_no": "3749",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة، قال كان علي قد تخلف عن النبي صلى الله عليه وسلم في خيبر وكان به رمد فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم فخرج علي فلحق بالنبي صلى الله عليه وسلم، فلما كان مساء الليلة التي فتحها الله في صباحها، قال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية  أو ليأخذن الراية  غدا رجلا يحبه الله ورسوله  أو قال يحب الله ورسوله  يفتح الله عليه ‏\"‏‏.‏ فإذا نحن بعلي وما نرجوه، فقالوا هذا علي‏.‏ فأعطاه رسول الله صلى الله عليه وسلم ففتح الله عليه‏.‏",
      "text_en": " Narrated Salama:                     `Ali happened to stay behind the Prophet and (did not join him) during the battle of Khaibar for he was having eye trouble. Then he said, \"How could I remain behind Allah's Apostle?\" So `Ali set out following the Prophet , When it was the eve of the day in the morning of which Allah helped (the Muslims) to conquer it, Allah's Apostle said, \"I will give the flag (to a man), or tomorrow a man whom Allah and His Apostle love will take the flag,\" or said, \"A man who loves Allah and His Apostle; and Allah will grant victory under his leadership.\" Suddenly came `Ali whom we did not expect. The people said, \"This is `Ali.\" Allah's Apostle gave him the flag and Allah granted victory under his leadership.",
      "usc_msa_ref": "52",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4219",
      "hadith_no": "4219",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن يعلى المحاربي، قال حدثني أبي، حدثنا إياس بن سلمة بن الأكوع، قال حدثني  أبي وكان، من أصحاب الشجرة  قال كنا نصلي مع النبي صلى الله عليه وسلم الجمعة ثم ننصرف، وليس للحيطان ظل نستظل فيه‏.‏",
      "text_en": " Narrated Iyas bin Salama bin Al-Akwa`:                     My father who was amongst those who had given the Pledge of allegiance to the Prophet beneath the Tree, said to me, \"We used to offer the Jumua prayer with the Prophet and then depart at a time when the walls had no shade for us to take shelter in.\"",
      "usc_msa_ref": "486",
      "chain": [
        "20369",
        "20371",
        "11152",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4243",
      "hadith_no": "4243",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع، يقول خرجت قبل أن يؤذن، بالأولى، وكانت لقاح رسول الله صلى الله عليه وسلم ترعى بذي قرد  قال  فلقيني غلام لعبد الرحمن بن عوف فقال أخذت لقاح رسول الله صلى الله عليه وسلم قلت من أخذها قال غطفان‏.‏ قال فصرخت ثلاث صرخات  يا صباحاه  قال فأسمعت ما بين لابتى المدينة، ثم اندفعت على وجهي حتى أدركتهم وقد أخذوا يستقون من الماء، فجعلت أرميهم بنبلي، وكنت راميا، وأقول أنا ابن الأكوع، اليوم يوم الرضع‏.‏ وأرتجز حتى استنقذت اللقاح منهم، واستلبت منهم ثلاثين بردة، قال وجاء النبي صلى الله عليه وسلم والناس فقلت يا نبي الله قد حميت القوم الماء وهم عطاش، فابعث إليهم الساعة‏.‏ فقال ‏\"‏ يا ابن الأكوع، ملكت فأسجح ‏\"‏‏.‏ قال ثم رجعنا ويردفني رسول الله صلى الله عليه وسلم على ناقته حتى دخلنا المدينة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Once I went (from Medina) towards (Al-Ghaba) before the first Adhan of the Fajr Prayer. The shecamels of Allah's Apostle used to graze at a place called Dhi-Qarad. A slave of `Abdur-Rahman bin `Auf met me (on the way) and said, \"The she-camels of Allah's Apostle had been taken away by force.\" I asked, \"Who had taken them?\" He replied \"(The people of) Ghatafan.\" I made three loud cries (to the people of Medina) saying, \"O Sabahah!\" I made the people between the two mountains of Medina hear me. Then I rushed onward and caught up with the robbers while they were watering the camels. I started throwing arrows at them as I was a good archer and I was saying, \"I am the son of Al-Akwa`, and today will perish the wicked people.\" I kept on saying like that till I restored the shecamels (of the Prophet), I also snatched thirty Burda (i.e. garments) from them. Then the Prophet and the other people came there, and I said, \"O Allah's Prophet! I have stopped the people (of Ghatafan) from taking water and they are thirsty now. So send (some people) after them now.\" On that the Prophet said, \"O the son of Al-Akwa`! You have over-powered them, so forgive them.\" Then we all came back and Allah's Apostle seated me behind him on his she-camel till we entered Medina.",
      "usc_msa_ref": "507",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4245",
      "hadith_no": "4245",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر فسرنا ليلا، فقال رجل من القوم لعامر يا عامر ألا تسمعنا من هنيهاتك‏.‏ وكان عامر رجلا شاعرا فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما أبقينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أبينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏‏.‏ قال رجل من القوم وجبت يا نبي الله، لولا أمتعتنا به‏.‏ فأتينا خيبر، فحاصرناهم حتى أصابتنا مخمصة شديدة، ثم إن الله تعالى فتحها عليهم، فلما أمسى الناس مساء اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة، فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏‏.‏ قالوا على لحم‏.‏ قال ‏\"‏ على أى لحم ‏\"‏‏.‏ قالوا لحم حمر الإنسية‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏‏.‏ فقال رجل يا رسول الله، أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏ فلما تصاف القوم كان سيف عامر قصيرا فتناول به ساق يهودي ليضربه، ويرجع ذباب سيفه، فأصاب عين ركبة عامر، فمات منه قال فلما قفلوا، قال سلمة رآني رسول الله صلى الله عليه وسلم وهو آخذ بيدي، قال ‏\"‏ ما لك ‏\"‏‏.‏ قلت له فداك أبي وأمي، زعموا أن عامرا حبط عمله‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ كذب من قاله، إن له لأجرين  وجمع بين إصبعيه  إنه لجاهد مجاهد قل عربي مشى بها مثله ‏\"‏‏.‏ حدثنا قتيبة حدثنا حاتم قال ‏\"‏ نشأ بها ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     We went out to Khaibar in the company of the Prophet. While we were proceeding at night, a man from the group said to 'Amir, \"O 'Amir! Won't you let us hear your poetry?\" 'Amir was a poet, so he got down and started reciting for the people poetry that kept pace with the camels' footsteps, saying:-- \"O Allah! Without You we Would not have been guided On the right path Neither would be have given In charity, nor would We have prayed. So please forgive us, what we have committed (i.e. our defects); let all of us Be sacrificed for Your Cause And send Sakina (i.e. calmness) Upon us to make our feet firm When we meet our enemy, and If they will call us towards An unjust thing, We will refuse. The infidels have made a hue and Cry to ask others' help Against us.\" The Prophet on that, asked, \"Who is that (camel) driver (reciting poetry)?\" The people said, \"He is 'Amir bin Al-Akwa`.\" Then the Prophet said, \"May Allah bestow His Mercy on him.\" A man amongst the people said, \"O Allah's Prophet! has (martyrdom) been granted to him. Would that you let us enjoy his company longer.\" Then we reached and besieged Khaibar till we were afflicted with severe hunger. Then Allah helped the Muslims conquer it (i.e. Khaibar). In the evening of the day of the conquest of the city, the Muslims made huge fires. The Prophet said, \"What are these fires? For cooking what, are you making the fire?\" The people replied, \"(For cooking) meat.\" He asked, \"What kind of meat?\" They (i.e. people) said, \"The meat of donkeys.\" The Prophet said, \"Throw away the meat and break the pots!\" Some man said, \"O Allah's Apostle! Shall we throw away the meat and wash the pots instead?\" He said, \"(Yes, you can do) that too.\" So when the army files were arranged in rows (for the clash), 'Amir's sword was short and he aimed at the leg of a Jew to strike it, but the sharp blade of the sword returned to him and injured his own knee, and that caused him to die. When they returned from the battle, Allah's Apostle saw me (in a sad mood). He took my hand and said, \"What is bothering you?\" I replied, \"Let my father and mother be sacrificed for you! The people say that the deeds of 'Amir are lost.\" The Prophet said, \"Whoever says so, is mistaken, for 'Amir has got a double reward.\" The Prophet raised two fingers and added, \"He (i.e. Amir) was a persevering struggler in the Cause of Allah and there are few 'Arabs who achieved the like of (good deeds) 'Amir had done.\"",
      "usc_msa_ref": "509",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4258",
      "hadith_no": "4258",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة، رضى الله عنه قال كان علي  رضى الله عنه  تخلف عن النبي صلى الله عليه وسلم في خيبر، وكان رمدا فقال أنا أتخلف عن النبي صلى الله عليه وسلم فلحق، فلما بتنا الليلة التي فتحت قال ‏\"‏ لأعطين الراية غدا  أو ليأخذن الراية غدا  رجل يحبه الله ورسوله، يفتح عليه ‏\"‏‏.‏ فنحن نرجوها فقيل هذا علي، فأعطاه ففتح عليه‏.‏",
      "text_en": " Narrated Salama:                     `Ali remained behind the Prophet during the Ghazwa of Khaibar as he was suffering from eye trouble. He then said, \"(How can) I remain behind the Prophet ,\" and followed him. So when he slept on the night of the conquest of Khaibar, the Prophet said, \"I will give the flag tomorrow, or tomorrow the flag will be taken by a man who is loved by Allah and His Apostle , and (Khaibar) will be conquered through him, (with Allah's help)\" While every one of us was hopeful to have the flag, it was said, \"Here is `Ali\" and the Prophet gave him the flag and Khaibar was conquered through him (with Allah's Help).",
      "usc_msa_ref": "520",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4315",
      "hadith_no": "4315",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع، يقول غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وخرجت فيما يبعث من البعوث تسع غزوات، مرة علينا أبو بكر، ومرة علينا أسامة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     I fought in seven Ghazwat (i.e. battles) along with the Prophet and fought in nine battles, fought by armies dispatched by the Prophet. Once Abu Bakr was our commander and at another time, Usama was our commander. Narrated Salama in another narration: I fought seven Ghazwat (i.e. battles) along with the Prophet and also fought in nine battles, fought by armies sent by the Prophet . Once Abu Bakr was our commander and another time, Usama was (our commander).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4316",
      "hadith_no": "4316",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عمر بن حفص بن غياث حدثنا أبي، عن يزيد بن أبي عبيد، قال سمعت سلمة، يقول غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وخرجت فيما يبعث من البعث تسع غزوات، علينا مرة أبو بكر، ومرة أسامة‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30204",
        "20317",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4317",
      "hadith_no": "4317",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، حدثنا يزيد، عن سلمة بن الأكوع  رضى الله عنه  قال غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وغزوت مع ابن حارثة استعمله علينا‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     I fought in nine Ghazwa-t along with the Prophet, I also fought along with Ibn Haritha when the Prophet made him our commander.",
      "usc_msa_ref": "570",
      "chain": [
        "20241",
        "20472",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4318",
      "hadith_no": "4318",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حماد بن مسعدة، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزوت مع النبي صلى الله عليه وسلم سبع غزوات‏.‏ فذكر خيبر والحديبية ويوم حنين ويوم القرد‏.‏ قال يزيد ونسيت بقيتهم‏.‏",
      "text_en": " Narrated Yazid bin Abi Ubaid:                     Salama bin Al-Akwa` said, \"I fought in seven Ghazwat along with the Prophet.\" He then mentioned Khaibar, Al-Hudaibiya, the day (i.e. battle) of Hunain and the day of Al-Qurad. I forgot the names of the other Ghazwat.",
      "usc_msa_ref": "571",
      "chain": [
        "30561",
        "20224",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4548",
      "hadith_no": "4548",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن عمرو بن الحارث، عن بكير بن عبد الله، عن يزيد، مولى سلمة بن الأكوع عن سلمة، قال لما نزلت ‏{‏وعلى الذين يطيقونه فدية طعام مسكين‏}‏ كان من أراد أن يفطر ويفتدي حتى نزلت الآية التي بعدها فنسختها‏.‏ مات بكير قبل يزيد‏.‏",
      "text_en": " Narrated Salama:                     When the Divine Revelation: \"For those who can fast, they had a choice either fast, or feed a poor for every day,\" (2.184) was revealed, it was permissible for one to give a ransom and give up fasting, till the Verse succeeding it was revealed and abrogated it.",
      "usc_msa_ref": "34",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-5173",
      "hadith_no": "5173",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال عمرو عن الحسن بن محمد، عن جابر بن عبد الله، وسلمة بن الأكوع، قالا كنا في جيش فأتانا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنه قد أذن لكم أن تستمتعوا فاستمتعوا ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah and Salama bin Al-Akwa`:                     While we were in an army, Allah's Apostle came to us and said, \"You have been allowed to do the Mut'a (marriage), so do it.\" Salama bin Al-Akwa` said: Allah's Apostle's said, \"If a man and a woman agree (to marry temporarily), their marriage should last for three nights, and if they like to continue, they can do so; and if they want to separate, they can do so.\" I do not know whether that was only for us or for all the people in general. Abu `Abdullah (Al-Bukhari) said: `Ali made it clear that the Prophet said, \"The Mut'a marriage has been cancelled (made unlawful).",
      "usc_msa_ref": "52",
      "chain": [
        "30026",
        "20005",
        "11081",
        "30245",
        "34",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-5174",
      "hadith_no": "5174",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال ابن أبي ذئب حدثني إياس بن سلمة بن الأكوع، عن أبيه، عن رسول الله صلى الله عليه وسلم ‏\"‏ أيما رجل وامرأة توافقا فعشرة ما بينهما ثلاث ليال فإن أحبا أن يتزايدا أو يتتاركا تتاركا ‏\"‏‏.‏ فما أدري أشىء كان لنا خاصة أم للناس عامة‏.‏ قال أبو عبد الله وبينه علي عن النبي صلى الله عليه وسلم أنه منسوخ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20177",
        "11152",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-5555",
      "hadith_no": "5555",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثني يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال لما أمسوا يوم فتحوا خيبر أوقدوا النيران، قال النبي صلى الله عليه وسلم ‏\"‏ على ما أوقدتم هذه النيران ‏\"‏‏.‏ قالوا لحوم الحمر الإنسية‏.‏ قال ‏\"‏ أهريقوا ما فيها، واكسروا قدورها ‏\"‏‏.‏ فقام رجل من القوم فقال نهريق ما فيها ونغسلها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أو ذاك ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqwa':                     In the evening of the day of the conquest of Khaibar, the army made fires (for cooking). The Prophet said, \"For what have you made these fires?\" They said, \"For cooking the meat of domestic donkeys.\" He said, \"Throw away what is in the cooking pots and break the pots.\" A man from the people got up and said, \"Shall we throw the contents of the cooking pots and then wash the pots (instead of breaking them)?\" The Prophet said, \"Yes, you can do either.'",
      "usc_msa_ref": "405",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-5615",
      "hadith_no": "5615",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سلمة، عن أبي جحيفة، عن البراء، قال ذبح أبو بردة قبل الصلاة فقال له النبي صلى الله عليه وسلم ‏\"‏ أبدلها ‏\"‏‏.‏ قال ليس عندي إلا جذعة  قال شعبة وأحسبه قال  هي خير من مسنة‏.‏ قال ‏\"‏ اجعلها مكانها، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     Abu Burda slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet said to him, \"Slaughter another sacrifice instead of that.\" Abu Burda said, \"I have nothing except a Jadha'a.\" (Shu`ba said: Perhaps Abu Burda also said that Jadha'a was better than an old sheep in his opinion.) The Prophet said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient for anyone else after you.\"",
      "usc_msa_ref": "464",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "4047",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-5628",
      "hadith_no": "5628",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال قال النبي صلى الله عليه وسلم ‏\"‏ من ضحى منكم فلا يصبحن بعد ثالثة وفي بيته منه شىء ‏\"‏‏.‏ فلما كان العام المقبل قالوا يا رسول الله نفعل كما فعلنا عام الماضي قال ‏\"‏ كلوا وأطعموا وادخروا فإن ذلك العام كان بالناس جهد فأردت أن تعينوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqua':                     The Prophet said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after three days.\" When it was the next year the people said, \"O Allah's Apostle! Shall we do as we did last year?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having a hard time and I wanted you to help (the needy).",
      "usc_msa_ref": "476",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-6218",
      "hadith_no": "6218",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فسرنا ليلا، فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك، قال وكان عامر رجلا شاعرا، فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ فقال ‏\"‏ يرحمه الله ‏\"‏‏.‏ فقال رجل من القوم وجبت يا نبي الله، لو أمتعتنا به‏.‏ قال فأتينا خيبر فحاصرناهم حتى أصابتنا مخمصة شديدة، ثم إن الله فتحها عليهم، فلما أمسى الناس اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران، على أى شىء توقدون ‏\"‏‏.‏ قالوا على لحم‏.‏ قال ‏\"‏ على أى لحم ‏\"‏‏.‏ قالوا على لحم حمر إنسية‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهرقوها واكسروها ‏\"‏‏.‏ فقال رجل يا رسول الله أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏ فلما تصاف القوم كان سيف عامر فيه قصر، فتناول به يهوديا ليضربه، ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه، فلما قفلوا قال سلمة رآني رسول الله صلى الله عليه وسلم شاحبا‏.‏ فقال لي ‏\"‏ ما لك ‏\"‏‏.‏ فقلت فدى لك أبي وأمي زعموا أن عامرا حبط عمله‏.‏ قال ‏\"‏ من قاله ‏\"‏‏.‏ قلت قاله فلان وفلان وفلان وأسيد بن الحضير الأنصاري‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذب من قاله، إن له لأجرين  وجمع بين إصبعيه  إنه لجاهد مجاهد، قل عربي نشأ بها مثله ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqwa:                     We went out with Allah's Apostle to Khaibar and we travelled during the night. A man amongst the people said to 'Amir bin Al-Aqwa', \"Won't you let us hear your poetry?\" 'Amir was a poet, and so he got down and started (chanting Huda) reciting for the people, poetry that keep pace with the camel's foot steps, saying, \"O Allah! Without You we would not have been guided on the right path, neither would we have given in charity, nor would we have prayed. So please forgive us what we have committed. Let all of us be sacrificed for Your cause and when we meet our enemy, make our feet firm and bestow peace and calmness on us and if they (our enemy) will call us towards an unjust thing we will refuse. The infidels have made a hue and cry to ask others help against us. Allah's Apostle said, \"Who is that driver (of the camels)?\" They said, \"He is 'Amir bin Al-Aqwa.\"' He said, \"May Allah bestow His mercy on him.\" A man among the people said, Has Martyrdom been granted to him, O Allah's Prophet! Would that you let us enjoy his company longer.\" We reached (the people of) Khaibar and besieged them till we were stricken with severe hunger but Allah helped the Muslims conquer Khaibar. In the evening of its conquest the people made many fires. Allah's Apostle asked, \"What are those fires? For what are you making fires?\" They said, \"For cooking meat.\" He asked, \"What kind of meat?\" They said, \"Donkeys' meat.\" Allah's Apostle said, \"Throw away the meat and break the cooking pots.\" A man said, O Allah's Apostle! Shall we throw away the meat and wash the cooking pots?\" He said, \"You can do that too.\" When the army files aligned in rows (for the battle), 'Amir's sword was a short one, and while attacking a Jew with it in order to hit him, the sharp edge of the sword turned back and hit 'Amir's knee and caused him to die. When the Muslims returned (from the battle), Salama said, Allah's Apostle saw me pale and said, 'What is wrong with you?\"' I said, \"Let my parents be sacrificed for you! The people claim that all the deeds of Amir have been annulled.\" The Prophet asked, \"Who said so?\" I replied, \"So-and-so and soand- so and Usaid bin Al-Hudair Al-Ansari said, 'Whoever says so is telling a lie. Verily, 'Amir will have double reward.\"' (While speaking) the Prophet put two of his fingers together to indicate that, and added, \"He was really a hard-working man and a Mujahid (devout fighter in Allah's Cause) and rarely have there lived in it (i.e., Medina or the battle-field) an \"Arab like him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-6389",
      "hadith_no": "6389",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا ابن مهدي، عن سفيان، عن سلمة، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند ميمونة فقام النبي صلى الله عليه وسلم فأتى حاجته، غسل وجهه ويديه، ثم نام، ثم قام فأتى القربة فأطلق شناقها، ثم توضأ وضوءا بين وضوءين لم يكثر، وقد أبلغ، فصلى، فقمت فتمطيت كراهية أن يرى أني كنت أتقيه، فتوضأت، فقام يصلي، فقمت عن يساره، فأخذ بأذني فأدارني عن يمينه، فتتامت صلاته ثلاث عشرة ركعة ثم اضطجع فنام حتى نفخ  وكان إذا نام نفخ  فآذنه بلال بالصلاة، فصلى ولم يتوضأ، وكان يقول في دعائه ‏\"‏ اللهم اجعل في قلبي نورا، وفي بصري نورا، وفي سمعي نورا، وعن يميني نورا، وعن يساري نورا، وفوقي نورا، وتحتي نورا، وأمامي نورا، وخلفي نورا، واجعل لي نورا ‏\"‏‏.‏ قال كريب وسبع في التابوت‏.‏ فلقيت رجلا من ولد العباس فحدثني بهن، فذكر عصبي ولحمي ودمي وشعري وبشري، وذكر خصلتين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of Maimuna. The Prophet woke up, answered the call of nature, washed his face and hands, and then slept. He got up (late at night), went to a water skin, opened the mouth thereof and performed ablution not using much water, yet he washed al I the parts properly and then offered the prayer. I got up and straightened my back in order that the Prophet might not feel that I was watching him, and then I performed the ablution, and when he got up to offer the prayer, stood on his left. He caught hold of my ear and brought me over to his right side. He offered thirteen rak`at in all and then lay down and slept till he started blowing out his breath as he used to do when he slept. In the meantime Bilal informed the Prophet of the approaching time for the (Fajr) prayer, and the Prophet offered the Fajr (Morning) prayer without performing new ablution. He used to say in his invocation, Allaihumma ij'al fi qalbi nuran wa fi basari nuran, wa fi sam'i nuran, wa'an yamini nuran, wa'an yasari nuran, wa fawqi nuran, wa tahti nuran, wa amami nuran, wa khalfi nuran, waj'al li nuran.\" Kuraib (a sub narrator) said, \"I have forgotten seven other words, (which the Prophet mentioned in this invocation). I met a man from the offspring of Al-`Abbas and he narrated those seven things to me, mentioning, '(Let there be light in) my nerves, my flesh, my blood, my hair and my body,' and he also mentioned two other things.\"",
      "usc_msa_ref": "328",
      "chain": [
        "30026",
        "20033",
        "20012",
        "237",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6405",
      "hadith_no": "6405",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن يزيد بن أبي عبيد، مولى سلمة حدثنا سلمة بن الأكوع، قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر، قال رجل من القوم أيا عامر لو أسمعتنا من هنيهاتك‏.‏ فنزل يحدو بهم يذكر‏.‏ تالله لولا الله ما اهتدينا‏.‏ وذكر شعرا غير هذا، ولكني لم أحفظه‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏‏.‏ وقال رجل من القوم يا رسول الله لولا متعتنا به، فلما صاف القوم قاتلوهم، فأصيب عامر بقائمة سيف نفسه فمات، فلما أمسوا أوقدوا نارا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النار على أى شىء توقدون ‏\"‏‏.‏ قالوا على حمر إنسية‏.‏ فقال ‏\"‏ أهريقوا ما فيها، وكسروها ‏\"‏‏.‏ قال رجل يا رسول الله ألا نهريق ما فيها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     We went out with the Prophet to Khaibar. A man among the people said, \"O 'Amir! Will you please recite to us some of your poetic verses?\" So 'Amir got down and started chanting among them, saying, \"By Allah! Had it not been for Allah, we would not have been guided.\" 'Amir also said other poetic verses which I do not remember. Allah's Apostle said, \"Who is this (camel) driver?\" The people said, \"He is 'Amir bin Al-Akwa`,\" He said, \"May Allah bestow His Mercy on him.\" A man from the People said, \"O Allah's Apostle! Would that you let us enjoy his company longer.\" When the people (Muslims) lined up, the battle started, and 'Amir was struck with his own sword (by chance) by himself and died. In the evening, the people made a large number of fires (for cooking meals). Allah's Apostle said, \"What is this fire? What are you making the fire for?\" They said, \"For cooking the meat of donkeys.\" He said, \"Throw away what is in the pots and break the pots!\" A man said, \"O Allah's Prophet! May we throw away what is in them and wash them?\" He said, \"Never mind, you may do so.\" (See Hadith No. 509, Vol. 5).",
      "usc_msa_ref": "343",
      "chain": [
        "30175",
        "20031",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-6578",
      "hadith_no": "6578",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني سلمة بن كهيل،‏.‏ وحدثنا أبو نعيم، حدثنا سفيان، عن سلمة، قال سمعت جندبا، يقول قال النبي صلى الله عليه وسلم ولم أسمع أحدا يقول قال النبي صلى الله عليه وسلم غيره فدنوت منه فسمعته يقول قال النبي صلى الله عليه وسلم ‏\"‏ من سمع سمع الله به، ومن يرائي يرائي الله به ‏\"‏‏.‏",
      "text_en": " Narrated Jundub:                     The Prophet said, \"He who lets the people hear of his good deeds intentionally, to win their praise, Allah will let the people know his real intention (on the Day of Resurrection), and he who does good things in public to show off and win the praise of the people, Allah will disclose his real intention (and humiliate him).",
      "usc_msa_ref": "506",
      "chain": [
        "30175",
        "20031",
        "20012",
        "20348",
        "20005",
        "237",
        "4053"
      ]
    },
    {
      "id": "sahih-bukhari-6975",
      "hadith_no": "6975",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، عن سلمة، قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر فقال رجل منهم أسمعنا يا عامر من هنيهاتك‏.‏ فحدا بهم، فقال النبي صلى الله عليه وسلم ‏\"‏ من السائق ‏\"‏ قالوا عامر‏.‏ فقال ‏\"‏ رحمه الله ‏\"‏‏.‏ فقالوا يا رسول الله هلا أمتعتنا به‏.‏ فأصيب صبيحة ليلته فقال القوم حبط عمله، قتل نفسه‏.‏ فلما رجعت وهم يتحدثون أن عامرا حبط عمله، فجئت إلى النبي صلى الله عليه وسلم فقلت يا نبي الله فداك أبي وأمي، زعموا أن عامرا حبط عمله‏.‏ فقال ‏\"‏ كذب من قالها، إن له لأجرين اثنين، إنه لجاهد مجاهد، وأى قتل يزيده عليه ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     We went out with the Prophet to Khaibar. A man (from the companions) said, \"O 'Amir! Let us hear some of your Huda (camel-driving songs.)\" So he sang some of them (i.e. a lyric in harmony with the camels walk). The Prophet said, \"Who is the driver (of these camels)?\" They said, \"Amir.\" The Prophet said, \"May Allah bestow His Mercy on him !\" The people said, \"O Allah's Apostle! Would that you let us enjoy his company longer!\" Then 'Amir was killed the following morning. The people said, \"The good deeds of 'Amir are lost as he has killed himself.\" I returned at the time while they were talking about that. I went to the Prophet and said, \"O Allah's Prophet! Let my father be sacrificed for you! The people claim that 'Amir's good deeds are lost.\" The Prophet said, \"Whoever says so is a liar, for 'Amir will have a double reward as he exerted himself to obey Allah and fought in Allah's Cause. No other way of killing would have granted him greater reward.\"",
      "usc_msa_ref": "29",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-7176",
      "hadith_no": "7176",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك تعربت قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو‏.‏ وعن يزيد بن أبي عبيد قال لما قتل عثمان بن عفان خرج سلمة بن الأكوع إلى الربذة، وتزوج هناك امرأة وولدت له أولادا، فلم يزل بها حتى قبل أن يموت بليال، فنزل المدينة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     That he visited Al-Hajjaj (bin Yusuf). Al-Hajjaj said, \"O son of Al-Akwa`! You have turned on your heels (i.e., deserted Islam) by staying (in the desert) with the bedouins.\" Salama replied, \"No, but Allah's Apostle allowed me to stay with the bedouin in the desert.\" Narrated Yazid bin Abi Ubaid: When `Uthman bin `Affan was killed (martyred), Salama bin Al-Akwa` went out to a place called Ar- Rabadha and married there and begot children, and he stayed there till a few nights before his death when he came to Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-7294",
      "hadith_no": "7294",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة، قال بايعنا النبي صلى الله عليه وسلم تحت الشجرة فقال لي ‏\"‏ يا سلمة ألا تبايع ‏\"‏‏.‏ قلت يا رسول الله قد بايعت في الأول‏.‏ قال ‏\"‏ وفي الثاني ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     We gave the oath of allegiance to the Prophet under the tree. He said to me, \"O Salama! Will you not give the oath of allegiance?\" I replied, \"O Allah's Apostle! I have already given the oath of allegiance for the first time.\" He said, (Give it again) for the second time.",
      "usc_msa_ref": "315",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-7351",
      "hadith_no": "7351",
      "source": "Sahih Bukhari",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن يزيد بن أبي عبيد، حدثنا سلمة بن الأكوع، أن رسول الله صلى الله عليه وسلم قال لرجل من أسلم ‏\"‏ أذن في قومك  أو في الناس  يوم عاشوراء أن من أكل فليتم بقية يومه، ومن لم يكن أكل فليصم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Allah's Apostle said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the people) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the rest of the day; and whoever has not eaten anything, should complete his fast.' \"",
      "usc_msa_ref": "370",
      "chain": [
        "30175",
        "20031",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-66",
      "hadith_no": "66",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة، حدثنا الحميدي، حدثنا سفيان، قال سمعت جابرا، يحدث بنحو من ثلاثين ألف حديث ما أستحل أن أذكر منها شيئا وأن لي كذا وكذا ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "237",
        "30418",
        "20005",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-509-2",
      "hadith_no": "509",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، - واللفظ لابن المثنى - قال إسحاق أخبرنا وقال ابن المثنى، حدثنا حماد بن مسعدة، - عن يزيد، - يعني ابن أبي عبيد - عن سلمة، - وهو ابن الأكوع أنه كان يتحرى موضع مكان المصحف يسبح فيه ‏.‏ وذكر أن رسول الله صلى الله عليه وسلم كان يتحرى ذلك المكان وكان بين المنبر والقبلة قدر ممر الشاة ‏.‏",
      "text_en": " Salama b. Akwa' reported:                      He sought the place (in the mosque) where the copies of the Qur'an were kept and glorified Allah there, and the narrator made a mention that the Messenger of Allah (may peace be upon him) sought that place and that was between the pulpit and the qibla-a place where a goat could pass.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30170",
        "30312",
        "20224",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-1472",
      "hadith_no": "1472",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أن رسول الله صلى الله عليه وسلم كان يصلي المغرب إذا غربت الشمس وتوارت بالحجاب ‏.‏",
      "text_en": " Salama b. al-Akwa' reported that the Messenger of Allah (may peace be upon him) used to say the evening prayer when the sun had set and disappeared (behind the horizon).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-1830",
      "hadith_no": "1830",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد، - وهو ابن جعفر - حدثنا شعبة، عن سلمة، عن كريب، عن ابن عباس، قال بت في بيت خالتي ميمونة فبقيت كيف يصلي رسول الله صلى الله عليه وسلم - قال - فقام فبال ثم غسل وجهه وكفيه ثم نام ثم قام إلى القربة فأطلق شناقها ثم صب في الجفنة أو القصعة فأكبه بيده عليها ثم توضأ وضوءا حسنا بين الوضوءين ثم قام يصلي فجئت فقمت إلى جنبه فقمت عن يساره - قال - فأخذني فأقامني عن يمينه فتكاملت صلاة رسول الله صلى الله عليه وسلم ثلاث عشرة ركعة ثم نام حتى نفخ وكنا نعرفه إذا نام بنفخه ثم خرج إلى الصلاة فصلى فجعل يقول في صلاته أو في سجوده ‏\"‏ اللهم اجعل في قلبي نورا وفي سمعي نورا وفي بصري نورا وعن يميني نورا وعن شمالي نورا وأمامي نورا وخلفي نورا وفوقي نورا وتحتي نورا واجعل لي نورا أو قال واجعلني نورا ‏\"‏ ‏.‏",
      "text_en": " Salama said:                      I met Kuraib and he reported Ibn 'Abbas as saying: I was with my mother's sister Maimuna that the Messenger of Allah (may peace be upon him) came there, and then he narrated the rest of the hadith as was narrated by Ghundar and said these words:\" Make me light,\" beyond any doubt.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2009",
      "hadith_no": "2009",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني حميد بن مسعدة الباهلي، حدثنا بشر، - يعني ابن مفضل - حدثنا سلمة، وهو ابن علقمة عن محمد، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Abu Huraira by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "237",
        "20278",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2029",
      "hadith_no": "2029",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا يحيى بن يحيى، وإسحاق بن إبراهيم، قالا أخبرنا وكيع، عن يعلى بن، الحارث المحاربي عن إياس بن سلمة بن الأكوع، عن أبيه، قال كنا نجمع مع رسول الله صلى الله عليه وسلم إذا زالت الشمس ثم نرجع نتتبع الفىء ‏.‏",
      "text_en": " Iyas b. Salama b. al-Akwa' reported on the authority of his father:                      We used to observe the Friday prayer with the Messenger of Allah (may peace be upon him) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30123",
        "20032",
        "11152",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-2030",
      "hadith_no": "2030",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا هشام بن عبد الملك، حدثنا يعلى بن الحارث، عن إياس بن سلمة بن الأكوع، عن أبيه، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الجمعة فنرجع وما نجد للحيطان فيئا نستظل به ‏.‏",
      "text_en": " Iyas b. Salama b. Akwa' reported on the authority of his father, saying:                      We used to observe the Friday prayer with the Messenger of Allah (may peace be upon him), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun).",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "11152",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-2450",
      "hadith_no": "2450",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، وسلمة بن شبيب، - قال سلمة حدثنا وقال الدارمي، أخبرنا مروان، وهو ابن محمد الدمشقي - حدثنا سعيد، - وهو ابن عبد العزيز - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو فحبيب إلى وأما هو عندي فأمين عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم تسعة أو ثمانية أو سبعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ وكنا حديث عهد ببيعة فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ قال فبسطنا أيدينا وقلنا قد بايعناك يا رسول الله فعلام نبايعك قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ فلقد رأيت بعض أولئك النفر يسقط سوط أحدهم فما يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " Malik al-Ashja'i reported:                      We, nine, eight or seven men, were in the company of the Messenger of Allah (may peace be upon him) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30417",
        "237",
        "30025",
        "20201",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "id": "sahih-muslim-2724",
      "hadith_no": "2724",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، - رضى الله عنه - أنه قال بعث رسول الله صلى الله عليه وسلم رجلا من أسلم يوم عاشوراء فأمره أن يؤذن في الناس ‏\"‏ من كان لم يصم فليصم ومن كان أكل فليتم صيامه إلى الليل ‏\"‏ ‏.‏",
      "text_en": " Salama b. al-Akwa' (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) sent a person of the tribe of Aslam on the day of 'Ashura and commanded him to declare to the people to observe fast in case they had not observed it, and to complete fast till evening if they had taken food",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-2741",
      "hadith_no": "2741",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن عمرو بن الحارث، عن بكير، عن يزيد، مولى سلمة عن سلمة بن الأكوع، - رضى الله عنه - قال لما نزلت هذه الآية ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين‏}‏ كان من أراد أن يفطر ويفتدي ‏.‏ حتى نزلت الآية التي بعدها فنسختها ‏.‏",
      "text_en": " Salama b. Akwa' (Allah be pleased with him) reported that when this verse was revealed:                     \" And as for those who can fast (but do not) expiation is the feeding of a needy person\" (ii. 183), (he who liked to observe fast did observe it) and he who felt reluctant to observe it ate and expiated till the verse was revealed which abro- gated it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-2742",
      "hadith_no": "2742",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني عمرو بن سواد العامري، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن، الحارث عن بكير بن الأشج، عن يزيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، - رضى الله عنه - أنه قال كنا في رمضان على عهد رسول الله صلى الله عليه وسلم من شاء صام ومن شاء أفطر فافتدى بطعام مسكين حتى أنزلت هذه الآية ‏{‏ فمن شهد منكم الشهر فليصمه‏}‏",
      "text_en": " Salama b. Akwa' reported:                      We, during the lifetime of the Messenger of Allah (may peace be upon him), in one month of Ramadan (observed fast according to our liking). He who wished to fast lasted and he who wished to break broke it and fed a needy person as an expiation 1544 till this verse was revealed:\" He who witnesses among you the month (of Ramadan) he should observe fast during it\" (ii. 184).",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-3479",
      "hadith_no": "3479",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن دينار، قال سمعت الحسن بن محمد، يحدث عن جابر بن عبد الله، وسلمة بن الأكوع، قالا خرج علينا منادي رسول الله صلى الله عليه وسلم فقال إن رسول الله صلى الله عليه وسلم قد أذن لكم أن تستمتعوا ‏.‏ يعني متعة النساء ‏.‏",
      "text_en": " Jabir b. 'Abdullah and Salama b. al-Akwa' said:                      There came to us the proclaimer of Allah's Messenger (may peace be upon him) and said: Allah's Messenger (may peace be upon him) has granted you permission to benefit yourselves, i. e. to contract temporary marriage with women.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11081",
        "30245",
        "34",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-3480",
      "hadith_no": "3480",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أمية بن بسطام العيشي، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - يعني ابن القاسم - عن عمرو بن دينار، عن الحسن بن محمد، عن سلمة بن الأكوع، وجابر بن عبد الله أن رسول الله صلى الله عليه وسلم أتانا فأذن لنا في المتعة ‏.‏",
      "text_en": " Salama b. al. Akwa' and Jabir b. Abdullah reported:                      Allah's Messenger (may peace be upon him) came to us and permitted us to contract temporary marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11081",
        "30245",
        "237",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4769",
      "hadith_no": "4769",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، - واللفظ لابن عباد - قالا حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فتسيرنا ليلا فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك وكان عامر رجلا شاعرا فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏ ‏.‏ قالوا عامر ‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ فقال رجل من القوم وجبت يا رسول الله لولا أمتعتنا به ‏.‏ قال فأتينا خيبر فحصرناهم حتى أصابتنا مخمصة شديدة ثم قال ‏\"‏ إن الله فتحها عليكم ‏\"‏ ‏.‏ قال فلما أمسى الناس مساء اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏ ‏.‏ فقالوا على لحم ‏.‏ قال ‏\"‏ أى لحم ‏\"‏ ‏.‏ قالوا لحم حمر الإنسية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏ ‏.‏ فقال رجل أو يهريقوها ويغسلوها فقال ‏\"‏ أو ذاك ‏\"‏ ‏.‏ قال فلما تصاف القوم كان سيف عامر فيه قصر فتناول به ساق يهودي ليضربه ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه قال فلما قفلوا قال سلمة وهو آخذ بيدي قال فلما رآني رسول الله صلى الله عليه وسلم ساكتا قال ‏\"‏ ما لك ‏\"‏ ‏.‏ قلت له فداك أبي وأمي زعموا أن عامرا حبط عمله قال ‏\"‏ من قاله ‏\"‏ ‏.‏ قلت فلان وفلان وأسيد بن حضير الأنصاري فقال ‏\"‏ كذب من قاله إن له لأجرين ‏\"‏ ‏.‏ وجمع بين إصبعيه ‏\"‏ إنه لجاهد مجاهد قل عربي مشى بها مثله ‏\"‏ ‏.‏ وخالف قتيبة محمدا في الحديث في حرفين وفي رواية ابن عباد وألق سكينة علينا ‏.‏",
      "text_en": " It has been narrated on the authority of Salama b. al-Akwa' who said:                      We marched upon Khaibar with the Messenger of Allah (may peace be upon him). We journeyed during the night. One of the people said to (my brother) 'Amir b. al-Akwa': Won't you recite to us some of your verses? Amir was a poet. So he began to chant his verses to urge the camels, reciting: O God, if Thou hadst not guided us We would have neither been guided rightly nor practised charity, Nor offered prayers. We wish to lay down our lives for Thee; so forgive Thou our lapses, And keep us steadfast when we encounter (our enemies). Bestow upon us peace and tranquillity. Behold, when with a cry they called upon us to help. The Messenger of Allah (may peace be upon him) said: Who is this driver (of the camels)? They said: It is 'Amir. He said: God will show mercy to him. A man said: Martyrdom is reserved for him. Messenger of Allah, would that you had allowed us to benefit ourselves from his life. (The narrator says): We reached Khaibar and besieged them, and (we continued the siege) until extreme hunger afflicted us. Then the Messenger of Allah (may peace be upon him) said: Behold, God has conquered it for you. When it was evening of the day on which the city was conquered. the Muslims lit many fires. The Messenger of Allah (may peace be upon him) said: What are these fires? And what are they cooking? They said: They are cooking meat. He asked. Which meat? They said: That of domestic asses. He said: Let them throw it away and break the pots (in which it is being cooked). A man said: Or should they throw it away and wash the pots? He said: They may do that. When the people drew themselves up in battle array 'Amir caught hold of his sword that was rather short He drove a Jew before him to strike him with it. (As he struck him), his sword recoiled and struck his own knee, and 'Amir died of the wound. When the people returned (after the conquest of Kliaibar) and he (Salama) had caught hold of my hand, and said: The Messenger of Allah (may peace be upon him) saw that I was silent (and dejected) ; he said: What's the matter with thee? I said to him: My father and my mother be thy ransom, people presume that 'Amir's sacrifice has been in vain. He asked: Who has said that? I said: So and so and Usaid b. Hudair al-Ansari. He said: Who has said that has lied. For him (for 'Amir) there is a double reward. (He indicated this by putting two of his fingers together.) He was a devotee of God and a warrior fighting for His cause. There will be hardly any Arab who can fight as bravely as he did. Qutaiba has differed in a few words.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30377",
        "20159",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-4770",
      "hadith_no": "4770",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن، - ونسبه غير ابن وهب فقال ابن عبد الله بن كعب بن مالك - أن سلمة، بن الأكوع قال لما كان يوم خيبر قاتل أخي قتالا شديدا مع رسول الله صلى الله عليه وسلم فارتد عليه سيفه فقتله فقال أصحاب رسول الله صلى الله عليه وسلم في ذلك وشكوا فيه رجل مات في سلاحه ‏.‏ وشكوا في بعض أمره ‏.‏ قال سلمة فقفل رسول الله صلى الله عليه وسلم من خيبر فقلت يا رسول الله ائذن لي أن أرجز لك ‏.‏ فأذن له رسول الله صلى الله عليه وسلم فقال عمر بن الخطاب أعلم ما تقول قال فقلت والله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدقت ‏\"‏ ‏.‏ وأنزلن سكينة علينا وثبت الأقدام إن لاقينا والمشركون قد بغوا علينا قال فلما قضيت رجزي قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال هذا ‏\"‏ ‏.‏ قلت قاله أخي فقال رسول الله صلى الله عليه وسلم ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ قال فقلت يا رسول الله إن ناسا ليهابون الصلاة عليه يقولون رجل مات بسلاحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ مات جاهدا مجاهدا ‏\"‏ ‏.‏ قال ابن شهاب ثم سألت ابنا لسلمة بن الأكوع فحدثني عن أبيه مثل ذلك غير أنه قال - حين قلت إن ناسا يهابون الصلاة عليه - فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذبوا مات جاهدا مجاهدا فله أجره مرتين ‏\"‏ ‏.‏ وأشار بإصبعيه ‏.‏",
      "text_en": " It has been reported on the authority of Salama b. Akwa' who said:                      On the day of the Battle of Khaibar my brother fought a fierce fight by the side of the Messenger of Allah (may peace be upon him). His sword rebounded and killed him. The Companions of the Messenger of Allah (may peace be upon hill) talked about his death and doubted (whether it was martyrdom). (They said): (He is) a man killed by his own weapon, and expressed doubt about his affair. Salama said: When the Messenger of Allah (may peace be upon him) returned from Khaibar, I said: Messenger of Allah, permit me that I may recite to you some rajaz verses. The Messenger of Allah (may peace be upon him) permitted him. 'Umar b. Khattab said: I know what you will recite. I recited: By God, if God had guided us not, We would hive neither been guided aright nor practised charity, Nor offered prayers. The Messenger of Allah (may peace be upon him) said: What you have said is true, 'I (continued): And descend on us peace and tranquillity And keep us steadfast if we encounter (with our enemies) And the polytheists have rebelled against us. When I finished my rajaz, the Messenger of Allah (may peace be upon him) said: Who composed these verses? I said: They were composed by my brother. The Messenger of Allah (may peace be upon him) said: May God show mercy to him! I said: By God, some people are reluctant to invoke God's mercy on him (because) they say he is a man who died by his own sword. (Hearing this) the Messenger of Allah (may peace be upon him) said: He died as God's devotee and warrior. Ibn Shihab has said: I asked one of the sons of Salama (b. Akwa') about (the death of 'Amir). He related to me a similar tradition except that he said: When I said some people were reluctant invoke God's blessings on him, the Messenger of Allah (may peace be, upon him said: They lied. ('Amir) died as God's devotee and warrior (in the cause of Allah). For him there is a double reward, and he pointed out this by putting his two fingers together.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20475",
        "11013",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-4778",
      "hadith_no": "4778",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد قال سمعت سلمة بن الأكوع، يقول خرجت قبل أن يؤذن، بالأولى وكانت لقاح رسول الله صلى الله عليه وسلم ترعى بذي قرد - قال - فلقيني غلام لعبد الرحمن بن عوف فقال أخذت لقاح رسول الله صلى الله عليه وسلم فقلت من أخذها قال غطفان قال فصرخت ثلاث صرخات يا صباحاه ‏.‏ قال فأسمعت ما بين لابتى المدينة ثم اندفعت على وجهي حتى أدركتهم بذي قرد وقد أخذوا يسقون من الماء فجعلت أرميهم بنبلي وكنت راميا وأقول أنا ابن الأكوع واليوم يوم الرضع فأرتجز حتى استنقذت اللقاح منهم واستلبت منهم ثلاثين بردة - قال - وجاء النبي صلى الله عليه وسلم والناس فقلت يا نبي الله إني قد حميت القوم الماء وهم عطاش فابعث إليهم الساعة فقال ‏\"‏ يا ابن الأكوع ملكت فأسجح ‏\"‏ ‏.‏ - قال - ثم رجعنا ويردفني رسول الله صلى الله عليه وسلم على ناقته حتى دخلنا المدينة ‏.‏",
      "text_en": " It has been narrated on the authority of Yazid b. Abu 'Ubaid who said that he heard Salama b. al-Akwa' say:                      I went out before the Adhan for the morning prayer had been delivered. The milch she-camels of the Messenger of Allah (may peace be upon him) were grazing at Dhu Qarad. 'Abd al-Rahman b. Auf's slave met me and said: The milch she-camels of the Messenger of Allah (may peace be upon him) had been taken away. I said: Who has taken them away? He said: (the people belonging to the tribe of) Ghatafan. I cried thrice: Help! I made the whole city between the two lavas hear my cry. Then I ran straight in their pursuit until I overtook them at Dhu Qarad where they were just going to water their animals. I, being an archer, began to shoot them with my arrows and was saying: I am the son of al-Akwa'. And today is the day when the cowards will meet their doom. I continued to chant until I rescued the milch she-camels from them, and snatched from them thirty mantles. Now, the Messenger of Allah (may peace be upon him) and some other people came along. I said: Prophet of Allah, I have prevented them from water while they were thirsty. So you should send a force (to punish them). He (the Holy Prophet) said: Ibn al-Akwa', you have taken (what, you have taken). Now let them go. Then we returned and the Messenger of Allah (may peace be upon him) made me mount behind him on his she-camel until we entered Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-4800",
      "hadith_no": "4800",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد، - وهو ابن أبي عبيد قال سمعت سلمة، يقول غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات وخرجت فيما يبعث من البعوث تسع غزوات مرة علينا أبو بكر ومرة علينا أسامة بن زيد ‏.‏",
      "text_en": " It has been narrated on the authority of Salama who said:                      I joined seven military expeditions led by the Messenger of Allah himself (may peace be upon him), and nine expeditions which he sent out once under Abu Bakr and once under Usama b. Zaid.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-4932",
      "hadith_no": "4932",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك تعربت قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو ‏.‏",
      "text_en": " It has been narrated by Salama b. al-Akwa' that he visited al-Hajjaj who said to him:                      O son of al-Akwa', you have turned apostate and have come to live again in the desert with the Bedouins (after your migration). He said: No, but the Messenger of Allah (may peace be upon him) has permitted me to live in the desert.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-5130",
      "hadith_no": "5130",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن عباد، وقتيبة بن سعيد، قالا حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر ثم إن الله فتحها عليهم فلما أمسى الناس اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏ قالوا على لحم ‏.‏ قال ‏\"‏ على أى لحم ‏\"‏ ‏.‏ قالوا على لحم حمر إنسية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏ ‏.‏ فقال رجل يا رسول الله أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏ ‏.‏",
      "text_en": " Salama b. Akwa' reported:                      We went to Khaibar with Allah's Messenger (may peace be upon him). Then Allah granted (us) victory over them. On that very evening of the day when they had been granted victory, they lit many fires. Thereupon Allah's Messenger (may peace be upon him) said: What are those fires and what for those have been lit? They said: (These have been lit) for (cooking) the flesh. Thereupon he said: Of what flesh? They said: For the flesh of the domestic asses. Thereupon Allah's Messenger (may peace bo upon him) said: Throw that away and break them (the earthen pots in which the fiesa was being cooked). A person said: Messenger of Allah, should we throw it away and wash them (the cooking pots)? He said: You may do so.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-5189",
      "hadith_no": "5189",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، عن سلمة، عن أبي جحيفة، عن البراء بن عازب، قال ذبح أبو بردة قبل الصلاة فقال النبي صلى الله عليه وسلم ‏\"‏ أبدلها ‏\"‏ ‏.‏ فقال يا رسول الله ليس عندي إلا جذعة - قال شعبة وأظنه قال - وهي خير من مسنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها مكانها ولن تجزي عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that Abu Burda slaughtered the animal as a sacrifice before the ('Id) prayer. Thereupon Allah's Apostle (may peace be upon him) said:                      Offer a substitute for it (since it does not absolve you of the responsibility of sacrifice). Thereupon he said: Allah's Messenger. I have nothing with me but a goat of less than six months. Shu'ba (one of the narrators) said: I think he (al-Bara' b. 'Azib also) said: And it is better than a goat of one year. Thereupon Allah's Messenger (may peace be upon him) said: Make it a substitute for that (and sacrifice it), but it will not suffice for anyone (as a sacrifice) after you.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "4047",
        "400"
      ]
    },
    {
      "id": "sahih-muslim-5222",
      "hadith_no": "5222",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة، بن الأكوع أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ضحى منكم فلا يصبحن في بيته بعد ثالثة شيئا ‏\"‏ ‏.‏ فلما كان في العام المقبل قالوا يا رسول الله نفعل كما فعلنا عام أول فقال ‏\"‏ لا إن ذاك عام كان الناس فيه بجهد فأردت أن يفشو فيهم ‏\"‏ ‏.‏",
      "text_en": " Salama b. al-Akwa' reported Allah's Messenger (way peace be upon him) having said:                      He who sacrifices (animal) among you nothing should be left in his house (out of its flesh) on the morning of the third day. When it was the next year they (his Companions) said: Should we do this year as we did daring the previous year? Thereupon he said: Don't do that, for that was a year when the people were hard pressed (on account of poverty). so I wanted that the (flesh) might be distributed amongst them.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-5387",
      "hadith_no": "5387",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن عكرمة بن عمار، حدثني  إياس بن سلمة بن الأكوع، أن أباه، حدثه أن رجلا أكل عند رسول الله صلى الله عليه وسلم بشماله فقال ‏\"‏ كل بيمينك ‏\"‏ ‏.‏ قال لا أستطيع قال ‏\"‏ لا استطعت ‏\"‏ ‏.‏ ما منعه إلا الكبر ‏.‏ قال فما رفعها إلى فيه ‏.‏",
      "text_en": " Salama b. Akwa' reported on the authority of his father that a person ate in the presence of Allah's Messenger (may peace be upon him) with his left hand, whereupon he said:                      Eat with your right hand. He said: I cannot do that, whereupon he (the Holy Prophet) said: May you not be able to do that. It was vanity that prevented him from doing it, and he could not raise it (the right hand) up to his mouth.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-6377",
      "hadith_no": "6377",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، قال كان علي قد تخلف عن النبي صلى الله عليه وسلم في خيبر وكان رمدا فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم ‏.‏ فخرج علي فلحق بالنبي صلى الله عليه وسلم فلما كان مساء الليلة التي فتحها الله في صباحها قال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية - أو ليأخذن بالراية - غدا رجل يحبه الله ورسوله أو قال يحب الله ورسوله يفتح الله عليه ‏\"‏ ‏.‏ فإذا نحن بعلي وما نرجوه فقالوا هذا علي ‏.‏ فأعطاه رسول الله صلى الله عليه وسلم الراية ففتح الله عليه ‏.‏",
      "text_en": " Salama b. Akwa' reported that it was 'Ali whom Allah's Apostle (may peace be upon him) left behind him (in the charge of his family and the Islamic State) on the occasion of the campaign of Khaibar, and his eyes were inflamed and he said:                      Is it for me to remain behind Allah's Messenger (may peace be upon him)? So he went forth and rejoined Allah's Apostle (may peace be upon him) and on the evening of that night (after which) next morning Allah granted victory. Allah's Messenger (may peace be upon him) said: I will certainly give this standard to a man whom Allah and His Messenger love. or he said: Who loves Allah or His Messenger and Allah will grant him victory through him, and, lo, we saw 'Ali whom we least expected (to be present on that occasion). They (the Companions) said: Here is 'Ali. Thereupon Allah's Messenger (may peace be upon hin) gave him the standard. Allah granted victory at his hand.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-7681",
      "hadith_no": "7681",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، - واللفظ له - حدثنا أبو النضر، هاشم بن القاسم حدثنا عكرمة بن عمار، حدثني إياس بن سلمة بن الأكوع، أن أباه، حدثه أنه، سمع النبي صلى الله عليه وسلم وعطس رجل عنده فقال له ‏\"‏ يرحمك الله ‏\"‏ ‏.‏ ثم عطس أخرى فقال له رسول الله صلى الله عليه وسلم ‏\"‏ الرجل مزكوم ‏\"‏ ‏.‏",
      "text_en": " Iyas b. Salama b. al-Akwa reported that his father reported to him that he heard Allah's Apostle (may peace be upon him) as saying:                      A person sneezed in his presence and he said to him: May Allah have mercy upon you. And he then sneezed for the second time and Allah's Messenger (may peace be upon him) said to him: He is suffering from cold (and no response is necessary).",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20390",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-324",
      "hadith_no": "324",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد، - يعني ابن جعفر - أخبرنا شعبة، عن سلمة، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، عن عمار، بهذه القصة فقال ‏\"‏ إنما كان يكفيك ‏\"‏ ‏.‏ وضرب النبي صلى الله عليه وسلم بيده إلى الأرض ثم نفخ فيها ومسح بها وجهه وكفيه شك سلمة وقال لا أدري فيه إلى المرفقين ‏.‏ يعني أو إلى الكفين ‏.‏",
      "text_en": " Ibn 'Abd al-Rahman b. Abza reported on the authority of his father this incident from 'Ammar. He said:                      This would have been enough for you, and the Prophet (ﷺ) struck the ground with his hand. He then blew it and wiped with it his face and hands. Being doubtful Salamah said: I do not know (whether he wiped) up to the elbows or the wrists.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-abi-daud-325",
      "hadith_no": "325",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن سهل الرملي، حدثنا حجاج، - يعني الأعور - حدثني شعبة، بإسناده بهذا الحديث قال ثم نفخ فيها ومسح بها وجهه وكفيه إلى المرفقين أو إلى الذراعين ‏.‏ قال شعبة كان سلمة يقول الكفين والوجه والذراعين فقال له منصور ذات يوم انظر ما تقول فإنه لا يذكر الذراعين غيرك ‏.‏",
      "text_en": " This is transmitted by Shu'bah through a different chain of narrators. This version adds:                      He ('Ammar) said: He (the Prophet) then blew it and wiped with it his face and hands up to elbows or up to the forearms. Shu'bah said: Salamah used to narrate (the words) \"the hands and the face and the forearms\". One day Mansur said to him: Look, what are you saying, because no one except you mentions the (word) \"forearms\".",
      "usc_msa_ref": "",
      "chain": [
        "38403",
        "20381",
        "20020",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-417",
      "hadith_no": "417",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن علي، عن صفوان بن عيسى، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان النبي صلى الله عليه وسلم يصلي المغرب ساعة تغرب الشمس إذا غاب حاجبها ‏.‏",
      "text_en": " Salamah b. al-Akwa' said:                      The Prophet (ﷺ) used to say the Maghrib prayer immediately after the sun had set when its upper side would disappear.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20553",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-487",
      "hadith_no": "487",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا سلمة، حدثني محمد بن إسحاق، حدثني سلمة بن كهيل، ومحمد بن الوليد بن نويفع، عن كريب، عن ابن عباس، قال بعث بنو سعد بن بكر ضمام بن ثعلبة إلى رسول الله صلى الله عليه وسلم فقدم عليه فأناخ بعيره على باب المسجد ثم عقله ثم دخل المسجد فذكر نحوه قال فقال أيكم ابن عبد المطلب فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا ابن عبد المطلب ‏\"‏ ‏.‏ قال يا ابن عبد المطلب ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Ibn ‘Abbas reported :                      Banu Sa’d b. Bakr sent Qamam b. Tha’labah to the apostle of Allah (May peace be upon him). He came to him and made his camel kneel down near the gate of the mosque. He then tied its leg and entered the mosque. The narrator then reported in a similar way. He then said: Who among you is the son of Abd al-Muttalib? The Messenger of Allah (May peace be upon him) replied: I am the son of Ibn ‘Abd al-Muttalib. He said: O son of ‘Abd al-Muttalib. The narrator then reported the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "237",
        "11107",
        "11350",
        "18960",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-632",
      "hadith_no": "632",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، حدثنا عبد العزيز، - يعني ابن محمد - عن موسى بن إبراهيم، عن سلمة بن الأكوع، قال قلت يا رسول الله إني رجل أصيد أفأصلي في القميص الواحد قال ‏\"‏ نعم وازرره ولو بشوكة ‏\"‏ ‏.‏",
      "text_en": " Narrated Salamah ibn al-Akwa':                     I said: Messenger of Allah, I am a man who goes out hunting; may I pray in a single shirt? He replied: Yes, but fasten it even if it should be with a thorn.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20167",
        "19046",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-932",
      "hadith_no": "932",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن سلمة، عن حجر أبي العنبس الحضرمي، عن وائل بن حجر، قال كان رسول الله صلى الله عليه وسلم إذا قرأ ‏{‏ ولا الضالين ‏}‏ قال ‏\"‏ آمين ‏\"‏ ‏.‏ ورفع بها صوته ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     When the Messenger of Allah (ﷺ) recited the verse \"Nor of those who go astray\" (Surah al-Fatihah, verse 7), he would say Amin; and raised his voice (while uttering this word).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "237",
        "3045"
      ]
    },
    {
      "id": "sunan-abi-daud-1082",
      "hadith_no": "1082",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان بين منبر رسول الله صلى الله عليه وسلم وبين الحائط كقدر ممر الشاة ‏.‏",
      "text_en": " Salamah b. al-Akwa' said:                      The space between the pulpit of the Messenger of Allah (ﷺ) and the wall (of the mosque) was such that a goat could pass.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-1085",
      "hadith_no": "1085",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا يعلى بن الحارث، سمعت إياس بن سلمة بن الأكوع، يحدث عن أبيه، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الجمعة ثم ننصرف وليس للحيطان فىء ‏.‏",
      "text_en": " Salamah b. al-Akwa' reported on the authority of his father:                      We used to offer the Friday prayer along with the Messenger of Allah (ﷺ) and return (to our homes) while no shade of the walls was seen (at that time).",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-1863",
      "hadith_no": "1863",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن المتوكل العسقلاني، وسلمة، قالا حدثنا عبد الرزاق، عن معمر، عن يحيى بن أبي كثير، عن عكرمة، عن عبد الله بن رافع، عن الحجاج بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كسر أو عرج أو مرض ‏\"‏ ‏.‏ فذكر معناه ‏.‏ قال سلمة بن شبيب قال أنا معمر ‏.‏",
      "text_en": " Narrated al-Hajjaj ibn Amr:                     The Prophet (ﷺ) said: If anyone breaks (a leg) or becomes lame or falls ill. He then narrated the tradition to the  same effect. The narrator Salamah ibn Shabib said: Ma'mar narrated (this tradition) to us.",
      "usc_msa_ref": "",
      "chain": [
        "38581",
        "237",
        "20121",
        "20115",
        "11449",
        "11023",
        "11864"
      ]
    },
    {
      "id": "sunan-abi-daud-2271",
      "hadith_no": "2271",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سلمة، سمع الشعبي، عن الخليل، أو ابن الخليل قال أتي علي بن أبي طالب - رضى الله عنه - في امرأة ولدت من ثلاث نحوه لم يذكر اليمن ولا النبي صلى الله عليه وسلم ولا قوله طيبا بالولد ‏.‏",
      "text_en": " Khalil or Ibn Khalil said “A woman was brought to Ali bin Abi Talib(may Allaah be pleased with him). She bore a child from intercourse of three persons. The narrator transmitted the rest of the tradition similar to the previous one. But in this version he did not mention “Yemen” and the Prophet (ﷺ) and his words “give the child willingly.”",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "237",
        "11052"
      ]
    },
    {
      "id": "sunan-abi-daud-2315",
      "hadith_no": "2315",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن عمرو بن الحارث، عن بكير، عن يزيد، مولى سلمة عن سلمة بن الأكوع، قال لما نزلت هذه الآية ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين ‏}‏ كان من أراد منا أن يفطر ويفتدي فعل حتى نزلت الآية التي بعدها فنسختها ‏.‏",
      "text_en": " Salamah bin Al Akwa said “After the revelation of the verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent, is one of us intended to leave fast and pay ransom, he could do so.” until the verse following it was revealed and abrogated the (previous) verse.”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-2939",
      "hadith_no": "2939",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن داود بن سفيان، وسلمة، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، قال قال عمر إني إن لا أستخلف فإن رسول الله صلى الله عليه وسلم لم يستخلف وإن أستخلف فإن أبا بكر قد استخلف ‏.‏ قال فوالله ما هو إلا أن ذكر رسول الله صلى الله عليه وسلم وأبا بكر فعلمت أنه لا يعدل برسول الله صلى الله عليه وسلم أحدا وأنه غير مستخلف ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     'Umar said: I shall not appoint a successor, for the Messenger of Allah (ﷺ) did not appoint a successor. If I appoint a successor (I can do so), for Abu Bakr had appointed a successor. He Ibn 'Umar) said: I swear by Allah, he did not mention (anyone) but the Messenger of Allah (ﷺ) and Abu Bakr. So I learnt he would not equate anyone with the Messenger of Allah (ﷺ), for he did not appoint any successor.",
      "usc_msa_ref": "",
      "chain": [
        "237",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-5037",
      "hadith_no": "5037",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا ابن أبي زائدة، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، أن رجلا، عطس عند النبي صلى الله عليه وسلم فقال له ‏\"‏ يرحمك الله ‏\"‏ ‏.‏ ثم عطس فقال النبي صلى الله عليه وسلم ‏\"‏ الرجل مزكوم ‏\"‏ ‏.‏",
      "text_en": " Salamah b. al-Akwa said :                      when a man sneezed beside the prophet (May peace be upon him), he said to him : Allah have mercy on you, but when he sneezed again, he said : The man has a cold in the head.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20366",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "jami-al-tirmidhi-164",
      "hadith_no": "164",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان رسول الله صلى الله عليه وسلم يصلي المغرب إذا غربت الشمس وتوارت بالحجاب ‏\"‏ ‏.‏ قال وفي الباب عن جابر والصنابحي وزيد بن خالد وأنس ورافع بن خديج وأبي أيوب وأم حبيبة وعباس بن عبد المطلب وابن عباس ‏.‏ وحديث العباس قد روي موقوفا عنه وهو أصح ‏.‏ والصنابحي لم يسمع من النبي صلى الله عليه وسلم وهو صاحب أبي بكر رضى الله عنه ‏.‏ قال أبو عيسى حديث سلمة بن الأكوع حديث حسن صحيح ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين اختاروا تعجيل صلاة المغرب وكرهوا تأخيرها حتى قال بعض أهل العلم ليس لصلاة المغرب إلا وقت واحد وذهبوا إلى حديث النبي صلى الله عليه وسلم حيث صلى به جبريل ‏.‏ وهو قول ابن المبارك والشافعي ‏.‏",
      "text_en": " Salmah bin AI-Akwa narrated:                     \"Allah's Messenger prayed Maghrib when the sun had set and it (the sun) had hidden in the veil (of darkness).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "jami-al-tirmidhi-798",
      "hadith_no": "798",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن عمرو بن الحارث، عن بكير بن عبد الله بن الأشج، عن يزيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال لما نزلت ‏:‏ ‏(‏وعلى الذين يطيقونه فدية طعام مسكين ‏)‏ كان من أراد منا أن يفطر ويفتدي حتى نزلت الآية التي بعدها فنسختها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ ويزيد هو ابن أبي عبيد مولى سلمة بن الأكوع ‏.‏",
      "text_en": " Salamah bin Al-Akwa said:                     \"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2131",
      "hadith_no": "2131",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن عمر بن راشد، عن إياس بن سلمة بن الأكوع، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الرجل يذهب بنفسه حتى يكتب في الجبارين فيصيبه ما أصابهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Iylas bin Salamah bin Al-Akwa' narrated from his father that the Messenger of Allah said:                     \"A man shall remain exalting himself until he is written among the tyrants, so that he suffers from their afflictions.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20354",
        "28427",
        "11152",
        "237"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2964",
      "hadith_no": "2964",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله، أخبرنا عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال عطس رجل عند رسول الله صلى الله عليه وسلم وأنا شاهد فقال رسول الله صلى الله عليه وسلم ‏\"‏ يرحمك الله ‏\"‏ ‏.‏ ثم عطس الثانية والثالثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا رجل مزكوم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Iyas bin Salamah:                     from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-314",
      "hadith_no": "314",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن سلمة، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، أتى عمر فقال إني أجنبت فلم أجد الماء ‏.‏ قال عمر لا تصل ‏.‏ فقال عمار بن ياسر يا أمير المؤمنين أما تذكر إذ أنا وأنت في سرية فأجنبنا فلم نجد الماء فأما أنت فلم تصل وأما أنا فتمعكت في التراب فصليت فأتينا النبي صلى الله عليه وسلم فذكرنا ذلك له فقال ‏\"‏ إنما كان يكفيك ‏\"‏ ‏.‏ فضرب النبي صلى الله عليه وسلم يديه إلى الأرض ثم نفخ فيهما ثم مسح بهما وجهه وكفيه - وسلمة شك لا يدري فيه المرفقين أو إلى الكفين - فقال عمر نوليك ما توليت ‏.‏",
      "text_en": " It was narrated from Ibn 'Abdur-Rahman bin Abza from his father that a man came to 'Umar and said:                      \"I have become Junub and I do not have any water.\" 'Umar said: \"Do not pray.\" But 'Ammar bin Yasir said: \"O Commander of the Believers! Don't you remember when you and I were on a campaign and we became Junub and could not find water? You did not pray, but I rolled in the dust and prayed. Then we came to the Prophet (ﷺ) and told him about that, and he said: 'It would have been sufficient for you (to do this),' then the Prophet (ﷺ) struck his hands on the ground and blew on them, then wiped his face and hands with them'\" - (one of the narrators) Salamah was uncertain and did not know whether that was up to the elbows or just hands. And 'Umar said: \"We will let you bear the burden of what you took upon yourself.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "237",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-318",
      "hadith_no": "318",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سلمة، عن أبي مالك، وعن عبد الله بن عبد الرحمن بن أبزى، عن عبد الرحمن بن أبزى، قال كنا عند عمر فأتاه رجل فقال يا أمير المؤمنين ربما نمكث الشهر والشهرين ولا نجد الماء ‏.‏ فقال عمر أما أنا فإذا لم أجد الماء لم أكن لأصلي حتى أجد الماء ‏.‏ فقال عمار بن ياسر أتذكر يا أمير المؤمنين حيث كنت بمكان كذا وكذا ونحن نرعى الإبل فتعلم أنا أجنبنا قال نعم أما أنا فتمرغت في التراب فأتينا النبي صلى الله عليه وسلم فضحك فقال ‏\"‏ إن كان الصعيد لكافيك ‏\"‏ ‏.‏ وضرب بكفيه إلى الأرض ثم نفخ فيهما ثم مسح وجهه وبعض ذراعيه ‏.‏ فقال اتق الله يا عمار ‏.‏ فقال يا أمير المؤمنين إن شئت لم أذكره ‏.‏ قال لا ولكن نوليك من ذلك ما توليت ‏.‏",
      "text_en": " It was narrated that 'Abddur-Rahman bin Abza said:                      \"We were with 'Umar when a man came to him and said: 'O Commander of the Believers! sometimes we stay for a month or two without finding any water. Umar said: As if I did not find water, I would not pray until I found water.' 'Ammar bin Yasir said: 'Do you remember, O Commander of the Believer, when you were in such and such a place and we were rearing the camels, and you know that we became Junub?' He said: 'Yes.' 'As for me I rolled in the dust, then we came to the Prophet (ﷺ) and he laughed and said: \"Clean earth would have been sufficient for you.\" And he struck his hands on the earth then blew on them, then he wiped his face and part of his forearms. He ('Umar) said: \"Fear Allah, O 'Ammar!'\" He said: 'O Commander of the Believers! If you wish I will not mention it.' He said: 'No, we will let you bear the burden of what you took upon yourself.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "237",
        "10766",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-321",
      "hadith_no": "321",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبد الله بن محمد بن تميم، قال حدثنا حجاج، قال حدثنا شعبة، عن الحكم، وسلمة، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، جاء إلى عمر - رضى الله عنه - فقال إني أجنبت فلم أجد الماء ‏.‏ فقال عمر لا تصل ‏.‏ فقال عمار أما تذكر يا أمير المؤمنين إذ أنا وأنت في سرية فأجنبنا فلم نجد ماء فأما أنت فلم تصل وأما أنا فتمعكت في التراب ثم صليت فلما أتينا رسول الله صلى الله عليه وسلم ذكرت ذلك له فقال ‏\"‏ إنما يكفيك ‏\"‏ ‏.‏ وضرب النبي صلى الله عليه وسلم بيديه إلى الأرض ثم نفخ فيهما فمسح بهما وجهه وكفيه - شك سلمة وقال لا أدري فيه إلى المرفقين أو إلى الكفين - قال عمر نوليك من ذلك ما توليت قال شعبة كان يقول الكفين والوجه والذراعين ‏.‏ فقال له منصور ما تقول فإنه لا يذكر الذراعين أحد غيرك ‏.‏ فشك سلمة فقال لا أدري ذكر الذراعين أم لا ‏.‏",
      "text_en": " It was narrated from Ibn 'Abdur-Rahman bin Abza, from his father, that a man came to 'Umar, may Allah be please with him, and said:                      \"I have become Junub and I cannot find any water.\" 'Umar said: \"Do not pray.\" 'Ammar said: \"Do you not remember, O Commander of the Believers, when you and I were on a campaign and became Junub, and we could not find any water. You did not pray, but I rolled in the dust then prayed. When we came to the Messenger of Allah (ﷺ) I told him about that and he said: 'This would have been sufficient for you,' and then Prophet (ﷺ) struck the earth with his hands then blew on them and wiped his face and hands - (one of the narrators) Salamah was uncertain and said: \"I do not know if he said it should be up to the elbows or just the hands.\" - 'Umar said: \"We will let you bear the burden of what you took upon yourself.\" (One of the narrators) Shu'bah said: \"He used to say the hands, face and forearms.\" (Another) Mansur said to him: \"What are you saying? No one mentions the forearms except you.\" Salamah was not certain and said: \"I do not know whether he mentioned the forearms or not.\"",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "20020",
        "11069",
        "237",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-765",
      "hadith_no": "765",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا قتيبة، قال حدثنا العطاف، عن موسى بن إبراهيم، عن سلمة بن الأكوع، قال قلت يا رسول الله إني لأكون في الصيد وليس على إلا القميص أفأصلي فيه قال ‏\"‏ وزره عليك ولو بشوكة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Al-Akwa said:                      \" I said: 'O Messenger of Allah(ﷺ), I go hunting wearing nothing but a single shirt. Can I pray in it?' He said: 'Fasten it to yourself even with a thorn.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "19046",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-28",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا شعيب بن يوسف، قال أنبأنا عبد الرحمن، عن يعلى بن الحارث، قال سمعت إياس بن سلمة بن الأكوع، يحدث عن أبيه، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الجمعة ثم نرجع وليس للحيطان فىء يستظل به ‏.‏",
      "text_en": " Iyas bin Al-Akwa' narrated that his father said:                     \"We used to  pray jumu'ah with the Messenger of Allah (ﷺ) then we would go back, and the walls had no shadow in which shade could be sought.\"",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-1732",
      "hadith_no": "1732",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وكان يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ويرفع صوته بالثالثة ‏.‏",
      "text_en": " Bahz bin Asad, said:                     \"Shu'bah narrated to us, from Salamah and Zubaid, from Dharr, from Ibn Abdur-Rahman bin Abza from his father that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice the third time.\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-1733",
      "hadith_no": "1733",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن عبد الرحمن، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ثم يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ويرفع ب ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ صوته بالثالثة ‏.‏ رواه منصور عن سلمة بن كهيل ولم يذكر ذرا ‏.‏",
      "text_en": " Khalid said:                     \"Shu'bah narrated to us, he said: Salamah and Zubaid informed me, from Dharr, from Ibn 'Abdur-Rahman bn Abza from Abdur-Rahman, that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with Subhanal-Malikil-Quddus the third time.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "10530"
      ]
    },
    {
      "id": "sunan-an-nasai-1961",
      "hadith_no": "1961",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن المثنى، قالا حدثنا يحيى، قال حدثنا يزيد بن أبي عبيد، قال حدثنا سلمة، - يعني ابن الأكوع - قال أتي النبي صلى الله عليه وسلم بجنازة فقالوا يا نبي الله صل عليها ‏.‏ قال ‏\"‏ هل ترك عليه دينا ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ هل ترك من شىء ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏ ‏.‏ قال رجل من الأنصار يقال له أبو قتادة صل عليه وعلى دينه ‏.‏ فصلى عليه ‏.‏",
      "text_en": " Salamah -  meaning, bin Al-Akwa' - said:                     \"A Janazah was brought to the Prophet and they said: \" O Prophet of Allah, pray for him.' He said: \"Did he leave any debt behind?' They said: \"Yes.' He said 'Did he leave anything?' They said: No. He said; 'Pray fro your companion.' A man among the Ansar who was called Abu Qatadah said: 'Pray for him and I will pay off his debt.' So he prayed for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "30170",
        "20031",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-2133",
      "hadith_no": "2133",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن يزيد، - هو أبو بريد الجرمي بصري - عن بهز، قال حدثنا شعبة، عن سلمة، عن أبي الحكم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل عليه السلام فقال الشهر تسع وعشرون يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet said:                     \"Jibril, peace be upon him, came to me and said: 'The month is twenty-nine days.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "237",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2134",
      "hadith_no": "2134",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، وذكر، كلمة معناها حدثنا شعبة، عن سلمة، قال سمعت أبا الحكم، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'The month is twenty-nine days.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "237",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2316",
      "hadith_no": "2316",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال أنبأنا بكر، - وهو ابن مضر - عن عمرو بن الحارث، عن بكير، عن يزيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال لما نزلت هذه الآية ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين ‏}‏ كان من أراد منا أن يفطر ويفتدي حتى نزلت الآية التي بعدها فنسختها ‏.‏",
      "text_en": " It was narrated that salamah bin Al-Akwa said:                     \"When this verse was revealed 'And as for those who can fast with difficulty, (e.g. an old man), they have (a choice either to fast or) to feed a miskin (poor person) (for every day). Those among us who did not want to fast would pay the fidyah, until the verse after it was revealed and abrogated this.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-2321",
      "hadith_no": "2321",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن يزيد، قال حدثنا سلمة، أن رسول الله صلى الله عليه وسلم قال لرجل ‏\"‏ أذن - يوم عاشوراء - من كان أكل فليتم بقية يومه ومن لم يكن أكل فليصم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Yazid said:                     \"Salamah told us that the Messenger of Allah said to a man: 'Announce the day of Ashura. Whoever has eaten let him not eat for the rest of the day, and whoever has not eaten, let him fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "20472",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-2956",
      "hadith_no": "2956",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن سلمة، قال سمعت مسلما البطين، عن سعيد بن جبير، عن ابن عباس، قال كانت المرأة تطوف بالبيت وهي عريانة تقول اليوم يبدو بعضه أو كله وما بدا منه فلا أحله قال فنزلت ‏{‏ يا بني آدم خذوا زينتكم عند كل مسجد ‏}‏ ‏.‏",
      "text_en": " It was narrated from Saeed bin Jubair that Ibn Abbas said:                     \"Women used to circumambulate the Kabah naked, saying: 'Today some, or all of it will appearAnd whatever appers I don't make is permissible.'Then the following was revealed:'O Children of Adam! Take your adornment to every Masjid.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "237",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3030",
      "hadith_no": "3030",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو نعيم، قال حدثنا سفيان، عن سلمة، عن سعيد بن جبير، عن ابن عمر، قال صلى رسول الله صلى الله عليه وسلم المغرب والعشاء بجمع بإقامة واحدة ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"The Messenger of Allah prayed Maghrib and Isha in Jam (Al-Muzdalifah) with one Iqamah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20348",
        "20012",
        "237",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3150",
      "hadith_no": "3150",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن سواد، قال أنبأنا ابن وهب، قال أخبرنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن، وعبد الله، ابنا كعب بن مالك أن سلمة بن الأكوع، قال لما كان يوم خيبر قاتل أخي قتالا شديدا مع رسول الله صلى الله عليه وسلم فارتد عليه سيفه فقتله فقال أصحاب رسول الله صلى الله عليه وسلم في ذلك وشكوا فيه رجل مات بسلاحه قال سلمة فقفل رسول الله صلى الله عليه وسلم من خيبر فقلت يا رسول الله أتأذن لي أن أرتجز بك فأذن له رسول الله صلى الله عليه وسلم فقال عمر بن الخطاب رضى الله عنه اعلم ما تقول فقلت والله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدقت ‏\"‏ ‏.‏ فأنزلن سكينة علينا وثبت الأقدام إن لاقينا والمشركون قد بغوا علينا فلما قضيت رجزي قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال هذا ‏\"‏ ‏.‏ قلت أخي ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ فقلت يا رسول الله والله إن ناسا ليهابون الصلاة عليه يقولون رجل مات بسلاحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ مات جاهدا مجاهدا ‏\"‏ ‏.‏ قال ابن شهاب ثم سألت ابنا لسلمة بن الأكوع فحدثني عن أبيه مثل ذلك غير أنه قال حين قلت إن ناسا ليهابون الصلاة عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذبوا مات جاهدا مجاهدا فله أجره مرتين ‏\"‏ ‏.‏ وأشار بأصبعيه ‏.‏",
      "text_en": " Salamah bin Al-Akwa' said:                      \"On the day of Khaibar, my brother fought fiercely alongside the Messenger of Allah (ﷺ), then his sword recoiled upon him and killed him. The Companions of the Messenger of Allah (ﷺ), complaining about that, said: 'A man has died by his own weapon.'\" Salamah said: \"The Messenger of Allah (ﷺ) returned from Khaibar and I said: 'O Messenger of Allah, do you permit me to recite some lines of Rajaz verse to you?' The Messenger of Allah (ﷺ) gave him permission but 'Umar bin Al-Khattab, may Allah be pleased with him, said: \"Think what you are saying.\" \"I said:'By Allah, if Allah had not guided us we would not have been guided We would not have given in charity nor prayed' The Messenger of Allah (ﷺ) said: 'You have spoken the truth.' (I continued:) 'Send down tranquility upon us, And make us steadfast when we meet the enemy. For the idolators have transgressed against us.' When I completed my Rajaz verse, the Messenger of Allah (ﷺ) said: 'Who said that?' I said: 'My brother.' The Messenger of Allah (ﷺ) said: 'May Allah have mercy on him.' I said: 'O Messenger of Allah, some people are afraid to offer the (funeral) prayer for him, and they are saying that he is a man who died by his own weapon.' The Messenger of Allah (ﷺ) said: 'He died striving as a Mujahid.'\" Ibn Shihab said: \"Then I asked a son of Salamah bin Al-Akwa', and he narrated a similar report to me from his father, except that he said: 'When I said: Some people are afraid to offer the (funeral) prayer for him, the Messenger of Allah (ﷺ) said: They lied. He died striving as Mujahid, and he will have a twofold reward, and he gestured with two of his fingers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-3349",
      "hadith_no": "3349",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا علي بن حجر بن إياس بن مقاتل بن مشمرخ بن خالد، قال حدثنا إسماعيل بن إبراهيم، عن أيوب، وابن، عون وسلمة بن علقمة وهشام بن حسان - دخل حديث بعضهم في بعض - عن محمد بن سيرين، قال سلمة عن ابن سيرين، نبئت عن أبي العجفاء، - وقال الآخرون عن محمد بن سيرين، عن أبي العجفاء، - قال قال عمر بن الخطاب ألا لا تغلوا صدق النساء فإنه لو كان مكرمة في الدنيا أو تقوى عند الله عز وجل كان أولاكم به النبي صلى الله عليه وسلم ما أصدق رسول الله صلى الله عليه وسلم امرأة من نسائه ولا أصدقت امرأة من بناته أكثر من ثنتى عشرة أوقية وإن الرجل ليغلي بصدقة امرأته حتى يكون لها عداوة في نفسه وحتى يقول كلفت لكم علق القربة وكنت غلاما عربيا مولدا فلم أدر ما علق القربة قال وأخرى يقولونها لمن قتل في مغازيكم أو مات قتل فلان شهيدا أو مات فلان شهيدا ولعله أن يكون قد أوقر عجز دابته أو دف راحلته ذهبا أو ورقا يطلب التجارة فلا تقولوا ذاكم ولكن قولوا كما قال النبي صلى الله عليه وسلم ‏\"‏ من قتل في سبيل الله أو مات فهو في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-'Ajfa' said:                      \"Umar bin Al-Khattab said: 'Do not go to extremes with regard to the dowries of women, for if that were a sign of honor and dignity in this world, or a sign of piety before Allah, the Mighty and Sublime, then Muhammad would have done that before you. But he did not give any of his wives, and none of his daughters were given, more than twelve Uqiyyah. A man may increase the dowry until he feels resentment against her and says: You cost me everything I own ('Alaqul-Qirbah)'\" \"And I was a man born among the 'Arabs, but I did not know the meaning of 'Alaqul-Qirbah' and others of you are saying -about those killed in this or that battle of yours, or who died: 'So-and-so was martyred' or 'so and so died as a martyr.' While perhaps he merely overloaded the backside of his beast, or lined his saddle with gold or silver seeking trade. So do not say that, rather say as the Prophet said: 'Whoever is killed in the cause of Allah, or dies, then he is in Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11035",
        "237",
        "11035"
      ]
    },
    {
      "id": "sunan-an-nasai-3404",
      "hadith_no": "3404",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سلمة، عن الشعبي، عن فاطمة بنت قيس، عن النبي صلى الله عليه وسلم ‏\"‏ المطلقة ثلاثا ليس لها سكنى ولا نفقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Fatimah bint Qais that the Prophet said:                      \"The thrice-divorced woman is not entitled to provision and shelter.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "237",
        "11052",
        "224"
      ]
    },
    {
      "id": "sunan-an-nasai-4186",
      "hadith_no": "4186",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك وذكر كلمة معناها وبدوت ‏.‏ قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو ‏.‏",
      "text_en": " It was narrated from Salamah bin Al-Akwa ' that he entered upon Al-Hajjaj who said:                     O son of Al-Akwa, you have turned on your heels (i.e., deserted Islam) by staying in the desert with the Bedouins.\" He said: \"No; the Messenger of Allah gave me permission to stay in the desert with the Bedouins.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-472",
      "hadith_no": "472",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الحارث المصري، حدثنا يحيى بن راشد البصري، عن يزيد، مولى سلمة عن سلمة بن الأكوع، قال رأيت رسول الله  صلى الله عليه وسلم  توضأ فمسح رأسه مرة ‏.‏",
      "text_en": " It was narrated that Salamah bin Akwa' said:                     \"I saw the Messenger of Allah performing ablution, and he wiped his head once.\"",
      "usc_msa_ref": "",
      "chain": [
        "24490",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-688-2",
      "hadith_no": "688",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه كان يصلي مع النبي  صلى الله عليه وسلم  المغرب إذا توارت بالحجاب ‏.‏",
      "text_en": " It was narrated from Salamah bin Akwa' that:                     He used to pray the Maghrib with the Messenger of Allah when the sun set.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-973",
      "hadith_no": "973",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الحارث المصري، حدثنا يحيى بن راشد، عن يزيد، مولى سلمة عن سلمة بن الأكوع، قال رأيت رسول الله  صلى الله عليه وسلم  صلى فسلم مرة واحدة ‏.‏",
      "text_en": " It wasnarrated that Salamah bin Akwa’ said:                      “I saw the Messenger ofAllah (ﷺ) performing the prayer, and he said one Salam.”",
      "usc_msa_ref": "",
      "chain": [
        "24490",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-1154",
      "hadith_no": "1154",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا يعلى بن الحارث، قال سمعت إياس بن سلمة بن الأكوع، عن أبيه، قال كنا نصلي مع النبي  صلى الله عليه وسلم  الجمعة ثم نرجع فلا نرى للحيطان فيئا نستظل به ‏.‏",
      "text_en": " Iyas binSalamah bin Akwa’ narrated that his father said:                      “We used toperform Friday (prayer) with the Prophet (ﷺ), then we would return,and we would not see any shadow from the walls in which we could seekshade.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-1497",
      "hadith_no": "1497",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن المخزومي، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه كان يأتي إلى سبحة الضحى فيعمد إلى الأسطوانة دون المصحف فيصلي قريبا منها فأقول له ألا تصلي ها هنا وأشير إلى بعض نواحي المسجد فيقول إني رأيت رسول الله  صلى الله عليه وسلم  يتحرى هذا المقام ‏.‏",
      "text_en": " It wasnarrated from Yazid bin Abu ‘Ubaid that Salamah bin Al-Akwa’usedto offer the Duha prayer, and he would come to the pillar thatwasnear the Mushaf. I said to him:                      “Why do you not pray over there?”And I pointed to some corner of the mosque. He said: “I saw theMessenger of Allah (ﷺ) seeking out this place.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "11034",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-1763",
      "hadith_no": "1763",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا زمعة بن صالح، عن سلمة، عن عكرمة، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ استعينوا بطعام السحر على صيام النهار وبالقيلولة على قيام الليل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “Seekhelpby eating Suhur for fasting that day, and by taking a brief rest(atmidday) for praying at night.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "10636",
        "237",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2943",
      "hadith_no": "2943",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا أبو العميس، وعكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال بارزت رجلا فقتلته فنفلني رسول الله صلى الله عليه وسلم سلبه ‏.‏",
      "text_en": " It wasnarrated from Iyas bin Salamah bin Akwa’ that his father said:                     “Ifought a man and killed him, and the Messenger of Allah (ﷺ)awardedme his spoils.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20342",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-2947",
      "hadith_no": "2947",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل، أنبأنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال غزونا مع أبي بكر هوازن على عهد النبي صلى الله عليه وسلم فأتينا ماء لبني فزارة فعرسنا حتى إذا كان عند الصبح شنناها عليهم غارة فأتينا أهل ماء فبيتناهم فقتلناهم تسعة أو سبعة أبيات ‏.‏",
      "text_en": " It wasnarrated from Iyas bin Salamah bin Awka’, that his fathersaid:                      “Weattacked Hawazin, with Abu Bakr, during the time of theProphet(ﷺ), and we arrived at an oasis belonging to Bani Fazarahduringthe last part of the night. We attacked at dawn, raiding thepeopleof the oasis, and killed them, nine or seven households.”",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-2954",
      "hadith_no": "2954",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال غزونا مع أبي بكر هوازن على عهد رسول الله صلى الله عليه وسلم فنفلني جارية من بني فزارة من أجمل العرب عليها قشع لها فما كشفت لها عن ثوب حتى أتيت المدينة فلقيني النبي صلى الله عليه وسلم في السوق فقال ‏\"‏ لله أبوك هبها لي ‏\"‏ ‏.‏ فوهبتها له فبعث بها ففادى بها أسارى من أسارى المسلمين كانوا بمكة ‏.‏",
      "text_en": " It wasnarrated from Ayas bin Salamah bin Akwa’ that his father said:                     “Weattacked, Hawazin at the time of the Messenger of Allah (ﷺ) withAby Bakr. He awarded me a slave girl from Banu Fazarah, among themostbeautiful of the Arabs, who was wearing an animal skin of hers.I didnot divest her of her clothing until I reached Al-Madinah. ThentheProphet (ﷺ) met me in the marketplace, and said: ‘By Alla,give herto me.’ So I gave her to him, and he sent her as a ransomfor some ofthe Muslim prisoners who were in Makkah.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "34188",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-3316",
      "hadith_no": "3316",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزونا مع رسول الله  صلى الله عليه وسلم  غزوة خيبر فأمسى الناس قد أوقدوا النيران فقال النبي  صلى الله عليه وسلم  ‏\"‏ علام توقدون ‏\"‏ ‏.‏ قالوا على لحوم الحمر الإنسية فقال ‏\"‏ أهريقوا ما فيها واكسروها ‏\"‏ ‏.‏ فقال رجل من القوم أو نهريق ما فيها ونغسلها فقال النبي  صلى الله عليه وسلم  ‏\"‏ أو ذاك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salamah bin Akwa’ said:                      “We went out with theMessenger of Allah (ﷺ) on the campaign of Khaibar, and in theevening the people lit their fires. The Prophet (ﷺ) said: ‘Whatareyou cooking?’ They said: ‘The meat of domesticated donkeys.’He said:‘Throw out what is in them (the pots) and break them.’ Aman said: ‘Orcan we throw out what is in them and wash them?’The Prophet (ﷺ)said: ‘Or (do) that.’”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-3667",
      "hadith_no": "3667",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن سلمة، عن عيسى بن عاصم، عن زر، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الطيرة شرك وما منا إلا ولكن الله يذهبه بالتوكل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                     “The omen is polytheistic deed and anyone of us may think heseesan omen but Allah will dispel it by means of relying upon Him.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "237",
        "15436",
        "11337",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-3714-2",
      "hadith_no": "3714",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يشمت العاطس ثلاثا فما زاد فهو مزكوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ilyas bin Salamah bin Akwa' that his father said:                     \"The Messenger of Allah(ﷺ) said: 'The one who sneezes may be responded to three times; if he sneezes more than that, he has a cold.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    }
  ],
  "total_hadiths": 117
}