{
  "id": "239",
  "name": "Thabit bin Qays b. Shammas ( ثابت بن قيس بن الشماس الأنصاري ( رضي الله عنه",
  "full_name": "Thabit bin Qays b. Shammas ( ثابت بن قيس بن الشماس الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "12",
      "date_gregorian": "634",
      "date_display": null,
      "place": "Medinah, Yamamah",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خ  د  س  -  صحابة ]",
      "Preacher"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.al-Harith B.al-Khazraj",
      "Khateeb",
      "Uhud",
      "Khandaq",
      "Ridwan",
      "Scribe"
    ]
  },
  "parents": [
    {
      "id": "290",
      "name": "Kabsha bint Waqid bin 'Amr ( كبشة بنت واقد بن عمرو الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "286",
      "name": "Jamila bint 'Abdullah ibn Ubayy ( جميلة بنت عبد الله بن أبي بن سلول ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1264",
      "name": "Habiba bint Sahl bin Tha'laba ( حبيبة بنت سهل بن ثعلبة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "287",
      "name": "Zaynab bint Qays b. Shammas ( زينب بنت قيس بن شماس الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "289",
      "name": "Umm Thabit bint Qays b. Shammas ( أم ثابت بنت قيس بن شماس الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "291",
      "name": "Muhammad bin Thabit ibn Qays b. Shammas ( محمد بن ثابت بن قيس بن شماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "292",
      "name": "Zaynab bint Thabit ibn Qays b. Shammas ( زينب بنت ثابت بن قيس بن شماس الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "293",
      "name": "'Abdullah bin Thabit ibn Qays b. Shammas ( عبد الله بن ثابت بن قيس بن شماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "294",
      "name": "'Abdur Rahman bin Thabit ibn Qays ( عبد الرحمن بن ثابت بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "295",
      "name": "Yahya bin Thabit ibn Qays ( يحيى بن ثابت بن قيس بن شماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "291",
      "name": "Muhammad bin Thabit ibn Qays b. Shammas ( محمد بن ثابت بن قيس بن شماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "292",
      "name": "Zaynab bint Thabit ibn Qays b. Shammas ( زينب بنت ثابت بن قيس بن شماس الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "293",
      "name": "'Abdullah bin Thabit ibn Qays b. Shammas ( عبد الله بن ثابت بن قيس بن شماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "294",
      "name": "'Abdur Rahman bin Thabit ibn Qays ( عبد الرحمن بن ثابت بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "295",
      "name": "Yahya bin Thabit ibn Qays ( يحيى بن ثابت بن قيس بن شماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا قطن بن نسير، حدثنا جعفر بن سليمان، حدثنا ثابت، عن أنس بن مالك، قال كان ثابت بن قيس بن شماس خطيب الأنصار فلما نزلت هذه الآية ‏.‏ بنحو حديث حماد ‏.‏ وليس في حديثه ذكر سعد بن معاذ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik by another chain of transmitters in which these words are found:                      Thabit b. Qais was the orator of the Ansar, when this verse was revealed: the rest of the hadith is the same with the exception that there is no mention of Sa'd b. Mu'adh in it. This hadith is also transmitted by Ahmad b. Sa'id, Habban, Sulaiman b. Mughira on the authority of Anas who said: When the verse was revealed:\" Do not raise your voice louder than the voice of the Apostle,\" no mention was made of Sa'd b, Mu'adh in it.",
      "chain": [
        "30444",
        "20532",
        "11269",
        "19",
        "239"
      ]
    },
    {
      "hadith_no": "5097",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن محمد المروزي، وسلمة، - يعني ابن شبيب - قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال حدثني ثابت بن قيس، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الريح من روح الله ‏\"‏ ‏.‏ قال سلمة فروح الله تأتي بالرحمة وتأتي بالعذاب فإذا رأيتموها فلا تسبوها وسلوا الله خيرها واستعيذوا بالله من شرها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I heard the Messenger of Allah (ﷺ) say: The wind comes from Allah's mercy. Salamah's version has: It is Allah's mercy; it (sometimes) brings blessing and (sometimes) brings punishment. So when you see it, do not revile it, but ask Allah for some of its good, and seek refuge in Allah from its evil.",
      "chain": [
        "30304",
        "30417",
        "20121",
        "20115",
        "11013",
        "239",
        "13"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عمر بن حفص، قال حدثنا أبي ح، وأنبأنا إبراهيم بن يعقوب، قال حدثنا يحيى بن معين، قال حدثنا حفص، ح وأنبأنا عمرو بن منصور، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن الحسن بن عبيد الله، عن إبراهيم، عن يزيد بن أوس، عن ثابت بن قيس، عن أبي موسى، يرفعه قال ‏\"‏ أبردوا بالظهر فإن الذي تجدون من الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa in a Marfu' [1] report:                      \"Wait until it cools down to pray Zuhr, for the heat you experience is a breeze from Hell.\"[1] Meaning he attributed it to the Prophet (ﷺ).",
      "chain": [
        "38088",
        "30204",
        "20317",
        "38088",
        "30020",
        "20317",
        "38433",
        "30204",
        "20317",
        "10755",
        "11051",
        "15634",
        "239"
      ]
    },
    {
      "hadith_no": "2357",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن علي، عن عبد الرحمن، قال حدثنا ثابت بن قيس أبو الغصن، - شيخ من أهل المدينة - قال حدثني أبو سعيد المقبري، قال حدثني أسامة بن زيد، قال قلت يا رسول الله لم أرك تصوم شهرا من الشهور ما تصوم من شعبان ‏.‏ قال ‏\"‏ ذلك شهر يغفل الناس عنه بين رجب ورمضان وهو شهر ترفع فيه الأعمال إلى رب العالمين فأحب أن يرفع عملي وأنا صائم ‏\"‏ ‏.‏",
      "text_en": " Usamah bin Zaid said:                     \"I said: 'O Messenger of Allah, I do not see you fasting any month as much as Shaban.' He said: 'That is a month to which people do not pay much attention, between Rajab and Ramadan. It is a month in which the deeds are taken up to the Lord of the worlds, and I like that my deeds be taken up when I am fasting.\"'",
      "chain": [
        "30153",
        "20033",
        "239",
        "11212",
        "50"
      ]
    },
    {
      "hadith_no": "2358",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن علي، عن عبد الرحمن، قال حدثنا ثابت بن قيس أبو الغصن، - شيخ من أهل المدينة - قال حدثني أبو سعيد المقبري، قال حدثني أسامة بن زيد، قال قلت يا رسول الله إنك تصوم حتى لا تكاد تفطر وتفطر حتى لا تكاد أن تصوم إلا يومين إن دخلا في صيامك وإلا صمتهما ‏.‏ قال ‏\"‏ أى يومين ‏\"‏ ‏.‏ قلت يوم الاثنين ويوم الخميس ‏.‏ قال ‏\"‏ ذانك يومان تعرض فيهما الأعمال على رب العالمين فأحب أن يعرض عملي وأنا صائم ‏\"‏ ‏.‏",
      "text_en": " Usamah bin Zaid said:                     \"I said: 'O Messenger of Allah, sometimes you fast, and you hardly ever break your hardly ever fast, except two days which, if you are fasting, you include them in your fast, and if you are not fasting, then you fast them on your own.' He said: 'Which two days?' I said: 'Monday and Thursday.' He said: 'Those are two days in which deeds are shown to the Lord of the worlds, and I like my deeds to be shown (to Him) when I am fasting.\"'",
      "chain": [
        "30153",
        "20033",
        "239",
        "11212",
        "50"
      ]
    },
    {
      "hadith_no": "2359",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني ثابت بن قيس الغفاري، قال حدثني أبو سعيد المقبري، قال حدثني أبو هريرة، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم كان يسرد الصوم فيقال لا يفطر ويفطر فيقال لا يصوم ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid:                     That the Messenger of Allah used to fast continually and it ws said that he would not break his fast, and he used not to fast and it was said that he would not fast.",
      "chain": [
        "38022",
        "20650",
        "239",
        "11212",
        "13",
        "50"
      ]
    }
  ],
  "total_hadiths": 6
}