{
  "id": "24039",
  "name": "Bashr bin Nmyr al-Qshyry بشر بن نمير القشيري",
  "full_name": "Bashr bin Nmyr al-Qshyry بشر بن نمير القشيري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Abandoned",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ ق  -  متروك ]"
    ],
    "tags": [
      "al-Qushayri",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28635",
      "name": "Yahya bin al-'Ala al-Bijly يحيى بن العلاء البجلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-ibn-majah-2711",
      "hadith_no": "2711",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا الحسن بن أبي الربيع الجرجاني، أنبأنا عبد الرزاق، أخبرني يحيى بن العلاء، أنه سمع بشر بن نمير، أنه سمع مكحولا، يقول إنه سمع يزيد بن عبد الله، أنه سمع صفوان بن أمية، قال كنا عند رسول الله صلى الله عليه وسلم فجاء عمرو بن قرة فقال يا رسول الله إن الله قد كتب على الشقوة فما أراني أرزق إلا من دفي بكفي فأذن لي في الغناء في غير فاحشة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا آذن لك ولا كرامة ولا نعمة عين كذبت أى عدو الله لقد رزقك الله طيبا حلالا فاخترت ما حرم الله عليك من رزقه مكان ما أحل الله عز وجل لك من حلاله ‏.‏ ولو كنت تقدمت إليك لفعلت بك وفعلت قم عني وتب إلى الله أما إنك إن فعلت بعد التقدمة إليك ضربتك ضربا وجيعا وحلقت رأسك مثلة ونفيتك من أهلك وأحللت سلبك نهبة لفتيان أهل المدينة ‏\"‏ ‏.‏ فقام عمرو وبه من الشر والخزى ما لا يعلمه إلا الله فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ هؤلاء العصاة من مات منهم بغير توبة حشره الله عز وجل يوم القيامة كما كان في الدنيا مخنثا عريانا لا يستتر من الناس بهدبة كلما قام صرع ‏\"‏ ‏.‏",
      "text_en": " Safwan bin Umayyah said:                     “We were with the Messenger of Allah (ﷺ) and Amr bin Murrah came and said: 'O Messenger of Allah (ﷺ), Allah (SWT) has decreed that I be doomed, and He has not guided me to earn a living except by beating my tambourine with my hand; give me permission to sing without doing anything immoral.' The Messenger of Allah (ﷺ) said: 'I will not give you permission, or honor you nor give you, what you want. You are lying, O enemy of Allah. Allah (SWT) has granted you a good, lawful provision, but you have chosen the provision that Allah (SWT) has forbidden to you instead of that which He has permitted. If I had warned you before, I would have done such and such to you. Get away from me and repent to Allah (SWT). If you do that again, after this warning, I will give you a painful beating and shave your head, to make an example of you, and I will banish you from among your people, and tell the young men of Al-Madinah to come and take your goods,'Amr stood up, suffering grief and humiliation that is known only to Allah (SWT).When he went away, the Prophet (ﷺ) said: 'Those sinners, whoever among them dies without having repented, Allah (SWT) will gather him on the Day of Resurrection just as he was in this world, effeminate and naked, with not even a piece of cloth to conceal him from the people. Every time he gets up, he will fall to the ground.'”",
      "usc_msa_ref": "",
      "chain": [
        "20121",
        "28635",
        "24039",
        "11066",
        "11318",
        "449"
      ]
    }
  ],
  "total_hadiths": 1
}