{
  "id": "24050",
  "name": "Jabir bin Sbh جابر بن صبح",
  "full_name": "Jabir bin Sbh جابر بن صبح",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11283",
      "name": "Khalas bin 'Amr al-Hajri خلاس بن عمرو الهجري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "18968",
      "name": "al-Mthna bin 'Abdur Rahman المثنى بن عبد الرحمن الخزاعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19549",
      "name": "Umm Shrahyl أم شراحيل",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28674",
      "name": "Abu al-Jrah أبو الجراح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "269",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن جابر بن صبح، سمعت خلاسا الهجري، قال سمعت عائشة، - رضى الله عنها - تقول كنت أنا ورسول الله، صلى الله عليه وسلم نبيت في الشعار الواحد وأنا حائض طامث فإن أصابه مني شىء غسل مكانه ولم يعده ثم صلى فيه وإن أصاب - تعني ثوبه - منه شىء غسل مكانه ولم يعده ثم صلى فيه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Khallas al-Hujari reported: Aisha said: I and the Messenger of Allah (ﷺ) used to pass night in one (piece of) cloth (on me) while I menstruated profusely. If anything from me (i.e. blood) smeared him (i.e. his body), he would wash that spot and would not exceed it (in washing), then he would offer prayer with it.",
      "chain": [
        "30175",
        "20031",
        "24050",
        "53"
      ]
    },
    {
      "hadith_no": "2166",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن جابر بن صبح، قال سمعت خلاسا الهجري، قال سمعت عائشة، - رضى الله عنها - تقول كنت أنا ورسول الله، صلى الله عليه وسلم نبيت في الشعار الواحد وأنا حائض طامث فإن أصابه مني شىء غسل مكانه ولم يعده وإن أصاب - تعني ثوبه - منه شىء غسل مكانه ولم يعده وصلى فيه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I and the Messenger of Allah (ﷺ) used to lie in one cloth at night while I was menstruating. If anything from me smeared him, he washed the same place (that was smeared), and did not wash beyond it. If anything from him smeared his clothe, he washed the same place and did not wash beyond that, and prayed with it (i.e. the clothe).",
      "chain": [
        "30175",
        "20031",
        "24050",
        "53"
      ]
    },
    {
      "hadith_no": "3768",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا عيسى، - يعني ابن يونس - حدثنا جابر بن صبح، حدثنا المثنى بن عبد الرحمن الخزاعي، عن عمه، أمية بن مخشي - وكان من أصحاب رسول الله صلى الله عليه وسلم - قال كان رسول الله صلى الله عليه وسلم جالسا ورجل يأكل فلم يسم حتى لم يبق من طعامه إلا لقمة فلما رفعها إلى فيه قال بسم الله أوله وآخره فضحك النبي صلى الله عليه وسلم ثم قال ‏\"‏ ما زال الشيطان يأكل معه فلما ذكر اسم الله عز وجل استقاء ما في بطنه ‏\"‏ ‏.‏ قال أبو داود جابر بن صبح جد سليمان بن حرب من قبل أمه ‏.‏",
      "text_en": " Narrated Umayyah ibn Makhshi:                     Umayyah was sitting and a man was eating. He did not mention Allah's name until there remained the last morsel. When he raised it to his mouth, he said: In the name of Allah at the beginning and at the end of it. The Prophet (ﷺ) laughed and said: The devil kept eating along with him, but when he mentioned Allah's name, he vomited what was in his belly.Abu Dawud: Jabir bin Subh is grandfather of Sulaiman bin Harb from his mother's side.",
      "chain": [
        "38659",
        "20347",
        "24050"
      ]
    },
    {
      "hadith_no": "4102",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، ويعقوب بن إبراهيم، وغير، واحد، قالوا أخبرنا أبو عاصم، عن أبي الجراح، حدثني جابر بن صبح، قال حدثتني أم شراحيل، قالت حدثتني أم عطية، قالت بعث النبي صلى الله عليه وسلم جيشا فيهم علي ‏.‏ قالت فسمعت النبي صلى الله عليه وسلم وهو رافع يديه يقول ‏\"‏ اللهم لا تمتني حتى تريني عليا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm 'Atiyyah:                     \"The Prophet (ﷺ) sent an army in which was 'Ali.\" She said: \"While he was raising his hands, I heard the Messenger of Allah (ﷺ) saying: 'O Allah! Do not cause me to die until You allow me to see 'Ali.\"",
      "chain": [
        "30160",
        "20184",
        "20241",
        "24050",
        "19549",
        "71"
      ]
    },
    {
      "hadith_no": "286",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، عن جابر بن صبح، قال سمعت خلاسا، يحدث عن عائشة، قالت كنت أنا ورسول الله، صلى الله عليه وسلم نبيت في الشعار الواحد وأنا طامث أو حائض فإن أصابه مني شىء غسل مكانه ولم يعده وصلى فيه ثم يعود فإن أصابه مني شىء فعل مثل ذلك ولم يعده وصلى فيه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) and I would sleep under a single blanket when I was menstruating. If anything got on him from me, he would wash that spot and no more, and pray in it, then come back. If anything got on it again from me, he would do likewise and no more, and he would pray in it.\"",
      "chain": [
        "30170",
        "20031",
        "24050",
        "11283",
        "53"
      ]
    },
    {
      "hadith_no": "372",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن جابر بن صبح، قال سمعت خلاسا، يحدث عن عائشة، قالت كنت أنا ورسول الله، صلى الله عليه وسلم نبيت في الشعار الواحد وأنا طامث حائض فإن أصابه مني شىء غسل مكانه لم يعده ثم صلى فيه ثم يعود فإن أصابه مني شىء فعل مثل ذلك غسل مكانه لم يعده وصلى فيه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) and I would sleep under a single blanket when I was menstruating. If anything got on him from me, he would wash that spot and no more, and pray in it, then come back. If anything got on it again from me, he would do likewise and no more, and he would pray in it.\"",
      "chain": [
        "30170",
        "20031",
        "24050",
        "11283",
        "53"
      ]
    },
    {
      "hadith_no": "773",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا هشام بن عبد الملك، قال حدثنا يحيى بن سعيد، قال حدثنا جابر بن صبح، قال سمعت خلاس بن عمرو، يقول سمعت عائشة، تقول كنت أنا ورسول الله، صلى الله عليه وسلم أبو القاسم في الشعار الواحد وأنا حائض، طامث فإن أصابه مني شىء غسل ما أصابه لم يعده إلى غيره وصلى فيه ثم يعود معي فإن أصابه مني شىء فعل مثل ذلك لم يعده إلى غيره ‏.‏",
      "text_en": " Khilas bin 'Amr said:                      \"I heard Aisha (ra) say: 'The Messenger of Allah (ﷺ), Abii Al-Qbim, and I were beneath a single blanket, andI was menstruating. If something got on him from me, he would wash whatever had got on him and he did not wash anywhere else, and he prayed in it then came back to me.And if anything got on him from me,he would do exactly the same and hedid not wash anywhere else.\"'",
      "chain": [
        "38433",
        "20031",
        "24050",
        "11283"
      ]
    }
  ],
  "total_hadiths": 7
}