{
  "id": "24124",
  "name": "Da'ud bin al-Zbrqan al-Rqashy داود بن الزبرقان الرقاشي",
  "full_name": "Da'ud bin al-Zbrqan al-Rqashy داود بن الزبرقان الرقاشي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Abandoned",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ ت  ق  -  متروك ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-3512",
      "hadith_no": "3512",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا داود بن الزبرقان، عن داود بن أبي هند، عن الشعبي، عن عائشة، رضى الله عنها قالت لو كان رسول الله صلى الله عليه وسلم كاتما شيئا من الوحى لكتم هذه الآية ‏:‏ ‏(‏ إذ تقول للذي أنعم الله عليه ‏)‏ يعني بالإسلام ‏:‏ ‏(‏ وأنعمت عليه ‏)‏ بالعتق فأعتقته ‏:‏ ‏(‏ أمسك عليك زوجك واتق الله وتخفي في نفسك ما الله مبديه وتخشى الناس والله أحق أن تخشاه ‏)‏ إلى قوله ‏:‏ ‏(‏وكان أمر الله مفعولا ‏)‏ وإن رسول الله صلى الله عليه وسلم لما تزوجها قالوا تزوج حليلة ابنه فأنزل الله تعالى ‏:‏ ‏(‏ ما كان محمد أبا أحد من رجالكم ولكن رسول الله وخاتم النبيين ‏)‏ وكان رسول الله صلى الله عليه وسلم تبناه وهو صغير فلبث حتى صار رجلا يقال له زيد بن محمد فأنزل الله ‏:‏ ‏(‏ ادعوهم لآبائهم هو أقسط عند الله فإن لم تعلموا آباءهم فإخوانكم في الدين ومواليكم ‏)‏ فلان مولى فلان وفلان أخو فلان  ‏(‏هو أقسط عند الله ‏)‏ يعني أعدل عند الله ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated 'Aishah [may Allah be pleased with her]:                     \"If the Messenger of Allah (ﷺ) was to have concealed anything that was revealed to him, then he would have concealed these Ayat: 'When you said to him on whom Allah has bestowed grace (meaning by Islam); and you have done a favor (meaning that he was a slave and you freed him) \"Keep your wife to yourself, and have Taqwa of Allah.\" But you did hide in yourself that which Allah will make manifest, you did fear the people whereas Allah had better right that you should fear Him' up to His saying: 'And Allah's command must be fulfilled (33:37).' They said: 'He married his wife's son, so Allah revealed: 'Muhammad is not the father of any of your men, but he is the Messenger of Allah and the Last of the Prophets (33:40).' The Messenger of Allah (ﷺ) had taken (adopted) him as a son when he was small, and he remained being called 'Zaid bin Muhammad' until he grew up to adulthood, then Allah revealed: 'Call them by their fathers, then your brothers in religion and your Mawali (33:5). (Say) So-and-so, the Mawla of so-and-so, and; So-and-so, the brother of so-and-so. 'That is more just with Allah' meaning that doing that is more just to Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "24124",
        "11585",
        "11052",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3470-2",
      "hadith_no": "3470",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسماعيل بن موسى الكوفي، حدثنا داود بن الزبرقان، عن مطر الوراق، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ذات يوم لأصحابه ‏\"‏ قولوا سبحان الله وبحمده مائة مرة من قالها مرة كتبت له عشرا ومن قالها عشرا كتبت له مائة ومن قالها مائة كتبت له ألفا ومن زاد زاده الله ومن استغفر غفر الله له ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Ibn Umar narrated that one say, :                     The Messenger of Allah said to his Companions: “Say; ‘Glory is to Allah and with His Praise (Subhan Allah, Wa Bihamdih)’ a hundred times. Whoever says [it] one time, it is written for him ten, and whoever says it ten (times), it is written for him a hundred, and whoever says it a hundred (times), it is written for him a thousand, and whoever increases, Allah will increased for him, and whoever seeks Allah’s forgiveness, [Allah] will forgive him.”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "24124",
        "10719",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-234",
      "hadith_no": "234",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا داود بن الزبرقان، عن بكر بن خنيس، عن عبد الرحمن بن زياد، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال خرج رسول الله  صلى الله عليه وسلم  ذات يوم من بعض حجره فدخل المسجد فإذا هو بحلقتين إحداهما يقرءون القرآن ويدعون الله والأخرى يتعلمون ويعلمون فقال النبي  صلى الله عليه وسلم  ‏\"‏ كل على خير هؤلاء يقرءون القرآن ويدعون الله فإن شاء أعطاهم وإن شاء منعهم وهؤلاء يتعلمون ويعلمون وإنما بعثت معلما ‏\"‏ ‏.‏ فجلس معهم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah came out of one of his apartments one day and entered the mosque, where he saw two circles, one reciting Qur'an and supplicating to Allah, and the other learning and teaching. The Prophet said: 'Both of them are good. These people are reciting the Qur'an and supplicating to Allah, and if He wills He will give them, and if He wills He will withhold from them. And these people are learning and teaching. Verily I have been sent as a teacher.' Then he sat down with them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30537",
        "24124",
        "25031",
        "28326",
        "1945",
        "29"
      ]
    }
  ],
  "total_hadiths": 3
}