{
  "id": "24131",
  "name": "Rabi' bin 'Alayya ربعي بن علية أبو الحسن",
  "full_name": "Rabi' bin 'Alayya ربعي بن علية أبو الحسن",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "197",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  قد  ت  -  ثقة ]"
    ],
    "tags": [
      "al-Asadi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11876",
      "name": "'Abdur Rahman bin Ishaq عبد الرحمن بن إسحاق بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30430",
      "name": "Hameed bin Musa'da bin al-Mubarak حميد بن مسعدة بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36523",
      "name": "Ishaq bin Abi Isra'il Kamjar إسحاق بن أبي إسرائيل كامجر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2397",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة، أن عائشة  رضى الله عنها  أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في الصلاة ويقول ‏\"‏ اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏‏.‏ فقال له قائل ما أكثر ما تستعيذ يا رسول الله من المغرم قال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all sins, and from being in debt.\" Someone said, O Allah's Apostle! (I see you) very often you seek refuge with Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and breaks his promises when he promises.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2807",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثني إسماعيل، قال حدثني أخي، عن سليمان، أراه عن محمد بن أبي عتيق، عن ابن شهاب، عن خارجة بن زيد، أن زيد بن ثابت  رضى الله عنه  قال نسخت الصحف في المصاحف، ففقدت آية من سورة الأحزاب، كنت أسمع رسول الله صلى الله عليه وسلم يقرأ بها، فلم أجدها إلا مع خزيمة بن ثابت الأنصاري الذي جعل رسول الله صلى الله عليه وسلم شهادته شهادة رجلين، وهو قوله ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏}‏",
      "text_en": " Narrated Kharija bin Zaid:                     Zaid bin Thabit said, \"When the Qur'an was compiled from various written manuscripts, one of the Verses of Surat Al-Ahzab was missing which I used to hear Allah's Apostle reciting. I could not find it except with Khuza`ima bin Thabjt Al-Ansari, whose witness Allah's Apostle regarded as equal to the witness of two men. And the Verse was:-- \"Among the believers are men who have been true to what they covenanted with Allah.\" (33.23)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "49"
      ]
    },
    {
      "hadith_no": "6222",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، أنه سمع حسان بن ثابت الأنصاري، يستشهد أبا هريرة فيقول يا أبا هريرة نشدتك بالله هل سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يا حسان أجب عن رسول الله، اللهم أيده بروح القدس ‏\"‏‏.‏ قال أبو هريرة نعم‏.‏",
      "text_en": " Narrated Abu Salama bin `Abdur-Rahman bin `Auf:                     that he heard Hassan bin Thabit Al-Ansari asking the witness of Abu Huraira, saying, \"O Abu- Huraira! I beseech you by Allah (to tell me). Did you hear Allah's Apostle saying' 'O Hassan ! Reply on behalf of Allah's Apostle. O Allah ! Support him (Hassan) with the Holy Spirit (Gabriel).'?\" Abu Huraira said, \"Yes.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10567",
        "452"
      ]
    },
    {
      "hadith_no": "6278",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة بن الزبير، أن أسامة بن زيد  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم ركب على حمار عليه قطيفة فدكية وأسامة وراءه، يعود سعد بن عبادة في بني حارث بن الخزرج قبل وقعة بدر، فسارا حتى مرا بمجلس فيه عبد الله بن أبى ابن سلول، وذلك قبل أن يسلم عبد الله بن أبى، فإذا في المجلس أخلاط من المسلمين والمشركين عبدة الأوثان واليهود، وفي المسلمين عبد الله بن رواحة، فلما غشيت المجلس عجاجة الدابة خمر ابن أبى أنفه بردائه وقال لا تغبروا علينا‏.‏ فسلم رسول الله صلى الله عليه وسلم عليهم، ثم وقف فنزل فدعاهم إلى الله وقرأ عليهم القرآن، فقال له عبد الله بن أبى ابن سلول أيها المرء لا أحسن مما تقول إن كان حقا، فلا تؤذنا به في مجالسنا، فمن جاءك فاقصص عليه‏.‏ قال عبد الله بن رواحة بلى يا رسول الله فاغشنا في مجالسنا فإنا نحب ذلك‏.‏ فاستب المسلمون والمشركون واليهود حتى كادوا يتثاورون فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا، ثم ركب رسول الله صلى الله عليه وسلم دابته فسار حتى دخل على سعد بن عبادة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أى سعد ألم تسمع ما قال أبو حباب  يريد عبد الله بن أبى  قال كذا وكذا ‏\"‏‏.‏ فقال سعد بن عبادة أى رسول الله بأبي أنت، اعف عنه واصفح، فوالذي أنزل عليك الكتاب لقد جاء الله بالحق الذي أنزل عليك، ولقد اصطلح أهل هذه البحرة على أن يتوجوه ويعصبوه بالعصابة، فلما رد الله ذلك بالحق الذي أعطاك شرق بذلك فذلك فعل به ما رأيت‏.‏ فعفا عنه رسول الله صلى الله عليه وسلم وكان رسول الله صلى الله عليه وسلم وأصحابه يعفون عن المشركين وأهل الكتاب كما أمرهم الله، ويصبرون على الأذى، قال الله تعالى ‏{‏ولتسمعن من الذين أوتوا الكتاب‏}‏ الآية، وقال ‏{‏ود كثير من أهل الكتاب‏}‏ فكان رسول الله صلى الله عليه وسلم يتأول في العفو عنهم ما أمره الله به حتى أذن له فيهم، فلما غزا رسول الله صلى الله عليه وسلم بدرا، فقتل الله بها من قتل من صناديد الكفار، وسادة قريش، فقفل رسول الله صلى الله عليه وسلم وأصحابه منصورين غانمين معهم أسارى من صناديد الكفار وسادة قريش قال ابن أبى ابن سلول، ومن معه من المشركين عبدة الأوثان هذا أمر قد توجه فبايعوا رسول الله صلى الله عليه وسلم على الإسلام فأسلموا‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     That Allah's Apostle rode over a donkey covered with a Fadakiya (velvet sheet) and Usama was riding behind him. He was visiting Sa`d bin 'Ubada (who was sick) in the dwelling place of Bani Al-Harith bin Al-Khazraj and this incident happened before the battle of Badr. They proceeded till they passed by a gathering in which `Abdullah bin Ubai bin Salul was present., and that was before `Abdullah bin Ubat embraced Islam. In that gathering there were Muslims, pagan idolators and Jews, and among the Muslims there was `Abdullah bin Rawaha. When a cloud of dust raised by (the movement of ) the animal covered that gathering, `Abdullah bin Ubai covered his nose with his garment and said, \"Do not cover us with dust.\" Allah's Apostle greeted them, stopped, dismounted and invited them to Allah (i.e. to embrace Islam) and recited to them the Holy Qur'an. On that `Abdullah bin Ubai bin Salul said to him, \"O man! There is nothing better than what you say, if it is the truth. So do not trouble us with it in our gatherings, but if somebody comes to you, you can preach to him.\" On that `Abdullah bin Rawaha said \"Yes, O Allah's Apostle! Call on us in our gathering, for we love that.\" So the Muslims, the pagans and the Jews started abusing one another till they were about to fight with one another. Allah's Apostle kept on quietening them till all of them became quiet, and then Allah's Apostle rode his animal and proceeded till he entered upon Sa`d bin 'Ubada. Allah's Apostle said, \"O Sa`d! Didn't you hear what Abu Habab said?\" (meaning `Abdullah bin Unbar). \"He said so-and-so.\" Sa`d bin Ubada said, \"O Allah's Apostle! Let my father be sacrificed for you ! Excuse and forgive him for, by Him Who revealed to you the Book, Allah sent the Truth which was revealed to you at the time when the people of this town had decided to crown him (`Abdullah bin Ubai) as their ruler. So when Allah had prevented that with the Truth He had given you, he was choked by that, and that caused him to behave in such an impolite manner which you had noticed.\" So Allah's Apostle excused him. (It was the custom of) Allah's Apostle and his companions to excuse the pagans and the people of the scripture (Christians and Jews) as Allah ordered them, and they used to be patient when annoyed (by them). Allah said: 'You shall certainly hear much that will grieve you from those who received the Scripture before you.....and from the pagans (3.186) He also said: 'Many of the people of the scripture wish that if they could turn you away as disbelievers after you have believed. .... (2.109) So Allah's Apostle used to apply what Allah had ordered him by excusing them till he was allowed to fight against them. When Allah's Apostle had fought the battle of Badr and Allah killed whomever He killed among the chiefs of the infidels and the nobles of Quraish, and Allah's Apostle and his companions had returned with victory and booty, bringing with them some of the chiefs of the infidels and the nobles of the Quraish as captives. `Abdullah bin Ubai bin Salul and the pagan idolators who were with him, said, \"This matter (Islam) has now brought out its face (triumphed), so give Allah's Apostle the pledge of allegiance (for embracing Islam.)\". Then they became Muslims.",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "50"
      ]
    },
    {
      "hadith_no": "6291",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن الحسين، أن صفية بنت حيى، زوج النبي صلى الله عليه وسلم أخبرته أنها جاءت رسول الله صلى الله عليه وسلم تزوره وهو معتكف في المسجد في العشر الغوابر من رمضان، فتحدثت عنده ساعة من العشاء ثم قامت تنقلب، فقام معها النبي صلى الله عليه وسلم يقلبها حتى إذا بلغت باب المسجد الذي عند مسكن أم سلمة زوج النبي صلى الله عليه وسلم مر بهما رجلان من الأنصار فسلما على رسول الله صلى الله عليه وسلم ثم نفذا، فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ على رسلكما، إنما هي صفية بنت حيى ‏\"‏‏.‏ قالا سبحان الله يا رسول الله‏.‏ وكبر عليهما‏.‏ قال ‏\"‏ إن الشيطان يجري من ابن آدم مبلغ الدم، وإني خشيت أن يقذف في قلوبكما ‏\"‏‏.‏",
      "text_en": " Narrated Safiya bint Huyai:                     The wife of the Prophet that she went to Allah's Apostle while he was in I`tikaf (staying in the mosque) during the last ten nights of the month of Ramadan. She spoke to him for an hour (a while) at night and then she got up to return home. The Prophet got up to accompany her, and when they reached the gate of the mosque opposite the dwelling place of Um Salama, the wife of the Prophet, two Ansari men passed by, and greeting Allah's Apostle , they quickly went ahead. Allah's Apostle said to them, \"Do not be in a hurry She is Safiya, the daughter of Huyai.\" They said, \"Subhan Allah! O Allah's Apostle (how dare we suspect you).\" That was a great thing for both of them. The Prophet then said, \"Satan runs in the body of Adam's son (i.e. man) as his blood circulates in it, and I was afraid that he (Satan) might insert an evil thought in your hearts.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "7156",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن هند بنت الحارث الفراسية، أن أم سلمة، زوج النبي صلى الله عليه وسلم قالت استيقظ رسول الله صلى الله عليه وسلم ليلة فزعا يقول ‏\"‏ سبحان الله ماذا أنزل الله من الخزائن وماذا أنزل من الفتن، من يوقظ صواحب الحجرات  يريد أزواجه  لكى يصلين، رب كاسية في الدنيا، عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle woke up one night in a state of terror and said, \"Subhan Allah, How many treasures Allah has sent down! And how many afflictions have been sent down! Who will go and wake the lady dwellers (wives of the Prophet) up of these rooms (for prayers)?\" He meant his wives, so that they might pray. He added, \"A well-dressed (soul) in this world may be naked in the Hereafter.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "11734"
      ]
    },
    {
      "hadith_no": "7222",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته عن أم حبيبة بنت أبي سفيان، عن زينب ابنة جحش، أن رسول الله صلى الله عليه وسلم دخل عليها يوما فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏‏.‏ وحلق بإصبعيه الإبهام والتي تليها‏.‏ قالت زينب ابنة جحش فقلت يا رسول الله أفنهلك وفينا الصالحون قال ‏\"‏ نعم إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That one day Allah's Apostle entered upon her in a state of fear and said, \"None has the right to be worshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole has been opened in the dam of Gog and Magog like this.\" The Prophet made a circle with his index finger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though there will be righteous people among us?\" The Prophet said, \"Yes, if the (number) of evil (persons) increased.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    }
  ],
  "total_hadiths": 7
}