{
  "id": "24135",
  "name": "al-Rabi' bin Sbyh الربيع بن صبيح",
  "full_name": "al-Rabi' bin Sbyh الربيع بن صبيح",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Sa'di",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14422",
      "name": "Yazid bin Aban al-Raqqashi يزيد بن أبان الرقاشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19860",
      "name": "Abu Ghalib Hazur حزور أبو غالب صاحب أبي إمامة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20404",
      "name": "Aadm bin Abi Iyas آدم بن أبي إياس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20430",
      "name": "'Asim bin 'Ali bin 'Asim عاصم بن علي بن عاصم بن صهيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن الربيع بن صبيح، عن يزيد بن أبان، وهو الرقاشي عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت الآخرة همه جعل الله غناه في قلبه وجمع له شمله وأتته الدنيا وهي راغمة ومن كانت الدنيا همه جعل الله فقره بين عينيه وفرق عليه شمله ولم يأته من الدنيا إلا ما قدر له ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah(s.a.w) said:                     \"Whoever makes the Hereafter his goal, Allah makes his heart rich, and organizes his affairs, and the world comes to him whether it want to or not. And whoever makes the world his goal, Allah puts his poverty right before his eyes, and disorganizes his affairs, and the world does not come to him, except what has been decreed for him.\"",
      "chain": [
        "30480",
        "20032",
        "24135",
        "19"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن الربيع بن صبيح، وحماد بن سلمة، عن أبي غالب، قال رأى أبو أمامة رءوسا منصوبة على درج مسجد دمشق فقال أبو أمامة ‏\"‏ كلاب النار شر قتلى تحت أديم السماء خير قتلى من قتلوه ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏ يوم تبيض وجوه وتسود وجوه ‏)‏ إلى آخر الآية قلت لأبي أمامة أنت سمعته من رسول الله صلى الله عليه وسلم قال لو لم أسمعه إلا مرة أو مرتين أو ثلاثا أو أربعا حتى عد سبعا ما حدثتكموه ‏.‏ قال أبو عيسى هذا حديث حسن وأبو غالب يقال اسمه حزور وأبو أمامة الباهلي اسمه صدى بن عجلان وهو سيد باهلة ‏.‏",
      "text_en": " Narrated Abu Ghalib:                     \"Abu Umamah saw heads (of the Khawarij) hanging on the streets of Damascus. He said: 'The dogs of the Fire and the worst dead people under the canopy of the heavens. The best dead men are those whom these have killed.' He then recited: On the Day when some faces will become white and some faces will become black... (3:106) until the end of the Ayah. I said to Abu Umamah: 'Did you hear it from the Messenger of Allah (ﷺ)?' He said: 'If I had not heard it but one time, or two times, or three times, or four times - until he reached seven - I would not have narrated it to you.'\"",
      "chain": [
        "30216",
        "20032",
        "24135",
        "20021"
      ]
    },
    {
      "hadith_no": "2885",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا داود بن المحبر، أنبأنا الربيع بن صبيح، عن يزيد بن أبان، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستفتح عليكم الآفاق وستفتح عليكم مدينة يقال لها قزوين من رابط فيها أربعين يوما أو أربعين ليلة كان له في الجنة عمود من ذهب عليه زبرجدة خضراء عليها قبة من ياقوتة حمراء لها سبعون ألف مصراع من ذهب على كل مصراع زوجة من الحور العين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “The horizons will be opened to you, and you will conquer a citycalled Qazvin. Whoever is stationed there for forty days or fortynights, will have pillars of gold in Paradise, with green chrysoliteand topped by a dome of rubies. It will have seventy thousand doors,at each door will be a wife from among the wide-eyed houris.’”",
      "chain": [
        "24126",
        "24135",
        "19"
      ]
    },
    {
      "hadith_no": "3002",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الربيع بن صبيح، عن يزيد بن أبان، عن أنس بن مالك، قال حج النبي  صلى الله عليه وسلم  على رحل رث وقطيفة تساوي أربعة دراهم أو لا تساوي ثم قال ‏\"‏ اللهم حجة لا رياء فيها ولا سمعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “The Prophet (ﷺ)performedHajj on an old saddle, wearing a cloak that was worth fourDirham orless. Then he said: ‘O Allah, a Hajj in which there is noshowingoff nor reputation sought.’”",
      "chain": [
        "38409",
        "20032",
        "24135",
        "19"
      ]
    }
  ],
  "total_hadiths": 4
}