{
  "id": "2416",
  "name": "Abu Mahdhura al-Jumhi ( أبو محذورة الجمحي ( رضي الله عنه",
  "full_name": "Abu Mahdhura al-Jumhi ( أبو محذورة الجمحي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "58",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  م  4  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B. Jumah",
      "Late Muslim",
      "Mu'adhan",
      "Makki"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "19553",
      "name": "Umm 'Abdul Malik أم عبد الملك",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "18665",
      "name": "'Abdul Malik bin Abi Mahdhura عبد الملك بن أبي محذورة الجمحي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "19553",
      "name": "Umm 'Abdul Malik أم عبد الملك",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "18665",
      "name": "'Abdul Malik bin Abi Mahdhura عبد الملك بن أبي محذورة الجمحي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19832",
      "name": "'Abdul 'Aziz bin 'Abdul Malik عبد العزيز بن عبد الملك بن أبي محذورة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-379-2",
      "hadith_no": "379",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو غسان المسمعي، مالك بن عبد الواحد وإسحاق بن إبراهيم قال أبو غسان حدثنا معاذ، وقال، إسحاق أخبرنا معاذ بن هشام، صاحب الدستوائي وحدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن نبي الله صلى الله عليه وسلم علمه هذا الأذان ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - ثم يعود فيقول - أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة - مرتين - حى على الفلاح - مرتين ‏\"‏ ‏.‏ زاد إسحاق ‏\"‏ الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdhura said that the Apostle of Allah (may peace be upon him) taught him Adhan like this:                      Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to the prayer (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20179",
        "32",
        "30312",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sunan-abi-daud-501",
      "hadith_no": "501",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عاصم، وعبد الرزاق، عن ابن جريج، قال أخبرني عثمان بن السائب، أخبرني أبي وأم عبد الملك بن أبي محذورة، عن أبي محذورة، عن النبي صلى الله عليه وسلم نحو هذا الخبر وفيه ‏\"‏ الصلاة خير من النوم الصلاة خير من النوم في الأولى من الصبح ‏\"‏ ‏.‏ قال أبو داود وحديث مسدد أبين قال فيه قال وعلمني الإقامة مرتين مرتين ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ وقال عبد الرزاق ‏\"‏ وإذا أقمت الصلاة فقلها مرتين قد قامت الصلاة قد قامت الصلاة أسمعت ‏\"‏ ‏.‏ قال فكان أبو محذورة لا يجز ناصيته ولا يفرقها لأن النبي صلى الله عليه وسلم مسح عليها ‏.‏",
      "text_en": " Abu Mahdhurah also narrated this tradition from the prophet (May peace be upon him) to the same effect through a different chain of transmitters. This version has the additional wordings. The phrases “prayer is better than sleep, prayer is better than sleep” are to be pronounced in the first ADHAN (i.e., not in Iqamah) of the morning prayer.Abu Dawud said; The version narrated by Musaddad is more clear. It reads:                      He (the prophet) taught me IQAMAH (to pronounce each phrase) twice: Allah is most great. Allah is most great.  I testify that there is no god but Allah. I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah: come to prayer, come to prayer: come to salvation, come to salvation: Allah is most great. Allah is great; there is no god but Allah.Abu Dawud said: The narrator ‘Abd al-Razzaq said; You pronounce IQAMAH for announcing the prayer; you must say twice: the time for prayer has come, the time for prayer has come. (The Prophet said to Abu Mahdhurah): did you listen (to me)? Abu Mahdhurah would not have the hair of his forehead cut, nor would he separate them (from him) because the Prophet (ﷺ) wiped over them.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "20121",
        "11070",
        "2416"
      ]
    },
    {
      "id": "sunan-abi-daud-503",
      "hadith_no": "503",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني ابن عبد الملك بن أبي محذورة، - يعني عبد العزيز - عن ابن محيريز، عن أبي محذورة، قال ألقى على رسول الله صلى الله عليه وسلم التأذين هو بنفسه فقال ‏\"‏ قل الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - مرتين مرتين - قال ثم ارجع فمد من صوتك أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdurah reported :                      The Messenger of Allah (May peace be upon him) himself taught me the call to prayer (adhan). He asked me to pronounce: Allah is most great. Allah is most great. Allah is most great. Allah is most great: I testify that there is no god but Allah. I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is Messenger of Allah. Then repeat and raise your voice; I testify that there is no god but Allah, I testify that there is no god but Allah ; I testify that Muhammad is the Messenger of Allah; I testify that Muhammad is the Messenger of Allah; come to prayer, come to prayer; come to salvation, come to salvation; Allah is most great. Allah is most great; there is no god but Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "2416"
      ]
    },
    {
      "id": "sunan-abi-daud-505",
      "hadith_no": "505",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن داود الإسكندراني، حدثنا زياد، - يعني ابن يونس - عن نافع بن عمر، - يعني الجمحي - عن عبد الملك بن أبي محذورة، أخبره عن عبد الله بن محيريز الجمحي، عن أبي محذورة، أن رسول الله صلى الله عليه وسلم علمه الأذان يقول ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله ‏\"‏ ‏.‏ ثم ذكر مثل أذان حديث ابن جريج عن عبد العزيز بن عبد الملك ومعناه ‏.‏ قال أبو داود وفي حديث مالك بن دينار قال سألت ابن أبي محذورة قلت حدثني عن أذان أبيك عن رسول الله صلى الله عليه وسلم فذكر فقال ‏\"‏ الله أكبر الله أكبر ‏\"‏ ‏.‏ قط وكذلك حديث جعفر بن سليمان عن ابن أبي محذورة عن عمه عن جده إلا أنه قال ‏\"‏ ثم ترجع فترفع صوتك الله أكبر الله أكبر ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdhurah said that the apostle of Allah (May peace be upon him) taught him the call to prayer (adhan), saying:                       Allah is most great, Allah is most great; I testify that there is no god but Allah. He then narrated adhan like the one contained in the tradition transmitted by Ibn Juraij from ‘Abd al-aziz b. ‘abd al-Malik to the same effect. The version Malik b. Dinar has. I asked the son of Abu Mahdhurah, saying: Narrate to me the adhan of your father narrated from the Messenger of Allah (May peace be upon him). He said: Allah is most great, Allah is most great, that is all. Similar is the version narrated by Ja’far b. Sulaiman from the son of Abd Muhdhurah from his uncle on the authority of his grandfather, excepting that he said; Then repeat and raise your voice. Allah is most great. Allah is most great.",
      "usc_msa_ref": "",
      "chain": [
        "28190",
        "20203",
        "18665",
        "2416"
      ]
    },
    {
      "id": "jami-al-tirmidhi-191",
      "hadith_no": "191",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بشر بن معاذ البصري، حدثنا إبراهيم بن عبد العزيز بن عبد الملك بن أبي محذورة، قال أخبرني أبي وجدي، جميعا عن أبي محذورة، أن رسول الله صلى الله عليه وسلم أقعده وألقى عليه الأذان حرفا حرفا ‏.‏ قال إبراهيم مثل أذاننا ‏.‏ قال بشر فقلت له أعد على ‏.‏ فوصف الأذان بالترجيع ‏.‏ قال أبو عيسى حديث أبي محذورة في الأذان حديث صحيح ‏.‏ وقد روي عنه من غير وجه ‏.‏ وعليه العمل بمكة وهو قول الشافعي ‏.‏",
      "text_en": " Abu Mahdhurah narrated that :                     Allah's Messenger sat with him and taught him the Adhan word for word. Ibrahim said, \"It is the same as our Adhan.\" Bishr said: \"So I said to him, 'Repeat it to me.' So he described the Adhan with At-Tarjl'.\"",
      "usc_msa_ref": "",
      "chain": [
        "34041",
        "23002",
        "2416"
      ]
    },
    {
      "id": "jami-al-tirmidhi-192",
      "hadith_no": "192",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا عفان، حدثنا همام، عن عامر بن عبد الواحد الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن النبي صلى الله عليه وسلم علمه الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو محذورة اسمه سمرة بن معير ‏.‏ وقد ذهب بعض أهل العلم إلى هذا في الأذان ‏.‏ وقد روي عن أبي محذورة أنه كان يفرد الإقامة ‏.‏",
      "text_en": " Abu Mahdhurah narrated that :                     the Prophet taught him the Adhan with nineteen phrases, and the Iqamah with seventeen phrases.",
      "usc_msa_ref": "",
      "chain": [
        "30106",
        "20297",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-636",
      "hadith_no": "636",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا بشر بن معاذ، قال حدثني إبراهيم، - وهو ابن عبد العزيز بن عبد الملك بن أبي محذورة - قال حدثني أبي عبد العزيز، وجدي عبد الملك، عن أبي محذورة، أن النبي صلى الله عليه وسلم أقعده فألقى عليه الأذان حرفا حرفا قال إبراهيم هو مثل أذاننا هذا ‏.‏ قلت له أعد على ‏.‏ قال الله أكبر الله أكبر أشهد أن لا إله إلا الله مرتين أشهد أن محمدا رسول الله مرتين ثم قال - بصوت دون ذلك الصوت يسمع من حوله - أشهد أن لا إله إلا الله مرتين أشهد أن محمدا رسول الله مرتين حى على الصلاة مرتين حى على الفلاح مرتين الله أكبر الله أكبر لا إله إلا الله ‏.‏",
      "text_en": " It was narrated from Abu Mahdhurah that the Prophet (ﷺ) sat him down and taught him the Adhan letter by letter. (One of the narrators) Ibrahim said, \"It is like this Adhan of ours\". I said[1]:                      \"Recite it to me.\" He said, \"Allahu Akbar, Allahu Akbar (Allah is the greatest, Allah is the greatest), Ashhadu an la ilaha illallah (I bear witness that there is none worthy of worship except Allah) - twice. Ashhadu anna Muhammadan Rasulallah (I bear witness that Muhammad is the messenger of Allah) - twice. Then he said in a lower voice which those around him could here: Ashhadu an la ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah) - twice. Ashhadu anna Muhammadan Rasulallah (I bear witness that Muhammad is the messenger of Allah) - twice, Hayya'ala as-salah (come to prayer) - twice, Hayya alal-falah (come to prosperity) - twice, Allahu Akbar Allahu Akbar la ilaha illallah (Allah is the Greatest, Allah is the Greatest, there is none worthy of worship except Allah).[1] Bishir bin Mu'adh who heard it from Ibrahim, and from whom An-Nasa'i is reporting it, is the one who is asking for the Adhan to be recited to him.",
      "usc_msa_ref": "",
      "chain": [
        "34041",
        "23002",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-637",
      "hadith_no": "637",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن همام بن يحيى، عن عامر بن عبد الواحد، حدثنا مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة ‏\"‏ ‏.‏ ثم عدها أبو محذورة تسع عشرة كلمة وسبع عشرة ‏.‏",
      "text_en": " It was narrated from Abu Mahdhurah that the Messenger of Allah taught him the Adhan with nineteen phrases and the Iqiimah with seventeen phrases, then Abu Mahdhurah counted them as nineteen and seventeen.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20297",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-638",
      "hadith_no": "638",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، قال علمني رسول الله صلى الله عليه وسلم الأذان فقال ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ثم يعود فيقول أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mahdhura said:                      \"The Messenger of Allah taught me the Adhan and said: 'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah)'. Then he repeated it and said: 'Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; Allahu Akbar, Allahu Akbar; La ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-640",
      "hadith_no": "640",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إبراهيم بن الحسن، قال حدثنا حجاج، عن ابن جريج، عن عثمان بن السائب، قال أخبرني أبي وأم عبد الملك بن أبي محذورة، عن أبي محذورة، قال لما خرج رسول الله صلى الله عليه وسلم من حنين خرجت عاشر عشرة من أهل مكة نطلبهم فسمعناهم يؤذنون بالصلاة فقمنا نؤذن نستهزئ بهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد سمعت في هؤلاء تأذين إنسان حسن الصوت ‏\"‏ ‏.‏ فأرسل إلينا فأذنا رجل رجل وكنت آخرهم فقال حين أذنت ‏\"‏ تعال ‏\"‏ ‏.‏ فأجلسني بين يديه فمسح على ناصيتي وبرك على ثلاث مرات ثم قال ‏\"‏ اذهب فأذن عند البيت الحرام ‏\"‏ ‏.‏ قلت كيف يا رسول الله فعلمني كما تؤذنون الآن بها ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الصلاة خير من النوم الصلاة خير من النوم ‏\"‏ ‏.‏ في الأولى من الصبح قال وعلمني الإقامة مرتين ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح قد قامت الصلاة قد قامت الصلاة الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ قال ابن جريج أخبرني عثمان هذا الخبر كله عن أبيه وعن أم عبد الملك بن أبي محذورة أنهما سمعا ذلك من أبي محذورة ‏.‏",
      "text_en": " It was narrated that Abu Mahdhurah said:                      \"When the Messenger of Allah left Hunain, I was the tenth of a group of ten of the people of Makkah who were trying to catch up with them. We heard them calling the Adhan for the prayer and we started to repeat the Adhan, mocking them. The Messenger of Allah said, 'I heard among these people the Adhan of one who has a beautiful voice.' He sent for us, and we recited the Adhan one by one, and I was the last of them. When I said the Adhan, he said: 'Come here.' He sat me down in front of him and rubbed my forelock and blessed me three times, then he said, 'Go and give the Adhan at the sacred House.' I said: 'How, O Messenger of Allah?' He taught me as you say the Adhan now: 'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah, Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; as-salatu khairun min an-nawm;as-salatu khairun min an-nawm; (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; prayer is better than sleep, prayer is better than sleep)' - in the first (Adhan) for As-Subh (Fajr). And he taught me the Iqamah saying each phrase twice: 'Allahu Akbar, Allahu Akbar, (Allahu Akbar, Allahu Akbar), Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'alas-salah; Hayya 'alal-falah, Hayya 'alal-falah; qad qamatis-salah, qad qamati-salah, Allahu Akbar, Allahu Akbar La ilaha illallah (Allah is the Greatest, Allah is the Greatest, (Allah is the Greatest, Allah is the Greatest); I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah ; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; the prayer is about to begin, the prayer is about to begin, Allah is the Greatest,Allah is the Greatest; there is none worthy of worship except Allah).\"(One of the narrators) Ibn Juraij said:''Uthmin narrated this whole reportto me from his father and from Umm'Abdul-Malik bin Abi Mahafirah,and (said that) they heard that fromAbu Mahdhurah.",
      "usc_msa_ref": "",
      "chain": [
        "38070",
        "20219",
        "11070",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-654",
      "hadith_no": "654",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن سفيان، عن أبي جعفر، عن أبي سلمان، عن أبي محذورة، قال كنت أؤذن لرسول الله صلى الله عليه وسلم وكنت أقول في أذان الفجر الأول حى على الفلاح الصلاة خير من النوم الصلاة خير من النوم الله أكبر الله أكبر لا إله إلا الله ‏.‏",
      "text_en": " It was narrated that Abu Mahdhurah said:                      \"I used to call the Adhan for the Messenger of Allah (ﷺ) and in the first Adhan of Fajr I used to Say: 'Hayya 'ala al-falah, as-salatu khairun minan-nawm, as-salatu khairun minan-nawm, Allahu Akbar Allahu Akbar, la ilaha illallah (Come to prosperity, prayer is better than sleep, prayer is better than sleep, Allah is the Greatest, Allah is the Greatest, there is none worthy of worship except Allah).'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20012",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-659",
      "hadith_no": "659",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا سويد، قال حدثنا عبد الله، عن يونس بن أبي إسحاق، عن محارب بن دثار، قال حدثني الأسود بن يزيد، عن أبي محذورة، أن آخر الأذان، لا إله إلا الله ‏.‏",
      "text_en": " It was narrated that Muharib bin Dithar said:                      \"Al-Aswad bin Yazid narrated to me from Abu Mahdhurah that the final words of the Adhan are: 'La ilaha illahha (there is none worthy of worship except Allah).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "10846",
        "11389",
        "11054",
        "2416"
      ]
    }
  ],
  "total_hadiths": 12
}