{
  "id": "24178",
  "name": "Sulaiman bin Arqm سليمان بن أرقم",
  "full_name": "Sulaiman bin Arqm سليمان بن أرقم",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ت  س  -  ضعيف ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20442",
      "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20448",
      "name": "'Ali bin 'Ayyash علي بن عياش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-1525",
      "hadith_no": "1525",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو إسماعيل الترمذي، - واسمه محمد بن إسماعيل بن يوسف حدثنا أيوب بن سليمان بن بلال، حدثنا أبو بكر بن أبي أويس، عن سليمان بن بلال، عن موسى بن عقبة، ومحمد بن عبد الله بن أبي عتيق، عن الزهري، عن سليمان بن أرقم، عن يحيى بن أبي كثير، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية الله وكفارته كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وهو أصح من حديث أبي صفوان عن يونس ‏.‏ وأبو صفوان هو مكي واسمه عبد الله بن سعيد بن عبد الملك بن مروان وقد روى عنه الحميدي وغير واحد من جلة أهل الحديث ‏.‏ وقال قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية الله وكفارته كفارة يمين ‏.‏ وهو قول أحمد وإسحاق واحتجا بحديث الزهري عن أبي سلمة عن عائشة ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية ولا كفارة في ذلك ‏.‏ وهو قول مالك والشافعي ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Prophet (ﷺ) said: \"There is no vowing in disobedience to Allah, and its atonement is the atonement of an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "20175",
        "11013",
        "24178",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3839",
      "hadith_no": "3839",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن إسماعيل الترمذي، قال حدثنا أيوب بن سليمان، قال حدثني أبو بكر بن أبي أويس، قال حدثني سليمان بن بلال، عن محمد بن أبي عتيق، وموسى بن عقبة، عن ابن شهاب، عن سليمان بن أرقم، أن يحيى بن أبي كثير الذي، كان يسكن اليمامة حدثه أنه، سمع أبا سلمة، يخبر عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية وكفارتها كفارة يمين ‏\"‏ ‏.‏ قال أبو عبد الرحمن سليمان بن أرقم متروك الحديث والله أعلم ‏.‏ خالفه غير واحد من أصحاب يحيى بن أبي كثير في هذا الحديث ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah said:                      \"There is no vow to commit an act of disobedience, and its expiation is the expiation for an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "11013",
        "24178",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4854",
      "hadith_no": "4854",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا الهيثم بن مروان بن الهيثم بن عمران العنسي، قال حدثنا محمد بن بكار بن بلال، قال حدثنا يحيى، قال حدثنا سليمان بن أرقم، قال حدثني الزهري، عن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم كتب إلى أهل اليمن بكتاب فيه الفرائض والسنن والديات وبعث به مع عمرو بن حزم فقرئ على أهل اليمن هذه نسخته فذكر مثله إلا أنه قال ‏\"‏ وفي العين الواحدة نصف الدية وفي اليد الواحدة نصف الدية وفي الرجل الواحدة نصف الدية ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا أشبه بالصواب والله أعلم وسليمان بن أرقم متروك الحديث وقد روى هذا الحديث يونس عن الزهري مرسلا ‏.‏",
      "text_en": " It was narrated from Abi Bakr bin Muhammad bin 'Amr bin Hazm, from his father, from his grandfather, that:                     the Messenger of Allah wrote a letter to the people of Yemen included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Amr bin Hazm and it was read to the people of Yemen. This is a copy of it. And he mentioned something similar, except that he said: \"And for one eye, half the Diyah must be paid; for one hand, half thediyah must be paid; for one foot, half the diyah must be paid. \" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "37542",
        "27540",
        "20031",
        "24178",
        "11013",
        "11239",
        "1209"
      ]
    }
  ],
  "total_hadiths": 3
}