{
  "id": "24209",
  "name": "Sadqa bin Musa al-Daqayqi صدقة بن موسى الدقيقي",
  "full_name": "Sadqa bin Musa al-Daqayqi صدقة بن موسى الدقيقي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  د  ت  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11296",
      "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19858",
      "name": "Malik bin Dinar al-Naji مالك بن دينار السامي الناجي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10715",
      "name": "Muhammad bin Wasi' bin Jabir محمد بن واسع بن جابر بن الأخنس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14313",
      "name": "Farqad bin Y'aqub al-Sabkhi فرقد بن يعقوب السبخي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4200",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا صدقة الدقيقي، حدثنا أبو عمران الجوني، عن أنس بن مالك، قال وقت لنا رسول الله صلى الله عليه وسلم حلق العانة وتقليم الأظفار وقص الشارب ونتف الإبط أربعين يوما مرة ‏.‏ قال أبو داود رواه جعفر بن سليمان عن أبي عمران عن أنس لم يذكر النبي صلى الله عليه وسلم قال وقت لنا وهذا أصح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Messenger of Allah (ﷺ) fixed forty days to shave the pubes, paring the nails, clipping the moustaches, and plucking the hair under the armpit.Abu Dawud said: Ja'far b. Sulaiman transmitted it from Abu 'Imran on the authority of Anas. In this version he did not mention the Prophet (ﷺ). He said: Forty days were fixed for us. This is a more correct version.",
      "chain": [
        "20285",
        "24209",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "663",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا موسى بن إسماعيل، حدثنا صدقة بن موسى، عن ثابت، عن أنس، قال سئل النبي صلى الله عليه وسلم أى الصوم أفضل بعد رمضان فقال ‏\"‏ شعبان لتعظيم رمضان ‏\"‏ ‏.‏ قيل فأى الصدقة أفضل قال ‏\"‏ صدقة في رمضان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وصدقة بن موسى ليس عندهم بذاك القوي ‏.‏",
      "text_en": " Anas narrated that :                     the Prophet was asked which fast was most virtuous after Ramadan? He said: \"Sha'ban in honor of Ramadan\" He said: \"Which charity is best?\" He (pbuh) said: \"Charity in Ramadan.\"",
      "chain": [
        "34188",
        "20040",
        "24209",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2089",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي أخبرنا أبو داود، حدثنا صدقة بن موسى، حدثنا مالك بن دينار، عن عبد الله بن غالب الحداني، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خصلتان لا تجتمعان في مؤمن البخل وسوء الخلق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث صدقة بن موسى ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
      "text_en": " Abu  Sa'eed Al-Khudri narrated that the Messenger of Allah said:                     \"Two traits are not combined  in a believer: Stinginess and bad manners.\"",
      "chain": [
        "30286",
        "30002",
        "24209",
        "19858",
        "14220",
        "38"
      ]
    },
    {
      "hadith_no": "2090",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا صدقة بن موسى، عن فرقد السبخي، عن مرة الطيب، عن أبي بكر الصديق، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة خب ولا منان ولا بخيل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " -Abu  Bakr As-Siddiq narrated that the Messenger of Allah said:                     \"The swindler, the stingy person, and the Mannan shall not enter Paradise.\"",
      "chain": [
        "30242",
        "20472",
        "24209",
        "14313",
        "2"
      ]
    },
    {
      "hadith_no": "2983",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الصمد بن عبد الوارث، حدثنا صدقة بن موسى أبو محمد، صاحب الدقيق حدثنا أبو عمران الجوني، عن أنس بن مالك، عن النبي صلى الله عليه وسلم أنه وقت لهم في كل أربعين ليلة تقليم الأظفار وأخذ الشارب وحلق العانة ‏.‏",
      "text_en": " Narrated Anas:                     from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.",
      "chain": [
        "30313",
        "20250",
        "24209",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "3604f",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، أخبرنا أبو داود، أخبرنا صدقة بن موسى، أخبرنا محمد بن واسع، عن سمير بن نهار العبدي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن حسن الظن بالله من حسن عبادة الله ‏\"‏ ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “Indeed, having good thoughts concerning Allah is from the perfection of the worship of Allah.”",
      "chain": [
        "30221",
        "20547",
        "24209",
        "16398",
        "13"
      ]
    }
  ],
  "total_hadiths": 6
}