{
  "id": "24242",
  "name": "'Abdullah bin Farroukh al-Khurasni عبد الله بن فروخ الخراساني",
  "full_name": "'Abdullah bin Farroukh al-Khurasni عبد الله بن فروخ الخراساني",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "115",
      "date_gregorian": "NA",
      "date_display": [
        "115 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "175",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      "al-Yamama",
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  -  صدوق ]"
    ],
    "tags": [
      "al-Khurasni",
      "al-Yemami",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30232",
      "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30206",
      "name": "'Amr bin al-Rabi' bin Tarq عمرو بن الربيع بن طارق",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا حسن بن علي الحلواني، حدثنا أبو توبة الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، يقول حدثني عبد الله بن فروخ، أنه سمع عائشة، تقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنه خلق كل إنسان من بني آدم على ستين وثلاثمائة مفصل فمن كبر الله وحمد الله وهلل الله وسبح الله واستغفر الله وعزل حجرا عن طريق الناس أو شوكة أو عظما عن طريق الناس وأمر بمعروف أو نهى عن منكر عدد تلك الستين والثلاثمائة السلامى فإنه يمشي يومئذ وقد زحزح نفسه عن النار ‏\"‏ ‏.‏ قال أبو توبة وربما قال ‏\"‏ يمسي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      Every one of the children of Adam has been created with three hundred and sixty joints; so he who declares the Glory of Allah, praises Allah, declares Allah to be One, Glorifies Allah, and seeks forgiveness from Allah, and removes stone, or thorn, or bone from people's path, and enjoins what is good and forbids from evil, to the number of those three hundred and sixty-four, will walk that day haviing removed himself from Hell.",
      "chain": [
        "30335",
        "20401",
        "15",
        "24242"
      ]
    },
    {
      "hadith_no": "2379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا يحيى بن كثير، حدثنا علي، - يعني ابن المبارك - حدثنا يحيى، عن زيد بن سلام، عن جده أبي سلام، قال حدثني عبد الله، بن فروخ أنه سمع عائشة، تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خلق كل إنسان ‏\"‏ ‏.‏ بنحو حديث معاوية عن زيد ‏.‏ وقال ‏\"‏ فإنه يمشي يومئذ ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by 'A'isha through anothr chain of transmitters in which she reported Allah's Messenger (may peace be ulon him) as saying:                     \" Every man is created\" ; the rest of the hadith is the same and he said:\" He walks on that day.\"",
      "chain": [
        "20302",
        "20449",
        "11449",
        "10912",
        "24242"
      ]
    },
    {
      "hadith_no": "6079",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني الحكم بن موسى أبو صالح، حدثنا هقل، - يعني ابن زياد - عن الأوزاعي، حدثني أبو عمار، حدثني عبد الله بن فروخ، حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا سيد ولد آدم يوم القيامة وأول من ينشق عنه القبر وأول شافع وأول مشفع ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      I shall be pre-eminent arriongst the descendants of Adam on the Day of Resurrection and I will be the first intercessor and the first whose intercession will be accepted (by Allah).",
      "chain": [
        "30502",
        "20641",
        "20024",
        "24242",
        "13"
      ]
    },
    {
      "hadith_no": "4673",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا الوليد، عن الأوزاعي، عن أبي عمار، عن عبد الله بن فروخ، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا سيد ولد آدم وأول من تنشق عنه الأرض وأول شافع وأول مشفع ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      I shall be pre-eminent among the descendants of Adam, the first from whom the earth will be cleft open the first intercessor, and the first whose intercession will be accepted.",
      "chain": [
        "10581",
        "20733",
        "20024",
        "24242",
        "13"
      ]
    }
  ],
  "total_hadiths": 4
}