{
  "id": "24251",
  "name": "Abd al-Jlyl bin Atyh عبد الجليل بن عطية القيسي أبو صالح",
  "full_name": "Abd al-Jlyl bin Atyh عبد الجليل بن عطية القيسي أبو صالح",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-5090",
      "hadith_no": "5090",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا العباس بن عبد العظيم، ومحمد بن المثنى، قالا حدثنا عبد الملك بن عمرو، عن عبد الجليل بن عطية، عن جعفر بن ميمون، قال حدثني عبد الرحمن بن أبي بكرة، أنه قال لأبيه يا أبة إني أسمعك تدعو كل غداة اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا إله إلا أنت تعيدها ثلاثا حين تصبح وثلاثا حين تمسي ‏.‏ فقال إني سمعت رسول الله صلى الله عليه وسلم يدعو بهن فأنا أحب أن أستن بسنته ‏.‏ قال عباس فيه وتقول اللهم إني أعوذ بك من الكفر والفقر اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت تعيدها ثلاثا حين تصبح وثلاثا حين تمسي فتدعو بهن فأحب أن أستن بسنته قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوات المكروب اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله لا إله إلا أنت ‏\"‏ ‏.‏ وبعضهم يزيد على صاحبه ‏.‏",
      "text_en": " Narrated AbuBakrah:                     AbdurRahman ibn AbuBakrah said that he told his father: O my father! I hear you supplicating every morning: \"O Allah! Grant me health in my body. O Allah! Grant me good hearing. O Allah! Grant me good eyesight. There is no god but Thou.\" You repeat them three times in the morning and three times in the evening.  He said: I heard the Messenger of Allah (ﷺ) using these words as a supplication and I like to follow his practice.  The transmitter, Abbas, said in this version: And you say: \"O Allah! I seek refuge in Thee from infidelity and poverty. O Allah! I seek refuge in Thee from punishment in the grave. There is no god but Thee\". You repeat them three times in the morning and three times in the evening, and use them as a supplication. I like to follow his practice.  He said: The Messenger of Allah (ﷺ) said: The supplications to be used by one who is distressed are: \"O Allah! Thy mercy is what I hope for. Do not abandon me to myself for an instant, but put all my affairs in good order for me. There is no god but Thou.\" Some transmitters added more than others.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30170",
        "20443",
        "24251",
        "18132",
        "11294"
      ]
    }
  ],
  "total_hadiths": 1
}