{
  "id": "24373",
  "name": "Qdamh bin Shhab al-Mazny قدامة بن شهاب المازني البصري",
  "full_name": "Qdamh bin Shhab al-Mazny قدامة بن شهاب المازني البصري",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  -  صدوق ]"
    ],
    "tags": [
      "al-Maazni",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19839",
      "name": "Bard bin Sinan برد بن سنان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30122",
      "name": "Azhar bin Jamil bin Jinah أزهر بن جميل بن جناح",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30450",
      "name": "Ibn Abi al-Shuwarab محمد بن عبد الملك بن أبي الشوارب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "518",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا يوسف بن واضح، قال حدثنا قدامة، - يعني ابن شهاب - عن برد، عن عطاء بن أبي رباح، عن جابر بن عبد الله، أن جبريل، أتى النبي صلى الله عليه وسلم يعلمه مواقيت الصلاة فتقدم جبريل ورسول الله صلى الله عليه وسلم خلفه والناس خلف رسول الله صلى الله عليه وسلم فصلى الظهر حين زالت الشمس وأتاه حين كان الظل مثل شخصه فصنع كما صنع فتقدم جبريل ورسول الله صلى الله عليه وسلم خلفه والناس خلف رسول الله صلى الله عليه وسلم فصلى العصر ثم أتاه حين وجبت الشمس فتقدم جبريل ورسول الله صلى الله عليه وسلم خلفه والناس خلف رسول الله صلى الله عليه وسلم فصلى المغرب ثم أتاه حين غاب الشفق فتقدم جبريل ورسول الله صلى الله عليه وسلم خلفه والناس خلف رسول الله صلى الله عليه وسلم فصلى العشاء ثم أتاه حين انشق الفجر فتقدم جبريل ورسول الله صلى الله عليه وسلم خلفه والناس خلف رسول الله صلى الله عليه وسلم فصلى الغداة ثم أتاه اليوم الثاني حين كان ظل الرجل مثل شخصه فصنع مثل ما صنع بالأمس فصلى الظهر ثم أتاه حين كان ظل الرجل مثل شخصيه فصنع كما صنع بالأمس فصلى العصر ثم أتاه حين وجبت الشمس فصنع كما صنع بالأمس فصلى المغرب فنمنا ثم قمنا ثم نمنا ثم قمنا فأتاه فصنع كما صنع بالأمس فصلى العشاء ثم أتاه حين امتد الفجر وأصبح والنجوم بادية مشتبكة فصنع كما صنع بالأمس فصلى الغداة ثم قال ‏\"‏ ما بين هاتين الصلاتين وقت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that Jibril came to the Prophet (ﷺ) to teach him the times of prayer. Jibril went forward, with the Messenger of Allah (ﷺ) behind him and the people behind the Messenger of Allah (ﷺ), and he prayed Zurh when the sun had passed its zenith. Then he came to him when the shadow of a person was equal to his height, and did as he had done before; Jibril went forward, with the Messenger of Allah (ﷺ) behind him and the people behind the Messenger of Allah (ﷺ), and he prayed 'Asr. Then Jibril came to him when the sun had set; Jibril went forward, with the Messenger of Allah (ﷺ) behind him and the people behind the Messenger of Allah (ﷺ), and he prayed Al-Ghadah. [1] Then he came to him on the second day when a man's shadow was equal to his height, and did as he had done the day before, he prayed Zuhr. Then he came to him when the shadow of a man was twice his height, and did what he had done the day before, and prayed 'Asr. Then he came to him when the sun had set and did what he had done the day before, and prayed Maghrib. Then we slept and got up, and slept and got up again. Then he came to him and did what he had done the day before and prayed 'Isha.' The  he came to him when the (the light of) dawn was spread (on the horizon) [2] and the starts were still clear in the sky, and he did the same as he had done the day before, and prayed Al-Ghadah. Then he said:                      ' The time between these two is the time for prayer.'\"[1] Meaning Fajr, the morning prayer.[2] The Fajr prayer was elongated because the Prophet recited at length during the prayer, so that it ended just before sunrise. That defined the end of the time for Fajr, as the beginning of the time was defined by the  moment when he started the first Rak'ah.",
      "chain": [
        "24373",
        "11029",
        "34"
      ]
    }
  ],
  "total_hadiths": 1
}