{
  "id": "244",
  "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
  "full_name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة  ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Abyssinia"
    },
    "death": {
      "date_hijri": "73",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Abyssinia",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Makhzum",
      "Born Muslim",
      "Child",
      "Abyssinia 2"
    ]
  },
  "parents": [
    {
      "id": "101",
      "name": "Abu Salamah ( عبد الله بن عبد الأسد أبو سلمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "192",
      "name": "'Abdullah b. Zama'a ( عبد الله بن زمعة بن الأسود بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "245",
      "name": "Salamah bin Abi Salamah ( سلمة بن أبي سلمة بن عبدالأسد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "247",
      "name": "Durrah bintt Abi Salamah ( درة بنت أبي سلمة بن عبدالأسد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "10994",
      "name": "Abu 'Ubaida bin 'Abdullah bin Zama' أبو عبيدة بن عبد الله بن زمعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "57",
      "name": "Zaynab bint Jahsh ( زينب بنت جحش الأسدية أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "59",
      "name": "Umm Habibah bint Abi Sufyan ( أم حبيبة ,رملة بنت أبي سفيان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10994",
      "name": "Abu 'Ubaida bin 'Abdullah bin Zama' أبو عبيدة بن عبد الله بن زمعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11157",
      "name": "Hameed bin Nafi' al-Ansari حميد بن نافع الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11204",
      "name": "'Arak bin Malik عراك بن مالك الغفاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-130",
      "hadith_no": "130",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا أبو معاوية، قال حدثنا هشام، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق، فهل على المرأة من غسل إذا احتلمت قال النبي صلى الله عليه وسلم ‏\"‏ إذا رأت الماء ‏\"‏‏.‏ فغطت أم سلمة  تعني وجهها  وقالت يا رسول الله وتحتلم المرأة قال ‏\"‏ نعم تربت يمينك فبم يشبهها ولدها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um-Sulaim came to Allah's Apostle and said, \"Verily, Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge?) The Prophet replied, \"Yes, if she notices a discharge.\" Um Salama, then covered her face and asked, \"O Allah's Apostle! Does a woman get a discharge?\" He replied, \"Yes, let your right hand be in dust (An Arabic expression you say to a person when you contradict his statement meaning \"you will not achieve goodness\"), and that is why the son resembles his mother.\"",
      "usc_msa_ref": "132",
      "chain": [
        "30376",
        "20354",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-282",
      "hadith_no": "282",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة أم المؤمنين، أنها قالت جاءت أم سليم امرأة أبي طلحة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله، إن الله لا يستحيي من الحق، هل على المرأة من غسل إذا هي احتلمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
      "text_en": " Narrated Um-Salama:                     (the mother of the believers) Um Sulaim, the wife of Abu Talha, came to Allah's Apostle and said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge)?\" Allah's Apostle replied, \"Yes, if she notices a discharge.\"",
      "usc_msa_ref": "280",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-298",
      "hadith_no": "298",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا هشام، عن يحيى بن أبي كثير، عن أبي سلمة، أن زينب ابنة أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميصة إذ حضت، فانسللت فأخذت ثياب حيضتي قال ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was laying with the Prophet under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
      "usc_msa_ref": "297",
      "chain": [
        "20202",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-322",
      "hadith_no": "322",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "usc_msa_ref": "319",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-323",
      "hadith_no": "323",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميلة حضت، فانسللت فأخذت ثياب حيضتي فقال ‏\"‏ أنفست ‏\"‏‏.‏ فقلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was lying with the Prophet under a woolen sheet, I got my menses. I slipped away and put on the clothes for menses. The Prophet said, \"Have you got your menses?\" I replied, \"Yes.\" He called me and I slept with him under the woolen sheet.",
      "usc_msa_ref": "320",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-464",
      "hadith_no": "464",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ قال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick. He told me to perform the Tawaf behind the people while riding. So I did so and Allah's Apostle was praying beside the Ka`ba and reciting the Sura starting with \"Wat-tur wa kitabin mastur.\"",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1280",
      "hadith_no": "1280",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا أيوب بن موسى، قال أخبرني حميد بن نافع، عن زينب ابنة أبي سلمة، قالت لما جاء نعى أبي سفيان من الشأم دعت أم حبيبة  رضى الله عنها  بصفرة في اليوم الثالث، فمسحت عارضيها وذراعيها وقالت إني كنت عن هذا لغنية، لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث، إلا على زوج، فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked for a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been in need of this, had I not heard the Prophet saying: \"It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, for whom she should mourn for four months and ten days.\"",
      "usc_msa_ref": "370",
      "chain": [
        "30418",
        "20005",
        "11241",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-1281",
      "hadith_no": "1281",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أخبرته قالت، دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏   ثم دخلت على زينب بنت جحش حين توفي أخوها، فدعت بطيب فمست ثم قالت ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for any dead person for more than three days except for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to Zainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am not in need of scent but I heard Allah's Apostle saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, (for whom she should mourn) for four months and ten days.' \"",
      "usc_msa_ref": "371",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-1644",
      "hadith_no": "1644",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت، وهو يقرأ ‏{‏والطور * وكتاب مسطور‏}‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet was praying beside the Ka`ba and reciting Surat-at-Tur.",
      "usc_msa_ref": "686",
      "chain": [
        "30103",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1658",
      "hadith_no": "1658",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة  رضى الله عنها  قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، وهو يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I informed Allah's Apostle that I was sick. He said, \"Perform Tawaf (of the Ka`ba) while riding behind the people.\" So, I performed the Tawaf while Allah's Apostle was offering the prayer beside the Ka`ba and was reciting Surat-at-Tur.",
      "usc_msa_ref": "698",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1929",
      "hadith_no": "1929",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن أبي عبد الله، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن زينب ابنة أم سلمة، عن أمها  رضى الله عنهما  قالت بينما أنا مع، رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت، فأخذت ثياب حيضتي فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدخلت معه في الخميلة، وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان من إناء واحد، وكان يقبلها وهو صائم‏.‏",
      "text_en": " Narrated Zainab:                     (daughter of Um Salama) that her mother said, \"While I was (lying) with Allah's Apostle underneath a woolen sheet, I got the menstruation, and then slipped away and put on the clothes (which I used to wear) in menses. He asked, \"What is the matter? Did you get your menses?\" I replied in the affirmative and then entered underneath that woolen sheet. I and Allah's Apostle used to take a bath from one water pot and he used to kiss me while he was fasting.\"",
      "usc_msa_ref": "151",
      "chain": [
        "30175",
        "20031",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-2458",
      "hadith_no": "2458",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب بنت أم سلمة، أخبرته أن أمها أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته، فخرج إليهم، فقال ‏\"‏ إنما أنا بشر وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صدق، فأقضي له بذلك، فمن قضيت له بحق مسلم فإنما هي قطعة من النار، فليأخذها أو فليتركها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle heard some people quarreling at the door of his dwelling. He came out and said, \"I am only a human being, and opponents come to me (to settle their problems); maybe someone amongst you can present his case more eloquently than the other, whereby I may consider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by mistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day of Resurrection).",
      "usc_msa_ref": "638",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-3328",
      "hadith_no": "3328",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله، إن الله لا يستحيي من الحق، فهل على المرأة الغسل إذا احتلمت قال ‏\"‏ نعم، إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة، فقالت تحتلم المرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ فبما يشبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Um Salama said, \"Um Sulaim said, 'O Allah's Apostle! Allah does not refrain from saying the truth! Is it obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she notices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's Apostle said. 'Then why does a child resemble (its mother)?\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "id": "sahih-bukhari-3346",
      "hadith_no": "3346",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته عن أم حبيبة بنت أبي سفيان، عن زينب ابنة جحش  رضى الله عنهن أن النبي صلى الله عليه وسلم دخل عليها فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏‏.‏ وحلق بإصبعه الإبهام والتي تليها‏.‏ قالت زينب ابنة جحش فقلت يا رسول الله أنهلك وفينا الصالحون قال ‏\"‏ نعم، إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That the Prophet once came to her in a state of fear and said, \"None has the right to be worshipped but Allah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Gog and Magog like this,\" making a circle with his thumb and index finger. Zainab bint Jahsh said, \"O Allah's Apostle! Shall we be destroyed even though there are pious persons among us?\" He said, \"Yes, when the evil person will increase.\"",
      "usc_msa_ref": "565",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "id": "sahih-bukhari-3532",
      "hadith_no": "3532",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا موسى، حدثنا عبد الواحد، حدثنا كليب، حدثتني ربيبة النبي، صلى الله عليه وسلم وأظنها زينب قالت نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والمقير والمزفت‏.‏ وقلت لها أخبريني النبي صلى الله عليه وسلم ممن كان من مضر كان قالت فممن كان إلا من مضر، كان من ولد النضر بن كنانة‏.‏",
      "text_en": " Narrated Kulaib:                     I was told by the Rabiba (i.e. daughter of the wife of the Prophet) who, I think, was Zainab, that the Prophet (forbade the utensils (of wine called) Ad-Dubba, Al-Hantam, Al-Muqaiyar and Al-Muzaffat. I said to her, 'Tell me as to which tribe the Prophet belonged; was he from the tribe of Mudar?'' She replied, \"He belonged to the tribe of Mudar and was from the offspring of An-Nadr bin Kinana. \"",
      "usc_msa_ref": "698",
      "chain": [
        "20040",
        "20256",
        "11534",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-3641",
      "hadith_no": "3641",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته أن أم حبيبة بنت أبي سفيان حدثتها عن زينب بنت جحش، أن النبي صلى الله عليه وسلم دخل عليها فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم يأجوج ومأجوج مثل هذا ‏\"‏‏.‏ وحلق بإصبعه وبالتي تليها، فقالت زينب فقلت يا رسول الله أنهلك وفينا الصالحون قال ‏\"‏ نعم، إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That the Prophet came to her in a state of fear saying, \"None has the right to be worshiped but Allah! Woe to the Arabs because of evil that has come near. Today a hole has been made in the wall of Gog and Magog as large as this.\" pointing with two of his fingers making a circle. Zainab said, \"I said, 'O Allah's Apostle! Shall we be destroyed though amongst us there are pious people? ' He said, 'Yes, if evil increases.\"",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "id": "sahih-bukhari-4368",
      "hadith_no": "4368",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحميدي، سمع سفيان، حدثنا هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أمها أم سلمة  رضى الله عنها  دخل على النبي صلى الله عليه وسلم وعندي مخنث فسمعته يقول لعبد الله بن أبي أمية يا عبد الله أرأيت إن فتح الله عليكم الطائف غدا فعليك بابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال ابن عيينة وقال ابن جريج المخنث هيت‏.‏ حدثنا محمود حدثنا أبو أسامة عن هشام بهذا، وزاد وهو محاصر الطائف يومئذ‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet came to me while there was an effeminate man sitting with me, and I heard him (i.e. the effeminate man) saying to `Abdullah bin Abi Umaiya, \"O `Abdullah! See if Allah should make you conquer Ta'if tomorrow, then take the daughter of Ghailan (in marriage) as (she is so beautiful and fat that) she shows four folds of flesh when facing you, and eight when she turns her back.\" The Prophet then said, \"These (effeminate men) should never enter upon you (O women!).\" Ibn Juraij said, \"That effeminate man was called Hit.\"",
      "usc_msa_ref": "613",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-4902",
      "hadith_no": "4902",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick, so he said, \"Perform the Tawaf (of Ka`ba at Mecca) while riding behind the people (who are performing the Tawaf on foot).\" So I performed the Tawaf while Allah's Apostle was offering the prayer by the side of the Ka`ba and was reciting: 'By the Mount (Saini) and by a Decree Inscribed.'",
      "usc_msa_ref": "376",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5157",
      "hadith_no": "5157",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا الحكم بن نافع، أخبرنا شعيب، عن الزهري، قال أخبرني عروة بن الزبير، أن زينب ابنة أبي سلمة، أخبرته أن أم حبيبة بنت أبي سفيان أخبرتها أنها، قالت يا رسول الله انكح أختي بنت أبي سفيان فقال ‏\"‏ أوتحبين ذلك ‏\"‏‏.‏ فقلت نعم، لست لك بمخلية، وأحب من شاركني في خير أختي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن ذلك لا يحل لي ‏\"‏‏.‏ قلت فإنا نحدث أنك تريد أن تنكح بنت أبي سلمة‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏‏.‏ قلت نعم‏.‏ فقال ‏\"‏ لو أنها لم تكن ربيبتي في حجري ما حلت لي إنها لابنة أخي من الرضاعة، أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏‏.‏ قال عروة وثويبة مولاة لأبي لهب كان أبو لهب أعتقها فأرضعت النبي صلى الله عليه وسلم فلما مات أبو لهب أريه بعض أهله بشر حيبة قال له ماذا لقيت قال أبو لهب لم ألق بعدكم غير أني سقيت في هذه بعتاقتي ثويبة‏.‏",
      "text_en": " Narrated Um Habiba:                     (daughter of Abu Sufyan) I said, \"O Allah's Apostle! Marry my sister. the daughter of Abu Sufyan.\" The Prophet said, \"Do you like that?\" I replied, \"Yes, for even now I am not your only wife and I like that my sister should share the good with me.\" The Prophet said, \"But that is not lawful for me.\" I said, We have heard that you want to marry the daughter of Abu Salama.\" He said, \"(You mean) the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my step-daughter, she would be unlawful for me to marry as she is my foster niece. I and Abu Salama were suckled by Thuwaiba. So you should not present to me your daughters or your sisters (in marriage).\" Narrated 'Ursa; Thuwaiba was the freed slave girl of Abu Lahb whom he had manumitted, and then she suckled the Prophet. When Abu Lahb died, one of his relatives saw him in a dream in a very bad state and asked him, \"What have you encountered?\" Abu Lahb said, \"I have not found any rest since I left you, except that I have been given water to drink in this (the space between his thumb and other fingers) and that is because of my manumitting Thuwaiba.\"",
      "usc_msa_ref": "38",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "id": "sahih-bukhari-5163",
      "hadith_no": "5163",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، عن عقيل، عن ابن شهاب، أن عروة بن الزبير، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم حبيبة قالت قلت يا رسول الله انكح أختي بنت أبي سفيان‏.‏ قال ‏\"‏ وتحبين ‏\"‏‏.‏ قلت نعم، لست بمخلية، وأحب من شاركني في خير أختي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن ذلك لا يحل لي ‏\"‏‏.‏ قلت يا رسول الله فوالله إنا لنتحدث أنك تريد أن تنكح درة بنت أبي سلمة‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏ فوالله لو لم تكن في حجري ما حلت لي إنها لابنة أخي من الرضاعة، أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Habiba:                     I said, \"O Allah's Apostle! Marry my sister, the daughter of Abu Sufyan.\" He said, \"Do you like that?\" I said, \"Yes, for even now I am not your only wife; and the most beloved person to share the good with me is my sister.\" The Prophet said, \"But that is not lawful for me (i.e., to be married to two sisters at a time.)\" I said, \"O Allah's Apostle! By Allah, we have heard that you want to marry Durra, the daughter of Abu Salama.\" He said, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"By Allah ! Even if she were not my stepdaughter, she would not be lawful for me to marry, for she is my foster niece, for Thuwaiba has suckled me and Abu Salama; so you should neither present your daughters, nor your sisters to me.\"",
      "usc_msa_ref": "43",
      "chain": [
        "30355",
        "20023",
        "11207",
        "11013",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "id": "sahih-bukhari-5178",
      "hadith_no": "5178",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن عراك بن مالك، أن زينب ابنة أبي سلمة، أخبرته أن أم حبيبة قالت لرسول الله صلى الله عليه وسلم إنا قد تحدثنا أنك ناكح درة بنت أبي سلمة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعلى أم سلمة لو لم أنكح أم سلمة ما حلت لي، إن أباها أخي من الرضاعة ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Salama:                     Um Habiba said to Allah's Apostle \"We have heard that you want to marry Durra bint Abu-Salama.\" Allah's Apostle said, \"Can she be married along with Um Salama (her mother)? Even if I have not married Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\" 'And there is no blame on you if you make hint of betrothal or conceal it in your hearts. Allah is Oft- Forgiving, Most Forbearing.' (2.235) Ibn `Abbas said, \"Hint your intention of marrying' is made by saying (to the widow) for example: \"I want to marry, and I wish that Allah will make a righteous lady available for me.' \" Al-Qasim said: One may say to the widow: 'I hold all respect for you, and I am interested in you; Allah will bring you much good, or something similar 'Ata said: One should hint his intention, and should not declare it openly. One may say: 'I have some need. Have good tidings. Praise be to Allah; you are fit to remarry.' She (the widow) may say in reply: I am listening to what you say,' but she should not make a promise. Her guardian should not make a promise (to somebody to get her married to him) without her knowledge. But if, while still in the Iddat period, she makes a promise to marry somebody, and he ultimately marries her, they are not to be separated by divorce (i.e., the marriage is valid).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11204",
        "244",
        "59"
      ]
    },
    {
      "id": "sahih-bukhari-5290",
      "hadith_no": "5290",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال المخنث لأخي أم سلمة عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا أدلك على ابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هذا عليكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     that while the Prophet was with her, there was an effeminate man in the house. The effeminate man said to Um Salama's brother, `Abdullah bin Abi Umaiyya, \"If Allah should make you conquer Ta'if tomorrow, I recommend that you take the daughter of Ghailan (in marriage) for (she is so fat) that she shows four folds of flesh when facing you and eight when she turns her back.\" Thereupon the Prophet said (to us), \"This (effeminate man) should not enter upon you (anymore).",
      "usc_msa_ref": "162",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5375",
      "hadith_no": "5375",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز الأعرج، قال أخبرني أبو سلمة بن عبد الرحمن، أن زينب ابنة أبي سلمة، أخبرته عن أمها أم سلمة، زوج النبي صلى الله عليه وسلم أن امرأة من أسلم يقال لها سبيعة كانت تحت زوجها، توفي عنها وهى حبلى، فخطبها أبو السنابل بن بعكك، فأبت أن تنكحه، فقال والله ما يصلح أن تنكحيه حتى تعتدي آخر الأجلين‏.‏ فمكثت قريبا من عشر ليال ثم جاءت النبي صلى الله عليه وسلم فقال ‏\"‏ انكحي ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) A lady from Bani Aslam, called Subai'a, become a widow while she was pregnant. Abu As-Sanabil bin Ba'kak demanded her hand in marriage, but she refused to marry him and said, \"By Allah, I cannot marry him unless I have completed one of the two prescribed periods.\" About ten days later (after having delivered her child), she went to the Prophet and he said (to her), \"You can marry now.\"",
      "usc_msa_ref": "239",
      "chain": [
        "30399",
        "20023",
        "11407",
        "11197",
        "10567",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-5388",
      "hadith_no": "5388",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب ابنة أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب، فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية، ثم مست بعارضيها، ثم قالت والله ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Humaid bin Nafi`:                     Zainab bint Abu Salama told me these three narrations: Zainab said: I went to Um Habiba, the wife of the Prophet when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which contained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it and then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for a dead person for more than three days unless he is her husband for whom she should mourn for four months and ten days.' \" Zainab further said: I want to Zainab bint Jahsh when her brother died. She asked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the last day to mourn for more than three days except for her husband for whom she should mourn for four months and ten days.' \" Zainab further said, \"I heard my mother, Um Salama saying that a woman came to Allah's Apostle and said, \"O Allah's Apostle! The husband of my daughter has died and she is suffering from an eye disease, can she apply kohl to her eye?\" Allah's Apostle replied, \"No,\" twice or thrice. (Every time she repeated her question) he said, \"No.\" Then Allah's Apostle added, \"It is just a matter of four months and ten days. In the Pre-Islamic Period of ignorance a widow among you should throw a globe of dung when one year has elapsed.\" I said to Zainab, \"What does 'throwing a globe of dung when one year had elapsed' mean?\" Zainab said, \"When a lady was bereaved of her husband, she would live in a wretched small room and put on the worst clothes she had and would not touch any scent till one year had elapsed. Then she would bring an animal, e.g. a donkey, a sheep or a bird and rub her body against it. The animal against which she would rub her body would scarcely survive. Only then she would come out of her room, whereupon she would be given a globe of dung which she would throw away and then she would use the scent she liked or the like.\"",
      "usc_msa_ref": "251",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-5392",
      "hadith_no": "5392",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا حميد بن نافع، عن زينب ابنة أم سلمة، عن أمها، أن امرأة، توفي زوجها فخشوا على عينيها فأتوا رسول الله صلى الله عليه وسلم فاستأذنوه في الكحل فقال ‏\"‏ لا تكحل قد كانت إحداكن تمكث في شر أحلاسها أو شر بيتها، فإذا كان حول فمر كلب رمت ببعرة، فلا حتى تمضي أربعة أشهر وعشر ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20404",
        "20020",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5399",
      "hadith_no": "5399",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن عبد الله بن أبي بكر بن عمرو بن حزم، حدثني حميد بن نافع، عن زينب ابنة أم سلمة، عن أم حبيبة ابنة أبي سفيان، لما جاءها نعي أبيها دعت بطيب، فمسحت ذراعيها وقالت ما لي بالطيب من حاجة‏.‏ لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     When Um Habiba bint Abi Sufyan was informed of her father's death, she asked for perfume and rubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days except for her husband for whom the (mourning) period is four months and ten days.\"",
      "usc_msa_ref": "257",
      "chain": [
        "28531",
        "20012",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-5423",
      "hadith_no": "5423",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، أخبرنا هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة، قلت يا رسول الله هل لي من أجر في بني أبي سلمة أن أنفق عليهم، ولست بتاركتهم هكذا وهكذا، إنما هم بني‏.‏ قال ‏\"‏ نعم لك أجر ما أنفقت عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     I said, \"O Allah's Apostle! Shall I get a reward (in the Hereafter) if I spend on the children of Abu Salama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The Prophet said, \"Yes, you will be rewarded for that which you will spend on them.\"",
      "usc_msa_ref": "282",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5426",
      "hadith_no": "5426",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني عروة، أن زينب ابنة أبي سلمة، أخبرته أن أم حبيبة زوج النبي صلى الله عليه وسلم قالت قلت يا رسول الله انكح أختي ابنة أبي سفيان‏.‏ قال ‏\"‏ وتحبين ذلك ‏\"‏‏.‏ قلت نعم لست لك بمخلية، وأحب من شاركني في الخير أختي‏.‏ فقال ‏\"‏ إن ذلك لا يحل لي ‏\"‏‏.‏ فقلت يا رسول الله فوالله إنا نتحدث أنك تريد أن تنكح درة ابنة أبي سلمة‏.‏ فقال ‏\"‏ ابنة أم سلمة ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏فوالله لو لم تكن ربيبتي في حجري ما حلت لي، إنها ابنة أخي من الرضاعة، أرضعتني وأبا سلمة ثويبة، فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏‏.‏ وقال شعيب عن الزهري قال عروة ثويبة أعتقها أبو لهب‏.‏",
      "text_en": " Narrated Um Habiba:                     (the wife of the Prophet) I said, \"O Allah's Apostle! Will you marry my sister, the daughter of Abu Sufyan.\" The Prophet said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the person I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \"O Allah's Apostle! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He said, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, she is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. So you should not present to me your daughters and sisters.\" Narrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-5798",
      "hadith_no": "5798",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن خالد، حدثنا محمد بن وهب بن عطية الدمشقي، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، أخبرنا الزهري، عن عروة بن الزبير، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم رأى في بيتها جارية في وجهها سفعة فقال ‏\"‏ استرقوا لها، فإن بها النظرة ‏\"‏‏.‏ وقال عقيل عن الزهري أخبرني عروة عن النبي صلى الله عليه وسلم‏.‏ تابعه عبد الله بن سالم عن الزبيدي‏.‏",
      "text_en": " Narrated Um Salama:                     that the Prophet saw in her house a girl whose face had a black spot. He said. \"She is under the effect of an evil eye; so treat her with a Ruqya.\"",
      "usc_msa_ref": "635",
      "chain": [
        "38496",
        "30287",
        "30373",
        "20459",
        "11013",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5948",
      "hadith_no": "5948",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا هشام بن عروة، أن عروة، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم سلمة أخبرتها أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال لعبد الله أخي أم سلمة يا عبد الله إن فتح لكم غدا الطائف، فإني أدلك على بنت غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال أبو عبد الله تقبل بأربع وتدبر بثمان يعني أربع عكن بطنها، فهى تقبل بهن، وقوله وتدبر بثمان‏.‏ يعني أطراف هذه العكن الأربع، لأنها محيطة بالجنبين حتى لحقت وإنما قال بثمان‏.‏ ولم يقل بثمانية‏.‏ وواحد الأطراف وهو ذكر، لأنه لم يقل ثمانية أطراف‏.‏",
      "text_en": " Narrated Um Salama:                     that once the Prophet was in her house, and an effeminate man was there too. The effeminate man said to `Abdullah, (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I recommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her belly) and eight at the back.\" So the Prophet said (to his wives) \"These effeminate (men) should not enter upon you (your houses).",
      "usc_msa_ref": "775",
      "chain": [
        "20357",
        "20321",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-6158",
      "hadith_no": "6158",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله إن الله لا يستحي من الحق، هل على المرأة غسل إذا احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال النبي صلى الله عليه وسلم ‏\"‏ فبم شبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     Um Sulaim said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it essential for a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if she notices discharge. On that Um Salama laughed and said, \"Does a woman get a (nocturnal sexual) discharge?\" He said, \"How then does (her) son resemble her (his mother)?\"",
      "usc_msa_ref": "113",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "id": "sahih-bukhari-6189",
      "hadith_no": "6189",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحي من الحق، فهل على المرأة غسل إذا احتلمت فقال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um Sulaim came to Allah's Apostle and said, \"O Allah's Apostle! Verily, Allah does not feel shy to tell the truth. If a woman gets a nocturnal sexual discharge (has a wet dream), is it essential for her to take a bath? He replied, \"Yes if she notices a discharge.\"",
      "usc_msa_ref": "142",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-7053",
      "hadith_no": "7053",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن هشام، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون، ولعل بعضكم أن يكون ألحن بحجته من بعض، وأقضي له على نحو ما أسمع، فمن قضيت له من حق أخيه شيئا، فلا يأخذ، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet said, \"I am only a human being, and you people have disputes. May be some one amongst you can present his case in a more eloquent and convincing manner than the other, and I give my judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody something of his brother's right then he should not take it as I have only, given him a piece of Fire.\" (See Hadith No. 638. Vol. 3)",
      "usc_msa_ref": "97",
      "chain": [
        "28531",
        "20012",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-7146",
      "hadith_no": "7146",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، أنه سمع الزهري، عن عروة، عن زينب بنت أم سلمة، عن أم حبيبة، عن زينب ابنة جحش  رضى الله عنهن  أنها قالت استيقظ النبي صلى الله عليه وسلم من النوم محمرا وجهه يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم ياجوج وماجوج مثل هذه ‏\"‏‏.‏ وعقد سفيان تسعين أو مائة‏.‏ قيل أنهلك وفينا الصالحون قال ‏\"‏ نعم، إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     The Prophet got up from his sleep with a flushed red face and said, \"None has the right to be worshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a gap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the number 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous people among us?\" The Prophet said, \"Yes, if evil increased.\"",
      "usc_msa_ref": "181",
      "chain": [
        "20357",
        "20005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "id": "sahih-bukhari-7222",
      "hadith_no": "7222",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته عن أم حبيبة بنت أبي سفيان، عن زينب ابنة جحش، أن رسول الله صلى الله عليه وسلم دخل عليها يوما فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏‏.‏ وحلق بإصبعيه الإبهام والتي تليها‏.‏ قالت زينب ابنة جحش فقلت يا رسول الله أفنهلك وفينا الصالحون قال ‏\"‏ نعم إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That one day Allah's Apostle entered upon her in a state of fear and said, \"None has the right to be worshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole has been opened in the dam of Gog and Magog like this.\" The Prophet made a circle with his index finger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though there will be righteous people among us?\" The Prophet said, \"Yes, if the (number) of evil (persons) increased.\"",
      "usc_msa_ref": "249",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "id": "sahih-bukhari-7257",
      "hadith_no": "7257",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون إلى، ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي نحو ما أسمع، فمن قضيت له بحق أخيه شيئا فلا يأخذه، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Allah's Apostle said, \"I am only a human being, and you people (opponents) come to me with your cases; and it may be that one of you can present his case eloquently in a more convincing way than the other, and I give my verdict according to what I hear. So if ever I judge (by error) and give the right of a brother to his other (brother) then he (the latter) should not take it, for I am giving him only a piece of Fire.\" (See Hadith No. 638, Vol. 3).",
      "usc_msa_ref": "281",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-7268",
      "hadith_no": "7268",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب ابنة أبي سلمة، أخبرته أن أم سلمة زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته فخرج إليهم فقال ‏\"‏ إنما أنا بشر، وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صادق فأقضي له بذلك، فمن قضيت له بحق مسلم، فإنما هي قطعة من النار، فليأخذها أو ليتركها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle heard some people quarreling at the door of his dwelling, so he went out to them and said, \"I am only a human being, and litigants with cases of dispute come to me, and someone of you may happen to be more eloquent (in presenting his case) than the other, whereby I may consider that he is truthful and pass a judgment in his favor. If ever I pass a judgment in favor of somebody whereby he takes a Muslim's right unjustly, then whatever he takes is nothing but a piece of Fire, and it is up to him to take or leave.\"",
      "usc_msa_ref": "292",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-7272",
      "hadith_no": "7272",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني عروة بن الزبير، أن زينب بنت أبي سلمة، أخبرته عن أمها أم سلمة، قالت سمع النبي صلى الله عليه وسلم جلبة خصام عند بابه فخرج عليهم فقال ‏\"‏ إنما أنا بشر، وإنه يأتيني الخصم، فلعل بعضا أن يكون أبلغ من بعض، أقضي له بذلك وأحسب أنه صادق، فمن قضيت له بحق مسلم فإنما هي قطعة من النار، فليأخذها أو ليدعها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet heard the voices of some people quarreling near his gate, so he went to them and said, \"I am only a human being and litigants with cases of disputes come to me, and maybe one of them presents his case eloquently in a more convincing and impressive way than the other, and I give my verdict in his favor thinking he is truthful. So if I give a Muslim's right to another (by mistake), then that (property) is a piece of Fire, which is up to him to take it or leave it.\" (See Hadith No. 281 )",
      "usc_msa_ref": "295",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-296-2",
      "hadith_no": "296",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ فدعاني فاضطجعت معه في الخميلة ‏.‏ قالت وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Umm Salama reported:                      While I was lying with the Messenger of Allah (may peace be upon him) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah (may peace be upon him) said: Have you menstruated? I said: Yes. He called me and I lay down",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-313-2",
      "hadith_no": "313",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت جاءت أم سليم إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق فهل على المرأة من غسل إذا احتلمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إذا رأت الماء ‏\"‏ ‏.‏ فقالت أم سلمة يا رسول الله وتحتلم المرأة فقال ‏\"‏ تربت يداك فبم يشبهها ولدها ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      Umm Sulaim went to the Apostle of Allah (may peace be upon him) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (may peace be upon him) said: Yes, when she sees the liquid (vaginal secretion). Umm Salama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-324-2",
      "hadith_no": "324",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، كانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Zainab bint Umm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-2367",
      "hadith_no": "2367",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت قلت يا رسول الله هل لي أجر في بني أبي سلمة أنفق عليهم ولست بتاركتهم هكذا وهكذا إنما هم بني ‏.‏ فقال ‏\"‏ نعم لك فيهم أجر ما أنفقت عليهم ‏\"‏ ‏.‏",
      "text_en": " Umm Salama said:                      I asked the Messenger of Allah (may peace be upon him) whether there is a reward for me if I spend oh Abu Salama's sons, and I am not going to abandon them in this state (of helplessness) for they are my sons. He (the Holy Prophet) said: Yes. For you is the reward for what you spend on them.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-3137",
      "hadith_no": "3137",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، أنها قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ قالت فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت وهو يقرأ ب ‏{‏ الطور * وكتاب مسطور‏}‏ ‏.‏",
      "text_en": " Umm Salama reported:                      I made a complaint to Allah's Messenger (may peace be upon him) of my ailment, whereupon be said: Circumambulate behind the people while riding. She said: So I circumambulated and Allah's Messenger (may peace be upon him) was at that time praying towards the side of the House and he was reciting al-Tur and a Book Inscribed (i. e. Sura Iii. of the Qur'un).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-3659",
      "hadith_no": "3659",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، أخبرنا هشام، أخبرنا أبي، عن زينب بنت أم سلمة، عن أم حبيبة بنت أبي سفيان، قالت دخل على رسول الله صلى الله عليه وسلم فقلت له هل لك في أختي بنت أبي سفيان فقال ‏\"‏ أفعل ماذا ‏\"‏ ‏.‏ قلت تنكحها ‏.‏ قال ‏\"‏ أوتحبين ذلك ‏\"‏ ‏.‏ قلت لست لك بمخلية وأحب من شركني في الخير أختي ‏.‏ قال ‏\"‏ فإنها لا تحل لي ‏\"‏ ‏.‏ قلت فإني أخبرت أنك تخطب درة بنت أبي سلمة ‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ لو أنها لم تكن ربيبتي في حجري ما حلت لي إنها ابنة أخي من الرضاعة أرضعتني وأباها ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": "  Umm Habiba, the daughter of AbuSufyan, reported:                      The Messenger of Allah (may peace be upon him) came to me and I said to him: Have you any inclination towards my the daughter of Abu Sufyan? He (the Holy Prophet) said: Then what should I do? I said: Marry her. He said: Do you like that? I said: I am not the exclusive (wife) of yours; I, therefore, wish to join my sister in good. He, said: She is not lawful for me. I said: I have been informed that you have given the proposal of marriage to Durrah daughter of Abu Salama He raid: You mean the daughter of Umm Salama? I said: Yes. He said: Even if she had not been my step-daughter brought up under my guardianship, she would not have been lawful for me, for she is the daughter of my foster-brother (Hamza), for Thuwaiba had suckled me and her father. So do not give me the proposal of the marriage of your daughters and sisters.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "id": "sahih-muslim-3661",
      "hadith_no": "3661",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، أنحدثه أن زينب بنت أبي سلمة حدثته أن أم حبيبة زوج النبي صلى الله عليه وسلم حدثتها أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله انكح أختي عزة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحبين ذلك ‏\"‏ ‏.‏ فقالت نعم يا رسول الله لست لك بمخلية وأحب من شركني في خير أختي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإن ذلك لا يحل لي ‏\"‏ ‏.‏ قالت فقلت يا رسول الله فإنا نتحدث أنك تريد أن تنكح درة بنت أبي سلمة ‏.‏ قال ‏\"‏ بنت أبي سلمة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أنها لم تكن ربيبتي في حجري ما حلت لي إنها ابنة أخي من الرضاعة أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " Umm Habiba, the wife of Allah's Apostle (may peace be upon him), reported that she said to Allah's Messenger (may peace be upon him):                      Messenger of Allah, marry my sister 'Azza, whereupon Allah's Messenger (may peace be upon him) said: Do you like it? She said: Yes, Messenger of Allah, I am not the exclusive wife of yours, and I wish that the person who joins me in good should be my sister. Thereupon Allah's Messenger (may peace be upon him) said: That is not lawful for me. I said: Messenger of Allah, we discussed that You intend to marry Durrah bint Abu Salama. He (the Holy Prophet) said: You mean the daughter of Abu Salama? She said: Yes, whereupon Allah's Messenger (may. peace be upon him) said: Even if she were not the step-daughter of mine, brought up under my guardianship, she would not have been lawful for me, for she is the daughter of my foster-brother. Thuwaiba gave me suck and to Abu Salama (also), so do not offer to me your daughters and sisters.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-3676",
      "hadith_no": "3676",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن نافع، عن زينب بنت أم سلمة، قالت قالت أم سلمة لعائشة إنه يدخل عليك الغلام الأيفع الذي ما أحب أن يدخل على ‏.‏ قال فقالت عائشة أما لك في رسول الله صلى الله عليه وسلم أسوة قالت إن امرأة أبي حذيفة قالت يا رسول الله إن سالما يدخل على وهو رجل وفي نفس أبي حذيفة منه شىء ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرضعيه حتى يدخل عليك ‏\"‏ ‏.‏",
      "text_en": " Umm Salama said to 'A'isha (Allah be pleased with her):                      A young boy who is at the threshold of puberty comes to you. I, however, do not like that he should come to me, whereupon 'A'isha (Allah be pleased with her) said: Don't you see in Allah's Messenger (may peace be upon him) a model for you? She also said: The wife of Abu Hudhaifa said: Messenger of Allah, Salim comes to me and now he is a (grown-up) person, and there is something that (rankles) in the mind of Abu Hudhaifa about him, whereupon Allah's Messenger (may peace be upon him) said: Suckle him (so that he may become your foster-child), and thus he may be able to come to you (freely).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-3678",
      "hadith_no": "3678",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، أنه قال أخبرني أبو عبيدة بن عبد الله بن زمعة، أن أمه، زينب بنت أبي سلمة أخبرته أن أمها أم سلمة زوج النبي صلى الله عليه وسلم كانت تقول أبى سائر أزواج النبي صلى الله عليه وسلم أن يدخلن عليهن أحدا بتلك الرضاعة وقلن لعائشة والله ما نرى هذا إلا رخصة أرخصها رسول الله صلى الله عليه وسلم لسالم خاصة فما هو بداخل علينا أحد بهذه الرضاعة ولا رائينا.",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), used to say that all wives of Allah's Apostle (may peace be upon him) disclaimed the idea that one with this type of fosterage (having been suckled after the proper period) should come to them. and said to 'A'isha:                      By Allah, we do not find this but a sort of concession given by Allah's Messenger (may peace be upon him) only for Salim, and no one was ging to be allowed to enter (our houses) with this type of fosterage and we do not subscribe to this view.",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-3798",
      "hadith_no": "3798",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب ثم دخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب سمعت أمي أم سلمة، تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ مرتين أو ثلاثا كل ذلك يقول لا ثم قال ‏\"‏ إنما هي أربعة أشهر وعشر وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال حميد قلت لزينب وما ترمي بالبعرة على رأس الحول فقالت زينب كانت المرأة إذا توفي عنها زوجها دخلت حفشا ولبست شر ثيابها ولم تمس طيبا ولا شيئا حتى تمر بها سنة ثم تؤتى بدابة حمار أو شاة أو طير فتفتض به فقلما تفتض بشىء إلا مات ثم تخرج فتعطى بعرة فترمي بها ثم تراجع بعد ما شاءت من طيب أو غيره ‏.‏",
      "text_en": " Zainab (bint Abu Salama) (Allah be pleased with her) reported:                      I went to Umm Habiba, the wife of Allah's Apostle (may peace be upon him), when her father Abu Sufyan had died. Umm Habiba sent for a perfume having yellowness in it or something else like it, and she applied it to a girl and then rubbed it on her cheeks and then said: By Allah, I need no perfume but for the fact that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafter to mourn for the dead beyond three days, but (in case of the death) of the husband it is permissible for four months and ten days.\" Zainab said: I then visited Zainab hint Jahsh (Allah be pleased with her) when her brother died and she sent for perfume and applied it and then said: By Allah, I don't feel any need for the perfume but that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafbler to mourn the dead beyond three days except in case of her husband (for whom she can mourn) for four months and ten days.\" Zainab (Allah be pleased with her) said: I heard my mother Umm Salama (Allah be pleased with her) as saying: A woman came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger. I have a daughter whose husband has died and there has developed some trouble in her eye; should we apply collyrium to it? Thereupon Allah's Messenger (may peace be upon him) said: No (repeating it twice or thrice, saying only, NO\" all the time). Then he said: It is only four mouths and ten days, whereas in the preIslamic period none of you threw away the dung until one year had passed. Humaid said: I said to Zainab: What is this throwing of dung until a year is passed? Zainab said: When the husband of a woman died, she went into a hut and put on her worst clothes, and did not apply perfume or something like it until a year was over. Then an animal like a donkey, or a goat, or a bird was brought to her and she rubbed her hand over it, and it so happened that one on which she rubbed her hand died. She then came out of her house and she was given dung and she threw it and then she made use of anything like perfume or something else as she liked.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-3802",
      "hadith_no": "3802",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن نافع، قال سمعت زينب بنت أم سلمة، قالت توفي حميم لأم حبيبة فدعت بصفرة فمسحته بذراعيها وقالت إنما أصنع هذا لأني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": "  Zainab bint Umm Salama (Allah be pleased with her) reported that a relative of Umm Habiba (Allah he pleased with her) died. She sent for a yellow (perfume) and applied that to her forearm and said:                      I, am doing it, for I have heard Allah's Messenger (may peace be upon him) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-3807",
      "hadith_no": "3807",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا عمرو الناقد، وابن أبي عمر، - واللفظ لعمرو - حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن حميد بن نافع، عن زينب بنت أبي سلمة، قالت لما أتى أم حبيبة نعي أبي سفيان دعت في اليوم الثالث بصفرة فمسحت به ذراعيها وعارضيها وقالت كنت عن هذا غنية سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Zainab bint Abu Salama reported that when the news of the death of Abu Safyan came to Umm Habiba she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said:                      I had in fact no need of it, but I heard Allah's Messenger (may peace be upon him) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30421",
        "20005",
        "11241",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-4570",
      "hadith_no": "4570",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي له على نحو مما أسمع منه فمن قطعت له من حق أخيه شيئا فلا يأخذه فإنما أقطع له به قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) as saying:                      You bring to me, for (judgment) your disputes, some of you perhaps being more eloquent in their plea than others, so I give judgment on their behalf according to what I hear from them. (Bear in mind, in my judgment) if I slice off anything for him from the right of his brother, he should not accept that, for I sliced off for him a portion from the Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-4572",
      "hadith_no": "4572",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، أخبرني يونس، عن ابن، شهاب أخبرني عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم سمع جلبة خصم بباب حجرته فخرج إليهم فقال ‏\"‏ إنما أنا بشر وإنه يأتيني الخصم فلعل بعضهم أن يكون أبلغ من بعض فأحسب أنه صادق فأقضي له فمن قضيت له بحق مسلم فإنما هي قطعة من النار فليحملها أو يذرها ‏\"‏ ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) heard the clamour of contenders at the door of his apartment. He went to them, and said:                      I am a human being and the claimants bring to me (the dispute) and perhaps some of them are more eloquent than the others. I judge him to be on the right, and thus decide in his favcur. So he whom I, by my judgment, (give the undue share) out of the right of a Muslim,. I give him a portion of Fire; he may burden himself with it or abandon it.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-5732",
      "hadith_no": "5732",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا أبو كريب، حدثنا  أبو أسامة، قالا حدثنا الوليد بن كثير، حدثني محمد بن عمرو بن عطاء، حدثتني زينب، بنت أم سلمة قالت كان اسمي برة فسماني رسول الله صلى الله عليه وسلم زينب ‏.‏ قالت ودخلت عليه زينب بنت جحش واسمها برة فسماها زينب ‏.‏",
      "text_en": " Zainab, daughter of Umm Salama, reported:                      My name first was Barra. Allah's Messenger (may peace be upon him) gave me the name of Zainab. Then there entered (into the house of Allah's Prophet as a wife) Zainab, daughter of Jahsh, and her name was also Barra, and he gave her the name of Zainab.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20347",
        "30216",
        "20318",
        "11230",
        "11220",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-5733",
      "hadith_no": "5733",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا عمرو الناقد، حدثنا هاشم بن القاسم، حدثنا الليث، عن يزيد بن أبي حبيب، عن محمد بن عمرو بن عطاء، قال سميت ابنتي برة فقالت لي زينب بنت أبي سلمة إن رسول الله صلى الله عليه وسلم نهى عن هذا الاسم وسميت برة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزكوا أنفسكم الله أعلم بأهل البر منكم ‏\"‏ ‏.‏ فقالوا بم نسميها قال ‏\"‏ سموها زينب ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. 'Amr b. 'Ata' reported:                      I had given the name Barra to my daughter. Zainab, daughter of Abu Salama, told me that Allah's' Messenger (may peace be upon him) had forbidden me to give this name. (She said): I was also called Barra, but Allah's Messenger (may peace be upon him) said: Don't hold yourself to be pious. It is God alone who knows the people of piety among you. They (the Companions) said: Then, what name should we give to her? He said: Name her as Zainab.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20390",
        "20023",
        "11411",
        "11220",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-5819",
      "hadith_no": "5819",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، ح وحدثنا إسحاق، بن إبراهيم أخبرنا جرير، ح وحدثنا أبو كريب، حدثنا أبو معاوية، كلهم عن هشام، ح وحدثنا أبو كريب، أيضا - واللفظ هذا - حدثنا ابن نمير، حدثنا هشام، عن أبيه، عن زينب، بنت أم سلمة عن أم سلمة، أن مخنثا، كان عندها ورسول الله صلى الله عليه وسلم في البيت فقال لأخي أم سلمة يا عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا فإني أدلك على بنت غيلان فإنها تقبل بأربع وتدبر بثمان ‏.‏ قال فسمعه رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا يدخل هؤلاء عليكم ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported that she had a eunuch (as a slave) in her house. Allah's Messenger imay peace be upon him) was once in the house that he (the eunuch) said to the brother of Umm Salama:                      Abdullahb. Aba Umayya. if Allah grants you victory in Ta'if on the next day, I will show you the daughter of Ghailan for she has four folds (upon her body) on the front side of her stomach and eight folds on the back. Allah's Messenger (may peace be upon him) heard this and he said: Such (people) should not visit you.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20032",
        "30123",
        "4057",
        "30216",
        "20295",
        "30212",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-5854",
      "hadith_no": "5854",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود حدثنا محمد بن حرب، حدثني محمد بن الوليد، الزبيدي عن الزهري، عن عروة بن الزبير، عن زينب بنت أم سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال لجارية في بيت أم سلمة زوج النبي صلى الله عليه وسلم رأى بوجهها سفعة فقال ‏\"‏ بها نظرة فاسترقوا لها ‏\"‏ ‏.‏ يعني بوجهها صفرة ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) said to a small girl in the house of Umm Salama that he had been seeing on her face black stains and told her that that was due to the infiluence of an evil eye, and he asked that she should be cured with the help of incantation (hoping) that her face should become spotles.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "30373",
        "20459",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-muslim-7416",
      "hadith_no": "7416",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن الزهري، عن عروة، عن زينب، بنت أم سلمة عن أم حبيبة، عن زينب بنت جحش، أن النبي صلى الله عليه وسلم استيقظ من نومه وهو يقول ‏\"‏ لا إله إلا الله ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏ ‏.‏ وعقد سفيان بيده عشرة ‏.‏ قلت يا رسول الله أنهلك وفينا الصالحون قال ‏\"‏ نعم إذا كثر الخبث ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Jahsh reported that Allah's Apostle (may peace be upon him) got up from sleep saying:                      There is no god but Allah; there is a destruction in store for Arabia because of turmoil which is at hand, the barrier of Gog and Magog has opened so much. And Sufyan made a sign of ten with the help of his hand (in order to indicate the width of the gap) and I said: Allah's Messenger, would we be perished in spite of the fact that there would be good people amongst us? Thereupon he said: Of course, but only when the evil predominates.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "id": "sahih-muslim-7417",
      "hadith_no": "7417",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسعيد بن عمرو الأشعثي، وزهير بن حرب، وابن، أبي عمر قالوا حدثنا سفيان، عن الزهري، بهذا الإسناد ‏.‏ وزادوا في الإسناد عن سفيان، فقالوا عن زينب بنت أبي سلمة، عن حبيبة، عن أم حبيبة، عن زينب بنت جحش، ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zainab bint Jahsh with a slight variation in the chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30465",
        "30022",
        "30421",
        "20005",
        "244",
        "59"
      ]
    },
    {
      "id": "sahih-muslim-7418",
      "hadith_no": "7418",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني  عروة بن الزبير، أن زينب بنت أبي سلمة، أخبرته أن أم حبيبة بنت أبي سفيان أخبرتها  أن زينب بنت جحش زوج النبي صلى الله عليه وسلم قالت خرج رسول الله صلى الله عليه وسلم يوما فزعا محمرا وجهه يقول ‏\"‏ لا إله إلا الله ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏ ‏.‏ وحلق بإصبعه الإبهام والتي تليها ‏.‏ قالت فقلت يا رسول الله أنهلك وفينا الصالحون قال ‏\"‏ نعم إذا كثر الخبث ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Jahsh, the wife of Allah's Apostle (may peace be upon him), reported that one day Allah's Messenger (may peace be upon him) came out in a state of excitement with his face quite red. And he was saying:                      There is no god but Allah; there is a destruction in store for Arabia beciuse of the turmoil which is near at hand as the barrier of Gog and Magog has been opened like it, and he (in order to explain it) made a ring with the help o his thumb and forefinger. I said: Allah's Messenger, would we be destroyed despite the fact that there would be pious people amongst us? He said: Yes, when the evil would predominate.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "id": "sunan-abi-daud-293",
      "hadith_no": "293",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عمرو بن أبي الحجاج أبو معمر، حدثنا عبد الوارث، عن الحسين، عن يحيى بن أبي كثير، عن أبي سلمة، قال أخبرتني زينب بنت أبي سلمة، أن امرأة، كانت تهراق الدم - وكانت تحت عبد الرحمن بن عوف - أن رسول الله صلى الله عليه وسلم أمرها أن تغتسل عند كل صلاة وتصلي وأخبرني أن أم بكر أخبرته أن عائشة قالت إن رسول الله صلى الله عليه وسلم قال في المرأة ترى ما يريبها بعد الطهر ‏\"‏ إنما هي - أو قال إنما هو - عرق أو قال عروق ‏\"‏ ‏.‏ قال أبو داود وفي حديث ابن عقيل الأمران جميعا وقال ‏\"‏ إن قويت فاغتسلي لكل صلاة وإلا فاجمعي ‏\"‏ ‏.‏ كما قال القاسم في حديثه وقد روي هذا القول عن سعيد بن جبير عن علي وابن عباس رضى الله عنهما ‏.‏",
      "text_en": " Narrated Zaynab daughter of AbuSalamah:                     AbuSalamah said: Zaynab daughter of AbuSalamah reported to me that a woman had a copious flow of blood. She was the wife of AbdurRahman ibn Awf. The Messenger of Allah (ﷺ) commanded her to take a bath at the time of every prayer, and then to pray. He reported to me that Umm Bakr told him that Aisha said: The Messenger of Allah (ﷺ) said about a woman who was doubtful of her menstruation after purification that it was a vein or veins.Abu Dawud said: The two commands (of which the Prophet gave option) were as follows in the version reported by Ibn 'Aqil: He said: If you are strong enough, then take a bath for every prayer; otherwise combine the (two prayers), as al-Qasim reported in his version. This statement was also narrated by Sa'id b. Jubair from 'Ali and Ibn 'Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11449",
        "10567",
        "244"
      ]
    },
    {
      "id": "sunan-abi-daud-1882",
      "hadith_no": "1882",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، عن مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أنها قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ قالت فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت وهو يقرأ ب ‏{‏ الطور * وكتاب مسطور ‏}‏ ‏.‏",
      "text_en": " Umm Salamah said I complained to the Apostle of Allaah(ﷺ) that I was ill. He said “Perform the circumambulation riding behind the people”. She said “I performed circumambulation and the Apostle of Allaah(ﷺ) was praying towards the side of the House(the Ka’bah) and reciting “by al Tur and a Book inscribed”.”",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244"
      ]
    },
    {
      "id": "sunan-abi-daud-1999",
      "hadith_no": "1999",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، ويحيى بن معين، - المعنى واحد - قالا حدثنا ابن أبي عدي، عن محمد بن إسحاق، حدثنا أبو عبيدة بن عبد الله بن زمعة، عن أبيه، وعن أمه، زينب بنت أبي سلمة عن أم سلمة، - يحدثانه جميعا ذاك عنها - قالت كانت ليلتي التي يصير إلى فيها رسول الله صلى الله عليه وسلم مساء يوم النحر فصار إلى ودخل على وهب بن زمعة ومعه رجل من آل أبي أمية متقمصين فقال رسول الله صلى الله عليه وسلم لوهب ‏\"‏ هل أفضت أبا عبد الله ‏\"‏ ‏.‏ قال لا والله يا رسول الله ‏.‏ قال صلى الله عليه وسلم ‏\"‏ انزع عنك القميص ‏\"‏ ‏.‏ قال فنزعه من رأسه ونزع صاحبه قميصه من رأسه ثم قال ولم يا رسول الله قال ‏\"‏ إن هذا يوم رخص لكم إذا أنتم رميتم الجمرة أن تحلوا ‏\"‏ ‏.‏ يعني من كل ما حرمتم منه إلا النساء ‏\"‏ فإذا أمسيتم قبل أن تطوفوا هذا البيت صرتم حرما كهيئتكم قبل أن ترموا الجمرة حتى تطوفوا به ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The night which the Messenger of Allah (ﷺ) passed with me was the one that followed the day of sacrifice. He came to me and Wahb ibn Zam'ah also visited me. A man belonging to the lineage of AbuUmayyah accompanied him. Both of them were wearing shirts.  The Messenger of Allah (ﷺ) said to Wahb: Did you perform the obligatory circumambulation (Tawaf az-Ziyarah), AbuAbdullah?  He said: No, by Allah Messenger of Allah.  He (the Prophet) said: Take off your shirt. He then took it off over his head, and his companion too took his shirt off over his head.  He then asked: And why (this), Messenger of Allah?  He replied: On this day you have been allowed to take off ihram when you have thrown the stones at the jamrahs, that is, everything prohibited during the state of ihram is lawful except intercourse with a woman. If the evening comes before you go round this House (the Ka'bah) you will remain in the sacred state (i.e. ihram), just like the state in which you were before you threw stones at the jamrahs, until you perform the circumambulation of it (i.e. the Ka'bah).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30020",
        "20276",
        "11107",
        "11120",
        "244"
      ]
    },
    {
      "id": "sunan-abi-daud-2056",
      "hadith_no": "2056",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، عن هشام بن عروة، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، أن أم حبيبة، قالت يا رسول الله هل لك في أختي قال ‏\"‏ فأفعل ماذا ‏\"‏ ‏.‏ قالت فتنكحها ‏.‏ قال ‏\"‏ أختك ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ أوتحبين ذاك ‏\"‏ ‏.‏ قالت لست بمخلية بك وأحب من شركني في خير أختي ‏.‏ قال ‏\"‏ فإنها لا تحل لي ‏\"‏ ‏.‏ قالت فوالله لقد أخبرت أنك تخطب درة - أو ذرة شك زهير - بنت أبي سلمة ‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ أما والله لو لم تكن ربيبتي في حجري ما حلت لي إنها ابنة أخي من الرضاعة أرضعتني وأباها ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah reported Umm Habibah said “Are you interested in my sister, Apostle of Allaah(ﷺ)?” He said “What should I do?” She said “You marry her” He said “Your sister?” She said “Yes”. He said “Do you like that?” she said “I am not alone with you of those who share me in this good, my sister is most to my liking. He said “She is not lawful for me.” She said “By Allaah, I was told that you were going to betroth with you Darrah to Durrah , the narrator Zuhair doubted the daughter of Abu Salamah. He said “The daughter of Umm Salamah? She said “Yes”. He said “(She is my step daughter). Even if she had not been my step daughter under my protection, she would not have been lawful for me. She is my foster niece (daughter of my brother by fosterage). Thuwaibah suckled me as well as his father (Abu Salamah). So do not present to me your daughters and your sisters.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11065",
        "10511",
        "244",
        "56",
        "59"
      ]
    },
    {
      "id": "sunan-abi-daud-2299",
      "hadith_no": "2299",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة حين توفي أبوها أبو سفيان فدعت بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب ودخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول وهو على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب وسمعت أمي أم سلمة تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ مرتين أو ثلاثا كل ذلك يقول ‏\"‏ لا ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هي أربعة أشهر وعشر وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال حميد فقلت لزينب وما ترمي بالبعرة على رأس الحول فقالت زينب كانت المرأة إذا توفي عنها زوجها دخلت حفشا ولبست شر ثيابها ولم تمس طيبا ولا شيئا حتى تمر بها سنة ثم تؤتى بدابة حمار أو شاة أو طائر فتفتض به فقلما تفتض بشىء إلا مات ثم تخرج فتعطى بعرة فترمي بها ثم تراجع بعد ما شاءت من طيب أو غيره ‏.‏ قال أبو داود الحفش بيت صغير ‏.‏",
      "text_en": " Humaid ibn Nafi' reported the following three traditions on the authority of Zaynab, daughter of Abu Salamah:                       Zainab said: I visited Umm Habibah when her father AbuSufyan, died. She asked for some yellow perfume containing saffron (khaluq) or something else. Then she applied it to a girl and touched her cheeks.  She said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  Zaynab said: I also visited Zaynab, daughter of Jahsh, when her brother died. She asked for some perfume and used it upon herself.  She then said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say when he was on the pulpit: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  Zaynab said: I heard my mother, Umm Salamah, say: A woman came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, the husband of my daughter has died, and she is suffering from sore eyes; may we put antimony in her eyes?  The Messenger of Allah (ﷺ) said: No. He said this twice or thrice. Each time he said: No. The Messenger of Allah (ﷺ) said: The waiting period is now four months and ten days. In pre-Islamic days one of you used to throw away a piece of dung at the end of a year.  Humayd said: I asked Zaynab: What do you mean by throwing away a piece of dung at the end of a year.  Zaynab replied: When the husband of a woman died, she entered a small cell and put on shabby clothes, not touching perfume or any other thing until a year passed. Then an animal such as donkey or sheep or bird was provided for her. She rubbed herself with it. The animal with which she rubbed herself rarely survived. She then came out and was given a piece of dung which she threw away. She then used perfume or something else which she desired.Abu Dawud said: The Arabic word \"hafsh\" means a small cell.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "id": "sunan-abi-daud-3583",
      "hadith_no": "3583",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن هشام بن عروة، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أنا بشر وإنكم تختصمون إلى ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي له على نحو ما أسمع منه فمن قضيت له من حق أخيه بشىء فلا يأخذ منه شيئا فإنما أقطع له قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah reported the Messenger of Allah (ﷺ) as saying:                      \"I am only a human being, and you bring your disputes to me, some perhaps being more eloquent in their plea than others, so that I give judgement on their behalf according to what I hear from them. Therefore, whatever I decide for anyone which by right belongs to his brother, he must not take anything, for I am granting him only a portion of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-4148",
      "hadith_no": "4148",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن زينب بنت أم سلمة، عن أم سلمة، قالت كان فراشها حيال مسجد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     Her bedding was in front of the place of prayer of the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11282",
        "11047",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-4929",
      "hadith_no": "4929",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام، - يعني ابن عروة - عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم دخل عليها وعندها مخنث وهو يقول لعبد الله أخيها إن يفتح الله الطائف غدا دللتك على امرأة تقبل بأربع وتدبر بثمان ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخرجوهم من بيوتكم ‏\"‏ ‏.‏ قال أبو داود المرأة كان لها أربع عكن في بطنها ‏.‏",
      "text_en": " Umm Salamah said that the Prophet (May peace be upon him) came upon her when there was with her a hermaohrodite (mukhannath) who said to her brother ‘Abd Allah (b. Abi Umayyah) :                      if Allah conquers al-Ta’if for you tomorrow, I shall lead you to a woman who has four folds of fats in front and eight behind. Thereupon the Prophet (May peace be upon him) said: Put them out of your houses.Abu Dawud said : The woman had four folds of fat on her belly.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-122",
      "hadith_no": "122",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت جاءت أم سليم بنت ملحان إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق فهل على المرأة تعني غسلا إذا هي رأت في المنام مثل ما يرى الرجل قال ‏\"‏ نعم إذا هي رأت الماء فلتغتسل ‏\"‏ ‏.‏ قالت أم سلمة قلت لها فضحت النساء يا أم سليم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول عامة الفقهاء أن المرأة إذا رأت في المنام مثل ما يرى الرجل فأنزلت أن عليها الغسل ‏.‏ وبه يقول سفيان الثوري والشافعي ‏.‏ قال وفي الباب عن أم سليم وخولة وعائشة وأنس ‏.‏",
      "text_en": " Umm Salamah narrated:                     Umm Sulaim bint Milhan came to the Prophet and she said: 'O Messenger of Allah! Indeed Allah is not embarrassed of the truth. So is it required of a woman - meaning Ghusl - when she sees in her sleep similar to what a man sees?' He replied: 'Yes. When she finds water (wetness), then she is perform Ghusl.'\" Umm Salamah said: \"I said to her: 'O Umm SuIaim! You have disgraced the women!'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1235",
      "hadith_no": "1235",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا الأنصاري، حدثنا معن بن عيسى، أنبأنا مالك بن أنس، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب فدعت بطيب فيه صفرة خلوق أو غيره فدهنت به جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاثة أيام إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " Humaid bin Nafi narrated that :                     Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"",
      "usc_msa_ref": "",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1339",
      "hadith_no": "1339",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم أن يكون ألحن بحجته من بعض فإن قضيت لأحد منكم بشيء من حق أخيه فإنما أقطع له قطعة من النار فلا يأخذ منه شيئا ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن صحيح ‏.‏",
      "text_en": " Umm Salamah narrated that the Messenger of Allah (ﷺ) said:                      \"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it.\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2187-2",
      "hadith_no": "2187",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، وأبو بكر بن نافع وغير واحد قالوا حدثنا سفيان بن عيينة، عن الزهري، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن حبيبة، عن أم حبيبة، عن زينب بنت جحش، قالت استيقظ رسول الله صلى الله عليه وسلم من نوم محمرا وجهه وهو يقول ‏\"‏ لا إله إلا الله يرددها ثلاث مرات ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏ وعقد عشرا ‏.‏ قالت زينب قلت يا رسول الله أفنهلك وفينا الصالحون قال ‏\"‏ نعم إذا كثر الخبث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد جود سفيان هذا الحديث ‏.‏ هكذا روى الحميدي وعلي بن المديني وغير واحد من الحفاظ عن سفيان بن عيينة نحو هذا ‏.‏ وقال الحميدي قال سفيان بن عيينة حفظت من الزهري في هذا الحديث أربع نسوة زينب بنت أبي سلمة عن حبيبة وهما ربيبتا النبي صلى الله عليه وسلم عن أم حبيبة عن زينب بنت جحش زوجى النبي صلى الله عليه وسلم ‏.‏ وروى معمر وغيره هذا الحديث عن الزهري ولم يذكروا فيه عن حبيبة وقد روى بعض أصحاب ابن عيينة هذا الحديث عن ابن عيينة ولم يذكروا فيه عن أم حبيبة ‏.‏",
      "text_en": " Zainab bint Jahsh said:                     \"One day the Messenger of Allah(s.a.w) awoke from sleep with a flushed red face, and said: 'La Ilahaillallah. He repeated it thrice. 'Woe to the Arabs from the evil drawn near. Today a gap has been made in the wall of Ya'juj and Ma'juj like this.' And he formed ten(with his fingers).\" Zainab said: \"I said: 'O Messenger of Allah! Shall we be destroyed while they are righteous among us?' He said: 'Yes, when the evil abounds.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38231",
        "20005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "id": "sunan-an-nasai-183",
      "hadith_no": "183",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن جعفر بن محمد، عن أبيه، عن علي بن الحسين، عن زينب بنت أم سلمة، عن أم سلمة، أن رسول الله صلى الله عليه وسلم أكل كتفا فجاءه بلال فخرج إلى الصلاة ولم يمس ماء ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Messenger of Allah (ﷺ) at (meat from) a shoulder, then Bilal came to him and he went out to pray, and he did not touch water.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "10898",
        "11442",
        "11045",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-198",
      "hadith_no": "198",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن امرأة، قالت يا رسول الله إن الله لا يستحيي من الحق هل على المرأة غسل إذا هي احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏ ‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ففيم يشبهها الولد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that a woman said:                      \"O Messenger of Allah, Allah is not shy to tell the truth. Does a women have to perform Ghusl if she has a wet dream?\" He said: \"Yes, if she sees water.\"[1] Umm Salamah laughed and said: \"Do women really have wet dreams?\" The Messenger of Allah (ﷺ) said: \"How else would her child resemble her?\"[1] That is, if she has an emission of the fluid of an orgasm.",
      "usc_msa_ref": "",
      "chain": [
        "30020",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-285",
      "hadith_no": "285",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، ح وأنبأنا عبيد الله بن سعيد، وإسحاق بن إبراهيم، قالا حدثنا معاذ بن هشام، - واللفظ له - قال حدثني أبي، عن يحيى، قال حدثنا أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came, so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me and I lied down with him under the blanket.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "30359",
        "30123",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-371",
      "hadith_no": "371",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، ح وأنبأنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي ح، وأنبأنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، قال حدثني أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏ واللفظ لعبيد الله بن سعيد ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me to lie down with him under the blanket.\" This is the wording of 'Ubaidullah bin Sa'eed.[1][1] That is, one of the narrators in one of the chains, as the author reported it throughdifferent chains, as he did when it preceded, see No. 284.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20287",
        "30123",
        "20287",
        "20295",
        "34033",
        "20226",
        "11065",
        "11449",
        "10567",
        "244"
      ]
    },
    {
      "id": "sunan-an-nasai-2925",
      "hadith_no": "2925",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم إني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ ب ‏{‏ الطور * وكتاب مسطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Salamah said:                     \"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-2927",
      "hadith_no": "2927",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن مالك، عن أبي الأسود، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، أنها قدمت مكة وهي مريضة فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ طوفي من وراء المصلين وأنت راكبة ‏\"‏ ‏.‏ قالت فسمعت رسول الله صلى الله عليه وسلم وهو عند الكعبة يقرأ ‏{‏ والطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Urwah from Zainab bint Umm Salamab, from Umm Salamah, that:                     she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20033",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-3285",
      "hadith_no": "3285",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أن عروة بن الزبير، حدثه عن زينب بنت أبي سلمة، أن أم حبيبة، زوج النبي صلى الله عليه وسلم قالت يا رسول الله أنكح بنت أبي تعني أختها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وتحبين ذلك ‏\"‏ ‏.‏ قالت نعم لست لك بمخلية وأحب من شركتني في خير أختي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن ذلك لا يحل ‏\"‏ ‏.‏ قالت أم حبيبة يا رسول الله والله لقد تحدثنا أنك تنكح درة بنت أبي سلمة ‏.‏ فقال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ قالت أم حبيبة نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فوالله لو أنها لم تكن ربيبتي في حجري ما حلت إنها لابنة أخي من الرضاعة أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Habibah, the wife of the Prophet said:                      \"O Messenger of Allah, marry the daughter of my father\" - meaning her sister. The Messenger of Allah said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" The Prophet said: \"That is not permissible for me.\" Umm Habibah said: \"O Messenger of Allah, by Allah, we have been saying that you want to marry Durrah bint Abi Salamah.\" He said: \"The daughter of Umm Salamah?\" I said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20475",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "id": "sunan-an-nasai-3286",
      "hadith_no": "3286",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن عراك بن مالك، أن زينب بنت أبي سلمة، أخبرته أن أم حبيبة قالت لرسول الله صلى الله عليه وسلم إنا قد تحدثنا أنك ناكح درة بنت أبي سلمة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعلى أم سلمة لو أني لم أنكح أم سلمة ما حلت لي إن أباها أخي من الرضاعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Irak bin Malik that Zainab bint Abi Salamah told him, that Umm Habibah said to the Messenger of Allah:                      \"We have been saying that you want to marry Durrah bint Abi Salamah.\" The Messenger of Allah said: \"As a co-wife to Umm Salamah? Even if I were not married to Umm Salamah, she would not be permissible to me, for her father is my brother through breast-feeding.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11204",
        "244",
        "59"
      ]
    },
    {
      "id": "sunan-an-nasai-3287",
      "hadith_no": "3287",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هناد بن السري، عن عبدة، عن هشام، عن أبيه، عن زينب بنت أبي سلمة، عن أم حبيبة، أنها قالت يا رسول الله هل لك في أختي قال ‏\"‏ فأصنع ماذا ‏\"‏ ‏.‏ قالت تزوجها ‏.‏ قال ‏\"‏ فإن ذلك أحب إليك ‏\"‏ ‏.‏ قالت نعم لست لك بمخلية وأحب من يشركني في خير أختي ‏.‏ قال ‏\"‏ إنها لا تحل لي ‏\"‏ ‏.‏ قالت فإنه قد بلغني أنك تخطب درة بنت أم سلمة ‏.‏ قال ‏\"‏ بنت أبي سلمة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ والله لو لم تكن ربيبتي ما حلت لي إنها لابنة أخي من الرضاعة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Habibah that she said:                      \"O Messenger of Allah, what do you think of my sister?\" He said: \"What for?\" She said: \"For marriage.\" He said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" He said: \"She is not permissible for me (to marry).\" She said: \"But I heard that you want to marry Durrah, the daughter of Umm Salamah.\" He said: \"The daughter of Umm Salamah?\" She said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Do not offer your daughters and sisters to me in marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11065",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "id": "sunan-an-nasai-3325",
      "hadith_no": "3325",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث، قال أخبرني أبي، عن جدي، قال حدثني عقيل، عن ابن شهاب، أخبرني أبو عبيدة بن عبد الله بن زمعة، أن أمه، زينب بنت أبي سلمة أخبرته أن أمها أم سلمة زوج النبي صلى الله عليه وسلم كانت تقول أبى سائر أزواج النبي صلى الله عليه وسلم أن يدخل عليهن بتلك الرضاعة وقلن لعائشة والله ما نرى هذه إلا رخصة رخصها رسول الله صلى الله عليه وسلم خاصة لسالم فلا يدخل علينا أحد بهذه الرضاعة ولا يرانا ‏.‏",
      "text_en": " Zainab bint Abu Salamah narrated that her mother Umm Salamah, the wife of the Prophet, used to say:                      \"The rest of the wives of the Prophet refused for anyone to enter upon them on the basis of that type of breast-feeding, meaning breast-feeding of an adult. They said to 'Aishah: 'By Allah, we think that this is a concession which the Messenger of Allah granted only to Salim. No one will enter upon us, nor see us on the basis of this type of breast-feeding.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "244"
      ]
    },
    {
      "id": "sunan-an-nasai-3500",
      "hadith_no": "3500",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا هناد بن السري، عن وكيع، عن شعبة، قال حدثني حميد بن نافع، عن زينب بنت أم سلمة، قالت أم حبيبة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاثة أيام إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab bint Umm Salamah said:                      \"Umm Habibah said: 'I heard the Messenger of Allah say: It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband; (she mourns for him for) four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20020",
        "11157",
        "244",
        "59"
      ]
    },
    {
      "id": "sunan-an-nasai-3501",
      "hadith_no": "3501",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن حميد بن نافع، عن زينب بنت أم سلمة، قلت عن أمها، قال نعم إن النبي صلى الله عليه وسلم سئل عن امرأة توفي عنها زوجها فخافوا على عينها أتكتحل فقال ‏\"‏ قد كانت إحداكن تمكث في بيتها في شر أحلاسها حولا ثم خرجت فلا أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Umm Salamah -I (the narrator) said:                      \"From her mother?\" He said: \"Yes\" - \"that the Prophet was asked about a woman whose husband had died but they were worried about her eyes - could she use kohl?\" He said: \"One of you used to stay in her house wearing her shabbiest clothes for a year, then she would come out. No, (the mourning period is) four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-3516",
      "hadith_no": "3516",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث بن سعد، قال حدثني أبي، عن جدي، قال حدثني جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن أبي سلمة بن عبد الرحمن، أن زينب بنت أبي سلمة، أخبرته عن أمها أم سلمة، زوج النبي صلى الله عليه وسلم أن امرأة من أسلم يقال لها سبيعة كانت تحت زوجها فتوفي عنها وهي حبلى فخطبها أبو السنابل بن بعكك فأبت أن تنكحه فقال ما يصلح لك أن تنكحي حتى تعتدي آخر الأجلين ‏.‏ فمكثت قريبا من عشرين ليلة ثم نفست فجاءت رسول الله صلى الله عليه وسلم فقال ‏\"‏ انكحي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin 'Abdur-Rahman that Zainab bint Abi Salamah told him, from her mother, Umm Salamah, the wife of the Prophet:                      \"That a woman from Aslam who was called Subai'ah was married to her husband, and he died while she was pregnant. Abu As-Sanabil bin Ba'kak proposed to her but she refused to marry him. He said: 'You cannot get married until you have observed 'Iddah for the longer of the two periods.' Approximately twenty days later she gave birth. She went to the Messenger of Allah and he said: 'Get married.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11407",
        "11197",
        "10567",
        "244"
      ]
    },
    {
      "id": "sunan-an-nasai-3527",
      "hadith_no": "3527",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثنا الليث، قال حدثني أيوب بن موسى، عن حميد بن نافع، عن زينب بنت أبي سلمة، أن أم حبيبة، قالت سمعت رسول الله صلى الله عليه وسلم يقول على هذا المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله ورسوله أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Habibah said:                      \"I heard the Messenger of Allah say this on this Minbar: 'It is not permissible for a woman who believes in Allah and His Messenger to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30355",
        "20023",
        "11241",
        "11157",
        "244",
        "59"
      ]
    },
    {
      "id": "sunan-an-nasai-3533",
      "hadith_no": "3533",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - قال أنبأنا ابن القاسم، عن مالك، عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب فدعت أم حبيبة بطيب فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid bin Nafi' that Zainab bint Abi Salamah told him these three Hadiths. Zainab said:                      \"I entered upon Umm Habibah, the wife of the Prophet, when her father Abu Sufyan bin Harb died. Umm Habibah called for some perfume and put some on a young girl, then she put some on her cheeks. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "id": "sunan-an-nasai-3538",
      "hadith_no": "3538",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، عن أبيه، قال حدثنا أيوب، - وهو ابن موسى - قال حميد وحدثتني زينب بنت أبي سلمة، عن أمها أم سلمة، قالت جاءت امرأة من قريش فقالت يا رسول الله إن ابنتي رمدت أفأكحلها ‏.‏ وكانت متوفى عنها ‏.‏ فقال ‏\"‏ ألا أربعة أشهر وعشرا ‏\"‏ ‏.‏ ثم قالت إني أخاف على بصرها فقال ‏\"‏ لا إلا أربعة أشهر وعشرا قد كانت إحداكن في الجاهلية تحد على زوجها سنة ثم ترمي على رأس السنة بالبعرة ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Abi Salamah narrated that her mother Umm Salamah said:                      \"A woman from the Quraish came and said: 'O Messenger of Allah, my daughter's eyes are inflamed; shall I apply kohl to her?' (The daughter's) husband had died so (the Prophet) said: 'Not until four months and ten days (have passed).' Then she said: 'I fear for her sight.' He said: 'No, not until four months and ten days (have passed). During the Jahiliyyah one of you would mourn for her husband for a year, then when one year had passed she would throw a piece of dung.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "36033",
        "20023",
        "11241",
        "11279",
        "244"
      ]
    },
    {
      "id": "sunan-an-nasai-3539",
      "hadith_no": "3539",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن يحيى بن سعيد، عن حميد بن نافع، عن زينب بنت أبي سلمة، عن أمها، أن امرأة، أتت النبي صلى الله عليه وسلم فسألته عن ابنتها مات زوجها وهي تشتكي قال ‏\"‏ قد كانت إحداكن تحد السنة ثم ترمي البعرة على رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah, from her mother, that a woman came to the Prophet and asked him about her daughter whose husband had died and she was ill. He said:                      \"One of you used to mourn for a year, then throw a piece of dung when a year had passed. Rather it (the mourning period) is four months and ten days.\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11062",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-3540",
      "hadith_no": "3540",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى بن معدان، قال حدثنا ابن أعين، قال حدثنا زهير بن معاوية، قال حدثنا يحيى بن سعيد، عن حميد بن نافع، مولى الأنصار عن زينب بنت أبي سلمة، عن أم سلمة، أن امرأة، من قريش جاءت إلى رسول الله صلى الله عليه وسلم فقالت إن ابنتي توفي عنها زوجها وقد خفت على عينها وهي تريد الكحل فقال ‏\"‏ قد كانت إحداكن ترمي بالبعرة على رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏ فقلت لزينب ما رأس الحول قالت كانت المرأة في الجاهلية إذا هلك زوجها عمدت إلى شر بيت لها فجلست فيه حتى إذا مرت بها سنة خرجت فرمت وراءها ببعرة ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah, from Umm Salamah that a woman from the Quraish came to the Messenger of Allah and said:                      \"My daughter's husband has died, and I am worried about her eyes; she needs kohl.\" He said: \"One of you used to throw a piece of dung after a year had passed. Rather it (the mourning period) is four months and ten days.\" I (the narrator) said to Zainab: \"What does 'after a year had passed' mean?\" She said: \"During the Jahiliyyah, if a woman's husband died she would go to the worst room she had and stay there, then, when a year had passed, she would come out and throw a piece of dung behind her.\"",
      "usc_msa_ref": "",
      "chain": [
        "20321",
        "11062",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-5401",
      "hadith_no": "5401",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا هشام بن عروة، قال حدثني أبي، عن زينب بنت أبي سلمة، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم ألحن بحجته من بعض فمن قضيت له من حق أخيه شيئا فلا يأخذه فإنما أقطعه به قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     The Messenger of Allah [SAW] said: \"You refer your disputes to me, but I am only human, and some of you may be more eloquent in arguing their case than others. If I pass judgment in favor of one of you, against his brother's rights, let him not take it, for it is a piece of fire that I am giving him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-5422",
      "hadith_no": "5422",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم ألحن بحجته من بعض فإنما أقضي بينكما على نحو ما أسمع فمن قضيت له من حق أخيه شيئا فإنما أقطع له قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah [SAW] said: 'You refer your disputes to me, but I am only human. And some of you may be more eloquent in arguing their case than others, and I may pass judgment on the basis of what I hear. If I pass judgment in favor of one of you against his brother's rights, then it is a piece of the fire that I am giving him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-411",
      "hadith_no": "411",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلمة، عن زينب بنت أم سلمة، عن أم سلمة، أنها كانت ورسول الله  صلى الله عليه وسلم  يغتسلان من إناء واحد ‏.‏",
      "text_en": " Zainab the daughter of Umm Salamah narrated from Umm Salamah that:                     She and the Messenger of Allah used to take a bath from a single vessel.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-530",
      "hadith_no": "530",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا حاتم بن إسماعيل، عن جعفر بن محمد، عن أبيه، عن علي بن الحسين، عن زينب بنت أم سلمة، عن أم سلمة، قالت أتي رسول الله  صلى الله عليه وسلم  بكتف شاة فأكل منه وصلى ولم يمس ماء ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"Some meat from the shoulder of a sheep was brought to the Messenger of Allah and he ate some of it, then he performed prayer without touching water (for ablution).\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20159",
        "10898",
        "11442",
        "11045",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-643",
      "hadith_no": "643",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أمها أم سلمة، قالت جاءت أم سليم إلى النبي  صلى الله عليه وسلم  فسألته عن المرأة ترى في منامها ما يرى الرجل قال ‏\"‏ نعم إذا رأت الماء فلتغتسل ‏\"‏ ‏.‏ فقلت فضحت النساء وهل تحتلم المرأة قال النبي  صلى الله عليه وسلم  ‏\"‏ تربت يمينك فبم يشبهها ولدها إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab, the daughter of Umm Salamah, that :                     Her mother Umm Salamah said: \"Umm Sulaim came to the Prophet and asked him about a woman who sees in her dream something like a man sees. He said: 'Yes, if she sees water (discharge), let her take a bath.' I said: 'You have embarrassed the women. Do women experience wet dreams?' The Prophet said: 'May your hands be rubbed with dust, how else does her child resemble her?'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11065",
        "10511",
        "244"
      ]
    },
    {
      "id": "sunan-ibn-majah-1010",
      "hadith_no": "1010",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، وسويد بن سعيد، قالا حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن زينب بنت أبي سلمة، عن أمها، قالت كان فراشها بحيال مسجد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Zainab bint Umm Salamah that her mother saidthat herbed was in front of the place where the Messenger of Allah(ﷺ)prostrated.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "30547",
        "20304",
        "11282",
        "11047",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-1908",
      "hadith_no": "1908",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت أمرنا رسول الله  صلى الله عليه وسلم  بالصدقة ‏.‏ فقالت زينب امرأة عبد الله أيجزيني من الصدقة أن أتصدق على زوجي وهو فقير وبني أخ لي أيتام وأنا أنفق عليهم هكذا وهكذا وعلى كل حال قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وكانت صناع اليدين ‏.‏",
      "text_en": " It was narrated that:                     Umm Salmah said: “The Messenger of Allah enjoined charity upon us. Zainab, the wife of Abdullah said: 'Will it accepted as charity on my part if I give charity to my husband who is poor, and to children of a brother of mine who are orphans, spending such and such on them, and in all circumstances?' He said: 'Yes.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20364",
        "20317",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-1977",
      "hadith_no": "1977",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، أن النبي  صلى الله عليه وسلم  دخل عليها فسمع مخنثا وهو يقول لعبد الله بن أبي أمية إن يفتح الله الطائف غدا دللتك على امرأة تقبل بأربع وتدبر بثمان ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أخرجوه من بيوتكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah:                     that the Prophet Mohammad entered upon her, and he heard an effeminate man say to 'Abdullah bin Abu Umayyah: “If  Allah enables you to conquer Ta'if tommorrow, I will show you a woman who comes in on four (rolls of fat) and goes out on eight.” The Messenger of Allah said: “Throw them out of your houses.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-2014",
      "hadith_no": "2014",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن ابن شهاب، عن عروة بن الزبير، أن زينب بنت أبي سلمة، حدثته أن أم حبيبة حدثتها أنها، قالت لرسول الله  صلى الله عليه وسلم  انكح أختي عزة ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أتحبين ذلك ‏\"‏ ‏.‏ قالت نعم يا رسول الله فلست لك بمخلية وأحق من شركني في خير أختي ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فإن ذلك لا يحل لي ‏\"‏ ‏.‏ قالت فإنا نتحدث أنك تريد أن تنكح درة بنت أبي سلمة ‏.‏ فقال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فإنها لو لم تكن ربيبتي في حجري ما حلت لي إنها ابنة أخي من الرضاعة أرضعتني وأباها ثويبة فلا تعرضن على أخواتكن ولا بناتكن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Zubair that Zainab bint Abi Salmah told him that Umm Habibah told her that she said to Messenger of Allah:                      “Marry my sister 'Azzah.” The Messenger of Allah said: 'Would you like that? “She said: “Yes, O Messenger of Allah. I am not the only one living with you and the one who most deserves to share good thingswith me is my sister.” The Messenger of Allah said: “But that is not permissible for me.” She said: “But we throught that you wanted to marry Durrah bint Abi Salmah.” The Messenger of Allah said:  The daughter of Umm Salamah?” She said: “Yes” The Messenger of Allah said: “Even if she were not my step-daughter who is under my care, she would not be permissible for me, because she is the daughter of my brother through breastfeeding. Tuwaibah breastfed both her father and I. So do not offer your sisters and daughters to me for marriage.”",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11013",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "id": "sunan-ibn-majah-2015",
      "hadith_no": "2015",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم حبيبة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "11065",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "id": "sunan-ibn-majah-2023",
      "hadith_no": "2023",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن رمح المصري، حدثنا عبد الله بن لهيعة، عن يزيد بن أبي حبيب، وعقيل، عن ابن شهاب، أخبرني أبو عبيدة بن عبد الله بن زمعة، عن أمه، زينب بنت أبي سلمة أنها أخبرته أن أزواج النبي  صلى الله عليه وسلم  كلهن خالفن عائشة وأبين أن يدخل عليهن أحد بمثل رضاعة سالم مولى أبي حذيفة وقلن وما يدرينا لعل ذلك كانت رخصة لسالم وحده ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah:                     that the wives of the Prophet all differed with 'Aishah and refused to allow anyone with ties of breastfeeding like Salim, the freed salve of Abu Hudhaifah, to enter upon them. They said: “How do we know? That may be a concession granted only to Salim.”",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20624",
        "11411",
        "11207",
        "11013",
        "244"
      ]
    },
    {
      "id": "sunan-ibn-majah-2317-2",
      "hadith_no": "2317",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم أن يكون ألحن بحجته من بعض وإنما أقضي بينكم على نحو مما أسمع منكم فمن قضيت له من حق أخيه شيئا فلا يأخذه فإنما أقطع له قطعة من النار يأتي بها يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Messenger of Allah (ﷺ) said:                     “You refer your disputes to me and I am only human. Perhaps some of you may be more eloquent in presenting your case than others, so I rule in your favor because of what I hear from you. If I pass a judgement in favor of one of you that detracts from his brother's rights, then he should not take it, because it is a piece of fire that is given to him which he will bring forth on the Day Resurrection.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-2712",
      "hadith_no": "2712",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم دخل عليها فسمع مخنثا وهو يقول لعبد الله بن أبي أمية إن يفتح الله الطائف غدا دللتك على امرأة تقبل بأربع وتدبر بثمان ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخرجوهم من بيوتكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that :                     the Prophet (ﷺ) entered upon her, and heard an effeminate man saying to Abdullah bin Abu Umayyah: “If Allah enable us to conquer Ta'if tomorrow, I will show you a woman who comes in on four (roll of fat) and goes out on eight” The Prophet (ﷺ) said: “Throw them out of your houses.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-4088",
      "hadith_no": "4088",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن الزهري، عن عروة، عن زينب ابنة أم سلمة، عن حبيبة، عن أم حبيبة، عن زينب بنت جحش، أنها قالت استيقظ رسول الله  صلى الله عليه وسلم  من نومه وهو محمر وجهه وهو يقول ‏\"‏ لا إله إلا الله ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج ‏\"‏ ‏.‏ وعقد بيديه عشرة ‏.‏ قالت زينب قلت يا رسول الله أنهلك وفينا الصالحون قال ‏\"‏ إذا كثر الخبث ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab bint Jahsh said:                      “The Messenger ofAllah(ﷺ) woke up red in the face and said: ‘La ilaha illallah,woe to theArabs from an evil that has drawn nigh. Today a hole hasbeen openedin the barrier of Gog and Magog.’ And he gestured toindicate the sizeof the hole.” Zainab said: “I said: ‘OMessenger of Allah! Will we bedestroyed when there are righteouspeople among us?’ He said: ‘If sinand evil deeds increase.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    }
  ],
  "total_hadiths": 103
}