{
  "id": "244",
  "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
  "full_name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة  ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Abyssinia"
    },
    "death": {
      "date_hijri": "73",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Abyssinia",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Makhzum",
      "Born Muslim",
      "Child",
      "Abyssinia 2"
    ]
  },
  "parents": [
    {
      "id": "101",
      "name": "Abu Salamah ( عبد الله بن عبد الأسد أبو سلمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "192",
      "name": "'Abdullah b. Zama'a ( عبد الله بن زمعة بن الأسود بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "245",
      "name": "Salamah bin Abi Salamah ( سلمة بن أبي سلمة بن عبدالأسد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "247",
      "name": "Durrah bintt Abi Salamah ( درة بنت أبي سلمة بن عبدالأسد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "10994",
      "name": "Abu 'Ubaida bin 'Abdullah bin Zama' أبو عبيدة بن عبد الله بن زمعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "57",
      "name": "Zaynab bint Jahsh ( زينب بنت جحش الأسدية أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "59",
      "name": "Umm Habibah bint Abi Sufyan ( أم حبيبة ,رملة بنت أبي سفيان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10994",
      "name": "Abu 'Ubaida bin 'Abdullah bin Zama' أبو عبيدة بن عبد الله بن زمعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11157",
      "name": "Hameed bin Nafi' al-Ansari حميد بن نافع الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11204",
      "name": "'Arak bin Malik عراك بن مالك الغفاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "130",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا أبو معاوية، قال حدثنا هشام، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق، فهل على المرأة من غسل إذا احتلمت قال النبي صلى الله عليه وسلم ‏\"‏ إذا رأت الماء ‏\"‏‏.‏ فغطت أم سلمة  تعني وجهها  وقالت يا رسول الله وتحتلم المرأة قال ‏\"‏ نعم تربت يمينك فبم يشبهها ولدها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um-Sulaim came to Allah's Apostle and said, \"Verily, Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge?) The Prophet replied, \"Yes, if she notices a discharge.\" Um Salama, then covered her face and asked, \"O Allah's Apostle! Does a woman get a discharge?\" He replied, \"Yes, let your right hand be in dust (An Arabic expression you say to a person when you contradict his statement meaning \"you will not achieve goodness\"), and that is why the son resembles his mother.\"",
      "chain": [
        "30376",
        "20354",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة أم المؤمنين، أنها قالت جاءت أم سليم امرأة أبي طلحة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله، إن الله لا يستحيي من الحق، هل على المرأة من غسل إذا هي احتلمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
      "text_en": " Narrated Um-Salama:                     (the mother of the believers) Um Sulaim, the wife of Abu Talha, came to Allah's Apostle and said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge)?\" Allah's Apostle replied, \"Yes, if she notices a discharge.\"",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "298",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا هشام، عن يحيى بن أبي كثير، عن أبي سلمة، أن زينب ابنة أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميصة إذ حضت، فانسللت فأخذت ثياب حيضتي قال ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was laying with the Prophet under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
      "chain": [
        "20202",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميلة حضت، فانسللت فأخذت ثياب حيضتي فقال ‏\"‏ أنفست ‏\"‏‏.‏ فقلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was lying with the Prophet under a woolen sheet, I got my menses. I slipped away and put on the clothes for menses. The Prophet said, \"Have you got your menses?\" I replied, \"Yes.\" He called me and I slept with him under the woolen sheet.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ قال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick. He told me to perform the Tawaf behind the people while riding. So I did so and Allah's Apostle was praying beside the Ka`ba and reciting the Sura starting with \"Wat-tur wa kitabin mastur.\"",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1280",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا أيوب بن موسى، قال أخبرني حميد بن نافع، عن زينب ابنة أبي سلمة، قالت لما جاء نعى أبي سفيان من الشأم دعت أم حبيبة  رضى الله عنها  بصفرة في اليوم الثالث، فمسحت عارضيها وذراعيها وقالت إني كنت عن هذا لغنية، لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث، إلا على زوج، فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked for a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been in need of this, had I not heard the Prophet saying: \"It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, for whom she should mourn for four months and ten days.\"",
      "chain": [
        "30418",
        "20005",
        "11241",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "1281",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أخبرته قالت، دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏   ثم دخلت على زينب بنت جحش حين توفي أخوها، فدعت بطيب فمست ثم قالت ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for any dead person for more than three days except for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to Zainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am not in need of scent but I heard Allah's Apostle saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, (for whom she should mourn) for four months and ten days.' \"",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت، وهو يقرأ ‏{‏والطور * وكتاب مسطور‏}‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet was praying beside the Ka`ba and reciting Surat-at-Tur.",
      "chain": [
        "30103",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1658",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة  رضى الله عنها  قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، وهو يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I informed Allah's Apostle that I was sick. He said, \"Perform Tawaf (of the Ka`ba) while riding behind the people.\" So, I performed the Tawaf while Allah's Apostle was offering the prayer beside the Ka`ba and was reciting Surat-at-Tur.",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن أبي عبد الله، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن زينب ابنة أم سلمة، عن أمها  رضى الله عنهما  قالت بينما أنا مع، رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت، فأخذت ثياب حيضتي فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدخلت معه في الخميلة، وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان من إناء واحد، وكان يقبلها وهو صائم‏.‏",
      "text_en": " Narrated Zainab:                     (daughter of Um Salama) that her mother said, \"While I was (lying) with Allah's Apostle underneath a woolen sheet, I got the menstruation, and then slipped away and put on the clothes (which I used to wear) in menses. He asked, \"What is the matter? Did you get your menses?\" I replied in the affirmative and then entered underneath that woolen sheet. I and Allah's Apostle used to take a bath from one water pot and he used to kiss me while he was fasting.\"",
      "chain": [
        "30175",
        "20031",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2458",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب بنت أم سلمة، أخبرته أن أمها أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته، فخرج إليهم، فقال ‏\"‏ إنما أنا بشر وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صدق، فأقضي له بذلك، فمن قضيت له بحق مسلم فإنما هي قطعة من النار، فليأخذها أو فليتركها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle heard some people quarreling at the door of his dwelling. He came out and said, \"I am only a human being, and opponents come to me (to settle their problems); maybe someone amongst you can present his case more eloquently than the other, whereby I may consider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by mistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day of Resurrection).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "3328",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله، إن الله لا يستحيي من الحق، فهل على المرأة الغسل إذا احتلمت قال ‏\"‏ نعم، إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة، فقالت تحتلم المرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ فبما يشبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Um Salama said, \"Um Sulaim said, 'O Allah's Apostle! Allah does not refrain from saying the truth! Is it obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she notices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's Apostle said. 'Then why does a child resemble (its mother)?\"",
      "chain": [
        "30175",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "hadith_no": "3346",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته عن أم حبيبة بنت أبي سفيان، عن زينب ابنة جحش  رضى الله عنهن أن النبي صلى الله عليه وسلم دخل عليها فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏‏.‏ وحلق بإصبعه الإبهام والتي تليها‏.‏ قالت زينب ابنة جحش فقلت يا رسول الله أنهلك وفينا الصالحون قال ‏\"‏ نعم، إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That the Prophet once came to her in a state of fear and said, \"None has the right to be worshipped but Allah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Gog and Magog like this,\" making a circle with his thumb and index finger. Zainab bint Jahsh said, \"O Allah's Apostle! Shall we be destroyed even though there are pious persons among us?\" He said, \"Yes, when the evil person will increase.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "hadith_no": "3532",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا موسى، حدثنا عبد الواحد، حدثنا كليب، حدثتني ربيبة النبي، صلى الله عليه وسلم وأظنها زينب قالت نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والمقير والمزفت‏.‏ وقلت لها أخبريني النبي صلى الله عليه وسلم ممن كان من مضر كان قالت فممن كان إلا من مضر، كان من ولد النضر بن كنانة‏.‏",
      "text_en": " Narrated Kulaib:                     I was told by the Rabiba (i.e. daughter of the wife of the Prophet) who, I think, was Zainab, that the Prophet (forbade the utensils (of wine called) Ad-Dubba, Al-Hantam, Al-Muqaiyar and Al-Muzaffat. I said to her, 'Tell me as to which tribe the Prophet belonged; was he from the tribe of Mudar?'' She replied, \"He belonged to the tribe of Mudar and was from the offspring of An-Nadr bin Kinana. \"",
      "chain": [
        "20040",
        "20256",
        "11534",
        "244"
      ]
    },
    {
      "hadith_no": "3641",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته أن أم حبيبة بنت أبي سفيان حدثتها عن زينب بنت جحش، أن النبي صلى الله عليه وسلم دخل عليها فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم يأجوج ومأجوج مثل هذا ‏\"‏‏.‏ وحلق بإصبعه وبالتي تليها، فقالت زينب فقلت يا رسول الله أنهلك وفينا الصالحون قال ‏\"‏ نعم، إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That the Prophet came to her in a state of fear saying, \"None has the right to be worshiped but Allah! Woe to the Arabs because of evil that has come near. Today a hole has been made in the wall of Gog and Magog as large as this.\" pointing with two of his fingers making a circle. Zainab said, \"I said, 'O Allah's Apostle! Shall we be destroyed though amongst us there are pious people? ' He said, 'Yes, if evil increases.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "hadith_no": "4368",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحميدي، سمع سفيان، حدثنا هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أمها أم سلمة  رضى الله عنها  دخل على النبي صلى الله عليه وسلم وعندي مخنث فسمعته يقول لعبد الله بن أبي أمية يا عبد الله أرأيت إن فتح الله عليكم الطائف غدا فعليك بابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال ابن عيينة وقال ابن جريج المخنث هيت‏.‏ حدثنا محمود حدثنا أبو أسامة عن هشام بهذا، وزاد وهو محاصر الطائف يومئذ‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet came to me while there was an effeminate man sitting with me, and I heard him (i.e. the effeminate man) saying to `Abdullah bin Abi Umaiya, \"O `Abdullah! See if Allah should make you conquer Ta'if tomorrow, then take the daughter of Ghailan (in marriage) as (she is so beautiful and fat that) she shows four folds of flesh when facing you, and eight when she turns her back.\" The Prophet then said, \"These (effeminate men) should never enter upon you (O women!).\" Ibn Juraij said, \"That effeminate man was called Hit.\"",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "4902",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick, so he said, \"Perform the Tawaf (of Ka`ba at Mecca) while riding behind the people (who are performing the Tawaf on foot).\" So I performed the Tawaf while Allah's Apostle was offering the prayer by the side of the Ka`ba and was reciting: 'By the Mount (Saini) and by a Decree Inscribed.'",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5157",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا الحكم بن نافع، أخبرنا شعيب، عن الزهري، قال أخبرني عروة بن الزبير، أن زينب ابنة أبي سلمة، أخبرته أن أم حبيبة بنت أبي سفيان أخبرتها أنها، قالت يا رسول الله انكح أختي بنت أبي سفيان فقال ‏\"‏ أوتحبين ذلك ‏\"‏‏.‏ فقلت نعم، لست لك بمخلية، وأحب من شاركني في خير أختي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن ذلك لا يحل لي ‏\"‏‏.‏ قلت فإنا نحدث أنك تريد أن تنكح بنت أبي سلمة‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏‏.‏ قلت نعم‏.‏ فقال ‏\"‏ لو أنها لم تكن ربيبتي في حجري ما حلت لي إنها لابنة أخي من الرضاعة، أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏‏.‏ قال عروة وثويبة مولاة لأبي لهب كان أبو لهب أعتقها فأرضعت النبي صلى الله عليه وسلم فلما مات أبو لهب أريه بعض أهله بشر حيبة قال له ماذا لقيت قال أبو لهب لم ألق بعدكم غير أني سقيت في هذه بعتاقتي ثويبة‏.‏",
      "text_en": " Narrated Um Habiba:                     (daughter of Abu Sufyan) I said, \"O Allah's Apostle! Marry my sister. the daughter of Abu Sufyan.\" The Prophet said, \"Do you like that?\" I replied, \"Yes, for even now I am not your only wife and I like that my sister should share the good with me.\" The Prophet said, \"But that is not lawful for me.\" I said, We have heard that you want to marry the daughter of Abu Salama.\" He said, \"(You mean) the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my step-daughter, she would be unlawful for me to marry as she is my foster niece. I and Abu Salama were suckled by Thuwaiba. So you should not present to me your daughters or your sisters (in marriage).\" Narrated 'Ursa; Thuwaiba was the freed slave girl of Abu Lahb whom he had manumitted, and then she suckled the Prophet. When Abu Lahb died, one of his relatives saw him in a dream in a very bad state and asked him, \"What have you encountered?\" Abu Lahb said, \"I have not found any rest since I left you, except that I have been given water to drink in this (the space between his thumb and other fingers) and that is because of my manumitting Thuwaiba.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "hadith_no": "5163",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، عن عقيل، عن ابن شهاب، أن عروة بن الزبير، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم حبيبة قالت قلت يا رسول الله انكح أختي بنت أبي سفيان‏.‏ قال ‏\"‏ وتحبين ‏\"‏‏.‏ قلت نعم، لست بمخلية، وأحب من شاركني في خير أختي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن ذلك لا يحل لي ‏\"‏‏.‏ قلت يا رسول الله فوالله إنا لنتحدث أنك تريد أن تنكح درة بنت أبي سلمة‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏ فوالله لو لم تكن في حجري ما حلت لي إنها لابنة أخي من الرضاعة، أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Habiba:                     I said, \"O Allah's Apostle! Marry my sister, the daughter of Abu Sufyan.\" He said, \"Do you like that?\" I said, \"Yes, for even now I am not your only wife; and the most beloved person to share the good with me is my sister.\" The Prophet said, \"But that is not lawful for me (i.e., to be married to two sisters at a time.)\" I said, \"O Allah's Apostle! By Allah, we have heard that you want to marry Durra, the daughter of Abu Salama.\" He said, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"By Allah ! Even if she were not my stepdaughter, she would not be lawful for me to marry, for she is my foster niece, for Thuwaiba has suckled me and Abu Salama; so you should neither present your daughters, nor your sisters to me.\"",
      "chain": [
        "30355",
        "20023",
        "11207",
        "11013",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "hadith_no": "5178",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن عراك بن مالك، أن زينب ابنة أبي سلمة، أخبرته أن أم حبيبة قالت لرسول الله صلى الله عليه وسلم إنا قد تحدثنا أنك ناكح درة بنت أبي سلمة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعلى أم سلمة لو لم أنكح أم سلمة ما حلت لي، إن أباها أخي من الرضاعة ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Salama:                     Um Habiba said to Allah's Apostle \"We have heard that you want to marry Durra bint Abu-Salama.\" Allah's Apostle said, \"Can she be married along with Um Salama (her mother)? Even if I have not married Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\" 'And there is no blame on you if you make hint of betrothal or conceal it in your hearts. Allah is Oft- Forgiving, Most Forbearing.' (2.235) Ibn `Abbas said, \"Hint your intention of marrying' is made by saying (to the widow) for example: \"I want to marry, and I wish that Allah will make a righteous lady available for me.' \" Al-Qasim said: One may say to the widow: 'I hold all respect for you, and I am interested in you; Allah will bring you much good, or something similar 'Ata said: One should hint his intention, and should not declare it openly. One may say: 'I have some need. Have good tidings. Praise be to Allah; you are fit to remarry.' She (the widow) may say in reply: I am listening to what you say,' but she should not make a promise. Her guardian should not make a promise (to somebody to get her married to him) without her knowledge. But if, while still in the Iddat period, she makes a promise to marry somebody, and he ultimately marries her, they are not to be separated by divorce (i.e., the marriage is valid).",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11204",
        "244",
        "59"
      ]
    },
    {
      "hadith_no": "5290",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال المخنث لأخي أم سلمة عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا أدلك على ابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هذا عليكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     that while the Prophet was with her, there was an effeminate man in the house. The effeminate man said to Um Salama's brother, `Abdullah bin Abi Umaiyya, \"If Allah should make you conquer Ta'if tomorrow, I recommend that you take the daughter of Ghailan (in marriage) for (she is so fat) that she shows four folds of flesh when facing you and eight when she turns her back.\" Thereupon the Prophet said (to us), \"This (effeminate man) should not enter upon you (anymore).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5375",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز الأعرج، قال أخبرني أبو سلمة بن عبد الرحمن، أن زينب ابنة أبي سلمة، أخبرته عن أمها أم سلمة، زوج النبي صلى الله عليه وسلم أن امرأة من أسلم يقال لها سبيعة كانت تحت زوجها، توفي عنها وهى حبلى، فخطبها أبو السنابل بن بعكك، فأبت أن تنكحه، فقال والله ما يصلح أن تنكحيه حتى تعتدي آخر الأجلين‏.‏ فمكثت قريبا من عشر ليال ثم جاءت النبي صلى الله عليه وسلم فقال ‏\"‏ انكحي ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) A lady from Bani Aslam, called Subai'a, become a widow while she was pregnant. Abu As-Sanabil bin Ba'kak demanded her hand in marriage, but she refused to marry him and said, \"By Allah, I cannot marry him unless I have completed one of the two prescribed periods.\" About ten days later (after having delivered her child), she went to the Prophet and he said (to her), \"You can marry now.\"",
      "chain": [
        "30399",
        "20023",
        "11407",
        "11197",
        "10567",
        "244"
      ]
    },
    {
      "hadith_no": "5388",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب ابنة أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب، فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية، ثم مست بعارضيها، ثم قالت والله ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Humaid bin Nafi`:                     Zainab bint Abu Salama told me these three narrations: Zainab said: I went to Um Habiba, the wife of the Prophet when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which contained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it and then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for a dead person for more than three days unless he is her husband for whom she should mourn for four months and ten days.' \" Zainab further said: I want to Zainab bint Jahsh when her brother died. She asked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the last day to mourn for more than three days except for her husband for whom she should mourn for four months and ten days.' \" Zainab further said, \"I heard my mother, Um Salama saying that a woman came to Allah's Apostle and said, \"O Allah's Apostle! The husband of my daughter has died and she is suffering from an eye disease, can she apply kohl to her eye?\" Allah's Apostle replied, \"No,\" twice or thrice. (Every time she repeated her question) he said, \"No.\" Then Allah's Apostle added, \"It is just a matter of four months and ten days. In the Pre-Islamic Period of ignorance a widow among you should throw a globe of dung when one year has elapsed.\" I said to Zainab, \"What does 'throwing a globe of dung when one year had elapsed' mean?\" Zainab said, \"When a lady was bereaved of her husband, she would live in a wretched small room and put on the worst clothes she had and would not touch any scent till one year had elapsed. Then she would bring an animal, e.g. a donkey, a sheep or a bird and rub her body against it. The animal against which she would rub her body would scarcely survive. Only then she would come out of her room, whereupon she would be given a globe of dung which she would throw away and then she would use the scent she liked or the like.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "5392",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا حميد بن نافع، عن زينب ابنة أم سلمة، عن أمها، أن امرأة، توفي زوجها فخشوا على عينيها فأتوا رسول الله صلى الله عليه وسلم فاستأذنوه في الكحل فقال ‏\"‏ لا تكحل قد كانت إحداكن تمكث في شر أحلاسها أو شر بيتها، فإذا كان حول فمر كلب رمت ببعرة، فلا حتى تمضي أربعة أشهر وعشر ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "20404",
        "20020",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5399",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن عبد الله بن أبي بكر بن عمرو بن حزم، حدثني حميد بن نافع، عن زينب ابنة أم سلمة، عن أم حبيبة ابنة أبي سفيان، لما جاءها نعي أبيها دعت بطيب، فمسحت ذراعيها وقالت ما لي بالطيب من حاجة‏.‏ لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     When Um Habiba bint Abi Sufyan was informed of her father's death, she asked for perfume and rubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days except for her husband for whom the (mourning) period is four months and ten days.\"",
      "chain": [
        "28531",
        "20012",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "5423",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، أخبرنا هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة، قلت يا رسول الله هل لي من أجر في بني أبي سلمة أن أنفق عليهم، ولست بتاركتهم هكذا وهكذا، إنما هم بني‏.‏ قال ‏\"‏ نعم لك أجر ما أنفقت عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     I said, \"O Allah's Apostle! Shall I get a reward (in the Hereafter) if I spend on the children of Abu Salama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The Prophet said, \"Yes, you will be rewarded for that which you will spend on them.\"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5426",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني عروة، أن زينب ابنة أبي سلمة، أخبرته أن أم حبيبة زوج النبي صلى الله عليه وسلم قالت قلت يا رسول الله انكح أختي ابنة أبي سفيان‏.‏ قال ‏\"‏ وتحبين ذلك ‏\"‏‏.‏ قلت نعم لست لك بمخلية، وأحب من شاركني في الخير أختي‏.‏ فقال ‏\"‏ إن ذلك لا يحل لي ‏\"‏‏.‏ فقلت يا رسول الله فوالله إنا نتحدث أنك تريد أن تنكح درة ابنة أبي سلمة‏.‏ فقال ‏\"‏ ابنة أم سلمة ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏فوالله لو لم تكن ربيبتي في حجري ما حلت لي، إنها ابنة أخي من الرضاعة، أرضعتني وأبا سلمة ثويبة، فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏‏.‏ وقال شعيب عن الزهري قال عروة ثويبة أعتقها أبو لهب‏.‏",
      "text_en": " Narrated Um Habiba:                     (the wife of the Prophet) I said, \"O Allah's Apostle! Will you marry my sister, the daughter of Abu Sufyan.\" The Prophet said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the person I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \"O Allah's Apostle! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He said, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, she is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. So you should not present to me your daughters and sisters.\" Narrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated.",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "5798",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن خالد، حدثنا محمد بن وهب بن عطية الدمشقي، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، أخبرنا الزهري، عن عروة بن الزبير، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم رأى في بيتها جارية في وجهها سفعة فقال ‏\"‏ استرقوا لها، فإن بها النظرة ‏\"‏‏.‏ وقال عقيل عن الزهري أخبرني عروة عن النبي صلى الله عليه وسلم‏.‏ تابعه عبد الله بن سالم عن الزبيدي‏.‏",
      "text_en": " Narrated Um Salama:                     that the Prophet saw in her house a girl whose face had a black spot. He said. \"She is under the effect of an evil eye; so treat her with a Ruqya.\"",
      "chain": [
        "38496",
        "30287",
        "30373",
        "20459",
        "11013",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5948",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا هشام بن عروة، أن عروة، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم سلمة أخبرتها أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال لعبد الله أخي أم سلمة يا عبد الله إن فتح لكم غدا الطائف، فإني أدلك على بنت غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال أبو عبد الله تقبل بأربع وتدبر بثمان يعني أربع عكن بطنها، فهى تقبل بهن، وقوله وتدبر بثمان‏.‏ يعني أطراف هذه العكن الأربع، لأنها محيطة بالجنبين حتى لحقت وإنما قال بثمان‏.‏ ولم يقل بثمانية‏.‏ وواحد الأطراف وهو ذكر، لأنه لم يقل ثمانية أطراف‏.‏",
      "text_en": " Narrated Um Salama:                     that once the Prophet was in her house, and an effeminate man was there too. The effeminate man said to `Abdullah, (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I recommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her belly) and eight at the back.\" So the Prophet said (to his wives) \"These effeminate (men) should not enter upon you (your houses).",
      "chain": [
        "20357",
        "20321",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "6158",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله إن الله لا يستحي من الحق، هل على المرأة غسل إذا احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال النبي صلى الله عليه وسلم ‏\"‏ فبم شبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     Um Sulaim said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it essential for a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if she notices discharge. On that Um Salama laughed and said, \"Does a woman get a (nocturnal sexual) discharge?\" He said, \"How then does (her) son resemble her (his mother)?\"",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "hadith_no": "6189",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحي من الحق، فهل على المرأة غسل إذا احتلمت فقال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um Sulaim came to Allah's Apostle and said, \"O Allah's Apostle! Verily, Allah does not feel shy to tell the truth. If a woman gets a nocturnal sexual discharge (has a wet dream), is it essential for her to take a bath? He replied, \"Yes if she notices a discharge.\"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "7053",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن هشام، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون، ولعل بعضكم أن يكون ألحن بحجته من بعض، وأقضي له على نحو ما أسمع، فمن قضيت له من حق أخيه شيئا، فلا يأخذ، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet said, \"I am only a human being, and you people have disputes. May be some one amongst you can present his case in a more eloquent and convincing manner than the other, and I give my judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody something of his brother's right then he should not take it as I have only, given him a piece of Fire.\" (See Hadith No. 638. Vol. 3)",
      "chain": [
        "28531",
        "20012",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "7146",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، أنه سمع الزهري، عن عروة، عن زينب بنت أم سلمة، عن أم حبيبة، عن زينب ابنة جحش  رضى الله عنهن  أنها قالت استيقظ النبي صلى الله عليه وسلم من النوم محمرا وجهه يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم ياجوج وماجوج مثل هذه ‏\"‏‏.‏ وعقد سفيان تسعين أو مائة‏.‏ قيل أنهلك وفينا الصالحون قال ‏\"‏ نعم، إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     The Prophet got up from his sleep with a flushed red face and said, \"None has the right to be worshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a gap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the number 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous people among us?\" The Prophet said, \"Yes, if evil increased.\"",
      "chain": [
        "20357",
        "20005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "hadith_no": "7222",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته عن أم حبيبة بنت أبي سفيان، عن زينب ابنة جحش، أن رسول الله صلى الله عليه وسلم دخل عليها يوما فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏‏.‏ وحلق بإصبعيه الإبهام والتي تليها‏.‏ قالت زينب ابنة جحش فقلت يا رسول الله أفنهلك وفينا الصالحون قال ‏\"‏ نعم إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That one day Allah's Apostle entered upon her in a state of fear and said, \"None has the right to be worshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole has been opened in the dam of Gog and Magog like this.\" The Prophet made a circle with his index finger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though there will be righteous people among us?\" The Prophet said, \"Yes, if the (number) of evil (persons) increased.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "hadith_no": "7257",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون إلى، ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي نحو ما أسمع، فمن قضيت له بحق أخيه شيئا فلا يأخذه، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Allah's Apostle said, \"I am only a human being, and you people (opponents) come to me with your cases; and it may be that one of you can present his case eloquently in a more convincing way than the other, and I give my verdict according to what I hear. So if ever I judge (by error) and give the right of a brother to his other (brother) then he (the latter) should not take it, for I am giving him only a piece of Fire.\" (See Hadith No. 638, Vol. 3).",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "7268",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب ابنة أبي سلمة، أخبرته أن أم سلمة زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته فخرج إليهم فقال ‏\"‏ إنما أنا بشر، وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صادق فأقضي له بذلك، فمن قضيت له بحق مسلم، فإنما هي قطعة من النار، فليأخذها أو ليتركها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle heard some people quarreling at the door of his dwelling, so he went out to them and said, \"I am only a human being, and litigants with cases of dispute come to me, and someone of you may happen to be more eloquent (in presenting his case) than the other, whereby I may consider that he is truthful and pass a judgment in his favor. If ever I pass a judgment in favor of somebody whereby he takes a Muslim's right unjustly, then whatever he takes is nothing but a piece of Fire, and it is up to him to take or leave.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "7272",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني عروة بن الزبير، أن زينب بنت أبي سلمة، أخبرته عن أمها أم سلمة، قالت سمع النبي صلى الله عليه وسلم جلبة خصام عند بابه فخرج عليهم فقال ‏\"‏ إنما أنا بشر، وإنه يأتيني الخصم، فلعل بعضا أن يكون أبلغ من بعض، أقضي له بذلك وأحسب أنه صادق، فمن قضيت له بحق مسلم فإنما هي قطعة من النار، فليأخذها أو ليدعها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet heard the voices of some people quarreling near his gate, so he went to them and said, \"I am only a human being and litigants with cases of disputes come to me, and maybe one of them presents his case eloquently in a more convincing and impressive way than the other, and I give my verdict in his favor thinking he is truthful. So if I give a Muslim's right to another (by mistake), then that (property) is a piece of Fire, which is up to him to take it or leave it.\" (See Hadith No. 281 )",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ فدعاني فاضطجعت معه في الخميلة ‏.‏ قالت وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Umm Salama reported:                      While I was lying with the Messenger of Allah (may peace be upon him) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah (may peace be upon him) said: Have you menstruated? I said: Yes. He called me and I lay down",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت جاءت أم سليم إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق فهل على المرأة من غسل إذا احتلمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إذا رأت الماء ‏\"‏ ‏.‏ فقالت أم سلمة يا رسول الله وتحتلم المرأة فقال ‏\"‏ تربت يداك فبم يشبهها ولدها ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      Umm Sulaim went to the Apostle of Allah (may peace be upon him) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (may peace be upon him) said: Yes, when she sees the liquid (vaginal secretion). Umm Salama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، كانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Zainab bint Umm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت قلت يا رسول الله هل لي أجر في بني أبي سلمة أنفق عليهم ولست بتاركتهم هكذا وهكذا إنما هم بني ‏.‏ فقال ‏\"‏ نعم لك فيهم أجر ما أنفقت عليهم ‏\"‏ ‏.‏",
      "text_en": " Umm Salama said:                      I asked the Messenger of Allah (may peace be upon him) whether there is a reward for me if I spend oh Abu Salama's sons, and I am not going to abandon them in this state (of helplessness) for they are my sons. He (the Holy Prophet) said: Yes. For you is the reward for what you spend on them.",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3137",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، أنها قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ قالت فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت وهو يقرأ ب ‏{‏ الطور * وكتاب مسطور‏}‏ ‏.‏",
      "text_en": " Umm Salama reported:                      I made a complaint to Allah's Messenger (may peace be upon him) of my ailment, whereupon be said: Circumambulate behind the people while riding. She said: So I circumambulated and Allah's Messenger (may peace be upon him) was at that time praying towards the side of the House and he was reciting al-Tur and a Book Inscribed (i. e. Sura Iii. of the Qur'un).",
      "chain": [
        "30399",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3659",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، أخبرنا هشام، أخبرنا أبي، عن زينب بنت أم سلمة، عن أم حبيبة بنت أبي سفيان، قالت دخل على رسول الله صلى الله عليه وسلم فقلت له هل لك في أختي بنت أبي سفيان فقال ‏\"‏ أفعل ماذا ‏\"‏ ‏.‏ قلت تنكحها ‏.‏ قال ‏\"‏ أوتحبين ذلك ‏\"‏ ‏.‏ قلت لست لك بمخلية وأحب من شركني في الخير أختي ‏.‏ قال ‏\"‏ فإنها لا تحل لي ‏\"‏ ‏.‏ قلت فإني أخبرت أنك تخطب درة بنت أبي سلمة ‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ لو أنها لم تكن ربيبتي في حجري ما حلت لي إنها ابنة أخي من الرضاعة أرضعتني وأباها ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": "  Umm Habiba, the daughter of AbuSufyan, reported:                      The Messenger of Allah (may peace be upon him) came to me and I said to him: Have you any inclination towards my the daughter of Abu Sufyan? He (the Holy Prophet) said: Then what should I do? I said: Marry her. He said: Do you like that? I said: I am not the exclusive (wife) of yours; I, therefore, wish to join my sister in good. He, said: She is not lawful for me. I said: I have been informed that you have given the proposal of marriage to Durrah daughter of Abu Salama He raid: You mean the daughter of Umm Salama? I said: Yes. He said: Even if she had not been my step-daughter brought up under my guardianship, she would not have been lawful for me, for she is the daughter of my foster-brother (Hamza), for Thuwaiba had suckled me and her father. So do not give me the proposal of the marriage of your daughters and sisters.",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "244",
        "59"
      ]
    },
    {
      "hadith_no": "3661",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، أنحدثه أن زينب بنت أبي سلمة حدثته أن أم حبيبة زوج النبي صلى الله عليه وسلم حدثتها أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله انكح أختي عزة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحبين ذلك ‏\"‏ ‏.‏ فقالت نعم يا رسول الله لست لك بمخلية وأحب من شركني في خير أختي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإن ذلك لا يحل لي ‏\"‏ ‏.‏ قالت فقلت يا رسول الله فإنا نتحدث أنك تريد أن تنكح درة بنت أبي سلمة ‏.‏ قال ‏\"‏ بنت أبي سلمة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أنها لم تكن ربيبتي في حجري ما حلت لي إنها ابنة أخي من الرضاعة أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " Umm Habiba, the wife of Allah's Apostle (may peace be upon him), reported that she said to Allah's Messenger (may peace be upon him):                      Messenger of Allah, marry my sister 'Azza, whereupon Allah's Messenger (may peace be upon him) said: Do you like it? She said: Yes, Messenger of Allah, I am not the exclusive wife of yours, and I wish that the person who joins me in good should be my sister. Thereupon Allah's Messenger (may peace be upon him) said: That is not lawful for me. I said: Messenger of Allah, we discussed that You intend to marry Durrah bint Abu Salama. He (the Holy Prophet) said: You mean the daughter of Abu Salama? She said: Yes, whereupon Allah's Messenger (may. peace be upon him) said: Even if she were not the step-daughter of mine, brought up under my guardianship, she would not have been lawful for me, for she is the daughter of my foster-brother. Thuwaiba gave me suck and to Abu Salama (also), so do not offer to me your daughters and sisters.",
      "chain": [
        "30490",
        "20023",
        "244"
      ]
    },
    {
      "hadith_no": "3676",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن نافع، عن زينب بنت أم سلمة، قالت قالت أم سلمة لعائشة إنه يدخل عليك الغلام الأيفع الذي ما أحب أن يدخل على ‏.‏ قال فقالت عائشة أما لك في رسول الله صلى الله عليه وسلم أسوة قالت إن امرأة أبي حذيفة قالت يا رسول الله إن سالما يدخل على وهو رجل وفي نفس أبي حذيفة منه شىء ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرضعيه حتى يدخل عليك ‏\"‏ ‏.‏",
      "text_en": " Umm Salama said to 'A'isha (Allah be pleased with her):                      A young boy who is at the threshold of puberty comes to you. I, however, do not like that he should come to me, whereupon 'A'isha (Allah be pleased with her) said: Don't you see in Allah's Messenger (may peace be upon him) a model for you? She also said: The wife of Abu Hudhaifa said: Messenger of Allah, Salim comes to me and now he is a (grown-up) person, and there is something that (rankles) in the mind of Abu Hudhaifa about him, whereupon Allah's Messenger (may peace be upon him) said: Suckle him (so that he may become your foster-child), and thus he may be able to come to you (freely).",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "3678",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، أنه قال أخبرني أبو عبيدة بن عبد الله بن زمعة، أن أمه، زينب بنت أبي سلمة أخبرته أن أمها أم سلمة زوج النبي صلى الله عليه وسلم كانت تقول أبى سائر أزواج النبي صلى الله عليه وسلم أن يدخلن عليهن أحدا بتلك الرضاعة وقلن لعائشة والله ما نرى هذا إلا رخصة أرخصها رسول الله صلى الله عليه وسلم لسالم خاصة فما هو بداخل علينا أحد بهذه الرضاعة ولا رائينا.",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), used to say that all wives of Allah's Apostle (may peace be upon him) disclaimed the idea that one with this type of fosterage (having been suckled after the proper period) should come to them. and said to 'A'isha:                      By Allah, we do not find this but a sort of concession given by Allah's Messenger (may peace be upon him) only for Salim, and no one was ging to be allowed to enter (our houses) with this type of fosterage and we do not subscribe to this view.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "244"
      ]
    },
    {
      "hadith_no": "3798",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب ثم دخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب سمعت أمي أم سلمة، تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ مرتين أو ثلاثا كل ذلك يقول لا ثم قال ‏\"‏ إنما هي أربعة أشهر وعشر وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال حميد قلت لزينب وما ترمي بالبعرة على رأس الحول فقالت زينب كانت المرأة إذا توفي عنها زوجها دخلت حفشا ولبست شر ثيابها ولم تمس طيبا ولا شيئا حتى تمر بها سنة ثم تؤتى بدابة حمار أو شاة أو طير فتفتض به فقلما تفتض بشىء إلا مات ثم تخرج فتعطى بعرة فترمي بها ثم تراجع بعد ما شاءت من طيب أو غيره ‏.‏",
      "text_en": " Zainab (bint Abu Salama) (Allah be pleased with her) reported:                      I went to Umm Habiba, the wife of Allah's Apostle (may peace be upon him), when her father Abu Sufyan had died. Umm Habiba sent for a perfume having yellowness in it or something else like it, and she applied it to a girl and then rubbed it on her cheeks and then said: By Allah, I need no perfume but for the fact that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafter to mourn for the dead beyond three days, but (in case of the death) of the husband it is permissible for four months and ten days.\" Zainab said: I then visited Zainab hint Jahsh (Allah be pleased with her) when her brother died and she sent for perfume and applied it and then said: By Allah, I don't feel any need for the perfume but that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafbler to mourn the dead beyond three days except in case of her husband (for whom she can mourn) for four months and ten days.\" Zainab (Allah be pleased with her) said: I heard my mother Umm Salama (Allah be pleased with her) as saying: A woman came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger. I have a daughter whose husband has died and there has developed some trouble in her eye; should we apply collyrium to it? Thereupon Allah's Messenger (may peace be upon him) said: No (repeating it twice or thrice, saying only, NO\" all the time). Then he said: It is only four mouths and ten days, whereas in the preIslamic period none of you threw away the dung until one year had passed. Humaid said: I said to Zainab: What is this throwing of dung until a year is passed? Zainab said: When the husband of a woman died, she went into a hut and put on her worst clothes, and did not apply perfume or something like it until a year was over. Then an animal like a donkey, or a goat, or a bird was brought to her and she rubbed her hand over it, and it so happened that one on which she rubbed her hand died. She then came out of her house and she was given dung and she threw it and then she made use of anything like perfume or something else as she liked.",
      "chain": [
        "30399",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "3802",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن نافع، قال سمعت زينب بنت أم سلمة، قالت توفي حميم لأم حبيبة فدعت بصفرة فمسحته بذراعيها وقالت إنما أصنع هذا لأني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": "  Zainab bint Umm Salama (Allah be pleased with her) reported that a relative of Umm Habiba (Allah he pleased with her) died. She sent for a yellow (perfume) and applied that to her forearm and said:                      I, am doing it, for I have heard Allah's Messenger (may peace be upon him) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "3807",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا عمرو الناقد، وابن أبي عمر، - واللفظ لعمرو - حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن حميد بن نافع، عن زينب بنت أبي سلمة، قالت لما أتى أم حبيبة نعي أبي سفيان دعت في اليوم الثالث بصفرة فمسحت به ذراعيها وعارضيها وقالت كنت عن هذا غنية سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Zainab bint Abu Salama reported that when the news of the death of Abu Safyan came to Umm Habiba she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said:                      I had in fact no need of it, but I heard Allah's Messenger (may peace be upon him) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days.",
      "chain": [
        "30263",
        "30421",
        "20005",
        "11241",
        "11157",
        "244"
      ]
    }
  ],
  "total_hadiths": 103
}