{
  "id": "24428",
  "name": "Muslimah bin Qa'nab al-Harithi مسلمة بن قعنب الحارثي البصري",
  "full_name": "Muslimah bin Qa'nab al-Harithi مسلمة بن قعنب الحارثي البصري",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  -  ثقة ]"
    ],
    "tags": [
      "B.Haritha",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "22025",
      "name": "Isma'il bin Muslima إسماعيل بن مسلمة بن قعنب الحارثي القعنب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "22025",
      "name": "Isma'il bin Muslima إسماعيل بن مسلمة بن قعنب الحارثي القعنب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "209",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، قال حدثنا أبي، عن هشام بن عروة، عن أبيه، عن حديث، حدثه عن علي بن أبي طالب، قال قلت للمقداد ‏.‏ فذكر معناه ‏.‏ قال أبو داود ورواه المفضل بن فضالة وجماعة والثوري وابن عيينة عن هشام عن أبيه عن علي بن أبي طالب ورواه ابن إسحاق عن هشام بن عروة عن أبيه عن المقداد عن النبي صلى الله عليه وسلم لم يذكر ‏\"‏ أنثييه ‏\"‏ ‏.‏",
      "text_en": " ‘Urwah reported on the Authority of his father a tradition from ‘Ali b. Abi Talib who said :                      I Asked al-Miqdad (to consult the prophet). He then narrated the tradition bearing the same meaning.Abu Dawud said; this tradition has been reported with another chain of narrators. This version does not mention the word “testicles”.",
      "chain": [
        "20164",
        "24428",
        "11065",
        "10511",
        "5",
        "30002",
        "20378",
        "11065",
        "10511",
        "5",
        "11107"
      ]
    },
    {
      "hadith_no": "4017",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا يحيى، نحوه عن بهز بن حكيم، عن أبيه، عن جده، قال قلت يا رسول الله عوراتنا ما نأتي منها وما نذر قال ‏\"‏ احفظ عورتك إلا من زوجتك أو ما ملكت يمينك ‏\"‏ ‏.‏ قال قلت يا رسول الله إذا كان القوم بعضهم في بعض قال ‏\"‏ إن استطعت أن لا يرينها أحد فلا يرينها ‏\"‏ ‏.‏ قال قلت يا رسول الله إذا كان أحدنا خاليا قال ‏\"‏ الله أحق أن يستحيا منه من الناس ‏\"‏ ‏.‏",
      "text_en": " Bahz b. Hakim said that his father told on the authority of his grandfather:                      I said: Messenger of Allah, from whom should we conceal our private parts and to whom can we show? He replied: conceal your private parts except from your wife and from whom your right hands possess (slave-girls). I then asked: Messenger of Allah, (what should we do), if the people are assembled together? He replied: If it is within your power that no one looks at it, then no one should look at it. I then asked: Messenger of Allah if one of us is alone, (what should he do)? He replied: Allah is more entitled than people that bashfulness should be shown to him.",
      "chain": [
        "20164",
        "24428",
        "30160",
        "20031",
        "19901",
        "19905"
      ]
    },
    {
      "hadith_no": "4342",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا القعنبي، أن عبد العزيز بن أبي حازم، حدثهم عن أبيه، عن عمارة بن عمرو، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كيف بكم وبزمان ‏\"‏ ‏.‏ أو ‏\"‏ يوشك أن يأتي زمان يغربل الناس فيه غربلة تبقى حثالة من الناس قد مرجت عهودهم وأماناتهم واختلفوا فكانوا هكذا ‏\"‏ ‏.‏ وشبك بين أصابعه فقالوا وكيف بنا يا رسول الله قال ‏\"‏ تأخذون ما تعرفون وتذرون ما تنكرون وتقبلون على أمر خاصتكم وتذرون أمر عامتكم ‏\"‏ ‏.‏ قال أبو داود هكذا روي عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم من غير وجه ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: How will you do when that time will come? Or he said: A time will soon come when the people are sifted and only dregs of mankind survive and their covenants and guarantees have been impaired and they have disagreed among themselves and become thus, interwining his fingers. They asked: What do you order us to do, Messenger of Allah? He replied: Accept what you approve, abandon what  you disapprove, attend to your own affairs and leave alone the affairs of the generality.Abu dawud said: A similar tradition has been transmitted by 'Abd Allah bin 'Amr from the Prophet (ﷺ) through different chain.",
      "chain": [
        "20164",
        "24428",
        "29"
      ]
    },
    {
      "hadith_no": "2738",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الله بن مسلمة، عن محمد بن عبد الله بن مسلم، عن أبيه، عن أنس بن مالك، قال سئل رسول الله صلى الله عليه وسلم ما الكوثر قال ‏\"‏ ذاك نهر أعطانيه الله يعني في الجنة أشد بياضا من اللبن وأحلى من العسل فيها طير أعناقها كأعناق الجزر ‏\"‏ ‏.‏ قال عمر إن هذه لناعمة ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أكلتها أنعم منها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومحمد بن عبد الله بن مسلم هو ابن أخي ابن شهاب الزهري وعبد الله بن مسلم قد روى عن ابن عمر وأنس بن مالك ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah (s.a.w) was asked:                      \"What is Al-Kawthar?\" He said:\"That is a river that Allah has given me\"- that is, in Paradise- 'whiter than milk and sweeter than honey. In it are birds whose necks are like the necks of camels.\" 'Umar said: \"Indeed this is plump and luxurious then.\" So the Messenger of Allah (s.a.w) said, \"Those who consume it are more plumb than it.\"",
      "chain": [
        "30553",
        "20164",
        "24428",
        "19"
      ]
    }
  ],
  "total_hadiths": 4
}