{
  "id": "24515",
  "name": "Abu 'Asim al-'Abdani أبو عاصم العباداني",
  "full_name": "Abu 'Asim al-'Abdani أبو عاصم العباداني",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ق  -  لين الحديث ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "15446",
      "name": "Fa'id bin 'Abdur Rahman فائد بن عبد الرحمن الكوفي أبو الورقاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14001",
      "name": "Aban bin Abi Ayash أبان بن أبي عياش فيروز",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14314",
      "name": "al-Fadl bin 'Isa bin Aban الفضل بن عيسى بن أبان الرقاشي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30146",
      "name": "'Abdul A'ala bin Hamad bin Nasr al-Bahli عبد الأعلى بن حماد بن نصر الباهلي النرسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30238",
      "name": "N'ym bin Hmad bin Mua'wiya نعيم بن حماد بن معاوية بن الحارث",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20404",
      "name": "Aadm bin Abi Iyas آدم بن أبي إياس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30161",
      "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30450",
      "name": "Ibn Abi al-Shuwarab محمد بن عبد الملك بن أبي الشوارب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "189",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عاصم العباداني، حدثنا الفضل الرقاشي، عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بينا أهل الجنة في نعيمهم إذ سطع لهم نور فرفعوا رءوسهم فإذا الرب قد أشرف عليهم من فوقهم فقال السلام عليكم يا أهل الجنة ‏.‏ قال وذلك قول الله ‏{سلام قولا من رب رحيم}‏ قال فينظر إليهم وينظرون إليه فلا يلتفتون إلى شىء من النعيم ما داموا ينظرون إليه حتى يحتجب عنهم ويبقى نوره وبركته عليهم في ديارهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabor bin 'Abdullah said:                     \"The Messenger of Allah said: 'While the people of Paradise are enjoying their blessings, a light will shine upon them, and they will raise their heads, and they will see their Lord looking upon them from above. He will say: \"Peace be upon you, O people of Paradise.\" This is what Allah says in the Verse: \"Salam (peace be upon you) - a Word from the Lord (Allah), The Most Merciful.\" He will look at them, and they will look at Him, and they will not pay any attention to the delights (of Paradise) so long as they look at Him, until He will screen Himself from them. But His light and blessing will remain with them in their bodies.'\"",
      "chain": [
        "30450",
        "24515",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1447",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا أبو عاصم العباداني، عن فائد بن عبد الرحمن، عن عبد الله بن أبي أوفى الأسلمي، قال خرج علينا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ من كانت له حاجة إلى الله أو إلى أحد من خلقه فليتوضأ وليصل ركعتين ثم ليقل لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم الحمد لله رب العالمين اللهم إني أسألك موجبات رحمتك وعزائم مغفرتك والغنيمة من كل بر والسلامة من كل إثم أسألك ألا تدع لي ذنبا إلا غفرته ولا هما إلا فرجته ولا حاجة هي لك رضا إلا قضيتها لي ثم يسأل الله من أمر الدنيا والآخرة ما شاء فإنه يقدر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Abi Awfa Al-Aslami said:                      “TheMessenger of Allah (ﷺ) came out to us and said: ‘Whoever has someneed from Allah or from any of His creation, let him perform ablutionand pray two Rak’ah, then let him say: La ilahaillallahul-Halimul-Karim. Subhan-Allahi Rabbil-‘arshil-‘azim.Al-hamdu LillahiRabbil-‘Alamin. Allahumma inni as’aluka mujibatrahmatika, wa ‘aza’imamaghfiratika, wal-ghanimata min kullibarrin, was-salamata min kulliithmnin. As’aluka alla tada’a lidhanban illa ghafartahu, wa la hammanilla farrajtahu, wa la hajahhiya laka irdan illa qadaitaha li (Nonehas the right to beworshipped but Allah, the Forbearing, the MostGenerous. Glory is toAllah, the Lord of the Mighty Throne. Praise isto Allah, the Lord ofthe worlds. O Allah, I ask You for the means ofYour mercy andforgiveness, the benefit of every good deed and safetyfrom all sins.I ask You not to leave any sin of mine but You forgiveit, or anydistress but You relieve it, or any need that is pleasingto You butYou meet it). Then he should ask Allah for whatever hewants in thisworld and in the Hereafter, for it is decreed.”",
      "chain": [
        "30547",
        "24515"
      ]
    }
  ],
  "total_hadiths": 2
}