{
  "id": "24511",
  "name": "Abu Bakr bin 'Ali bin 'Ata' bin Maqaddam أبو بكر بن علي بن عطاء بن مقدم",
  "full_name": "Abu Bakr bin 'Ali bin 'Ata' bin Maqaddam أبو بكر بن علي بن عطاء بن مقدم",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "167",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ س  -  مقبول ]"
    ],
    "tags": [
      "Clinet",
      "al-Thaqifi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "20265",
      "name": "'Umar bin 'Ali bin Ata'a bin Maqaddam عمر بن علي بن عطاء بن مقدم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "children": [
    {
      "id": "30161",
      "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14069",
      "name": "Habib bin Abi Fadalan/Fadala حبيب بن أبي فضلان/ فضالة المالكي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1848",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يوسف الماجشون، حدثني أبي، عن عبد، الرحمن الأعرج عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة قال ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت ‏.‏ أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك أنا بك وإليك تباركت وتعاليت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ وإذا ركع قال ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت خشع لك سمعي وبصري ومخي وعظمي وعصبي ‏\"‏ ‏.‏ وإذا رفع قال ‏\"‏ اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما بينهما وملء ما شئت من شىء بعد ‏\"‏ ‏.‏ وإذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت سجد وجهي للذي خلقه وصوره وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ثم يكون من آخر ما يقول بين التشهد والتسليم ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ‏\"‏ ‏.‏",
      "text_en": " A'raj reported that when the Messenger of Allah (may peace be upon him) would start the prayer, he would pronounce takbir (Allah-o-Akbar) and then say:                      I turn my face (up to Thee), I am the first of the believers; and when he raised his head from ruku' he said: Allah listened to him who praised Him; O our Lord, praise be to Thee; and he said: He shaped (man) and how fine is his shape? And he (the narrator) said: When he pronounced salutation he said: O Allah, forgive me my ear- lier (sins), to the end of the hadith; and he did not say it between the Tashahhud and salutation (as mentioned above).",
      "chain": [
        "30161",
        "24511",
        "11197",
        "11199",
        "5"
      ]
    }
  ],
  "total_hadiths": 1
}