{
  "id": "246",
  "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
  "full_name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Abyssinia or Medina"
    },
    "death": {
      "date_hijri": "83",
      "date_gregorian": "701",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Fars",
      "Bahrian"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Governor"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "Born Muslim",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "101",
      "name": "Abu Salamah ( عبد الله بن عبد الأسد أبو سلمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "245",
      "name": "Salamah bin Abi Salamah ( سلمة بن أبي سلمة بن عبدالأسد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "247",
      "name": "Durrah bintt Abi Salamah ( درة بنت أبي سلمة بن عبدالأسد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "18947",
      "name": "Muhammad bin 'Umar bin Abi Salma محمد بن عمر بن أبي سلمة",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "18947",
      "name": "Muhammad bin 'Umar bin Abi Salma محمد بن عمر بن أبي سلمة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18860",
      "name": "Qadama bin Ibrahim bin Muhammad قدامة بن إبراهيم بن محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11870",
      "name": "'Abdullah bin Ka'b al-Hmyry عبد الله بن كعب الحميري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11231",
      "name": "Wahb bin Kysan al-Quraishi وهب بن كيسان القرشي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-354",
      "hadith_no": "354",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن موسى، قال حدثنا هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، أن النبي صلى الله عليه وسلم صلى في ثوب واحد قد خالف بين طرفيه‏.‏",
      "text_en": " Narrated `Umar bin Abi Salama:                     The Prophet prayed in one garment and crossed its ends.",
      "usc_msa_ref": "350",
      "chain": [
        "20340",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "sahih-bukhari-355",
      "hadith_no": "355",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا يحيى، قال حدثنا هشام، قال حدثني أبي، عن عمر بن أبي سلمة، أنه رأى النبي صلى الله عليه وسلم يصلي في ثوب واحد في بيت أم سلمة، قد ألقى طرفيه على عاتقيه‏.‏",
      "text_en": " Narrated `Umar bin Abi Salama:                     I saw the Prophet offering prayers in a single garment in the house of Um-Salama and he had crossed its ends around his shoulders.",
      "usc_msa_ref": "351",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "sahih-bukhari-356",
      "hadith_no": "356",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، أن عمر بن أبي سلمة، أخبره قال رأيت رسول الله صلى الله عليه وسلم يصلي في ثوب واحد مشتملا به في بيت أم سلمة، واضعا طرفيه على عاتقيه‏.‏",
      "text_en": " Narrated `Umar bin Abi Salama:                     In the house of Um-Salama I saw Allah's Apostle offering prayers, wrapped in a single garment around his body with its ends crossed round his shoulders.",
      "usc_msa_ref": "352",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "sahih-bukhari-5430",
      "hadith_no": "5430",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي بن عبد الله، أخبرنا سفيان، قال الوليد بن كثير أخبرني أنه، سمع وهب بن كيسان، أنه سمع عمر بن أبي سلمة، يقول كنت غلاما في حجر رسول الله صلى الله عليه وسلم وكانت يدي تطيش في الصحفة فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا غلام سم الله، وكل بيمينك وكل مما يليك ‏\"‏‏.‏ فما زالت تلك طعمتي بعد‏.‏",
      "text_en": " Narrated `Umar bin Abi Salama:                     I was a boy under the care of Allah's Apostle and my hand used to go around the dish while I was eating. So Allah's Apostle said to me, 'O boy! Mention the Name of Allah and eat with your right hand, and eat of the dish what is nearer to you.\" Since then I have applied those instructions when eating.",
      "usc_msa_ref": "288",
      "chain": [
        "30026",
        "20005",
        "11230",
        "11231",
        "246"
      ]
    },
    {
      "id": "sahih-muslim-517-2",
      "hadith_no": "517",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، أن عمر بن أبي سلمة، أخبره قال رأيت رسول الله صلى الله عليه وسلم يصلي في ثوب واحد مشتملا به في بيت أم سلمة واضعا طرفيه على عاتقيه ‏.‏",
      "text_en": " Umar b. Abu Salama reported:                      I saw the Messenger of Allah (may peace be upon him) praying in Umm Salama's house in a single garment, placing its two ends over his shoulders.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "sahih-muslim-517-4",
      "hadith_no": "517",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، قال رأيت رسول الله صلى الله عليه وسلم يصلي في بيت أم سلمة في ثوب قد خالف بين طرفيه ‏.‏",
      "text_en": " 'Umar b. Abu Salama reported:                      I saw the Messenger of Allah (may peace be upon him) saying prayer in the house of Umm Salama in a single garment with its extremities crossing each other.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20022",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "sahih-muslim-517-5",
      "hadith_no": "517",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، وعيسى بن حماد، قالا حدثنا الليث، عن يحيى بن سعيد، عن أبي أمامة بن سهل بن حنيف، عن عمر بن أبي سلمة، قال رأيت رسول الله صلى الله عليه وسلم يصلي في ثوب واحد ملتحفا مخالفا بين طرفيه ‏.‏ زاد عيسى بن حماد في روايته قال على منكبيه ‏.‏",
      "text_en": " Umar b. Abu Salama reported:                      I saw the Messenger of Allah (may peace be upon him) praying in a single garment with its ends crossing each other. 'Isa b. Hammad added:\" placing on his shoulders\".",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "405",
        "246"
      ]
    },
    {
      "id": "sahih-muslim-2644",
      "hadith_no": "2644",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن عبد ربه بن سعيد، عن عبد الله بن كعب الحميري، عن عمر بن أبي سلمة، أنه سأل رسول الله صلى الله عليه وسلم أيقبل الصائم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ سل هذه ‏\"‏ ‏.‏ لأم سلمة فأخبرته أن رسول الله صلى الله عليه وسلم يصنع ذلك فقال يا رسول الله قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أما والله إني لأتقاكم لله وأخشاكم له ‏\"‏ ‏.‏",
      "text_en": " Umar b Abu Salama reported that he asked the Messenger of Allah (may peace be upon him):                      Should one observing fast kiss (his wife)? The Messenger of Allah (may peace be upon him) said to him: Ask her (Umm Salama). She informed him that the Messenger of Allah (may peace be upon him) did that, where upon he said: Messenger of Allah, Allah pardoned thee all thy sins, the previous and the later ones. Upon this the Messenger of Allah (may peace be upon him) ) said: By Allah, I am the most God conscious among you and I fear Him most among you.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11191",
        "11870",
        "246"
      ]
    },
    {
      "id": "sahih-muslim-5389",
      "hadith_no": "5389",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، وأبو بكر بن إسحاق قالا حدثنا ابن أبي، مريم أخبرنا محمد بن جعفر، أخبرني محمد بن عمرو بن حلحلة، عن وهب بن كيسان، عن  عمر بن أبي سلمة، أنه قال أكلت يوما مع رسول الله صلى الله عليه وسلم فجعلت آخذ من لحم حول الصحفة فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل مما يليك ‏\"‏ ‏.‏",
      "text_en": " Umar b. Abu Salama reported:                      I (had the opportunity) one day to dine with Allah's Messenger (may peace be upon him), and I picked up flesh from around the dish. Thereupon Allah's Messenger (may peace be upon him) said: Eat from that which is near to you.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "11108",
        "30232",
        "20173",
        "11537",
        "11231",
        "246"
      ]
    },
    {
      "id": "sunan-abi-daud-628",
      "hadith_no": "628",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يحيى بن سعيد، عن أبي أمامة بن سهل، عن عمر بن أبي سلمة، قال رأيت رسول الله صلى الله عليه وسلم يصلي في ثوب واحد ملتحفا مخالفا بين طرفيه على منكبيه ‏.‏",
      "text_en": " ‘Umar b. Abu Salamah said :                      I saw the Messenger of Allah (ﷺ) praying girded with a single (piece of) cloth, place its two ends over his shoulders.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "405",
        "246"
      ]
    },
    {
      "id": "sunan-abi-daud-3777",
      "hadith_no": "3777",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن سليمان، لوين عن سليمان بن بلال، عن أبي وجزة، عن عمر بن أبي سلمة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ادن بنى فسم الله وكل بيمينك وكل مما يليك ‏\"‏ ‏.‏",
      "text_en": " Narrated Umar ibn AbuSalamah:                     The Prophet (ﷺ) said: Come near, my son, mention Allah's name, eat with your right hand and eat from what is next to you.",
      "usc_msa_ref": "",
      "chain": [
        "35125",
        "20160",
        "246"
      ]
    },
    {
      "id": "sunan-abi-daud-4412",
      "hadith_no": "4412",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا موسى، - يعني ابن إسماعيل - حدثنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سرق المملوك فبعه ولو بنش ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) as saying:  When a slave steals, sell him, even though it be for half an uqiyah.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4493",
      "hadith_no": "4493",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كامل، حدثنا أبو عوانة، عن عمر، - يعني ابن أبي سلمة - عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا ضرب أحدكم فليتق الوجه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When one of you inflicts a beating, he should avoid striking the face.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-339",
      "hadith_no": "339",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، أنه رأى رسول الله صلى الله عليه وسلم يصلي في بيت أم سلمة مشتملا في ثوب واحد ‏.‏ قال وفي الباب عن أبي هريرة وجابر وسلمة بن الأكوع وأنس وعمرو بن أبي أسيد وعبادة بن الصامت وأبي سعيد وكيسان وابن عباس وعائشة وأم هانئ وعمار بن ياسر وطلق بن علي وصامت الأنصاري ‏.‏ قال أبو عيسى حديث عمر بن أبي سلمة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين وغيرهم قالوا لا بأس بالصلاة في الثوب الواحد ‏.‏ وقد قال بعض أهل العلم يصلي الرجل في ثوبين ‏.‏",
      "text_en": " Umar bin Abi Salamah narrated that he saw :                     Allah's Messenger performing Salat in the house of Umm Salamah wrapped in one garment.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1056",
      "hadith_no": "1056",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم لعن زوارات القبور ‏.‏ قال وفي الباب عن ابن عباس وحسان بن ثابت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رأى بعض أهل العلم أن هذا كان قبل أن يرخص النبي صلى الله عليه وسلم في زيارة القبور فلما رخص دخل في رخصته الرجال والنساء ‏.‏ وقال بعضهم إنما كره زيارة القبور للنساء لقلة صبرهن وكثرة جزعهن ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Indeed the Messenger of Allah cursed the women who visit the graves.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1079",
      "hadith_no": "1079",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا إبراهيم بن سعد، عن أبيه، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ نفس المؤمن معلقة بدينه حتى يقضى عنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وهو أصح من الأول ‏.‏",
      "text_en": " (Another chain) Abu Hurairah narrated that:                     The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20150",
        "11063",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1336",
      "hadith_no": "1336",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال لعن رسول الله صلى الله عليه وسلم الراشي والمرتشي في الحكم ‏.‏ قال وفي الباب عن عبد الله بن عمرو وعائشة وابن حديدة وأم سلمة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏ وقد روي هذا الحديث عن أبي سلمة بن عبد الرحمن عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم ‏.‏ وروي عن أبي سلمة عن أبيه عن النبي صلى الله عليه وسلم ولا يصح ‏.‏ قال وسمعت عبد الله بن عبد الرحمن يقول حديث أبي سلمة عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم أحسن شيء في هذا الباب وأصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                      \"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe for a judgement.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1752",
      "hadith_no": "1752",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ غيروا الشيب ولا تشبهوا باليهود ‏\"‏ ‏.‏ قال وفي الباب عن الزبير وابن عباس وجابر وأبي ذر وأنس وأبي رمثة والجهدمة وأبي الطفيل وجابر بن سمرة وأبي جحيفة وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Change the gray, and do not resemble the Jews.\"He said: There are narration on this topic from Az-Zubair, Ibn 'Abbas, Jabir, Abu Dharr, Anas, Abu Rimthah, Al-Jahdamah, Abu At-Tufail, Jabir bin Samurah, Abu Juhaifah, and Ibn 'Umar.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith, and it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1857",
      "hadith_no": "1857",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن الصباح الهاشمي، حدثنا عبد الأعلى، عن معمر، عن هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، أنه دخل على رسول الله صلى الله عليه وسلم وعنده طعام فقال ‏\"‏ ادن يا بنى وسم الله وكل بيمينك وكل مما يليك ‏\"‏ ‏.‏ قال أبو عيسى وقد روي عن هشام بن عروة عن أبي وجزة السعدي عن رجل من مزينة عن عمر بن أبي سلمة ‏.‏ وقد اختلف أصحاب هشام بن عروة في رواية هذا الحديث ‏.‏ وأبو وجزة السعدي اسمه يزيد بن عبيد ‏.‏",
      "text_en": " Narrated 'Umar bin Abi Salamah:                     That he entered upon the Messenger of Allah (ﷺ) while he has some food. He said: \"Sit down O my son! Mention Allah's Name and eat with your right hand, and eat what is nearest to you.\"[Abu 'Eisa said:] It has been reported from Hisham bin 'Urwah, from Abu Wajzah As-Sa'idi, from a man from Muzainah, from 'Umar bin Abu Salamah. The Companions of Hisham bin 'Urwah differed in reporting this Hadith. Abu Wajzah As-Sa'di's name is Yazid bin 'Ubaid.",
      "usc_msa_ref": "",
      "chain": [
        "30142",
        "20246",
        "20115",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3604g",
      "hadith_no": "3604g",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، أخبرنا عمرو بن عون، أخبرنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لينظرن أحدكم ما الذي يتمنى فإنه لا يدري ما يكتب له من أمنيته ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏",
      "text_en": " Umar bin Abi Salamah narrated from his father, who said:                     “The Messenger of Allah said: ‘Let one of you look at what it is that he wishes for. For verily, he does not know what of his wish shall be recorded.’”",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30154",
        "20469",
        "246",
        "101"
      ]
    },
    {
      "id": "sunan-an-nasai-764",
      "hadith_no": "764",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، أنه رأى رسول الله صلى الله عليه وسلم يصلي في ثوب واحد في بيت أم سلمة واضعا طرفيه على عاتقيه ‏.‏",
      "text_en": " Narrated Umar bin Abi Salamah:                     It was narrated from Umar bin Abi Salamah that he saw Messenger of Allah(ﷺ)praying in a single garment in the house of Umm Salamah, putting the ends of it on his shoulders.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "sunan-an-nasai-3884",
      "hadith_no": "3884",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة‏.‏‏ خالفهما محمد بن عمرو فقال عن أبي سلمة عن أبي سعيد‏.‏‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20012",
        "11063",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4980",
      "hadith_no": "4980",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا الحسن بن مدرك، قال حدثنا يحيى بن حماد، قال حدثنا أبو عوانة، عن عمر، - وهو ابن أبي سلمة - عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا سرق العبد فبعه ولو بنش ‏\"‏ ‏.‏ قال أبو عبد الرحمن عمر بن أبي سلمة ليس بالقوي في الحديث ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"If a slave steals, then sell him, even for half price.\" (Hasan)Abu 'Abdur-Rahman (An-Nasai) said: 'Umar bin Abi Salamah is not strong in Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30131",
        "20574",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1102",
      "hadith_no": "1102",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، قال رأيت رسول الله  صلى الله عليه وسلم  يصلي في ثوب واحد متوشحا به واضعا طرفيه على عاتقيه ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Abu Salamah said:                      “I saw the MessengerofAllah (ﷺ) performing prayer in a single garment, wrapping himselfin it and throwing the ends over his shoulders.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "id": "sunan-ibn-majah-1297",
      "hadith_no": "1297",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم بن بشير، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إنما جعل الإمام ليؤتم به فإذا كبر فكبروا وإذا ركع فاركعوا وإذا قال سمع الله لمن حمده فقولوا ربنا ولك الحمد وإن صلى قائما فصلوا قياما وإن صلى قاعدا فصلوا قعودا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘The Imam is appointed to be followed. When he says AllahuAkbar, then say Allahu Akbar; when he bows, then bow; when he saysSami’ Allahu liman hamidah, then say Rabbana wa lakal-hamd; when heprostrates then prostrate; if he prays standing, then pray standing,and if he prays sitting down then pray sitting down.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20468",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1643",
      "hadith_no": "1643",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن خلف العسقلاني أبو نصر، حدثنا محمد بن طالب، حدثنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال لعن رسول الله  صلى الله عليه وسلم  زوارات القبور ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)cursed women who visit graves.”",
      "usc_msa_ref": "",
      "chain": [
        "30268",
        "38518",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1666",
      "hadith_no": "1666",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا عبد الملك بن قدامة الجمحي، عن أبيه، عن عمر بن أبي سلمة، عن أم سلمة، أن أبا سلمة، حدثها أنه، سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من مسلم يصاب بمصيبة فيفزع إلى ما أمر الله به من قوله إنا لله وإنا إليه راجعون اللهم عندك احتسبت مصيبتي فأجرني فيها وعضني منها - إلا آجره الله عليها وعاضه خيرا منها ‏\"‏ ‏.‏ قالت فلما توفي أبو سلمة ذكرت الذي حدثني عن رسول الله  صلى الله عليه وسلم  فقلت إنا لله وإنا إليه راجعون اللهم عندك احتسبت مصيبتي هذه فأجرني عليها ‏.‏ فإذا أردت أن أقول وعضني خيرا منها قلت في نفسي أعاض خيرا من أبي سلمة ثم قلتها فعاضني الله محمدا  صلى الله عليه وسلم  ‏.‏ وآجرني في مصيبتي ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that Abu Salamah told her that heheard theMessenger of Allah (ﷺ) say:                      “There is no Muslim who isstrickenwith a calamity and reacts by saying as Allah has commanded:‘Innalillahi, wa inna ilayhi raji’un. Allahumma indakah-tasabtumusibati, fajurni iha, wa ‘awwidni minha (Truly, to Allah we belongand truly, to Him we shall return. O Allah, with You I seek rewardformy calamity, so reward me for it and compensate me),’ but Allahwillreward him for that and compensate him with something betterthan it.”She said: “When Abu Salamah died, I remembered what hehad told mefrom the Messenger of Allah (ﷺ) and I said: ‘Innalillahi, wa innailayhi raji’un. Allahumma indakah-tasabtumusibati, fajurni ihaiha(Truly, to Allah we belong and truly, to Himwe shall return. O Allah,with You I seek reward for my calamity, soreward me for it).’ Butwhen I wanted to say wa ‘awwidni minha(and compensate me withbetter), I said to myself: ‘How can I becompensated with somethingbetter than Abu Salamah?’ Then I saidit, and Allah compensated mewith Muhammad (ﷺ) and rewarded me formy calamity.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "22137",
        "18860",
        "246",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-2506",
      "hadith_no": "2506",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن أبيه، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نفس المؤمن معلقة بدينه حتى يقضى عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) that the Messenger of Allah (ﷺ) said:                     “The soul of the believer is attached to his debt until it is paid off.”",
      "usc_msa_ref": "",
      "chain": [
        "32032",
        "20150",
        "11063",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2687",
      "hadith_no": "2687",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن أبي عوانة، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سرق العبد فبيعوه ولو بنش ‏\"‏ ‏.‏",
      "text_en": " It was narrated Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “If a slave steals, then sell him, even for half Price.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20469",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3389",
      "hadith_no": "3389",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، قال قال لي النبي  صلى الله عليه وسلم  وأنا آكل ‏\"‏ سم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Abu Salamah said:                      “The Prophet (ﷺ)saidto me, when I was eating: ‘Say the Name of Allah, the GlorifiedandExalted.’”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11065",
        "10511",
        "246"
      ]
    }
  ],
  "total_hadiths": 30
}