{
  "id": "25038",
  "name": "Jabir bin Nwh جابر بن نوح",
  "full_name": "Jabir bin Nwh جابر بن نوح",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ ت  س  -  ضعيف ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "35000",
      "name": "Ahmed bin Bdyl bin Qrysh أحمد بن بديل بن قريش",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30476",
      "name": "Muhammad bin Tryf bin Khlyf محمد بن طريف بن خليف",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2752",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن طريف الكوفي، حدثنا جابر بن نوح الحماني، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تضامون في رؤية القمر ليلة البدر وتضامون في رؤية الشمس ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فإنكم سترون ربكم كما ترون القمر ليلة البدر لا تضامون في رؤيته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وهكذا روى يحيى بن عيسى الرملي وغير واحد عن الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وروى عبد الله بن إدريس عن الأعمش عن أبي صالح عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ وحديث ابن إدريس عن الأعمش غير محفوظ وحديث أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم أصح وهكذا رواه سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وقد روي عن أبي سعيد عن النبي صلى الله عليه وسلم من غير هذا الوجه مثل هذا الحديث وهو حديث صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Do you crowd one another in order to see the moon on the night of a full moon? Do you crowd one another in order to see the sun?\" They said: \"No.\" He said: \"So verily, you shall see your Lord as you see the moon on the night of a full moon, you shall not crowd one another to see Him.\"",
      "chain": [
        "30476",
        "25038",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3604h",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، أخبرنا جابر بن نوح، قال أخبرنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يدعو فيقول ‏\"‏ اللهم متعني بسمعي وبصري واجعلهما الوارث مني وانصرني على من يظلمني وخذ منه بثأري ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah used to supplicate, saying:                     “O Allah, give me pleasure in my hearing and my sight, and make it the inheritor from me, and aid me against whoever oppresses me, and take vengeance from him for me (Allahumma Matti’ni Bisam’i Wa Basari Waj’alhumal-Waritha Minni, Wansurni Ala Man Yazlimuni, Wa Khudh Minhu Bitha’ri)”",
      "chain": [
        "30221",
        "25038",
        "11220",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 2
}