{
  "id": "25075",
  "name": "Hamza bin al-Mughira bin Nashayt حمزة بن المغيرة بن نشيط",
  "full_name": "Hamza bin al-Mughira bin Nashayt حمزة بن المغيرة بن نشيط",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ تمييز  -  لا بأس به ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11642",
      "name": "'Umar bin Dhar bin 'Abdullah al-Hamdani عمر بن ذر بن عبد الله بن زرارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10781",
      "name": "'Abdullah bin Habib عبد الله بن حبيب بن أبي ثابت",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، والحلواني، قالا حدثنا عبد الرزاق، عن ابن جريج، حدثني ابن شهاب، عن إسماعيل بن محمد بن سعد، عن حمزة بن المغيرة، نحو حديث عباد قال المغيرة فأردت تأخير عبد الرحمن فقال النبي صلى الله عليه وسلم ‏\"‏ دعه ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated by Hamza b. Mughira by another chain of trans- mitters (but with the addition of these words):                      I made up my mind to hold Abd al-Rahman b. 'Auf back, but the Messenger of Allah (may peace be upon him) said: Leave him.\"",
      "chain": [
        "30375",
        "30115",
        "20121",
        "11070",
        "11013",
        "11500",
        "25075"
      ]
    },
    {
      "hadith_no": "108",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، وحميد بن مسعدة، عن يزيد، - وهو ابن زريع - قال حدثنا حميد، قال حدثنا بكر بن عبد الله المزني، عن حمزة بن المغيرة بن شعبة، عن أبيه، قال تخلف رسول الله صلى الله عليه وسلم فتخلفت معه فلما قضى حاجته قال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ فأتيته بمطهرة فغسل يديه وغسل وجهه ثم ذهب يحسر عن ذراعيه فضاق كم الجبة فألقاه على منكبيه فغسل ذراعيه ومسح بناصيته وعلى العمامة وعلى خفيه ‏.‏",
      "text_en": " It was narrated from Hamzah bin Al-Mughirah bin Shu'bah that his father said:                      \"The Messenger of Allah (ﷺ) stayed behind, and I stayed with him. When he had relieved himself he said: 'Do you have any water with you?' I brought some water to him, and he washed his hands and face, then he started trying to uncover his arms, but the sleeves of his Jubbah were too tight, so he threw it over his shoulders and washed his arms and wiped over his forehead and 'Imamah, and over his Khuff.\"",
      "chain": [
        "30153",
        "30430",
        "20304",
        "11279",
        "11267",
        "25075"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال سمعت إسماعيل بن محمد بن سعد، قال سمعت حمزة بن المغيرة بن شعبة، يحدث عن أبيه، قال كنت مع النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ تخلف يا مغيرة وامضوا أيها الناس ‏\"‏ ‏.‏ فتخلفت ومعي إداوة من ماء ومضى الناس فذهب رسول الله صلى الله عليه وسلم لحاجته فلما رجع ذهبت أصب عليه وعليه جبة رومية ضيقة الكمين فأراد أن يخرج يده منها فضاقت عليه فأخرج يده من تحت الجبة فغسل وجهه ويديه ومسح برأسه ومسح على خفيه ‏.‏",
      "text_en": " Hamzah bin Al-Mughirah bin Shu'bah (narrated) that his father said:                      \"I was with the Prophet (ﷺ) on a journey, and he said: 'Stay back O Mughirah! Go ahead, O people!' So I went back, and I had with me a vessel of water. The people went ahead, and there the Messenger of Allah (ﷺ) relieved himself. when he came back I went and poured water for him. He was wearing a Roman Jubbah with narrow sleeves, and he wanted to expose his hands (to wash them) but the sleeves were too tight, so he brought his hands out from beneath the Jubbah and washed his head, and wiped over his Khuffs.\"",
      "chain": [
        "36658",
        "20005",
        "11500",
        "25075"
      ]
    },
    {
      "hadith_no": "1294",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن حميد، عن بكر بن عبد الله، عن حمزة بن المغيرة بن شعبة، عن أبيه، قال تخلف رسول الله  صلى الله عليه وسلم  فانتهينا إلى القوم وقد صلى بهم عبد الرحمن بن عوف ركعة فلما أحس بالنبي  صلى الله عليه وسلم  ذهب يتأخر فأومأ إليه النبي  صلى الله عليه وسلم  أن يتم الصلاة قال ‏\"‏ وقد أحسنت كذلك فافعل ‏\"‏ ‏.‏",
      "text_en": " Hamzahbin Mughirah bin Shu’bah narrated that his father said:                      “TheMessenger of Allah (ﷺ) lagged behind (on a journey) and we reachedthe people when ‘Abdur Rahman bin ‘Awf had already led them inoneRak’ah of the prayer. When he realized that the Prophet (ﷺ)wasthere, he wanted to step back, but the Prophet (ﷺ) gestured tohimthat he should complete the prayer. He said: ‘You have donewell, dothe same in the future.’”",
      "chain": [
        "30170",
        "20276",
        "11279",
        "11267",
        "25075"
      ]
    }
  ],
  "total_hadiths": 4
}