{
  "id": "251",
  "name": "'Itban bin Malik bin 'Amr ( عتبان بن مالك بن عمرو بن العجلان ( رضي الله عنه",
  "full_name": "'Itban bin Malik bin 'Amr ( عتبان بن مالك بن عمرو بن العجلان ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "50",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خ  م  كد  س  ق  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.'Auf B.al-Khazraj",
      "B.Qauqal",
      "Badr",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "252",
      "name": "Layla bint Ri'ab bin Hunayf ( ليلى بنت رئاب بن حنيف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5278",
      "name": "Mahmud bin al-Rabi' bin Saraqa ( محمود بن الربيع بن سراقة بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11502",
      "name": "Husayn bin Muhammad al-Ansari حصين بن محمد الأنصاري السالمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "424",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال حدثنا إبراهيم بن سعد، عن ابن شهاب، عن محمود بن الربيع، عن عتبان بن مالك، أن النبي صلى الله عليه وسلم أتاه في منزله فقال ‏\"‏ أين تحب أن أصلي لك من بيتك ‏\"‏‏.‏ قال فأشرت له إلى مكان، فكبر النبي صلى الله عليه وسلم وصففنا خلفه، فصلى ركعتين‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     The Prophet came to my house and said, \"Where do you like me to pray?\" I pointed to a place. The Prophet then said, \"Allahu Akbar\", and we aligned behind him and he offered a two-rak`at prayer.",
      "chain": [
        "20164",
        "20150",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "667",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع الأنصاري، أن عتبان بن مالك، كان يؤم قومه وهو أعمى، وأنه قال لرسول الله صلى الله عليه وسلم يا رسول الله، إنها تكون الظلمة والسيل وأنا رجل ضرير البصر، فصل يا رسول الله في بيتي مكانا أتخذه مصلى، فجاءه رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي ‏\"‏‏.‏ فأشار إلى مكان من البيت، فصلى فيه رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mahmud bin Rabi` Al-Ansari:                     `Itban bin Malik used to lead his people (tribe) in prayer and was a blind man, he said to Allah's Apostle , \"O Allah's Apostle! At times it is dark and flood water is flowing (in the valley) and I am blind man, so please pray at a place in my house so that I can take it as a Musalla (praying place).\" So Allah's Apostle went to his house and said, \"Where do you like me to pray?\" 'Itban pointed to a place in his house and Allah's Apostle, offered the prayer there.",
      "chain": [
        "30103",
        "20001",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "686",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، قال أخبرني محمود بن الربيع، قال سمعت عتبان بن مالك الأنصاري، قال استأذن النبي صلى الله عليه وسلم فأذنت له فقال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت له إلى المكان الذي أحب، فقام وصففنا خلفه ثم سلم وسلمنا‏.‏",
      "text_en": " Narrated `Itban bin Malik Al-Ansari:                     The Prophet (came to my house and) asked permission for entering and I allowed him. He asked, \"Where do you like me to pray in your house?\" I pointed to a place which I liked. He stood up for prayer and we aligned behind him and he finished the prayer with Taslim and we did the same.",
      "chain": [
        "30176",
        "20025",
        "20115",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "4059",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني محمود بن الربيع، أن عتبان بن مالك، وكان، من أصحاب النبي صلى الله عليه وسلم ممن شهد بدرا من الأنصار أنه أتى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mahmud bin Ar-Rabi:                     That `Itban bin Malik who was one of the companions of the Prophet and one of the warriors of Badr, came to Allah's Apostle.",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "5456",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أن عتبان بن مالك  وكان من أصحاب النبي صلى الله عليه وسلم ممن شهد بدرا من الأنصار  أنه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني أنكرت بصري وأنا أصلي لقومي، فإذا كانت الأمطار سال الوادي الذي بيني وبينهم، لم أستطع أن آتي مسجدهم فأصلي لهم، فوددت يا رسول الله أنك تأتي فتصلي في بيتي، فأتخذه مصلى‏.‏ فقال ‏\"‏ سأفعل إن شاء الله ‏\"‏‏.‏ قال عتبان فغدا رسول الله صلى الله عليه وسلم وأبو بكر حين ارتفع النهار، فاستأذن النبي صلى الله عليه وسلم فأذنت له فلم يجلس حتى دخل البيت، ثم قال لي ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت إلى ناحية من البيت فقام النبي صلى الله عليه وسلم فكبر، فصففنا، فصلى ركعتين، ثم سلم وحبسناه على خزير صنعناه، فثاب في البيت رجال من أهل الدار ذوو عدد فاجتمعوا، فقال قائل منهم أين مالك بن الدخشن فقال بعضهم ذلك منافق لا يحب الله ورسوله‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لا تقل، ألا تراه قال لا إله إلا الله‏.‏ يريد بذلك وجه الله ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال قلنا فإنا نرى وجهه ونصيحته إلى المنافقين‏.‏ فقال ‏\"‏ فإن الله حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال ابن شهاب ثم سألت الحصين بن محمد الأنصاري أحد بني سالم وكان من سراتهم عن حديث محمود فصدقه‏.‏",
      "text_en": " Narrated 'Urban bin Malik:                     who attended the Badr battle and was from the Ansar, that he came to the Prophet and said, \"O Allah's Apostle! I have lost my eyesight and I lead my people in the prayer (as an Imam). When it rains, the valley which is between me and my people, flows with water, and then I cannot go to their mosque to lead them in the prayer. O Allah's Apostle! I wish that you could come and pray in my house so that I may take it as a praying place. The Prophet said, \"Allah willing, I will do that.\" The next morning, soon after the sun had risen, Allah's Apostle came with Abu Bakr. The Prophet asked for the permission to enter and I admitted him. The Prophet had not sat till he had entered the house and said to me, \"Where do you like me to pray in your house?\" I pointed at a place in my house whereupon he stood and said, \"Allahu Akbar.\" We lined behind him and he prayed two rak`at and finished it with Taslim. We then requested him to stay for a special meal of Khazira which we had prepared. A large number of men from the adjoining area gathered in the house. One of them said, \"Where is Malik bin Ad-Dukhshun?\" Another man said, \"He is a hypocrite and does not love Allah and His Apostle.\" The Prophet said, \"Do not say so. Do you not think that he has said: \"None has the right to be worshipped but Allah,\" seeking Allah's pleasure? The man said, \"Allah and His Apostle know better, but we have always seen him mixing with hypocrites and giving them advice.\" The Prophet said, \"Allah has forbidden the (Hell) Fire for those who testify that none has the right to be worshipped but Allah, seeking Allah's pleasure. \"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "6499",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "قال سمعت عتبان بن مالك الأنصاري، ثم أحد بني سالم قال غدا على رسول الله صلى الله عليه وسلم فقال ‏\"‏ لن يوافي عبد يوم القيامة يقول لا إله إلا الله‏.‏ يبتغي به وجه الله، إلا حرم الله عليه النار ‏\"‏‏.‏",
      "text_en": " Narrated `Utban bin Malik Al-Ansari:                     who was one of the men of the tribe of Bani Salim: Allah's Apostle came to me and said, \"If anybody comes on the Day of Resurrection who has said: La ilaha illal-lah, sincerely, with the intention to win Allah's Pleasure, Allah will make the Hell-Fire forbidden for him.\"",
      "chain": [
        "251"
      ]
    },
    {
      "hadith_no": "7024",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، أخبرني محمود بن الربيع، قال سمعت عتبان بن مالك، يقول غدا على رسول الله صلى الله عليه وسلم فقال رجل أين مالك بن الدخشن فقال رجل منا ذلك منافق لا يحب الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا تقولوه يقول لا إله إلا الله يبتغي‏.‏ بذلك وجه الله ‏\"‏‏.‏ قال بلى‏.‏ قال ‏\"‏ فإنه لا يوافى عبد يوم القيامة به إلا حرم الله عليه النار ‏\"‏‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     Once Allah's Apostle came to me in the morning, and a man among us said, \"Where is Malik bin Ad- Dukhshun?\" Another man from us replied, \"He is a hypocrite who does not love Allah and His Apostle.\" The Prophet said, \"Don't you think that he says: None has the right to be worshipped but Allah, only for Allah's sake?\" They replied, \"Yes\" The Prophet said, \"Nobody will meet Allah with that saying on the Day of Resurrection, but Allah will save him from the Fire.\"",
      "chain": [
        "30349",
        "20025",
        "20115",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - قال حدثنا ثابت، عن أنس بن مالك، قال حدثني محمود بن الربيع، عن عتبان بن مالك، قال قدمت المدينة فلقيت عتبان فقلت حديث بلغني عنك قال أصابني في بصري بعض الشىء فبعثت إلى رسول الله صلى الله عليه وسلم أني أحب أن تأتيني فتصلي في منزلي فأتخذه مصلى - قال - فأتى النبي صلى الله عليه وسلم ومن شاء الله من أصحابه فدخل وهو يصلي في منزلي وأصحابه يتحدثون بينهم ثم أسندوا عظم ذلك وكبره إلى مالك بن دخشم قالوا ودوا أنه دعا عليه فهلك وودوا أنه أصابه شر ‏.‏ فقضى رسول الله صلى الله عليه وسلم الصلاة وقال ‏\"‏ أليس يشهد أن لا إله إلا الله وأني رسول الله ‏\"‏ ‏.‏ قالوا إنه يقول ذلك وما هو في قلبه ‏.‏ قال ‏\"‏ لا يشهد أحد أن لا إله إلا الله وأني رسول الله فيدخل النار أو تطعمه ‏\"‏ ‏.‏ قال أنس فأعجبني هذا الحديث فقلت لابني اكتبه فكتبه ‏.‏",
      "text_en": " It is narrated on the authority of 'Itban b. Malik that he came to Medina and said:                      Something had gone wrong with my eyesight. I, therefore, sent (a message to the Holy Prophet): Verily it is my ardent desire that you should kindly grace my house with your presence and observe prayer there so, that I should make that corner a place of worship. He said: The Prophet (may peace be upon him) came there, and those amongst the Companions whom Allah willed also accompanied him. He entered (my place) and offered prayer at my residence and his Companions began to talk amongst themselves (and this conversation centered round hypocrites), and then the conspicuous one, Malik b. Dukhshum was made the target and they wished that he (the Holy Prophet) should curse him and he should die or he should meet some calamity. In the meanwhile the Messenger of Allah (may peace and blessings be upon him) completed his prayer and said: Does Malik b. Dukhshum not testify the fact that there is no god but Allah and verily I am the messenger of Allah. They replied: He makes a profession of it (no doubt) but does not do it out of (sincere) heart. He (the Holy Prophet) said: He who testifies that there is no god but Allah and I am the messenger of Allah would not enter Hell or its (flames) would not consume him. Anas said: This hadith impressed me very much and I told my son to write it down.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "19",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "159",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو بكر بن نافع العبدي، حدثنا بهز، حدثنا حماد، حدثنا ثابت، عن أنس، قال حدثني عتبان بن مالك، أنه عمي فأرسل إلى رسول الله صلى الله عليه وسلم فقال تعال فخط لي مسجدا ‏.‏ فجاء رسول الله صلى الله عليه وسلم وجاء قومه ونعت رجل منهم يقال له مالك بن الدخشم ‏.‏ ثم ذكر نحو حديث سليمان بن المغيرة ‏.‏",
      "text_en": " It is narrated on the authority of Anas that 'Itban b. Malik told him that he became blind. He sent a message to the Messenger of Allah (may peace be upon him) that he should come and mark a place of worship for him. Thereupon came the Messenger of Allah (may peace be upon him) and his people and then there was a discussion among them about a man who was known as Malik b. Dukhshum, and subsequently the narrator described the hadith of Sulaiman b. Mughira as stated above.",
      "chain": [
        "20214",
        "20022",
        "11269",
        "19",
        "251"
      ]
    },
    {
      "hadith_no": "1529",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن رافع، وعبد بن حميد، كلاهما عن عبد الرزاق، قال أخبرنا معمر، عن الزهري، قال حدثني محمود بن ربيع، عن عتبان بن مالك، قال أتيت رسول الله صلى الله عليه وسلم ‏.‏ وساق الحديث بمعنى حديث يونس غير أنه قال فقال رجل أين مالك بن الدخشن أو الدخيشن وزاد في الحديث قال محمود فحدثت بهذا الحديث نفرا فيهم أبو أيوب الأنصاري فقال ما أظن رسول الله صلى الله عليه وسلم قال ما قلت - قال - فحلفت إن رجعت إلى عتبان أن أسأله - قال - فرجعت إليه فوجدته شيخا كبيرا قد ذهب بصره وهو إمام قومه فجلست إلى جنبه فسألته عن هذا الحديث فحدثنيه كما حدثنيه أول مرة ‏.‏ قال الزهري ثم نزلت بعد ذلك فرائض وأمور نرى أن الأمر انتهى إليها فمن استطاع أن لا يغتر فلا يغتر ‏.‏",
      "text_en": " 'Itban b. Malik reported:                      I came to the Messenger of Allah (may peace be upon him) and the rest of the hadith is the same as narrated (above) except this that a man said: Where is Malik b. Dukhshun or Dukhaishin, and also made this addition that Mahmud said: I narrated this ver hadith to many people and among them was Abu Ayyub al-Ansari who said: I cannot think that the Messenger of Allah (may peace be upon him) could have said so as you say. He (the narrator) said: I took an oath that if I ever go to 'Itban. I would ask him about it. So I went to him and found him to be a very aged man, having lost his eyesight, but he was the Imam of the people. I sat by his side and asked about this hadith and he narrated it In the same way as he had narrated it for the first time. Then so many other obligatory acts and commands were revealed which we see having been completed. So he who wants that he should not be deceived would not be deceived.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "251"
      ]
    },
    {
      "hadith_no": "788",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح قال وحدثنا الحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع، ‏.‏ أن عتبان بن مالك، كان يؤم قومه وهو أعمى وأنه قال لرسول الله صلى الله عليه وسلم إنها تكون الظلمة والمطر والسيل وأنا رجل ضرير البصر فصل يا رسول الله في بيتي مكانا أتخذه مصلى ‏.‏ فجاء رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي لك ‏\"‏ ‏.‏ فأشار إلى مكان من البيت فصلى فيه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Mahmiid bin Ar-Rabi' that 'Itbk bin Milk used to lead his people in prayer, and he was blind. He said to theMessenger of Allah (ﷺ):                     \"Sometimes it is dark or rainy or there is a flood, and I am a blindman; 0 Messenger of Allah (ﷺ), (come and) pray in a place in my house that I may take as a prayer-place.\" He said: \"Where would you likeme to pray for you?\" He showed him a place in his house, and the Messenger of Allah (ﷺ) prayed there.",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "844",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا نصر بن علي، قال أنبأنا عبد الأعلى، قال حدثنا معمر، عن الزهري، عن محمود، عن عتبان بن مالك، أنه قال يا رسول الله إن السيول لتحول بيني وبين مسجد قومي فأحب أن تأتيني فتصلي في مكان من بيتي أتخذه مسجدا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سنفعل ‏\"‏ ‏.‏ فلما دخل رسول الله صلى الله عليه وسلم قال ‏\"‏ أين تريد ‏\"‏ ‏.‏ فأشرت إلى ناحية من البيت فقام رسول الله صلى الله عليه وسلم فصففنا خلفه فصلى بنا ركعتين ‏.‏",
      "text_en": " It was narrated from 'Itban bin Malik that he said:                      \"0 Messenger of Allah (ﷺ) the floods keep me from coming to the Masjid of my people. I would like you to come and pray in a place in my house so that I can take it as a Masjid.\" The Messenger of Allah (ﷺ)  said: \"We shall do that.\" \"When the Messenger of Allah (ﷺ) entered he said: 'Where do you want (me to pray).' I showed him a comer of the house, and the Messenger of Allah (ﷺ) stood there, and we formed rows behind him, and he led us in praying two Rak'ahs.\"",
      "chain": [
        "30395",
        "20246",
        "20115",
        "11013",
        "30277",
        "251"
      ]
    },
    {
      "hadith_no": "1327",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن معمر، عن الزهري، أخبره قال أخبرني محمود بن الربيع، قال سمعت عتبان بن مالك، يقول كنت أصلي بقومي بني سالم فأتيت رسول الله صلى الله عليه وسلم فقلت إني قد أنكرت بصري وإن السيول تحول بيني وبين مسجد قومي فلوددت أنك جئت فصليت في بيتي مكانا أتخذه مسجدا ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ سأفعل إن شاء الله ‏\"‏ ‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر - رضى الله عنه - معه بعد ما اشتد النهار فاستأذن النبي صلى الله عليه وسلم فأذنت له فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏ ‏.‏ فأشرت له إلى المكان الذي أحب أن يصلي فيه فقام رسول الله صلى الله عليه وسلم وصففنا خلفه ثم سلم وسلمنا حين سلم ‏.‏",
      "text_en": " 'Itban bin Malik said:                     \"I used to lead my people Bani Salim in prayer. I came to the Messenger of Allah (ﷺ) and said: 'I have lost my eyesight and the rainwater prevents me from reaching the masjid of my people. I would like you to come and pray in my house in a place that I can take as a masjid.' The Prophet (ﷺ) said: 'I will do that, if Allah (SWT) wills.' The next day, the Messenger of Allah (ﷺ) came, and Abu Bakr was with him, after the day had grown hot. The Prophet (ﷺ) asked for permission to enter, and I gave him permission. He did not sit own until he asked: 'Where would you like me to pray in your house?' I showed him the place where I wanted him to pray, so the Messenger of Allah (ﷺ) stood there and formed a row behind him, then he said the salam and we said the salam when he did.\"",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11013",
        "5278",
        "251"
      ]
    }
  ],
  "total_hadiths": 13
}