{
  "id": "25107",
  "name": "Sa'id bin Muhammad al-Wraq سعيد بن محمد الوراق الثقفي",
  "full_name": "Sa'id bin Muhammad al-Wraq سعيد بن محمد الوراق الثقفي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Kufa",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1780",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن محمد الوراق، وأبو يحيى الحماني قالا حدثنا صالح بن حسان، عن عروة، عن عائشة، قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أردت اللحوق بي فليكفيك من الدنيا كزاد الراكب وإياك ومجالسة الأغنياء ولا تستخلقي ثوبا حتى ترقعيه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث صالح بن حسان ‏.‏ قال وسمعت محمدا يقول صالح بن حسان منكر الحديث وصالح بن أبي حسان الذي روى عنه ابن أبي ذئب ثقة ‏.‏ قال أبو عيسى ومعنى قوله ‏\"‏ وإياك ومجالسة الأغنياء ‏\"‏ ‏.‏ هو نحو ما روي عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من رأى من فضل عليه في الخلق والرزق فلينظر إلى من هو أسفل منه ممن فضل هو عليه فإنه أجدر أن لا يزدري نعمة الله عليه ‏\"‏ ‏.‏ ويروى عن عون بن عبد الله بن عتبة قال صحبت الأغنياء فلم أر أحدا أكثر هما مني أرى دابة خيرا من دابتي وثوبا خيرا من ثوبي وصحبت الفقراء فاسترحت ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The Messenger of Allah (ﷺ) said to me: 'If you want to stick with me, then suffice yourself in the world with the provisions of the rider. And beware of gatherings of the rich, and do not consider a garment to be worn out until it has been patched.'\" [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except as a narration of Salih bin Hassan. He said: I heard Muhammad bin Isma'il saying: \"Salih bin Hassan is Munkar is Hadith.\" And Salih bin Hassan - the one who Ibn Abi Dhi'b reports from - is trustworthy.[Abu 'Eisa said:] The meaning of this saying: \"And beware of gathering of the rich\" is similar to what was related from Abu Hurairah from the Prophet (ﷺ), that he said: \"Whoever sees one that has been more favored than him in appearance and provision, then let him look at the one who is less than him, rather than one who is favored more than him. For indeed it is more appropriate so that he not scorn Allah's favors [upon him].\"And it has been related from 'Awn bin 'Abdullah who said: \"I accompanied the rich, and did not see anyone with more troubles than me. I saw a beast that was better than my beast, and a garment that was better than my garment. And I accompanied the poor, and felt at ease.\"",
      "chain": [
        "30221",
        "25107",
        "20332",
        "22074",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا سعيد بن محمد الوراق، عن يحيى بن سعيد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ السخي قريب من الله قريب من الجنة قريب من الناس بعيد من النار والبخيل بعيد من الله بعيد من الجنة بعيد من الناس قريب من النار ولجاهل سخي أحب إلى الله عز وجل من عابد بخيل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث يحيى بن سعيد عن الأعرج عن أبي هريرة إلا من حديث سعيد بن محمد ‏.‏ وقد خولف سعيد بن محمد في رواية هذا الحديث عن يحيى بن سعيد إنما يروى عن يحيى بن سعيد عن عائشة شيء مرسل ‏.‏",
      "text_en": " Abu  Hurairah  narrated that the Prophet said:                     \"Generosity is close to the people and far from the Fire. Stinginess is far from Allah, far from Paradise, far from the people and close to the Fire. The ignorant generous person, is more beloved to Allah than the worshiping stingy person.\"",
      "chain": [
        "36540",
        "25107",
        "20031",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3476",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا داود بن سليمان العسكري، قال حدثنا محمد بن الصباح، حدثنا سعيد بن محمد الثقفي، عن موسى الجهني، عن زيد بن وهب، عن عطية بن عامر الجهني، قال سمعت سلمان، وأكره، على طعام يأكله فقال حسبي إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن أكثر الناس شبعا في الدنيا أطولهم جوعا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Atiyyah bin ‘Amir Al-Juhani said:                      “I heardSalman, when he was forced to eat food, say: ‘It is sufficient formethat I heard the Messenger of Allah (ﷺ) say: The people who mosteattheir fill in this world will be the most hungry on the Day ofResurrection.’”",
      "chain": [
        "38211",
        "30269",
        "25107",
        "28270",
        "11341",
        "14"
      ]
    }
  ],
  "total_hadiths": 3
}