{
  "id": "25238",
  "name": "al-Qasim bin al-Hakam bin Kathir القاسم بن الحكم بن كثير",
  "full_name": "al-Qasim bin al-Hakam bin Kathir القاسم بن الحكم بن كثير",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "208",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  ت  -  صدوق ]"
    ],
    "tags": [
      "Judge",
      "al-Ra'",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11629",
      "name": "Sa'id bin 'Ubaid al-Tai'i سعيد بن عبيد الطائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15207",
      "name": "Salma bin Nabayt سلمة بن نبيط",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20677",
      "name": "Ma'ql bin 'Ubaidullah معقل بن عبيد الله الجزري أبو عبد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31907",
      "name": "Ibrahim bin Mas'ud إبراهيم بن مسعود",
      "grade": "3rd Century AH"
    },
    {
      "id": "36629",
      "name": "Muhammad bin Hsan bin Fyrwz محمد بن حسان بن فيروز الشيباني الأزرق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38426",
      "name": "'Amr bin Rafa'i al-Qazwayni عمرو بن رافع بن الفرات القزويني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-2648",
      "hadith_no": "2648",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن أحمد بن مدويه الترمذي، حدثنا القاسم بن الحكم العرني، حدثنا عبيد الله بن الوليد الوصافي، عن عطية، عن أبي سعيد، قال دخل رسول الله صلى الله عليه وسلم مصلاه فرأى ناسا كأنهم يكتشرون قال ‏\"‏ أما إنكم لو أكثرتم ذكر هاذم اللذات لشغلكم عما أرى فأكثروا من ذكر هاذم اللذات الموت فإنه لم يأت على القبر يوم إلا تكلم فيه فيقول أنا بيت الغربة وأنا بيت الوحدة وأنا بيت التراب وأنا بيت الدود ‏.‏ فإذا دفن العبد المؤمن قال له القبر مرحبا وأهلا أما إن كنت لأحب من يمشي على ظهري إلى فإذ وليتك اليوم وصرت إلى فسترى صنيعي بك ‏.‏ قال فيتسع له مد بصره ويفتح له باب إلى الجنة ‏.‏ وإذا دفن العبد الفاجر أو الكافر قال له القبر لا مرحبا ولا أهلا أما إن كنت لأبغض من يمشي على ظهري إلى فإذ وليتك اليوم وصرت إلى فسترى صنيعي بك ‏.‏ قال فيلتئم عليه حتى تلتقي عليه وتختلف أضلاعه ‏.‏ قال قال رسول الله صلى الله عليه وسلم بأصابعه فأدخل بعضها في جوف بعض قال ‏\"‏ ويقيض الله له سبعين تنينا لو أن واحدا منها نفخ في الأرض ما أنبتت شيئا ما بقيت الدنيا فينهشنه ويخدشنه حتى يفضى به إلى الحساب ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما القبر روضة من رياض الجنة أو حفرة من حفر النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Sa'eed narrated:                     \" The Messenger of Allah (s.a.w) entered his Musalla and saw the people who looked as if they were smiling. So he said: 'Indeed, if you were to increase in remembrance of the severer of pleasures, then you would find yourselves too busy for what I see. So increase in remembrance of death, the severer of pleasures. For indeed there is no day that comes upon the grave except that it speaks, saying: \"I am thee house of the estranged, I am the house of the solitude, I am the house of dust, and I am the house of the worm-eaten.\" When the believing worshipper is buried, the grave says to him: \"Welcome, make yourself comfortable. Indeed, to me, you are the most beloved of those who walked upon me. Since you have been entrusted to me and delivered to me today, you shall see what I have arranged for you.\" It will then widen for him so that his sight extends, and the door to Paradise is opened for him. And when the wicked worshipper or the disbeliever is buried , the grave says to him: \"You are not welcome, do not get comfortable. Indeed, to me, you are the most hated of those who walked upon me. Since you have been entrusted to me and delivered to me today, you shall see what I have arranged for you.'\" He said: 'It will begin closing in on him(squeezing him) until his ribs are crushing each other.'\" He said: \" The Messenger of Allah (s.a.w) clasped some of his fingers between others and said: 'Seventy giant serpents will constrict him, if even one of them were to hiss on the earth, nothing upon it would grow as long as it remained. They will chew on him and bite him until he is brought to the Reckoning.'\" He said: \" The Messenger of Allah (s.a.w) said: 'The grave is but a garden from the gardens of Paradise, or a pit from the pits of the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "25238",
        "15348",
        "38"
      ]
    }
  ],
  "total_hadiths": 1
}