{
  "id": "25246",
  "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
  "full_name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ د  ت  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "B.Asad",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10830",
      "name": "al-Mqdam bin Shryh bin Han'i المقدام بن شريح بن هانئ بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11383",
      "name": "Awn bin Abi Juhayfa عون بن أبي جحيفة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11524",
      "name": "'Uthman bin 'Abdullah bin Muhab عثمان بن عبد الله بن موهب التيمي الأعرج",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15481",
      "name": "Muhammad bin al-Hakam al-Asadi al-Khali محمد بن الحكم الأسدي الكاهلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11454",
      "name": "Abu Hashim al-Rmany أبو هاشم الرماني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15022",
      "name": "al-Aghr bin al-Sbah al-Tmymy الأغر بن الصباح التميمي المنقري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10743",
      "name": "Isma'il bin 'Abdur Rahman al-Saddi إسماعيل بن عبد الرحمن السدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11323",
      "name": "al-Aswad bin Qays al-Bdy الأسود بن قيس العبدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11389",
      "name": "Maharab bin Dithar محارب بن دثار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20577",
      "name": "Aban bin Tghlb أبان بن تغلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28408",
      "name": "'Ali bin Thabit al-Jzry علي بن ثابت الجزري أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20430",
      "name": "'Asim bin 'Ali bin 'Asim عاصم بن علي بن عاصم بن صهيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30197",
      "name": "Talq bin Ghanam طلق بن غنام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "28363",
      "name": "Abd al-Krym bin Muhammad عبد الكريم بن محمد الجرجاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20636",
      "name": "Musa bin Da'ud al-Dby موسى بن داود الضبي أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20613",
      "name": "Yahya bin 'Abdul Hameed يحيى بن عبد الحميد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "35021",
      "name": "Jabbarh bin al-Mghls al-Hmany Abu جبارة بن المغلس",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "520",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا قيس يعني ابن الربيع، ح وحدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، جميعا عن عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم بمكة وهو في قبة حمراء من أدم فخرج بلال فأذن فكنت أتتبع فمه ها هنا وها هنا ‏.‏ قال ثم خرج رسول الله صلى الله عليه وسلم وعليه حلة حمراء برود يمانية قطري ‏.‏ وقال موسى قال رأيت بلالا خرج إلى الأبطح فأذن فلما بلغ حى على الصلاة حى على الفلاح ‏.‏ لوى عنقه يمينا وشمالا ولم يستدر ثم دخل فأخرج العنزة وساق حديثه ‏.‏",
      "text_en": " Abu Juhaifah reported:                      I came to the prophet (ﷺ) at Mecca; he was sitting in a tent made of leather. Then Bilal came out and called to prayer. I looked at his mouth following him this side and that side (i.e., right and left). Later at his Messenger of Allah (ﷺ) came out clad in a red suit, i.e, wearing the sheets of the Yemen, of the Qatri design. The version narrated by Musa has the word; “I saw Bilal going towards al-Abtah”.He then made a call to prayer. When he reached the words “ come to prayer, come to salvation”. He turned his neck right and left, respectively; he did not turn himself (with his whole body). He then entered (his house) and came out with a lancet. The narrator then reported the rest of the tradition.",
      "chain": [
        "20040",
        "25246",
        "31160",
        "20032",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1846",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الله بن نمير، حدثنا قيس بن الربيع، ح قال وحدثنا قتيبة، حدثنا عبد الكريم الجرجاني، عن قيس بن الربيع المعنى، واحد، عن أبي هاشم يعني الرماني، عن زاذان، عن سلمان، قال قرأت في التوراة أن بركة الطعام الوضوء بعده فذكرت ذلك للنبي صلى الله عليه وسلم فأخبرته بما قرأت في التوراة فقال رسول الله صلى الله عليه وسلم ‏\"‏ بركة الطعام الوضوء قبله والوضوء بعده ‏\"‏ ‏.‏ قال وفي الباب عن أنس وأبي هريرة ‏.‏ قال أبو عيسى لا نعرف هذا الحديث إلا من حديث قيس بن الربيع ‏.‏ وقيس بن الربيع يضعف في الحديث وأبو هاشم الرماني اسمه يحيى بن دينار ‏.‏",
      "text_en": " Narrated Salman:                     \"I read in the Tawrah that the blessing for food is in the Wudu' after it. So I mentioned that to the Prophet (ﷺ), telling him what I read in the Tawrah. So the Messenger of Allah (ﷺ) said: 'The food's blessing is in the Wudu' before it and the Wudu' after it.'\"He said: There are narrations on this topic from Anas and Abu Hurairah.[Abu 'Eisa said:] We do not know of this Hadith except as a narration of Qais bin Ar-Rabi'. Qais [bin Ar-Rabi'] was graded weak in Hadith. Abu Hashim Ar-Rumani's (a narrator in the chain) name is Yahya bin Dinar.",
      "chain": [
        "30221",
        "20331",
        "25246",
        "30367",
        "25246",
        "11454",
        "10911",
        "14"
      ]
    },
    {
      "hadith_no": "3403",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يزيد بن هارون، أخبرنا قيس بن الربيع، عن عثمان بن عبد الله بن موهب، عن موسى بن طلحة، عن أبي اليسر، قال أتتني امرأة تبتاع تمرا فقلت إن في البيت تمرا أطيب منه ‏.‏ فدخلت معي في البيت فأهويت إليها فقبلتها فأتيت أبا بكر فذكرت ذلك له قال استر على نفسك وتب ولا تخبر أحدا ‏.‏ فلم أصبر فأتيت عمر فذكرت ذلك له فقال استر على نفسك وتب ولا تخبر أحدا ‏.‏ فلم أصبر فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له ‏.‏ فقال له ‏\"‏ أخلفت غازيا في سبيل الله في أهله بمثل هذا ‏\"‏ ‏.‏ حتى تمنى أنه لم يكن أسلم إلا تلك الساعة حتى ظن أنه من أهل النار ‏.‏ قال وأطرق رسول الله صلى الله عليه وسلم طويلا حتى أوحى الله إليه ‏:‏ ‏(‏أقم الصلاة طرفى النهار وزلفا من الليل ‏)‏ إلى قوله ‏:‏ ‏(‏ذكرى للذاكرين ‏)‏ ‏.‏ قال أبو اليسر فأتيته فقرأها على رسول الله صلى الله عليه وسلم فقال أصحابه يا رسول الله ألهذا خاصة أم للناس عامة قال ‏\"‏ بل للناس عامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقيس بن الربيع ضعفه وكيع وغيره وأبو اليسر هو كعب بن عمرو ‏.‏ قال وروى شريك عن عثمان بن عبد الله هذا الحديث مثل رواية قيس بن الربيع ‏.‏ قال وفي الباب عن أبي أمامة وواثلة بن الأسقع وأنس بن مالك ‏.‏",
      "text_en": " Narrated Musa bin Talhah:                     that Abu Al-Yasar said: \"A woman came to me selling dates. I said to her: 'There are better dates than these in the house.' So she entered the house with me. I had an urge for her so I began kissing her. I went to Abu Bakr and mentioned that to him, so he said: 'Cover what you have done, repent, do not inform any one, and never do it again.' So I went to 'Umar and mentioned that to him. He said: 'Cover what you have done, repent, do not inform any one, and never do it again.' Then I went to the Prophet (ﷺ) and mentioned it to him.\" He said: 'Is this how you take care of the wife of someone who is away fighting in Allah's cause?\" Such that he had wished he had not accepted Islam until that very time, and he thought that he must be one of the people of the Fire.\" He said: \"The Messenger of Allah (ﷺ) bowed his head for a long time, until Allah revealed to him: And perform the Salat, at the two ends of the day and in some hours of the night. Verily, the good deeds remove the evil deeds. That is a reminder for the mindful (11:114). Abu Al-Yasar said: \"So I went to him and the Messenger of Allah (ﷺ) recited it for me. A companion of his said: \"O Messenger of Allah! Is this specific, or is it for the people in general?\" He said: \"Rather it is for the people in general.\"",
      "chain": [
        "30025",
        "20472",
        "25246",
        "11524",
        "579",
        "1040"
      ]
    },
    {
      "hadith_no": "3623",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا محمد بن يوسف الفريابي، حدثنا قيس بن الربيع، عن الأغر بن الصباح، عن خليفة بن حصين، عن أبي نصر، عن ابن عباس، في قوله تعالى ‏:‏ ‏(‏ إذا جاءكم المؤمنات مهاجرات فامتحنوهن ‏)‏ قال كانت المرأة إذا جاءت النبي صلى الله عليه وسلم لتسلم حلفها بالله ما خرجت من بغض زوجي ما خرجت إلا حبا لله ولرسوله ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " [Abu An-Nasr narrated :                     from Ibn Abbas, regarding the saying of Allah, the Most High: When believing women come to you as emigrants, examine them. He said: “When a woman come to the Prophet to accept Islam, she would have to take and an oath by Allah: ‘I have not left out of anger with my husband, I have not left except out of love for Allah and His Messenger.’”]",
      "chain": [
        "30417",
        "20034",
        "25246",
        "15022",
        "18261"
      ]
    },
    {
      "hadith_no": "3520",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا علي بن ثابت، حدثني قيس بن الربيع، وكان، من بني أسد عن الأغر بن الصباح، عن خليفة بن حصين، عن علي بن أبي طالب، قال أكثر ما دعا به رسول الله صلى الله عليه وسلم عشية عرفة في الموقف ‏\"‏ اللهم لك الحمد كالذي نقول وخيرا مما نقول اللهم لك صلاتي ونسكي ومحياى ومماتي وإليك مآبي ولك رب تراثي اللهم إني أعوذ بك من عذاب القبر ووسوسة الصدر وشتات الأمر اللهم إني أعوذ بك من شر ما تجيء به الريح ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏",
      "text_en": " Ali bin Abi Talib said:                     “The most of what the Messenger of Allah supplicated with during the afternoon at Arafat while standing was: ‘O Allah to You is the praise like the one You say, and better than what we say. O Allah, for You is all my Salat, my sacrifice, my living and my dying. And to You is my return, and to You, my Lord, belongs my inheritance. O Allah, indeed, I seek refuge in You from the punishment of the grave, the whispering of the chest, and the diving of the affair. O Allah, indeed, I seek refuge in You from the evil of what the wing brings (Allahumma Lakal-Hamdu, Kalladhi Taqulu, Wa  Khairan Mimma Naqul. Allahumma Laka Salati Wa Nusuki, Wa Mahyaya Wa Mamati, Ilaika Mabi, Wa Laka, Rabbi, Turath. Allahumma Inni A’udhu Bika Min Adhabil-Qabri, Wa Waswasatis-Sadri, WA Shatatil-Amr. Allahumma Inni A’udhu Bika Min Sharri Ma Taji’u Bihir-Rih).”",
      "chain": [
        "38487",
        "28408",
        "25246",
        "15022",
        "18261",
        "5"
      ]
    },
    {
      "hadith_no": "1213",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، وزيد بن أخزم، ومحمد بن معمر، قالوا حدثنا موسى بن داود الكوفي، حدثنا قيس بن الربيع، عن شعبة، عن خالد الحذاء، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا فاتته الأربع قبل الظهر صلاها بعد الركعتين بعد الظهر ‏.‏ قال أبو عبد الله لم يحدث به إلا قيس عن شعبة ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “If the Messenger of Allah (ﷺ)missed the four Rak’ah before the Zuhr, he would perform them afterthe two Rak’ah which come after the Zuhr.”",
      "chain": [
        "11222",
        "30136",
        "30172",
        "20636",
        "25246",
        "20020",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "3442",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا قيس بن الربيع، عن محارب بن دثار، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نعم الإدام الخل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)said:                      “What a blessed condiment vinegar is.”",
      "chain": [
        "35021",
        "25246",
        "11389",
        "34"
      ]
    }
  ],
  "total_hadiths": 7
}