{
  "id": "25260",
  "name": "Muhammad bin al-Hasan bin Abi Yazid محمد بن الحسن بن أبي يزيد الهمداني",
  "full_name": "Muhammad bin al-Hasan bin Abi Yazid محمد بن الحسن بن أبي يزيد الهمداني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa",
      "Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ت  الترمذي]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufi",
      "Wasit"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2693",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا محمد بن الحسن بن أبي يزيد الهمداني، عن ثور بن يزيد، عن خالد بن معدان، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عير أخاه بذنب لم يمت حتى يعمله ‏\"‏ ‏.‏ قال أحمد من ذنب قد تاب منه ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بمتصل ‏.‏ وخالد بن معدان لم يدرك معاذ بن جبل وروي عن خالد بن معدان أنه أدرك سبعين من أصحاب النبي صلى الله عليه وسلم ‏.‏ ومات معاذ بن جبل في خلافة عمر بن الخطاب وخالد بن معدان روى عن غير واحد من أصحاب معاذ عن معاذ غير حديث ‏.‏",
      "text_en": " Khalid bin Ma'dan narrated from Mu'adh bin Jabal that the Messenger of Allah (s.a.w) said:                     \"Whoever shames his brother for a sin, he shall not die until he (himself) commits it.\" (One of the narrators) Ahmad said: They said: 'From a sin he has repented from.\"",
      "chain": [
        "30242",
        "25260",
        "20415",
        "11422",
        "32"
      ]
    },
    {
      "hadith_no": "3176",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا شهاب بن عباد العبدي، حدثنا محمد بن الحسن بن أبي يزيد الهمداني، عن عمرو بن قيس، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الرب عز وجل من شغله القرآن وذكري عن مسألتي أعطيته أفضل ما أعطي السائلين وفضل كلام الله على سائر الكلام كفضل الله على خلقه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Atiyyah:                     from Abu Sa'eed, that the Messenger of Allah (ﷺ) said: \"The Lord, Blessed and Most High is He, has said: 'Whoever is too busy with the Qur'an for remembering Me and asking Me, then I shall give him more than what I give to those who ask.' And the virtue of Allah's Speech over the speech of others is like the virtue of Allah over His creation.",
      "chain": [
        "34188",
        "30196",
        "25260",
        "213",
        "38"
      ]
    }
  ],
  "total_hadiths": 2
}