{
  "id": "25262",
  "name": "Muhammad bin Rabi'ya al-Klaby محمد بن ربيعة الكلابي",
  "full_name": "Muhammad bin Rabi'ya al-Klaby محمد بن ربيعة الكلابي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "190",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  -  صدوق ]"
    ],
    "tags": [
      "al-Kalabi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "23505",
      "name": "al-Sa'ib bin 'Umar السائب بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11530",
      "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20598",
      "name": "Fdyl bin Mrzwq al-Aghr al-Rqashy فضيل بن مرزوق الأغر الرقاشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25259",
      "name": "Muhammad bin al-Hasan bin Atyh محمد بن الحسن بن عطية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14410",
      "name": "Wasl bin al-Sa'ib al-Rqashy واصل بن السائب الرقاشي أبو يحيى البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28676",
      "name": "Abu al-Hasan al-Sqlany أبو الحسن العسقلاني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30316",
      "name": "Bashr bin al-Hakam bin Habib بشر بن الحكم بن حبيب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30498",
      "name": "Ibrahim bin Sa'id al-Juhari إبراهيم بن سعيد الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38011",
      "name": "Ahmed bin Harb bin Muhammad أحمد بن حرب بن محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38644",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36587",
      "name": "'Abdur Rahman bin Muhammad عبد الرحمن بن محمد بن سلام",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3128",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا محمد بن ربيعة، عن محمد بن الحسن بن عطية، عن أبيه، عن جده، عن أبي سعيد الخدري، قال لعن رسول الله صلى الله عليه وسلم النائحة والمستمعة ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) cursed the wailing woman and the woman who listens to her.",
      "chain": [
        "30309",
        "25262",
        "25259",
        "38"
      ]
    },
    {
      "hadith_no": "4078",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد الثقفي، حدثنا محمد بن ربيعة، حدثنا أبو الحسن العسقلاني، عن أبي جعفر بن محمد بن علي بن ركانة، عن أبيه، أن ركانة، صارع النبي صلى الله عليه وسلم فصرعه النبي صلى الله عليه وسلم قال ركانة وسمعت النبي صلى الله عليه وسلم يقول ‏\"‏ فرق ما بيننا وبين المشركين العمائم على القلانس ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn Rukanah:                     Ali quoting his father said: Rukanah wrestled  with the Prophet (ﷺ) and the Prophet (ﷺ) threw him on the ground. Rukanah said: I heard the Prophet (ﷺ) say: The difference between us and the polytheists is that we wear turbans over caps.",
      "chain": [
        "30367",
        "25262",
        "28676"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا محمد بن ربيعة، عن فضيل بن مرزوق، عن عطية العوفي، عن أبي سعيد الخدري، قال كان نبي الله صلى الله عليه وسلم يصلي الضحى حتى نقول لا يدع ويدعها حتى نقول لا يصلي ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated:                     \"The Prophet would pray Ad-Duha until we would say: 'He will not leave it.' And he would leave it until we would say: 'He will not pray it.'\"",
      "chain": [
        "30249",
        "25262",
        "20598",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الرحمن بن الأسود أبو عمرو البصري، حدثنا محمد بن ربيعة، عن ابن جريج، عن أبي الزبير، عن جابر، قال نهى النبي صلى الله عليه وسلم أن تجصص القبور وأن يكتب عليها وأن يبنى عليها وأن توطأ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح قد روي من غير وجه عن جابر ‏.‏ وقد رخص بعض أهل العلم منهم الحسن البصري في تطيين القبور ‏.‏ وقال الشافعي لا بأس أن يطين القبر ‏.‏",
      "text_en": " Jabir narrated:                     \"The Messenger of Allah prohibited plastering graves, writing on them, building over them, and treading on them.\"",
      "chain": [
        "25262",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1424",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا عبد الرحمن بن الأسود أبو عمرو البصري، حدثنا محمد بن ربيعة، حدثنا يزيد بن زياد الدمشقي، عن الزهري، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ادرءوا الحدود عن المسلمين ما استطعتم فإن كان له مخرج فخلوا سبيله فإن الإمام أن يخطئ في العفو خير من أن يخطئ في العقوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"",
      "chain": [
        "25262",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1784",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، حدثنا محمد بن ربيعة، عن أبي الحسن العسقلاني، عن أبي جعفر بن محمد بن ركانة، عن أبيه، أن ركانة، صارع النبي صلى الله عليه وسلم فصرعه النبي صلى الله عليه وسلم قال ركانة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن فرق ما بيننا وبين المشركين العمائم على القلانس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وإسناده ليس بالقائم ‏.‏ ولا نعرف أبا الحسن العسقلاني ولا ابن ركانة ‏.‏",
      "text_en": " Narrated Abu Ja'far bin Muhammad bin Rukanah:                     From this father that Rukanah wrestled the Prophet (ﷺ) and the Prophet (ﷺ) won the match. Rukanah said: \"I heard the Messenger of Allah (ﷺ) saying: 'Indeed what distinguishes between us and between the idolater is the turban over the cap.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Its chain is not established, and we do not know of Abu Al-Hasan Al-'Asqalani, nor Ibn Rukanah.",
      "chain": [
        "30367",
        "25262",
        "28676"
      ]
    },
    {
      "hadith_no": "2331",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا محمد بن ربيعة، عن كامل أبي العلاء، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عمر أمتي من ستين سنة إلى سبعين سنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي صالح عن أبي هريرة وقد روي من غير وجه عن أبي هريرة ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"The lifespan for my Ummah is from sixty years to seventy [years].\"",
      "chain": [
        "30498",
        "25262",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3566",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الرحمن بن الأسود أبو عمرو البصري، حدثنا محمد بن ربيعة، عن ابن جريج، عن عطاء، عن عائشة، رضى الله عنها قالت كان النبي صلى الله عليه وسلم إذا رأى مخيلة أقبل وأدبر فإذا مطرت سري عنه ‏.‏ قالت فقلت له ‏.‏ فقال ‏\"‏ وما أدري لعله كما قال الله تعالى ‏:‏ ‏(‏فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Aishah [may Allah be pleased with her]:                     \"When the Prophet (ﷺ) saw storm clouds he would pace back and forth. And when it rained, he would relax.\" She said: \"I said something to him about that, and he said: 'What do I know? Maybe it is as Allah, Most High said: Then, when they saw it as a dense cloud approaching their valleys, they said: \"This is a cloud bringing us rain (46:24).\"'",
      "chain": [
        "25262",
        "11070",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "3449",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الرحمن بن الأسود أبو عمرو البصري، حدثنا محمد بن ربيعة، عن ابن جريج، عن عطاء، عن عائشة، رضى الله عنها قالت كان النبي صلى الله عليه وسلم إذا رأى الريح قال ‏\"‏ اللهم إني أسألك من خيرها وخير ما فيها وخير ما أرسلت به وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبى بن كعب رضى الله عنه وهذا حديث حسن ‏.‏",
      "text_en": " Aishah [may Allah be pleased with her] narrates, saying:                     “When the Prophet would see the wind he would say: ‘O Allah, indeed, I ask You for its good, the good of what is in it, and the good of what it has been sent with. And I seek refuge in You from its evil. The evil of what is in it, and the evil of what it has been sent with (Allahumma Inni As’aluka Min Kahairiha Wa Khairi Ma Fiha, Wa Khairi Ma Ursilat Bihi, Wa Ma A’udhu Bika Min Sharriha Wa Sharri Ma Fiha, Wa Sharri Ma Ursilat Bih).’”",
      "chain": [
        "25262",
        "11070",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا أحمد بن حرب، حدثنا محمد بن ربيعة، عن ابن جريج، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس بين العبد وبين الكفر إلا ترك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                      \"The Messenger of Allah (ﷺ) said: 'There is nothing between a person and disbelief except abandoning Salah.'\"",
      "chain": [
        "38011",
        "25262",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا عبد الرحمن بن الأسود البصري، قال حدثنا محمد بن ربيعة، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن عراك بن مالك، عن عبيد الله بن عبد الله، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام بمكة خمسة عشر يصلي ركعتين ركعتين ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Messenger of Allah (ﷺ) stayed in Makkah (for fifteen days), praying each prayer with two rak'ahs.",
      "chain": [
        "25262",
        "11875",
        "11411",
        "11204",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3633",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن الوليد الفحام، قال حدثنا محمد بن ربيعة، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم أتى سعدا يعوده فقال له سعد يا رسول الله أوصي بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قال فأوصي بالنصف قال ‏\"‏ لا ‏\"‏‏.‏ قال فأوصي بالثلث قال ‏\"‏ نعم الثلث والثلث كثير أو كبير إنك أن تدع ورثتك أغنياء خير من أن تدعهم فقراء يتكففون ‏\"‏‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah came to visit Sa'd (when he was sick). Sa'd said to him:                      \"O Messenger of Allah, shall I bequeath two-thirds of my wealth?\" He said: \"No.\" He said: \"Shall I bequeath half?\" He said: \"No.\" He said: \"Shall I bequeath one-third?\" He said: \"Yes, one-third, and one-third is much or large. If you leave your heirs independent of means that is better than if you leave them poor, holding out their hands.\"",
      "chain": [
        "36662",
        "25262",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "468",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن عبد الله الرقي، حدثنا محمد بن ربيعة الكلابي، حدثنا واصل بن السائب الرقاشي، عن أبي سورة، عن أبي أيوب الأنصاري، قال رأيت رسول الله  صلى الله عليه وسلم  توضأ فخلل لحيته ‏.‏",
      "text_en": " It was narrated that Abu Ayyub Al-Ansari said:                     \"I saw the Messenger of Allah performing ablution and he ran his fingers through his beard.\"",
      "chain": [
        "38111",
        "25262",
        "33"
      ]
    }
  ],
  "total_hadiths": 13
}