{
  "id": "25316",
  "name": "al-Mnhal bin Khlyfh المنهال بن خليفة",
  "full_name": "al-Mnhal bin Khlyfh المنهال بن خليفة",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-'Ajli",
      "al-Kufa"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]",
        "ar": "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]",
        "ckb": "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-'Ajli",
        "ar": "al-'Ajli",
        "ckb": "al-'Ajli"
      },
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1007",
      "hadith_no": "1007",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أشعث بن شعبة، عن المنهال بن خليفة، عن الأزرق بن قيس، قال صلى بنا إمام لنا يكنى أبا رمثة فقال صليت هذه الصلاة - أو مثل هذه الصلاة - مع النبي صلى الله عليه وسلم ‏.‏ قال وكان أبو بكر وعمر يقومان في الصف المقدم عن يمينه وكان رجل قد شهد التكبيرة الأولى من الصلاة فصلى نبي الله صلى الله عليه وسلم ثم سلم عن يمينه وعن يساره حتى رأينا بياض خديه ثم انفتل كانفتال أبي رمثة - يعني نفسه - فقام الرجل الذي أدرك معه التكبيرة الأولى من الصلاة يشفع فوثب إليه عمر فأخذ بمنكبه فهزه ثم قال اجلس فإنه لم يهلك أهل الكتاب إلا أنه لم يكن بين صلواتهم فصل ‏.‏ فرفع النبي صلى الله عليه وسلم بصره فقال ‏\"‏ أصاب الله بك يا ابن الخطاب ‏\"‏ ‏.‏ قال أبو داود وقد قيل أبو أمية مكان أبي رمثة ‏.‏",
      "text_en": " Narrated Al-Azraq ibn Qays:                     An imam of ours, whose kunyah (surname) was AbuRimthah, led us in prayer and said: I prayed this prayer, or one like it, with the Prophet (ﷺ). AbuBakr and Umar were standing in the front row on his right and there was a man who had been present at the first takbir in the prayer. The Prophet of Allah (ﷺ) offered the prayer, then gave the salutation to his right and his left so that we saw the whiteness of his cheeks, then turned away as AbuRimthah (meaning himself) had done.  The man who has been present with him at the first takbir in the prayer then got up to pray another prayer, whereupon Umar leaped up and, seizing him by the shoulders, shook him and said: Sit down, for the People of the Book perished for no other reason than that there was no interval between their prayers.  The Prophet (ﷺ) raised his eyes and said: Allah has made you say what is right, son of al-Khattab.Abu Dawud said: Sometimes the name of Abu Umayyah is narrated instead of Abu Rimthah.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "28050",
        "25316",
        "11574"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1057",
      "hadith_no": "1057",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، ومحمد بن عمرو السواق، قالا حدثنا يحيى بن اليمان، عن المنهال بن خليفة، عن الحجاج بن أرطاة، عن عطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم دخل قبرا ليلا فأسرج له سراج فأخذه من قبل القبلة وقال ‏\"‏ رحمك الله إن كنت لأواها تلاء للقرآن ‏\"‏ ‏.‏ وكبر عليه أربعا ‏.‏ قال وفي الباب عن جابر ويزيد بن ثابت وهو أخو زيد بن ثابت أكبر منه ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وقالوا يدخل الميت القبر من قبل القبلة ‏.‏ وقال بعضهم يسل سلا ‏.‏ ورخص أكثر أهل العلم في الدفن بالليل ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet entered a grave during the night, so a torch was lit for him. He took it (the deceased) in from the direction of the Qiblah, and he said: 'May Allah have mercy upon you, you were often invoking (Allah) by reciting the Qur'an.' And he said: 'Allahu Akbar four times.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30381",
        "25316",
        "20580",
        "11029",
        "17"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-1571",
      "hadith_no": "1571",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو هشام الرفاعي، ومحمد بن الصباح، وأبو بكر بن خلاد قالوا حدثنا يحيى بن اليمان، عن المنهال بن خليفة، عن حجاج، عن عطاء، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كبر أربعا ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said Takbirfourtimes.",
      "usc_msa_ref": "",
      "chain": [
        "30478",
        "30269",
        "30357",
        "25316",
        "20219",
        "11029",
        "17"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 3,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}