{
  "id": "25325",
  "name": "al-Nadr bin Isma'il bin Hazm النضر بن إسماعيل بن حازم",
  "full_name": "al-Nadr bin Isma'il bin Hazm النضر بن إسماعيل بن حازم",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Not Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "182",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ ت  س  -  مستور ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11387",
      "name": "Muhammad bin Suqah محمد بن سوقة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30352",
      "name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30223",
      "name": "Yusuf bin 'Ady يوسف بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36618",
      "name": "al-Qasim bin Salam القاسم بن سلام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36662",
      "name": "Muhammad bin al-Walid محمد بن الوليد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30242",
      "name": "Ahmed bin Manay' أحمد بن منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2165",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا النضر بن إسماعيل أبو المغيرة، عن محمد بن سوقة، عن عبد الله بن دينار، عن ابن عمر، قال خطبنا عمر بالجابية فقال يا أيها الناس إني قمت فيكم كمقام رسول الله صلى الله عليه وسلم فينا فقال ‏\"‏ أوصيكم بأصحابي ثم الذين يلونهم ثم الذين يلونهم ثم يفشو الكذب حتى يحلف الرجل ولا يستحلف ويشهد الشاهد ولا يستشهد ألا لا يخلون رجل بامرأة إلا كان ثالثهما الشيطان عليكم بالجماعة وإياكم والفرقة فإن الشيطان مع الواحد وهو من الاثنين أبعد من أراد بحبوحة الجنة فليلزم الجماعة من سرته حسنته وساءته سيئته فذلك المؤمن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وقد رواه ابن المبارك عن محمد بن سوقة وقد روي هذا الحديث من غير وجه عن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn 'Umar narrated:                     \" 'Umar delivered a Khutbah to us at Al-Jabiyah. He said: 'O you people! Indeed I have stood among you as the Messenger of Allah(s.a.w) stood among us, and he said: \"I order you (to stick to) my Companions, then those who come after them, then those who come after them. Then lying will spread until a man will take an oath when no oath was sought from him, and a witness will testify when his testimony was not sought. Behold! A man is not alone with a woman but the third of them is Ash-Shaitan. Adhere to the Jama'ah, beware of separation, for indeed Ash-Shaitan is with one, and he is further away from two. Whoever wants the best place in Paradise, then let him stick to the Jama'ah. Whoever rejoices with his good deeds and grieves over his evil deeds, then that is the  believer among you.'\"",
      "chain": [
        "30242",
        "25325",
        "11387",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "3450",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا النضر بن إسماعيل أبو المغيرة، عن الأعمش، عن أبي صالح، عن أبي سعيد الخدري، رضى الله عنه قال قرأ رسول الله صلى الله عليه وسلم ‏:‏ ‏(‏ وأنذرهم يوم الحسرة ‏)‏ قال ‏\"‏ يؤتى بالموت كأنه كبش أملح حتى يوقف على السور بين الجنة والنار فيقال يا أهل الجنة ‏.‏ فيشرئبون ‏.‏ ويقال يا أهل النار ‏.‏ فيشرئبون ‏.‏ فيقال هل تعرفون هذا فيقولون نعم هذا الموت ‏.‏ فيضجع فيذبح فلولا أن الله قضى لأهل الجنة الحياة فيها والبقاء لماتوا فرحا ولولا أن الله قضى لأهل النار الحياة فيها والبقاء لماتوا ترحا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"The Messenger of Allah (ﷺ) recited: And warn them of a Day of griefs and regrets (19:39) and he said: 'Death will be brought as if it is a mixed black and white ram, until it is halted upon the barrier between Paradise and the Fire. It will be said: 'O people of Paradise! They will raise up their necks to look. It will be said: 'O people of the Fire! And they will raise up their necks to look. It will be said: 'Do you recognize this?' They will say: 'Yes. This is death.' Then it will be laid down and slaughtered. If it were not that Allah had decreed that the inhabitants of Paradise would remain, then they would die of joy, and if it were not that Allah had decreed that the inhabitants of the Fire would remain, then they would die of grief.'\"",
      "chain": [
        "30242",
        "25325",
        "11060",
        "11161",
        "38"
      ]
    }
  ],
  "total_hadiths": 2
}