{
  "id": "25322",
  "name": "Maysara bin Habib al-Nahdi ميسرة بن حبيب النهدي",
  "full_name": "Maysara bin Habib al-Nahdi ميسرة بن حبيب النهدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "al-Nahdi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10790",
      "name": "'Abdur Rahman bin Qays عبد الرحمن بن قيس أبو صالح الحنفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20593",
      "name": "'Ali bin Salah bin Salah علي بن صالح بن صالح بن حي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25154",
      "name": "'Abdul Jabbar bin al-'Abbas عبد الجبار بن العباس الشبامي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5217",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، وابن، بشار قالا حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن أم المؤمنين، عائشة رضى الله عنها أنها قالت ما رأيت أحدا كان أشبه سمتا وهديا ودلا - وقال الحسن حديثا وكلاما ولم يذكر الحسن السمت والهدى والدل - برسول الله صلى الله عليه وسلم من فاطمة كرم الله وجهها كانت إذا دخلت عليه قام إليها فأخذ بيدها وقبلها وأجلسها في مجلسه وكان إذا دخل عليها قامت إليه فأخذت بيده فقبلته وأجلسته في مجلسها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I never saw anyone more like the Messenger of Allah (ﷺ) in respect of gravity, calm deportment, pleasant disposition - according to al-Hasan's version: in respect of talk and speech. Al-Hasan did not mention gravity, calm deportment, pleasant disposition - than Fatimah, may Allah honour her face. When she came to visit him (the Prophet) he got up to (welcome) her, took her by the hand, kissed her and made her sit where he was sitting; and when he went to visit her, she got up to (welcome) him, took him by the hand, kissed him, and made him sit where she was sitting.",
      "chain": [
        "30",
        "30160",
        "20262",
        "20311",
        "25322",
        "11656",
        "10504"
      ]
    },
    {
      "hadith_no": "4150",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، وإسحاق بن منصور، قالا أخبرنا محمد بن يوسف، عن إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن زر بن حبيش، عن حذيفة، قال سألتني أمي متى عهدك - تعني - بالنبي صلى الله عليه وسلم ‏.‏ فقلت ما لي به عهد منذ كذا وكذا ‏.‏ فنالت مني فقلت لها دعيني آتي النبي صلى الله عليه وسلم فأصلي معه المغرب وأسأله أن يستغفر لي ولك ‏.‏ فأتيت النبي صلى الله عليه وسلم فصليت معه المغرب فصلى حتى صلى العشاء ثم انفتل فتبعته فسمع صوتي فقال ‏\"‏ من هذا حذيفة ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ما حاجتك غفر الله لك ولأمك ‏\"‏ ‏.‏ قال ‏\"‏ إن هذا ملك لم ينزل الأرض قط قبل هذه الليلة استأذن ربه أن يسلم على ويبشرني بأن فاطمة سيدة نساء أهل الجنة وأن الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث إسرائيل ‏.‏",
      "text_en": " Narrated Hudhaifah :                     \"My mother asked me: 'When is your planned time - meaning with the Prophet (ﷺ)?' So I said: 'I have not had a planned time to see him since such and such time.' She rebuked me, so I said to her: 'Let me go to the Prophet (ﷺ) so that I may perform Maghrib (prayer) with him, and ask him to seek forgiveness for you and I.' So I came to the Prophet (ﷺ), and I prayed Maghrib with him, then he prayed until he prayed Al-'Isha. Then he turned, and I followed him, and he heard my voice, and said: 'Who is this? Hudhaifah?' I said: 'Yes.' He said: \"What is your need, may Allah forgive you and your mother?' He said: 'Indeed, this is an angel that never descended to the earth ever before tonight. He sought permission from his Lord to greet me with peace and to give me the glad tidings that Fatimah is the chief of the women of Paradise, and that Al-Hasan and Al-Husain are the chiefs of the youths of the people of Paradise.'\"",
      "chain": [
        "30025",
        "30313",
        "30388",
        "20311",
        "25322",
        "11656",
        "11337",
        "145"
      ]
    },
    {
      "hadith_no": "4246",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت ما رأيت أحدا أشبه سمتا ودلا وهديا برسول الله في قيامها وقعودها من فاطمة بنت رسول الله صلى الله عليه وسلم ‏.‏ قالت وكانت إذا دخلت على النبي صلى الله عليه وسلم قام إليها فقبلها وأجلسها في مجلسه وكان النبي صلى الله عليه وسلم إذا دخل عليها قامت من مجلسها فقبلته وأجلسته في مجلسها فلما مرض النبي صلى الله عليه وسلم دخلت فاطمة فأكبت عليه فقبلته ثم رفعت رأسها فبكت ثم أكبت عليه ثم رفعت رأسها فضحكت فقلت إن كنت لأظن أن هذه من أعقل نسائنا فإذا هي من النساء فلما توفي النبي صلى الله عليه وسلم قلت لها أرأيت حين أكببت على النبي صلى الله عليه وسلم فرفعت رأسك فبكيت ثم أكببت عليه فرفعت رأسك فضحكت ما حملك على ذلك قالت إني إذا لبذرة أخبرني أنه ميت من وجعه هذا فبكيت ثم أخبرني أني أسرع أهله لحوقا به فذاك حين ضحكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث من غير وجه عن عائشة ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"I have not seen anyone closer in conduct, way, and manners to that of the Messenger of Allah in regards to standing and sitting, than Fatimah the daughter of the Messenger of Allah (ﷺ).\" She said \"Whenever she would enter upon the Prophet (ﷺ) he would stand to her and kiss her, and he would sit her in his sitting place. Whenever the Prophet (ﷺ) entered upon her she would stand from her seat, and kiss him and sit him in her sitting place. So when the Prophet (ﷺ) fell sick and Fatimah entered, she bent over and kissed him. Then she lifted her head and cried, then she bent over him and she lifted her head and laughed. So I said: 'I used to think that this one was from the most intelligent of our women, but she is really just one of the women.' So when the Prophet (ﷺ) died, I said to her: 'Do you remember when you bent over the Prophet (ﷺ) and you lifted your head and cried, then you bent over him, then you lifted your head and laughed. What caused you to do that?' She said: 'Then, I would be the one who spreads the secrets. He (ﷺ) told me that he was to die from his illness, so I cried. Then he told me that I would be the quickest of his family to meet up with him. So that is when I laughed.'\"",
      "chain": [
        "30160",
        "20262",
        "20311",
        "25322",
        "11656",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "893",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، قال أخبرني ميسرة بن حبيب، قال سمعت المنهال بن عمرو، يحدث عن أبي عبيدة، عن عبد الله، أنه رأى رجلا يصلي قد صف بين قدميه فقال أخطأ السنة ولو راوح بينهما كان أعجب إلى ‏.‏",
      "text_en": " It was narrated from Abdullah that:                     He saw a man praying with his feet together. He said: \"He is not following the Sunnah. If he were to shift his weight from one to the other I would like that better.\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "25322",
        "11656",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "3006",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم الأودي، قال حدثنا خالد بن مخلد، قال حدثنا علي بن صالح، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن سعيد بن جبير، قال كنت مع ابن عباس بعرفات فقال ما لي لا أسمع الناس يلبون قلت يخافون من معاوية ‏.‏ فخرج ابن عباس من فسطاطه فقال لبيك اللهم لبيك لبيك فإنهم قد تركوا السنة من بغض علي ‏.‏",
      "text_en": " It was narrated that Saeed bin Jubair said:                     \"I was with Ibn Abbas in Arafat and he said: 'Why do I not hear the people reciting Talbiyah?' I said: They are afraid of Muawiyah.' So Ibn Abbas went out of his tent and said: \"Labbaik Allahumma Labbaik, Labbaik! They are only forsaking the Sunnah out of hatred for Ali.'\"",
      "chain": [
        "30185",
        "30463",
        "20593",
        "25322",
        "11656",
        "11050"
      ]
    }
  ],
  "total_hadiths": 5
}