{
  "id": "25510",
  "name": "Anas bin Abi Aans أنس بن مالك بن أبي عامر الأصبحي",
  "full_name": "Anas bin Abi Aans (Malik) أنس بن مالك بن أبي عامر الأصبحي",
  "grade": "Succ. (Taba' Tabi')",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": [
      "al-Asbahi",
      "Ally B.Taym",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11443",
      "name": "Malik bin Abi 'Amir مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11445",
      "name": "Nafi' bin Malik bin Abi 'Amir نافع بن مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "21679",
      "name": "Uvais bin Malik bin Abi 'Amir أويس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "21725",
      "name": "al-Rabi' bin Malik bin Abi 'Amir الربيع بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "children": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    }
  ],
  "teachers": [
    {
      "id": "11443",
      "name": "Malik bin Abi 'Amir مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1482",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن بن أبي صعصعة المازني، عن أبيه، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة أوسق من التمر صدقة، وليس فيما دون خمس أواق من الورق صدقة، وليس فيما دون خمس ذود من الإبل صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"No Zakat is imposed on less than five Awsuq of dates; no Zakat is imposed on less than five Awaq of silver, and no Zakat is imposed on less than five camels.\"",
      "chain": [
        "30355",
        "20001",
        "25510",
        "38"
      ]
    },
    {
      "hadith_no": "1508",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، حدثنا مالك، قال حدثني محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة، عن أبيه، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما أقل من خمسة أوسق صدقة، ولا في أقل من خمسة من الإبل الذود صدقة، ولا في أقل من خمس أواق من الورق صدقة ‏\"‏‏.‏ قال أبو عبد الله هذا تفسير الأول إذا قال ‏\"‏ ليس فيما دون خمسة أوسق صدقة ‏\"‏‏.‏ ويؤخذ أبدا في العلم بما زاد أهل الثبت أو بينوا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"There is no Zakat on less than five Awsuq (of dates), or on less than five camels, or on less than five Awaq of silver.\" (22 Yemeni Riyals Faransa).",
      "chain": [
        "30175",
        "20031",
        "20001",
        "25510",
        "38"
      ]
    },
    {
      "hadith_no": "3296",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا قتيبة، عن مالك، عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة الأنصاري، عن أبيه، أنه أخبره أن أبا سعيد الخدري  رضى الله عنه  قال له ‏\"‏ إني أراك تحب الغنم والبادية، فإذا كنت في غنمك وباديتك فأذنت بالصلاة، فارفع صوتك بالنداء، فإنه لا يسمع مدى صوت المؤذن جن ولا إنس ولا شىء إلا شهد له يوم القيامة ‏\"‏‏.‏ قال أبو سعيد سمعته من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Abdullah bin `Abdur-Rahman bin Abi Sasaa Ansari:                     That Abu Sa`id Al-Khudri said to his father. \"I see you are fond of sheep and the desert, so when you want to pronounce the Adhan, raise your voice with it for whoever will hear the Adhan whether a human being, or a Jinn, or anything else, will bear witness, in favor on the Day of Resurrection.\" Abu Sa`id added, \"I have heard this from Allah's Apostle .\"",
      "chain": [
        "30367",
        "20001",
        "25510",
        "38"
      ]
    },
    {
      "hadith_no": "259",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه قتيبة بن سعيد، عن مالك بن أنس، عن أبي بكر بن نافع، عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه أمر بإحفاء الشوارب وإعفاء اللحية ‏.‏",
      "text_en": " Ibn Umar said:                      The Apostle of Allah (may peace be upon him) ordered us to trim the moustache closely and spare the beard.",
      "chain": [
        "30367",
        "20001",
        "25510",
        "18"
      ]
    },
    {
      "hadith_no": "3835",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثني زهير بن حرب، حدثني إسحاق بن عيسى، حدثنا مالك، عن سهيل، عن أبيه، عن أبي هريرة، أن سعد بن عبادة، قال يا رسول الله إن وجدت مع امرأتي رجلا أأمهله حتى آتي بأربعة شهداء قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Sa'd b. Ubada (Allah be pleased with him) said:                      Messenger of Allah, if I were to find with my wife a man, should I wait until I bring four witnesses? He said: Yes.",
      "chain": [
        "30022",
        "20001",
        "25510",
        "13",
        "35"
      ]
    },
    {
      "hadith_no": "6709",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تفتح أبواب الجنة يوم الاثنين ويوم الخميس فيغفر لكل عبد لا يشرك بالله شيئا إلا رجلا كانت بينه وبين أخيه شحناء فيقال أنظروا هذين حتى يصطلحا أنظروا هذين حتى يصطلحا أنظروا هذين حتى يصطلحا ‏\"‏ ‏.‏  حدثنيه زهير بن حرب، حدثنا جرير، ح وحدثنا قتيبة بن سعيد، وأحمد بن عبدة، الضبي عن عبد العزيز الدراوردي، كلاهما عن سهيل، عن أبيه، بإسناد مالك نحو حديثه غير أن في حديث الدراوردي ‏\"‏ إلا المتهاجرين ‏\"‏ ‏.‏ من رواية ابن عبدة وقال قتيبة ‏\"‏ إلا المهتجرين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The gates of Paradise are not opened but on two days, Monday and Thursday. and then every servant (of Allah) is granted pardon who does not associate anything with Allah except the person in whose (heart) there is rancour against his brother. And it would be said: Look towards both of them until there is reconciliation; look toward both of them until there is reconciliation; look towards both of them until there is reconciliation. This hadith has been narrated on the authority of Suhail who narrated it on the authority of his father with the chain of transmitters of MaIik, but with this variation of wording:, (Those would not be granted pardon) who bycott each other.\"",
      "chain": [
        "30367",
        "20001",
        "25510",
        "13"
      ]
    },
    {
      "hadith_no": "4117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي بكر بن نافع، عن أبيه، عن صفية بنت أبي عبيد، أنها أخبرته أن أم سلمة زوج النبي صلى الله عليه وسلم قالت لرسول الله صلى الله عليه وسلم حين ذكر الإزار فالمرأة يا رسول الله ‏.‏ قال ‏\"‏ ترخي شبرا ‏\"‏ ‏.‏ قالت أم سلمة إذا ينكشف عنها ‏.‏ قال ‏\"‏ فذراعا لا تزيد عليه ‏\"‏ ‏.‏",
      "text_en": " Safiyyah, daughter of AbuUbayd, said:                      When the Messenger of Allah (ﷺ) mentioned lower garment, Umm Salamah, wife of the Messenger of Allah (ﷺ), asked him: And a woman, Messenger of Allah? He replied: She may hang down a span. Umm Salamah said: Still it (foot) will be uncovered. He said: Then a forearm's length, nor exceeding it.",
      "chain": [
        "20164",
        "20001",
        "25510",
        "11811"
      ]
    },
    {
      "hadith_no": "4199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن أبي بكر بن نافع، عن أبيه، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم أمر بإحفاء الشوارب وإعفاء اللحى ‏.‏",
      "text_en": " Narrated Abd Allah b. 'Umar:                      The Messenger of Allah (ﷺ) commanded to clip the moustaches and grow the beard long.",
      "chain": [
        "20164",
        "20001",
        "25510",
        "20507"
      ]
    },
    {
      "hadith_no": "2991",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن أبي بكر بن نافع، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أمرنا بإحفاء الشوارب وإعفاء اللحى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو بكر بن نافع هو مولى ابن عمر ثقة وعمر بن نافع ثقة وعبد الله بن نافع مولى ابن عمر يضعف ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) ordered trimming the mustache and leaving the beard to grow.",
      "chain": [
        "20280",
        "30112",
        "20001",
        "25510",
        "18"
      ]
    },
    {
      "hadith_no": "651",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال قال حدثني عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة الأنصاري المازني، عن أبيه، أنه أخبره أن أبا سعيد الخدري قال له إني أراك تحب الغنم والبادية فإذا كنت في غنمك أو باديتك فأذنت بالصلاة فارفع صوتك فإنه لا يسمع مدى صوت المؤذن جن ولا إنس ولا شىء إلا شهد له يوم القيامة ‏.‏ قال أبو سعيد سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin 'Abdur-Rahman bin Abi Sa'sa'ah Al-Ansari Al-Mazini narrated that his father told him that Abu Sa'eed Al-Khudri said to him:                      \"I see that you love sheep and the desert. When you are with your sheep or in the desert and you call the Adhan for prayer, then raise your voice, for no human, Jinn or anything else hears the voice of the Mu'adhdhin as far as it reaches, but it will bear witness for him on the Day of Resurrection.\" Abu Sa'eed said: \"I heard it from the Messenger of Allah (ﷺ).\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "38"
      ]
    },
    {
      "hadith_no": "2474",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة المازني، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمس أوسق من التمر صدقة وليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa 'eed Al-Khudri that the Messenger of Allah said:                      \"No Sadaqah is due on lessthan five Awsuq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadaqah is due on less than five Dhawd (head) of camels.",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "38"
      ]
    },
    {
      "hadith_no": "5028",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن سلمة قال حدثنا ابن القاسم عن مالك قال حدثني أبو سهيل عن أبيه أنه سمع طلحة بن عبيد الله يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد ثائر الرأس يسمع دوي صوته ولا يفهم ما يقول حتى دنا فإذا هو يسأل عن الإسلام قال له رسول الله صلى الله عليه وسلم خمس صلوات في اليوم والليلة قال هل علي غيرهن قال لا إلا أن تطوع قال رسول الله صلى الله عليه وسلم وصيام شهر رمضان قال هل علي غيره قال لا إلا أن تطوع وذكر له رسول الله صلى الله عليه وسلم الزكاة فقال هل علي غيرها قال لا إلا أن تطوع فأدبر الرجل وهو يقول لا أزيد على هذا ولا أنقص منه فقال رسول الله صلى الله عليه وسلم أفلح إن صدق",
      "text_en": " Abu Suhail narrated from his father,:                     That he heard Talhah bin 'Ubaidullah say: \"A man from Najd with unkempt hair came to the Messenger of Allah [SAW]; he was speaking loudly but his speech could not be understood until he came close. He was asking about Islam. The Messenger of Allah [SAW] said: 'Five prayers every day and night.' He said: 'Do I have to do any more than that? He said: 'No, not unless you do it voluntarily.' The Messenger of Allah [SAW] said: 'Fasting the month of Ramadan.' He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' Then the Messenger of Allah [SAW] told him about Zakah. He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' The man left saying, 'I will not do any more than that or any less.' The Messenger of Allah [SAW] said: 'He will succeed, if he is telling the truth.'\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "6"
      ]
    }
  ],
  "total_hadiths": 12
}