{
  "id": "26015",
  "name": "Sa'id bin 'Abdur Rahman سعيد بن عبد الرحمن بن أبي",
  "full_name": "Sa'id bin 'Abdur Rahman سعيد بن عبد الرحمن بن أبي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  -  مقبول ]"
    ],
    "tags": [
      "al-Kanani",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11857",
      "name": "Sahl bin Abi Umama bin Sahl bin Hanif سهل بن أبي أمامة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28148",
      "name": "Khalid bin Hameed al-Mhry خالد بن حميد المهري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4904",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، قال أخبرني سعيد بن عبد الرحمن بن أبي العمياء، أن سهل بن أبي أمامة، حدثه أنه، دخل هو وأبوه على أنس بن مالك بالمدينة في زمان عمر بن عبد العزيز وهو أمير المدينة فإذا هو يصلي صلاة خفيفة دقيقة كأنها صلاة مسافر أو قريبا منها فلما سلم قال أبي يرحمك الله أرأيت هذه الصلاة المكتوبة أو شىء تنفلته قال إنها المكتوبة وإنها لصلاة رسول الله صلى الله عليه وسلم ما أخطأت إلا شيئا سهوت عنه - فقال - إن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ لا تشددوا على أنفسكم فيشدد عليكم فإن قوما شددوا على أنفسهم فشدد الله عليهم فتلك بقاياهم في الصوامع والديار ‏{‏ رهبانية ابتدعوها ما كتبناها عليهم ‏}‏ ‏\"‏ ‏.‏ ثم غدا من الغد فقال ألا تركب لتنظر ولتعتبر قال نعم فركبوا جميعا فإذا هم بديار باد أهلها وانقضوا وفنوا خاوية على عروشها فقال ‏\"‏ أتعرف هذه الديار ‏\"‏ ‏.‏ فقلت ما أعرفني بها وبأهلها هذه ديار قوم أهلكهم البغى والحسد إن الحسد يطفئ نور الحسنات والبغى يصدق ذلك أو يكذبه والعين تزني والكف والقدم والجسد واللسان والفرج يصدق ذلك أو يكذبه ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     Sahl ibn AbuUmamah said that he and his father (AbuUmamah) visited Anas ibn Malik at Medina during the time (rule) of Umar ibn AbdulAziz when he (Anas ibn Malik) was the governor of Medina. He was praying a very short prayer as if it were the prayer of a traveller or near it.  When he gave a greeting, my father said: May Allah have mercy on you! Tell me about this prayer: Is it obligatory or supererogatory?  He said: It is obligatory; it is the prayer performed by the Messenger of Allah (ﷺ). I did not make a mistake except in one thing that I forgot.  He said: The Messenger of Allah (ﷺ) used to say: Do not impose austerities on yourselves so that austerities will be imposed on you, for people have imposed austerities on themselves and Allah imposed austerities on them. Their survivors are to be found in cells and monasteries. (Then he quoted:) \"Monasticism, they invented it; we did not prescribe it for them.\"  Next day he went out in the morning and said: will you not go out for a ride, so that you may see something and take a lesson from it?  He said: Yes. Then all of them rode away and reached a land whose inhabitants had perished, passed away and died. The roofs of the town had fallen in.  He asked: Do you know this land?  I said: Who acquainted me with it and its inhabitants?  (Anas said:) This is the land of the people whom oppression and envy destroyed. Envy extinguishes the light of good deeds, and oppression confirms or falsifies it. The eye commits fornication, and the palm of the hand, the foot, body, tongue and private part of the body confirm it or deny it.",
      "chain": [
        "30226",
        "20029",
        "26015"
      ]
    }
  ],
  "total_hadiths": 1
}