{
  "id": "26010",
  "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
  "full_name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان  التجيبي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "159",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ع  الستة]",
      "Fiqh"
    ],
    "tags": [
      "al-Masri",
      "al-Tajaybi",
      "Zahid"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10856",
      "name": "Hameed bin Han'i Abu حميد بن هانئ أبو هانئ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10862",
      "name": "Shrhbyl bin Shryk al-Ma'afry شرحبيل بن شريك المعافري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10850",
      "name": "Bakr bin 'Amr al-Ma'fari بكر بن عمرو المعافري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16023",
      "name": "Hayy bin Hani' Abu Qabayl حيي بن هانئ بن ناضر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "26013",
      "name": "Salm bin Ghylan al-Tjyby al-Msry سالم بن غيلان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10860",
      "name": "Sulaym bin Jubair سليم بن جبير أبو يونس مولى أبي هريرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "22259",
      "name": "Abu al-Malih al-Farsi أبو المليح الفارسي المدني الخراط",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11507",
      "name": "Zuhrah bin Ma'bad bin 'Abdullah زهرة بن معبد بن عبد الله بن هشام",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11105",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10872",
      "name": "Ka'b bin 'Alqama bin Ka'b كعب بن علقمة بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "944",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا حيوة بن شريح، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس  رضى الله عنهما  قال قام النبي صلى الله عليه وسلم وقام الناس معه، فكبر وكبروا معه، وركع وركع ناس منهم، ثم سجد وسجدوا معه، ثم قام للثانية فقام الذين سجدوا وحرسوا إخوانهم، وأتت الطائفة الأخرى فركعوا وسجدوا معه، والناس كلهم في صلاة، ولكن يحرس بعضهم بعضا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet (p.b.u.h) led the fear prayer and the people stood behind him. He said Takbir (Allahu-Akbar) and the people said the same. He bowed and some of them bowed. Then he prostrated and they also prostrated. Then he stood for the second rak`a and those who had prayed the first rak`a left and guarded their brothers. The second party joined him and performed bowing and prostration with him. All the people were in prayer but they were guarding one another during the prayer.",
      "chain": [
        "26010",
        "30373",
        "20459",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3740",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد أنه سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were with the Prophet while he was holding `Umar bin Al-Khattab by the hand.",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "4092",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا زكرياء بن عدي، أخبرنا ابن المبارك، عن حيوة، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد بعد ثماني سنين، كالمودع للأحياء والأموات، ثم طلع المنبر فقال ‏\"‏ إني بين أيديكم فرط، وأنا عليكم شهيد، وإن موعدكم الحوض، وإني لأنظر إليه من مقامي هذا، وإني لست أخشى عليكم أن تشركوا، ولكني أخشى عليكم الدنيا أن تنافسوها ‏\"‏‏.‏ قال فكانت آخر نظرة نظرتها إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle offered the funeral prayers of the martyrs of Uhud eight years after (their death), as if bidding farewell to the living and the dead, then he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness on you, and your promised place to meet me will be Al- Haud (i.e. the Tank) (on the Day of Resurrection), and I am (now) looking at it from this place of mine. I am not afraid that you will worship others besides Allah, but I am afraid that worldly life will tempt you and cause you to compete with each other for it.\" That was the last look which I cast on Allah's Apostle.",
      "chain": [
        "30272",
        "30464",
        "20025",
        "26010",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4639",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة، وغيره، قالا حدثنا محمد بن عبد الرحمن أبو الأسود، قال قطع على أهل المدينة بعث فاكتتبت فيه، فلقيت عكرمة مولى ابن عباس فأخبرته، فنهاني عن ذلك أشد النهى، ثم قال أخبرني ابن عباس أن ناسا من المسلمين كانوا مع المشركين يكثرون سواد المشركين على رسول الله صلى الله عليه وسلم يأتي السهم فيرمى به، فيصيب أحدهم فيقتله أو يضرب فيقتل، فأنزل الله ‏{‏إن الذين توفاهم الملائكة ظالمي أنفسهم‏}‏ الآية‏.‏ رواه الليث عن أبي الأسود‏.‏",
      "text_en": " Narrated Muhammad bin `Abdur-Rahman Abu Al-Aswad:                     The people of Medina were forced to prepare an army (to fight against the people of Sham during the caliphate of `Abdullah bin Az-Zubair at Mecca), and I was enlisted in it; Then I met `Ikrima, the freed slave of Ibn `Abbas, and informed him (about it), and he forbade me strongly to do so (i.e. to enlist in that army), and then said, \"Ibn `Abbas informed me that some Muslim people were with the pagans, increasing the number of the pagans against Allah's Apostle. An arrow used to be shot which would hit one of them (the Muslims in the company of the pagans) and kill him, or he would be struck and killed (with a sword).\" Then Allah revealed:-- \"Verily! as for those whom the angels take (in death) while they are wronging themselves (by staying among the disbelievers)\" (4.97) Abu Aswad added, \"Except the weak ones among men, women,...\" (4.98)",
      "chain": [
        "23033",
        "26010",
        "11105",
        "17"
      ]
    },
    {
      "hadith_no": "4696",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن عبد العزيز، حدثنا عبد الله بن يحيى، حدثنا حيوة، عن بكر بن عمرو، عن بكير، عن نافع، عن ابن عمر  رضى الله عنهما  أن رجلا، جاءه فقال يا أبا عبد الرحمن، ألا تسمع ما ذكر الله في كتابه ‏{‏وإن طائفتان من المؤمنين اقتتلوا‏}‏ إلى آخر الآية، فما يمنعك أن لا تقاتل كما ذكر الله في كتابه‏.‏ فقال يا ابن أخي أغتر بهذه الآية ولا أقاتل أحب إلى من أن أغتر بهذه الآية التي يقول الله تعالى ‏{‏ومن يقتل مؤمنا متعمدا‏}‏ إلى آخرها‏.‏ قال فإن الله يقول ‏{‏وقاتلوهم حتى لا تكون فتنة‏}‏‏.‏ قال ابن عمر قد فعلنا على عهد رسول الله صلى الله عليه وسلم إذ كان الإسلام قليلا، فكان الرجل يفتن في دينه، إما يقتلوه وإما يوثقوه، حتى كثر الإسلام، فلم تكن فتنة، فلما رأى أنه لا يوافقه فيما يريد قال فما قولك في علي وعثمان‏.‏ قال ابن عمر ما قولي في علي وعثمان أما عثمان فكان الله قد عفا عنه، فكرهتم أن يعفو عنه، وأما علي فابن عم رسول الله صلى الله عليه وسلم وختنه‏.‏ وأشار بيده وهذه ابنته أو بنته حيث ترون‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That a man came to him (while two groups of Muslims were fighting) and said, \"O Abu `Abdur Rahman! Don't you hear what Allah has mentioned in His Book: 'And if two groups of believers fight against each other...' (49.9) So what prevents you from fighting as Allah has mentioned in His Book?\"' Ibn `Umar said, \"O son of my brother! I would rather be blamed for not fighting because of this Verse than to be blamed because of another Verse where Allah says: 'And whoever kills a believer intentionally...\" (4.93) Then that man said, \"Allah says:-- 'And fight them until there is no more afflictions (worshipping other besides Allah) and the religion (i.e. worship) will be all for Allah (Alone)\" (8.39) Ibn `Umar said, \"We did this during the lifetime of Allah's Apostle when the number of Muslims was small, and a man was put to trial because of his religion, the pagans would either kill or chain him; but when the Muslims increased (and Islam spread), there was no persecution.\" When that man saw that Ibn `Umar did not agree to his proposal, he said, \"What is your opinion regarding `Ali and `Uthman?\" Ibn `Umar said, \"What is my opinion regarding `Ali and `Uthman? As for `Uthman, Allah forgave him and you disliked to forgive him, and `Ali is the cousin and son-in-law of Allah's Apostle .\" Then he pointed out with his hand and said, \"And that is his daughter's (house) which you can see.\"",
      "chain": [
        "30230",
        "26010",
        "10850",
        "11154",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4886",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن عبد العزيز، حدثنا عبد الله بن يحيى، أخبرنا حيوة، عن أبي الأسود، سمع عروة، عن عائشة  رضى الله عنها  أن نبي الله صلى الله عليه وسلم كان يقوم من الليل حتى تتفطر قدماه فقالت عائشة لم تصنع هذا يا رسول الله وقد غفر الله لك ما تقدم من ذنبك وما تأخر قال ‏\"‏ أفلا أحب أن أكون عبدا شكورا ‏\"‏‏.‏ فلما كثر لحمه صلى جالسا فإذا أراد أن يركع قام، فقرأ ثم ركع‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet used to offer prayer at night (for such a long time) that his feet used to crack. I said, \"O Allah's Apostle! Why do you do it since Allah has forgiven you your faults of the past and those to follow?\" He said, \"Shouldn't I love to be a thankful slave (of Allah)?' When he became old, he prayed while sitting, but if he wanted to perform a bowing, he wound get up, recite (some other verses) and then perform the bowing.",
      "chain": [
        "30230",
        "26010",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5536",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، قال أخبرني ربيعة بن يزيد الدمشقي، عن أبي إدريس، عن أبي ثعلبة الخشني، قال قلت يا نبي الله إنا بأرض قوم أهل الكتاب، أفنأكل في آنيتهم وبأرض صيد، أصيد بقوسي وبكلبي الذي ليس بمعلم، وبكلبي المعلم، فما يصلح لي قال ‏\"‏ أما ما ذكرت من أهل الكتاب فإن وجدتم غيرها فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها وكلوا فيها، وما صدت بقوسك فذكرت اسم الله فكل، وما صدت بكلبك المعلم فذكرت اسم الله فكل، وما صدت بكلبك غير معلم فأدركت ذكاته فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take our meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and with my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He said, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other than theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat out of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt something with your trained hound after mentioning Allah's Name, eat of it, and if you hunt something with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"",
      "chain": [
        "1945",
        "26010",
        "11414",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "5546",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة،‏.‏ وحدثني أحمد بن أبي رجاء، حدثنا سلمة بن سليمان، عن ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، قال أخبرني أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني  رضى الله عنه  يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم أهل الكتاب، نأكل في آنيتهم، وأرض صيد أصيد بقوسي، وأصيد بكلبي المعلم، والذي ليس معلما، فأخبرني ما الذي يحل لنا من ذلك فقال ‏\"‏ أما ما ذكرت أنك بأرض قوم أهل الكتاب، تأكل في آنيتهم، فإن وجدتم غير آنيتهم، فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها ثم كلوا فيها، وأما ما ذكرت أنك بأرض صيد، فما صدت بقوسك، فاذكر اسم الله، ثم كل، وما صدت بكلبك المعلم، فاذكر اسم الله، ثم كل، وما صدت بكلبك الذي ليس معلما فأدركت ذكاته، فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to Allah's Apostle and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow and trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your saying that you are living in the land of the people of the Scripture and that you eat in their utensils, if you can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than theirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if you hung something with your bow, and have mentioned Allah's Name while hunting, then you can eat (the game). And if you hunt something with your trained hound, and have mentioned Allah's Name on sending it for hunting then you can eat (the game). But if you hunt something with your untrained hound and you were able to slaughter it before its death, you can eat of it.\"",
      "chain": [
        "20241",
        "30300",
        "30340",
        "20025",
        "26010",
        "11414"
      ]
    },
    {
      "hadith_no": "5554",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة بن شريح، قال حدثني ربيعة بن يزيد الدمشقي، قال حدثني أبو إدريس الخولاني، قال حدثني أبو ثعلبة الخشني، قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض أهل الكتاب، فنأكل في آنيتهم، وبأرض صيد، أصيد بقوسي، وأصيد بكلبي المعلم، وبكلبي الذي ليس بمعلم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما ما ذكرت أنك بأرض أهل كتاب فلا تأكلوا في آنيتهم، إلا أن لا تجدوا بدا، فإن لم تجدوا بدا فاغسلوها وكلوا، وأما ما ذكرت أنكم بأرض صيد، فما صدت بقوسك، فاذكر اسم الله وكل، وما صدت بكلبك المعلم، فاذكر اسم الله وكل، وما صدت بكلبك الذي ليس بمعلم، فأدركت ذكاته، فكله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to the Prophet and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture, and we take our meals in their utensils, and there is game in that land and I hunt with my bow and with my trained hound and with my untrained hound.\" The Prophet said, \"As for your saying that you are in the land of people of the Scripture, you should not eat in their utensils unless you find no alternative, in which case you must wash the utensils and then eat in them As for your saying that you are in the land of game, if you hunt something with your bow, mention Allah's Name (while hunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name on sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it and you can eat of it.\"",
      "chain": [
        "20241",
        "26010",
        "11414",
        "11027"
      ]
    },
    {
      "hadith_no": "6337",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were in the company of the Prophet and he was holding the hand of `Umar bin Al-Khattab.",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "6714",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد أنه سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب فقال له عمر يا رسول الله لأنت أحب إلى من كل شىء إلا من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا والذي نفسي بيده حتى أكون أحب إليك من نفسك ‏\"‏‏.‏ فقال له عمر فإنه الآن والله لأنت أحب إلى من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الآن يا عمر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were with the Prophet and he was holding the hand of `Umar bin Al-Khattab. `Umar said to Him, \"O Allah's Apostle! You are dearer to me than everything except my own self.\" The Prophet said, \"No, by Him in Whose Hand my soul is, (you will not have complete faith) till I am dearer to you than your own self.\" Then `Umar said to him, \"However, now, by Allah, you are dearer to me than my own self.\" The Prophet said, \"Now, O `Umar, (now you are a believer).",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "7174",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، وغيره، قالا حدثنا أبو الأسود،‏.‏ وقال الليث عن أبي الأسود، قال قطع على أهل المدينة بعث فاكتتبت فيه فلقيت عكرمة فأخبرته فنهاني أشد النهى ثم قال أخبرني ابن عباس أن أناسا من المسلمين كانوا مع المشركين يكثرون سواد المشركين على رسول الله صلى الله عليه وسلم فيأتي السهم فيرمى فيصيب أحدهم، فيقتله أو يضربه فيقتله‏.‏ فأنزل الله تعالى ‏{‏إن الذين توفاهم الملائكة ظالمي أنفسهم‏}‏",
      "text_en": " Narrated Abu Al-Aswad:                     An army unit was being recruited from the people of Medina and my name was written among them. Then I met `Ikrima, and when I informed him about it, he discouraged me very strongly and said, \"Ibn `Abbas told me that there were some Muslims who were with the pagans to increase their number against Allah's Apostle (and the Muslim army) so arrows (from the Muslim army) would hit one of them and kill him or a Muslim would strike him (with his sword) and kill him. So Allah revealed:-- 'Verily! As for those whom the angels take (in death) while they are wronging themselves (by staying among the disbelievers).' (4.97)",
      "chain": [
        "1945",
        "26010",
        "20023",
        "11105",
        "17"
      ]
    },
    {
      "hadith_no": "7438",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، حدثني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران، وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏‏.‏ قال فحدثت بهذا الحديث أبا بكر بن عمرو بن حزم فقال هكذا حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة‏.‏ وقال عبد العزيز بن المطلب عن عبد الله بن أبي بكر، عن أبي سلمة، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     That he heard Allah's Apostle saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"",
      "chain": [
        "1945",
        "26010",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى العنزي، وأبو معن الرقاشي وإسحاق بن منصور كلهم عن أبي عاصم، - واللفظ لابن المثنى - حدثنا الضحاك، - يعني أبا عاصم - قال أخبرنا حيوة بن شريح، قال حدثني يزيد بن أبي حبيب، عن ابن شماسة المهري، قال حضرنا عمرو بن العاص وهو في سياقة الموت ‏.‏ فبكى طويلا وحول وجهه إلى الجدار فجعل ابنه يقول يا أبتاه أما بشرك رسول الله صلى الله عليه وسلم بكذا أما بشرك رسول الله صلى الله عليه وسلم بكذا قال فأقبل بوجهه ‏.‏ فقال إن أفضل ما نعد شهادة أن لا إله إلا الله وأن محمدا رسول الله إني قد كنت على أطباق ثلاث لقد رأيتني وما أحد أشد بغضا لرسول الله صلى الله عليه وسلم مني ولا أحب إلى أن أكون قد استمكنت منه فقتلته فلو مت على تلك الحال لكنت من أهل النار فلما جعل الله الإسلام في قلبي أتيت النبي صلى الله عليه وسلم فقلت ابسط يمينك فلأبايعك ‏.‏ فبسط يمينه - قال - فقبضت يدي ‏.‏ قال ‏\"‏ ما لك يا عمرو ‏\"‏ ‏.‏ قال قلت أردت أن أشترط ‏.‏ قال ‏\"‏ تشترط بماذا ‏\"‏ ‏.‏ قلت أن يغفر لي ‏.‏ قال ‏\"‏ أما علمت أن الإسلام يهدم ما كان قبله وأن الهجرة تهدم ما كان قبلها وأن الحج يهدم ما كان قبله ‏\"‏ ‏.‏ وما كان أحد أحب إلى من رسول الله صلى الله عليه وسلم ولا أجل في عيني منه وما كنت أطيق أن أملأ عينى منه إجلالا له ولو سئلت أن أصفه ما أطقت لأني لم أكن أملأ عينى منه ولو مت على تلك الحال لرجوت أن أكون من أهل الجنة ثم ولينا أشياء ما أدري ما حالي فيها فإذا أنا مت فلا تصحبني نائحة ولا نار فإذا دفنتموني فشنوا على التراب شنا ثم أقيموا حول قبري قدر ما تنحر جزور ويقسم لحمها حتى أستأنس بكم وأنظر ماذا أراجع به رسل ربي ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Shamasa Mahri that he said:                      We went to Amr b. al-As and he was about to die. He wept for a long time and turned his face towards the wall. His son said: Did the Messenger of Allah (may peace be upon him not give you tidings of this? Did the Messenger of Allah (may peace be upon him) not give you tidings of this? He (the narrator) said: He turned his face (towards the audience) and said: The best thing which we can count upon is the testimony that there is no god but Allah and that Muhammad is the Apostle of Allah. Verily I have passed through three phases. (The first one) in which I found myself averse to none else more than I was averse to the Messenger of Allah (may peace be upon him) and there was no other desire stronger in me than the one that I should overpower him and kill him. Had I died in this state, I would have been definitely one of the denizens of Fire. When Allah instilled the love of Islam in my heart, I came to the Apostle (may peace be upon him) and said: Stretch out your right hand so that may pledge my allegiance to you. He stretched out his right hand, I withdrew my hand, He (the Holy Prophet) said: What has happened to you, O 'Amr? replied: I intend to lay down some condition. He asked: What condition do you intend to put forward? I said: should be granted pardon. He (the Holy Prophet) observed: Are you not aware of the fact that Islam wipes out all the previous (misdeeds)? Verily migration wipes out all the previous (misdeeds), and verily the pilgrimage wipes out all the (previous) misdeeds. And then no one as or dear to me than the Messenger of Allah and none was more sublime in my eyes than he, Never could I, pluck courage to catch a full glimpse of his face due to its splendour. So if I am asked to describe his features, I cannot do that for I have not eyed him fully. Had I died in this state had every reason to hope that I would have bee among the dwellers of Paradise. Then we were responsible for certain things (in the light of which) I am unable to know what is in store for me. When I die, let neither female mourner nor fire accompany me. When you bury me, fill my grave well with earth, then stand around it for the time within which a camel is slaughtered and its meat is distributed so that I may enjoy your intimacy and (in your company) ascertain what answer I can give to the messengers (angels) of Allah.",
      "chain": [
        "30170",
        "30432",
        "26010",
        "11411"
      ]
    },
    {
      "hadith_no": "545",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني حيوة، قال حدثني أبو يونس، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الجنة من أمتي سبعون ألفا زمرة واحدة منهم على صورة القمر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Seventy thousand (persons) would enter Paradise as one group and among them (there would be people) whom faces would be bright like the moon.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "13"
      ]
    },
    {
      "hadith_no": "240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني حيوة، أخبرني محمد بن عبد الرحمن، أن أبا عبد الله، مولى شداد بن الهاد حدثه أنه، دخل على عائشة فذكر عنها عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abdullah, the freed slave of Shahddad, came to 'A'isha and transmitted from her a hadith like this (which she narrated) from the Holy Prophet (may peace be upon him).",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11105",
        "30184"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن حيوة، وسعيد بن أبي أيوب، وغيرهما، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت له الشفاعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr b. al-As reported Allah's Messenger (may peace be upon him) as saying:                      When you hear the Mu'adhdhin, repeat what he says, then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah; then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو الطاهر، حدثنا ابن وهب، عن حيوة، أن أبا يونس، مولى أبي هريرة حدثه قال سمعت أبا هريرة، يقول عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إنما جعل الإمام ليؤتم به فإذا كبر فكبروا وإذا ركع فاركعوا وإذا قال سمع الله لمن حمده ‏.‏ فقولوا اللهم ربنا لك الحمد ‏.‏ وإذا صلى قائما فصلوا قياما وإذا صلى قاعدا فصلوا قعودا أجمعون ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) saying:                      The Imamis appointed to be followed. So recite takbir when he recites it, and bow down when he bows down and when he utters:\" Allah listens to him who praises Him,\" say\" O Allah, our Lordfor Thee be the praise.\" And when he prays, standing, you should pray standing. And when he prays sitting, all of you should pray sitting.",
      "chain": [
        "20029",
        "26010",
        "13"
      ]
    },
    {
      "hadith_no": "500",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عبد الله بن يزيد، أخبرنا حيوة، عن أبي الأسود، محمد بن عبد الرحمن عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم سئل في غزوة تبوك عن سترة المصلي فقال ‏\"‏ كمؤخرة الرحل ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) was asked in the expedition of Tabuk about the sutra the worshipper; he said: Like the back of the saddle.",
      "chain": [
        "30212",
        "1945",
        "26010",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو الطاهر، أحمد بن عمرو حدثنا ابن وهب، عن حيوة، عن محمد بن عبد الرحمن، عن أبي عبد الله، مولى شداد بن الهاد أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من سمع رجلا ينشد ضالة في المسجد فليقل لا ردها الله عليك فإن المساجد لم تبن لهذا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: If anyone bears a man crying out in the mosque about something lie has lost, he should say: May Allah not restore it to you, for the mosques were not built for this.",
      "chain": [
        "20029",
        "26010",
        "11105",
        "13"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا المقرئ، حدثنا حيوة، قال سمعت أبا الأسود، يقول حدثني أبو عبد الله، مولى شداد أنه سمع أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثله ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) saying like this.",
      "chain": [
        "26010",
        "11114",
        "30184",
        "13"
      ]
    },
    {
      "hadith_no": "1434",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرنا حيوة، قال حدثني يزيد بن عبد الله بن أسامة بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قالت النار رب أكل بعضي بعضا فأذن لي أتنفس ‏.‏ فأذن لها بنفسين نفس في الشتاء ونفس في الصيف فما وجدتم من برد أو زمهرير فمن نفس جهنم وما وجدتم من حر أو حرور فمن نفس جهنم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      The Fire said to the Lord: O Lord! some parts of mine have consumed the others, so allow me to exhale (in order to find some relief from this congestion). It was granted permission to take two exhalations, one exhalation during the winter and the other exhalation during the summer So whatever you perceive in the form of intense cold or hurting cold is from the exhalation of Hell. And whatever you perceive in the form of extreme heat or intense beat is from the exhalation of Hell.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني محمد بن عبد الله بن نمير، حدثنا عبد الله بن يزيد، حدثني حيوة، حدثني أبو صخر، عن يزيد بن عبد الله بن قسيط، أنه حدثه أن داود بن عامر بن سعد بن أبي وقاص حدثه عن أبيه، أنه كان قاعدا عند عبد الله بن عمر إذ طلع خباب صاحب المقصورة فقال يا عبد الله بن عمر ألا تسمع ما يقول أبو هريرة إنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من خرج مع جنازة من بيتها وصلى عليها ثم تبعها حتى تدفن كان له قيراطان من أجر كل قيراط مثل أحد ومن صلى عليها ثم رجع كان له من الأجر مثل أحد ‏\"‏ ‏.‏ فأرسل ابن عمر خبابا إلى عائشة يسألها عن قول أبي هريرة ثم يرجع إليه فيخبره ما قالت وأخذ ابن عمر قبضة من حصى المسجد يقلبها في يده حتى رجع إليه الرسول فقال قالت عائشة صدق أبو هريرة ‏.‏ فضرب ابن عمر بالحصى الذي كان في يده الأرض ثم قال لقد فرطنا في قراريط كثيرة ‏.‏",
      "text_en": " Dawud b. 'Amir b. Sa'd b. Abu Waqqas reported on the authority of his father that while he was sitting along with 'Abdullah b. 'Umar, Khabbab, the owner of Maqsura, said:                      Ibn 'Umar, do you hear what Abu Huraira says that he heard the Messenger of Allah (may peace be upon him) say:\" He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud\"? Ibn 'Umar sent Khabbab to 'A'isha in order to ask her about the words of Abu Huraira (and also told him) to come back to him (Ibn 'Umar) and inform him what 'A'isha said. (In the meanwhile) Ibn 'Umar took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha testified (the statement of) Abu Huraira. Ibn 'Umar threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.",
      "chain": [
        "30212",
        "1945",
        "26010",
        "11236"
      ]
    },
    {
      "hadith_no": "3640",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني محمد بن عبد الله بن نمير، وزهير بن حرب، - واللفظ لابن نمير - قالا حدثنا عبد الله بن يزيد المقبري، حدثنا حيوة، حدثني عياش بن عباس، أن أبا النضر، حدثه عن عامر بن سعد، أن أسامة بن زيد، أخبر والده، سعد بن أبي وقاص أن رجلا، جاء إلى رسول الله صلى الله عليه وسلم فقال إني أعزل عن امرأتي ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ لم تفعل ذلك ‏\"‏ ‏.‏ فقال الرجل أشفق على ولدها أو على أولادها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان ذلك ضارا ضر فارس والروم ‏\"‏ ‏.‏ وقال زهير في روايته ‏\"‏ إن كان لذلك فلا ما ضار ذلك فارس ولا الروم ‏\"‏.",
      "text_en": " Sa'd b. Abu Waqqas (Allah be pleased with him) reported that a person came to Allah's Messenger (may peace be upon him) and said:                      I do 'azi with my wife. Thereupon Allah's Messenger (may peace be upon him) said: Why do you do that? The person said: I fear harm to her child or her children. Thereupon Allah's Messenger (way peace be upon him) said: If that were harmful it would harm the Persians and the Greeks.",
      "chain": [
        "30212",
        "30022",
        "23033",
        "26010",
        "10871",
        "20390",
        "10554",
        "50"
      ]
    },
    {
      "hadith_no": "3716",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني محمد بن عبد الله بن نمير الهمداني، حدثنا عبد الله بن يزيد، حدثنا حيوة، أخبرني شرحبيل بن شريك، أنه سمع أبا عبد الرحمن الحبلي، يحدث عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الدنيا متاع وخير متاع الدنيا المرأة الصالحة‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr reported Allah's Messenger (may peace be upon him) as saying:                      The whole world is a provision, and the best object of benefit of the world is the pious woman.",
      "chain": [
        "30212",
        "1945",
        "26010",
        "10862",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "4859",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا ابن وهب، عن حيوة، أن أبا يونس، مولى أبي هريرة حدثه قال سمعت أبا هريرة، يقول عن رسول الله صلى الله عليه وسلم بذلك وقال ‏\"‏ من أطاع الأمير ‏\"‏ ‏.‏ ولم يقل أميري وكذلك في حديث همام عن أبي هريرة ‏.‏",
      "text_en": " According to one version of the tradition, the Messenger of Allah (may peace be upon him) said:                      Whoso obeys the commander. He did not say:\" My commander.\"",
      "chain": [
        "20029",
        "26010",
        "13"
      ]
    },
    {
      "hadith_no": "4986",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن عبد الله بن قهزاذ، حدثنا علي بن الحسن، عن عبد الله بن المبارك، أخبرنا سعيد بن أبي أيوب، وحيوة بن شريح، قال كل واحد منهما حدثني شرحبيل بن، شريك عن أبي عبد الرحمن الحبلي، أنه سمع أبا أيوب الأنصاري، يقول قال رسول الله صلى الله عليه وسلم بمثله سواء ‏.‏",
      "text_en": " This tradition has been narrated on the authority of Abu Ayyub through a different chain of transmitters having the same wording.",
      "chain": [
        "30561",
        "20025",
        "20375",
        "26010",
        "10862",
        "10938",
        "33"
      ]
    },
    {
      "hadith_no": "5034",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبد الله بن يزيد أبو عبد الرحمن، حدثنا حيوة بن، شريح عن أبي هانئ، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من غازية تغزو في سبيل الله فيصيبون الغنيمة إلا تعجلوا ثلثى أجرهم من الآخرة ويبقى لهم الثلث وإن لم يصيبوا غنيمة تم لهم أجرهم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abdullah b. 'Amr that the Messenger of Allah (may peace be upon him) said:                      A troop of soldiers who fight in tile way of Allah and get their share of the booty receive in advance two-thirds of their reward in the Hereafter and only one-third will remain (to their credit). If they do not receive any booty, they will get their full reward.",
      "chain": [
        "30553",
        "26010",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "5092",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن المبارك، عن حيوة بن شريح، قال سمعت  ربيعة بن يزيد الدمشقي، يقول أخبرني أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني، يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم من أهل الكتاب نأكل في آنيتهم وأرض صيد أصيد بقوسي وأصيد بكلبي المعلم أو بكلبي الذي ليس بمعلم فأخبرني ما الذي يحل لنا من ذلك قال ‏\"‏ أما ما ذكرت أنكم بأرض قوم من أهل الكتاب تأكلون في آنيتهم فإن وجدتم غير آنيتهم فلا تأكلوا فيها وإن لم تجدوا فاغسلوها ثم كلوا فيها وأما ما ذكرت أنك بأرض صيد فما أصبت بقوسك فاذكر اسم الله ثم كل وما أصبت بكلبك المعلم فاذكر اسم الله ثم كل وما أصبت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba al-Khushani reported:                      I came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, we are in the land of the People of the Book, (so) we eat in their utensils, and (live) in a hunting region. where I hunt with, the help of my bow, and hunt with my trained dog, or with my dog which is not trained. So inform me what is lawful (Halal) for us out of that. He (the Holy Prophet) said: Regarding what you have mentioned of the fact that you live in the land belonging to the People of the Book and so you eat in their utensils, but if you can get utensils other than theirs, then don't eat in them; but if you do not find any, then wash them and eat in them. And regarding what you have mentioned about (your living) in a hunting region, what you hunt, (strike) with the help of your bow, recite the name of Allah (while shooting an arrow) and then eat; and what you catch with the help of your trained dog, recite the name of Allah (while letting oil) the dog and then eat it, and what you get with the help of your untrained dog, (if you find it alive) and slaughter it (according to the law of the Shari'ah), eat it.",
      "chain": [
        "30480",
        "20025",
        "26010",
        "11414"
      ]
    },
    {
      "hadith_no": "5203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، قال قال حيوة أخبرني  أبو صخر، عن يزيد بن قسيط، عن عروة بن الزبير، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر بكبش أقرن يطأ في سواد ويبرك في سواد وينظر في سواد فأتي به ليضحي به فقال لها ‏\"‏ يا عائشة هلمي المدية ‏\"‏ ‏.‏ ثم قال ‏\"‏ اشحذيها بحجر ‏\"‏ ‏.‏ ففعلت ثم أخذها وأخذ الكبش فأضجعه ثم ذبحه ثم قال ‏\"‏ باسم الله اللهم تقبل من محمد وآل محمد ومن أمة محمد ‏\"‏ ‏.‏ ثم ضحى به ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) commanded that a ram with black legs, black belly and black (circles) round the eyes should be brought to him, so that he should sacrifice it. He said to 'A'isha:                      Give me the large knife, and then said: Sharpen it on a stone. She did that. He then took it (the knife) and then the ram; he placed it on the ground and then sacrificed it, saying: Bismillah, Allah-humma Taqabbal min Muhammadin wa Al-i-Muhammadin, wa min Ummati Muhammadin (In the name of Allah,\" O Allah, accept [this sacrifice] on behalf of Muhammad and the family of Muhammad and the Umma of Muhammad\" ).",
      "chain": [
        "30280",
        "20029",
        "26010",
        "11236",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حرملة بن يحيى، وأحمد بن عبد الرحمن بن أخي ابن وهب، قالا حدثنا  عبد الله بن وهب، أخبرني حيوة، أخبرني خالد بن يزيد، عن سعيد بن أبي هلال، عن عمر، بن مسلم الجندعي أن ابن المسيب، أخبره أن أم سلمة زوج النبي صلى الله عليه وسلم أخبرته ‏.‏ وذكر النبي صلى الله عليه وسلم بمعنى حديثهم ‏.‏",
      "text_en": " Amr b. Muslim al-Jundani reported that Ibn Musayyib had told him that it was Umm Salama, the wife of Allah's Apostle (may peace be upon him), who had informed him of that as narrated above.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11408",
        "11169",
        "11002"
      ]
    },
    {
      "hadith_no": "6678",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني حيوة بن شريح، عن ابن، الهاد عن عبد الله بن دينار، عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ أبر البر أن يصل الرجل ود أبيه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported Allah's Apostle (may peace be upon him) as saying:                      The finest act of goodness is that a person should treat kindly the loved ones of his father.",
      "chain": [
        "20029",
        "26010",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "6732",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، أخبرنا حيوة، حدثنا ابن الهاد، عن أبي بكر بن حزم، عن عمرة، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من شىء يصيب المؤمن حتى الشوكة تصيبه إلا كتب الله له بها حسنة أو حطت عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I heard Allah's Messenger (may peace be upon him) as saying: There is nothing (in the form of trouble) that comes to a believer even if it is the pricking of a thorn that there is decreed for him by Allah good or his sins are obliterated.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11234",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6766",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حرملة بن يحيى التجيبي، أخبرنا عبد الله بن وهب، أخبرني حيوة، حدثني  ابن الهاد، عن أبي بكر بن حزم، عن عمرة، - يعني بنت عبد الرحمن - عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا عائشة إن الله رفيق يحب الرفق ويعطي على الرفق ما لا يعطي على العنف وما لا يعطي على ما سواه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) said:                      'A'isha, verily Allah is kind and He loves kindness and confers upon kindness which he does not confer upon severity and does not confer upon anything else besides it (kindness).",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11234",
        "11239",
        "11455"
      ]
    },
    {
      "hadith_no": "6920",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا المقرئ، حدثنا حيوة، ح وحدثني محمد بن سهل التميمي، حدثنا ابن أبي مريم، أخبرنا نافع، - يعني ابن يزيد - كلاهما عن أبي هانئ، ‏.‏ بهذا الإسناد مثله غير أنهما لم يذكرا وعرشه على الماء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Hani with the same chain of transmitters, but there is no mention of\" His Throne was upon water.\"",
      "chain": [
        "30421",
        "26010",
        "30232",
        "20629"
      ]
    },
    {
      "hadith_no": "6921",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني زهير بن حرب، وابن، نمير كلاهما عن المقرئ، قال زهير حدثنا عبد، الله بن يزيد المقرئ قال حدثنا حيوة، أخبرني أبو هانئ، أنه سمع أبا عبد الرحمن الحبلي، أنه سمع عبد الله بن عمرو بن العاص، يقول أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن قلوب بني آدم كلها بين إصبعين من أصابع الرحمن كقلب واحد يصرفه حيث يشاء ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم مصرف القلوب صرف قلوبنا على طاعتك ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Amr b. al-'As reported that he heard Allah's Messenger (may peace be upon him) as saying:                      Verily, the hearts of all the sons of Adam are between the two fingers out of the fingers of the Compassionate Lord as one heart. He turns that to any (direction) He likes. Then Allahs Messenger (may peace be upon him) said: 0 Allah, the Turner of the hearts, turn our hearts to Thine obedience.",
      "chain": [
        "30022",
        "20321",
        "23033",
        "26010",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "26",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن سويد الرملي، وعمر بن الخطاب أبو حفص، وحديثه، أتم أن سعيد بن الحكم، حدثهم قال أخبرنا نافع بن يزيد، حدثني حيوة بن شريح، أن أبا سعيد الحميري، حدثه عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اتقوا الملاعن الثلاث البراز في الموارد وقارعة الطريق والظل ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: Be on your guard against three things which provoke cursing: easing in the watering places and on the thoroughfares, and in the shade (of the tree).",
      "chain": [
        "38092",
        "3",
        "30232",
        "20629",
        "26010",
        "32"
      ]
    },
    {
      "hadith_no": "39",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، حدثنا ابن عياش، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، عن عبد الله بن مسعود، قال قدم وفد الجن على رسول الله صلى الله عليه وسلم فقالوا يا محمد انه أمتك أن يستنجوا بعظم أو روثة أو حممة فإن الله تعالى جعل لنا فيها رزقا ‏.‏ قال فنهى النبي صلى الله عليه وسلم عن ذلك ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     A deputation of the jinn came to the Prophet (ﷺ) and said: O Muhammad, forbid your community to cleans themselves with a bone or dung or charcoal, for in them Allah has provided sustenance for us.  So the Prophet (ﷺ) forbade them to do so.",
      "chain": [
        "26010",
        "19154",
        "5136",
        "16"
      ]
    },
    {
      "hadith_no": "170",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسين بن عيسى، حدثنا عبد الله بن يزيد المقرئ، عن حيوة، - وهو ابن شريح - عن أبي عقيل، عن ابن عمه، عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم نحوه ولم يذكر أمر الرعاية قال عند قوله ‏\"‏ فأحسن الوضوء ‏\"‏ ‏.‏ ثم رفع بصره إلى السماء ‏.‏ فقال وساق الحديث بمعنى حديث معاوية ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir al-JuhanI narrated this tradition from the Prophet(ﷺ) in a similar way. He did not mention about tending the camels. After the words “and he performed ablution well” he added the words:                      “he then raises his eyes towards the sky”. He transmitted the tradition conveying the same meaning as that of Mu’awiyah.",
      "chain": [
        "23033",
        "26010",
        "189"
      ]
    },
    {
      "hadith_no": "175",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، عن بحير، - هو ابن سعد - عن خالد، عن بعض، أصحاب النبي أن النبي صلى الله عليه وسلم رأى رجلا يصلي وفي ظهر قدمه لمعة قدر الدرهم لم يصبها الماء فأمره النبي صلى الله عليه وسلم أن يعيد الوضوء والصلاة ‏.‏",
      "text_en": " Narrated Some Companions of the Prophet:                     The Prophet (ﷺ) saw a person offering prayer, and on the back of his foot a small part equal to the space of a dirham remained unwashed; the water did not reach it. The Prophet (ﷺ) commanded him to repeat the ablution and prayer.",
      "chain": [
        "26010",
        "20644",
        "11282"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، - في آخرين - قالوا حدثنا بقية، عن الوضين بن عطاء، عن محفوظ بن علقمة، عن عبد الرحمن بن عائذ، عن علي بن أبي طالب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وكاء السه العينان فمن نام فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) said: The eyes are the leather strap of the anus, so one who sleeps should perform ablution.",
      "chain": [
        "26010",
        "20644",
        "17548",
        "18970",
        "19925",
        "5"
      ]
    },
    {
      "hadith_no": "331",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا عبد الله بن يحيى البرلسي، حدثنا حيوة بن شريح، عن ابن الهاد، أن نافعا، حدثه عن ابن عمر، قال أقبل رسول الله صلى الله عليه وسلم من الغائط فلقيه رجل عند بئر جمل فسلم عليه فلم يرد عليه رسول الله صلى الله عليه وسلم حتى أقبل على الحائط فوضع يده على الحائط ثم مسح وجهه ويديه ثم رد رسول الله صلى الله عليه وسلم على الرجل السلام ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Messenger of Allah (ﷺ) came from the privy. A man met him near Bir Jamal and saluted him. The Messenger of Allah (ﷺ) did not return the salutation until he came to a wall and placed his hands on the wall and wiped his face and hands; he then returned the man's salutation.",
      "chain": [
        "38132",
        "30354",
        "26010",
        "11234",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حيوة بن شريح المصري، حدثنا بقية، عن ضبارة بن عبد الله بن أبي سليك الألهاني، أخبرني ابن نافع، عن ابن شهاب الزهري، قال قال سعيد بن المسيب إن أبا قتادة بن ربعي أخبره قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله تعالى إني فرضت على أمتك خمس صلوات وعهدت عندي عهدا أنه من جاء يحافظ عليهن لوقتهن أدخلته الجنة ومن لم يحافظ عليهن فلا عهد له عندي ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Qatadah ibn Rib'iyy:                     Allah , the Exalted said: I made five times' prayers obligatory on your people, and I took a guarantee that if anyone observes them regularly at their times, I shall admit him to Paradise; if anyone does not offer them regularly, there is no such guarantee of Mine for him.",
      "chain": [
        "26010",
        "20644",
        "11002"
      ]
    },
    {
      "hadith_no": "444",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباس العنبري، ح وحدثنا أحمد بن صالح، - وهذا لفظ عباس - أن عبد، الله بن يزيد حدثهم عن حيوة بن شريح عن عياش بن عباس - يعني القتباني - أن كليب بن صبح حدثهم أن الزبرقان حدثه عن عمه عمرو بن أمية الضمري قال كنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره فنام عن الصبح حتى طلعت الشمس فاستيقظ رسول الله صلى الله عليه وسلم فقال ‏\"‏ تنحوا عن هذا المكان ‏\"‏ ‏.‏ قال ثم أمر بلالا فأذن ثم توضئوا وصلوا ركعتى الفجر ثم أمر بلالا فأقام الصلاة فصلى بهم صلاة الصبح ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Umayyah ad-Damri:                     We were in the company of the Messenger of Allah (ﷺ) during one of his journeys. He overslept abandoning the morning prayer until the sun had arisen. The Messenger of Allah (ﷺ) awoke and said: Go away from this place. He then commanded Bilal to call for prayer. He called for prayer. They (the people) performed ablution and offered two rak'ahs of the morning prayer (sunnah prayer). He then commanded Bilal (to utter the iqamah, i.e. to summon the people to attend the prayer). He announced the prayer (i.e. uttered the iqamah) and he led them in the morning prayer.",
      "chain": [
        "30437",
        "30226",
        "26010",
        "10871",
        "16091",
        "4011"
      ]
    },
    {
      "hadith_no": "466",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسماعيل بن بشر بن منصور، حدثنا عبد الرحمن بن مهدي، عن عبد الله بن المبارك، عن حيوة بن شريح، قال لقيت عقبة بن مسلم فقلت له بلغني أنك حدثت عن عبد الله بن عمرو بن العاص، عن النبي صلى الله عليه وسلم أنه كان إذا دخل المسجد قال ‏\"‏ أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم ‏\"‏ ‏.‏ قال أقط قلت نعم ‏.‏ قال فإذا قال ذلك قال الشيطان حفظ مني سائر اليوم ‏.‏",
      "text_en": " Haiwah b. Shuraih reported :                      I met ‘Uqbah b. Muslim and said to him: it has been reported to me that someone has narrated to you from the prophet (ﷺ) that when he entered the mosque, he would say: I seek refuge in Allah, the Magnificent, and in His noble face, and in his eternal domain, from the accursed Devil. He asked : is it so much only? I said: Yes. He said: when anyone says so. The devil says: he is protected from me all the day long.",
      "chain": [
        "20033",
        "20025",
        "26010",
        "29"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر الجشمي، حدثنا عبد الله بن يزيد، حدثنا حيوة، - يعني ابن شريح - قال سمعت أبا الأسود، - يعني محمد بن عبد الرحمن بن نوفل - يقول أخبرني أبو عبد الله، مولى شداد أنه سمع أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سمع رجلا ينشد ضالة في المسجد فليقل لا أداها الله إليك فإن المساجد لم تبن لهذا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      I heard the Messenger of Allah (May peace be upon him) as saying; if anyone hears a man crying out in the mosque about something he has lost, he should say: May Allah not restore it to you, for the mosque were not built for this.",
      "chain": [
        "1945",
        "26010",
        "11105",
        "30184",
        "13"
      ]
    },
    {
      "hadith_no": "523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة، حدثنا ابن وهب، عن ابن لهيعة، وحيوة، وسعيد بن أبي أيوب، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله عز وجل لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله تعالى وأرجو أن أكون أنا هو فمن سأل الله لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr b. al-As reported the Messenger of Allah (May peace be upon him) as saying:                      when you hear the mu'adhdhin repeat what he says, invoke a blessing on me, for everyone who invoke one blessing on me will receive ten blessings from Allah. Then ask Allah to give me the wasilah, which is a rank in paradise fitting for only one of Allah’s servants, and I hope that I may be the one. If anyone asks Allah that I be given the wasilah, he will be assured of my intercession.",
      "chain": [
        "20672",
        "20029",
        "20624",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن حيوة، وعمر بن مالك، عن ابن الهاد، عن محمد بن إبراهيم، عن عمير، مولى بني آبي اللحم أنه رأى النبي صلى الله عليه وسلم يستسقي عند أحجار الزيت قريبا من الزوراء قائما يدعو يستسقي رافعا يديه قبل وجهه لا يجاوز بهما رأسه ‏.‏",
      "text_en": " Narrated Umayr, the client of AbulLahm:                     Umayr saw the Prophet (ﷺ) praying for rain at Ahjar az-Zayt near az-Zawra', standing, making supplication, praying for rain and raising his hands in front of his face, but not lifting them above his head.",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20626",
        "11234",
        "11213",
        "3141"
      ]
    },
    {
      "hadith_no": "1240",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عبد الرحمن المقرئ، حدثنا حيوة، وابن، لهيعة قالا أخبرنا أبو الأسود، أنه سمع عروة بن الزبير، يحدث عن مروان بن الحكم، أنه سأل أبا هريرة هل صليت مع رسول الله صلى الله عليه وسلم صلاة الخوف قال أبو هريرة نعم ‏.‏ قال مروان متى فقال أبو هريرة عام غزوة نجد قام رسول الله صلى الله عليه وسلم إلى صلاة العصر فقامت معه طائفة وطائفة أخرى مقابل العدو ظهورهم إلى القبلة فكبر رسول الله صلى الله عليه وسلم فكبروا جميعا الذين معه والذين مقابلي العدو ثم ركع رسول الله صلى الله عليه وسلم ركعة واحدة وركعت الطائفة التي معه ثم سجد فسجدت الطائفة التي تليه والآخرون قيام مقابلي العدو ثم قام رسول الله صلى الله عليه وسلم وقامت الطائفة التي معه فذهبوا إلى العدو فقابلوهم وأقبلت الطائفة التي كانت مقابلي العدو فركعوا وسجدوا ورسول الله صلى الله عليه وسلم قائم كما هو ثم قاموا فركع رسول الله صلى الله عليه وسلم ركعة أخرى وركعوا معه وسجد وسجدوا معه ثم أقبلت الطائفة التي كانت مقابلي العدو فركعوا وسجدوا ورسول الله صلى الله عليه وسلم قاعد ومن معه ثم كان السلام فسلم رسول الله صلى الله عليه وسلم وسلموا جميعا فكان لرسول الله صلى الله عليه وسلم ركعتان ولكل رجل من الطائفتين ركعة ركعة ‏.‏",
      "text_en": " Urwah ibn az-Zubayr reported that Marwan ibn al-Hakam asked AbuHurayrah:                      Did you pray in time of danger with the Messenger of Allah (ﷺ)?  AbuHurayrah replied: Yes.  Marwan then asked: When?  AbuHurayrah said: On the occasion of the Battle of Najd. The Messenger of Allah (ﷺ) stood up to offer the afternoon prayer. One section stood with him (to pray) and the other was standing before the enemy, and their backs were towards the qiblah. The Messenger of Allah (ﷺ) uttered the takbir and all of them too uttered the takbir, i.e. those who were with him and those who were facing the enemy. Then the Messenger of Allah (ﷺ) offered one rak'ah and the section that was with him also prayed one rak'ah. He then prostrated himself and those who were with him also prostrated, while the other section was standing before the enemy.  The Messenger of Allah (ﷺ) then stood up and the section with him also stood up. They went and faced the enemy and the section that was previously facing the enemy stepped forward. They bowed and prostrated while the Messenger of Allah (ﷺ) was standing in the same position. Then they stood up and the Messenger of Allah (may peace be upon) prayed another rak'ah and all of them bowed and prostrated along with him. After that the section that was standing before the enemy came forward and they bowed and prostrated, while the Messenger of Allah (ﷺ) remained seated and also those who were with him. The salutation then followed. The Messenger of Allah (ﷺ) uttered the salutation and all of them uttered it together. The Messenger of Allah (ﷺ) prayed two rak'ahs and each of the two sections prayed one rak'ah with him (and the other by themselves).",
      "chain": [
        "30115",
        "23033",
        "26010",
        "20624",
        "11114",
        "10511",
        "13"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني عمر بن مالك، وحيوة، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      Allah has not listened to anything as He does to a Prophet chanting the Qur'an with a loud voice.",
      "chain": [
        "30584",
        "20029",
        "26010",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 120
}