{
  "id": "26049",
  "name": "Abu Yazid al-Khwlany al-Msry أبو يزيد الخولاني المصري",
  "full_name": "Abu Yazid al-Khwlany al-Msry أبو يزيد الخولاني المصري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Khulani",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16046",
      "name": "Siyar bin 'Abdur Rahman سيار بن عبد الرحمن الصدفي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1609",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، وعبد الله بن عبد الرحمن السمرقندي، قالا حدثنا مروان، قال عبد الله حدثنا أبو يزيد الخولاني، - وكان شيخ صدق وكان ابن وهب يروي عنه - حدثنا سيار بن عبد الرحمن، - قال محمود الصدفي - عن عكرمة، عن ابن عباس، قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر طهرة للصائم من اللغو والرفث وطعمة للمساكين من أداها قبل الصلاة فهي زكاة مقبولة ومن أداها بعد الصلاة فهي صدقة من الصدقات ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) prescribed the sadaqah (alms) relating to the breaking of the fast as a purification of the fasting from empty and obscene talk and as food for the poor. If anyone pays it before the prayer (of 'Id), it will be accepted as zakat. If anyone pays it after the prayer, that will be a sadaqah like other sadaqahs (alms).",
      "chain": [
        "37534",
        "20201",
        "18",
        "26049",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عطاء بن دينار، عن أبي يزيد الخولاني، أنه سمع فضالة بن عبيد، يقول سمعت عمر بن الخطاب، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الشهداء أربعة رجل مؤمن جيد الإيمان لقي العدو فصدق الله حتى قتل فذلك الذي يرفع الناس إليه أعينهم يوم القيامة هكذا ‏\"‏ ‏.‏ ورفع رأسه حتى وقعت قلنسوته ‏.‏ قال فما أدري أقلنسوة عمر أراد أم قلنسوة النبي صلى الله عليه وسلم قال ‏\"‏ ورجل مؤمن جيد الإيمان لقي العدو فكأنما ضرب جلده بشوك طلح من الجبن أتاه سهم غرب فقتله فهو في الدرجة الثانية ورجل مؤمن خلط عملا صالحا وآخر سيئا لقي العدو فصدق الله حتى قتل فذلك في الدرجة الثالثة ورجل مؤمن أسرف على نفسه لقي العدو فصدق الله حتى قتل فذلك في الدرجة الرابعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث عطاء بن دينار ‏.‏ قال سمعت محمدا يقول قد روى سعيد بن أبي أيوب هذا الحديث عن عطاء بن دينار وقال عن أشياخ من خولان ولم يذكر فيه عن أبي يزيد ‏.‏ وقال عطاء بن دينار ليس به بأس ‏.‏",
      "text_en": " Narrated Fadalah bin 'Ubaid:                     That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"",
      "chain": [
        "30367",
        "20624",
        "16075",
        "26049",
        "1935",
        "3"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن أحمد بن بشير بن ذكوان، وأحمد بن الأزهر، قالا حدثنا مروان بن محمد، حدثنا أبو يزيد الخولاني، عن سيار بن عبد الرحمن الصدفي، عن عكرمة، عن ابن عباس، قال فرض رسول الله  صلى الله عليه وسلم  زكاة الفطر طهرة للصائم من اللغو والرفث وطعمة للمساكين فمن أداها قبل الصلاة فهي زكاة مقبولة ومن أداها بعد الصلاة فهي صدقة من الصدقات ‏.‏",
      "text_en": " It was narrated that:                     Ibn Abbas said: “The Messenger of Allah (ﷺ) enjoined Zakatul-Fitr as a purification for the fasting person from idle talk and obscenities, and to feed the poor. Whoever pays it before the (Eid) prayer, it is an accepted Zakah, and whoever pays it after the prayer, it is (ordinary) charity.”",
      "chain": [
        "38001",
        "20640",
        "26049",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}