{
  "id": "26500",
  "name": "Ibrahim bin Sulaiman, al-Mu'adab إبراهيم بن سليمان أبو إسماعيل المؤدب",
  "full_name": "Ibrahim bin Sulaiman, al-Mu'adab إبراهيم بن سليمان أبو إسماعيل المؤدب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Jordon",
      "Baghdad",
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ق  -  صدوق ]"
    ],
    "tags": [
      "al-Shami",
      "Jordan",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-504",
      "hadith_no": "504",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا إبراهيم بن إسماعيل بن عبد الملك بن أبي محذورة، قال سمعت جدي عبد الملك بن أبي محذورة، يذكر أنه سمع أبا محذورة، يقول ألقى على رسول الله صلى الله عليه وسلم الأذان حرفا حرفا ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح ‏\"‏ ‏.‏ قال وكان يقول في الفجر الصلاة خير من النوم ‏.‏",
      "text_en": " Abu Mahdhurah reported:                      The Messenger of Allah (May peace be upon him) taught me the call to prayer (adhan) verbatim; Allah is most great, Allah is most great, Allah is most great, Allah is most great; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah; I testify that Muhammad is the Messenger of Allah; I testify that there is no god but Allah. I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah; come to prayer, come to prayer; come to salvation, come to salvation. He used to pronounce “prayer is better than sleep” in the dawn prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "26500"
      ]
    },
    {
      "id": "sunan-abi-daud-1006",
      "hadith_no": "1006",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حماد، وعبد الوارث، عن ليث، عن الحجاج بن عبيد، عن إبراهيم بن إسماعيل، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيعجز أحدكم ‏\"‏ ‏.‏ قال عن عبد الوارث ‏\"‏ أن يتقدم أو يتأخر أو عن يمينه أو عن شماله ‏\"‏ ‏.‏ زاد في حديث حماد ‏\"‏ في الصلاة ‏\"‏ ‏.‏ يعني في السبحة ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Cannot any one of you (according to the version of the narrator AbdulWarith) step forward or backward or at his right or left. The version of Hammad added: during prayer; that is, in supererogatory prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "20258",
        "20023",
        "26500",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4175",
      "hadith_no": "4175",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن إسماعيل بن يحيى بن سلمة بن كهيل، حدثني أبي، عن أبيه، عن سلمة بن كهيل، عن أبي الزعراء، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتدوا باللذين من بعدي من أصحابي أبي بكر وعمر واهتدوا بهدى عمار وتمسكوا بعهد ابن مسعود ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه من حديث ابن مسعود لا نعرفه إلا من حديث يحيى بن سلمة بن كهيل ‏.‏ ويحيى بن سلمة يضعف في الحديث وأبو الزعراء اسمه عبد الله بن هانئ وأبو الزعراء الذي روى عنه شعبة والثوري وابن عيينة اسمه عمرو بن عمرو وهو ابن أخي أبي الأحوص صاحب عبد الله بن مسعود ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"Take as examples the two after me from my Companions, Abu Bakr and 'Umar. And act upon the guidance of 'Ammar, and hold fast to the advice of Ibn Mas'ud.\"",
      "usc_msa_ref": "",
      "chain": [
        "26500",
        "11350",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-575",
      "hadith_no": "575",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا إبراهيم بن إسماعيل اليشكري، عن ابن أبي حبيبة، عن داود بن الحصين، عن أبي سفيان، عن أبي هريرة، قال قيل يا رسول الله إنا نريد المسجد فنطأ الطريق النجسة ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ الأرض يطهر بعضها بعضا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     It was said: \"O Messenger of Allah, we want to come to the mosque, but the path that we walk upon is impure.\" The Messenger of Allah said: \"Some parts of the earth purify others.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "26500",
        "11160",
        "116",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1085",
      "hadith_no": "1085",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا إسماعيل بن أبي أويس، أخبرني إبراهيم بن إسماعيل الأشهلي، عن عبد الله بن عبد الرحمن بن ثابت بن الصامت، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  صلى في بني عبد الأشهل وعليه كساء متلفف به يضع يديه عليه يقيه برد الحصى ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Abdur-Rahman bin Thabit binSamit,from his father, from his grandfather, that the Messenger ofAllah(ﷺ) performed prayer among Banu ‘Abdul-Ashhal, wearing a cloakinwhich he was wrapped and putting his hands on it to protect themfromthe cold of the pebbles.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "30103",
        "26500"
      ]
    },
    {
      "id": "sunan-ibn-majah-1122",
      "hadith_no": "1122",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا عبد العزيز بن أبي حازم، عن إبراهيم بن إسماعيل، عن عبد الكريم، عن مجاهد، وسعيد بن جبير، وعطاء بن أبي رباح، وطاوس، أخبروه عن ابن عباس، أنه أخبرهم أن رسول الله  صلى الله عليه وسلم  كان يجمع بين المغرب والعشاء في السفر من غير أن يعجله شىء ولا يطلبه عدو ولا يخاف شيئا ‏.‏",
      "text_en": " It wasnarrated from Mujahid, Sa’eed bin Jubair, ‘Ata’ bin Abi Rabahand Tawus that Ibn ‘Abbas told them that the Messenger of Allah(ﷺ)used to combine the Maghrib and ‘Isha’ when traveling,although therewas nothing to make him hurry and no enemy pursuinghim, and he wasnot afraid of anything.",
      "usc_msa_ref": "",
      "chain": [
        "20165",
        "26500",
        "18655",
        "11028",
        "11050",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1493",
      "hadith_no": "1493",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن ليث، عن حجاج بن عبيد، عن إبراهيم بن إسماعيل، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أيعجز أحدكم إذا صلى أن يتقدم أو يتأخر أو عن يمينه أو عن شماله ‏\"‏ يعني السبحة ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Isanyoneof you incapable, when he prays, or stepping forwards orbackwards,or to his right or left?” meaning in order to offer avoluntaryprayer.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "20023",
        "18162",
        "26500",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1747",
      "hadith_no": "1747",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عثمان بن محمد بن أبي شيبة، حدثنا أبو إسماعيل المؤدب، عن مجالد، عن الشعبي، عن مسروق، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من خير خصال الصائم السواك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ) said:                     “Oneof the best actions of the fasting person is using the toothstick.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "26500",
        "10820",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1863",
      "hadith_no": "1863",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا بكر بن خلف، ومحمد بن يحيى، قالا حدثنا عبيد الله بن موسى، أنبأنا إبراهيم بن إسماعيل، عن عبد الله بن واقد، عن ابن عمر، وعائشة، أن النبي  صلى الله عليه وسلم  كان يأخذ من كل عشرين دينارا فصاعدا نصف دينار ومن الأربعين دينارا دينارا ‏.‏",
      "text_en": " Ibn 'Umar and 'Aishah narrated that:                     that from every twenty Dinar or more. The Prophet used to take half a Dinar and from forty Dinar, one Dinar.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "11222",
        "20340",
        "26500",
        "18",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2335",
      "hadith_no": "2335",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عمر بن الهياج، حدثنا عبيد الله بن موسى، أنبأنا إبراهيم بن إسماعيل، عن طليق بن عمران، عن أبي بردة، عن أبي موسى، قال لعن رسول الله  صلى الله عليه وسلم  من فرق بين الوالدة وولدها وبين الأخ وبين أخيه ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah (ﷺ) cursed the one who separates a mother and her child, or a brother from his brother.\"",
      "usc_msa_ref": "",
      "chain": [
        "20340",
        "26500",
        "11901",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-2477",
      "hadith_no": "2477",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا إبراهيم بن إسماعيل بن مجمع بن جارية الأنصاري، عن عمرو بن دينار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الرجل أحق بهبته ما لم يثب منها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “A man has more right to his gift so long as he has not gotten something in return for it.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "34188",
        "20032",
        "26500",
        "11081",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2661",
      "hadith_no": "2661",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا ابن أبي فديك، عن إبراهيم بن إسماعيل، عن داود بن الحصين، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وقع على ذات محرم فاقتلوه ومن وقع على بهيمة فاقتلوه واقتلوا البهيمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:                     “Whoever has intercourse with a Mahram relative, kill him; and whoever has intercourse with an animal, kill him, and kill the animal.”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20172",
        "26500",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3656",
      "hadith_no": "3656",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا ابن أبي فديك، أخبرني إبراهيم بن إسماعيل بن أبي حبيبة الأشهلي، عن داود بن الحصين، عن عكرمة، عن ابن عباس، عن النبي  صلى الله عليه وسلم  نحوه وقال ‏\"‏ من شر عرق نعار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Umair that he heard Junadah bin Abu Umayyahsay:                      “Iheard ‘Ubadah bin Samit say: ‘Jibra’il (as) came to theProphet(ﷺ) when he was suffering from fever and said: ‘Bismillahiarqika, min kulli shay’in yu’dhika, min hasadi hasidin, wa minkulli‘aynin, Allahu yashfika (In the Name of Allah I performRuqyah foryou, from everything that is harming you; from the envy ofthe envierand from every evil eye, may Allah heal you).’”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20172",
        "26500",
        "11160",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 13
}