{
  "id": "27",
  "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
  "full_name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "13",
      "date_gregorian": "602",
      "date_display": [
        "13 BH",
        "602 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "60",
      "date_gregorian": "680",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Syria",
      "Egypt"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Commander",
      "Khalifah",
      "Governor"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "B.'Abd Shams",
      "Late Muslim",
      "Scribe",
      "Umayyad"
    ]
  },
  "parents": [
    {
      "id": "116",
      "name": "Abu Sufyan ibn Harb ( صخر بن حرب أبو سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "74",
      "name": "Hind bint 'Utba b. Rabi'a b. 'Abd Shams ( هند بنت عتبة بن ربيعة بن عبد شمس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "841",
      "name": "Umm Hakam bint Abu Sufyan ( أم الحكم بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "842",
      "name": "Juwayriyya bint Abu Sufyan ( جويرية بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "843",
      "name": "Quriaba bint Abu Sufyan ( قريبة بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "844",
      "name": "'Utba ibn Abu Sufyan ( عتبة بن أبي سفيان بن حرب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "19183",
      "name": "Yazid bin Mu'awiya يزيد بن معاوية",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "59",
      "name": "Umm Habibah bint Abi Sufyan ( أم حبيبة ,رملة بنت أبي سفيان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "4057",
      "name": "Jarir bin 'Abdullah al-Bajli ( جرير بن عبد الله البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "398",
      "name": "Mu'awiya bin Hadeej ( معاوية بن حديج ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1798",
      "name": "Yazid bin Jariyya ( يزيد بن جارية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11058",
      "name": "Muhammad bin Jubayr bin Mut'im محمد بن جبير بن مطعم بن عدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-71",
      "hadith_no": "71",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال قال حميد بن عبد الرحمن سمعت معاوية، خطيبا يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين، وإنما أنا قاسم والله يعطي، ولن تزال هذه الأمة قائمة على أمر الله لا يضرهم من خالفهم حتى يأتي أمر الله ‏\"‏‏.‏",
      "text_en": " Narrated Muawiya:                     I heard Allah's Apostle saying, \"If Allah wants to do good to a person, He makes him comprehend the religion. I am just a distributor, but the grant is from Allah. (And remember) that this nation (true Muslims) will keep on following Allah's teachings strictly and they will not be harmed by any one going on a different path till Allah's order (Day of Judgment) is established.\"",
      "usc_msa_ref": "71",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-587",
      "hadith_no": "587",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن أبان، قال حدثنا غندر، قال حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، يحدث عن معاوية، قال إنكم لتصلون صلاة، لقد صحبنا رسول الله صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Muawiya:                     You offer a prayer which I did not see being offered by Allah's Apostle when we were in his company and he certainly had forbidden it (i.e. two rak`at after the `Asr prayer).",
      "usc_msa_ref": "561",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "11421",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-914",
      "hadith_no": "914",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن مقاتل، قال أخبرنا عبد الله، قال أخبرنا أبو بكر بن عثمان بن سهل بن حنيف، عن أبي أمامة بن سهل بن حنيف، قال سمعت معاوية بن أبي سفيان،، وهو جالس على المنبر، أذن المؤذن قال الله أكبر الله أكبر‏.‏ قال معاوية الله أكبر الله أكبر‏.‏ قال أشهد أن لا إله إلا الله‏.‏ فقال معاوية وأنا‏.‏ فقال أشهد أن محمدا رسول الله‏.‏ فقال معاوية وأنا‏.‏ فلما أن قضى التأذين قال يا أيها الناس إني سمعت رسول الله صلى الله عليه وسلم على هذا المجلس حين أذن المؤذن يقول ما سمعتم مني من مقالتي‏.‏",
      "text_en": " Narrated Abu Umama bin Sahl bin Hunaif:                     I heard Muawiya bin Abi Sufyan (repeating the statements of the Adhan) while he was sitting on the pulpit. When the Mu'adh-dhin pronounced the Adhan saying, \"Allahu-Akbar, Allahu Akbar\", Muawiya said: \"Allah Akbar, Allahu Akbar.\" And when the Mu'adh-dhin said, \"Ash-hadu an la ilaha illal-lah (I testify that none has the right to be worshipped but Allah)\", Muawiya said, \"And (so do) I\". When he said, \"Ash-hadu anna Muhammadan Rasulullah\" (I testify that Muhammad is Allah's Apostle), Muawiya said, \"And (so do) I\". When the Adhan was finished, Muawiya said, \"O people, when the Mu'adh-dhin pronounced the Adhan I heard Allah's Apostle on this very pulpit saying what you have just heard me saying\".",
      "usc_msa_ref": "37",
      "chain": [
        "30118",
        "20025",
        "405",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-1757",
      "hadith_no": "1757",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الحسن بن مسلم، عن طاوس، عن ابن عباس، عن معاوية  رضى الله عنهم  قال قصرت عن رسول الله صلى الله عليه وسلم بمشقص‏.‏",
      "text_en": " Narrated Muawiya:                      I cut short the hair of Allah's Apostle with a long blade.",
      "usc_msa_ref": "787",
      "chain": [
        "20241",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-2003",
      "hadith_no": "2003",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، أنه سمع معاوية بن أبي سفيان  رضى الله عنهما  يوم عاشوراء عام حج على المنبر يقول يا أهل المدينة، أين علماؤكم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هذا يوم عاشوراء، ولم يكتب عليكم صيامه، وأنا صائم، فمن شاء فليصم ومن شاء فليفطر ‏\"‏‏.‏",
      "text_en": " Narrated Humaid bin `Abdur Rahman:                     That he heard Muawiya bin Abi Sufyan on the day of 'Ashura' during the year he performed the Hajj, saying on the pulpit, \"O the people of Medina! Where are your Religious Scholars? I heard Allah's Apostle saying, 'This is the day of 'Ashura'. Allah has not enjoined its fasting on you but I am fasting it. You have the choice either to fast or not to fast (on this day).' \"",
      "usc_msa_ref": "221",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-2870",
      "hadith_no": "2870",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية، حدثنا أبو إسحاق، عن موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  قال سابق رسول الله صلى الله عليه وسلم بين الخيل التي قد أضمرت فأرسلها من الحفياء، وكان أمدها ثنية الوداع‏.‏ فقلت لموسى فكم كان بين ذلك قال ستة أميال أو سبعة‏.‏ وسابق بين الخيل التي لم تضمر، فأرسلها من ثنية الوداع، وكان أمدها مسجد بني زريق، قلت فكم بين ذلك قال ميل أو نحوه‏.‏ وكان ابن عمر ممن سابق فيها‏.‏",
      "text_en": " Narrated Abu 'Is-haq from Musa bin `Uqba from Mafia from Ibn `Umar who said:                     \"Allah's Apostle arranged a horse race amongst the horses that had been made lean, letting them start from Al-Hafya' and their limit (distance of running) was up to Thaniyat-al-Wada`. I asked Musa, 'What was the distance between the two places?' Musa replied, 'Six or seven miles. He arranged a race of the horses which had not been made lean sending them from Thaniyat-al-Wada`, and their limit was up to the mosque of Bani Zuraiq.' I asked, 'What was the distance between those two places?' He replied 'One mile or so.' Ibn `Umar was amongst those who participated in that horse race.\"",
      "usc_msa_ref": "122",
      "chain": [
        "30351",
        "27",
        "11049",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2871",
      "hadith_no": "2871",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول كانت ناقة النبي صلى الله عليه وسلم يقال لها العضباء‏.‏",
      "text_en": " Narrated Anas:                     The she camel of the Prophet was called Al-Adba.",
      "usc_msa_ref": "123",
      "chain": [
        "30351",
        "27",
        "11049",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3116",
      "hadith_no": "3116",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، عن يونس، عن الزهري، عن حميد بن عبد الرحمن، أنه سمع معاوية، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد الله به خيرا يفقهه في الدين، والله المعطي وأنا القاسم، ولا تزال هذه الأمة ظاهرين على من خالفهم حتى يأتي أمر الله وهم ظاهرون ‏\"‏‏.‏",
      "text_en": " p>Narrated Muawiya:                     Allah's Apostle said, \"If Allah wants to do good for somebody, he makes him comprehend the Religion (i.e. Islam), and Allah is the Giver and I am Al-Qasim (i.e. the distributor), and this (Muslim) nation will remain victorious over their opponents, till Allah's Order comes and they will still be victorious \"",
      "usc_msa_ref": "",
      "chain": [
        "20218",
        "20025",
        "20475",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-3684",
      "hadith_no": "3684",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني عمير بن هانئ، أنه سمع معاوية، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، لا يضرهم من خذلهم ولا من خالفهم حتى يأتيهم أمر الله وهم على ذلك ‏\"‏‏.‏ قال عمير فقال مالك بن يخامر قال معاذ وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشام‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of people amongst my followers will remain obedient to Allah's orders and they will not be harmed by anyone who will not help them or who will oppose them, till Allah's Order (the Last Day) comes upon them while they are still on the right path.\"",
      "usc_msa_ref": "835",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-3812",
      "hadith_no": "3812",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، عن معاوية  رضى الله عنه  قال إنكم لتصلون صلاة لقد صحبنا النبي صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Humran bin `Abbas:                     Muawiya said (to the people), \"You offer a prayer which we, who were the companions of the Prophet never saw the Prophet offering, and he forbade its offering,\" i.e. the two rak`at after the compulsory `Asr prayer.",
      "usc_msa_ref": "110",
      "chain": [
        "30152",
        "20173",
        "20020",
        "11317",
        "11421",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-4880",
      "hadith_no": "4880",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا حاتم، عن معاوية، قال حدثني عمي أبو الحباب، سعيد بن يسار عن أبي هريرة، بهذا، ثم قال رسول الله صلى الله عليه وسلم اقرءوا إن شئتم ‏{‏فهل عسيتم‏}‏",
      "text_en": " Narrated Abu Huraira:                     (As above, No. 354, but added) Then Allah's Apostle said, \"Recite if you wish: \"Would you then.\" ..(47.22)",
      "usc_msa_ref": "355",
      "chain": [
        "30101",
        "20159",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-5321",
      "hadith_no": "5321",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني الحسن بن صباح، سمع الربيع بن نافع، حدثنا معاوية، عن يحيى بن أبي كثير، عن يعلى بن حكيم، عن سعيد بن جبير، أنه أخبره أنه، سمع ابن عباس، يقول إذا حرم امرأته ليس بشىء‏.‏ وقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏",
      "text_en": " Narrated Sa`id bin Jubair:                     that he heard Ibn `Abbas saying, \"If a man makes his wife unlawful for him, it does not mean that she is divorced.\" He added, \"Indeed in the Apostle of Allah , you have a good example to follow.\"",
      "usc_msa_ref": "191",
      "chain": [
        "30244",
        "30335",
        "27",
        "11449",
        "11567",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6708",
      "hadith_no": "6708",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق يعني ابن إبراهيم، حدثنا يحيى بن صالح، حدثنا معاوية، عن يحيى، عن عكرمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من استلج في أهله بيمين فهو أعظم إثما، ليبر ‏\"‏‏.‏ يعني الكفارة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Anyone who takes an oath through which his family may be harmed, and insists on keeping it, he surely commits a sin greater (than that of dissolving his oath). He should rather compensate for that oath by making expiation.\"",
      "usc_msa_ref": "622",
      "chain": [
        "30123",
        "20470",
        "27",
        "20031",
        "11023",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7448",
      "hadith_no": "7448",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "وقال أبو اليمان أخبرنا شعيب، عن الزهري، أخبرني حميد بن عبد الرحمن، سمع معاوية، يحدث رهطا من قريش بالمدينة، وذكر كعب الأحبار فقال إن كان من أصدق هؤلاء المحدثين الذين يحدثون عن أهل الكتاب، وإن كنا مع ذلك لنبلو عليه الكذب‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-7550",
      "hadith_no": "7550",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني عمير بن هانئ، أنه سمع معاوية، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، ما يضرهم من كذبهم، ولا من خالفهم، حتى يأتي أمر الله وهم على ذلك ‏\"‏‏.‏ فقال مالك بن يخامر سمعت معاذا يقول وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشأم‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of my followers will keep on following Allah's Laws strictly and they will not be harmed by those who will disbelieve them or stand against them till Allah's Order (The Hour) will come while they will be in that state.\"",
      "usc_msa_ref": "552",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-2378",
      "hadith_no": "2378",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثني معاوية، أخبرني أخي، زيد بهذا الإسناد ‏.‏ مثله غير أنه قال ‏\"‏ أو أمر بمعروف ‏\"‏ ‏.‏ وقال ‏\"‏ فإنه يمسي يومئذ ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zaid with the same chain of transmitters except with (a slight) change of words (i. e. he [the Holy Prophet]) said:                      Or he enjoined what is good,... and said: He enters the evening [ie. he walks till eveningl.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20300",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-2436",
      "hadith_no": "2436",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، حدثني ربيعة بن يزيد الدمشقي، عن عبد الله بن عامر اليحصبي، قال سمعت معاوية، يقول إياكم وأحاديث إلا حديثا كان في عهد عمر فإن عمر كان يخيف الناس في الله عز وجل سمعت رسول الله صلى الله عليه وسلم وهو يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما أنا خازن فمن أعطيته عن طيب نفس فيبارك له فيه ومن أعطيته عن مسألة وشره كان كالذي يأكل ولا يشبع ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya said:                      Be cautious about ahadith except those which were current during the reign of Umar, for he exhorted people to ftar Allah, the Exalted and majestic. I heard the Messenger of Allah (may peace be upon him) as saying: He upon whom Allah intends to bestow goodness, He confers upon him an insight in religion; and I heard the Messenger of Allah (way peace be upon him) as saying: I am the treasurer. To one whom I give out of (my own) sweet will, he would be blessed in that, but he whom I give (yielding to his constant begging and for his covetousness is like one who would eat, but would not be satisfied.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "10882",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-2437",
      "hadith_no": "2437",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا سفيان، عن عمرو، عن وهب بن منبه، عن أخيه، همام عن معاوية، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تلحفوا في المسألة فوالله لا يسألني أحد منكم شيئا فتخرج له مسألته مني شيئا وأنا له كاره فيبارك له فيما أعطيته ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya reported AUah's Messenger (may prom be upon him) as saying:                      Do not beg importunately, for, I swear by Allah, none of you who asks me for anything and manages to get what he asks for when I disapprove td it will he be blessed in that which I give him.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20005",
        "11081",
        "11102",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-2438",
      "hadith_no": "2438",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن أبي عمر المكي، حدثنا سفيان، عن عمرو بن دينار، حدثني وهب بن، منبه - ودخلت عليه في داره بصنعاء فأطعمني من جوزة في داره - عن أخيه قال سمعت معاوية بن أبي سفيان يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ فذكر مثله ‏.‏",
      "text_en": " 'Amr b. Dinar reported from Wahb b. Munabbih:                      I went to his house in San'a' and he offered me nuts grown in his house to eat. And his brother said: I heard Mu'awiya b. Abu Sufyan saying that he had heard the Messenger of Allah (may peace be upon him) as saying, and then he made a mention (of a hadith) like one mentioned above.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11102",
        "11447",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-2439",
      "hadith_no": "2439",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني حميد بن عبد الرحمن بن عوف، قال سمعت معاوية بن أبي سفيان، وهو يخطب يقول إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين وإنما أنا قاسم ويعطي الله ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman b. Auf reported:                      I heard Mu'awiya b. Abu Sufyan saying in an address that he had heard the Messenger of Allah (may peace be upon him) as saying: He to whom Allah intends to do good, He gives him insight into religion. And I am only the distributor while Allah is the Bestower.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-3081",
      "hadith_no": "3081",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، حدثني الحسن، بن مسلم عن طاوس، عن ابن عباس، أن معاوية بن أبي سفيان، أخبره قال قصرت عن رسول الله صلى الله عليه وسلم بمشقص وهو على المروة أو رأيته يقصر عنه بمشقص وهو على المروة ‏.‏",
      "text_en": " Ibn Abbis (Allah be pleased with him) reported that Mu'awiya b. Abu Safyin had told him:                      I clipped the hair (from the head of) Allah's Messenger (may peace he upon him) with a clipper while he was at al-Marwa, or I saw him getting his hair clipped with a clipper as he was at al-Marwa. 1722",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20031",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-3628",
      "hadith_no": "3628",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني أحمد بن المنذر البصري، حدثنا زيد بن حباب، حدثنا معاوية، أخبرني علي بن أبي طلحة الهاشمي، عن أبي الوداك، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Abu Sa'id from Allah's Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "27",
        "10752",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4013",
      "hadith_no": "4013",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا حسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية، عن يحيى بن، أبي كثير عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه فإن أبى فليمسك أرضه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who has land should cultivate it or lend it to his brother, but if he refuses, he should retain his land.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "27",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4014",
      "hadith_no": "4014",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا الحسن الحلواني، حدثنا أبو توبة، حدثنا معاوية، عن يحيى بن أبي كثير، أن يزيد بن نعيم، أخبره أن جابر بن عبد الله أخبره أنه، سمع رسول الله صلى الله عليه وسلم ينهى عن المزابنة والحقول ‏.‏ فقال جابر بن عبد الله المزابنة الثمر بالتمر ‏.‏ والحقول كراء الأرض ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported:                      I heard Allah's Messenger (may peace be upon him) forbidding Muzabana, and Huqul. Jabir b. Abdullah (Allah be pleased with them) said: Muzabana means the selling of fruits for dry dates and Huqul is the renting of land.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "27",
        "11449",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4158",
      "hadith_no": "4158",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يحيى بن صالح، حدثنا معاوية، عن يحيى، - وهو ابن أبي كثير - عن يحيى بن أبي إسحاق، أن عبد الرحمن بن أبي بكرة، أخبره أن أبا بكرة قال نهانا رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abd al-Rabman b. Abu Bakra said:                      Allah's Messenger (may peace be upon him) prohibited us. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20470",
        "27",
        "11449",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-4167",
      "hadith_no": "4167",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن صالح الوحاظي، حدثنا معاوية، ح وحدثني محمد بن سهل التميمي، وعبد الله بن عبد الرحمن الدارمي، - واللفظ لهما - جميعا عن يحيى بن حسان، حدثنا معاوية، - وهو ابن سلام - أخبرني يحيى، - وهو ابن أبي كثير - قال سمعت عقبة بن عبد الغافر، يقول سمعت أبا سعيد، يقول جاء بلال بتمر برني فقال له رسول الله صلى الله عليه وسلم ‏\"‏ من أين هذا ‏\"‏ ‏.‏ فقال بلال تمر كان عندنا رديء فبعت منه صاعين بصاع لمطعم النبي صلى الله عليه وسلم ‏.‏ فقال رسول الله عند ذلك ‏\"‏ أوه عين الربا لا تفعل ولكن إذا أردت أن تشتري التمر فبعه ببيع آخر ثم اشتر به ‏\"‏ ‏.‏ لم يذكر ابن سهل في حديثه عند ذلك ‏.‏",
      "text_en": " Abd Sa'id reported:                      Bilal (Allah be pleased with him) came with fine quality of dates. Allah's Messenger (may peace be upon him) said to him: From where (you have brought them)? Bilal said: We had inferior quality of dates and I exchanged two sa's (of inferior quality) with one sa (of fine quality) as food for Allah's Apostle (may peace be upon him), whereupon Allah's Messenger (may peace be upon him) said: Woe! it is in fact usury; therefore, don't do that. But when you intend to buy dates (of superior quality), sell (the inferior quality) in a separate bargain and then buy (the superior quality). And in the hadith transmitted by Ibn Sahl there is no mention of\" whereupon\".",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20470",
        "27",
        "20300",
        "20401",
        "11449",
        "11603",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4980",
      "hadith_no": "4980",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى بن حسان، حدثنا معاوية، أخبرني زيد، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث أبي توبة ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20300",
        "27",
        "15",
        "274"
      ]
    },
    {
      "id": "sahih-muslim-5065",
      "hadith_no": "5065",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا كثير بن هشام، حدثنا جعفر، - وهو ابن برقان - حدثنا يزيد بن الأصم، قال سمعت معاوية بن أبي سفيان، ذكر حديثا رواه عن  النبي صلى الله عليه وسلم لم أسمعه روى عن النبي صلى الله عليه وسلم على منبره حديثا غيره قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد الله به خيرا يفقهه في الدين ولا تزال عصابة من المسلمين يقاتلون على الحق ظاهرين على من ناوأهم إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been related by, Yazid b. al-Asamm that he heard Mu'awiya b. Abu Sfyan quote a tradition from the Holy Prophet (may peace be upon him) which he related from the Prophet (mail peace he upon him) -and he did not hear him quote from the Holy Prophet (masy peace be upon him) any tradition other than this in the course of his sermon from the pulpit-that whom Allah wants to do a favour, He grants him an understanding of religion. A group of people from the Muslims will remain on the Right Path and continue until the Day of Judgment to triumph over those who oppose them.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20633",
        "20646",
        "10842",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-5095",
      "hadith_no": "5095",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا معن بن عيسى، حدثني معاوية، عن  عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم في الذي يدرك صيده بعد ثلاث ‏\"‏ فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba reported Allah's Apostle (may peace be upon him) as saying about one who comes three days later on the game he has shot:                      Eat it, provided it has not gone rotten.",
      "usc_msa_ref": "",
      "chain": [
        "30560",
        "30112",
        "27",
        "10942",
        "4056"
      ]
    },
    {
      "id": "sahih-muslim-5703",
      "hadith_no": "5703",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، قالا أخبرنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن سعيد بن المسيب، أن معاوية، قال ذات يوم إنكم قد أحدثتم زي سوء وإن نبي الله صلى الله عليه وسلم نهى عن الزور ‏.‏ قال وجاء رجل بعصا على رأسها خرقة قال معاوية ألا وهذا الزور ‏.‏ قال قتادة يعني ما يكثر به النساء أشعارهن من الخرق ‏.‏",
      "text_en": " Sa, id b. Musayyib reported that Mu'awiya said one day:                      Should I narrate to you the evil make-up. Allah's Apostle (may peace be upon him) forbade cheating. It was during that time that a person came with a staff and there was a cloth on its head, whereupon Mu, awiya said: Behold, that is cheating. Qatada said: This implies how women artificially increase their hair with the help of rags.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "11002",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-340",
      "hadith_no": "340",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، أخبرنا معاوية، عن يحيى، أخبرنا أبو سلمة بن عبد الرحمن، أن أبا هريرة، أخبره أن عمر بن الخطاب بينا هو يخطب يوم الجمعة إذ دخل رجل فقال عمر أتحتبسون عن الصلاة فقال الرجل ما هو إلا أن سمعت النداء فتوضأت ‏.‏ فقال عمر والوضوء أيضا أولم تسمعوا رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أتى أحدكم الجمعة فليغتسل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      While 'Umar b. al-Khattab was making a speech on Friday (in the mosque), a man came in. 'Umar said: Are you detained from prayer ? The man said: As soon as I heard the call for prayer, I perfumed ablution. Then 'Umar said: Only ablution ? Did you not hear the Messenger of Allah (ﷺ) say: When any one of you comes for Friday (prayer) he should take a bath.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "27",
        "20031",
        "10567",
        "13",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-366",
      "hadith_no": "366",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عيسى بن حماد المصري، أخبرنا الليث، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، أنه سأل أخته أم حبيبة زوج النبي صلى الله عليه وسلم هل كان رسول الله صلى الله عليه وسلم يصلي في الثوب الذي يجامعها فيه فقالت نعم إذا لم ير فيه أذى ‏.‏",
      "text_en": " Narrated Umm Habibah:                     Mu'awiyah ibn AbuSufyan asked his sister Umm Habibah, the wife of the Prophet (ﷺ): Would the apostle of Allah (ﷺ) pray in the clothe in which he had an intercourse? She said: Yes, when he would not see any impurity in it.",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-619",
      "hadith_no": "619",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن عجلان، حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن معاوية بن أبي سفيان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبادروني بركوع ولا بسجود فإنه مهما أسبقكم به إذا ركعت تدركوني به إذا رفعت إني قد بدنت ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn AbuSufyan:                     The Prophet (ﷺ) said: Do not try to outstrip me in bowing and prostrating because however earlier I bow you will join me when I raise (my head from bowing); I have become bulky.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "10616",
        "11222",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-707",
      "hadith_no": "707",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، ح حدثنا سليمان بن داود، قالا حدثنا ابن وهب، أخبرني معاوية، عن سعيد بن غزوان، عن أبيه، أنه نزل بتبوك وهو حاج فإذا رجل مقعد فسأله عن أمره فقال له سأحدثك حديثا فلا تحدث به ما سمعت أني حى إن رسول الله صلى الله عليه وسلم نزل بتبوك إلى نخلة فقال ‏\"‏ هذه قبلتنا ‏\"‏ ‏.‏ ثم صلى إليها فأقبلت وأنا غلام أسعى حتى مررت بينه وبينها فقال ‏\"‏ قطع صلاتنا قطع الله أثره ‏\"‏ ‏.‏ فما قمت عليها إلى يومي هذا ‏.‏",
      "text_en": " Sa’id b. Ghazwan reported on the authority  of his father that he made his stay at Tabuk(during his journey) for performing Hajj. All of a sudden he saw a crippled man and asked him about his condition. He said:                      I relate to you a tradition, but do not narrate it to anyone so long as I am alive: The Messenger of Allah (ﷺ) encamped at Tabuk near a date-palm and he said:  This is our qiblah (direction for praying). He then offered prayer facing it. I came running, when I was a boy, until I passed the place between him and the tree. He said (cursing): He cut off our prayer, may Allah cut off his walking. I could not, therefore, stand upon them(feet) till today.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30584",
        "20029",
        "27",
        "116"
      ]
    },
    {
      "id": "sunan-abi-daud-749",
      "hadith_no": "749",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا معاوية، وخالد بن عمرو، وأبو حذيفة قالوا حدثنا سفيان، بإسناده بهذا قال فرفع يديه في أول مرة وقال بعضهم مرة واحدة ‏.‏",
      "text_en": " This tradition has also been transmitted by Sufyan through a different chain of narrators. This version has:                      He raised his hands once in the beginning. Some narrated: (raised his hands) once only.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "27",
        "20290"
      ]
    },
    {
      "id": "sunan-abi-daud-1386",
      "hadith_no": "1386",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، أخبرنا شعبة، عن قتادة، أنه سمع مطرفا، عن معاوية بن أبي سفيان، عن النبي صلى الله عليه وسلم في ليلة القدر قال ‏\"‏ ليلة القدر ليلة سبع وعشرين ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah b. Abi Sufyan :                     The Prophet (ﷺ) as saying: Lailat al-qadr is the twenty-seventh night (of Ramadan)",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11395",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-1462",
      "hadith_no": "1462",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني معاوية، عن العلاء بن الحارث، عن القاسم، مولى معاوية عن عقبة بن عامر، قال كنت أقود برسول الله صلى الله عليه وسلم ناقته في السفر فقال لي ‏\"‏ يا عقبة ألا أعلمك خير سورتين قرئتا ‏\"‏ ‏.‏ فعلمني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ قال فلم يرني سررت بهما جدا فلما نزل لصلاة الصبح صلى بهما صلاة الصبح للناس فلما فرغ رسول الله صلى الله عليه وسلم من الصلاة التفت إلى فقال ‏\"‏ يا عقبة كيف رأيت ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I was driving the she-camel of the Messenger of Allah (ﷺ) during a journey. He said to me: Uqbah, should I not teach you two best surahs ever recited? He then taught me: \"Say, I seek refuge in the Lord of the dawn,\" and \"Say, I seek refuge in the Lord of men.\" He did not see me much pleased (by these two surahs). When he alighted for prayer, he led the people in the morning prayer and recited them in prayer. When the Messenger of Allah (ﷺ) finished his prayer, he turned to me and said: O Uqbah, how did you see.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "27",
        "10884",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1794",
      "hadith_no": "1794",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى أبو سلمة، حدثنا حماد، عن قتادة، عن أبي شيخ الهنائي، خيوان بن خلدة ممن قرأ على أبي موسى الأشعري من أهل البصرة أن معاوية بن أبي سفيان قال لأصحاب النبي صلى الله عليه وسلم هل تعلمون أن رسول الله صلى الله عليه وسلم نهى عن كذا وكذا وعن ركوب جلود النمور قالوا نعم ‏.‏ قال فتعلمون أنه نهى أن يقرن بين الحج والعمرة فقالوا أما هذا فلا ‏.‏ فقال أما إنها معهن ولكنكم نسيتم ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn AbuSufyan:                     Mu'awiyah said to the Companions of the Prophet (ﷺ): Do you know that the Messenger of Allah (ﷺ) prohibited from doing so and so (and he prohibited from) riding on the skins of leopards? They said: Yes. He again said: You know that he prohibited combining hajj and umrah. They replied: This we do not (know). He said: This was prohibited along with other things, but you forgot.",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "11019",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-1802",
      "hadith_no": "1802",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا شعيب بن إسحاق، عن ابن جريج، ح حدثنا أبو بكر بن خلاد، حدثنا يحيى، - المعنى - عن ابن جريج، أخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس، أن معاوية بن أبي سفيان، أخبره قال قصرت عن النبي صلى الله عليه وسلم بمشقص على المروة ‏.‏ أو رأيته يقصر عنه على المروة بمشقص ‏.‏ قال ابن خلاد إن معاوية لم يذكر أخبره ‏.‏",
      "text_en": " Ibn ‘Abbas said that Mu’awiyah reported to him I clipped some hair of the Prophet’s(ﷺ) head with a broad iron arrowhead at Al Marwah; or (he said) I saw him that the hair of his head was clipped with a broad iron arrowhead at Al Marwah.The narrator Ibn Khallad said in his version “Mu’awiyah said” and not the word “reported”.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20239",
        "11070",
        "30357",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-1803",
      "hadith_no": "1803",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن علي، ومخلد بن خالد، ومحمد بن يحيى، - المعنى - قالوا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، أن معاوية، قال له أما علمت أني قصرت عن رسول الله صلى الله عليه وسلم بمشقص أعرابي على المروة - زاد الحسن في حديثه - لحجته ‏.‏",
      "text_en": " Ibn Abbas said that Mu'awiyah told him:                      do you not know that I clipped the hair of the head of the Messenger of Allah (ﷺ) with a broad iron arrowhead at al-Marwah? Al-Hasan added in his version: \"during his hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "30",
        "30567",
        "11222",
        "20121",
        "20115",
        "11433",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-2406",
      "hadith_no": "2406",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، ووهب بن بيان، - المعنى - قالا حدثنا ابن وهب، حدثني معاوية، عن ربيعة بن يزيد، أنه حدثه عن قزعة، قال أتيت أبا سعيد الخدري وهو يفتي الناس وهم مكبون عليه فانتظرت خلوته فلما خلا سألته عن صيام رمضان في السفر فقال خرجنا مع النبي صلى الله عليه وسلم في رمضان عام الفتح فكان رسول الله صلى الله عليه وسلم يصوم ونصوم حتى بلغ منزلا من المنازل فقال ‏\"‏ إنكم قد دنوتم من عدوكم والفطر أقوى لكم ‏\"‏ ‏.‏ فأصبحنا منا الصائم ومنا المفطر - قال - ثم سرنا فنزلنا منزلا فقال ‏\"‏ إنكم تصبحون عدوكم والفطر أقوى لكم فأفطروا ‏\"‏ ‏.‏ فكانت عزيمة من رسول الله صلى الله عليه وسلم ‏.‏ قال أبو سعيد ثم لقد رأيتني أصوم مع النبي صلى الله عليه وسلم قبل ذلك وبعد ذلك ‏.‏",
      "text_en": " Narrated Qaza'ah:                     I came to Abu Sa'id al-Khudri while he was giving his legal opinion to the people who bent down on him. So I waited to see hi when he was alone. When he became alone, I asked him about keeping fast while travelling. He said: we went out along with the Prophet (ﷺ) in Ramadan in the year of conquest of Mecca. The Messenger of Allah (ﷺ) fasted and we fasted until he reached a certain stage. He said: You have come near your enemy; the breaking of fast will bring you more strength. Then morning came when some of us fasted and other broke their fast. He (Abu Sa'id al-Khudri) said: We then proceeded and alighted at a stage. He said: You are going to attack your enemy tomorrow morning ; breaking the fast will bring you more strength ; so break your fast (i.e. do not keep fast). This resolution (of breaking the fast) took place (due to the announcement) from the Messenger of Allah (ﷺ). Abu Sa'id said: Then I found myself keeping fast along with the Prophet (ﷺ) before and after that.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "36063",
        "20029",
        "27",
        "11414"
      ]
    },
    {
      "id": "sunan-abi-daud-2479",
      "hadith_no": "2479",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، عن حريز بن عثمان، عن عبد الرحمن بن أبي عوف، عن أبي هند، عن معاوية، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تنقطع الهجرة حتى تنقطع التوبة ولا تنقطع التوبة حتى تطلع الشمس من مغربها ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     I heard the Messenger of Allah (ﷺ) say: Migration will not end until repentance ends, and repentance will not end until the sun rises in the west.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20347",
        "11684",
        "18639",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-3656",
      "hadith_no": "3656",
      "source": "Sunan Abi Da'ud",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، حدثنا عيسى، عن الأوزاعي، عن عبد الله بن سعد، عن الصنابحي، عن معاوية، أن النبي صلى الله عليه وسلم نهى عن الغلوطات ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     The Holy Prophet (ﷺ) forbade the discussion of thorny  questions.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20347",
        "20024",
        "5127",
        "5144",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-3886",
      "hadith_no": "3886",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني معاوية، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال كنا نرقي في الجاهلية فقلنا يا رسول الله كيف ترى في ذلك فقال ‏\"‏ اعرضوا على رقاكم لا بأس بالرقى ما لم تكن شركا ‏\"‏ ‏.‏",
      "text_en": " ‘Awf b. Malik said :                      In the pre-Islamic period we used to apply spells and we asked: Messenger of Allah ! how do you look upon it ? He replied : Submit your spells to me. There is no harm in spells so long as they involve no polytheism.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "27",
        "10865",
        "10805"
      ]
    },
    {
      "id": "sunan-abi-daud-4129",
      "hadith_no": "4129",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا هناد بن السري، عن وكيع، عن أبي المعتمر، عن ابن سيرين، عن معاوية، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تركبوا الخز ولا النمار ‏\"‏ ‏.‏ قال وكان معاوية لا يتهم في الحديث عن رسول الله صلى الله عليه وسلم ‏.‏ قال لنا أبو سعيد قال لنا أبو داود أبو المعتمر اسمه يزيد بن طهمان كان ينزل الحيرة ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     The Prophet (ﷺ) said: Do not ride on silk stuff and panther skins. AbuSa'id said to us: AbuDawud said to us: The name of AbulMu'tamir is Yazid ibn Tahman. He lived in al-Hirah.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "11035",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-4239",
      "hadith_no": "4239",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا إسماعيل، حدثنا خالد، عن ميمون القناد، عن أبي قلابة، عن معاوية بن أبي سفيان، أن رسول الله صلى الله عليه وسلم نهى عن ركوب النمار وعن لبس الذهب إلا مقطعا ‏.‏ قال أبو داود أبو قلابة لم يلق معاوية ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn AbuSufyan:                     The Messenger of Allah (ﷺ) forbade to ride on panther skins and to wear gold except a little.Abu Dawud said: The narrator Abu Qilabah did not meet Mu'awiyah.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20208",
        "11282",
        "11047",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-4482",
      "hadith_no": "4482",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان، عن عاصم، عن أبي صالح، ذكوان عن معاوية بن أبي سفيان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شربوا الخمر فاجلدوهم ثم إن شربوا فاجلدوهم ثم إن شربوا فاجلدوهم ثم إن شربوا فاقتلوهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn AbuSufyan:                     The Prophet (ﷺ) said: If they (the people) drink wine, flog them, again if they drink it, flog them. Again if they drink it, kill them.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20577",
        "11080",
        "11161",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-4597",
      "hadith_no": "4597",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن يحيى، قالا حدثنا أبو المغيرة، حدثنا صفوان، ح وحدثنا عمرو بن عثمان، حدثنا بقية، قال حدثني صفوان، نحوه قال حدثني أزهر بن عبد الله الحرازي، عن أبي عامر الهوزني، عن معاوية بن أبي سفيان، أنه قام فينا فقال ألا إن رسول الله صلى الله عليه وسلم قام فينا فقال ‏\"‏ ألا إن من قبلكم من أهل الكتاب افترقوا على ثنتين وسبعين ملة وإن هذه الملة ستفترق على ثلاث وسبعين ثنتان وسبعون في النار وواحدة في الجنة وهي الجماعة ‏\"‏ ‏.‏ زاد ابن يحيى وعمرو في حديثيهما ‏\"‏ وإنه سيخرج من أمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكلب لصاحبه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ الكلب بصاحبه لا يبقى منه عرق ولا مفصل إلا دخله ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Amir al-Hawdhani said:                      Mu’awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of ALLA H (SAWS) stood among us and said: Beware! The people of the Book before were split up into seventy-two sects, and this community will be split into seventy three: seventy-two of them will go to Hell and one of them will go to Paradise, and it is the majority group.Ibn Yahya and ‘Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, ‘Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "11222",
        "20442",
        "10921",
        "10581",
        "20644",
        "10921",
        "18019",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-4888",
      "hadith_no": "4888",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عيسى بن محمد الرملي، وابن، عوف - وهذا لفظه - قالا حدثنا الفريابي، عن سفيان، عن ثور، عن راشد بن سعد، عن معاوية، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنك إن اتبعت عورات الناس أفسدتهم أو كدت أن تفسدهم ‏\"‏ ‏.‏ فقال أبو الدرداء كلمة سمعها معاوية من رسول الله صلى الله عليه وسلم نفعه الله تعالى بها ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     I heard the Messenger of Allah (ﷺ) say: If you search for the faults of the people, you will corrupt them, or will nearly corrupt them. AbudDarda' said: These are the words which Mu'awiyah himself from the Messenger of Allah (ﷺ), and Allah benefited him by them.",
      "usc_msa_ref": "",
      "chain": [
        "38443",
        "20034",
        "20012",
        "11155",
        "19909",
        "27"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1444",
      "hadith_no": "1444",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو بكر بن عياش، عن عاصم بن بهدلة، عن أبي صالح، عن معاوية، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب الخمر فاجلدوه فإن عاد في الرابعة فاقتلوه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة والشريد وشرحبيل بن أوس وجرير وأبي الرمد البلوي وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث معاوية هكذا روى الثوري أيضا عن عاصم عن أبي صالح عن معاوية عن النبي صلى الله عليه وسلم ‏.‏ وروى ابن جريج ومعمر عن سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ قال سمعت محمدا يقول حديث أبي صالح عن معاوية عن النبي صلى الله عليه وسلم في هذا أصح من حديث أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وإنما كان هذا في أول الأمر ثم نسخ بعد هكذا روى محمد بن إسحاق عن محمد بن المنكدر عن جابر بن عبد الله عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من شرب الخمر فاجلدوه فإن عاد في الرابعة فاقتلوه ‏\"‏ ‏.‏ قال ثم أتي النبي صلى الله عليه وسلم بعد ذلك برجل قد شرب الخمر في الرابعة فضربه ولم يقتله ‏.‏ وكذلك روى الزهري عن قبيصة بن ذؤيب عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ قال فرفع القتل وكانت رخصة ‏.‏ والعمل على هذا الحديث عند عامة أهل العلم لا نعلم بينهم اختلافا في ذلك في القديم والحديث ومما يقوي هذا ما روي عن النبي صلى الله عليه وسلم من أوجه كثيرة أنه قال ‏\"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث النفس بالنفس والثيب الزاني والتارك لدينه ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20373",
        "11358",
        "11161",
        "27"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2980",
      "hadith_no": "2980",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا أبو أسامة، عن حبيب بن الشهيد، عن أبي مجلز، عن معاوية، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20318",
        "11275",
        "11313",
        "27"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4014",
      "hadith_no": "4014",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، عن عامر بن سعد، عن جرير بن عبد الله، عن معاوية بن أبي سفيان، أنه قال سمعته يخطب، يقول مات رسول الله صلى الله عليه وسلم وهو ابن ثلاث وستين وأبو بكر وعمر وأنا ابن ثلاث وستين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir [bin 'Abdullah]:                     that he heard Mu'awiyah bin Abi Sufyan giving a Khutbah, saying: \"The Messenger of Allah (ﷺ) died when he was sixty-three years old, and so did Abu Bakr and 'Umar, and I am sixty-three years old.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11049",
        "10554",
        "4057",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-296",
      "hadith_no": "296",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عيسى بن حماد، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، أنه سأل أم حبيبة زوج النبي صلى الله عليه وسلم هل كان رسول الله صلى الله عليه وسلم يصلي في الثوب الذي كان يجامع فيه قالت نعم إذا لم ير فيه أذى ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Abi Sufyan that he asked Umm Habibah, the wife of the Prophet (ﷺ):                      \"Did the Messenger of Allah (ﷺ) pray in a garment in which he had had intercourse?\" She said: \"Yes, so long as he saw no filth on it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-684",
      "hadith_no": "684",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن قدامة، حدثنا جرير، عن مسعر، عن مجمع، عن أبي أمامة بن سهل، قال سمعت معاوية، - رضى الله عنه - يقول سمعت من، رسول الله صلى الله عليه وسلم وسمع المؤذن فقال مثل ما قال ‏.‏",
      "text_en": " It was narrated that Abu Umamah bin Sahl said:                      \"I heard Mu'awiyah say: 'I heard the Messenger of Allah (ﷺ), when he heard the Mu'adhdhin, repeating what he said.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "20359",
        "405",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-1591",
      "hadith_no": "1591",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا إسرائيل، عن عثمان بن المغيرة، عن إياس بن أبي رملة، قال سمعت معاوية، سأل زيد بن أرقم أشهدت مع رسول الله صلى الله عليه وسلم عيدين قال نعم صلى العيد من أول النهار ثم رخص في الجمعة ‏.‏",
      "text_en": " It was narrated that Iyas bin Abi Ramlah said:                     \"I heard Mu'awiyah asking Zaid bin Arqam: 'Did you attend two 'Eids with the Messenger of Allah (ﷺ)?' He said: 'Yes; he prayed 'Eid at the beginning of the day then he granted a concession with regard to jumu'ah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20311",
        "11640",
        "17004",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-2139",
      "hadith_no": "2139",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عبيد الله بن فضالة بن إبراهيم، قال أنبأنا محمد، قال حدثنا معاوية، ح وأخبرني أحمد بن محمد بن المغيرة، قال حدثنا عثمان بن سعيد، عن معاوية، - واللفظ له - عن يحيى بن أبي كثير، أن أبا سلمة، أخبره أنه، سمع عبد الله، وهو - ابن عمر - يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الشهر تسع وعشرون ‏\"‏ ‏.‏",
      "text_en": " Abdullah Ibn ' Umar said:                     \" I heard the Messenger of Allah say: 'The month is twenty-nine days.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "27",
        "30304",
        "28388",
        "11449",
        "10567",
        "18",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2272",
      "hadith_no": "2272",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبيد الله بن يزيد بن إبراهيم الحراني، قال حدثنا عثمان، قال حدثنا معاوية، عن يحيى بن أبي كثير، عن أبي قلابة، أن أبا أمية الضمري، أخبره أنه، أتى رسول الله صلى الله عليه وسلم من سفر وهو صائم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ألا تنتظر الغداء ‏\"‏ ‏.‏ قال إني صائم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تعال أخبرك عن الصيام إن الله عز وجل وضع عن المسافر الصيام ونصف الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qilabah that Abu Umayyah Ad-Damri told him that:                     he came to the Messenger of Allah from a journey and he was fasting. The Messenger of Allah said to him, \"Won't you come and have meal for the breakfast?\" He said: \"I am fasting.\" The Messenger of Allah said: \"Come and I will tell you about fasting. Allah, the mighty and sublime, has waived fasting and half of the prayer from the traveler.\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30203",
        "27",
        "11449",
        "11047"
      ]
    },
    {
      "id": "sunan-an-nasai-2557",
      "hadith_no": "2557",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هارون بن سعيد، قال أنبأنا سفيان، عن عمرو، عن ابن منبه، عن أخيه، عن معاوية بن أبي سفيان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الرجل ليسألني الشىء فأمنعه حتى تشفعوا فيه فتؤجروا ‏\"‏ ‏.‏ وإن رسول الله صلى الله عليه وسلم قال ‏\"‏ اشفعوا تؤجروا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Sufyan that the Messenger of Allah said:                     \"A man may come and ask for something, and I refuse until you intercede, so that you will be rewarded.\" And the Messenger of Allah said: \"Intercede and you will be rewarded.\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11081",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-2593",
      "hadith_no": "2593",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا سفيان، عن عمرو، عن وهب بن منبه، عن أخيه، عن معاوية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تلحفوا في المسألة ولا يسألني أحد منكم شيئا وأنا له كاره فيبارك له فيما أعطيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'awiyah that the Messenger of Allah said:                     \"Do not be demanding when asking. If one of you asks me for anything and I give it reluctantly, there will be no blessing in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20005",
        "11081",
        "11102",
        "11447",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-2987",
      "hadith_no": "2987",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن المثنى، عن يحيى بن سعيد، عن ابن جريج، قال أخبرني الحسن بن مسلم، أن طاوسا، أخبره أن ابن عباس أخبره عن معاوية، أنه قصر عن النبي صلى الله عليه وسلم بمشقص في عمرة على المروة ‏.‏",
      "text_en": " It was narrated from Muawiyah that:                     he cut the hair of the Prophet with the edge of an arrow during his Umrah at Al-Marwah.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-2988",
      "hadith_no": "2988",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا عبد الرزاق، قال أنبأنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن معاوية، قال قصرت عن رسول الله صلى الله عليه وسلم على المروة بمشقص أعرابي ‏.‏",
      "text_en": " It was narrated that Muawiyah said:                     \"I cut the hair of the Messenger of Allah at Al-Marwah with the edge of a Bedouin arrow.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11433",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-2989",
      "hadith_no": "2989",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا الحسن بن موسى، قال حدثنا حماد بن سلمة، عن قيس بن سعد، عن عطاء، عن معاوية، قال أخذت من أطراف شعر رسول الله صلى الله عليه وسلم بمشقص كان معي بعد ما طاف بالبيت وبالصفا والمروة في أيام العشر ‏.‏ قال قيس والناس ينكرون هذا على معاوية ‏.‏",
      "text_en": " It was narrated that Muawiyah said:                     \"I cut a little from the ends of the hair of the Messenger of Allah with the eduge of an arrow that I had with me, after he had circumambulated the House, and performed Sai between As-Safa and Al-Marwah, during the ten days.\" Qais said: \"The people rebuked Muawiyah for that.\"",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20383",
        "20021",
        "172",
        "11029",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-4111",
      "hadith_no": "4111",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا معاوية، قال حدثنا سفيان، عن منصور، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "27",
        "20005",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-4809",
      "hadith_no": "4809",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن عبيد الله بن يزيد، قال حدثنا عثمان بن عبد الرحمن الطرائفي، قال حدثنا معاوية، عن يحيى بن أبي كثير، عن عكرمة، عن ابن عباس، أن نبي الله صلى الله عليه وسلم قضى في المكاتب أن يودى بقدر ما عتق منه دية الحر ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet of Allah ruled that the Diyah for a Mukatab should be (equivalent) to the Diyah for a free man, proportionate to the amount he had paid off (toward buying his freedom).",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "28390",
        "27",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4943",
      "hadith_no": "4943",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "وأخبرنا محمود بن غيلان، قال حدثنا معاوية، قال حدثنا سفيان، عن منصور، عن مجاهد، عن عطاء، عن أيمن، قال لم يقطع النبي صلى الله عليه وسلم السارق إلا في ثمن المجن وثمن المجن يومئذ دينار ‏.‏",
      "text_en": " It was narrated that Ayman said:                     \"The Prophet did not cut off the (hand of) the thief except for the value of a shield, and the value of a shield in those days was a Dinar.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "27",
        "20005",
        "11067",
        "11028",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-5092",
      "hadith_no": "5092",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن هشام، قال حدثنا قتادة، عن سعيد بن المسيب، أن معاوية، قال إن رسول الله صلى الله عليه وسلم نهى عن الزور ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Al-Musayyab that Mu'awiyah said:                     \"The Messenger of Allah [SAW] forbade giving a false impression.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20295",
        "11019",
        "11002",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5149",
      "hadith_no": "5149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن سفيان بن حبيب، عن خالد، عن أبي قلابة، عن معاوية، أن رسول الله صلى الله عليه وسلم نهى عن لبس الحرير والذهب إلا مقطعا ‏.‏ خالفه عبد الوهاب رواه عن خالد عن ميمون عن أبي قلابة ‏.‏",
      "text_en": " It was narrated from Mu'awiyah that:                     The Messenger of Allah [SAW] forbade wearing silk and gold, unless it was broken (into smaller pieces).",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20711",
        "20423",
        "11047",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5150",
      "hadith_no": "5150",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الوهاب، قال حدثنا خالد، عن ميمون، عن أبي قلابة، عن معاوية، أن رسول الله صلى الله عليه وسلم نهى عن لبس الذهب إلا مقطعا وعن ركوب المياثر ‏.‏",
      "text_en": " It was narrated from Mu'awiyah that :                     The Messenger of Allah [SAW] forbade wearing gold unless it was broken (into smaller pieces), and (he forbade) riding on Al-Mayathir.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11282",
        "11047",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5151",
      "hadith_no": "5151",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن سعيد، عن قتادة، عن أبي شيخ، أنه سمع معاوية، وعنده، جمع من أصحاب محمد صلى الله عليه وسلم قال أتعلمون أن نبي الله صلى الله عليه وسلم نهى عن لبس الذهب إلا مقطعا قالوا اللهم نعم ‏.‏",
      "text_en": " It was narrated from Abu Shaikh that he heard Mu'awiyah say,:                     When a group of the Companions of Muhammad [SAW] were with him: \"Do you know that the Prophet of Allah [SAW] forbade wearing gold unless it was broken (into smaller pieces)?\" They said: \"By Allah, yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "11168",
        "11019",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5159",
      "hadith_no": "5159",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن شميل، قال حدثنا بيهس بن فهدان، قال حدثنا أبو شيخ الهنائي، قال سمعت معاوية، وحوله، ناس من المهاجرين والأنصار فقال لهم أتعلمون أن رسول الله صلى الله عليه وسلم نهى عن لبس الحرير فقالوا اللهم نعم ‏.‏ قال ونهى عن لبس الذهب إلا مقطعا قالوا نعم ‏.‏ خالفه علي بن غراب رواه عن بيهس عن أبي شيخ عن ابن عمر ‏.‏",
      "text_en": " Abu Shaikh Al-Huna'i said:                     \"I heard Mu'awiyah say to a group of Muhajirun and Ansar who were around him: 'Do you know that the Messenger of Allah [SAW] forbade wearing silk?' They said: 'By Allah, yes.' He said 'And (he forbade) wearing gold unless it was broken (into smaller pieces)?' They said: 'Yes.'\" 'Ali bin Ghurab contradicted him; he reported it from Bahais, from Abu Shaikh, from Ibn 'Umar.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20291",
        "18094",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5245",
      "hadith_no": "5245",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن حميد بن عبد الرحمن، قال سمعت معاوية، وهو على المنبر بالمدينة وأخرج من كمه قصة من شعر فقال يا أهل المدينة أين علماؤكم سمعت النبي صلى الله عليه وسلم ينهى عن مثل هذه وقال ‏\"‏ إنما هلكت بنو إسرائيل حين اتخذ نساؤهم مثل هذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Humaid bin 'Abdur-Rahman said:                     \"I heard Mu'awiyah say, when he was on the Minbar in Al-Madinah, and he brought out a hairpiece from his sleeve: 'O people of Al-Madinah, where are your knowledgeable ones? I heard the Messenger of Allah [SAW] forbid such things as this, and he said: \"The Children of Israel were destroyed when their women started to wear things like this.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5247",
      "hadith_no": "5247",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب بن موسى، قال أنبأنا ابن المبارك، عن يعقوب بن القعقاع، عن قتادة، عن ابن المسيب، عن معاوية، أنه قال يا أيها الناس إن النبي صلى الله عليه وسلم نهاكم عن الزور ‏.‏ قال وجاء بخرقة سوداء فألقاها بين أيديهم فقال هو هذا تجعله المرأة في رأسها ثم تختمر عليه ‏.‏",
      "text_en": " It was narrated that Mu'awiyah said:                     \"O people, the Prophet [SAW] forbade you to give false impressions. He brought a piece of black cloth and threw it in front of them and said: 'This is what women are putting on their heads and covering it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "38625",
        "20025",
        "11019",
        "11002",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5248",
      "hadith_no": "5248",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الرحيم، قال حدثنا أسد بن موسى، قال حدثنا حماد بن سلمة، عن هشام بن أبي عبد الله، عن قتادة، عن سعيد بن المسيب، عن معاوية، أن رسول الله صلى الله عليه وسلم نهى عن الزور والزور المرأة تلف على رأسها ‏.‏",
      "text_en": " It was narrated from Mu'awiyah that:                     The Messenger of Allah [SAW] forbade giving a false impression, and the false impression of a woman when she adds extra hair to her head.",
      "usc_msa_ref": "",
      "chain": [
        "28040",
        "20021",
        "11019",
        "11002",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5435",
      "hadith_no": "5435",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا معاوية، عن العلاء بن الحارث، عن مكحول، عن عقبة، أن رسول الله صلى الله عليه وسلم قرأ بهما في صلاة الصبح ‏.‏",
      "text_en": " It was narrated from 'Uqbah that:                     The Messenger of Allah [SAW] recited them in the Subh prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "27",
        "10884",
        "11066",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-131",
      "hadith_no": "131",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عمرو بن عثمان، حدثنا زهير بن معاوية، حدثني إسحاق بن يحيى بن طلحة، عن موسى بن طلحة، عن معاوية بن أبي سفيان، قال نظر النبي  صلى الله عليه وسلم  إلى طلحة فقال ‏\"‏ هذا ممن قضى نحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'awiyah bin Abu Sufyan said:                     \"The Prophet looked at Talhah and said: 'This is one of those who fulfilled their covenant.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38001",
        "10581",
        "20321",
        "18029",
        "579",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-226",
      "hadith_no": "226",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا مروان بن جناح، عن يونس بن ميسرة بن حلبس، أنه حدثه قال سمعت معاوية بن أبي سفيان، يحدث عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ الخير عادة والشر لجاجة ومن يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Yunus bin Maisarah bin Halbas said:                     \"I heard Mu'awiyah bin Abu Sufyan narrating that the Messenger of Allah said: \"Goodness is a (natural) habit while evil is a stubbornness (constant prodding from Satan). When Allah wills good for a person, He causes him to understand the religion.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20733",
        "15516",
        "19201",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-583",
      "hadith_no": "583",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، أنه سأل أخته أم حبيبة زوج النبي  صلى الله عليه وسلم  هل كان رسول الله  صلى الله عليه وسلم  يصلي في الثوب الذي يجامع فيه قالت نعم إذا لم يكن فيه أذى ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Abu Sufyan that:                     He asked his sister Umm Habibah, the wife of the Prophet: \"Did the Messenger of Allah ever offered prayer in a garment in which he had sexual intercourse?\" She said: \"Yes, if there was nothing noxious on it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-681",
      "hadith_no": "681",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا الخليل بن عمرو، حدثنا ابن سلمة، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، عن أم حبيبة، زوج النبي  صلى الله عليه وسلم  قال سألتها كيف كنت تصنعين مع رسول الله  صلى الله عليه وسلم  في الحيضة قالت كانت إحدانا في فورها أول ما تحيض تشد عليها إزارا إلى أنصاف فخذيها ثم تضطجع مع رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Abu Sufyan that :                     He asked Umm Habibah, the wife of the Prophet: \"What did you used to do with the Messenger of Allah when you were menstruating?\" She said: \"If it was at the beginning of the period when the bleeding is heavy, we would tie the waist-wrapper tightly around our thighs, then lie down with the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "36552",
        "11107",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-725",
      "hadith_no": "725",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، وإسحاق بن منصور، قالا حدثنا أبو عامر، حدثنا سفيان، عن طلحة بن يحيى، عن عيسى بن طلحة، قال سمعت معاوية بن أبي سفيان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المؤذنون أطول الناس أعناقا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Esa bin Talhah said:                     \"I heard Mu'awiyah bin Abu Sufyan say that Messenger of Allah said: \"The Mu'adh-dhin will have the longest necks of all people on the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30313",
        "20443",
        "20012",
        "11863",
        "10573",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-1016",
      "hadith_no": "1016",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان، عن ابن عجلان، ح وحدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن معاوية بن أبي سفيان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تبادروني بالركوع ولا بالسجود فمهما أسبقكم به إذا ركعت تدركوني به إذا رفعت ومهما أسبقكم به إذا سجدت تدركوني به إذا رفعت إني قد بدنت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Mu’awiyah bin Abu Sufyan said:                      “The Messenger ofAllah (ﷺ) said: ‘Do not bow or prostrate before me. No matter howfar ahead of you I bow, you will catch up with me when I stand up,andno matter how far ahead of you I prostrate, you will catch upwith mewhen I raise my head. I have become bulky.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20012",
        "10616",
        "34043",
        "20031",
        "10616",
        "11222",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-2670",
      "hadith_no": "2670",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا هشام بن عمار، حدثنا شعيب بن إسحاق، حدثنا سعيد بن أبي عروبة، عن عاصم بن بهدلة، عن ذكوان أبي صالح، عن معاوية بن أبي سفيان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا شربوا الخمر فاجلدوهم ثم إذا شربوا فاجلدوهم ثم إذا شربوا فاجلدوهم ثم إذا شربوا فاقتلوهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu`awiyah bin Abu Sufyan that the Messenger of Allah (ﷺ) said:                     “If they drink (again), then whip them. If they drink (again), then whip them. If they drink (again), then whip them. If they drink (again), then kill them.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20239",
        "11073",
        "11358",
        "11161",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-3514",
      "hadith_no": "3514",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا خالد بن حيان، عن سليمان بن عبد الله بن الزبرقان، عن يعلى بن شداد بن أوس، سمعت معاوية، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ كل مسكر حرام على كل مؤمن ‏\"‏ ‏.‏ وهذا حديث الرقيين ‏.‏",
      "text_en": " Mu’awiyah said:                      “I heard the Messenger of Allah (ﷺ) say: ‘Everyintoxicant is unlawful for every believer.’”",
      "usc_msa_ref": "",
      "chain": [
        "38412",
        "28149",
        "28227",
        "12606",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-3787",
      "hadith_no": "3787",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أبي المعتمر، عن ابن سيرين، عن معاوية، قال كان رسول الله  صلى الله عليه وسلم  ينهى عن ركوب النمور ‏.‏",
      "text_en": " It wasnarrated that Mu’awiyah said:                      “The Messenger of Allah (ﷺ)usedto forbid riding on leopard skins.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11035",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-3743-2",
      "hadith_no": "3743",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن سعد بن إبراهيم بن عبد الرحمن بن عوف، عن معبد الجهني، عن معاوية، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إياكم والتمادح فإنه الذبح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muawiyah said:                     \"I heard the Messenger of Allah(ﷺ) say: 'Beware of praising one another, for it is slaughtering (one another).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "11063",
        "19019",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-4171",
      "hadith_no": "4171",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا غياث بن جعفر الرحبي، أنبأنا الوليد بن مسلم، سمعت ابن جابر، يقول قال سمعت أبا عبد ربه، يقول سمعت معاوية، يقول سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ لم يبق من الدنيا إلا بلاء وفتنة ‏\"‏ ‏.‏",
      "text_en": " Mu’awiyah said:                      “I heard the Prophet (ﷺ) say: ‘There isnothingleft of this world except trials and tribulations.’”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "27"
      ]
    }
  ],
  "total_hadiths": 85
}