{
  "id": "27036",
  "name": "Muhammad bin Yazid al-Kula'i محمد بن يزيد الكلاعي",
  "full_name": "Muhammad bin Yazid al-Kula'i محمد بن يزيد الكلاعي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit",
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Kula'i",
      "Client",
      "al-Wasti",
      "Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1569",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن يزيد الواسطي، أخبرنا سفيان بن حسين، بإسناده ومعناه قال ‏\"‏ فإن لم تكن ابنة مخاض فابن لبون ‏\"‏ ‏.‏ ولم يذكر كلام الزهري ‏.‏",
      "text_en": " Therefore said tradition has also been transmitted by Sufyan bin Husain through a different chain of narrators and to the same effect. This version adds “If there is no she Camel in her second year, a she Camel in her third year is to be given.” This does not mention the words of Al Zuhri.",
      "chain": [
        "30203",
        "27036",
        "20655"
      ]
    },
    {
      "hadith_no": "1032",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا محمد بن يزيد الواسطي، عن إسماعيل بن مسلم المكي، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الطفل لا يصلى عليه ولا يرث ولا يورث حتى يستهل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث قد اضطرب الناس فيه فرواه بعضهم عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم مرفوعا ‏.‏ وروى أشعث بن سوار وغير واحد عن أبي الزبير عن جابر موقوفا ‏.‏ وروى محمد بن إسحاق عن عطاء بن أبي رباح عن جابر موقوفا ‏.‏ وكأن هذا أصح من الحديث المرفوع ‏.‏ وقد ذهب بعض أهل العلم إلى هذا قالوا لا يصلى على الطفل حتى يستهل ‏.‏ وهو قول سفيان الثوري والشافعي ‏.‏",
      "text_en": " Jabir narrated that:                     The Prophet said: \"The child is not prayed over, nor does he inherit, nor is he inherited from until one is sure he was alive at birth.\"",
      "chain": [
        "30325",
        "27036",
        "13003",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1770",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن حجر، حدثنا الربيع بن بدر، ومحمد بن يزيد الواسطي، عن أبي الأشهب، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث عبد الرحمن بن طرفة ‏.‏ وقد روى سلم بن زرير عن عبد الرحمن بن طرفة نحو حديث أبي الأشهب ‏.‏ وقد روي عن غير واحد من أهل العلم أنهم شدوا أسنانهم بالذهب وفي هذا الحديث حجة لهم ‏.‏ وقال عبد الرحمن بن مهدي سلم بن رزين وهو وهم وأبو سعد الصغاني اسمه محمد بن ميسر ‏.‏",
      "text_en": " Another chain with similar meaning.[Abu 'Eisa said:                     ] This Hadith is Hasan Gharib, we only know of it as a narration of 'Abdur-Rahman bin Tarafah. Salm bin Zarir reported similar to the narration of Abu Al-Ashhab from 'Abdur-Rahman bin Taraqah - \"from 'Abdur-Rahman bin Taraqah.\" It has been related about more than one of the people of knowledge that they would brace their teeth with gold, and in this Hadith there was a proof for them.'Abdur-Rahman bin Mahdi said: \"Salm bin Zarin\" but that is an error, \"Zarir\" is more correct, and Abu Sa'd As-San'ani's (a narrator in this chain) name is Muhammad bin Muyassir.",
      "chain": [
        "20387",
        "24133",
        "27036"
      ]
    },
    {
      "hadith_no": "2211",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر، حدثنا محمد بن يزيد الواسطي، عن المستلم بن سعيد، عن رميح الجذامي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا اتخذ الفىء دولا والأمانة مغنما والزكاة مغرما وتعلم لغير الدين وأطاع الرجل امرأته وعق أمه وأدنى صديقه وأقصى أباه وظهرت الأصوات في المساجد وساد القبيلة فاسقهم وكان زعيم القوم أرذلهم وأكرم الرجل مخافة شره وظهرت القينات والمعازف وشربت الخمور ولعن آخر هذه الأمة أولها فليرتقبوا عند ذلك ريحا حمراء وزلزلة وخسفا ومسخا وقذفا وآيات تتابع كنظام بال قطع سلكه فتتابع ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي ‏.‏ وهذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"When Al-Fai' is distributed(preferentially), trust is a spoil of war, Zakat is a fine, knowledge is sought for other than the(sake of the) religion, a man obeys his wife and disobeys his mother, he is close to his friend and far from his father, voices are raised in the Masajid, tribes are led by their wicked, the leader of the people is the most despicable among them, the most honored man is the one whose evil the people are afraid of, singing slave-girls and music spread, intoxicants are drunk, and the end of this Ummah curses its beginning- then anticipate a red wind, earthquake, collapsing of the earth, transformation, Qadhf, and the signs follow in succession like gems of a necklace whose string is cut and so they fall in succession.\"",
      "chain": [
        "20387",
        "27036",
        "18287",
        "13"
      ]
    },
    {
      "hadith_no": "2682",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن خداش البغدادي، حدثنا محمد بن يزيد الواسطي، حدثنا عاصم بن رجاء بن حيوة، عن قيس بن كثير، قال قدم رجل من المدينة على أبي الدرداء وهو بدمشق فقال ما أقدمك يا أخي فقال حديث بلغني أنك تحدثه عن رسول الله صلى الله عليه وسلم قال أما جئت لحاجة قال لا ‏.‏ قال أما قدمت لتجارة قال لا ‏.‏ قال ما جئت إلا في طلب هذا الحديث قال فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سلك طريقا يبتغي فيه علما سلك الله به طريقا إلى الجنة وإن الملائكة لتضع أجنحتها رضا لطالب العلم وإن العالم ليستغفر له من في السموات ومن في الأرض حتى الحيتان في الماء وفضل العالم على العابد كفضل القمر على سائر الكواكب إن العلماء ورثة الأنبياء إن الأنبياء لم يورثوا دينارا ولا درهما إنما ورثوا العلم فمن أخذ به أخذ بحظ وافر ‏\"‏ ‏.‏ قال أبو عيسى ولا نعرف هذا الحديث إلا من حديث عاصم بن رجاء بن حيوة وليس هو عندي بمتصل هكذا حدثنا محمود بن خداش بهذا الإسناد ‏.‏ وإنما يروى هذا الحديث عن عاصم بن رجاء بن حيوة عن الوليد بن جميل عن كثير بن قيس عن أبي الدرداء عن النبي صلى الله عليه وسلم وهذا أصح من حديث محمود بن خداش ورأى محمد بن إسماعيل هذا أصح ‏.‏",
      "text_en": " Narrated Qais bin Kathir:                     \"A man from Al-Madinah came to Abu Ad-Darda when he was in Dimashq. So he said: 'What brings you O my nephew?' He replied: 'A Hadith reached me which you have narrated from the Messenger of Allah (ﷺ).' He said: 'You did not come for some need?' He said: 'No.' He said: 'Did you come for trade?' He said: 'No, I did not come except seeking this Hadith.' So he said: 'Indeed, I heard the Messenger of Allah (ﷺ) saying: \"Whoever takes a path upon which he seeks knowledge, then Allah makes a path to Paradise easy for him. And indeed the angels lower their wings in approval to the one seeking knowledge. Indeed forgiveness is sought for the knowledgeable one by whomever is in the heavens and whomever is in the earth, even the fish in the waters. And superiority of the scholar over the worshiper is like the superiority of the moon over the rest of the celestial bodies. Indeed the scholars are the heirs of the Prophets, and the Prophets do not leave behind Dinar or Dirham. The only legacy of the scholars is knowledge, so whoever takes from it, then he has indeed taken the most able share.",
      "chain": [
        "36669",
        "27036",
        "28259"
      ]
    }
  ],
  "total_hadiths": 5
}