{
  "id": "27053",
  "name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
  "full_name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "156",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17080",
      "name": "al-Walid bin Sufyan bin Aby الوليد بن سفيان بن أبي مريم الغساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17017",
      "name": "Hkym bin 'Umayr bin al-Ahws حكيم بن عمير بن الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19909",
      "name": "Rashid bin Sa'd راشد بن سعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19913",
      "name": "Damrah bin Habib al-Zubaidi ضمرة بن حبيب بن صهيب الزبيدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11422",
      "name": "Khalid bin Ma'dan خالد بن معدان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10877",
      "name": "Atyh bin Qays al-Klaby عطية بن قيس الكلابي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11415",
      "name": "'Umayr bin Han'i al-Ansi عمير بن هانئ العنسي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20442",
      "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30330",
      "name": "al-Hakm bin Nafi', Abu al-Yaman الحكم بن نافع أبو اليمان الحمصي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4295",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عيسى بن يونس، عن أبي بكر بن أبي مريم، عن الوليد بن سفيان الغساني، عن يزيد بن قتيب السكوني، عن أبي بحرية، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الملحمة الكبرى وفتح القسطنطينية وخروج الدجال في سبعة أشهر ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: The greatest war, the conquest of Constantinople and the coming forth of the Dajjal (Antichrist) will take place within a period of seven months.",
      "chain": [
        "30352",
        "20347",
        "27053",
        "17080",
        "19921",
        "32"
      ]
    },
    {
      "hadith_no": "5130",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، عن أبي بكر بن أبي مريم، عن خالد بن محمد الثقفي، عن بلال بن أبي الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ حبك الشىء يعمي ويصم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: Your love for a thing causes blindness and deafness.",
      "chain": [
        "26010",
        "20644",
        "27053",
        "17505",
        "18090",
        "37"
      ]
    },
    {
      "hadith_no": "1012",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عيسى بن يونس، عن أبي بكر بن أبي مريم، عن راشد بن سعد، عن ثوبان، قال خرجنا مع رسول الله صلى الله عليه وسلم في جنازة فرأى ناسا ركبانا فقال ‏\"‏ ألا تستحيون إن ملائكة الله على أقدامهم وأنتم على ظهور الدواب ‏\"‏ ‏.‏ قال وفي الباب عن المغيرة بن شعبة وجابر بن سمرة ‏.‏ قال أبو عيسى حديث ثوبان قد روي عنه موقوفا قال محمد الموقوف منه أصح ‏.‏",
      "text_en": " Thawban narrated:                     \"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"",
      "chain": [
        "20387",
        "20347",
        "27053",
        "19909",
        "130"
      ]
    },
    {
      "hadith_no": "2238",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا الحكم بن المبارك، حدثنا الوليد بن مسلم، عن أبي بكر بن أبي مريم، عن الوليد بن سفيان، عن يزيد بن قطيب السكوني، عن أبي بحرية، صاحب معاذ عن معاذ بن جبل، عن النبي صلى الله عليه وسلم قال ‏\"‏ الملحمة العظمى وفتح القسطنطينية وخروج الدجال في سبعة أشهر ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن الصعب بن جثامة وعبد الله بن بسر وعبد الله بن مسعود وأبي سعيد الخدري ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Bahriyyah, a Companion of Mu'adh bin Jabal narrated that the Prophet(s.a.w) said:                     \"The great Malhamah, the conquest of Constantinople, and the coming of the Dajjal occur in (the span of) seven months.\"",
      "chain": [
        "30025",
        "38191",
        "20733",
        "27053",
        "17080",
        "19179",
        "32"
      ]
    },
    {
      "hadith_no": "2647",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عيسى بن يونس، عن أبي بكر بن أبي مريم، ح وحدثنا عبد الله بن عبد الرحمن، أخبرنا عمرو بن عون، أخبرنا ابن المبارك، عن أبي بكر بن أبي مريم، عن ضمرة بن حبيب، عن شداد بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكيس من دان نفسه وعمل لما بعد الموت والعاجز من أتبع نفسه هواها وتمنى على الله ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ قال ومعنى قوله ‏\"‏ من دان نفسه ‏\"‏ ‏.‏ يقول حاسب نفسه في الدنيا قبل أن يحاسب يوم القيامة ‏.‏ ويروى عن عمر بن الخطاب قال حاسبوا أنفسكم قبل أن تحاسبوا وتزينوا للعرض الأكبر وإنما يخف الحساب يوم القيامة على من حاسب نفسه في الدنيا ‏.‏ ويروى عن ميمون بن مهران قال لا يكون العبد تقيا حتى يحاسب نفسه كما يحاسب شريكه من أين مطعمه وملبسه ‏.‏",
      "text_en": " Shaddad bin Aws narrated that the Prophet (s.a.w) said:                     \"The clever person ids the one who subjugates his soul, and works for what is after death. And the incapable is the one who follows his desires and merely hopes in Allah.\"",
      "chain": [
        "35047",
        "20347",
        "27053",
        "30025",
        "30154",
        "20025",
        "27053",
        "19913",
        "389"
      ]
    },
    {
      "hadith_no": "1547",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا بقية بن الوليد، عن أبي بكر بن أبي مريم، عن راشد بن سعد، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  قال رأى رسول الله  صلى الله عليه وسلم  ناسا ركبانا على دوابهم في جنازة فقال ‏\"‏ ألا تستحيون أن ملائكة الله يمشون على أقدامهم وأنتم ركبان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban, the freed slave of the Messenger ofAllah(ﷺ), said:                      “The Messenger of Allah (ﷺ) saw some peopleridingon their animals in a funeral (procession). He said: ‘Do younotfeel ashamed that the angels of Allah are walking on foot and youareriding?’”",
      "chain": [
        "38462",
        "20644",
        "27053",
        "19909"
      ]
    },
    {
      "hadith_no": "4231",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، وإسماعيل بن عياش، قالا حدثنا أبو بكر بن أبي مريم، عن الوليد بن سفيان بن أبي مريم، عن يزيد بن قطيب السكوني، - وقال الوليد يزيد بن قطبة - عن أبي بحرية، عن معاذ بن جبل، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الملحمة الكبرى وفتح القسطنطينية وخروج الدجال في سبعة أشهر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin Jabal that the Prophet (ﷺ) said:                     \"The great fierce battle, the conquest of Constantinople and theemergence of Dajjal, will all happen within seven months.\"",
      "chain": [
        "30288",
        "20733",
        "20736",
        "27053",
        "17080",
        "19179",
        "19921",
        "32"
      ]
    }
  ],
  "total_hadiths": 7
}