{
  "id": "27362",
  "name": "al-Walid bin Abi Thwr Sm' الوليد بن أبي ثور",
  "full_name": "al-Walid bin Abi Thwr Sm' الوليد بن أبي ثور",
  "grade": "Succ. (Taba' Tabi')",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "Basra",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": [
      "al-Hamdani",
      "Basri",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2340",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا الوليد، - يعني ابن أبي ثور ح وحدثنا الحسن بن علي، حدثنا الحسين، - يعني الجعفي - عن زائدة، - المعنى - عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال إني رأيت الهلال - قال الحسن في حديثه يعني رمضان - فقال ‏\"‏ أتشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ أتشهد أن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس فليصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A bedouin came to the Prophet (ﷺ) and said: I have sighted the moon. Al-Hasan added in his version: that is, of Ramadan. He asked: Do you testify that there is no god but Allah? He replied: Yes. He again asked: Do you testify that Muhammad is the Messenger of Allah? He replied: Yes. and he testified that he had sighted the moon. He said: Bilal, announce to the people that they must fast tomorrow.",
      "chain": [
        "30512",
        "27362",
        "30",
        "20315",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا الوليد بن أبي ثور، عن سماك، عن عبد الله بن عميرة، عن الأحنف بن قيس، عن العباس بن عبد المطلب، قال كنت في البطحاء في عصابة فيهم رسول الله صلى الله عليه وسلم فمرت بهم سحابة فنظر إليها فقال ‏\"‏ ما تسمون هذه ‏\"‏ ‏.‏ قالوا السحاب ‏.‏ قال ‏\"‏ والمزن ‏\"‏ ‏.‏ قالوا والمزن ‏.‏ قال ‏\"‏ والعنان ‏\"‏ ‏.‏ قالوا والعنان ‏.‏ قال أبو داود لم أتقن العنان جيدا قال ‏\"‏ هل تدرون ما بعد ما بين السماء والأرض ‏\"‏ ‏.‏ قالوا لا ندري ‏.‏ قال ‏\"‏ إن بعد ما بينهما إما واحدة أو اثنتان أو ثلاث وسبعون سنة ثم السماء فوقها كذلك ‏\"‏ ‏.‏ حتى عد سبع سموات ‏\"‏ ثم فوق السابعة بحر بين أسفله وأعلاه مثل ما بين سماء إلى سماء ثم فوق ذلك ثمانية أوعال بين أظلافهم وركبهم مثل ما بين سماء إلى سماء ثم على ظهورهم العرش بين أسفله وأعلاه مثل ما بين سماء إلى سماء ثم الله تبارك وتعالى فوق ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Abbas ibn AbdulMuttalib:                     I was sitting in al-Batha with a company among whom the Messenger of Allah (ﷺ) was sitting, when a cloud passed above them.  The Messenger of Allah (ﷺ) looked at it and said: What do you call this?  They said: Sahab.  He said: And muzn?  They said: And muzn. He said: And anan?  They said: And anan.  AbuDawud said: I am not quite confident about the word anan.  He asked:  Do you know the distance between Heaven and Earth?  They replied: We do not know.  He then said: The distance between them is seventy-one, seventy-two, or seventy-three years. The heaven which is above it is at a similar distance (going on till he counted seven heavens). Above the seventh heaven there is a sea, the distance between whose surface and bottom is like that between one heaven and the next. Above that there are eight mountain goats the distance between whose hoofs and haunches is like the distance between one heaven and the next. Then Allah, the Blessed and the Exalted, is above that.",
      "chain": [
        "30269",
        "27362",
        "10770",
        "11112",
        "100"
      ]
    },
    {
      "hadith_no": "691",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن الصباح، حدثنا الوليد بن أبي ثور، عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال إني رأيت الهلال ‏.‏ قال ‏\"‏ أتشهد أن لا إله إلا الله أتشهد أن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس أن يصوموا غدا ‏\"‏ ‏.‏  حدثنا أبو كريب، حدثنا حسين الجعفي، عن زائدة، عن سماك، نحوه بهذا الإسناد ‏.‏ قال أبو عيسى حديث ابن عباس فيه اختلاف ‏.‏ وروى سفيان الثوري، وغيره، عن سماك، عن عكرمة، عن النبي صلى الله عليه وسلم مرسلا وأكثر أصحاب سماك رووا عن سماك عن عكرمة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ والعمل على هذا الحديث عند أكثر أهل العلم قالوا تقبل شهادة رجل واحد في الصيام ‏.‏ وبه يقول ابن المبارك والشافعي وأحمد وأهل الكوفة ‏.‏ قال إسحاق لا يصام إلا بشهادة رجلين ‏.‏ ولم يختلف أهل العلم في الإفطار أنه لا يقبل فيه إلا شهادة رجلين ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"",
      "chain": [
        "34188",
        "30269",
        "27362",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3986",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عباد بن يعقوب الكوفي، حدثنا الوليد بن أبي ثور، عن السدي، عن عباد بن أبي يزيد، عن علي بن أبي طالب، قال كنت مع النبي صلى الله عليه وسلم بمكة فخرجنا في بعض نواحيها فما استقبله جبل ولا شجر إلا وهو يقول السلام عليك يا رسول الله ‏.‏ قال هذا حديث غريب ‏.‏ وروى غير واحد عن الوليد بن أبي ثور وقالوا عن عباد أبي يزيد منهم فروة بن أبي المغراء ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib:                     \"I was with the Prophet (ﷺ) in Makkah. We departed to one of its suburbs, and no mountain or tree was before him, except that it said: 'Peace be upon you O Messenger of Allah.'\"",
      "chain": [
        "30199",
        "27362",
        "10743",
        "5"
      ]
    }
  ],
  "total_hadiths": 4
}