{
  "id": "274",
  "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
  "full_name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "1",
      "date_gregorian": "623",
      "date_display": [
        "1 AH",
        "623 CE"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "65",
      "date_gregorian": "685",
      "date_display": null,
      "place": "Hims",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medina",
      "Syria",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحبة ]",
      "Qadhi(Judge)",
      "Governor"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.al-Harith B.al-Khazraj"
    ]
  },
  "parents": [
    {
      "id": "132",
      "name": "Bashir ibn Sa'd ( بشير بن سعد بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "272",
      "name": "'Amra bint Rawaha ( عمرة بنت رواحة بن ثعلبة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "275",
      "name": "Umayya or Ubayya bint Bashir ibn Sa'd ( أميمة بنت بشير بن سعد الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11538",
      "name": "Muhammad bin al-Nu'man bin Basheer محمد بن النعمان بن بشير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13316",
      "name": "Yazid bin al-N'uman bin Basheer يزيد بن النعمان بن بشير",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12704",
      "name": "Hameed bin al-N'uman bin Bashir حميد بن النعمان بن بشير الأنصاري",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "48",
      "name": "'Abdullah ibn Rawaha ( عبد الله بن رواحة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11538",
      "name": "Muhammad bin al-Nu'man bin Basheer محمد بن النعمان بن بشير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12704",
      "name": "Hameed bin al-N'uman bin Bashir حميد بن النعمان بن بشير الأنصاري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11837",
      "name": "Habib bin Salm al-Ansari حبيب بن سالم الأنصاري مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10968",
      "name": "Mamtur Abu Salam al-Aswad ممطور أبو سلام الأسود الحبشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11342",
      "name": "Salm bin Abi al-Ja'd سالم بن أبي الجعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11332",
      "name": "Khaythama bin 'Abdur Rahman خيثمة بن عبد الرحمن بن أبي سبرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10808",
      "name": "al-Yzar bin Hryth al-Bdy al-Kwfy العيزار بن حريث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14373",
      "name": "al-Mfdl bin al-Mhlb المفضل بن المهلب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18019",
      "name": "al-Azhar bin 'Abdullah al-Harazi أزهر بن عبد الله",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "52",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، قال سمعت النعمان بن بشير، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلال بين والحرام بين، وبينهما مشبهات لا يعلمها كثير من الناس، فمن اتقى المشبهات استبرأ لدينه وعرضه، ومن وقع في الشبهات كراع يرعى حول الحمى، يوشك أن يواقعه‏.‏ ألا وإن لكل ملك حمى، ألا إن حمى الله في أرضه محارمه، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله، وإذا فسدت فسد الجسد كله‏.‏ ألا وهي القلب ‏\"‏‏.‏",
      "text_en": "      Narrated An-Nu'man bin Bashir:                          I heard Allah's Apostle saying, 'Both legal and illegal things are      evident but in between them there are doubtful (suspicious) things and     most of the people have no knowledge about them. So whoever saves      himself from these suspicious things saves his religion and his honor.     And whoever indulges in these suspicious things is like a shepherd who     grazes (his animals) near the Hima (private pasture) of someone else      and at any moment he is liable to get in it. (O people!) Beware! Every     king has a Hima and the Hima of Allah on the earth is His illegal      (forbidden) things. Beware! There is a piece of flesh in the body if      it becomes good (reformed) the whole body becomes good but if it gets      spoilt the whole body gets spoilt and that is the heart.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "717",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا شعبة، قال أخبرني عمرو بن مرة، قال سمعت سالم بن أبي الجعد، قال سمعت النعمان بن بشير، يقول قال النبي صلى الله عليه وسلم ‏\"‏ لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin 'Bashir:                     The Prophet said, \"Straighten your rows or Allah will alter your faces.\"",
      "chain": [
        "20296",
        "20020",
        "11381",
        "11342",
        "274"
      ]
    },
    {
      "hadith_no": "2051",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن الشعبي، سمعت النعمان بن بشير  رضى الله عنه  سمعت النبي صلى الله عليه وسلم‏.‏ حدثنا علي بن عبد الله، حدثنا ابن عيينة، عن أبي فروة، عن الشعبي، قال سمعت النعمان، عن النبي صلى الله عليه وسلم‏.‏ حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن أبي فروة، سمعت الشعبي، سمعت النعمان بن بشير  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي فروة، عن الشعبي، عن النعمان بن بشير  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ الحلال بين، والحرام بين وبينهما أمور مشتبهة، فمن ترك ما شبه عليه من الإثم كان لما استبان أترك، ومن اجترأ على ما يشك فيه من الإثم أوشك أن يواقع ما استبان، والمعاصي حمى الله، من يرتع حول الحمى يوشك أن يواقعه ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     The Prophet said \"Both legal and illegal things are obvious, and in between them are (suspicious) doubtful matters. So whoever forsakes those doubtful things lest he may commit a sin, will definitely avoid what is clearly illegal; and whoever indulges in these (suspicious) doubtful things bravely, is likely to commit what is clearly illegal. Sins are Allah's Hima (i.e. private pasture) and whoever pastures (his sheep) near it, is likely to get in it at any moment.\"",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، قال سمعت عامرا، يقول سمعت النعمان بن بشير  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل القائم على حدود الله والواقع فيها كمثل قوم استهموا على سفينة، فأصاب بعضهم أعلاها وبعضهم أسفلها، فكان الذين في أسفلها إذا استقوا من الماء مروا على من فوقهم فقالوا لو أنا خرقنا في نصيبنا خرقا، ولم نؤذ من فوقنا‏.‏ فإن يتركوهم وما أرادوا هلكوا جميعا، وإن أخذوا على أيديهم نجوا ونجوا جميعا ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     The Prophet said, \"The example of the person abiding by Allah's order and restrictions in comparison to those who violate them is like the example of those persons who drew lots for their seats in a boat. Some of them got seats in the upper part, and the others in the lower. When the latter needed water, they had to go up to bring water (and that troubled the others), so they said, 'Let us make a hole in our share of the ship (and get water) saving those who are above us from troubling them. So, if the people in the upper part left the others do what they had suggested, all the people of the ship would be destroyed, but if they prevented them, both parties would be safe.\"",
      "chain": [
        "20348",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2586",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، ومحمد بن النعمان بن بشير، أنهما حدثاه عن النعمان بن بشير، أن أباه، أتى به إلى رسول الله صلى الله عليه وسلم فقال إني نحلت ابني هذا غلاما‏.‏ فقال ‏\"‏ أكل ولدك نحلت مثله ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فارجعه ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     that his father took him to Allah's Apostle and said, \"I have given this son of mine a slave.\" The Prophet asked, \"Have you given all your sons the like?\" He replied in the negative. The Prophet said, \"Take back your gift then.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10561",
        "274"
      ]
    },
    {
      "hadith_no": "2587",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا حامد بن عمر، حدثنا أبو عوانة، عن حصين، عن عامر، قال سمعت النعمان بن بشير  رضى الله عنهما  وهو على المنبر يقول أعطاني أبي عطية، فقالت عمرة بنت رواحة لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم‏.‏ فأتى رسول الله صلى الله عليه وسلم فقال إني أعطيت ابني من عمرة بنت رواحة عطية، فأمرتني أن أشهدك يا رسول الله‏.‏ قال ‏\"‏ أعطيت سائر ولدك مثل هذا ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فاتقوا الله، واعدلوا بين أولادكم ‏\"‏‏.‏ قال فرجع فرد عطيته‏.‏",
      "text_en": " Narrated 'Amir:                     I heard An-Nu`man bin Bashir on the pulpit saying, \"My father gave me a gift but `Amra bint Rawaha (my mother) said that she would not agree to it unless he made Allah's Apostle as a witness to it. So, my father went to Allah's Apostle and said, 'I have given a gift to my son from `Amra bint Rawaha, but she ordered me to make you as a witness to it, O Allah's Apostle!' Allah's Apostle asked, 'Have you given (the like of it) to everyone of your sons?' He replied in the negative. Allah's Apostle said, 'Be afraid of Allah, and be just to your children.' My father then returned and took back his gift.\"",
      "chain": [
        "30128",
        "20469",
        "15097",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2650",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا أبو حيان التيمي، عن الشعبي، عن النعمان بن بشير  رضى الله عنهما  قال سألت أمي أبي بعض الموهبة لي من ماله، ثم بدا له فوهبها لي فقالت لا أرضى حتى تشهد النبي صلى الله عليه وسلم‏.‏ فأخذ بيدي وأنا غلام، فأتى بي النبي صلى الله عليه وسلم فقال إن أمه بنت رواحة سألتني بعض الموهبة لهذا، قال ‏\"‏ ألك ولد سواه ‏\"‏‏.‏ قال نعم‏.‏ قال فأراه قال ‏\"‏ لا تشهدني على جور ‏\"‏‏.‏ وقال أبو حريز عن الشعبي ‏\"‏ لا أشهد على جور ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     My mother asked my father to present me a gift from his property; and he gave it to me after some hesitation. My mother said that she would not be satisfied unless the Prophet was made a witness to it. I being a young boy, my father held me by the hand and took me to the Prophet . He said to the Prophet, \"His mother, bint Rawaha, requested me to give this boy a gift.\" The Prophet said, \"Do you have other sons besides him?\" He said, \"Yes.\" The Prophet said, \"Do not make me a witness for injustice.\" Narrated Ash-Shu`bi that the Prophet said, \"I will not become a witness for injustice.\"",
      "chain": [
        "30349",
        "20025",
        "11404",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2686",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني الشعبي، أنه سمع النعمان بن بشير  رضى الله عنهما  يقول قال النبي صلى الله عليه وسلم ‏\"‏ مثل المدهن في حدود الله والواقع فيها مثل قوم استهموا سفينة، فصار بعضهم في أسفلها وصار بعضهم في أعلاها، فكان الذي في أسفلها يمرون بالماء على الذين في أعلاها، فتأذوا به، فأخذ فأسا، فجعل ينقر أسفل السفينة، فأتوه فقالوا ما لك قال تأذيتم بي، ولا بد لي من الماء، فإن أخذوا على يديه أنجوه ونجوا أنفسهم، وإن تركوه أهلكوه وأهلكوا أنفسهم ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     The Prophet said, \"The example of the person abiding by Allah's orders and limits (or the one who abides by the limits and regulations prescribed by Allah) in comparison to the one who do wrong and violate Allah's limits and orders is like the example of people drawing lots for seats in a boat. Some of them got seats in the upper part while the others in the lower part ; those in the, lower part have to pass by those in the upper one to get water, and that troubled the latter. One of them (i.e. the people in the lower part) took an ax and started making a hole in the bottom of the boat. The people of the upper part came and asked him, (saying), 'What is wrong with you?' He replied, \"You have been troubled much by my (coming up to you), and I have to get water.' Now if they prevent him from doing that they will save him and themselves, but if they leave him (to do what he wants), they will destroy him and themselves.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4312",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمران بن ميسرة، حدثنا محمد بن فضيل، عن حصين، عن عامر، عن النعمان بن بشير  رضى الله عنهما  قال أغمي على عبد الله بن رواحة، فجعلت أخته عمرة تبكي واجبلاه واكذا واكذا‏.‏ تعدد عليه فقال حين أفاق ما قلت شيئا إلا قيل لي آنت كذلك‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     `Abdullah bin Rawaha fell down unconscious and his sister `Amra started crying and was saying loudly, \"O Jabala! Oh so-and-so! Oh so-and-so! and went on calling him by his (good ) qualities one by one). When he came to his senses, he said (to his sister), \"When-ever you said something, I was asked, 'Are you really so (i.e. as she says)?\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4313",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا عبثر، عن حصين، عن الشعبي، عن النعمان بن بشير، قال أغمي على عبد الله بن رواحة بهذا، فلما مات لم تبك عليه‏.‏",
      "text_en": " Narrated Ash Shabi:                     An Nu`man bin Bashir said, \"Abdullah bin Rawaha fell down unconscious..\" (and mentioned the above Hadith adding, \"Thereupon, when he died she (i.e. his sister) did not weep over him.\"",
      "chain": [
        "30367",
        "15097",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "6079",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، قال سمعته يقول سمعت النعمان بن بشير، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ترى المؤمنين في تراحمهم وتوادهم وتعاطفهم كمثل الجسد إذا اشتكى عضوا تداعى له سائر جسده بالسهر والحمى ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     Allah's Apostle said, \"You see the believers as regards their being merciful among themselves and showing love among themselves and being kind, resembling one body, so that, if any part of the body is not well then the whole body shares the sleeplessness (insomnia) and fever with it.\"",
      "chain": [
        "20348",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "6641",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت أبا إسحاق، قال سمعت النعمان، سمعت النبي صلى الله عليه وسلم يقول ‏\"‏إن أهون أهل النار عذابا يوم القيامة لرجل توضع في أخمص قدميه جمرة يغلي منها دماغه‏\"‏.‏",
      "text_en": " Narrated An-Nu`man:                     I heard the Prophet saying, \"The person who will have the least punishment from amongst the Hell Fire people on the Day of Resurrection, will be a man under whose arch of the feet a smoldering ember will be placed so that his brain will boil because of it.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "274"
      ]
    },
    {
      "hadith_no": "6642",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن النعمان بن بشير، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن أهون أهل النار عذابا يوم القيامة رجل على أخمص قدميه جمرتان يغلي منهما دماغه، كما يغلي المرجل والقمقم‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     I heard the Prophet saying, \"The least punished person of the (Hell) Fire people on the Day of Resurrection will be a man under whose arch of the feet two smoldering embers will be placed, because of which his brain will boil just like Al-Mirjal (copper vessel) or a Qum-qum (narrow-necked vessel) is boiling with water.\"",
      "chain": [
        "20245",
        "20311",
        "11049",
        "274"
      ]
    },
    {
      "hadith_no": "538",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت أبا إسحاق، يقول سمعت النعمان بن بشير، يخطب وهو يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أهون أهل النار عذابا يوم القيامة لرجل توضع في أخمص قدميه جمرتان يغلي منهما دماغه ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir was delivering an address and saying:                      I heard the Messenger of Allah (may peace be upon him) say: the least suffering for the inhabitants of Hell on the Day of Resurrection would be for the man under whose soles would be placed two embers and his brain would boil on account of them.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11049",
        "274"
      ]
    },
    {
      "hadith_no": "539",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن الأعمش، عن أبي إسحاق، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أهون أهل النار عذابا من له نعلان وشراكان من نار يغلي منهما دماغه كما يغلي المرجل ما يرى أن أحدا أشد منه عذابا وإنه لأهونهم عذابا ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      The Messenger of Allah (may peace be upon him) said: Verily the least suffering for the inhabitants of Fire would be for him who would have two shoes and two laces of Fire (on his feet), and with these would boil his brain as boils the cooking vessel, and he would think that he would not see anyone in a more grievous torment than him, whereas he would be in the least torment.",
      "chain": [
        "30201",
        "20318",
        "11060",
        "11049",
        "274"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت سالم بن أبي الجعد الغطفاني، قال سمعت النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      I heard the Messenger of Allah (may peace be upon him) say: Straighten your rows, or Allah would create dissension amongst you.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "274"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن سماك بن حرب، قال سمعت النعمان بن بشير، يقول كان رسول الله صلى الله عليه وسلم يسوي صفوفنا حتى كأنما يسوي بها القداح حتى رأى أنا قد عقلنا عنه ثم خرج يوما فقام حتى كاد يكبر فرأى رجلا باديا صدره من الصف فقال ‏\"‏ عباد الله لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      The Messenger of Allah (may peace-be upon him) used to straighten our rows as it lie were straightening an arrow with their help until be saw that we had learnt it from him. One day he came out, stood up (for prayer) and was about to say: Allah is the Greatest, when he saw a man, whose chest was bulging out from the row, so he said: Servants of Allah, you hint straighten your rows or Allah would create dissension amongst you.",
      "chain": [
        "30399",
        "30022",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "2065",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وإسحاق جميعا عن جرير، - قال يحيى أخبرنا جرير، - عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن، سالم مولى النعمان بن بشير عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يقرأ في العيدين وفي الجمعة ب ‏{‏ سبح اسم ربك الأعلى‏}‏ و ‏{‏ هل أتاك حديث الغاشية‏}‏ قال وإذا اجتمع العيد والجمعة في يوم واحد يقرأ بهما أيضا في الصلاتين.",
      "text_en": " Nu'man b. Bashir reported that the Messenger of Allah (may peace be upon him) used to recite on two 'Ids and in Friday prayer:                     \" Glorify The name of Thy Lord, the Most High\" (Surah lxxxvii.), and:\" Has there come to thee the news of the overwhelming event\" (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers.",
      "chain": [
        "30399",
        "20028",
        "20031",
        "4057",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "4178",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير الهمداني، حدثنا أبي، حدثنا زكرياء، عن الشعبي، عن النعمان بن بشير، قال سمعته يقول سمعت رسول الله صلى الله عليه وسلم يقول وأهوى النعمان بإصبعيه إلى أذنيه ‏\"‏ إن الحلال بين وإن الحرام بين وبينهما مشتبهات لا يعلمهن كثير من الناس فمن اتقى الشبهات استبرأ لدينه وعرضه ومن وقع في الشبهات وقع في الحرام كالراعي يرعى حول الحمى يوشك أن يرتع فيه ألا وإن لكل ملك حمى ألا وإن حمى الله محارمه ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله وإذا فسدت فسد الجسد كله ألا وهي القلب ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon himn) as having said this (and Nu'man) pointed towards his ears with his fingers): What is lawful is evident and what is unlawful is evident, and in between them are the things doubtful which many people do not know. So he who guards against doubtful things keeps his religion and honour blameless, and he who indulges in doubtful things indulges in fact in unlawful things, just as a shepherd who pastures his animals round a preserve will soon pasture them in it. Beware, every king has a preserve, and the things God his declaced unlawful are His preserves. Beware, in the body there is a piece of flesh; if it is sound, the whole body is sound and if it is corrupt the whole body is corrupt, and hearken it is the heart.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4180",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن مطرف، وأبي، فروة الهمداني ح وحدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن ابن عجلان، عن عبد الرحمن بن سعيد، كلهم عن الشعبي، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم بهذا الحديث غير أن حديث زكرياء أتم من حديثهم وأكثر ‏.‏",
      "text_en": " AI-Nu'man b. Bashir reported it from Allah's Apostle (may peace be upon him). The hadith narrated by Zakariya is, however, more complete and lengthy than the other ones.",
      "chain": [
        "30123",
        "20028",
        "11395",
        "30367",
        "20185",
        "10616",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4262",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن حميد بن عبد، الرحمن وعن محمد بن النعمان بن بشير، يحدثانه عن النعمان بن بشير، أنه قال إن أباه أتى به رسول الله صلى الله عليه وسلم فقال إني نحلت ابني هذا غلاما كان لي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أكل ولدك نحلته مثل هذا ‏\"‏ ‏.‏ فقال لا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فارجعه ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported that his father brought him to Allah's Messenger (may peace be upon him) and said:                      I have donated this slave of mine to my son. Allah's Messenger (may peace be upon him) said: Have you donated to every one of your sons (a slave) like this? He said: No. Thereupon Allah's Messenger (may peace he upon him) said: Then take him back.",
      "chain": [
        "30399",
        "11013",
        "10561",
        "274"
      ]
    },
    {
      "hadith_no": "4263",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا إبراهيم بن سعد، عن ابن شهاب، عن حميد بن، عبد الرحمن ومحمد بن النعمان عن النعمان بن بشير، قال أتى بي أبي إلى رسول الله صلى الله عليه وسلم فقال إني نحلت ابني هذا غلاما ‏.‏ فقال ‏\"‏ أكل بنيك نحلت ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      My father brought me to Allah's Messenger (may peace be upon him) and said: I have donated this slave to my son. whereupon he said: Have you made (such) donation to every one or your sons? He said: No. Thereupon he (the-Holy Prophet) said: Then take him back.",
      "chain": [
        "30399",
        "20150",
        "11013",
        "274"
      ]
    },
    {
      "hadith_no": "4265",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن هشام بن عروة، عن أبيه، قال حدثنا النعمان بن بشير، قال وقد أعطاه أبوه غلاما فقال له النبي صلى الله عليه وسلم ‏\"‏ ما هذا الغلام ‏\"‏ ‏.‏ قال أعطانيه أبي ‏.‏ قال ‏\"‏ فكل إخوته أعطيته كما أعطيت هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فرده ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported that his father had donated a slave to him. Allah's Apostle (may peace he upon him) said:                      Who is this slave (how have you come to possess it)? Thereupon he (Nu'man b. Bashir) said: My father has donated it to me, whereupon he said: Have all brothers (of yours) been given this gift as given to you? He said: No. Thereupon he (the Holy Prophet) said: Then return him.",
      "chain": [
        "30367",
        "20028",
        "11065",
        "10511",
        "274"
      ]
    },
    {
      "hadith_no": "4266",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، عن حصين، عن الشعبي، قال سمعت النعمان بن بشير، ح وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا أبو الأحوص، عن حصين، عن الشعبي، عن النعمان بن بشير، قال تصدق على أبي ببعض ماله فقالت أمي عمرة بنت رواحة لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم ‏.‏ فانطلق أبي إلى النبي صلى الله عليه وسلم ليشهده على صدقتي فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أفعلت هذا بولدك كلهم ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ اتقوا الله واعدلوا في أولادكم ‏\"‏ ‏.‏ فرجع أبي فرد تلك الصدقة ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      My father donated to me some of his property. My mother Amra bint Rawaha said: I shall not be pleased (with this act) until you make Allah's Messenger (may peace be upon him) a witness to it. My father went to Allah's Apostle (may peace be upon him) in order to make him the witness of the donation given to me. Allah's Messenger (may peace be upon him) said to him: Have you done the same with every son of yours? He said: No. Thereupon he (the Holy Prophet) said: Fear Allah, and observe equity in case of your children. My father returned and got back the gift.",
      "chain": [
        "30201",
        "20431",
        "15097",
        "11052",
        "274",
        "30399",
        "20327",
        "15097",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4268",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن أبي حيان، عن الشعبي، عن النعمان بن بشير، ح. وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا محمد بن بشر، حدثنا أبو حيان التيمي، عن الشعبي، حدثني النعمان بن بشير، أن أمه بنت رواحة، سألت أباه بعض الموهبة من ماله لابنها فالتوى بها سنة ثم بدا له فقالت لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم على ما وهبت لابني ‏.‏ فأخذ أبي بيدي وأنا يومئذ غلام فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أم هذا بنت رواحة أعجبها أن أشهدك على الذي وهبت لابنها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بشير ألك ولد سوى هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال ‏\"‏ أكلهم وهبت له مثل هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported that his mother bint Rawaha asked his (Nu'man's) father about donating some gifts from his property to his son. He deferred the matter by one year, and then set forth to do that. She (Nu'man's mother) said:                      I shall not be pleased unless you call Allah's Messenger (may peace be upon him) as witness to what you confer as a gift on your son. (Nu'man said): So father took hold of my hand and I was at that time a boy, and came to Allah's Messenger (may peace be upon him). and said: Allah's Messenger, the mother of this son (of mine), daughter of Rawaha wishes that I should call you witness to what I confer as gift to her son. Allah's Messenger (may pease be upon him) said: Bashir, have you any other son besides this (son of yours)? He said: Yes. He (the Holy Prophet) said: Have you given gifts to all of them like this? He said: No. Thereupon he (the Holy Prophet) said: Then call me not as witness, for I cannot be witness to an injustice.",
      "chain": [
        "30201",
        "20345",
        "11404",
        "11052",
        "274",
        "20352",
        "11404",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4270",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا ابن نمير، حدثني أبي، حدثنا إسماعيل، عن الشعبي، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألك بنون سواه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فكلهم أعطيت مثل هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir, reported that Allah's Messenger (may peace be upon him) had said:                      Have you, besides him, other sons? He said: Yes. Thereupon he (the Holy Prophet) said: Have you given gifts to all of them like this (as you have given to Nu'man)? He said: No. Thereupon he (the Holy Prophet) said: I cannot bear witness to an injustice.",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4271",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن عاصم الأحول، عن الشعبي، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم قال لأبيه ‏\"‏ لا تشهدني على جور ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) said to his father:                      Call me not as witness to an injustice.",
      "chain": [
        "30123",
        "20028",
        "11080",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4272",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، وعبد الأعلى، ح وحدثنا إسحاق، بن إبراهيم ويعقوب الدورقي جميعا عن ابن علية، - واللفظ ليعقوب - قال حدثنا إسماعيل، بن إبراهيم عن داود بن أبي هند، عن الشعبي، عن النعمان بن بشير، قال انطلق بي أبي يحملني إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله اشهد أني قد نحلت النعمان كذا وكذا من مالي ‏.‏ فقال ‏\"‏ أكل بنيك قد نحلت مثل ما نحلت النعمان ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فأشهد على هذا غيري - ثم قال - أيسرك أن يكونوا إليك في البر سواء ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir (Allah be pleased with them) reported:                      My father took me to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, bear witness that I have given such and such gift to Nu'man from my property, whereupon he (the Holy Prophet) said: Have you conferred upon all of your sons as you have conferred upon Nu'man? He said: No. Thereupon he (the Holy Prophet) said: Call someone else besides me as a witness. And he further said: Would it, please you that they (your children) should all behave virtuously towards you? He said: Yes. He (the Holy Prophet) said: Then don't do that (i e. don't give gift to one to the exclusion of others).",
      "chain": [
        "30170",
        "20259",
        "20246",
        "30123",
        "20208",
        "11585",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4273",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أزهر، حدثنا ابن عون، عن الشعبي، عن النعمان بن بشير، قال نحلني أبي نحلا ثم أتى بي إلى رسول الله صلى الله عليه وسلم ليشهده فقال ‏\"‏ أكل ولدك أعطيته هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أليس تريد منهم البر مثل ما تريد من ذا ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فإني لا أشهد ‏\"‏ ‏.‏ قال ابن عون فحدثت به محمدا فقال إنما تحدثنا أنه قال ‏\"‏ قاربوا بين أولادكم ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      My father conferred a gift upon me, and then brought me to Allah's Messenger (may peace be upon him) to make him a witness (to it). He (the Holy Prophet) said: Have you given such gift to every son of yours (as you have given to Nu'man)? He said: No. Thereupon he (the Holy Prophet) said: Don't you expect goodness from them as you expect from him? He said: Yes. of course. He (the Holy Prophet) said: I am not going to bear witness to it (as it is injustice). Ibn Aun (one of the narrators) said: I narrated this hadith to Muhammad (the other narrator) who said: Verily we narrated that lie (the Holy Prophet) had said: Observe equity amongst your children.",
      "chain": [
        "30185",
        "20206",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4979",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني حسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية بن سلام، عن  زيد بن سلام، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم فقال رجل ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج ‏.‏ وقال آخر ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام ‏.‏ وقال آخر الجهاد في سبيل الله أفضل مما قلتم ‏.‏ فزجرهم عمر وقال لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وهو يوم الجمعة ولكن إذا صليت الجمعة دخلت فاستفتيته فيما اختلفتم فيه ‏.‏ فأنزل الله عز وجل ‏{‏ أجعلتم سقاية الحاج وعمارة المسجد الحرام كمن آمن بالله واليوم الآخر‏}‏ الآية إلى آخرها ‏.‏",
      "text_en": " It has been narrated on the authority of Nu'man b. Bashir who said:                      As I was (sitting) near the pulpit of the Messenger of Allah (may peace be upon him), a man said: I do not care if, after embracing Islam, I do not do any good deed (except) distributing drinking water among the pilgrims. Another said: I do not care if, after embracing Islam, I do not do any good deed beyond maintenance service to the Sacred Mosque. Another said: Jihad in the way of Allah is better than what you have said. 'Umar reprimanded them and said: Don't raise your voices near the pulpit of the Messenger of Allah (may peace be upon him) on Friday. When prayer was over, I entered (the apartment of the Holy Prophet) and asked his verdict about the matter in which they had differed. (It was upon this that) Allah, the Almighty and Exalted, revealed the Qur'anic verse:\" Do you make the giving of drinking water to the pilgrims and the maintenance of the Sacred Mosque equal to (the service of those) who believe in Allah and the Last Day and strive hard in the cause of Allah. They are not equal in the sight of God. And Allah guides not the wrongdoing people\" (ix. 20). This tradition has been narrated on the authority of Nu'man b. Bashir through another chain of transmitters.",
      "chain": [
        "30335",
        "20401",
        "10912",
        "274"
      ]
    },
    {
      "hadith_no": "4980",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى بن حسان، حدثنا معاوية، أخبرني زيد، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث أبي توبة ‏.‏",
      "text_en": "",
      "chain": [
        "20300",
        "27",
        "15",
        "274"
      ]
    },
    {
      "hadith_no": "6751",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن الشعبي، عن  النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل المؤمنين في توادهم وتراحمهم وتعاطفهم مثل الجسد إذا اشتكى منه عضو تداعى له سائر الجسد بالسهر والحمى ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported Allah's Messenger (may peace be upon him) as saying:                      The similitude of believers in regard to mutual love, affection, fellow-feeling is that of one body; when any limb of it aches, the whole body aches, because of sleeplessness and fever.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "6752",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا إسحاق الحنظلي، أخبرنا جرير، عن مطرف، عن الشعبي، عن النعمان بن، بشير عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " Nu'man b. Bashir reported a hadith like this from Allah's Apostle (may peace be upon him).",
      "chain": [
        "20028",
        "11395",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "6753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، عن الأعمش، عن الشعبي، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمنون كرجل واحد إن اشتكى رأسه تداعى له سائر الجسد بالحمى والسهر ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported Allah's Messenger (may peace be upon him) as saying:                      The believers are like one person; if his head aches, the whole body aches with fever and sleeplessness.",
      "chain": [
        "30201",
        "30200",
        "20032",
        "11060",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "6754",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن عبد الله بن نمير، حدثنا حميد بن عبد الرحمن، عن الأعمش، عن خيثمة، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المسلمون كرجل واحد إن اشتكى عينه اشتكى كله وإن اشتكى رأسه اشتكى كله ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported that Muslims are like one body of a person; if the eye is sore, the whole body aches, and if the head aches, the whole body aches.",
      "chain": [
        "30212",
        "10561",
        "11060",
        "11332",
        "274"
      ]
    },
    {
      "hadith_no": "6755",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا ابن نمير، حدثنا حميد بن عبد الرحمن، عن الأعمش، عن الشعبي، عن النعمان، بن بشير عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Nu'man b. Bashir through another chain of transmitters.",
      "chain": [
        "30212",
        "10561",
        "11060",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "7650",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة قالا حدثنا أبو الأحوص، عن  سماك، قال سمعت النعمان بن بشير، يقول ألستم في طعام وشراب ما شئتم لقد رأيت نبيكم صلى الله عليه وسلم وما يجد من الدقل ما يملأ به بطنه ‏.‏ وقتيبة لم يذكر به ‏.‏",
      "text_en": " Nu'man b. Bashir said:                      Don't you eat and drink according to your heart's desire, whereas I saw that your Prophet (may peace be upon him) (at times) could not find even an inferior quality of the dates with which he could fill his belly? Qutaiba, however, did not make a mention of It.",
      "chain": [
        "30367",
        "30201",
        "20327",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن بشير بن ثابت، عن حبيب بن سالم، عن النعمان بن بشير، قال أنا أعلم الناس، بوقت هذه الصلاة صلاة العشاء الآخرة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     I am the one who is best informed of the time of this prayer, i.e. the night prayer. The Messenger of Allah (ﷺ) used to offer it at the hour when the moon went down on its third night.",
      "chain": [
        "30175",
        "20469",
        "11419",
        "14038",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "662",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن زكريا بن أبي زائدة، عن أبي القاسم الجدلي، قال سمعت النعمان بن بشير، يقول أقبل رسول الله صلى الله عليه وسلم على الناس بوجهه فقال ‏\"‏ أقيموا صفوفكم ‏\"‏ ‏.‏ ثلاثا ‏\"‏ والله لتقيمن صفوفكم أو ليخالفن الله بين قلوبكم ‏\"‏ ‏.‏ قال فرأيت الرجل يلزق منكبه بمنكب صاحبه وركبته بركبة صاحبه وكعبه بكعبه ‏.‏",
      "text_en": " Al-Nu’man b. Bashir said:                      the Messenger of Allah (ﷺ) paid attention to the people and said three times; straighten your rows (in prayer); by Allah, you must straighten your rows, or Allah will certainly put your faces in contrary directions. I then saw that every person stood in prayer keeping his shoulder close to that of the other, and his knee close to that of the other, and his ankle close to that of the other.",
      "chain": [
        "30203",
        "20032",
        "11338",
        "274"
      ]
    },
    {
      "hadith_no": "663",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن سماك بن حرب، قال سمعت النعمان بن بشير، يقول كان النبي صلى الله عليه وسلم يسوينا في الصفوف كما يقوم القدح حتى إذا ظن أن قد أخذنا ذلك عنه وفقهنا أقبل ذات يوم بوجهه إذا رجل منتبذ بصدره فقال ‏\"‏ لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏",
      "text_en": " Al-Nu’man b. Bashir said:                      the prophet (ﷺ) used to straighten us in the rows of prayer as the arrow is straightened, until he thought that we had learned it from him and understood it. One day he turned towards us, and shoulders in order, and say; Do not be irregular. And he would say: Allah and his Angels bless those who near the first rows.",
      "chain": [
        "20040",
        "20022",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا خالد بن الحارث، حدثنا حاتم، - يعني ابن أبي صغيرة - عن سماك، قال سمعت النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يسوي صفوفنا إذا قمنا للصلاة فإذا استوينا كبر ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Messenger of Allah (ﷺ) used to straighten our rows when we stood up to pray, and when we were straight, he said: Allah is most great (takbir).",
      "chain": [
        "30150",
        "20226",
        "11274",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "1122",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم كان يقرأ في العيدين ويوم الجمعة ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ هل أتاك حديث الغاشية ‏}‏ قال وربما اجتمعا في يوم واحد فقرأ بهما ‏.‏",
      "text_en": " Al-Nu'man b. Bashir said:                      The Messenger of Allah (ﷺ) used to recite at the two 'Ids (festivals) and on Friday, \"Glorify the name of your most high Lord.\" (87) and \"Has the story of the overwhelming reached you?\" (88) He said: When a festival ('Id) and a Friday coincided, he recited them both (at the two prayers).",
      "chain": [
        "30367",
        "20469",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "1123",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ضمرة بن سعيد المازني، عن عبيد الله بن عبد الله بن عتبة، أن الضحاك بن قيس، سأل النعمان بن بشير ماذا كان يقرأ به رسول الله صلى الله عليه وسلم يوم الجمعة على إثر سورة الجمعة فقال كان يقرأ ‏{‏ هل أتاك حديث الغاشية ‏}‏ ‏.‏",
      "text_en": " Al-Dahhak b. Qais asked al-Nu'man b. Bashir:                      What did the Messenger of Allah (ﷺ) recited on Friday after reciting the Surah al-Jumu'ah (62). He replied: He used to recite, \"Had the story of overwhelming event reached you ?\" (88).",
      "chain": [
        "20164",
        "20001",
        "11861",
        "11004",
        "225",
        "274"
      ]
    },
    {
      "hadith_no": "1193",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثني الحارث بن عمير البصري، عن أيوب السختياني، عن أبي قلابة، عن النعمان بن بشير، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم فجعل يصلي ركعتين ركعتين ويسأل عنها حتى انجلت ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     There was an eclipse of the sun in the time of the Prophet (ﷺ). He began to pray a series of pairs of rak'ahs enquiring about the sun (at the end of them) till it became clear.",
      "chain": [
        "30301",
        "20708",
        "11015",
        "11047",
        "274"
      ]
    },
    {
      "hadith_no": "1269",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا محمد بن شعيب، عن النعمان، عن مكحول، عن عنبسة بن أبي سفيان، قال قالت أم حبيبة زوج النبي صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم ‏\"‏ من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرم على النار ‏\"‏ ‏.‏ قال أبو داود رواه العلاء بن الحارث وسليمان بن موسى عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Umm Habibah:                     The Prophet (ﷺ) said: If anyone keeps on praying regularly four rak'ahs before and four after the noon prayer, he will not enter the Hell-fire.Abu Dawud said: Al-'Ala' bin Al-Harith and Sulaiman bin Musa reported it from Makhul with his chain, similarly.",
      "chain": [
        "38659",
        "20732",
        "274",
        "11066",
        "846"
      ]
    },
    {
      "hadith_no": "1479",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن منصور، عن ذر، عن يسيع الحضرمي، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم قال ‏\"‏ الدعاء هو العبادة ‏{‏ قال ربكم ادعوني أستجب لكم ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Prophet (ﷺ) said: Supplication (du'a') is itself the worship. (He then recited:) \"And your Lord said: Call on Me, I will answer you\" (xI.60).",
      "chain": [
        "30329",
        "20020",
        "11067",
        "11423",
        "274"
      ]
    },
    {
      "hadith_no": "3329",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا أبو شهاب، حدثنا ابن عون، عن الشعبي، قال سمعت النعمان بن بشير، - ولا أسمع أحدا بعده يقول - سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحلال بين وإن الحرام بين وبينهما أمور مشتبهات ‏\"‏ ‏.‏ وأحيانا يقول ‏\"‏ مشتبهة ‏\"‏ ‏.‏ ‏\"‏ وسأضرب لكم في ذلك مثلا إن الله حمى حمى وإن حمى الله ما حرم وإنه من يرع حول الحمى يوشك أن يخالطه وإنه من يخالط الريبة يوشك أن يجسر ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Nu'man b. Bashir:                     I heard the Messenger of Allah (ﷺ) say: What is lawful is clear and what is unlawful is clear, but between them are certain doubtful things. I give you an example for this. Allah has a preserve, and Allah's preserve is the things He has declared unlawful. He who pastures (his animals) round the preserve will soon fall into it. He who falls into doubtful things will soon be courageous.",
      "chain": [
        "30184",
        "11613",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3330",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، حدثنا زكريا، عن عامر الشعبي، قال سمعت النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم يقول بهذا الحديث قال ‏\"‏ وبينهما مشبهات لا يعلمها كثير من الناس فمن اتقى الشبهات استبرأ عرضه ودينه ومن وقع في الشبهات وقع في الحرام ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Nu'man b. Bashir:                     I heard Messenger of Allah (ﷺ) say: But between them are certain doubtful things which many people do not recognize. He who guards against doubtful things keeps his religion and his honor blameless, but he who falls into doubtful things falls into what is unlawful.",
      "chain": [
        "30309",
        "20347",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3543",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن هشام بن عروة، عن أبيه، حدثني النعمان بن بشير، قال أعطاه أبوه غلاما فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما هذا الغلام ‏\"‏ ‏.‏ قال غلامي أعطانيه أبي ‏.‏ قال ‏\"‏ فكل إخوتك أعطى كما أعطاك ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Nu'man b. Bashir:                     That his father had given him a slave. The Messenger of Allah (ﷺ) said: What is this slave ? He replied: This is my slave which my father has given me. He asked: Has he given all your brothers the same as he has given you? He replied: No. He then said: Return it, then.",
      "chain": [
        "30203",
        "20028",
        "11065",
        "10511",
        "274"
      ]
    },
    {
      "hadith_no": "3544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن حاجب بن المفضل بن المهلب، عن أبيه، قال سمعت النعمان بن بشير، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ اعدلوا بين أولادكم اعدلوا بين أبنائكم ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Prophet (ﷺ) said: Act equally between your children; Act equally between your sons.",
      "chain": [
        "20193",
        "20022",
        "274"
      ]
    },
    {
      "hadith_no": "3676",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يحيى بن آدم، حدثنا إسرائيل، عن إبراهيم بن مهاجر، عن الشعبي، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من العنب خمرا وإن من التمر خمرا وإن من العسل خمرا وإن من البر خمرا وإن من الشعير خمرا ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Prophet (ﷺ) said: from grapes wine is made, from dried dates wine is made, from honey wine is made, from wheat wine is made, from barley wine is made.",
      "chain": [
        "30115",
        "20364",
        "20311",
        "10739",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3677",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مالك بن عبد الواحد أبو غسان، حدثنا معتمر، قال قرأت على الفضيل بن ميسرة عن أبي حريز، أن عامرا، حدثه أن النعمان بن بشير قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الخمر من العصير والزبيب والتمر والحنطة والشعير والذرة وإني أنهاكم عن كل مسكر ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     I heard the Messenger of Allah (ﷺ) say: Wine is made from grape-syrup, raisins, dried dates, wheat, barley, millet, and I forbid you from every intoxicant.",
      "chain": [
        "20288",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن رافع النيسابوري، حدثنا إبراهيم بن عمر الصنعاني، قال سمعت النعمان، يقول عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل مخمر خمر وكل مسكر حرام ومن شرب مسكرا بخست صلاته أربعين صباحا فإن تاب تاب الله عليه فإن عاد الرابعة كان حقا على الله أن يسقيه من طينة الخبال ‏\"‏ ‏.‏ قيل وما طينة الخبال يا رسول الله قال ‏\"‏ صديد أهل النار ومن سقاه صغيرا لا يعرف حلاله من حرامه كان حقا على الله أن يسقيه من طينة الخبال ‏\"‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     The Messenger of Allah (ﷺ) said: Every intoxicant is khamr (wine) and every intoxicant is forbidden. If anyone drinks wine, Allah will not accept prayer from him for forty days, but if he repents, Allah will accept his repentance. If he repeats it a fourth time, it is binding on Allah that He will give him tinat al-khabal to drink.  He was asked: What is tinat al-khabal, Messenger of Allah?  He replied: Discharge of wounds, flowing from the inhabitants of Hell. If anyone serves it to a minor who does not distinguish between the lawful and the unlawful, it is binding on Allah that He will give him to drink the discharge of wounds, flowing from the inhabitants of Hell.",
      "chain": [
        "30375",
        "28015",
        "274",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4459",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن أبي بشر، عن خالد بن عرفطة، عن حبيب بن سالم، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم في الرجل يأتي جارية امرأته قال ‏\"‏ إن كانت أحلتها له جلد مائة وإن لم تكن أحلتها له رجمته ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Prophet (ﷺ) said: about a man who had (unlawful) intercourse with his wife's slave girl: If she made her lawful for him, he will be flogged one hundred lashes; if she did not make her lawful for him, I shall stone him.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11419",
        "18242",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "4999",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج بن محمد، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن العيزار بن حريث، عن النعمان بن بشير، قال استأذن أبو بكر رحمة الله عليه على النبي صلى الله عليه وسلم فسمع صوت عائشة عاليا فلما دخل تناولها ليلطمها وقال لا أراك ترفعين صوتك على رسول الله صلى الله عليه وسلم فجعل النبي صلى الله عليه وسلم يحجزه وخرج أبو بكر مغضبا فقال النبي صلى الله عليه وسلم حين خرج أبو بكر ‏\"‏ كيف رأيتني أنقذتك من الرجل ‏\"‏ ‏.‏ قال فمكث أبو بكر أياما ثم استأذن على رسول الله صلى الله عليه وسلم فوجدهما قد اصطلحا فقال لهما أدخلاني في سلمكما كما أدخلتماني في حربكما ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قد فعلنا قد فعلنا ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     When AbuBakr asked the permission of the Prophet (ﷺ) to come in, he heard Aisha speaking in a loud voice.  So when he entered, he caught hold of her in order to slap her, and said: Do I see you raising your voice to the Messenger of Allah? The Prophet (ﷺ) began to prevent him and AbuBakr went out angry. The Prophet (ﷺ) said when AbuBakr went out: You see I rescued you from the man.  AbuBakr waited for some days, then asked permission of the Messenger of Allah (ﷺ) to enter, and found that they had made peace with each other. He said to them: Bring me into your peace as you brought me into your war.  The Prophet (ﷺ) said: We have done so: we have done so.",
      "chain": [
        "30020",
        "20381",
        "10846",
        "11049",
        "10808",
        "274"
      ]
    },
    {
      "hadith_no": "165",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي بشر، عن بشير بن ثابت، عن حبيب بن سالم، عن النعمان بن بشير، قال أنا أعلم الناس، بوقت هذه الصلاة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     \"I am the most knowledgeable among the people about the prescribed time of this prayer: Allah's Messenger would pray it when the moon set on the third (of the month).\"",
      "chain": [
        "30450",
        "20469",
        "11419",
        "14038",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "166",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا عبد الرحمن بن مهدي، عن أبي عوانة، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى روى هذا الحديث، هشيم عن أبي بشر، عن حبيب بن سالم، عن النعمان بن بشير، ‏.‏ ولم يذكر فيه هشيم عن بشير بن ثابت، ‏.‏ وحديث أبي عوانة أصح عندنا لأن يزيد بن هارون روى عن شعبة، عن أبي بشر، نحو رواية أبي عوانة ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     A similar narration (from another chain linking to) this chain is also reported.",
      "chain": [
        "30369",
        "20033",
        "20469",
        "20468",
        "11419",
        "11837",
        "274",
        "14038"
      ]
    },
    {
      "hadith_no": "227",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن سماك بن حرب، عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يسوي صفوفنا فخرج يوما فرأى رجلا خارجا صدره عن القوم فقال ‏\"‏ لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏ قال وفي الباب عن جابر بن سمرة والبراء وجابر بن عبد الله وأنس وأبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث النعمان بن بشير حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من تمام الصلاة إقامة الصف ‏\"‏ ‏.‏ وروي عن عمر أنه كان يوكل رجالا بإقامة الصفوف فلا يكبر حتى يخبر أن الصفوف قد استوت ‏.‏ وروي عن علي وعثمان أنهما كانا يتعاهدان ذلك ويقولان استووا ‏.‏ وكان علي يقول تقدم يا فلان تأخر يا فلان ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     \"Allah's Messenger would straighten our lines. One day he came out and saw a man whose chest was protruding from the people, so he said: 'You must straighten your lines, or Allah will cause disagreement to occur among your faces.\"",
      "chain": [
        "30367",
        "20469",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "533",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، قال كان النبي صلى الله عليه وسلم يقرأ في العيدين وفي الجمعة ب  ‏(‏ سبح اسم ربك الأعلى ‏)‏ و ‏(‏هل أتاك حديث الغاشية ‏)‏ وربما اجتمعا في يوم واحد فيقرأ بهما ‏.‏ قال وفي الباب عن أبي واقد وسمرة بن جندب وابن عباس ‏.‏ قال أبو عيسى حديث النعمان بن بشير حديث حسن صحيح ‏.‏ وهكذا روى سفيان الثوري ومسعر عن إبراهيم بن محمد بن المنتشر نحو حديث أبي عوانة ‏.‏ وأما سفيان بن عيينة فيختلف عليه في الرواية يروى عنه عن إبراهيم بن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن أبيه عن النعمان بن بشير ‏.‏ ولا نعرف لحبيب بن سالم رواية عن أبيه ‏.‏ وحبيب بن سالم هو مولى النعمان بن بشير وروى عن النعمان بن بشير أحاديث ‏.‏ وقد روي عن ابن عيينة عن إبراهيم بن محمد بن المنتشر نحو رواية هؤلاء ‏.‏ وروي عن النبي صلى الله عليه وسلم أنه كان يقرأ في صلاة العيدين ب ‏(‏اقتربت الساعة ‏)‏ وبه يقول الشافعي ‏.‏",
      "text_en": " An-Numan bin Bashir narrated:                     \"For the two Eid and the Friday prayer, the Prophet would recite: Glorify the Name of your Lord, the Most High, and Has there come to you the narration of the overwhelming? And sometimes they would occur on he same day, so he would recite the two of them.\"",
      "chain": [
        "30367",
        "20469",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، أنبأنا حماد بن زيد، عن مجالد، عن الشعبي، عن النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلال بين والحرام بين وبين ذلك أمور مشتبهات لا يدري كثير من الناس أمن الحلال هي أم من الحرام فمن تركها استبراء لدينه وعرضه فقد سلم ومن واقع شيئا منها يوشك أن يواقع الحرام كما أنه من يرعى حول الحمى يوشك أن يواقعه ألا وإن لكل ملك حمى ألا وإن حمى الله محارمه ‏\"‏ ‏.‏",
      "text_en": " An-Numan bin Bashir narrated that the Messenger of Allah (S) said:                      \"The lawful is clear and the unlawful is clear, and between that are matters that are doubtful (not clear); many of the people do not know whether it is lawful or unlawful. So whoever leaves it to protect his religion and his honor, then he will be safe, and whoever falls into something from them, then he soon will have fallen into the unlawful. Just like if someone grazes (his animals) around a sanctuary, he would soon wind up in it. Indeed for every king is a sanctuary (pasture), and indeed Allah's sanctuary is what He made unlawful.\"",
      "chain": [
        "30367",
        "20022",
        "10820",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن زكريا بن أبي زائدة، عن الشعبي، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه غير واحد عن الشعبي عن النعمان بن بشير ‏.‏",
      "text_en": " Another chain of narration from the Prophet (ﷺ) and its meaning is similarAbu 'Eisa said:                      This Hadith is Hasan Sahih, it has been reported by more than one from Ash-Sha'bi, from An-Nu'man bin Bashir.",
      "chain": [
        "30480",
        "20032",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "1367",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا نصر بن علي، وسعيد بن عبد الرحمن المخزومي المعنى الواحد، قالا حدثنا سفيان، عن الزهري، عن حميد بن عبد الرحمن، وعن محمد بن النعمان بن بشير، يحدثان عن النعمان بن بشير، أن أباه، نحل ابنا له غلاما فأتى النبي صلى الله عليه وسلم يشهده فقال ‏\"‏ أكل ولدك نحلته مثل ما نحلت هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن النعمان بن بشير ‏.‏ والعمل على هذا عند بعض أهل العلم يستحبون التسوية بين الولد حتى قال بعضهم يسوي بين ولده حتى في القبلة ‏.‏ وقال بعضهم يسوي بين ولده في النحل والعطية الذكر والأنثى سواء ‏.‏ وهو قول سفيان الثوري ‏.‏ وقال بعضهم التسوية بين الولد أن يعطى الذكر مثل حظ الأنثيين مثل قسمة الميراث ‏.‏ وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Narrated An-Nu'man bin Bashir:                     That his father gave a slave to a son of his. So he went to the Prophet (ﷺ) to have him witness it. He (ﷺ) said: 'Have you give a gift similar to this one to all of your sons?' He replied:'No'. So he said: 'Then take him back.'\"",
      "chain": [
        "30395",
        "20012",
        "11013",
        "10561",
        "274"
      ]
    },
    {
      "hadith_no": "1452",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا علي بن حجر، حدثنا هشيم، عن أبي بشر، عن حبيب بن سالم، عن النعمان بن بشير، نحوه ‏.‏ قال وفي الباب عن سلمة بن المحبق، ‏.‏ قال أبو عيسى حديث النعمان في إسناده اضطراب ‏.‏ قال سمعت محمدا يقول لم يسمع قتادة من حبيب بن سالم هذا الحديث إنما رواه عن خالد بن عرفطة ‏.‏ ويروى عن قتادة أنه قال كتب به إلى حبيب بن سالم ‏.‏ وأبو بشر لم يسمع من حبيب بن سالم هذا أيضا إنما رواه عن خالد بن عرفطة ‏.‏ قال أبو عيسى وقد اختلف أهل العلم في الرجل يقع على جارية امرأته فروي عن غير واحد من أصحاب النبي صلى الله عليه وسلم منهم علي وابن عمر أن عليه الرجم ‏.‏ وقال ابن مسعود ليس عليه حد ولكن يعزر ‏.‏ وذهب أحمد وإسحاق إلى ما روى النعمان بن بشير عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " (Another chain) from An-Nu'man bin Bashir with similar.",
      "chain": [
        "20387",
        "20468",
        "11419",
        "11837",
        "274",
        "5071",
        "20278"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا إسرائيل، حدثنا إبراهيم بن مهاجر، عن عامر الشعبي، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الحنطة خمرا ومن الشعير خمرا ومن التمر خمرا ومن الزبيب خمرا ومن العسل خمرا ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated An-Nu'man bin Bashir:                     That the Messenger of Allah (ﷺ) said: \"Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey.\"He said: There are narrations on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.",
      "chain": [
        "11222",
        "30388",
        "20311",
        "10739",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2173",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، حدثنا الأعمش، عن الشعبي، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل القائم على حدود الله والمدهن فيها كمثل قوم استهموا على سفينة في البحر فأصاب بعضهم أعلاها وأصاب بعضهم أسفلها فكان الذين في أسفلها يصعدون فيستقون الماء فيصبون على الذين في أعلاها فقال الذين في أعلاها لا ندعكم تصعدون فتؤذوننا فقال الذين في أسفلها فإنا ننقبها من أسفلها فنستقي فإن أخذوا على أيديهم فمنعوهم نجوا جميعا وإن تركوهم غرقوا جميعا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " An-Nu'man bin Bashir narrated that the Messenger of Allah (s.a.w) said:                     \"The parable of the one who upholds Allah's laws and the one who breaches them, is that of a people who drew lots on a ship at sea. Some of them got the upper part, and some of them the lower part. Those on the lower part ascended to get water, spilling it upon those upper part. So those in the upper part say: 'We will not leave you to come up here and bother us.' Then those on the lower part say: 'We should make a hole in the lower part, so we can get water.' If they take them by the hand and stop them, then they will save all of them, and if they leave them, they will all drown.\"'",
      "chain": [
        "30242",
        "20354",
        "11060",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2372",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، قال سمعت النعمان بن بشير، يقول ألستم في طعام وشراب ما شئتم لقد رأيت نبيكم صلى الله عليه وسلم وما يجد من الدقل ما يملأ بطنه ‏.‏ قال وهذا حديث صحيح ‏.‏ قال أبو عيسى وروى أبو عوانة وغير واحد عن سماك بن حرب نحو حديث أبي الأحوص ‏.‏ وروى شعبة هذا الحديث عن سماك عن النعمان بن بشير عن عمر ‏.‏",
      "text_en": " Simak bin Harb said:                     \"I heard An-Nu'man bin Bashir saying: 'Do you (people) not have what you wish of food and drink?' I have seen your Prophet and he did not have even enough Daqal to fill his stomach.'\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وهب بن جرير، عن شعبة، عن أبي إسحاق، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أهون أهل النار عذابا يوم القيامة رجل في إخمص قدميه جمرتان يغلي منهما دماغه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن العباس بن عبد المطلب وأبي سعيد الخدري وأبي هريرة ‏.‏",
      "text_en": " An-Numan bin Bashir narrated that the Messenger Of Allah (s.a.w) said:                     \"Indeed the person among the inhabitants of the Fire punished least [on the Day of Judgment] is a man who has two coals beneath his feet, which cause his brain to boil.\"",
      "chain": [
        "30277",
        "20298",
        "20020",
        "11049",
        "274"
      ]
    },
    {
      "hadith_no": "3124",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا حماد بن سلمة، عن أشعث بن عبد الرحمن الجرمي، عن أبي قلابة، عن أبي الأشعث الجرمي، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله كتب كتابا قبل أن يخلق السموات والأرض بألفى عام أنزل منه آيتين ختم بهما سورة البقرة ولا يقرآن في دار ثلاث ليال فيقربها شيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated An-Nu'man bin Bashir:                     that the Prophet (ﷺ) said: \"Indeed Allah wrote in a book two thousand years before He created the heavens and the earth, and He sent down two Ayat from it to end Surat Al-Baqarah with. If they are recited for three nights in a home, no Shaitan shall come near it.\"",
      "chain": [
        "30160",
        "20033",
        "20021",
        "24022",
        "11047",
        "274"
      ]
    },
    {
      "hadith_no": "3232",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن ذر، عن يسيع الكندي، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم في قوله ‏:‏ ‏(‏وقال ربكم ادعوني أستجب لكم ‏)‏ قال ‏\"‏ الدعاء هو العبادة ‏\"‏ ‏.‏ وقرأ ‏:‏‏(‏ وقال ربكم ادعوني أستجب لكم ‏)‏ إلى قوله ‏(‏ داخرين ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated An-Nu'man bin Bashir:                     from the Prophet (ﷺ) regarding Allah's saying: Your Lord said: Invoke Me, I shall respond to you (40:60, it appears that the author intended to apply it to Al-Baqarah 2:186). - he said: \"The supplication is the worship.\" And he recited: 'Your Lord said: Invoke Me, I shall respond to you.' up to His saying: 'in humiliation.'\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11423",
        "274"
      ]
    },
    {
      "hadith_no": "3555",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن منصور، والأعمش، عن ذر، عن يسيع الحضرمي، عن النعمان بن بشير، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الدعاء هو العبادة ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏ وقال ربكم ادعوني أستجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين ‏)‏ قال أبو عيسى ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated An-Nu'man bin Bashir:                     that the Prophet (ﷺ) said: \"Supplication is the worship.\" Then he recited: 'And your Lord said: 'Call upon Me, I will answer you. Verily, those who scorn my My worship, they will surely enter Hell in humiliation (43:72).'\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11067",
        "11060",
        "11423",
        "19885",
        "274"
      ]
    },
    {
      "hadith_no": "3372",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن الأعمش، عن ذر، عن يسيع، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم قال ‏\"‏ الدعاء هو العبادة ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏وقال ربكم ادعوني أستجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين ‏)‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه منصور والأعمش عن ذر ولا نعرفه إلا من حديث ذر ‏.‏ هو ذر بن عبد الله الهمداني ثقة والد عمر بن ذر ‏.‏",
      "text_en": " An-Nu’man bin Bashir narrated that:                     The Prophet said: “The supplication, is worship.” Then he recited: And Your Lord said: “Call upon me, I will respond to you. Verily, those who scorn My worship, they will surely enter Hell humiliated.",
      "chain": [
        "30242",
        "20201",
        "11060",
        "11423",
        "19885",
        "274"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا حجين بن المثنى، حدثنا الليث بن سعد، عن معاوية بن صالح، عن ربيعة بن يزيد، عن عبد الملك بن عامر، عن النعمان بن بشير، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ يا عثمان إنه لعل الله يقمصك قميصا فإن أرادوك على خلعه فلا تخلعه لهم ‏\"‏ ‏.‏ قال وفي الحديث قصة طويلة ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) said: \"O 'Uthman! Indeed Allah may give you a shirt, and if they wish that you take it off, do not take it off for them.\"",
      "chain": [
        "30277",
        "20382",
        "20023",
        "20675",
        "11414",
        "274",
        "53"
      ]
    },
    {
      "hadith_no": "205",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا عبد الله بن يوسف، قال حدثنا الهيثم بن حميد، قال أخبرني النعمان، والأوزاعي، وأبو معيد - وهو حفص بن غيلان - عن الزهري، قال أخبرني عروة بن الزبير، وعمرة بنت عبد الرحمن، عن عائشة، قالت استحيضت أم حبيبة بنت جحش امرأة عبد الرحمن بن عوف وهي أخت زينب بنت جحش فاستفتت رسول الله صلى الله عليه وسلم فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إن هذه ليست بالحيضة ولكن هذا عرق فإذا أدبرت الحيضة فاغتسلي وصلي وإذا أقبلت فاتركي لها الصلاة ‏\"‏ ‏.‏ قالت عائشة فكانت تغتسل لكل صلاة وتصلي وكانت تغتسل أحيانا في مركن في حجرة أختها زينب وهي عند رسول الله صلى الله عليه وسلم حتى أن حمرة الدم لتعلو الماء وتخرج فتصلي مع رسول الله صلى الله عليه وسلم فما يمنعها ذلك من الصلاة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Umm Habibah bint Jahsh- the wife of 'Abdur-Rahman bin 'Awf and the sister of Zainab bint Jahsh - suffered Istihadah (non-mentrual vaginal bleeding).\" She said: \"She consulted the Messenger of Allah (ﷺ) and the Messenger of Allah (ﷺ) said to her: 'That is not menstruation, rather that is a vein. When you period goes, perform Ghusl and pray, and when it comes, stop praying (for that period).'\" 'Aishah said: \"She used to perform Ghusl for every prayer and pray. Sometimes she would perform Ghusl in a washtub in the room of her sister Zainab when she was with the Messenger of Allah (ﷺ) and the water would turn red with blood, then she would go out and pray with the Messenger of Allah (ﷺ). That did not stop her from praying.\"",
      "chain": [
        "30583",
        "30355",
        "20744",
        "274",
        "20024",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "533",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن رقبة، عن جعفر بن إياس، عن حبيب بن سالم، عن النعمان بن بشير، قال أنا أعلم الناس، بميقات هذه الصلاة عشاء الآخرة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                      \"I am the most knowledgeable of people about the time of the 'Isha' prayer. The Prophet (ﷺ) used to pray it when the moon set on the third night of the month.\"",
      "chain": [
        "20028",
        "11419",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا عفان، قال حدثنا أبو عوانة، عن أبي بشر، عن بشير بن ثابت، عن حبيب بن سالم، عن النعمان بن بشير، قال والله إني لأعلم الناس بوقت هذه الصلاة صلاة العشاء الآخرة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                      \"By Allah, I am the most knowledgeable of people about the time of the 'Isha' prayers. The Prophet (ﷺ) used to pray it when the moon set on the third night of the month.\"",
      "chain": [
        "11524",
        "30106",
        "20469",
        "11419",
        "14038",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "810",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال أنبأنا أبو الأحوص، عن سماك، عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يقوم الصفوف كما تقوم القداح فأبصر رجلا خارجا صدره من الصف فلقد رأيت النبي صلى الله عليه وسلم يقول ‏\"‏ لتقيمن صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Numan bin Bashir said:                      \"The Messenger of Allah (ﷺ) used to straighten the rows like shaft of an arrow is straightened before the head is attached to it. He saw a man whose chest was sticking out from the row. I saw the Messenger of Allah (ﷺ) say: 'Make your rows straight or Allah will cause your faces to be deformed.\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن ضمرة بن سعيد، عن عبيد الله بن عبد الله، أن الضحاك بن قيس، سأل النعمان بن بشير ماذا كان رسول الله صلى الله عليه وسلم يقرأ يوم الجمعة على إثر سورة الجمعة قال كان يقرأ ‏{‏ هل أتاك حديث الغاشية ‏}‏ ‏.‏",
      "text_en": " Ad-Dahhak bin Qais asked An-Nu'man bin Bashir:                     \"What did the Messenger of Allah (ﷺ) use to recite on Friday after Surat Al-Jumu'ah?\" He said: \"He used to recite: 'Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?'\"",
      "chain": [
        "30367",
        "20001",
        "11861",
        "11004",
        "225",
        "274"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، أن إبراهيم بن محمد بن المنتشر، أخبره قال سمعت أبي يحدث، عن حبيب بن سالم، عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يقرأ في الجمعة ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و‏{‏ هل أتاك حديث الغاشية ‏}‏ وربما اجتمع العيد والجمعة فيقرأ بهما فيهما جميعا ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                     \"The Messenger of Allah (ﷺ) used to recite 'Glorify the name of your Lord, the Most High' and 'Has there come to you the narration of the overwhelming (i.e. the day of resurrection)?' in the Jumu'ah prayer, and sometimes 'Eid and jumu'ah would fall on the same day, and he would recite them in both 'Eid and jumu'ah prayer.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "1485",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الوهاب، قال حدثنا خالد، عن أبي قلابة، عن النعمان بن بشير، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم فخرج يجر ثوبه فزعا حتى أتى المسجد فلم يزل يصلي بنا حتى انجلت فلما انجلت قال ‏\"‏ إن ناسا يزعمون أن الشمس والقمر لا ينكسفان إلا لموت عظيم من العظماء وليس كذلك إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته ولكنهما آيتان من آيات الله عز وجل إن الله عز وجل إذا بدا لشىء من خلقه خشع له فإذا رأيتم ذلك فصلوا كأحدث صلاة صليتموها من المكتوبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                     \"The sun eclipsed during the time of the Messenger of Allah (ﷺ) and he rushed out, dragging his cloak until he came to the masjid. He continued leading us in prayer until the eclipse ended. When it ended, he said: 'People claim that the eclipse of the sun and moon only happen when a great man dies, but that is not so. Eclipses of the sun and the moon do not happen for the death or birth of anyone, but they are signs from Allah (SWT), the Mighty and Sublime. When Allah, the Mighty and Sublime, manifests Himself to anything of His creation, it humbles itself before Him, so if you see that then pray like the last obligatory prayer you did before that.'\"",
      "chain": [
        "30160",
        "20259",
        "11282",
        "11047",
        "274"
      ]
    },
    {
      "hadith_no": "1488",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن المثنى، عن معاذ بن هشام، قال حدثني أبي، عن قتادة، عن أبي قلابة، عن النعمان بن بشير، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا خسفت الشمس والقمر فصلوا كأحدث صلاة صليتموها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that :                     The Prophet (ﷺ) said: \"If there is an eclipse of the sun or the moon, pray like the last obligatory prayer you did before that.\"",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11019",
        "11047",
        "274"
      ]
    },
    {
      "hadith_no": "1489",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا أبو نعيم، عن الحسن بن صالح، عن عاصم الأحول، عن أبي قلابة، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم صلى حين انكسفت الشمس مثل صلاتنا يركع ويسجد ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that:                     The Messenger of Allah (ﷺ) prayed when there was an eclipse of the sun like our prayer, bowing and prostrating.",
      "chain": [
        "30185",
        "20348",
        "20647",
        "11080",
        "11047",
        "274"
      ]
    },
    {
      "hadith_no": "1490",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن الحسن، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم أنه خرج يوما مستعجلا إلى المسجد وقد انكسفت الشمس فصلى حتى انجلت ثم قال ‏\"‏ إن أهل الجاهلية كانوا يقولون إن الشمس والقمر لا ينخسفان إلا لموت عظيم من عظماء أهل الأرض وإن الشمس والقمر لا ينخسفان لموت أحد ولا لحياته ولكنهما خليقتان من خلقه يحدث الله في خلقه ما يشاء فأيهما انخسف فصلوا حتى ينجلي أو يحدث الله أمرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that :                     The Prophet (ﷺ) came rushing out to the masjid one day when the sun eclipsed, and he prayed until the eclipse ended, then he said: \"The people of Jahilliyyah used to say that eclipses of the sun and the moon only happened when some great man on earth died. But eclipses of the sun and the moon do not happen for the death or birth of anyone. Rather they are two of the creations of Allah (SWT) and Allah (SWT) causes to happen in His creation what He wills. Whichever of them becomes eclipsed, pray until it is over or Allah (SWT) causes something to happen.\"",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11016",
        "274"
      ]
    },
    {
      "hadith_no": "1568",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم كان يقرأ في العيدين ويوم الجمعة ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و{‏ هل أتاك حديث الغاشية ‏}‏ وربما اجتمعا في يوم واحد فيقرأ بهما ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that:                     The Messenger of Allah (ﷺ) used to recite on the two 'Eids and on Friday: \"GLorify the Name of Your Lord, the Most High\" and \"Has there come to you the narration of The Overwhelming?\" Sometimes the two ('Eid and Jumu'ah) occurred on the same day, and he would recite them (these two Surahs).",
      "chain": [
        "30367",
        "20469",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرني محمد بن قدامة، عن جرير، عن إبراهيم بن محمد بن المنتشر، قلت عن أبيه، قال نعم عن حبيب بن سالم، عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يقرأ في الجمعة والعيد ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ هل أتاك حديث الغاشية ‏}‏ وإذا اجتمع الجمعة والعيد في يوم قرأ بهما ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                     \"The Messenger of Allah (ﷺ) used to recite: 'Glorify the Name of your Lord, the Most High' and \"Has there come to you the narration of The Overwhelming?', on Friday and on 'Eid, and when Friday and 'Eid converged, he would recite them both.\"",
      "chain": [
        "20028",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "1606",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني معاوية بن صالح، قال حدثني نعيم بن زياد أبو طلحة، قال سمعت النعمان بن بشير، على منبر حمص يقول قمنا مع رسول الله صلى الله عليه وسلم في شهر رمضان ليلة ثلاث وعشرين إلى ثلث الليل الأول ثم قمنا معه ليلة خمس وعشرين إلى نصف الليل ثم قمنا معه ليلة سبع وعشرين حتى ظننا أن لا ندرك الفلاح وكانوا يسمونه السحور ‏.‏",
      "text_en": " Nu'aim bin Ziyad Abu Talhah said:                     \"I heard An-Nu'man bin Bashir on the minbar in Hims saying: \"We prayed Qiyam with the Messenger of Allah (ﷺ) during Ramadan on the night of the twenty-third until one-third of the night had passed, then we prayed Qiyam with him on the night of the twenty-fifth until one-half of the night had passed, then we prayed Qiyam with him on the night of the twenty-seventh until we thought that we would miss Al-Falah- that is what they used to call suhur.\"",
      "chain": [
        "38022",
        "20650",
        "20675",
        "274"
      ]
    },
    {
      "hadith_no": "3360",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن أبي بشر، عن خالد بن عرفطة، عن حبيب بن سالم، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم في الرجل يأتي جارية امرأته قال ‏\"‏ إن كانت أحلتها له جلدته مائة وإن لم تكن أحلتها له رجمته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that the Prophet said, concerning a man who had intercourse with his wife's slave woman:                      \"If she let him do that, I will flog him with one hundred stripes , and if she did not let him, I will stone him (to death).\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "18242",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "3361",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا أبان، عن قتادة، عن خالد بن عرفطة، عن حبيب بن سالم، عن النعمان بن بشير، أن رجلا، يقال له عبد الرحمن بن حنين وينبز قرقورا أنه وقع بجارية امرأته فرفع إلى النعمان بن بشير فقال لأقضين فيها بقضية رسول الله صلى الله عليه وسلم إن كانت أحلتها لك جلدتك وإن لم تكن أحلتها لك رجمتك بالحجارة فكانت أحلتها له فجلد مائة ‏.‏ قال قتادة فكتبت إلى حبيب بن سالم فكتب إلى بهذا ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that a man called 'Abdur-Rahman bin Hunain or Yunbaz Qurqur had intercourse with his wife's slave woman, and it was brought to An-Nu'man bin Bashir. He said:                      \"I will pass the same judgment concerning her as the Messenger of Allah did. If she let you do that, I will flog you, but if she did not let you do that, I will stone you (to death).\" She had let him do that so he flogged him with one hundred stripes. (One of the narrators) Qatadah said: \"I wrote to Habib bin Salim and he wrote back to me with this information.\"",
      "chain": [
        "30172",
        "20218",
        "20577",
        "11019",
        "18242",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "3362",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أبو داود، قال حدثنا عارم، قال حدثنا حماد بن سلمة، عن سعيد بن أبي عروبة، عن قتادة، عن حبيب بن سالم، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم قال في رجل وقع بجارية امرأته ‏\"‏ إن كانت أحلتها له فأجلده مائة وإن لم تكن أحلتها له فأرجمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that the Messenger of Allah said, concerning a man who had intercourse with his wife's slave woman:                      \"If she let him do that, I will flog him with one hundred stripes, and if she did not let him do that, I will stone him (to death).\"",
      "chain": [
        "30002",
        "20283",
        "20021",
        "11073",
        "11019",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "3672",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن الزهري، عن حميد، ح وأنبأنا محمد بن منصور، عن سفيان، قال سمعناه من الزهري، أخبرني حميد بن عبد الرحمن، ومحمد بن النعمان، عن النعمان بن بشير، أن أباه، نحله غلاما فأتى النبي صلى الله عليه وسلم يشهده فقال ‏\"‏ أكل ولدك نحلت ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏ واللفظ لمحمد ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that his father gave him a slave as a present, then he came to the Prophet to ask him to bear witness (to that). He said:                      \"Have you given a present to all of your children?\" He said: \"No.\" He said: \"Then take it back.\" This wording is that of (one of the narrators) Muhammad.",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11279",
        "36658",
        "20005",
        "10561",
        "274"
      ]
    },
    {
      "hadith_no": "3673",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، ومحمد بن النعمان، يحدثانه عن النعمان بن بشير، أن أباه، أتى به رسول الله صلى الله عليه وسلم فقال إني نحلت ابني غلاما كان لي فقال رسول الله ‏\"‏ أكل ولدك نحلته ‏\"‏ ‏.‏ قال لا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فارجعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that his father brought him to the Messenger of Allah and said:                      \"I have given my son a slave of mine as a present.\" The Messenger of Allah said: \"Have you given a present to all of your children?\" He said: \"No.\" The Messenger of Allah said: \"Then take (your present) back.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10561",
        "274"
      ]
    },
    {
      "hadith_no": "3674",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن هاشم، قال حدثنا الوليد بن مسلم، قال حدثنا الأوزاعي، عن الزهري، عن حميد بن عبد الرحمن، وعن محمد بن النعمان، عن النعمان بن بشير، أن أباه، بشير بن سعد جاء بابنه النعمان فقال يا رسول الله إني نحلت ابني هذا غلاما كان لي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أكل بنيك نحلت ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فارجعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that his father Bashir bin Sa'd brought An-Nu'man with him and said:                      \"O Messenger of Allah, I have given this son of mine a slave who belonged to me as a present.\" The Messenger of Allah said: \"Have you given a present to all your children?\" He said: \"No.\" He said: \"Then take (your present) back.\"",
      "chain": [
        "20733",
        "20024",
        "11013",
        "10561",
        "274"
      ]
    },
    {
      "hadith_no": "3676",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن هشام، عن أبيه، عن النعمان بن بشير، أن أباه، نحله نحلا فقالت له أمه أشهد النبي صلى الله عليه وسلم على ما نحلت ابني ‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له فكره النبي صلى الله عليه وسلم أن يشهد له ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that his father gave him a present, and his mother said:                      \"Ask the Prophet to bear witness to what you have given to my son.\" So he came to the Prophet and told him about that, and the Prophet did not want to bear witness to it.",
      "chain": [
        "38011",
        "20354",
        "20295",
        "274"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن عبد الملك بن أبي الشوارب، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا داود، عن الشعبي، عن النعمان، قال انطلق به أبوه يحمله إلى النبي صلى الله عليه وسلم قال اشهد أني قد نحلت النعمان من مالي كذا وكذا ‏.‏ قال ‏\"‏ كل بنيك نحلت مثل الذي نحلت النعمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nu'man said that his father took him to the Prophet and said:                      \"Bear witness that I have given An-Nu'man such and such of my wealth as a gift.\" He said: \"Have you given all your children a present like that which you have given to An-Nu'man?\"",
      "chain": [
        "30450",
        "20304",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن المثنى، عن عبد الوهاب، قال حدثنا داود، عن عامر، عن النعمان، أن أباه، أتى به النبي صلى الله عليه وسلم يشهد على نحل نحله إياه ‏.‏ فقال ‏\"‏ أكل ولدك نحلت مثل ما نحلته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا أشهد على شىء أليس يسرك أن يكونوا إليك في البر سواء ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man that his father brought him to the Prophet to bear witness to a present that he gave to him. He said:                      \"Have you given all your children a present like that which you have given to him?\" He said: \"No.\" He said: \"I will not bear witness to anything. Will it not please you if they were all to treat you with equal respect?\" He said: \"Of course.\" He said: \"Then no (I will not do it).\"",
      "chain": [
        "30170",
        "20259",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3681",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا أبو أسامة، قال حدثنا أبو حيان، عن الشعبي، قال حدثني النعمان بن بشير الأنصاري، أن أمه ابنة رواحة، سألت أباه بعض الموهبة من ماله لابنها فالتوى بها سنة ثم بدا له فوهبها له فقالت لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم ‏.‏ فقال يا رسول الله إن أم هذا ابنة رواحة قاتلتني على الذي وهبت له ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بشير ألك ولد سوى هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفكلهم وهبت لهم مثل الذي وهبت لابنك هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir Al-Ansari narrated that his mother, the daughter of Rawahah, asked his father to give some of his wealth to her son. He deferred that for a year, then he decided to give it to him. She said:                      \"I will not be pleased until you ask the Messenger of Allah to bear witness.\" He said: \"O Messenger of Allah, the mother of this boy, the daughter of Rawahah, insisted that I give a gift to him.\" The Messenger of Allah said: \"O Bashir, do you have any other children besides this one?\" He said: \"Yes.\" The Messenger of Allah said: \"Have you given all of them a gift like that which you have given to this son of yours?\" He said: \"No.\" The Messenger of Allah said: \"Then do not ask me to bear witness, for I will not bear witness to unfairness.\"",
      "chain": [
        "20318",
        "11404",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3682",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يعلى، قال حدثنا أبو حيان، عن الشعبي، عن النعمان، قال سألت أمي أبي بعض الموهبة فوهبها لي فقالت لا أرضى حتى أشهد رسول الله صلى الله عليه وسلم ‏.‏ قال فأخذ أبي بيدي وأنا غلام فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أم هذا ابنة رواحة طلبت مني بعض الموهبة وقد أعجبها أن أشهدك على ذلك ‏.‏ قال ‏\"‏ يا بشير ألك ابن غير هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فوهبت له مثل ما وهبت لهذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nu'man said:                      \"My mother asked my father for a gift and he gave it to me. She said: 'I will not be contented until you ask the Messenger of Allah to bear witness.' So my father took me by the hand, as I was still a boy, and went to the Messenger of Allah. He said: 'O Messenger of Allah, the mother of this boy, the daughter of Rawahah, asked me for a gift, and she wanted me to ask you to bear witness to that.' He said: 'O Bashir, do you have any other child apart from this one?' He said: 'Yes.' He said: 'Have you given him gifts like that which you have given to this one?' He said: 'No.' He said: 'Then do not ask me to bear witness, for I will not bear witness to unfairness.'\"",
      "chain": [
        "30002",
        "20372",
        "11404",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3685",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن فطر، قال حدثني مسلم بن صبيح، قال سمعت النعمان بن بشير، يقول ذهب بي أبي إلى النبي صلى الله عليه وسلم يشهده على شىء أعطانيه فقال ‏\"‏ ألك ولد غيره ‏\"‏ ‏.‏ قال نعم ‏.‏ وصف بيده بكفه أجمع كذا ألا سويت بينهم ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                      \"My father took me to the Prophet to ask him to bear witness to something that he had given to me. He said: 'Do you have any other children?' He said: 'Yes.' He gestured with his hand held horizontally like this, (saying): 'Why don't you treat them all equally?'\"",
      "chain": [
        "30359",
        "20031",
        "11392",
        "274"
      ]
    },
    {
      "hadith_no": "3686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن فطر، عن مسلم بن صبيح، قال سمعت النعمان، يقول وهو يخطب انطلق بي أبي إلى رسول الله صلى الله عليه وسلم يشهده على عطية أعطانيها فقال ‏\"‏ هل لك بنون سواه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ سو بينهم ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man said, when he was delivering a Khutbah:                      \"My father took me to the Messenger of Allah to ask him to bear witness to a gift that he had given me. He said: 'Do you have any other children besides him?' He said: 'Yes.' He said: 'Treat them equally.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11392",
        "274"
      ]
    },
    {
      "hadith_no": "3687",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا يعقوب بن سفيان، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن حاجب بن المفضل بن المهلب، عن أبيه، قال سمعت النعمان بن بشير، يخطب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اعدلوا بين أبنائكم اعدلوا بين أبنائكم ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir delivered a Khutbah and said:                      \"The Messenger of Allah said: 'Treat your children fairly, treat your children fairly.'\"",
      "chain": [
        "38719",
        "20193",
        "20022",
        "274"
      ]
    },
    {
      "hadith_no": "3979",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا الأسود بن عامر، قال حدثنا إسرائيل، عن سماك، عن النعمان بن بشير، قال كنا مع النبي صلى الله عليه وسلم فجاء رجل فساره فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ ثم قال ‏\"‏ أيشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال نعم ولكنما يقولها تعوذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتلوه فإنما أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                     \"We were with the Messenger of Allah [SAW] and a man came and whispered to him. He said: 'Kill him.' Then he said: 'Does he bear witness to La ilaha illallah (there is none worthy of worship except Allah)?' He said: 'Yes, but he is only saying it to protect himself.' The Messenger of Allah [SAW] said: 'Do not kill him, for I have been commanded to fight the people until they say La ilaha illallah, and if they say it, their blood and their wealth are safe from me, except for a right that is due, and their reckoning will be with Allah.'\"",
      "chain": [
        "20380",
        "20311",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "4453",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا ابن عون، عن الشعبي، قال سمعت النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم - فوالله لا أسمع بعده أحدا يقول سمعت رسول الله صلى الله عليه وسلم - يقول ‏\"‏ إن الحلال بين وإن الحرام بين وإن بين ذلك أمورا مشتبهات ‏\"‏ ‏.‏ وربما قال ‏\"‏ وإن بين ذلك أمورا مشتبهة ‏\"‏ ‏.‏ قال ‏\"‏ وسأضرب لكم في ذلك مثلا إن الله عز وجل حمى حمى وإن حمى الله عز وجل ما حرم وإنه من يرتع حول الحمى يوشك أن يخالط الحمى ‏\"‏ ‏.‏ وربما قال ‏\"‏ إنه من يرعى حول الحمى يوشك أن يرتع فيه وإن من يخالط الريبة يوشك أن يجسر ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     \"I heard the Messenger of Allah say: \"That which is lawful is plain and that which is unlawful is plain, and between them are matters which are not as clear. I will strike a parable for you about that: indeed Allah, the Mighty and Sublime, has established a sanctuary, and the sanctuary of Allah is that which He has forbidden. Whoever approaches the sanctuary is bound to transgress upon it, Or he said: 'Whoever grazes around the sanctuary will soon transgress upon it, and whoever indulges in matters that are not clear, he will soon transgress beyond the limits,\"\"",
      "chain": [
        "20226",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4874",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا بقية بن الوليد، قال حدثني صفوان بن عمرو، قال حدثني أزهر بن عبد الله الحرازي، عن النعمان بن بشير، أنه رفع إليه نفر من الكلاعيين أن حاكة سرقوا متاعا فحبسهم أياما ثم خلى سبيلهم فأتوه فقالوا خليت سبيل هؤلاء بلا امتحان ولا ضرب ‏.‏ فقال النعمان ما شئتم إن شئتم أضربهم فإن أخرج الله متاعكم فذاك وإلا أخذت من ظهوركم مثله ‏.‏ قالوا هذا حكمك ‏.‏ قال هذا حكم الله عز وجل ورسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that:                     a group of the Kala'iyin complaned to him about some people who had stolen some goods, shoe detained them for several days, and then he let them go. They came and said: \"You let them go without any pressure (to make them admit to their crime) or beating?\" An-Nu'man said: \"What do you want? If you wish, I will beat them, and if Allah brings back your goods thereby, all well and good. Otherwise I will take retaliation from your backs (by beating you) likewise.\" They said: \"is this your ruling?\" He said: \"This is the ruling of Allah and His Messenger \"(Daif)",
      "chain": [
        "30123",
        "20644",
        "10921",
        "18019",
        "274"
      ]
    },
    {
      "hadith_no": "5710",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا حميد بن مسعدة، عن يزيد، - وهو ابن زريع - عن ابن عون، عن الشعبي، عن النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحلال بين وإن الحرام بين وإن بين ذلك أمورا مشتبهات ‏\"‏ ‏.‏ وربما قال ‏\"‏ وإن بين ذلك أمورا مشتبهة وسأضرب في ذلك مثلا إن الله عز وجل حمى حمى وإن حمى الله ما حرم وإنه من يرع حول الحمى يوشك أن يخالط الحمى ‏\"‏ ‏.‏ وربما قال ‏\"‏ يوشك أن يرتع وإن من خالط الريبة يوشك أن يجسر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                     \"I heard the Messenger of Allah [SAW] say: 'That which is lawful is clear and that which is unlawful is clear, but between them there are matters which are doubtful.'\" And sometimes he said: \"But between them are matters that are not as clear. I will describe the likeness of that for you. Allah, the Mighty and Sublime, has a sanctuary and the sanctuary of Allah is that which He has forbidden. Whoever grazes around the sanctuary will soon transgress into the sanctuary. And whoever approaches a matter that is unclear, he will soon wind up in the sanctuary.\" And sometimes he said: \"He will soon transgress, and indeed whoever mixes in doubt, he will soon cross into it.\"",
      "chain": [
        "30430",
        "20304",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، حدثنا الفرج بن فضالة، عن ربيعة بن يزيد الدمشقي، عن النعمان بن بشير، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا عثمان إن ولاك الله هذا الأمر يوما فأرادك المنافقون أن تخلع قميصك الذي قمصك الله فلا تخلعه ‏\"‏ ‏.‏ يقول ذلك ثلاث مرات ‏.‏ قال النعمان فقلت لعائشة ما منعك أن تعلمي الناس بهذا قالت أنسيته والله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     The Messenger of Allah said: \"O 'Uthman, if Allah places you in authority over this matter (as the caliph) some day and the hypocrites want to rid you of the garment with which Allah has clothed you (i.e., the position of caliph), do not take it off.\" He said that three times. (One of the narrators) Nu'man said: \"I said to 'Aishah: 'What kept you from telling the people that?' She said: 'I was made to forget it.'\"",
      "chain": [
        "38409",
        "20354",
        "27031",
        "11414",
        "274",
        "53"
      ]
    },
    {
      "hadith_no": "1047",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، حدثنا سماك بن حرب، أنه سمع النعمان بن بشير، يقول كان رسول الله  صلى الله عليه وسلم  يسوي الصف حتى يجعله مثل الرمح أو القدح ‏.‏ قال فرأى صدر رجل ناتئا فقال رسول الله ‏\"‏ سووا صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏",
      "text_en": " Simak binHarb narrated that he heard Nu’man bin Bashir say:                      “TheMessengerof Allah (ﷺ) used to straighten the rows until he madethem like aspear or an arrow-shaft. Once he saw a man’s chest(sticking out)so the Messenger of Allah (ﷺ) said: ‘Make your rowsstraight orAllah will create division among you.’”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "1320",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وأحمد بن ثابت، وجميل بن الحسن، قالوا حدثنا عبد الوهاب، حدثنا خالد الحذاء، عن أبي قلابة، عن النعمان بن بشير، قال انكسفت الشمس على عهد رسول الله  صلى الله عليه وسلم  فخرج فزعا يجر ثوبه حتى أتى المسجد فلم يزل يصلي حتى انجلت ثم قال ‏\"‏ إن أناسا يزعمون أن الشمس والقمر لا ينكسفان إلا لموت عظيم من العظماء وليس كذلك إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته فإذا تجلى الله لشىء من خلقه خشع له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Nu’man bin Bashir said:                      “The sun was eclipsed atthe time of the Messenger of Allah (ﷺ), and he came out alarmed,dragging his lower garment, until he reached the mosque. He continuedto perform prayer until the eclipse was over, then he said: ‘Somepeople claim that the sun and moon only become eclipsed because ofthedeath of a great leader. That is not so. The sun and the moon donotbecome eclipsed for the death or birth of anyone. When AllahmanifestsHimself to anything in His creation, it humbles itselfbefore Him.’”",
      "chain": [
        "30170",
        "34046",
        "20259",
        "11282",
        "11047",
        "274"
      ]
    },
    {
      "hadith_no": "1327",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن الأزهر، والحسن بن أبي الربيع، قالا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان، يحدث عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال خرج رسول الله  صلى الله عليه وسلم  يوما يستسقي فصلى بنا ركعتين بلا أذان ولا إقامة ثم خطبنا ودعا الله وحول وجهه نحو القبلة رافعا يديه ثم قلب رداءه فجعل الأيمن على الأيسر والأيسر على الأيمن ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)wentout one day to pray for rain. He led us in praying two Rak’ahwithout any Adhan or Iqamah, then he addressed us and supplicated toAllah. He turned to face the Qiblah, raising his hands, then heturnedhis cloak around, putting its right on the left and its lefton theright.”",
      "chain": [
        "38001",
        "20298",
        "11272",
        "274",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "1340",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في العيدين ب ‏{سبح اسم ربك الأعلى}‏ و ‏{هل أتاك حديث الغاشية}‏ ‏.‏",
      "text_en": " It wasnarrated from Nu’man bin Bashir that the Messenger of Allah(ﷺ)used to recite “Glorify the Name of your Lord, the Most High,”[Al-A’la (87)] and “Has there come to you the narration of theoverwhelming?” [Al-Ghashiyah (88)] in the ‘Eid prayer.",
      "chain": [
        "30269",
        "20005",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يزيد بن زريع، عن داود بن أبي هند، عن الشعبي، عن النعمان بن بشير، قال انطلق به أبوه يحمله إلى النبي صلى الله عليه وسلم فقال اشهد أني قد نحلت النعمان من مالي كذا وكذا ‏.‏ قال ‏\"‏ فكل بنيك نحلت مثل الذي نحلت النعمان ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فأشهد على هذا غيري ‏\"‏ ‏.‏ قال ‏\"‏ أليس يسرك أن يكونوا لك في البر سواء ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nu'man bin Bashir said that his father took him to the Prophet (ﷺ) and said:                     “Bear witness that I have given Nu'man such and such from my wealth.” He said: “Have you given all your children something like that which you have given to Nu'man?” He said: “No.” He said: “Then let someone other than me bear witness to that.” And he said: “Would you not like all your children to honor you equally?” He said: “Of course.” He said: “Then do not do this.”",
      "chain": [
        "34043",
        "20304",
        "11585",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2466",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان، عن الزهري، عن حميد بن عبد الرحمن، ومحمد بن النعمان بن بشير، أخبراه عن النعمان بن بشير، أن أباه، نحله غلاما وأنه جاء إلى النبي صلى الله عليه وسلم يشهده فقال ‏\"‏ أكل ولدك نحلت ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nu'man bin Bashir that:                     his father gave him a gift of a slave, and he came to the Prophet (ﷺ) so that he could witness the gift. He said: “Have you given something to all of your children?” He said: “No.” He said: “Then take back (your gift).”",
      "chain": [
        "30288",
        "20012",
        "11013",
        "10561",
        "274"
      ]
    },
    {
      "hadith_no": "2769",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن المستمر العروقي، حدثنا أبو عاصم، عن سفيان، عن جابر، عن أبي عازب، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا قود إلا بالسيف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nu'man bin Bashir that the Messenger of Allah (ﷺ) said:                     “There is no retaliation with the sword.”",
      "chain": [
        "34023",
        "20241",
        "20012",
        "34",
        "274"
      ]
    },
    {
      "hadith_no": "3493",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، عن أبيه، عن النعمان بن بشير، قال أهدي للنبي  صلى الله عليه وسلم  عنب من الطائف فدعاني فقال ‏\"‏ خذ هذا العنقود فأبلغه أمك ‏\"‏ ‏.‏ فأكلته قبل أن أبلغه إياها فلما كان بعد ليال قال لي ‏\"‏ ما فعل العنقود هل أبلغته أمك ‏\"‏ ‏.‏ قلت لا ‏.‏ قال فسماني غدر ‏.‏",
      "text_en": " It wasnarrated that Nu’man bin Bashir said:                      “The Prophet (ﷺ) wasgiven a gift of some grapes from Ta’if. He called me and said:‘Takethis bunch of grapes and give it to your mother.’ But I ateit beforeI gave it to her. A few night later he said to me: ‘Whathappened tothe bunch of grapes? Did you give it to your mother?’ Isaid: ‘No, Sohe called me treacherous.’”",
      "chain": [
        "10581",
        "4",
        "18930",
        "274"
      ]
    },
    {
      "hadith_no": "3504",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، أن خالد بن كثير الهمداني، حدثه أن السري بن إسماعيل حدثه أن الشعبي حدثه أنه، سمع النعمان بن بشير، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من الحنطة خمرا ومن الشعير خمرا ومن الزبيب خمرا ومن التمر خمرا ومن العسل خمرا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Nu’man bin Bashir that the Messenger of Allah(ﷺ)said:                      “From wheat comes wine, from barley comes wine, fromraisinscomes wine, from dates comes wine and from honey comes wine.”",
      "chain": [
        "30490",
        "20023",
        "11411",
        "15175",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3809",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثني يحيى بن سعيد، عن موسى بن أبي عيسى الطحان، عن عون بن عبد الله، عن أبيه، أو عن أخيه، عن النعمان بن بشير، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن مما تذكرون من جلال الله التسبيح والتهليل والتحميد ينعطفن حول العرش لهن دوي كدوي النحل تذكر بصاحبها أما يحب أحدكم أن يكون له - أو لا يزال له - من يذكر به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nu'man bin Bashir that :                     the Messenger of Allah (ﷺ) said: \"What you mention of glory of Allah, of Tabsih (Subhan-Allah), Tahlil (Allahu-Akbar) and Tahmid (Al-Hamdu lillah), revolves around the Throne, buzzing like bees, reminding of the one who said it.  Wouldn't any one of you like to have, or continue to have, something that reminds of him (in the presence of Allah)?'\"",
      "chain": [
        "34043",
        "20031",
        "10620",
        "10806",
        "11004",
        "274"
      ]
    },
    {
      "hadith_no": "3828",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن ذر بن عبد الله الهمداني، عن يسيع الكندي، عن النعمان بن بشير، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الدعاء هو العبادة ‏\"‏ ‏.‏ ثم قرأ ‏{وقال ربكم ادعوني أستجب لكم}‏ ‏.‏",
      "text_en": " It was narrated from Nu'man bin Bashir that :                     the Messenger of Allah (saas) said: \"Indeed the supplication is the worship.\" Then he recited: \"And your Lord said: Invoke Me, I will respond to you.\"",
      "chain": [
        "38409",
        "20032",
        "11060",
        "274"
      ]
    },
    {
      "hadith_no": "4119",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا عبد الله بن المبارك، عن زكريا بن أبي زائدة، عن الشعبي، قال سمعت النعمان بن بشير، يقول على المنبر وأهوى بإصبعيه إلى أذنيه سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الحلال بين والحرام بين وبينهما مشتبهات لا يعلمها كثير من الناس فمن اتقى الشبهات استبرأ لدينه وعرضه ومن وقع في الشبهات وقع في الحرام كالراعي حول الحمى يوشك أن يرتع فيه ألا وإن لكل ملك حمى ألا وإن حمى الله محارمه ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله وإذا فسدت فسد الجسد كله ألا وهي القلب ‏\"‏ ‏.‏",
      "text_en": " While on the pulpit, pointing with this fingers towards his ears,Nu’man bin Bashir said:                      “I heard the Messenger of Allah (ﷺ)say:‘That which is lawful is plain and that which is unlawful isplain,and between them are matters that are not clear, about whichnot manypeople know. Thus he who guards against the unclear matters,he clearshimself with regard to his religion and his honor. But hewho fallsinto the unclear matters, he falls into that which isunlawful. Likethe shepherd who pastures around a sanctuary, all butgrazing therein.Every king has a sanctuary. And beware! Allah’ssanctuary is Hisprohibitions. Beware! In the body there is a pieceof flesh which, ifit is sound, the whole body will be sound, and ifit is corrupt, thewhole body will be corrupt. It is the heart.’”",
      "chain": [
        "18792",
        "20025",
        "11338",
        "11052",
        "274"
      ]
    }
  ],
  "total_hadiths": 116
}