{
  "id": "27507",
  "name": "Khalid bin Yazid bin Salah خالد بن يزيد بن صالح",
  "full_name": "Khalid bin Yazid bin Salah خالد بن يزيد بن صالح",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  ق  -  ثقة ]"
    ],
    "tags": [
      "Judge",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "23023",
      "name": "Talha bin 'Amr bin 'Uthman طلحة بن عمرو بن عثمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20729",
      "name": "Hisham bin al-Ghaz bin Rabi'ya هشام بن الغاز بن ربيعة الجرشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19201",
      "name": "Yonus bin Maysra bin Halbus يونس بن ميسرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30284",
      "name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30355",
      "name": "'Abdullah bin Yusuf al-Tunaysi عبد الله بن يوسف التنيسي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3561",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا أحمد بن عبد الواحد، قال حدثنا مروان، - وهو ابن محمد - قال حدثنا خالد بن يزيد بن صالح بن صبيح المري، قال حدثنا إبراهيم بن أبي عبلة، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن سلمة بن نفيل الكندي، قال كنت جالسا عند رسول الله صلى الله عليه وسلم فقال رجل يا رسول الله أذال الناس الخيل ووضعوا السلاح وقالوا لا جهاد قد وضعت الحرب أوزارها فأقبل رسول الله صلى الله عليه وسلم بوجهه وقال ‏\"‏ كذبوا الآن الآن جاء القتال ولا يزال من أمتي أمة يقاتلون على الحق ويزيغ الله لهم قلوب أقوام ويرزقهم منهم حتى تقوم الساعة وحتى يأتي وعد الله والخيل معقود في نواصيها الخير إلى يوم القيامة وهو يوحى إلى أني مقبوض غير ملبث وأنتم تتبعوني أفنادا يضرب بعضكم رقاب بعض وعقر دار المؤمنين الشام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Nufail Al-Kindi said:                      \"I was sitting with the Messenger of Allah when a man said: 'O Messenger of Allah! The people have lost interest in horses and put down their weapons, and they say there is no Jihad, and that war has ended.' The Messenger of Allah turned to face him and said: 'They are lying, now the fighting is to come. There will always be a group among my Ummah who will fight for the truth, for whom Allah will cause some people to deviate, and grant them provision from them, until the Hour begins and until the promise of Allah comes. Goodness is tied to the forelocks of horses until the Day of Resurrection. It has been revealed to me that I am going to die and will not stay long, and you will follow me group after group, striking one another's necks. And the place of safety for the believers is Ash-Sham.'\"",
      "chain": [
        "20640",
        "27507",
        "11667",
        "10975",
        "4097"
      ]
    },
    {
      "hadith_no": "906",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن الوليد الخلال الدمشقي، حدثنا مروان بن محمد، وأبو مسهر قالا حدثنا خالد بن يزيد بن صالح بن صبيح المري، حدثنا طلحة بن عمرو، عن عطاء، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما حسدتكم اليهود على شىء ما حسدتكم على آمين فأكثروا من قول آمين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “The Jews do not envy you for anything more than they envy youforthe Salam and (saying) Amin, so say Amin a great deal.”",
      "chain": [
        "20640",
        "30284",
        "27507",
        "23023",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1490",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، عن خالد بن يزيد المري، عن يونس بن ميسرة بن حلبس، عن الصنابحي، عن عبادة بن الصامت، أنه سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا كتب الله له بها حسنة ومحا عنه بها سيئة ورفع له بها درجة فاستكثروا من السجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that he heard the Messenger ofAllah (ﷺ) say:                      “No one prostrates to Allah but Allah will recordoneHasanah (good reward) for him, and will erase thereby one baddeed andraise him in status one degree. So prostrate a great deal.”",
      "chain": [
        "20733",
        "27507",
        "19201",
        "5144",
        "40"
      ]
    }
  ],
  "total_hadiths": 3
}