{
  "id": "27530",
  "name": "'Uthman bin Abi al-Atk'h عثمان بن أبي العاتكة سليمان الأزدي",
  "full_name": "'Uthman bin Abi al-Atk'h عثمان بن أبي العاتكة سليمان الأزدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "105",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  د  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18248",
      "name": "Khalid bin al-Lajlaj al-Amiri خالد بن اللجلاج العامري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11692",
      "name": "Sulaiman bin Habib al-Maharbi سليمان بن حبيب المحاربي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17530",
      "name": "'Ali bin Yazid bin Abi Hilal al-Alhani علي بن يزيد بن أبي هلال الألهاني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17532",
      "name": "'Amr bin Muhajir bin 'Abi Muslim عمرو بن المهاجر بن أبي مسلم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11415",
      "name": "'Umayr bin Han'i al-Ansi عمير بن هانئ العنسي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20398",
      "name": "Sdqh bin Khalid al-Amwy صدقة بن خالد الأموي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27036",
      "name": "Muhammad bin Yazid al-Kula'i محمد بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5001",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا صفوان بن صالح، حدثنا الوليد، حدثنا عثمان بن أبي العاتكة، قال إنما قال أدخل كلي ‏.‏ من صغر القبة ‏.‏",
      "text_en": " ‘Uthman b. Abu 'Atikah said :                      The only reason why he asked whether the whole of him should come in was because of the smallness of the tent",
      "chain": [
        "37511",
        "20733",
        "27530"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب، حدثنا عثمان بن أبي العاتكة، عن علي بن يزيد، عن القاسم، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تسوكوا فإن السواك مطهرة للفم مرضاة للرب وما جاءني جبريل إلا أوصاني بالسواك حتى لقد خشيت أن يفرض على وعلى أمتي ولولا أني أخاف أن أشق على أمتي لفرضته لهم وإني لأستاك حتى لقد خشيت أن أحفي مقادم فمي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     The Messenger of Allah said: \"Use the tooth stick, for the tooth stick purifies the mouth and is pleasing to the Lord. Jibril never came to me but he advised me to use the tooth stick, until I feared that it would be made obligatory for me and my Ummah. Were it not that I fear that it would be too difficult for my Ummah, I would have enjoined it upon them. And I use the tooth stick until I fear that I may make the front of my mouth sore.' (i.e. my gums) (or cause my teeth to fall out due to brushing them so often).\"",
      "chain": [
        "30288",
        "20732",
        "27530",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "1930",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، حدثنا عثمان بن أبي العاتكة، عن علي بن يزيد، عن القاسم، عن أبي أمامة، عن النبي  صلى الله عليه وسلم  أنه كان يقول ‏\"‏ ما استفاد المؤمن بعد تقوى الله خيرا له من زوجة صالحة إن أمرها أطاعته وإن نظر إليها سرته وإن أقسم عليها أبرته وإن غاب عنها نصحته في نفسها وماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     the Prophet used to say: “Nothing is more benefit to the believer after Taqwa of Allah than a righteous wife whom, if he commands her she obeys him, if he looks at her he is pleased, if he swears an oath concerning her she fulfills it, and when he is away from her she is sincere towards him with regard to herself and his wealth.”",
      "chain": [
        "30288",
        "20398",
        "27530",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "3662",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، حدثنا عثمان بن أبي العاتكة، عن علي بن يزيد، عن القاسم، عن أبي أمامة، أن رجلا، قال يا رسول الله ما حق الوالدين على ولدهما قال ‏\"‏ هما جنتك ونارك ‏\"‏ ‏.‏",
      "text_en": " Abu Umamah narrated that a man said that:                     \"O Allah's Messenger(ﷺ), what are the rights of parents over their child?\" He said:\"They are your Paradise and your Hell.\" (Daif)",
      "chain": [
        "30288",
        "20398",
        "27530",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "4229",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا عثمان بن أبي العاتكة، عن سليمان بن حبيب المحاربي، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا وقعت الملاحم بعث الله بعثا من الموالي هم أكرم العرب فرسا وأجوده سلاحا يؤيد الله بهم الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “When the fierce battles take place, Allah will send a troopoffreed slaves who will be the best Arab horsemen and the bestarmed,with whom Allah will support His religion.”",
      "chain": [
        "30288",
        "20733",
        "27530",
        "11692",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}