{
  "id": "27540",
  "name": "Muhammad bin Bkar bin Bilal محمد بن بكار بن بلال العاملي",
  "full_name": "Muhammad bin Bkar bin Bilal محمد بن بكار بن بلال العاملي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "216",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-'Aamali",
      "Judge",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20710",
      "name": "Sa'id bin Basahyr al-Azdi سعيد بن بشير الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20719",
      "name": "Muhammad bin Rashid al-Mkhwly محمد بن راشد المكحولي الخزاعي الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20628",
      "name": "Musa bin 'Ali bin Rabah موسى بن علي بن رباح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "36513",
      "name": "Ahmed bin Muhammad bin Nyzk أحمد بن محمد بن نيزك",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37542",
      "name": "al-Hythm bin Mrwan bin al-Hythm الهيثم بن مروان بن الهيثم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38032",
      "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30518",
      "name": "Muhammad bin Abi 'Atab محمد بن أبي عتاب الأعين",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38405",
      "name": "'Ali bin 'Uthman bin Muhammad علي بن عثمان بن محمد بن سعيد النفيلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37500",
      "name": "Ahmed bin Abd al-Wahd أحمد بن عبد الواحد بن واقد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4565",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا محمد بن بكار بن بلال العاملي، أخبرنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ عقل شبه العمد مغلظ مثل عقل العمد ولا يقتل صاحبه ‏\"‏ ‏.‏ قال وزادنا خليل عن ابن راشد ‏\"‏ وذلك أن ينزو الشيطان بين الناس فتكون دماء في عميا في غير ضغينة ولا حمل سلاح ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Prophet (ﷺ) said: Blood-wit for what resembles intentional murder is to be made as severe as that for intentional murder, but the culprit is not to be killed. Khalid gave us some additional information on the authority of Ibn Rashid: That (unintentional murder which resembles intentional murder) means that Satan jumps among the people and then the blood is shed blindly without any malice and weapon.",
      "chain": [
        "11222",
        "27540",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3695",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا الهيثم بن مروان بن الهيثم بن عمران، قال حدثنا محمد، - وهو ابن بكار بن بلال - قال حدثنا يحيى، عن الأوزاعي، أن محمد بن علي بن الحسين، حدثه عن سعيد بن المسيب، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثل الذي يرجع في صدقته كمثل الكلب يقيء ثم يعود في قيئه ‏\"‏ ‏.‏ قال الأوزاعي سمعته يحدث عطاء بن أبي رباح بهذا الحديث ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that the Messenger of Allah said:                      \"The likeness of the one who takes back his gift is that of a dog which vomits, then goes back to its vomit.\" (One of the narrators) Al-Awza'i said: \"I heard him narrating this Hadith to 'Ata bin Abi Rabah.\"",
      "chain": [
        "37542",
        "27540",
        "20031",
        "20024",
        "11442",
        "11002",
        "17"
      ]
    },
    {
      "hadith_no": "4854",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا الهيثم بن مروان بن الهيثم بن عمران العنسي، قال حدثنا محمد بن بكار بن بلال، قال حدثنا يحيى، قال حدثنا سليمان بن أرقم، قال حدثني الزهري، عن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم كتب إلى أهل اليمن بكتاب فيه الفرائض والسنن والديات وبعث به مع عمرو بن حزم فقرئ على أهل اليمن هذه نسخته فذكر مثله إلا أنه قال ‏\"‏ وفي العين الواحدة نصف الدية وفي اليد الواحدة نصف الدية وفي الرجل الواحدة نصف الدية ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا أشبه بالصواب والله أعلم وسليمان بن أرقم متروك الحديث وقد روى هذا الحديث يونس عن الزهري مرسلا ‏.‏",
      "text_en": " It was narrated from Abi Bakr bin Muhammad bin 'Amr bin Hazm, from his father, from his grandfather, that:                     the Messenger of Allah wrote a letter to the people of Yemen included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Amr bin Hazm and it was read to the people of Yemen. This is a copy of it. And he mentioned something similar, except that he said: \"And for one eye, half the Diyah must be paid; for one hand, half thediyah must be paid; for one foot, half the diyah must be paid. \" (Daif)",
      "chain": [
        "37542",
        "27540",
        "20031",
        "24178",
        "11013",
        "11239",
        "1209"
      ]
    }
  ],
  "total_hadiths": 3
}