{
  "id": "27558",
  "name": "Yasra bin Safwan al-Lakhmi يسرة بن صفوان بن جميل اللخمي",
  "full_name": "Yasra bin Safwan al-Lakhmi يسرة بن صفوان بن جميل اللخمي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "125",
      "date_gregorian": "NA",
      "date_display": [
        "125 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "215",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  -  ثقة ]"
    ],
    "tags": [
      "al-Lakhmi",
      "al-Damashqi",
      "al-Balati"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38587",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم الطائفي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "19825",
      "name": "Najih bin 'Abdur Rahman نجيح بن عبد الرحمن السندي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "23034",
      "name": "'Abdul Jabbar bin al-Ward عبد الجبار بن الورد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27528",
      "name": "Abd al-Rzaq bin 'Umar عبد الرزاق بن عمر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30516",
      "name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31230",
      "name": "Ibrahim bin Han'i al-Nysabwry Skn إبراهيم بن هانئ",
      "grade": "3rd Century AH"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36580",
      "name": "'Abbas bin 'Abdullah al-Tarfaqi عباس بن عبد الله الترقفي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4109",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان، حدثنا إبراهيم، عن أبيه، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت النبي صلى الله عليه وسلم جمع أبويه لأحد إلا لسعد بن مالك، فإني سمعته يقول يوم أحد ‏\"‏ يا سعد ارم، فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I have never heard the Prophet mentioning his father and mother for anybody other than Sa`d bin Malik. I heard him saying on the day of Uhud, \"O Sa`d throw (arrows)! Let my father and mother be sacrificed for you !\"",
      "chain": [
        "27558",
        "20150",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "4477",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان بن جميل اللخمي، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة  عليها السلام  في شكواه الذي قبض فيه، فسارها بشىء، فبكت، ثم دعاها فسارها بشىء فضحكت فسألنا عن ذلك‏.‏   فقالت سارني النبي صلى الله عليه وسلم أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهله يتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet called Fatima during his fatal illness and told her something secretly and she wept. Then he called her again and told her something secretly, and she started laughing. When we asked her about that, she said, \"The Prophet first told me secretly that he would expire in that disease in which he died, so I wept; then he told me secretly that I would be the first of his family to follow him, so I laughed ( at that time).",
      "chain": [
        "27558",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4894",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يسرة بن صفوان بن جميل اللخمي، حدثنا نافع بن عمر، عن ابن أبي مليكة، قال كاد الخيران أن يهلكا  أبا بكر وعمر  رضى الله عنهما  رفعا أصواتهما عند النبي صلى الله عليه وسلم حين قدم عليه ركب بني تميم، فأشار أحدهما بالأقرع بن حابس أخي بني مجاشع، وأشار الآخر برجل آخر  قال نافع لا أحفظ اسمه  فقال أبو بكر لعمر ما أردت إلا خلافي‏.‏ قال ما أردت خلافك‏.‏ فارتفعت أصواتهما في ذلك، فأنزل الله ‏{‏يا أيها الذين آمنوا لا ترفعوا أصواتكم‏}‏ الآية‏.‏ قال ابن الزبير فما كان عمر يسمع رسول الله صلى الله عليه وسلم بعد هذه الآية حتى يستفهمه‏.‏ ولم يذكر ذلك عن أبيه، يعني أبا بكر‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     The two righteous persons were about to be ruined. They were Abu Bakr and `Umar who raised their voices in the presence of the Prophet when a mission from Bani Tamim came to him. One of the two recommended Al-Aqra' bin Habeas, the brother of Bani Mujashi (to be their governor) while the other recommended somebody else. (Nafi`, the sub-narrator said, I do not remember his name). Abu Bakr said to `Umar, \"You wanted nothing but to oppose me!\" `Umar said, \"I did not intend to oppose you.\" Their voices grew loud in that argument, so Allah revealed: 'O you who believe! Raise not your voices above the voice of the Prophet.' (49.2) Ibn Az-Zubair said, \"Since the revelation of this Verse, `Umar used to speak in such a low tone that the Prophet had to ask him to repeat his statements.\" But Ibn Az-Zubair did not mention the same about his (maternal) grandfather (i.e. Abu Bakr).",
      "chain": [
        "27558",
        "20203",
        "11090"
      ]
    },
    {
      "hadith_no": "6177",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا يسرة بن صفوان، حدثنا إبراهيم، عن الزهري، عن القاسم، عن عائشة  رضى الله عنها  قالت دخل على النبي صلى الله عليه وسلم وفي البيت قرام فيه صور، فتلون وجهه، ثم تناول الستر فهتكه، وقالت قال النبي صلى الله عليه وسلم ‏\"‏ من أشد الناس عذابا يوم القيامة الذين يصورون هذه الصور ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet entered upon me while there was a curtain having pictures (of animals) in the house. His face got red with anger, and then he got hold of the curtain and tore it into pieces. The Prophet said, \"Such people as paint these pictures will receive the severest punishment on the Day of Resurrection .\"",
      "chain": [
        "27558",
        "20150",
        "11013",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "7565",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يسرة بن صفوان بن جميل اللخمي، حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا نائم رأيتني على قليب فنزعت ما شاء الله أن أنزع، ثم أخذها ابن أبي قحافة فنزع ذنوبا أو ذنوبين وفي نزعه ضعف، والله يغفر له، ثم أخذها عمر فاستحالت غربا، فلم أر عبقريا من الناس يفري فريه، حتى ضرب الناس حوله بعطن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While I was sleeping, I saw myself (in a dream) standing by a well. I drew from it as much water as Allah wished me to draw, and then Ibn Quhafa (Abu Bakr) took the bucket from me and drew one or two buckets, and there was weakness in his drawing----may Allah forgive him! Then `Umar took the bucket which turned into something like a big drum. I had never seen a powerful man among the people working as perfectly and vigorously as he did. (He drew so much water that) the people drank to their satisfaction and watered their camels that knelt down there. (See Hadith No. 16, Vol. 5)",
      "chain": [
        "27558",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}