{
  "id": "28",
  "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
  "full_name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "50",
      "date_gregorian": "573",
      "date_display": [
        "50 BH",
        "573 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "43",
      "date_gregorian": "664",
      "date_display": null,
      "place": "Egypt",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah",
      "Egypt",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Commander",
      "Governor"
    ],
    "tags": [
      "Quraish",
      "B.Sahm",
      "Late Muslim",
      "Messenger",
      "Scribe"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "417",
      "name": "Rayta bint Munabbih bin al-Hajjaj ( ريطة بنت منبه بن الحجاج ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "95",
      "name": "Umm Kulthum bint 'Uqba ( أم كلثوم بنت عقبة بن أبي معيط ( رضي الله عنها",
      "grade": "Comp.(RA) [3rd Generation]"
    }
  ],
  "siblings": [
    {
      "id": "144",
      "name": "Hisham ibn al-'Aas ( هشام بن العاصي بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11452",
      "name": "Abu Qays Client Of 'Amr bin al-Aas أبو قيس مولى عمرو بن العاص",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10870",
      "name": "'Ali bin Rabah bin Qasayr علي بن رباح بن قصير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10867",
      "name": "'Abdur Rahman bin Shmas'h عبد الرحمن بن شماسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19817",
      "name": "'Ammara bin Khuzayma bin Thabit عمارة بن خزيمة بن ثابت الأنصاري الأوسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3706",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد العزيز بن المختار، قال خالد الحذاء حدثنا عن أبي عثمان، قال حدثني عمرو بن العاص  رضى الله عنه  أن النبي صلى الله عليه وسلم بعثه على جيش ذات السلاسل، فأتيته فقلت أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏‏.‏ فقلت من الرجال فقال ‏\"‏ أبوها ‏\"‏‏.‏ قلت ثم من قال ‏\"‏ ثم عمر بن الخطاب ‏\"‏‏.‏ فعد رجالا‏.‏",
      "text_en": " Narrated `Amr bin Al-As:                     The Prophet deputed me to read the Army of Dhat-as-Salasil. I came to him and said, \"Who is the most beloved person to you?\" He said, \" `Aisha.\" I asked, \"Among the men?\" He said, \"Her father.\" I said, \"Who then?\" He said, \"Then `Umar bin Al-Khattab.\" He then named other men.",
      "chain": [
        "30457",
        "20252",
        "11282",
        "11113",
        "28"
      ]
    },
    {
      "hadith_no": "6056",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، أن عمرو بن العاص، قال سمعت النبي صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ إن آل أبي ‏\"‏  قال عمرو في كتاب محمد بن جعفر بياض  ليسوا بأوليائي، إنما وليي الله وصالح المؤمنين‏.‏ زاد عنبسة بن عبد الواحد عن بيان عن قيس عن عمرو بن العاص قال سمعت النبي صلى الله عليه وسلم ‏\"‏ ولكن لهم رحم أبلها ببلالها ‏\"‏‏.‏ يعني أصلها بصلتها‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     I heard the Prophet saying openly not secretly, \"The family of Abu so-and-so (i.e. Talib) are not among my protectors.\" `Amr said that there was a blank space (1) in the Book of Muhammad bin Ja`far. He added, \"My Protector is Allah and the righteous believing people.\" `Amr bin Al-`As added: I heard the Prophet saying, 'But they (that family) have kinship (Rahm) with me and I will be good and dutiful to them. \"",
      "chain": [
        "30152",
        "20173",
        "20020",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "hadith_no": "7438",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، حدثني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران، وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏‏.‏ قال فحدثت بهذا الحديث أبا بكر بن عمرو بن حزم فقال هكذا حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة‏.‏ وقال عبد العزيز بن المطلب عن عبد الله بن أبي بكر، عن أبي سلمة، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     That he heard Allah's Apostle saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"",
      "chain": [
        "1945",
        "26010",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "541",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس، عن عمرو بن العاص، قال سمعت رسول الله صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ ألا إن آل أبي - يعني فلانا - ليسوا لي بأولياء إنما وليي الله وصالح المؤمنين ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. 'As reported:                      I heard it from the Messenger of Allah (may peace be upon him) quite audibly and not secretly: Behold! the posterity of my fathers, that is, so and so, are not my friends. Verily Allah and the pious believers are my friends.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "hadith_no": "2604",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن موسى بن على، عن أبيه، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فصل ما بين صيامنا وصيام أهل الكتاب أكلة السحر ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. al-'As reported Allah's Messenger (may peace be upon him) as saying:                      The difference between our fasting and that of the people of the Book is eating shortly before dawn.",
      "chain": [
        "30367",
        "20023",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "4584",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا عبد العزيز بن محمد، عن يزيد بن عبد، الله بن أسامة بن الهاد عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران ‏.‏ وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. al-'As reported that he heard Allah's Messenger (may peace be upon him) as saying:                      When a judge gives a decision, having tried his best to decide correctly and is right, there are two rewards for him; and if he gave a judgment after having tried his best (to arrive at a correct decision) but erred, there is one reward for him.",
      "chain": [
        "30399",
        "20167",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "6328",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن خالد، عن أبي عثمان، أخبرني  عمرو بن العاص، أن رسول الله صلى الله عليه وسلم بعثه على جيش ذات السلاسل فأتيته فقلت أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قلت من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ قلت ثم من قال ‏\"‏ عمر ‏\"‏ ‏.‏ فعد رجالا ‏.‏",
      "text_en": " 'Amr b. al-'As reported that Allah's Messenger (may peace be upon him) sent him in command of the army despatched to Dhat-as-Salasil. When 'Amr b. al-'As came back to the Holy Prophet (may peace be upon him) he said:                      Who amongst people are dearest to you? He said: A'isha. He then said: Who amongst men? He said: Her father, and I said: And who next? He said: Umar. He then enumerated some other men.",
      "chain": [
        "30399",
        "20423",
        "11282",
        "11113",
        "28"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن المثنى، أخبرنا وهب بن جرير، أخبرنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير المصري، عن عمرو بن العاص، قال احتلمت في ليلة باردة في غزوة ذات السلاسل فأشفقت إن اغتسلت أن أهلك فتيممت ثم صليت بأصحابي الصبح فذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ يا عمرو صليت بأصحابك وأنت جنب ‏\"‏ ‏.‏ فأخبرته بالذي منعني من الاغتسال وقلت إني سمعت الله يقول ‏{‏ ولا تقتلوا أنفسكم إن الله كان بكم رحيما ‏}‏ فضحك رسول الله صلى الله عليه وسلم ولم يقل شيئا ‏.‏ قال أبو داود عبد الرحمن بن جبير مصري مولى خارجة بن حذافة وليس هو ابن جبير بن نفير ‏.‏",
      "text_en": " Narrated Amr ibn al-'As:                     I had a sexual dream on a cold night in the battle of Dhat as-Salasil. I was afraid, if I washed I would die. I, therefore, performed tayammum and led my companions in the dawn prayer. They mentioned that to the Messenger of Allah (ﷺ). He said: Amr, you led your companions is prayer while you were sexually defiled? I informed him of the cause which impeded me from washing. And I said: I heard Allah say: \"Do not kill yourself, verily Allah is merciful to you.\" The Messenger of Allah (ﷺ) laughed and did not say anything.Abu Dawud said: 'Abd al-Rahman b. Jubair is an Egyptian and a freed slave of Kharijah b. Hudhafah. He is not Jubair b. Nufair",
      "chain": [
        "30170",
        "20298",
        "11272",
        "20379",
        "11411",
        "10605",
        "10865",
        "28"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن ابن لهيعة، وعمرو بن الحارث، عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير، عن أبي قيس، مولى عمرو بن العاص أن عمرو بن العاص، كان على سرية وذكر الحديث نحوه ‏.‏ قال فغسل مغابنه وتوضأ وضوءه للصلاة ثم صلى بهم فذكر نحوه ولم يذكر التيمم ‏.‏ قال أبو داود ورويت هذه القصة عن الأوزاعي عن حسان بن عطية قال فيه فتيمم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbu Qais, the freed slave of 'Amr b. al-'As, said 'Amr b. al-'As was in a battle. He then narrated the rest of the tradition. He then said:                      He washed his armpits and other joints where dirt was found, and he performed ablution like that for prayer. Then he led them in prayer. He then narrated the tradition in a similar way but did not mention of tayammum.Abu Dawud said: This incident has also been narrated by al-'Awza'i on the authority of Hassan b. 'Atiyyah. This version has the words: Then he performed tayammum.",
      "chain": [
        "30491",
        "20029",
        "20624",
        "20377",
        "11411",
        "10605",
        "10865",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "1401",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الرحيم بن البرقي، حدثنا ابن أبي مريم، أخبرنا نافع بن يزيد، عن الحارث بن سعيد العتقي، عن عبد الله بن منين، - من بني عبد كلال - عن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم أقرأه خمس عشرة سجدة في القرآن منها ثلاث في المفصل وفي سورة الحج سجدتان ‏.‏ قال أبو داود روي عن أبي الدرداء عن النبي صلى الله عليه وسلم إحدى عشرة سجدة وإسناده واه ‏.‏",
      "text_en": " Narrated Amr ibn al-'As:                     The Prophet (ﷺ) taught me fifteen prostrations while reciting the Qur'an, including three in al-Mufassal and two in Surah al-Hajj.Abu Dawud said: Abu al-Darda' has reported eleven prostrations from the Prophet (ﷺ), but chain of this tradition is weak.",
      "chain": [
        "30272",
        "30232",
        "20629",
        "28087",
        "16059",
        "28"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، أن محمد بن جعفر، حدثهم ح، وحدثنا ابن المثنى، حدثنا عبد الأعلى، عن سعيد، عن مطر، عن رجاء بن حيوة، عن قبيصة بن ذؤيب، عن عمرو بن العاص، قال لا تلبسوا علينا سنته - قال ابن المثنى سنة نبينا - صلى الله عليه وسلم عدة المتوفى عنها أربعة أشهر وعشر ‏.‏ يعني أم الولد ‏.‏",
      "text_en": " Narrated Amr ibn al-'As:                     Do not confuse us about his Sunnah. Ibn al-Muthanna said: The Sunnah of our Prophet (ﷺ) is that the waiting period of a slave-mother whose husband has died is four months and ten days.",
      "chain": [
        "30367",
        "20173",
        "30170",
        "20246",
        "11168",
        "10910",
        "28"
      ]
    },
    {
      "hadith_no": "2343",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن المبارك، عن موسى بن على بن رباح، عن أبيه، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن فصل ما بين صيامنا وصيام أهل الكتاب أكلة السحر ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. al-'As:                     The Messenger of Allah (ﷺ) as saying: The difference between our fasting and that of the people of the Book is eating shortly before dawn.",
      "chain": [
        "30175",
        "20025",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "3574",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد العزيز، - يعني ابن محمد - أخبرني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ فحدثت به أبا بكر بن حزم فقال هكذا حدثني أبو سلمة عن أبي هريرة ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: \"Judges are of three types, one of who will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgement accordingly; by a man who knows what is right and acts tyrannically in his judgement will go to Hell; and a man who gives judgement for people when he is ignorant will go to Hell.\"Abu Dawud said: On this subject this is the soundest tradition, that is m the tradition of Ibn Buraidah: Judges are of three types.",
      "chain": [
        "30024",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "5008",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن عبد الحميد البهراني، أنه قرأ في أصل إسماعيل بن عياش وحدثه محمد بن إسماعيل ابنه قال حدثني أبي قال حدثني ضمضم عن شريح بن عبيد قال حدثنا أبو ظبية أن عمرو بن العاص قال يوما وقام رجل فأكثر القول فقال عمرو لو قصد في قوله لكان خيرا له سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لقد رأيت أو أمرت أن أتجوز في القول فإن الجواز هو خير ‏\"‏ ‏.‏",
      "text_en": " One day when a man got up and spoke at length Amr ibn al-'As said If he had been moderate in what he said:                      It would have been better for him. I heard the Messenger of Allah (ﷺ) say: I think (or, I have been commanded) that I should be brief in what I say, for brevity is better.",
      "chain": [
        "34188",
        "18414",
        "28"
      ]
    },
    {
      "hadith_no": "4259",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، ومحمد بن بشار، واللفظ، لابن يعقوب قالا حدثنا يحيى بن حماد، حدثنا عبد العزيز بن المختار، حدثنا خالد الحذاء، عن أبي عثمان النهدي، عن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم استعمله على جيش ذات السلاسل ‏.‏ قال فأتيته فقلت يا رسول الله أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قلت من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Amr bin Al-'As:                     that the Messenger of Allah (ﷺ) appointed him as a leader of the army of Dhatis-Salasil. He said: \"So I went to him and said: 'O Messenger of Allah! Who is the most beloved to you among the people?' He said: ''Aishah.' I said: 'From the men?' He said: 'Her father.'\"",
      "chain": [
        "38088",
        "30160",
        "20574",
        "20252",
        "11282",
        "11113",
        "28"
      ]
    },
    {
      "hadith_no": "4260",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا يحيى بن سعيد الأموي، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن عمرو بن العاص، أنه قال يا رسول الله من أحب الناس إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قال من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه من حديث إسماعيل عن قيس ‏.‏",
      "text_en": " Narrated 'Amr bin Al-'As:                     that he said to the Messenger of Allah (ﷺ): \"Who is the most beloved of the people to you?\" He said: \"'Aishah.\" He said: \"From the men?\" He said: \"Her farther.\"",
      "chain": [
        "30498",
        "20367",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "hadith_no": "2166",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن موسى بن على، عن أبيه، عن أبي قيس، عن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن فصل ما بين صيامنا وصيام أهل الكتاب أكلة السحور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Al-As said:                     \"The Messenger of Allah said: 'The difference between our fasting and the fasting of the people of the Book, is eating Sahur.\"' '",
      "chain": [
        "30367",
        "20023",
        "28"
      ]
    },
    {
      "hadith_no": "1110",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا ابن أبي مريم، عن نافع بن يزيد، حدثنا الحارث بن سعيد العتقي، عن عبد الله بن منين، - من بني عبد كلال - عن عمرو بن العاص، أن رسول الله  صلى الله عليه وسلم  أقرأه خمس عشرة سجدة في القرآن منها ثلاث في المفصل وفي الحج سجدتين ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin ‘As that the Messenger of Allah (ﷺ)taught him fifteen prostrations in the Qur’an, including three intheMufassal and two in Al-Hajj.",
      "chain": [
        "11222",
        "30232",
        "20629",
        "28087",
        "16059",
        "28"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سعيد بن أبي عروبة، عن مطر الوراق، عن رجاء بن حيوة، عن قبيصة بن ذؤيب، عن عمرو بن العاص، قال لا تفسدوا علينا سنة نبينا محمد  صلى الله عليه وسلم  عدة أم الولد أربعة أشهر وعشرا ‏.‏",
      "text_en": " It was narrated that 'Amr bin 'As said:                     \"Do not corrupt the Sunnah of our Prophet Muhammad (ﷺ). The waiting period of an Umm Walad is four months and ten (days).\"",
      "chain": [
        "38409",
        "20032",
        "11073",
        "10719",
        "10910",
        "28"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد العزيز بن محمد الدراوردي، حدثنا يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم التيمي، عن بسر بن سعيد، عن أبي قيس، - مولى عمرو بن العاص - عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ قال يزيد فحدثت به أبا بكر بن عمرو بن حزم، فقال هكذا حدثنيه أبو سلمة، عن أبي هريرة‏.‏",
      "text_en": " It was narrated from 'Amr bin 'As that he heard the Messenger of Allah (ﷺ) say:                     “When the judge passes a judgement and does his best and gets it right, he will have two rewards, and if he passes a judgement and does his best and gets it wrong, he will have one reward.” (Sahih)Yazid (one of narrators) said : “So I Narrated it to Abu Bakr bin 'Amr bin Hazm. He said: 'This is how it was narrated to me by Abu Salamah from Abu Hurairah.'”",
      "chain": [
        "30288",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    }
  ],
  "total_hadiths": 20
}