{
  "id": "28001",
  "name": "Ahmed bin 'Ali al-Nmyry أحمد بن علي النميري",
  "full_name": "Ahmed bin 'Ali al-Nmyry أحمد بن علي النميري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  -  صدوق ]"
    ],
    "tags": [
      "al-Azdi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "37534",
      "name": "Mhmwd bin Khalid محمود بن خالد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "91",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا أحمد بن علي، حدثنا ثور، عن يزيد بن شريح الحضرمي، عن أبي حى المؤذن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل يؤمن بالله واليوم الآخر أن يصلي وهو حقن حتى يتخفف ‏\"‏ ‏.‏ ثم ساق نحوه على هذا اللفظ قال ‏\"‏ ولا يحل لرجل يؤمن بالله واليوم الآخر أن يؤم قوما إلا بإذنهم ولا يختص نفسه بدعوة دونهم فإن فعل فقد خانهم ‏\"‏ ‏.‏ قال أبو داود هذا من سنن أهل الشام لم يشركهم فيها أحد ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not permissible for a man who believes in Allah and in the Last Day that he should say the prayer while he is feeling the call of nature until he becomes light (by relieving himself).Then the narrator Thawr b. Yazid transmitted a similar tradition with the following wordings: \"It is not permissible for a man who believes in Allah and in the Last Day that he should lead the people in prayer but with their permission; and that he should not supplicate to Allah exclusively for himself leaving all others. If he did so, he violated trust.\"Abu Dawud said: This is a tradition reported by the narrators of Syria; no other person has joined them in relating this tradition.",
      "chain": [
        "37534",
        "28001",
        "11155",
        "19173",
        "18410",
        "13"
      ]
    },
    {
      "hadith_no": "543",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن علي بن سويد بن منجوف السدوسي، حدثنا عون بن كهمس، عن أبيه، كهمس قال قمنا إلى الصلاة بمنى والإمام لم يخرج فقعد بعضنا فقال لي شيخ من أهل الكوفة ما يقعدك قلت ابن بريدة ‏.‏ قال هذا السمود ‏.‏ فقال لي الشيخ حدثني عبد الرحمن بن عوسجة عن البراء بن عازب قال كنا نقوم في الصفوف على عهد رسول الله صلى الله عليه وسلم طويلا قبل أن يكبر قال وقال ‏\"‏ إن الله وملائكته يصلون على الذين يلون الصفوف الأول وما من خطوة أحب إلى الله من خطوة يمشيها يصل بها صفا ‏\"‏ ‏.‏",
      "text_en": " ‘Awn b. Kahmas reported on the authority of his father Kahmas :                      we stood for praying at Mina when the Imam had not come out. Some of us sat down (and I too). An old man from Kufah said to me: Why did you down? I said : Ibn Buraidah, this is Sumud (i.e., waiting for the Imam in the standing condition). The old man then narrated a tradition from ‘Abd al-Rahman b. ‘Awaajah on the authority of al-Bara’ b. ‘Azib: We would stand in rows during the time of the Messenger of Allah (ﷺ) for a long time before he pronounced Takbir. He further said; Allah, the Exalted and Mighty, sends blessings and the angles invoke blessings for those who are nearer to the front rows. No step is more liking to Allah than a step which one takes to join the row (of the prayer).",
      "chain": [
        "28001",
        "19875",
        "400"
      ]
    },
    {
      "hadith_no": "1524",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن علي بن سويد السدوسي، حدثنا أبو داود، عن إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، أن رسول الله صلى الله عليه وسلم كان يعجبه أن يدعو ثلاثا ويستغفر ثلاثا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) liked to supplicate three times and to ask pardon (of Allah) three times.",
      "chain": [
        "28001",
        "30002",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "3026",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن علي بن سويد، - يعني ابن منجوف - حدثنا أبو داود، عن حماد بن سلمة، عن حميد، عن الحسن، عن عثمان بن أبي العاص، أن وفد، ثقيف لما قدموا على رسول الله صلى الله عليه وسلم أنزلهم المسجد ليكون أرق لقلوبهم فاشترطوا عليه أن لا يحشروا ولا يعشروا ولا يجبوا فقال رسول الله صلى الله عليه وسلم ‏\"‏ لكم أن لا تحشروا ولا تعشروا ولا خير في دين ليس فيه ركوع ‏\"‏ ‏.‏",
      "text_en": " Narrated Uthman ibn Abul'As:                     When the deputation of Thaqif came to the Messenger of Allah (ﷺ), he made them stay in the mosque, so that it might soften their hearts. They stipulated to him that they would not be called to participate in Jihad, to pay zakat and to offer prayer. The Messenger of Allah (ﷺ) said: You may have the concession that you will not be called to participate in jihad and pay zakat, but there is no good in a religion which has no bowing (i.e. prayer).",
      "chain": [
        "28001",
        "30002",
        "20021",
        "11279",
        "11016",
        "3210"
      ]
    },
    {
      "hadith_no": "3935",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، ح وحدثنا أحمد بن علي بن سويد، حدثنا روح، قالا حدثنا شعبة، عن قتادة، بإسناده عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق مملوكا بينه وبين آخر فعليه خلاصه ‏\"‏ ‏.‏ وهذا لفظ ابن سويد ‏.‏",
      "text_en": " Qatadah narrated with his chain of narrators:                      The Prophet (ﷺ) said: If a man emancipates a slave shared by him with another man, his emancipation rests with him (who emancipated his share). This is the version of Ibn Suwaid.",
      "chain": [
        "30170",
        "20173",
        "28001",
        "20229",
        "20020"
      ]
    },
    {
      "hadith_no": "3936",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا ابن المثنى، حدثنا معاذ بن هشام، حدثني أبي ح، وحدثنا أحمد بن علي بن سويد، حدثنا روح، حدثنا هشام بن أبي عبد الله، عن قتادة، بإسناده أن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق نصيبا له في مملوك عتق من ماله إن كان له مال ‏\"‏ ‏.‏ ولم يذكر ابن المثنى النضر بن أنس وهذا لفظ ابن سويد ‏.‏",
      "text_en": " Qatadah narrated with his chain of narrators. The Prophet (ﷺ) said:                      If anyone emancipates his share in a slave, he emancipates him (completely) by his property if he has property. The narrator Ibn al-Muthanna did not mention al-Nadr b. Anas. This is the version of Ibn Suwaid.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "28001",
        "20229"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن علي، قال حدثنا محمد بن أبي بكر، قال حدثنا عمر بن علي، قال حدثنا إبراهيم بن عقبة، عن أبي الزناد، عن القاسم بن محمد، عن ابن عباس، قال لاعن رسول الله صلى الله عليه وسلم بين العجلاني وامرأته وكانت حبلى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah conducted the procedure of Li'an between the 'Ajlani and his wife, who was pregnant.\"",
      "chain": [
        "28001",
        "11214",
        "20265",
        "11125",
        "11061",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "5405",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبد الأعلى بن حماد، قال حدثنا بشر بن السري، قال حدثنا عبد الله بن المبارك، عن معمر، ح وأنبأنا أحمد بن علي بن سعيد، قال حدثنا يحيى بن معين، قال حدثنا هشام بن يوسف، وعبد الرزاق، عن معمر، عن الزهري، عن سالم، عن أبيه، قال بعث النبي صلى الله عليه وسلم خالد بن الوليد إلى بني جذيمة فدعاهم إلى الإسلام فلم يحسنوا أن يقولوا أسلمنا فجعلوا يقولون صبأنا وجعل خالد قتلا وأسرا - قال - فدفع إلى كل رجل أسيره حتى إذا أصبح يومنا أمر خالد بن الوليد أن يقتل كل رجل منا أسيره ‏.‏ قال ابن عمر فقلت والله لا أقتل أسيري ولا يقتل أحد - وقال بشر - من أصحابي أسيره - قال - فقدمنا على النبي صلى الله عليه وسلم فذكر له صنع خالد فقال النبي صلى الله عليه وسلم ورفع يديه ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ قال زكريا في حديثه فذكر وفي حديث بشر فقال ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"The Prophet [SAW] sent Khalid bin Al-Walid to Banu Jadhimah. He called them to Islam, but they could not say Aslamna (we submitted, i.e., became Muslim) so they started to say Saba'na (we changed our religion). Khalid started killing and taking prisoners, and he gave a prisoner to each man. The next day Khalid bin Al-Walid issued orders that each man among us kill his prisoner.\" Ibn 'Umar said: \"I said: 'By Allah, I will not kill my prisoner, and no one (among my companions) will kill his prisoner.' We came to the Prophet [SAW], and he was told of what Khalid had done. The Prophet [SAW] said: 'I disavow what Khalid has done,' twice.\"",
      "chain": [
        "30146",
        "20190",
        "20025",
        "20115",
        "28001",
        "30020",
        "20467",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5755",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن علي بن سعيد بن إبراهيم، قال حدثنا القواريري، قال حدثنا معتمر بن سليمان، عن أبيه، عن محمد، عن عبيدة، عن ابن مسعود، قال أحدث الناس أشربة ما أدري ما هي فما لي شراب منذ عشرين سنة أو قال أربعين سنة إلا الماء والسويق غير أنه لم يذكر النبيذ ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"The people have invented new drinks and I do not know what they are. I have not drunk anything for 20 years (or he said: 40 years) except water and Sawiq (barley gruel), and he did not mention Nabidh.\"",
      "chain": [
        "28001",
        "30024",
        "20288",
        "11289",
        "11035",
        "11370",
        "16"
      ]
    }
  ],
  "total_hadiths": 9
}