{
  "id": "28015",
  "name": "Ibrahim bin 'Amr إبراهيم بن عمرو ويقال",
  "full_name": "Ibrahim bin 'Amr إبراهيم بن عمرو ويقال",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Not Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'",
      "Sana'",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [مد  أبي  داود  في  المراسيل]"
    ],
    "tags": [
      "al-Sana'i",
      "Sana'",
      "Damascus"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3680",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن رافع النيسابوري، حدثنا إبراهيم بن عمر الصنعاني، قال سمعت النعمان، يقول عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل مخمر خمر وكل مسكر حرام ومن شرب مسكرا بخست صلاته أربعين صباحا فإن تاب تاب الله عليه فإن عاد الرابعة كان حقا على الله أن يسقيه من طينة الخبال ‏\"‏ ‏.‏ قيل وما طينة الخبال يا رسول الله قال ‏\"‏ صديد أهل النار ومن سقاه صغيرا لا يعرف حلاله من حرامه كان حقا على الله أن يسقيه من طينة الخبال ‏\"‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     The Messenger of Allah (ﷺ) said: Every intoxicant is khamr (wine) and every intoxicant is forbidden. If anyone drinks wine, Allah will not accept prayer from him for forty days, but if he repents, Allah will accept his repentance. If he repeats it a fourth time, it is binding on Allah that He will give him tinat al-khabal to drink.  He was asked: What is tinat al-khabal, Messenger of Allah?  He replied: Discharge of wounds, flowing from the inhabitants of Hell. If anyone serves it to a minor who does not distinguish between the lawful and the unlawful, it is binding on Allah that He will give him to drink the discharge of wounds, flowing from the inhabitants of Hell.",
      "chain": [
        "30375",
        "28015",
        "274",
        "11053",
        "17"
      ]
    }
  ],
  "total_hadiths": 1
}