{
  "id": "2803",
  "name": "'Abdur Rahman bin Shayba ( عبد الرحمن بن شيبة بن عثمان الحجبي ( رضي الله عنه",
  "full_name": "'Abdur Rahman bin Shayba ( عبد الرحمن بن شيبة بن عثمان الحجبي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ س  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.'Abd al-Dar",
      "al-Hajb",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "2801",
      "name": "Shayba bin 'Uthman ( شيبة بن عثمان الحجبي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2805",
      "name": "Umm 'Uthman or Umm Walad Shayba ( أم عثمان بنت سفيان/ أم ولد شيبة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2804",
      "name": "Mus'ub bin Shayba ( مصعب بن شيبة بن عثمان الحجبي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3676",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الرحمن بن شيبة، حدثنا عبد الرحمن بن المغيرة، عن أبيه، عن موسى بن عقبة، عن سالم بن عبد الله، عن عبد الله  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رأيت الناس مجتمعين في صعيد، فقام أبو بكر فنزع ذنوبا أو ذنوبين، وفي بعض نزعه ضعف، والله يغفر له، ثم أخذها عمر، فاستحالت بيده غربا، فلم أر عبقريا في الناس يفري فريه، حتى ضرب الناس بعطن ‏\"‏‏.‏ وقال همام عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ فنزع أبو بكر ذنوبين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"I saw (in a dream) the people assembled in a gathering, and then Abu Bakr got up and drew one or two buckets of water (from a well) but there was weakness in his drawing. May Allah forgive him. Then `Umar took the bucket and in his hands it turned into a very large bucket. I had never seen anyone amongst: the people who could draw the water as strongly as `Umar till all the people drank their fill and watered their camels that knelt down there.",
      "chain": [
        "2803",
        "2801",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5487",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الرحمن بن شيبة، قال أخبرني ابن أبي الفديك، عن ابن أبي ذئب، عن المقبري، عن أبي هريرة، قال كنت ألزم النبي صلى الله عليه وسلم لشبع بطني حين لا آكل الخمير، ولا ألبس الحرير، ولا يخدمني فلان ولا فلانة، وألصق بطني بالحصباء، وأستقرئ الرجل الآية وهى معي كى ينقلب بي فيطعمني، وخير الناس للمساكين جعفر بن أبي طالب، ينقلب بنا فيطعمنا ما كان في بيته، حتى إن كان ليخرج إلينا العكة ليس فيها شىء، فنشتقها فنلعق ما فيها‏.‏",
      "text_en": " Narrated Abu Huraira:                     I used to accompany Allah's Apostle to fill my stomach; and that was when I did not eat baked bread, nor wear silk. Neither a male nor a female slave used to serve me, and I used to bind stones over my belly and ask somebody to recite a Qur'anic Verse for me though I knew it, so that he might take me to his house and feed me. Ja`far bin Abi Talib was very kind to the poor, and he used to take us and feed us with what ever was available in his house, (and if nothing was available), he used to give us the empty (honey or butter) skin which we would tear and lick whatever was in it.",
      "chain": [
        "2803",
        "20177",
        "11168",
        "13"
      ]
    }
  ],
  "total_hadiths": 2
}