{
  "id": "28079",
  "name": "Jryr bin Yazid bin Jryr جرير بن يزيد بن جرير",
  "full_name": "Jryr bin Yazid bin Jryr جرير بن يزيد بن جرير",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ س  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Bajli"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4904",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عيسى بن يزيد، قال حدثني جرير بن يزيد، أنه سمع أبا زرعة بن عمرو بن جرير، يحدث أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ حد يعمل في الأرض خير لأهل الأرض من أن يمطروا ثلاثين صباحا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: 'A Hadd punishment that is carried out on earth is better for the people of earth than if it were to rain for thirty mornings.\"' (Daif)",
      "chain": [
        "38265",
        "20025",
        "28079",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "4905",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن زرارة، قال أنبأنا إسماعيل، قال حدثنا يونس بن عبيد، عن جرير بن يزيد، عن أبي زرعة، قال قال أبو هريرة إقامة حد بأرض خير لأهلها من مطر أربعين ليلة ‏.‏",
      "text_en": " It was narrated that Abu Zurah said:                     \"Abu Hurairah said: 'Carrying out a Hadd punishment in a land is better for its people than if it were to rain for forty nights.\" (Daif)",
      "chain": [
        "30365",
        "20208",
        "11075",
        "28079",
        "11406"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، قال حدثنا بقية، عن جرير بن يزيد، قال حدثني منذر، حدثني محمد بن المنكدر، عن جابر، قال مر رسول الله  صلى الله عليه وسلم  برجل يتوضأ ويغسل خفيه فقال بيده كأنه دفعه ‏\"‏ إنما أمرت بالمسح ‏\"‏ ‏.‏ وقال رسول الله  صلى الله عليه وسلم  بيده هكذا من أطراف الأصابع إلى أصل الساق وخطط بالأصابع ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah passed by a man who was performing ablution and washing his leather socks. He gestures with his hand, (and said): 'Rather I have been commanded to wipe them.' The Messenger of Allah gestured with his hand like this, from the tips of the toes to the base of the shin, tracing lines with his fingers.\"",
      "chain": [
        "20644",
        "28079",
        "11398",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2635",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا عبد الله بن المبارك، أنبأنا عيسى بن يزيد، أظنه عن جرير بن يزيد، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حد يعمل به في الأرض خير لأهل الأرض من أن يمطروا أربعين صباحا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “A legal punishment that is carried out in the land is better for the people of that land than if it were to rain for forty days.”",
      "chain": [
        "18792",
        "20025",
        "28079",
        "11406",
        "13"
      ]
    }
  ],
  "total_hadiths": 4
}