{
  "id": "28131",
  "name": "Hmad bin Dlyl حماد بن دليل",
  "full_name": "Hmad bin Dlyl حماد بن دليل",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Mada'in"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  -  صدوق ]"
    ],
    "tags": [
      "Judge",
      "al-Mada'in"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20598",
      "name": "Fdyl bin Mrzwq al-Aghr al-Rqashy فضيل بن مرزوق الأغر الرقاشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19035",
      "name": "al-Mughira bin Muslim المغيرة بن مسلم القسملي أبو سلمة السراج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "28040",
      "name": "Asad bin Musa - Asad al-Sunnah أسد بن موسى بن إبراهيم - أسد السنة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23066",
      "name": "Mu'ml bin Isma'il al-Dwy Mwla مؤمل بن إسماعيل العدوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20630",
      "name": "Ishaq bin 'Isa bin Njyh إسحاق بن عيسى بن نجيح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "31300",
      "name": "Zuhyr bin 'Aabad al-Rwasy bin Am زهير بن عباد",
      "grade": "3rd Century AH"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30421",
      "name": "Muhammad bin Yahya bin Abi 'Umar محمد بن يحيى بن أبي عمر العدني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4612",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، قال حدثنا سفيان، قال كتب رجل إلى عمر بن عبد العزيز يسأله عن القدر، ح وحدثنا الربيع بن سليمان المؤذن، قال حدثنا أسد بن موسى، قال حدثنا حماد بن دليل، قال سمعت سفيان الثوري، يحدثنا عن النضر، ح وحدثنا هناد بن السري، عن قبيصة، قال حدثنا أبو رجاء، عن أبي الصلت، - وهذا لفظ حديث ابن كثير ومعناهم - قال كتب رجل إلى عمر بن عبد العزيز يسأله عن القدر فكتب أما بعد أوصيك بتقوى الله والاقتصاد في أمره واتباع سنة نبيه صلى الله عليه وسلم وترك ما أحدث المحدثون بعد ما جرت به سنته وكفوا مؤنته فعليك بلزوم السنة فإنها لك بإذن الله عصمة ثم اعلم أنه لم يبتدع الناس بدعة إلا قد مضى قبلها ما هو دليل عليها أو عبرة فيها فإن السنة إنما سنها من قد علم ما في خلافها ولم يقل ابن كثير من قد علم ‏.‏ من الخطإ والزلل والحمق والتعمق فارض لنفسك ما رضي به القوم لأنفسهم فإنهم على علم وقفوا وببصر نافذ كفوا ولهم على كشف الأمور كانوا أقوى وبفضل ما كانوا فيه أولى فإن كان الهدى ما أنتم عليه لقد سبقتموهم إليه ولئن قلتم إنما حدث بعدهم ‏.‏ ما أحدثه إلا من اتبع غير سبيلهم ورغب بنفسه عنهم فإنهم هم السابقون فقد تكلموا فيه بما يكفي ووصفوا منه ما يشفي فما دونهم من مقصر وما فوقهم من محسر وقد قصر قوم دونهم فجفوا وطمح عنهم أقوام فغلوا وإنهم بين ذلك لعلى هدى مستقيم كتبت تسأل عن الإقرار بالقدر فعلى الخبير بإذن الله وقعت ما أعلم ما أحدث الناس من محدثة ولا ابتدعوا من بدعة هي أبين أثرا ولا أثبت أمرا من الإقرار بالقدر لقد كان ذكره في الجاهلية الجهلاء يتكلمون به في كلامهم وفي شعرهم يعزون به أنفسهم على ما فاتهم ثم لم يزده الإسلام بعد إلا شدة ولقد ذكره رسول الله صلى الله عليه وسلم في غير حديث ولا حديثين وقد سمعه منه المسلمون فتكلموا به في حياته وبعد وفاته يقينا وتسليما لربهم وتضعيفا لأنفسهم أن يكون شىء لم يحط به علمه ولم يحصه كتابه ولم يمض فيه قدره وإنه مع ذلك لفي محكم كتابه منه اقتبسوه ومنه تعلموه ولئن قلتم لم أنزل الله آية كذا ولم قال كذا ‏.‏ لقد قرءوا منه ما قرأتم وعلموا من تأويله ما جهلتم وقالوا بعد ذلك كله بكتاب وقدر وكتبت الشقاوة وما يقدر يكن وما شاء الله كان وما لم يشأ لم يكن ولا نملك لأنفسنا ضرا ولا نفعا ثم رغبوا بعد ذلك ورهبوا ‏.‏",
      "text_en": " Sufyan said (according to one chain), and Abu al-Salit said (according to another chain):                      A man wrote to 'Umar b. 'Abd al-Aziz asking him about Divine decree. He wrote to him: To begin with, I enjoin upon you to fear Allah, to be moderate in (obeying) His Command, to follow the sunnah (practice) of His Prophet (ﷺ) and to abandon the novelties which the innovators introduced after his Sunnah has been established and they were saved from its trouble (i.e. novelty or innovation) ; so stick to Sunnah, for it is for you, if Allah chooses, a protection ; then you should know that any innovation which the people introduced was refuted long before it on the basis of some authority or there was some lesson in it, for the Sunnah was introduced by the people who were conscious of the error, slip, foolishness, and extremism in case of (the sunnah) was opposed. So accept for yourself what the people (in the past) had accepted for themselves, for they had complete knowledge of whatever they were informed, and by penetrating insight they forbade (to do prohibited acts); they had more strength (than us) to disclose the matters (of religion), and they were far better (than us) by virtue of their merits. If right guidance is what you are following, then you outstriped them to it. And if you say whatever the novelty occurred after them was introduced by those who followed the way other then theirs and disliked them. It is they who actually outstripped, and talked about it sufficiently, and gave a satisfactory explanation for it. Below them there is no place for exhaustiveness, and above them there is no place for elaborating things. Some people shortened the matter more than they had done, and thus they turned away (from them), and some people raised the matter more than they had done, and thus they exaggerated. They were on right guidance between that. You have written (to me) asking about confession of Divine decree, you have indeed approached a person who is well informed of it, with the will of Allah. I know what whatever novelty people have brought in, and whatever innovation people have introduced are not more manifest and more established than confession of Divine decree. The ignorant people (i.e. the Arabs before Islam) in pre-Islamic times have mentioned it ; they talked about it in their speeches and in their poetry. They would console themselves for what they lost, and Islam then strengthened it (i.e. belief in Divine decree). The Messenger of Allah (ﷺ) did not mention it in one or two traditions, but the Muslims heard it from him, and they talked of it from him, and they talked of it during his lifetime and after his death. They did so out of belief and submission to their Lord and thinking themselves weak. There is nothing which is not surrounded by His knowledge, and not counted by His register and not destined by His decree. Despite that, it has been strongly mentioned in His Book: from it they have derived it, and from it they have and so ? they also read in it what you read, and they knew its interpretation of which you are ignorant. After that they said: All this is by writing and decreeing. Distress has been written down, and what has been destined will occur ; what Allah wills will surely happen, and what He does not will will not happen. We have no power to harm or benefit ourselves. Then after that they showed interest (in good works) and were afraid (of bad deeds).",
      "chain": [
        "28531",
        "20012",
        "30583",
        "28040",
        "28131",
        "20291",
        "30480",
        "20351",
        "11440"
      ]
    }
  ],
  "total_hadiths": 1
}