{
  "id": "28187",
  "name": "Zuhyr bin Mrzwq زهير بن مرزوق",
  "full_name": "Zuhyr bin Mrzwq زهير بن مرزوق",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ ق  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "25197",
      "name": "'Ali bin Gharab علي بن غراب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2567",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عمار بن خالد الواسطي، حدثنا علي بن غراب، عن زهير بن مرزوق، عن علي بن زيد بن جدعان، عن سعيد بن المسيب، عن عائشة، أنها قالت يا رسول الله ما الشىء الذي لا يحل منعه قال الماء والملح والنار ‏\"‏ ‏.‏ قالت قلت يا رسول الله هذا الماء قد عرفناه فما بال الملح والنار قال ‏\"‏ يا حميراء من أعطى نارا فكأنما تصدق بجميع ما أنضجت تلك النار ومن أعطى ملحا ‏.‏ فكأنما تصدق بجميع ما طيب ذلك الملح ومن سقى مسلما شربة من ماء حيث يوجد الماء فكأنما أعتق رقبة ومن سقى مسلما شربة من ماء حيث لا يوجد الماء فكأنما أحياها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     “O Messenger of Allah (ﷺ), what are the things which are not permissible to withhold?” He said: “Water, salt and fire.” She said: “I said: 'O Messenger of Allah (ﷺ), we know what water is, but what about salt and fire?” He said: “O Humaira', whoever gives fire (to another), it is as if he has given in charity all the food that is cooked on that fire. And whoever gives salt, it is as if he has given in charity all that the salt makes good. And whoever gives a Muslim water to drink when water is available, it is as if he freed a slave; and whoever gives a Muslim water to drink when there is no water available, it is as if he brought him back to life.”",
      "chain": [
        "38417",
        "25197",
        "28187",
        "10664",
        "11002",
        "53"
      ]
    }
  ],
  "total_hadiths": 1
}