{
  "id": "28189",
  "name": "Ziyad bin 'Abdullah زياد بن عبد الله بن علاثة",
  "full_name": "Ziyad bin 'Abdullah زياد بن عبد الله بن علاثة",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hiran"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ق  -  ثقة ]"
    ],
    "tags": [
      "al-Aqayli",
      "al-Kalabi",
      "al-Hirani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "28523",
      "name": "Muhammad bin 'Abdullah bin 'Alatha محمد بن عبد الله بن علاثة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "18655",
      "name": "'Abdul al-Kareem bin Malik عبد الكريم بن مالك الجزري أبو سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12532",
      "name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "28523",
      "name": "Muhammad bin 'Abdullah bin 'Alatha محمد بن عبد الله بن علاثة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "26523",
      "name": "Mzfr Btshdyd al-Fa'a مظفر بتشديد الفاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30279",
      "name": "Mansur bin Salma bin 'Abdul 'Aziz منصور بن سلمة بن عبد العزيز",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1823",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو النضر، هاشم بن القاسم قال حدثنا زياد بن عبد الله بن علاثة، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن جابر بن عبد الله، وأنس بن مالك، قالا كان رسول الله صلى الله عليه وسلم إذا دعا على الجراد قال ‏\"‏ اللهم أهلك الجراد اقتل كباره وأهلك صغاره وأفسد بيضه واقطع دابره وخذ بأفواههم عن معاشنا وأرزاقنا إنك سميع الدعاء ‏\"‏ ‏.‏ قال فقال رجل يا رسول الله كيف تدعو على جند من أجناد الله بقطع دابره قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها نثرة حوت في البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وموسى بن محمد بن إبراهيم التيمي قد تكلم فيه وهو كثير الغرائب والمناكير وأبوه محمد بن إبراهيم ثقة وهو مدني ‏.‏",
      "text_en": " Narrated At-Taimi:                     From Jabir bin 'Abdullah and Anas bin Malik who said: \"When the Messenger of Allah (ﷺ) supplicated against locusts he would say: 'O Allah! Destroy the locusts, kill the large among him, and destroy the small, spoil his core, and cut off his rear. Take their mouths from our livelihood and our sustenance. Verily, You indeed listen to the supplication!' So a  man said: 'O Messenger of Allah! How is it that you supplicate against one of the Allah's armies that He cut off their rear?'\" He said: \"So the Messenger of Allah (ﷺ) said: 'They are bit scattered from a fish in the ocean.'\"[Abu 'Eisa said:] This Hadith is Gharib. We do not know of it except from this route. And Musa bin Muhammad bin Ibrahim At-Taimi has been criticized. He narrates many Gharib and Munkar narrations. His father Muhammad bin Ibrahim is trustworthy, and he is from Al-Madinah.",
      "chain": [
        "30277",
        "20390",
        "28189",
        "12532",
        "34",
        "19"
      ]
    },
    {
      "hadith_no": "3342",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا هاشم بن القاسم، حدثنا زياد بن عبد الله بن علاثة، عن موسى بن محمد بن إبراهيم، عن أبيه، عن جابر، وأنس بن مالك، أن النبي  صلى الله عليه وسلم  كان إذا دعا على الجراد قال ‏\"‏ اللهم أهلك كباره واقتل صغاره وأفسد بيضه واقطع دابره وخذ بأفواهها عن معايشنا وأرزاقنا إنك سميع الدعاء ‏\"‏ ‏.‏ فقال رجل يا رسول الله كيف تدعو على جند من أجناد الله بقطع دابره قال ‏\"‏ إن الجراد نثرة الحوت في البحر ‏\"‏ ‏.‏ قال هاشم قال زياد فحدثني من رأى الحوت ينثره ‏.‏",
      "text_en": " It wasnarrated from Jabir and Anas bin Malik that whenever theMessenger ofAllah (ﷺ) supplicated against the locusts, he said:                      “OAllah,destroy their large ones and kill their small ones, spoil theireggsand root them out. Take their mouths away from our livelihood andprovision, for You are the One Who hears the prayers.” A man said:“OMessenger of Allah, are you praying against one of the troops ofAllah, that they may be rooted out?” He said: “Locusts weresneezedout by the fish in the sea.”",
      "chain": [
        "30524",
        "20390",
        "28189",
        "34",
        "19"
      ]
    }
  ],
  "total_hadiths": 2
}