{
  "id": "28221",
  "name": "Salmah bin al-Fadl al-Abrash سلمة بن الفضل الأبرش",
  "full_name": "Salmah bin al-Fadl al-Abrash سلمة بن الفضل الأبرش",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "190",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ت  فق  -  صدوق ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "Ansar",
      "Client",
      "Judge",
      "al-Ray"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20746",
      "name": "Abu Ja'far al-Razi أبو جعفر الرازي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38495",
      "name": "Muhammad bin Hmyd bin Hyan محمد بن حميد بن حيان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30563",
      "name": "Muhammad bin 'Amr bin Bakr al-Razi محمد بن عمرو بن بكر الرازي زنيج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - أخبرنا محمد، - يعني ابن إسحاق - عن سليمان بن سحيم، عن أمية بنت أبي الصلت، عن امرأة، من بني غفار قد سماها لي قالت أردفني رسول الله صلى الله عليه وسلم على حقيبة رحله - قالت - فوالله لم يزل رسول الله صلى الله عليه وسلم إلى الصبح فأناخ ونزلت عن حقيبة رحله فإذا بها دم مني فكانت أول حيضة حضتها - قالت - فتقبضت إلى الناقة واستحييت فلما رأى رسول الله صلى الله عليه وسلم ما بي ورأى الدم قال ‏\"‏ ما لك لعلك نفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فأصلحي من نفسك ثم خذي إناء من ماء فاطرحي فيه ملحا ثم اغسلي ما أصاب الحقيبة من الدم ثم عودي لمركبك ‏\"‏ ‏.‏ قالت فلما فتح رسول الله صلى الله عليه وسلم خيبر رضخ لنا من الفىء - قالت - وكانت لا تطهر من حيضة إلا جعلت في طهورها ملحا وأوصت به أن يجعل في غسلها حين ماتت ‏.‏",
      "text_en": " Narrated Woman of Banu Ghifar:                     Umayyah, daughter of AbusSalt, quoted a certain woman of Banu Ghifar, whose name was mentioned to me, as saying: The Messenger of Allah (ﷺ) made me ride behind him on the rear of the camel saddle. By Allah, the Messenger of Allah (ﷺ) got down in the morning. He made his camel kneel down and I came down from the back of his saddle. There was a mark of blood on it (saddle) and that was the first menstruation that I had. I stuck to the camel and felt ashamed.  When the Messenger of Allah (ﷺ) saw what had happened to me and saw the blood, he said: Perhaps you are menstruating.  I said: Yes.  He then said: Set yourself right (i.e. tie some cloth to prevent bleeding), then take a vessel of water and put some salt in it, and then wash the blood from the back of the saddle, and then return to your mount. When the Messenger of Allah (ﷺ) conquered Khaybar, he gave us a portion of the booty. Whenever the woman became purified from her menses, she would put salt in water. And when she died, she left a will to put salt in the water for washing her (after death).",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11855"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، حدثني محمد بن إسحاق، عن محمد بن جعفر بن الزبير، ومحمد بن الأسود، عن عروة بن الزبير، عن أبي هريرة، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى نجد حتى إذا كنا بذات الرقاع من نخل لقي جمعا من غطفان فذكر معناه ولفظه على غير لفظ حيوة وقال فيه حين ركع بمن معه وسجد قال فلما قاموا مشوا القهقرى إلى مصاف أصحابهم ولم يذكر استدبار القبلة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     We went out with the Messenger of Allah (ﷺ) to Najd. When we reached Dhat ar-Riqa at Nakhl (or in a valley with palm trees) he met a group of the tribe of Ghatafan. The narrator then reported the tradition to the same effect, but his version is other than that of Haywah. He added to the words \"when he bowed along with those who were with him and prostrated\"  the words \"when they stood up, they retraced their footsteps to the rows of their companions\". He did not mention the words \"their back was towards the qiblah\".",
      "chain": [
        "30563",
        "28221",
        "11107",
        "11215",
        "10511",
        "13"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، ح وحدثنا محمد بن عمرو الرازي، حدثنا سلمة يعني ابن الفضل، ح وحدثنا الحسن بن علي، حدثنا يزيد، - المعنى - كلهم عن ابن إسحاق، عن داود بن الحصين، عن عكرمة، عن ابن عباس، قال رد رسول الله صلى الله عليه وسلم ابنته زينب على أبي العاصي بالنكاح الأول لم يحدث شيئا ‏.‏ قال محمد بن عمرو في حديثه بعد ست سنين وقال الحسن بن علي بعد سنتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) restored his daughter Zaynab to Abul'As on the basis of the previous marriage, and he did not do anything afresh.Muhammad b. 'Amr said in his version: After six years. Al-Hasan b. 'Ali said: After two years.",
      "chain": [
        "30352",
        "20672",
        "11220",
        "28221",
        "30",
        "11107",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - عن محمد بن إسحاق، حدثني يزيد بن رومان، عن عروة، عن عائشة، قالت ‏:‏ لما مات النجاشي كنا نتحدث أنه لا يزال يرى على قبره نور ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When Negus died, we were told that a light would be seen perpetually at his grave.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمرو الرازي، قال حدثنا سلمة، - يعني ابن الفضل - عن ابن إسحاق، قال حدثني عبد الله بن أبي بكر، عن يحيى بن عبد الله بن عبد الرحمن بن سعد بن زرارة، قال قدم بالأسارى حين قدم بهم وسودة بنت زمعة عند آل عفراء في مناخهم على عوف ومعوذ ابنى عفراء قال وذلك قبل أن يضرب عليهن الحجاب قال تقول سودة والله إني لعندهم إذ أتيت فقيل هؤلاء الأسارى قد أتي بهم ‏.‏ فرجعت إلى بيتي ورسول الله صلى الله عليه وسلم فيه وإذا أبو يزيد سهيل بن عمرو في ناحية الحجرة مجموعة يداه إلى عنقه بحبل ‏.‏ ثم ذكر الحديث ‏.‏ قال أبو داود وهما قتلا أبا جهل بن هشام وكانا انتدبا له ولم يعرفاه وقتلا يوم بدر ‏.‏",
      "text_en": " Narrated Sawdah daughter of Zam'ah:                     Yahya ibn Abdullah said: When the captives (of the battle of Badr) were brought, Sawdah daughter of Zam'ah was present with the children of Afra' at the halting place of their camels, that is, Awf and Mu'awwidh sons of Afra'. This happened before the prescription of veil for them. Sawdah said: I swear by Allah, I was with them when I came (from there to the people) and I was told: These are captives recently brought (here). I returned to my house, and the Messenger of Allah (ﷺ) was there, and AbuZayd Suhayl ibn Amr was in the corner of the apartment and his hands were tied up on his neck with a rope. He then narrated the rest of the tradition.Abu Dawud said: They (the sons of 'Afra') killed Abu Jahl b. Hisham. They were deputed for him though they did not realize him: and they were killed in the battle of Badr.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11104"
      ]
    },
    {
      "hadith_no": "2761",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - عن محمد بن إسحاق، قال كان مسيلمة كتب إلى رسول الله صلى الله عليه وسلم ‏.‏ قال وقد حدثني محمد بن إسحاق عن شيخ من أشجع يقال له سعد بن طارق عن سلمة بن نعيم بن مسعود الأشجعي عن أبيه نعيم قال سمعت رسول الله صلى الله عليه وسلم يقول لهما حين قرآ كتاب مسيلمة ‏\"‏ ما تقولان أنتما ‏\"‏ قالا نقول كما قال ‏.‏ قال ‏\"‏ أما والله لولا أن الرسل لا تقتل لضربت أعناقكما ‏\"‏ ‏.‏",
      "text_en": " Narrated Nu'aym ibn Mas'ud:                     I heard the Messenger of Allah (ﷺ) say when he read the letter of Musaylimah: What do you believe yourselves?  They said: We believe as he believes. He said: I swear by Allah that were it not that messengers are not killed, I would cut off your heads.",
      "chain": [
        "11220",
        "28221",
        "11107"
      ]
    },
    {
      "hadith_no": "3022",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - عن محمد بن إسحاق، عن العباس بن عبد الله بن معبد، عن بعض، أهله عن ابن عباس، قال لما نزل رسول الله صلى الله عليه وسلم مر الظهران قال العباس قلت والله لئن دخل رسول الله صلى الله عليه وسلم مكة عنوة قبل أن يأتوه فيستأمنوه إنه لهلاك قريش فجلست على بغلة رسول الله صلى الله عليه وسلم فقلت لعلي أجد ذا حاجة يأتي أهل مكة فيخبرهم بمكان رسول الله صلى الله عليه وسلم ليخرجوا إليه فيستأمنوه فإني لأسير إذ سمعت كلام أبي سفيان وبديل بن ورقاء فقلت يا أبا حنظلة فعرف صوتي فقال أبو الفضل قلت نعم ‏.‏ قال ما لك فداك أبي وأمي قلت هذا رسول الله صلى الله عليه وسلم والناس ‏.‏ قال فما الحيلة قال فركب خلفي ورجع صاحبه فلما أصبح غدوت به على رسول الله صلى الله عليه وسلم فأسلم قلت يا رسول الله إن أبا سفيان رجل يحب هذا الفخر فاجعل له شيئا ‏.‏ قال ‏\"‏ نعم من دخل دار أبي سفيان فهو آمن ومن أغلق عليه داره فهو آمن ومن دخل المسجد فهو آمن ‏\"‏ ‏.‏ قال فتفرق الناس إلى دورهم وإلى المسجد ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     When the Prophet (ﷺ) alighted at Marr az-Zahran, al-Abbas said: I thought, I swear by Allah, if the Messenger of Allah (ﷺ) enters Mecca with the army by force before the Quraysh come to him and seek protection from him, it will be their total ruin. So I rode on the mule of the Messenger of Allah (ﷺ) and thought, Perhaps I may find a man coming for his needs who will to the people of Mecca and inform them of the position of the Messenger of Allah (ﷺ), so that they may come to him and seek protection from him. While I was on my way, I heard AbuSufyan and Budayl ibn Warqa' speaking.  I said: O AbuHanzalah!  He recognized my voice and said: AbulFadl?  I replied: Yes.  He said: who is with you, may my parents be a sacrifice for you?  I said: Here are the Messenger of Allah (ﷺ) and his people (with him).  He asked: Which is the way out?  He said: He rode behind me, and his companion returned. When the morning came, I brought him to the Messenger of Allah (ﷺ) and he embraced Islam.  I said: Messenger of Allah, AbuSufyan is a man who likes this pride, do something for him.  He said: Yes, he who enters the house of AbuSufyan is safe; he who closes the door upon him is safe; and he who enters the mosque is safe. The people scattered to their houses and in the mosque.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "17"
      ]
    },
    {
      "hadith_no": "3431",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا سلمة بن الفضل، حدثنا ابن إسحاق، عن العلاء بن عبد الرحمن الحرقي، عن ابن ماجدة السهمي، عن عمر بن الخطاب، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Abu Majidah al-Sahmi from 'Umar b. al-Khattab through a different chain of narrators.",
      "chain": [
        "30224",
        "28221",
        "11107",
        "3"
      ]
    },
    {
      "hadith_no": "3537",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - حدثني محمد بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وايم الله لا أقبل بعد يومي هذا من أحد هدية إلا أن يكون مهاجرا قرشيا أو أنصاريا أو دوسيا أو ثقفيا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: I swear by Allah, I shall not accept gift from anyone after this day except from an immigrant Qarashi, an Ansari a Dawsi or a Thaqafi.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا سلمة، - يعني ابن الفضل - قال حدثني محمد، - يعني ابن إسحاق - قال حدثني عتبة بن مسلم، مولى بني تيم عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول فذكر نحوه قال ‏\"‏ فإذا قالوا ذلك فقولوا ‏{‏ الله أحد * الله الصمد * لم يلد ولم يولد * ولم يكن له كفوا أحد ‏}‏ ثم ليتفل عن يساره ثلاثا وليستعذ من الشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I heard the Messenger of Allah (ﷺ) say: He then mentioned a tradition like it. This version adds: When they propound that, say: \"Say Allah is one. Allah is He to Whom men repair. He has not begotten and He has not been begotten, and no one is equal to Him.\" Then one should spit three times on his left side and seek refuge in Allah from Satan.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11522",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "58",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا سلمة بن الفضل، عن محمد بن إسحاق، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم كان يتوضأ لكل صلاة طاهرا أو غير طاهر ‏.‏ قال قلت لأنس فكيف كنتم تصنعون أنتم قال كنا نتوضأ وضوءا واحدا ‏.‏ قال أبو عيسى وحديث حميد عن أنس حديث حسن غريب من هذا الوجه والمشهور عند أهل الحديث حديث عمرو بن عامر الأنصاري عن أنس ‏.‏ وقد كان بعض أهل العلم يرى الوضوء لكل صلاة استحبابا لا على الوجوب ‏.‏",
      "text_en": " Anas narrated that :                     \"The Prophet would perform wudu for every Salat, whether he was in state of purity or not in a state of purity.\"",
      "chain": [
        "38495",
        "28221",
        "11107",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا سلمة بن الفضل، عن محمد بن إسحاق، عن عكرمة، عن ابن عباس، عن عبد الرحمن بن عوف، قال عبأنا النبي صلى الله عليه وسلم ببدر ليلا ‏.‏ قال أبو عيسى وفي الباب عن أبي أيوب ‏.‏ وهذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وسألت محمد بن إسماعيل عن هذا الحديث فلم يعرفه وقال محمد بن إسحاق سمع من عكرمة ‏.‏ وحين رأيته كان حسن الرأى في محمد بن حميد الرازي ثم ضعفه بعد ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin 'Awf:                     \"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.",
      "chain": [
        "38495",
        "28221",
        "11107",
        "11023",
        "17",
        "8"
      ]
    }
  ],
  "total_hadiths": 12
}