{
  "id": "28259",
  "name": "'Asim bin Rja'a bin Hywh عاصم بن رجاء بن حيوة الكندي الفلسطيني",
  "full_name": "'Asim bin Rja'a bin Hywh عاصم بن رجاء بن حيوة الكندي الفلسطيني",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ د  ت  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Kundi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq/Delusion] [ د  ت  ق  -  صدوق له أوهام ]",
        "ar": "Narrator[Grade:Sadooq/Delusion] [ د  ت  ق  -  صدوق له أوهام ]",
        "ckb": "Narrator[Grade:Sadooq/Delusion] [ د  ت  ق  -  صدوق له أوهام ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "al-Kundi",
        "ar": "al-Kundi",
        "ckb": "al-Kundi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19896",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "28167",
      "name": "Da'ud bin Jmyl داود بن جميل ويقال",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "18724",
      "name": "'Urwa bin Ruwaym al-Lakhmi عروة بن رويم عروة بن روىم",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "17096",
      "name": "Abu 'Imran al-Ansari al-Shami أبو عمران الأنصاري الشامي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "24308",
      "name": "'Uthman bin Fa'id al-Quraishi عثمان بن فائد القرشي أبو لبابة البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "27036",
      "name": "Muhammad bin Yazid al-Kula'i محمد بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3641",
      "hadith_no": "3641",
      "source": "Sunan Abi Da'ud",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا مسدد بن مسرهد، حدثنا عبد الله بن داود، سمعت عاصم بن رجاء بن حيوة، يحدث عن داود بن جميل، عن كثير بن قيس، قال كنت جالسا مع أبي الدرداء في مسجد دمشق فجاءه رجل فقال يا أبا الدرداء إني جئتك من مدينة الرسول صلى الله عليه وسلم لحديث بلغني أنك تحدثه عن رسول الله صلى الله عليه وسلم ما جئت لحاجة ‏.‏ قال فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سلك طريقا يطلب فيه علما سلك الله به طريقا من طرق الجنة وإن الملائكة لتضع أجنحتها رضا لطالب العلم وإن العالم ليستغفر له من في السموات ومن في الأرض والحيتان في جوف الماء وإن فضل العالم على العابد كفضل القمر ليلة البدر على سائر الكواكب وإن العلماء ورثة الأنبياء وإن الأنبياء لم يورثوا دينارا ولا درهما ورثوا العلم فمن أخذه أخذ بحظ وافر ‏\"‏ ‏.‏",
      "text_en": " Narrated Kathir ibn Qays:                     Kathir ibn Qays said: I was sitting with AbudDarda' in the mosque of Damascus.  A man came to him and said: AbudDarda, I have come to you from the town of the Messenger of Allah (ﷺ) for a tradition that I have heard you relate from the Messenger of Allah (ﷺ). I have come for no other purpose.  He said: I heard the Messenger of Allah (ﷺ) say: If anyone travels on a road in search of knowledge, Allah will cause him to travel on one of the roads of Paradise. The angels will lower their wings in their great pleasure with one who seeks knowledge, the inhabitants of the heavens and the Earth and the fish in the deep waters will ask forgiveness for the learned man. The superiority of the learned man over the devout is like that of the moon, on the night when it is full, over the rest of the stars. The learned are the heirs of the Prophets, and the Prophets leave neither dinar nor dirham, leaving only knowledge, and he who takes it takes an abundant portion.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20330",
        "28259",
        "28167",
        "17054"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-2682-2",
      "hadith_no": "2682",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن خداش البغدادي، حدثنا محمد بن يزيد الواسطي، حدثنا عاصم بن رجاء بن حيوة، عن قيس بن كثير، قال قدم رجل من المدينة على أبي الدرداء وهو بدمشق فقال ما أقدمك يا أخي فقال حديث بلغني أنك تحدثه عن رسول الله صلى الله عليه وسلم قال أما جئت لحاجة قال لا ‏.‏ قال أما قدمت لتجارة قال لا ‏.‏ قال ما جئت إلا في طلب هذا الحديث قال فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سلك طريقا يبتغي فيه علما سلك الله به طريقا إلى الجنة وإن الملائكة لتضع أجنحتها رضا لطالب العلم وإن العالم ليستغفر له من في السموات ومن في الأرض حتى الحيتان في الماء وفضل العالم على العابد كفضل القمر على سائر الكواكب إن العلماء ورثة الأنبياء إن الأنبياء لم يورثوا دينارا ولا درهما إنما ورثوا العلم فمن أخذ به أخذ بحظ وافر ‏\"‏ ‏.‏ قال أبو عيسى ولا نعرف هذا الحديث إلا من حديث عاصم بن رجاء بن حيوة وليس هو عندي بمتصل هكذا حدثنا محمود بن خداش بهذا الإسناد ‏.‏ وإنما يروى هذا الحديث عن عاصم بن رجاء بن حيوة عن الوليد بن جميل عن كثير بن قيس عن أبي الدرداء عن النبي صلى الله عليه وسلم وهذا أصح من حديث محمود بن خداش ورأى محمد بن إسماعيل هذا أصح ‏.‏",
      "text_en": " Narrated Qais bin Kathir:                     \"A man from Al-Madinah came to Abu Ad-Darda when he was in Dimashq. So he said: 'What brings you O my nephew?' He replied: 'A Hadith reached me which you have narrated from the Messenger of Allah (ﷺ).' He said: 'You did not come for some need?' He said: 'No.' He said: 'Did you come for trade?' He said: 'No, I did not come except seeking this Hadith.' So he said: 'Indeed, I heard the Messenger of Allah (ﷺ) saying: \"Whoever takes a path upon which he seeks knowledge, then Allah makes a path to Paradise easy for him. And indeed the angels lower their wings in approval to the one seeking knowledge. Indeed forgiveness is sought for the knowledgeable one by whomever is in the heavens and whomever is in the earth, even the fish in the waters. And superiority of the scholar over the worshiper is like the superiority of the moon over the rest of the celestial bodies. Indeed the scholars are the heirs of the Prophets, and the Prophets do not leave behind Dinar or Dirham. The only legacy of the scholars is knowledge, so whoever takes from it, then he has indeed taken the most able share.",
      "usc_msa_ref": "",
      "chain": [
        "36669",
        "27036",
        "28259"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-228",
      "hadith_no": "228",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا عبد الله بن داود، عن عاصم بن رجاء بن حيوة، عن داود بن جميل، عن كثير بن قيس، قال كنت جالسا عند أبي الدرداء في مسجد دمشق فأتاه رجل فقال يا أبا الدرداء أتيتك من المدينة مدينة رسول الله  صلى الله عليه وسلم  لحديث بلغني أنك تحدث به عن النبي  صلى الله عليه وسلم  ‏.‏ قال فما جاء بك تجارة قال لا ‏.‏ قال ولا جاء بك غيره قال لا ‏.‏ قال فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من سلك طريقا يلتمس فيه علما سهل الله له طريقا إلى الجنة وإن الملائكة لتضع أجنحتها رضا لطالب العلم وإن طالب العلم يستغفر له من في السماء والأرض حتى الحيتان في الماء وإن فضل العالم على العابد كفضل القمر على سائر الكواكب إن العلماء هم ورثة الأنبياء إن الأنبياء لم يورثوا دينارا ولا درهما إنما ورثوا العلم فمن أخذه أخذ بحظ وافر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kathir bin Qais said:                     \"I was sitting with Abu Darda' in the mosque of Damascus when a man came to him and said: 'O Abu Darda', I have come to you from Al-Madinah, the city of the Messenger of Allah, for a Hadith which I have heard that you narrate from the Prophet.' He said: 'Did you not come for trade?' He said: 'No.' He said: 'Did you not come for anything else?' He said: 'No.' He said: 'I heard the Messenger of Allah say: \"Whoever follows a path in the pursuit of knowledge, Allah will make easy for him a path to Paradise. The angels lower their wings in approval of the seeker of knowledge, and everyone in the heavens and on earth prays for forgiveness for the seeker of knowledge, even the fish in the sea. The superiority of the scholar over the worshipper is like the superiority of the moon above all other heavenly bodies. The scholars are the heirs of the Prophets, for the Prophets did not leave behind a Dinar or Dirham, rather they left behind knowledge, so whoever takes it has taken a great share.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20330",
        "28259",
        "28167",
        "17054"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1109",
      "hadith_no": "1109",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا عثمان بن فائد، حدثنا عاصم بن رجاء بن حيوة، عن المهدي بن عبد الرحمن بن عيينة بن خاطر، قال حدثتني عمتي أم الدرداء، عن أبي الدرداء، قال سجدت مع النبي  صلى الله عليه وسلم  إحدى عشرة سجدة ليس فيها من المفصل شىء الأعراف والرعد والنحل وبني إسرائيل ومريم والحج وسجدة الفرقان وسليمان سورة النمل والسجدة وفي ص وسجدة الحواميم ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      “I performed elevenprostrationswith the Prophet (ﷺ) of which there were none in theMufassal.Al-A’raf, Ar-Ra’d, An-Nahl, Bani Isra’il, Maryam, Al-Hajj,theprostration in Al-Furqan, Surat An-Naml (mentioning) Sulaiman,As-Sajdah, Sad, and the Ha-Mim Surah.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30587",
        "24308",
        "28259",
        "37"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 4,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [8th Generation]",
    "ar": "تابع التابعين [الجيل الثامن]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
  }
}