{
  "id": "28278",
  "name": "'Abdullah bin Bhyr عبد الله بن بحير",
  "full_name": "'Abdullah bin Bhyr عبد الله بن بحير",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "Sana'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [د  ت  ق  أبي  داود  والترمذي  وابن  ماجة]"
    ],
    "tags": [
      "al-Ra'",
      "al-Sana'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18653",
      "name": "'Abdur Rahman bin Yazid عبد الرحمن بن يزيد اليماني أبو محمد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18727",
      "name": "'Urwa bin Muhammad bin Atyh عروة بن محمد بن عطية السعدي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "38072",
      "name": "Abu Thaur al-Kalbi إبراهيم بن خالد أبو ثور الكلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20467",
      "name": "Hisham bin Yusuf al-Sana'i هشام بن يوسف الصنعاني أبو عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3221",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، حدثنا هشام، عن عبد الله بن بحير، عن هانئ، مولى عثمان عن عثمان بن عفان، قال كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت وقف عليه فقال ‏\"‏ استغفروا لأخيكم وسلوا له التثبيت فإنه الآن يسأل ‏\"‏ ‏.‏ قال أبو داود بحير بن ريسان ‏.‏",
      "text_en": " Narrated Uthman ibn Affan:                     Whenever the Prophet (ﷺ) became free from burying the dead, he used to stay at him (i.e. his grave) and say: Seek forgiveness for your brother, and beg steadfastness for him, for he will be questioned now.Abu Dawud said: The full name of the narrator Buhair is Buhair b. Raisan.",
      "chain": [
        "30309",
        "20295",
        "28278",
        "4"
      ]
    },
    {
      "hadith_no": "4784",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا بكر بن خلف، والحسن بن علي، - المعنى - قالا حدثنا إبراهيم بن خالد، حدثنا أبو وائل القاص، قال دخلنا على عروة بن محمد بن السعدي فكلمه رجل فأغضبه فقام فتوضأ ثم رجع وقد توضأ فقال حدثني أبي عن جدي عطية قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الغضب من الشيطان وإن الشيطان خلق من النار وإنما تطفأ النار بالماء فإذا غضب أحدكم فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Atiyyah as-Sa'di:                     AbuWa'il al-Qass said: We entered upon Urwah ibn Muhammad ibn as-Sa'di. A man spoke to him and made him angry. So he stood and performed ablution; he then returned and performed ablution, and said: My father told me on the authority of my grandfather Atiyyah who reported the Messenger of Allah (ﷺ) as saying: Anger comes from the devil, the devil was created of fire, and fire is extinguished only with water; so when one of you becomes angry, he should perform ablution.",
      "chain": [
        "34043",
        "30",
        "38072",
        "28278"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد، حدثنا يحيى بن معين، حدثنا هشام بن يوسف، حدثني عبد الله بن بحير، أنه سمع هانئا، مولى عثمان قال كان عثمان إذا وقف على قبر بكى حتى يبل لحيته فقيل له تذكر الجنة والنار فلا تبكي وتبكي من هذا فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن القبر أول منازل الآخرة فإن نجا منه فما بعده أيسر منه وإن لم ينج منه فما بعده أشد منه ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ ما رأيت منظرا قط إلا والقبر أفظع منه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث هشام بن يوسف ‏.‏",
      "text_en": " Hani' the freed slave of 'Uthman said:                     When 'Uthman would stop at a grave he would cry until his beard was soaked (in tears). It was said to him: 'The Paradise and the Fire were mentioned and you did not cry, yet you cry because of this?' So he said: 'Indeed the Messenger of Allah said: \"Indeed the grave isAllah the first stage among the stages of the Hereafter. So if one is saved from it, then what comes after it is easier than it. And if one is not saved from it, then what comes after it is worse than it.\" And the Messenger of Allah said: \"I have not seen any sight except that the grave is more horrible than it.\"",
      "chain": [
        "30480",
        "30020",
        "20467",
        "28278"
      ]
    },
    {
      "hadith_no": "3653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عباس بن عبد العظيم العنبري، حدثنا عبد الرزاق، أخبرنا عبد الله بن بحير، عن عبد الرحمن، وهو ابن يزيد الصنعاني قال سمعت ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى يوم القيامة كأنه رأى عين فليقرأ ‏(‏ إذا الشمس كورت ‏)‏ و ‏(‏إذا السماء انفطرت ‏)‏ و  ‏(‏إذا السماء انشقت ‏)‏ ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏ وروى هشام بن يوسف وغيره هذا الحديث بهذا الإسناد وقال من سره أن ينظر إلى يوم القيامة كأنه رأى عين فليقرأ ‏(‏إذا الشمس كورت ‏)‏ ولم يذكر و ‏(‏إذا السماء انفطرت ‏)‏ و  ‏(‏إذا السماء انشقت ‏)‏‏.‏",
      "text_en": " Ibn Umar narrated that:                     The Messenger of Allah said: “Whoever wishes to look at the Day of Resurrection, as if he is seeing it with this eye, then let him recite: ‘When the sun Kuwwirat’ and ‘When the heaven is cleft sunder (Infatarat) and ‘When the heaven is split asunder.’”",
      "chain": [
        "30437",
        "20121",
        "28278",
        "11055",
        "18"
      ]
    }
  ],
  "total_hadiths": 4
}