{
  "id": "28270",
  "name": "'Aabad bin Musa al-Jhny عباد بن موسى الجهني",
  "full_name": "'Aabad bin Musa al-Jhny عباد بن موسى الجهني",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ تمييز  -  مقبول ]"
    ],
    "tags": [
      "al-Juhni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-3447",
      "hadith_no": "3447",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني إبراهيم بن موسى، أخبرنا ابن أبي زائدة، عن موسى الجهني، عن نافع، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول بمثله ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I heard Allah's Messenger (may peace be upon him) saying like this.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20366",
        "28270",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7023",
      "hadith_no": "7023",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وابن، نمير عن موسى الجهني، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا موسى الجهني، عن مصعب بن سعد، عن أبيه، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال علمني كلاما أقوله قال ‏\"‏ قل لا إله إلا الله وحده لا شريك له الله أكبر كبيرا والحمد لله كثيرا سبحان الله رب العالمين لا حول ولا قوة إلا بالله العزيز الحكيم ‏\"‏ ‏.‏ قال فهؤلاء لربي فما لي قال ‏\"‏ قل اللهم اغفر لي وارحمني واهدني وارزقني ‏\"‏ ‏.‏ قال موسى أما عافني فأنا أتوهم وما أدري ‏.‏ ولم يذكر ابن أبي شيبة في حديثه قول موسى ‏.‏",
      "text_en": " Mu'sab b. Sa'd reported on the authority of his father that a desert Arab came to Allah's Messenger (may peace be upon him) and said to him:                      Teach me the words which I should (often) utter. He said: Utter,\" There is no god but Allah, the One, having no partner with Him. Allah is the Greatest of the great and all praise is due to Him. Hallowed be Allah, the Lord of the worlds, there is no Might and Power but that of Allah, the All-Powerful and the Wise.\" He (that desert Arab) said: These all (glorify) my Lord. But what about me? Thereupon he (the Holy Prophet) said: You should say:\" O Allah, grant me pardon, have mercy upon me, direct me to righteousness and provide me sustenance.\" Musa (one of the narrators) said: I think he also said:\" Grant me safety.\" But I cannot say for certain whether he said this or not. Ibn Abi Shaiba has not made a mention of the words of Musa in his narration.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "30212",
        "28270",
        "28270",
        "10556",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-7027",
      "hadith_no": "7027",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا مروان، وعلي بن مسهر، عن موسى الجهني، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا موسى الجهني، عن مصعب بن سعد، حدثني أبي قال، كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيعجز أحدكم أن يكسب كل يوم ألف حسنة ‏\"‏ ‏.‏ فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة قال ‏\"‏ يسبح مائة تسبيحة فيكتب له ألف حسنة أو يحط عنه ألف خطيئة ‏\"‏ ‏.‏",
      "text_en": " Mus'ab b. Sa'd reported that his father told him that he had been in the company of Allah's Messenger (may peace be upon him) that he said:                      Is one amongst you powerless to get one thousand virtues every day. Amongst those who had been sitting there, one asked: How one amongst us can get one thousand virtues every day? He said: Recite:\" Hallowed be Allah\" one hundred times for (by reciting them) one thousand virtues are recorded (to your credit) and one tbousand vices are blotted out.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20201",
        "20345",
        "28270",
        "28270",
        "10556",
        "9"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3463-2",
      "hadith_no": "3463",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا موسى الجهني، حدثني مصعب بن سعد، عن أبيه، أن رسول الله صلى الله عليه وسلم قال لجلسائه ‏\"‏ أيعجز أحدكم أن يكسب ألف حسنة ‏\"‏ ‏.‏ فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة قال ‏\"‏ يسبح أحدكم مائة تسبيحة تكتب له ألف حسنة وتحط عنه ألف سيئة ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Mus’ab bin Sa’d narrated from his father, that :                     the Messenger of Allah said to those sitting with him: “Is one of you incapable of attaining a thousand good deeds?” So a questioner among those seated with him asked him: “How can one of us earn a thousand good deeds?” He said: “(When) one of you recites a hundred Tasbihat a thousand good deeds are written for him, and a thousand evil deeds are wiped away from him.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "28270",
        "10556",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-228",
      "hadith_no": "228",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبيد، قال حدثنا يحيى بن زكريا بن أبي زائدة، عن موسى الجهني، قال أتي مجاهد بقدح حزرته ثمانية أرطال فقال حدثتني عائشة رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يغتسل بمثل هذا ‏.‏",
      "text_en": " It was narrated that Musa Al-Juhani said:                      \"A vessel was brought to Mujahid, which I estimated to be eight Ratls, and he said: 'Aishah told me that the Messenger of Allah (ﷺ) used to perform Ghusl using such a vessel.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20366",
        "28270",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3476",
      "hadith_no": "3476",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا داود بن سليمان العسكري، قال حدثنا محمد بن الصباح، حدثنا سعيد بن محمد الثقفي، عن موسى الجهني، عن زيد بن وهب، عن عطية بن عامر الجهني، قال سمعت سلمان، وأكره، على طعام يأكله فقال حسبي إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن أكثر الناس شبعا في الدنيا أطولهم جوعا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Atiyyah bin ‘Amir Al-Juhani said:                      “I heardSalman, when he was forced to eat food, say: ‘It is sufficient formethat I heard the Messenger of Allah (ﷺ) say: The people who mosteattheir fill in this world will be the most hungry on the Day ofResurrection.’”",
      "usc_msa_ref": "",
      "chain": [
        "38211",
        "30269",
        "25107",
        "28270",
        "11341",
        "14"
      ]
    }
  ],
  "total_hadiths": 6
}