{
  "id": "28282",
  "name": "'Abdullah bin Hasan, 'Utarays عبد الله بن حسان- عتريس",
  "full_name": "'Abdullah bin Hasan, 'Utarays عبد الله بن حسان- عتريس",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ بخ  د  ت  -  مقبول ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-'Anbari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18150",
      "name": "Hban bin 'Asim al-Tmymy حبان بن عاصم التميمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "24234",
      "name": "'Abdullah bin Sawar bin 'Abdullah عبد الله بن سوار بن عبد الله بن قدامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20245",
      "name": "'Abdullah bin Raja' bin 'Umar عبد الله بن رجاء بن عمر/المثني الغداني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34062",
      "name": "Hafs bin 'Umar Abu حفص بن عمر أبو عمر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3070",
      "hadith_no": "3070",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حفص بن عمر، وموسى بن إسماعيل، - المعنى واحد - قالا حدثنا عبد الله بن حسان العنبري، حدثتني جدتاى، صفية ودحيبة ابنتا عليبة وكانتا ربيبتى قيلة بنت مخرمة وكانت جدة أبيهما أنها أخبرتهما قالت، قدمنا على رسول الله صلى الله عليه وسلم قالت تقدم صاحبي - تعني حريث بن حسان وافد بكر بن وائل - فبايعه على الإسلام عليه وعلى قومه ثم قال يا رسول الله اكتب بيننا وبين بني تميم بالدهناء أن لا يجاوزها إلينا منهم أحد إلا مسافر أو مجاور ‏.‏ فقال ‏\"‏ اكتب له يا غلام بالدهناء ‏\"‏ ‏.‏ فلما رأيته قد أمر له بها شخص بي وهي وطني وداري فقلت يا رسول الله إنه لم يسألك السوية من الأرض إذ سألك إنما هي هذه الدهناء عندك مقيد الجمل ومرعى الغنم ونساء بني تميم وأبناؤها وراء ذلك فقال ‏\"‏ أمسك يا غلام صدقت المسكينة المسلم أخو المسلم يسعهما الماء والشجر ويتعاونان على الفتان ‏\"‏ ‏.‏",
      "text_en": " Narrated Qaylah bint Makhramah:                     Abdullah ibn Hasan al-Anbari said: My grandmothers, Safiyyah and Duhaybah, narrated to me, that hey were the daughters of Ulaybah and were nourished by Qaylah, daughter of Makhramah. She was the grandmother of their father. She reported to them, saying: We came upon the Messenger of Allah (ﷺ). My companion, Hurayth ibn Hassan, came to him as a delegate from Bakr ibn Wa'il. He took the oath of allegiance of Islam for himself and for his people. He then said: Messenger of Allah (ﷺ), write a document for us, giving us the land lying between us and Banu Tamim at ad-Dahna' to the effect that not one of them will cross it in our direction except a traveller or a passer-by.  He said: Write down ad-Dahna' for them, boy. When I saw that he passed orders to give it to him, I became anxious, for it was my native land and my home.  I said: Messenger of Allah, he did not ask you for a true border when he asked you. This land of Dahna' is a place where the camels have their home, and it is a pasture for the sheep. The women of Banu Tamim and their children are beyond it.  He said: Stop, boy! A poor woman spoke the truth: a Muslim is a brother of a Muslim. Each one of them may benefit from water and trees, and they should cooperate with each other against Satan.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20040",
        "28282"
      ]
    },
    {
      "id": "sunan-abi-daud-4847",
      "hadith_no": "4847",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حفص بن عمر، وموسى بن إسماعيل، قالا حدثنا عبد الله بن حسان العنبري، قال حدثتني جدتاى، صفية ودحيبة ابنتا عليبة - قال موسى بنت حرملة - وكانتا ربيبتى قيلة بنت مخرمة وكانت جدة أبيهما أنها أخبرتهما أنها، رأت النبي صلى الله عليه وسلم وهو قاعد القرفصاء فلما رأيت رسول الله صلى الله عليه وسلم المختشع - وقال موسى المتخشع في الجلسة - أرعدت من الفرق ‏.‏",
      "text_en": " Narrated Qaylah daughter of Makhramah:                     She saw the Prophet (ﷺ) sitting with his arms round his legs. She said: When I saw the Messenger of Allah (ﷺ) in such humble condition in the sitting position (according to Musa's version), I trembled with fear.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20040",
        "28282"
      ]
    }
  ],
  "total_hadiths": 2
}