{
  "id": "28325",
  "name": "'Abdur Rahman bin Hsan عبد الرحمن بن حسان الكناني أبو سعيد",
  "full_name": "'Abdur Rahman bin Hsan عبد الرحمن بن حسان الكناني أبو سعيد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  -  لا بأس به ]"
    ],
    "tags": [
      "al-Kanani"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ د  س  -  لا بأس به ]",
        "ar": "Narrator[Grade:Sadooq] [ د  س  -  لا بأس به ]",
        "ckb": "Narrator[Grade:Sadooq] [ د  س  -  لا بأس به ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "al-Kanani",
        "ar": "al-Kanani",
        "ckb": "al-Kanani"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-5080",
      "hadith_no": "5080",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، ومؤمل بن الفضل الحراني، وعلي بن سهل الرملي، ومحمد بن المصفى الحمصي، قالوا حدثنا الوليد، حدثنا عبد الرحمن بن حسان الكناني، قال حدثني مسلم بن الحارث بن مسلم التميمي، عن أبيه، أن النبي صلى الله عليه وسلم قال نحوه إلى قوله ‏\"‏ جوار منها ‏\"‏ ‏.‏ إلا أنه قال فيهما ‏\"‏ قبل أن تكلم أحدا ‏\"‏ ‏.‏ قال علي بن سهل فيه إن أباه حدثه وقال علي وابن المصفى بعثنا رسول الله صلى الله عليه وسلم في سرية فلما بلغنا المغار استحثثت فرسي فسبقت أصحابي وتلقاني الحى بالرنين فقلت لهم قولوا لا إله إلا الله تحرزوا فقالوها فلامني أصحابي وقالوا حرمتنا الغنيمة فلما قدمنا على رسول الله صلى الله عليه وسلم أخبروه بالذي صنعت فدعاني فحسن لي ما صنعت وقال ‏\"‏ أما إن الله قد كتب لك من كل إنسان منهم كذا وكذا ‏\"‏ ‏.‏ قال عبد الرحمن فأنا نسيت الثواب ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أما إني سأكتب لك بالوصاة بعدي ‏\"‏ ‏.‏ قال ففعل وختم عليه فدفعه إلى وقال لي ثم ذكر معناهم وقال ابن المصفى قال سمعت الحارث بن مسلم بن الحارث التميمي يحدث عن أبيه ‏.‏",
      "text_en": " Narrated Muslim ibn al-Harith ibn Muslim at-Tamimi:                     A similar tradition (to No. 5061) has been transmitted by Muslim ibn al-Harith ibn Muslim at-Tamimi on the authority of his father from the Prophet (ﷺ) through a different chain of narrators, up to \"protection from it\". But this version says: \"before speaking to anyone\". In this version Ali ibn Sahl said that his father told him.  Ali and Ibn al-Musaffa said: The Messenger of Allah (ﷺ) sent us on an expedition. When we reached the place of attack, I galloped my horse and outstripped my companions, and the people of that locality received me with a great noise.  I said to them: Say \"There is no god but Allah,\" and you will be protected. They said this.  My companions blamed me, saying: You deprived us of the booty. When we came to the Messenger of Allah (ﷺ), they told him what I had done.  So he called me, appreciating what I had done, and said: Allah has recorded for you so and so (a reward) for every man of them.  AbdurRahman said: I forgot the reward.  The Messenger of Allah (ﷺ) then said: I shall write a will for you after me. He did this and stamped it, and gave it to me, saying....He then mentioned the rest of the tradition to the same effect. Ibn al-Musaffa said: I heard al-Harith ibn Muslim ibn al-Harith at-Tamimi transmitting it from his father.",
      "usc_msa_ref": "",
      "chain": [
        "38429",
        "38659",
        "38403",
        "20733",
        "28325"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 1,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}