{
  "id": "28327",
  "name": "'Abdur Rahman bin Zayd bin Aslam عبد الرحمن بن زيد بن أسلم العدوي",
  "full_name": "'Abdur Rahman bin Zayd bin Aslam عبد الرحمن بن زيد بن أسلم العدوي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "182",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "Ally B.'Adi",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "22013",
      "name": "Usamah bin Zayd bin Aslm أسامة بن زيد بن أسلم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22095",
      "name": "'Abdullah bin Zayd bin Aslam عبد الله بن زيد بن أسلم العدوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "465",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن الوتر أو نسيه فليصل إذا ذكر وإذا استيقظ ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that :                     Allah's Messenger said: \"Whoever sleeps past Al-Witr or forgets it, then let him pray it when he remembers it or when he awakens.\"",
      "chain": [
        "30277",
        "20032",
        "28327",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "631",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا هارون بن صالح الطلحي المدني، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من استفاد مالا فلا زكاة عليه حتى يحول عليه الحول عند ربه ‏\"‏ ‏.‏ وفي الباب عن سراء بنت نبهان الغنوية ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Messenger of Allah said: \"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed (while it is in his possession).\"",
      "chain": [
        "30221",
        "28327",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "719",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث لا يفطرن الصائم الحجامة والقىء والاحتلام ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي سعيد الخدري حديث غير محفوظ ‏.‏ وقد روى عبد الله بن زيد بن أسلم وعبد العزيز بن محمد وغير واحد هذا الحديث عن زيد بن أسلم مرسلا ‏.‏ ولم يذكروا فيه عن أبي سعيد ‏.‏ وعبد الرحمن بن زيد بن أسلم يضعف في الحديث ‏.‏ قال سمعت أبا داود السجزي يقول سألت أحمد بن حنبل عن عبد الرحمن بن زيد بن أسلم فقال أخوه عبد الله بن زيد لا بأس به ‏.‏ قال وسمعت محمدا يذكر عن علي بن عبد الله المديني قال عبد الله بن زيد بن أسلم ثقة وعبد الرحمن بن زيد بن أسلم ضعيف ‏.‏ قال محمد ولا أروي عنه شيئا ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     the Messenger of Allah said: \"Three things do not break the fast of the fasting person: Cupping, vomiting, and the wet dream.\"",
      "chain": [
        "35135",
        "28327",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "852",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا هارون بن صالح الطلحي، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن ابن عمر، قال اغتسل النبي صلى الله عليه وسلم لدخوله مكة بفخ ‏.‏ قال أبو عيسى هذا حديث غير محفوظ ‏.‏ والصحيح ما روى نافع عن ابن عمر أنه كان يغتسل لدخول مكة ‏.‏ وبه يقول الشافعي يستحب الاغتسال لدخول مكة ‏.‏ وعبد الرحمن بن زيد بن أسلم ضعيف في الحديث ضعفه أحمد بن حنبل وعلي بن المديني وغيرهما ولا نعرف هذا الحديث مرفوعا إلا من حديثه ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet performed Ghusl for entered Makkah at Fakhkh.\"",
      "chain": [
        "30221",
        "38674",
        "28327",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هارون بن سعيد الأيلي أبو جعفر، حدثنا عبد الله بن وهب، أخبرني عبد الرحمن بن زيد بن أسلم، عن أبي حازم، عن سهل بن سعد، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن هذا الخير خزائن ولتلك الخزائن مفاتيح فطوبى لعبد جعله الله مفتاحا للخير مغلاقا للشر وويل لعبد جعله الله مفتاحا للشر مغلاقا للخير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sahl bin Sa'd that:                     The Messenger of Allah said: \"This goodness contains many treasures, and for those there are keys. So glad tidings to the one whom Allah makes a key to good and a lock for evil, and woe to the one whom Allah makes a key to evil and a lock to good.\"",
      "chain": [
        "20029",
        "28327",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "561",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو مصعب المدني، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عطاء بن يسار، عن أبي سعيد الخدري، أن النبي  صلى الله عليه وسلم  سئل عن الحياض التي بين مكة والمدينة تردها السباع والكلاب والحمر وعن الطهارة منها فقال ‏\"‏ لها ما حملت في بطونها ولنا ما غبر طهور ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Prophet was asked about the water basins located between Makkah and Al-Madinah, which were visited by wild animals, dogs and donkeys, and about using them for means of purification. He said: \"Whatever they (the animals) have carried in their bellies is for them, and whatever is left over is for us, and is pure.\"",
      "chain": [
        "28327",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مصعب، أحمد بن أبي بكر المديني وسويد بن سعيد قالا حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عطاء بن يسار، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من نام عن الوتر أو نسيه فليصل إذا أصبح أو ذكره ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)said: ‘Whoever sleeps and misses Witr, or forgets it, let him prayitwhen morning comes, or when he remembers.’”",
      "chain": [
        "28327",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2537",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا وهب بن سعيد بن عطية السلمي، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعطوا الأجير أجره قبل أن يجف عرقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah (ﷺ) said:                     “Give the worker his wages before his sweat dries.”",
      "chain": [
        "37521",
        "28327",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "2871",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن مصعب بن ثابت، عن عبد الله بن الزبير، قال خطب عثمان بن عفان الناس فقال يا أيها الناس إني سمعت حديثا من رسول الله صلى الله عليه وسلم لم يمنعني أن أحدثكم به إلا الضن بكم وبصحابتكم فليختر مختار لنفسه أو ليدع سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رابط ليلة في سبيل الله سبحانه كانت كألف ليلة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Zubair said:                      “Uthman bin ‘Affanaddressed the people and said: ‘O people! I heard a Hadith from theMessenger of Allah (ﷺ) and nothing kept me from narrating it to youexcept for the fact that I did not want to lose you and yourcompanionship. So it is up to you. I heard the Messenger of Allah(ﷺ) saying: “Whoever spends a night guarding the frontier in thecause of Allah, it will be like a thousand nights spent in fastingandprayer.”",
      "chain": [
        "30288",
        "28327",
        "11163",
        "28564",
        "106"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو مصعب، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عبد الله بن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أحلت لنا ميتتان الحوت والجراد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar that the Messenger of Allah(ﷺ) said:                      “Two kinds of dead meat have been permitted to us: fishand locusts.”",
      "chain": [
        "30100",
        "28327",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "3439",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو مصعب، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عبد الله بن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أحلت لنا ميتتان ودمان فأما الميتتان فالحوت والجراد وأما الدمان فالكبد والطحال ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar that the Messenger of Allah(ﷺ) said:                      “Two kinds of dead meat and two kinds of blood havebeenpermitted to us. The two kinds of dead meat are fish andlocusts, andthe two kinds of blood are the liver and spleen.”",
      "chain": [
        "30100",
        "28327",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "4197",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو مصعب، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبي حازم بن دينار، عن سهل بن سعد، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ يكون في آخر أمتي خسف ومسخ وقذف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sahl bin Sa’d that the Prophet (ﷺ) said:                      “Atthe end of my nation there will be the earth collapsing,transformations, and Qadhf.”",
      "chain": [
        "30100",
        "28327",
        "11172",
        "399"
      ]
    }
  ],
  "total_hadiths": 12
}