{
  "id": "28372",
  "name": "'Abdul Malik bin Muhammad عبد الملك بن محمد الحميري البرسمي",
  "full_name": "'Abdul Malik bin Muhammad عبد الملك بن محمد الحميري البرسمي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  ق  -  لين الحديث ]"
    ],
    "tags": [
      "al-Humayri",
      "Sana'",
      "Damascus"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28147",
      "name": "Kharjh bin Mus'ab bin Kharjh خارجة بن مصعب بن خارجة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20729",
      "name": "Hisham bin al-Ghaz bin Rabi'ya هشام بن الغاز بن ربيعة الجرشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20120",
      "name": "al-Waqidi محمد بن عمر بن واقد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30587",
      "name": "Sulaiman bin 'Abdur Rahman سليمان بن عبد الرحمن بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30288",
      "name": "Hisham bin 'Ammar bin Nasayr هشام بن عمار بن نصير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38429",
      "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "972",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا زهير بن محمد، عن هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله  صلى الله عليه وسلم  كان يسلم تسليمة واحدة تلقاء وجهه ‏.‏",
      "text_en": " It wasnarrated from Hisham bin ‘Urwah, from his father, from‘Aishah,that the Messenger of Allah (saW) used to say one Salam, tothefront.",
      "chain": [
        "30288",
        "28372",
        "20394",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن رفاعة بن عرابة الجهني، قال كانت يمين رسول الله  صلى الله عليه وسلم  التى يحلف بها أشهد عند الله ‏\"‏ والذي نفسي بيده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin 'Arabah A-Juhani said:                     \"The swearing of the Messenger of Allah (ﷺ) when he took an oath and I bear witness before Allah was: 'By the One in Whose Hand is my soul.\"'",
      "chain": [
        "30288",
        "28372",
        "20024",
        "11449",
        "11229",
        "11020"
      ]
    },
    {
      "hadith_no": "2209",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا خارجة بن مصعب، عن بكير بن عبد الله بن الأشج، عن كريب، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من نذر نذرا ولم يسمه فكفارته كفارة يمين ومن نذر نذرا لم يطقه فكفارته كفارة يمين ومن نذر نذرا أطاقه فليف به ‏\"‏ ‏.‏",
      "text_en": " lt was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     \"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. Whoever makes a vow and is not able to fulfill it, the expiation for that is the expiation for breaking an oath. Whoever makes a vow and is able to fulfill it, let him do so.\"",
      "chain": [
        "30288",
        "28372",
        "28147",
        "11154",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا أبو سلمة العاملي، عن ابن شهاب، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال لأكثم بن الجون الخزاعي ‏\"‏ يا أكثم اغز مع غير قومك يحسن خلقك وتكرم على رفقائك يا أكثم خير الرفقاء أربعة وخير السرايا أربعمائة وخير الجيوش أربعة آلاف ولن يغلب اثنا عشر ألفا من قلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)saidto Aktham bin Al-Jawn Al-Khuza’i:                      “O Aktham! Fight alongsidepeople other than your own, it will improve your attitude and makeyougenerous to your companions. O Aktham, the best number ofcompanionsis four, the best number of troops on an expedition isfour hundred,the best number of an army is four thousand, and twelvethousand willnever be overpowered because of their small number.”",
      "chain": [
        "30288",
        "28372",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3861",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا أبو المنذر، زهير بن محمد التميمي حدثنا موسى بن عقبة، حدثني عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن لله تسعة وتسعين اسما مائة إلا واحدا إنه وتر يحب الوتر من حفظها دخل الجنة وهي الله الواحد الصمد الأول الآخر الظاهر الباطن الخالق البارئ المصور الملك الحق السلام المؤمن المهيمن العزيز الجبار المتكبر الرحمن الرحيم اللطيف الخبير السميع البصير العليم العظيم البار المتعال الجليل الجميل الحى القيوم القادر القاهر العلي الحكيم القريب المجيب الغني الوهاب الودود الشكور الماجد الواجد الوالي الراشد العفو الغفور الحليم الكريم التواب الرب المجيد الولي الشهيد المبين البرهان الرءوف الرحيم المبدئ المعيد الباعث الوارث القوي الشديد الضار النافع الباقي الواقي الخافض الرافع القابض الباسط المعز المذل المقسط الرزاق ذو القوة المتين القائم الدائم الحافظ الوكيل الفاطر السامع المعطي المحيي المميت المانع الجامع الهادي الكافي الأبد العالم الصادق النور المنير التام القديم الوتر الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد ‏\"‏ ‏.‏ قال زهير فبلغنا عن غير واحد من أهل العلم أن أولها يفتح بقول لا إله إلا الله وحده لا شريك له له الملك وله الحمد بيده الخير وهو على كل شىء قدير لا إله إلا الله له الأسماء الحسنى ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: \"Allah has ninety-nine names, one hundred less one, for He is One and loves the odd (numbered). Whoever learns them will enter Paradise.  They are: Allah, Al-Wahid (the One), As-Samad (the Self-Sufficient Master who all creatures need, He neither eats nor drinks), Al-Awwal (the First), Al-Akhir (the Last), Az-Zahir (the Most High), Al-Batin (the Most Near), Al-Khaliq (the Creator), Al-Bari (the Inventor of all things), Al-Musawwir (the Bestower of forms), Al-Malik (the King), Al-Haqq (the Truth), As-Salam (the One free from all defects), Al-Mu'min (the Giver of security), Al-Muhaymin (the Watcher over His creatures), Al-'Aziz (the All-Mighty), Al-Jabbar (the Compeller), Al-Mutakabbir (the Supreme), Ar-Rahman (the Most Gracious), Ar-Rahim (the Most Merciful), Al-Latif (the Most Subtle and Courteous), Al-Khabir (the Aware), As-Sami' (the Hearing), Al-Basir (the Seeing), Al-'Alim (the All-Knowing), Al-'Azim (the Most Great), Al-Barr (the Source of goodness), Al-Muta'al (the Most Exalted), Al-Jalil (the Sublime One), Al-Jamil (the Beautiful), Al-Hayy (the Ever-Living), Al-Qayyum (the One Who sustains and protects all that exists), Al-Qadir (the Able), Al-Qahir (the Irrestible), Al-'Ali (the Exalted), Al-Hakim (the Most Wise), Al-Qarib (the Ever-Near), Al-Mujib (the Responsive), Al-Ghani (the Self-Sufficient), Al-Wahhab (the Bestower), Al-Wadud (the Loving), Ash-Shakur (the Appreciative), Al-Majid (the Most Gentle), Al-Wajid (the Patron), Al-Wali (the Governor), Al-Rashid (the Guide), Al-'Afuw (the Pardoner), Al-Ghafur (the Forgiver), Al-Halim (the Forbearing One), Al-Karim (the Most Generous), At-Tawwab (the Acceptor of Repentance), Ar-Rabb (the Lord and Cherisher), Al-Majid (the Most Glorious), Al-Wali (the Helper), Ash-Shahid (the Witness), Al-Mubin (the Manifest), Al-Burhan (the Proof), Ar-Ra'uf (the Compassionate), Ar-Rahim (the Most Merciful), Al-Mubdi' (the Originator), Al-Mu'id (the Restorer), Al-Ba'ith (the Resurrector), Al-Warith (the Supreme Inheritor), Al-Qawi (the All-Strong), Ash-Shadid (the Severe), Ad-Darr (the One Who harms), An-Nafi' (the One Who benefits), Al-Baqi' (the Everlasting), Al-Waqi (the Protector), Al-Khafid (the Humble), Ar-Rafi' (the Exalter), Al-Qabid (the Retainer), Al-Basit (the Expander), Al-Mu'izz (the Honorer), Al-Mudhill (the Humiliator), Al-Muqsit (the Equitable), Ar-Razzaq (the Providor), Dhul-Quwwah (the Powerful), Al-Matin (the Most Strong), Al-Qa'im (the Firm), Ad-Da'im (the Eternal), Al-Hafiz (the Guardian), Al-Wakil (the Trustee), Al-Fatir (the Originator of creation), As-Sami' (the Hearer), Al-Mu'ti (the Giver), Al-Muhyi (the Giver of life), Al-Mumit (the Giver of death), Al-Mani' (the Withholder), Al-Jami' (the Gatherer), Al-Hadi (the Guide), Al-Kafi (the Sufficient), Al-Abad (the Eternal), Al-'Alim (the Knower), As-Sadiq (the Truthful), An-Nur (the Light), Al-Munir (the Giver of light), At-Tamm (the Perfect), Al-Qadim (the Earlier), Al-Witr (the One), Al-Ahad (the Lone), As-Samad [(the Self-sufficient Master, Who all creatures need, (He neither eats no drinks)]. He begets not, nor was He begotten. And there is none co-equal or comparable unto him.\"(One of the narrators) Zuhair said: We heard from more than one of the scholars that the first of these (names) should begin after saying: La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, bi yadihil-khair wa Huwa 'ala kulli shay-in Qadir, la ilaha illallahu lahul-asma'ul-husna [None has the right to be worshipped but Allah, with no partner or associate. His is the dominion and all praise is His. In His Hand is (all) goodness, and He is Able to do all things, none has the right to be worshipped but Allah, and His are the (Most) Beautiful Names].",
      "chain": [
        "30288",
        "28372",
        "11106",
        "11197",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}