{
  "id": "28379",
  "name": "'Ubaidullah bin 'AR bin 'Abdullah عبيد الله بن عبد الرحمن بن عبد الله",
  "full_name": "'Ubaidullah bin 'AR bin 'Abdullah عبيد الله بن عبد الرحمن بن عبد الله",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Not Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ س  ق  -  مستور ]"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20224",
      "name": "Hmad bin Ms'd'h al-Tmymy حماد بن مسعدة التميمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22246",
      "name": "Yonus bin Yahya bin Nabata يونس بن يحيى بن نباتة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20260",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2237",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، ونصر بن علي، قال زهير حدثنا عبيد الله بن عبد المجيد، حدثنا عبيد الله بن عبد الرحمن بن موهب، عن القاسم، عن عائشة، أنها أرادت أن تعتق، مملوكين لها زوج قال فسألت النبي صلى الله عليه وسلم عن ذلك فأمرها أن تبدأ بالرجل قبل المرأة ‏.‏ قال نصر أخبرني أبو علي الحنفي عن عبيد الله ‏.‏",
      "text_en": " Al-Qasim said:                      Aisha intended to set free two slaves of her who were spouses. She, therefore, asked the Prophet (ﷺ) about this matter. He commanded to begin with the man before the woman. The narrator Nasr said: Abu 'Ali al-Hanafi reported it to me on the authority of Ubaydullah.",
      "chain": [
        "30022",
        "30395",
        "20321",
        "28379",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2307",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الرحمن بن زيد بن أبي الموالي المزني، عن عبيد الله بن عبد الرحمن بن موهب، عن عمرة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ستة لعنتهم لعنهم الله وكل نبي كان الزائد في كتاب الله والمكذب بقدر الله والمتسلط بالجبروت ليعز بذلك من أذل الله ويذل من أعز الله والمستحل لحرم الله والمستحل من عترتي ما حرم الله والتارك لسنتي ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى عبد الرحمن بن أبي الموالي هذا الحديث عن عبيد الله بن عبد الرحمن بن موهب عن عمرة عن عائشة عن النبي صلى الله عليه وسلم ‏.‏ ورواه سفيان الثوري وحفص بن غياث وغير واحد عن عبيد الله بن عبد الرحمن بن موهب عن علي بن حسين عن النبي صلى الله عليه وسلم مرسلا وهذا أصح ‏.‏",
      "text_en": " Aishah narrated that the Messenger of Allah (s.a.w) said:                     \" Six are cursed, being cursed by Allah and by every Prophet that came: The one who adds to Allah's Book, the one who denies Allah's Qadar, the one who rules with tyranny by which he honors whom Allah has debased, and he dishonors whom Allah has honored, and the one who legalizes what Allah forbade, and the one from my family who legalizes what Allah forbade, and the abandoner of my Sunnah.\"",
      "chain": [
        "30367",
        "28379",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "999",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن عبيد الله بن عبد الرحمن بن موهب، عن عمه، عن أبي هريرة، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ لو يعلم أحدكم ما له في أن يمر بين يدى أخيه معترضا في الصلاة كان لأن يقيم مائة عام خير له من الخطوة التي خطاها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) said: ‘Ifanyone of you knew (how great is the sin involved) in passing infrontof his brother while he is performing prayer, waiting for onehundredyears would be better for him than one step that he takes.’”",
      "chain": [
        "30201",
        "20032",
        "28379",
        "13"
      ]
    }
  ],
  "total_hadiths": 3
}