{
  "id": "28388",
  "name": "'Uthman bin Sa'id bin Kathir bin Dinar عثمان بن سعيد بن كثير بن دينار",
  "full_name": "'Uthman bin Sa'id bin Kathir bin Dinar عثمان بن سعيد بن كثير بن دينار",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "209",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "38429",
      "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38705",
      "name": "Yahya bin 'Uthman bin Sa'id bin Kathir يحيى بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "38429",
      "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38705",
      "name": "Yahya bin 'Uthman bin Sa'id bin Kathir يحيى بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا حريز، عن راشد بن سعد، عن عاصم بن حميد السكوني، أنه سمع معاذ بن جبل، يقول ارتقبنا النبي صلى الله عليه وسلم في صلاة العتمة فأخر حتى ظن الظان أنه ليس بخارج والقائل منا يقول صلى فإنا لكذلك حتى خرج النبي صلى الله عليه وسلم فقالوا له كما قالوا فقال لهم ‏\"‏ أعتموا بهذه الصلاة فإنكم قد فضلتم بها على سائر الأمم ولم تصلها أمة قبلكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     We waited for the Prophet (ﷺ) to offer the night prayer. He delayed until people thought that he would not come out and some of us said that he had offered the prayer. At the moment when we were in this condition the Prophet (ﷺ) came out. People said to him as they were already saying. He said: Observe this prayer when it is dark, for by it you have been made superior to all the peoples, no people having observed it before you.",
      "chain": [
        "38429",
        "28388",
        "19909",
        "18471",
        "32"
      ]
    },
    {
      "hadith_no": "1431",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عوف، حدثنا عثمان بن سعيد، عن أبي غسان، محمد بن مطرف المدني عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن وتره أو نسيه فليصله إذا ذكره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: If anyone oversleeps and misses the witr, or forgets it, he should pray when he remembers.",
      "chain": [
        "38566",
        "28388",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2969",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا شعيب بن أبي حمزة، عن الزهري، حدثني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته بهذا الحديث قال وفاطمة عليها السلام حينئذ تطلب صدقة رسول الله صلى الله عليه وسلم التي بالمدينة وفدك وما بقي من خمس خيبر ‏.‏ قالت عائشة رضى الله عنها فقال أبو بكر رضى الله عنه إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة وإنما يأكل آل محمد في هذا المال ‏\"‏ ‏.‏ يعني مال الله ليس لهم أن يزيدوا على المأكل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Fatimah was demanding (the property of) sadaqah of the Messenger of Allah (ﷺ) at Medina and Fadak, and what remained from the fifth of Khaybar. Aisha quoted AbuBakr as saying: The Messenger of Allah (ﷺ) said: We are not inherited; whatever we leave is sadaqah. The family of Muhammad will eat from this property, that is, from the property of Allah. They will not take more then their sustenance.",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، حدثنا عبد الله بن بسر، قال كان للنبي صلى الله عليه وسلم قصعة يقال لها الغراء يحملها أربعة رجال فلما أضحوا وسجدوا الضحى أتي بتلك القصعة - يعني وقد ثرد فيها - فالتفوا عليها فلما كثروا جثى رسول الله صلى الله عليه وسلم فقال أعرابي ما هذه الجلسة قال النبي صلى الله عليه وسلم ‏\"‏ إن الله جعلني عبدا كريما ولم يجعلني جبارا عنيدا ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا من حواليها ودعوا ذروتها يبارك فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     The Prophet (ﷺ) had a bowl called gharra'. It was carried by four persons. When the sun rose high, and they performed the forenoon prayer, the bowl in which tharid was prepared was brought, and the people gathered round it. When they were numerous, the Messenger of Allah (ﷺ) said: Allah has made me a respectable servant, and He did not make me an obstinate tyrant. The Messenger of Allah (ﷺ) said: Eat from it sides and leave its top, the blessing will be conferred on it",
      "chain": [
        "38429",
        "28388",
        "18930",
        "3650"
      ]
    },
    {
      "hadith_no": "85",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، - هو ابن سعيد بن كثير بن دينار الحمصي عن - شعيب، - هو ابن أبي حمزة - عن الزهري، أخبرني عطاء بن يزيد، عن حمران، أنه رأى عثمان دعا بوضوء فأفرغ على يديه من إنائه فغسلها ثلاث مرات ثم أدخل يمينه في الوضوء فتمضمض واستنشق ثم غسل وجهه ثلاثا ويديه إلى المرفقين ثلاث مرات ثم مسح برأسه ثم غسل كل رجل من رجليه ثلاث مرات ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ وضوئي هذا ثم قال ‏\"‏ من توضأ مثل وضوئي هذا ثم قام فصلى ركعتين لا يحدث فيهما نفسه بشىء غفر الله له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humran that he saw 'Uthman call for (water for) Wudu', then he poured water on his hands from the vessel and washed them three times. Then he put his right hand in the water and rinsed his mouth and his nose. Then he washed his face three times, and his arms up to the elbow three times. Then he wiped his head, and washed each of his feet three times. Then he said:                      \"I saw the Messenger of Allah (ﷺ) performing Wudu' like I have just done.\" Then he said: \"Whoever performs Wudu' as I have done, then stands and prays two Rak'ahs without letting his thoughts wander, his previous sins will be forgiven.'\"",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11206",
        "11421"
      ]
    },
    {
      "hadith_no": "165",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان بن سعيد، عن شعيب، عن الزهري، قال أخبرني عبد الله بن أبي بكر بن عمرو بن حزم، أنه سمع عروة بن الزبير، يقول ذكر مروان في إمارته على المدينة أنه يتوضأ من مس الذكر إذا أفضى إليه الرجل بيده فأنكرت ذلك وقلت لا وضوء على من مسه ‏.‏ فقال مروان أخبرتني بسرة بنت صفوان أنها سمعت رسول الله صلى الله عليه وسلم ذكر ما يتوضأ منه فقال رسول الله صلى الله عليه وسلم ‏\"‏ ويتوضأ من مس الذكر ‏\"‏ ‏.‏ قال عروة فلم أزل أماري مروان حتى دعا رجلا من حرسه فأرسله إلى بسرة فسألها عما حدثت مروان فأرسلت إليه بسرة بمثل الذي حدثني عنها مروان ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair said:                      \"When he was the governor of Al-Madinah, Marwan mentioned that a man should perform Wudu' after touching his penis, if he touches it iwth his hand. I did not like that and I said: 'The one who touches it does not have to perform Wudu'.' Marwan said: 'Busrah bint Safwan told me that she heard the Messenger of Allah (ﷺ) mention the things for which Wudu' should be performed, and the Messenger of Allah (ﷺ) said: 'Wudu' should be performed after touching the penis.' 'Urwah said: 'I continued to argue with Marwan until he called one of his guards and sent him to Busrah to ask her about what Marwan had narrated, and Busrah sent word saying something like that which Marwan had narrated to me from her.\"",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11104",
        "10511"
      ]
    },
    {
      "hadith_no": "876",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا علي بن عياش، قال حدثنا شعيب، عن الزهري، قال حدثني سالم، ح وأخبرني أحمد بن محمد بن المغيرة، قال حدثنا عثمان، - هو ابن سعيد - عن شعيب، عن محمد، - وهو الزهري - قال أخبرني سالم بن عبد الله بن عمر، عن ابن عمر، قال رأيت رسول الله صلى الله عليه وسلم إذا افتتح التكبير في الصلاة رفع يديه حين يكبر حتى يجعلهما حذو منكبيه وإذا كبر للركوع فعل مثل ذلك ثم إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ فعل مثل ذلك وقال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏ ولا يفعل ذلك حين يسجد ولا حين يرفع رأسه من السجود ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     I saw the Messenger of Allah (ﷺ) when he said the opening Takbir of the prayer, raise his hands until they were level with his shoulders. When he said the Takbir before bowing he did likewise, and when he said: 'Sami Allahu liman hamidah (Allah hears those who praise Him),' he did likewise, then he said: 'Rabbana wa lakal-hamd (Our Lord, to You be praise).' But he did not do that when he prostrated or when he raised his head from prostration.",
      "chain": [
        "38433",
        "20448",
        "20428",
        "11013",
        "11011",
        "30304",
        "28388",
        "20239",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2139",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عبيد الله بن فضالة بن إبراهيم، قال أنبأنا محمد، قال حدثنا معاوية، ح وأخبرني أحمد بن محمد بن المغيرة، قال حدثنا عثمان بن سعيد، عن معاوية، - واللفظ له - عن يحيى بن أبي كثير، أن أبا سلمة، أخبره أنه، سمع عبد الله، وهو - ابن عمر - يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الشهر تسع وعشرون ‏\"‏ ‏.‏",
      "text_en": " Abdullah Ibn ' Umar said:                     \" I heard the Messenger of Allah say: 'The month is twenty-nine days.\"'",
      "chain": [
        "30213",
        "27",
        "30304",
        "28388",
        "11449",
        "10567",
        "18",
        "18"
      ]
    },
    {
      "hadith_no": "2439",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي، عن شعيب، عن الزهري، قال أخبرني حميد بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أنفق زوجين من شىء من الأشياء في سبيل الله دعي من أبواب الجنة يا عبد الله هذا خير لك وللجنة أبواب فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ قال أبو بكر هل على من يدعى من تلك الأبواب من ضرورة فهل يدعى منها كلها أحد يا رسول الله قال ‏\"‏ نعم وإني أرجو أن تكون منهم ‏\"‏ ‏.‏ يعني أبا بكر ‏.‏",
      "text_en": " Abu Hurairah said:                     \"I heard the Messenger of Allah say\" 'Whoever spends on a pair of things in the cause of Allah, he will be called from the gates of Paradise: O slave of Allah, this is good for you. Paradise had (several) gates. Whoever is one of the people of Salah, he will be called from the gate of prayer. Whoever is one of the people of Jihad, will be called from the gate of Jihad. Whoever is one of the people of charity will be called from the gate of charity. And whoever is one of the people of fasting will be called from the gate of Ar-Rayyan.\" Abu Bakr said: \"Is there any need for anyone to be called from all of these gates? Will anyone be called from all of them, O Messenger of Allah?\" He said: \"Yes, and I hope that you will be among them.\"",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "3092",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن محمد بن مغيرة، قال حدثنا عثمان بن سعيد، عن شعيب، عن الزهري، قال حدثنا عبيد الله، ح وأنبأنا كثير بن عبيد، قال حدثنا بقية، عن شعيب، قال حدثني الزهري، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن أبا هريرة، قال لما توفي رسول الله صلى الله عليه وسلم وكان أبو بكر بعده وكفر من كفر من العرب قال عمر رضى الله عنه يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها ‏.‏ قال عمر فوالله ما هو إلا أن رأيت أن الله عز وجل شرح صدر أبي بكر للقتال فعرفت أنه الحق ‏.‏ واللفظ لأحمد ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud that Abu Hurairah said:                      \"When the Messenger of Allah (ﷺ) died and Abu Bakr (was appointed Khalifah) after him, and some of the 'Arabs disbelieved, 'Umar, may Allah be pleased with him, said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah (ﷺ) said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah.) Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?'\" Abu Bakr, may Allah be pleased with him, said: \"I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar said) 'By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.'\" The wording is that of Ahmad.",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11201",
        "38462",
        "20644",
        "20239",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "3095",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، عن شعيب، عن الزهري، ح وأخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي قال، حدثنا شعيب، عن الزهري، قال حدثني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قالها فقد عصم مني نفسه وماله إلا بحقه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:                      \"I have been commanded to fight the people until they say La ilaha illallah (there is non worthy or worship except Allah). Whoever says it, his life and his property are safe from me, except for its right, and his reckoning will be with Allah.\"",
      "chain": [
        "30304",
        "30203",
        "20428",
        "11013",
        "38429",
        "28388",
        "20239",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3124",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير بن دينار، قال حدثنا أبي، عن شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، قال سمعت أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثل المجاهد في سبيل الله - والله أعلم بمن يجاهد في سبيل الله - كمثل الصائم القائم وتوكل الله للمجاهد في سبيله بأن يتوفاه فيدخله الجنة أو يرجعه سالما بما نال من أجر أو غنيمة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'The parable of Mujahid (who strives in the cause of Allah) - and Allah knows best who strives in teh cause of Allah - is that of one who fasts and prays Qiyam (continually). Allah has promised Mujahid (who strives in His cause), that He will either cause him to die and admit him to paradise, or, He will bring him back safely with whatever he had earned of reward or spoils of war.'\"",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3552",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير بن دينار، قال حدثنا أبي، عن شعيب، قال قال الزهري أخبرني عبيد الله بن عبد الله بن عتبة، أن عبد الله بن عمرو بن عثمان، طلق ابنة سعيد بن زيد - وأمها حمنة بنت قيس - البتة فأمرتها خالتها فاطمة بنت قيس بالانتقال من بيت عبد الله بن عمرو وسمع بذلك، مروان فأرسل إليها فأمرها أن ترجع إلى مسكنها حتى تنقضي عدتها فأرسلت إليه تخبره أن خالتها فاطمة أفتتها بذلك وأخبرتها أن رسول الله صلى الله عليه وسلم أفتاها بالانتقال حين طلقها أبو عمرو بن حفص المخزومي فأرسل مروان قبيصة بن ذؤيب إلى فاطمة فسألها عن ذلك فزعمت أنها كانت تحت أبي عمرو لما أمر رسول الله صلى الله عليه وسلم علي بن أبي طالب على اليمن خرج معه فأرسل إليها بتطليقة وهي بقية طلاقها فأمر لها الحارث بن هشام وعياش بن أبي ربيعة بنفقتها فأرسلت إلى الحارث وعياش تسألهما النفقة التي أمر لها بها زوجها فقالا والله ما لها علينا نفقة إلا أن تكون حاملا وما لها أن تسكن في مسكننا إلا بإذننا ‏.‏ فزعمت فاطمة أنها أتت رسول الله صلى الله عليه وسلم فذكرت ذلك له فصدقهما قالت فقلت أين أنتقل يا رسول الله فقال ‏\"‏ انتقلي عند ابن أم مكتوم ‏\"‏ ‏.‏ وهو الأعمى الذي عاتبه الله عز وجل في كتابه فانتقلت عنده فكنت أضع ثيابي عنده حتى أنكحها رسول الله صلى الله عليه وسلم زعمت أسامة بن زيد ‏.‏",
      "text_en": " 'Ubaidullah bin 'Abdullah bin 'Utbah narrated that 'Abdullah bin 'Amr bin 'Uthman divorced the daughter of Sa'eed bin Zaid -whose mother was Hamnah bint Qais- irrevocably. Her maternal aunt Fatimah bint Qais told her to move from the house of 'Abdullah bin 'Amr. Marwan heard of that, so he sent word to her, telling her to go back to her home until her 'Iddah was over. She sent a word to him telling him that her maternal aunt Fatimah had issued a Fatwa to that effect, and she told her that the Messenger of Allah had issued a Fatwa to her, telling her to move when Abu 'Amr bin Hafs Al-Makhzumi divorced her. Marwan sent Qabisah bin Dhu'aib to Fatimah to ask her about that. She said that she had been married to Abu 'Amr when the Messenger of Allah appointed 'Ali bin Abi Talib as governor of Yemen, and he went out with him, then he sent word to her divorcing her, and that was the final divorce for her. He told her to ask Al-Harith bin Hisham and 'Ayyash for her provisions that her husband had allocated for her. They said:                      \"By Allah, she is not entitled to any provision. So, she sent to Al-Harith bin Hisham and 'Ayyash asking them for the provisions from us unless she is pregnant, and she has no right to live in our house unless we permit her.\" Fatimah said that she went to the Messenger of Allah and told him about that and he said that they had told the truth. She said: \"I said: 'Where shall I move to, O Messenger of Allah?' He said: 'Move to the house of Ibn Umm Maktum' -who was the blind man, concerning whom Allah rebuked him in His Book. I moved to his house, and I used to take off my outer garments.\" Then the Messenger of Allah married her to Usamah bin Zaid.",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "3906",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان بن سعيد، عن شعيب، قال الزهري كان ابن المسيب يقول ليس باستكراء الأرض بالذهب والورق بأس وكان رافع بن خديج يحدث أن رسول الله صلى الله عليه وسلم نهى عن ذلك‏.‏‏ وافقه على إرساله عبد الكريم بن الحارث‏.‏‏",
      "text_en": " It was narrated from Shu'aib:                      \"Az-Zuhri said: 'Ibn Al-Musayyab used to say: 'There is nothing wrong with leasing land in return for gold and silver, and Rafi bin Khadij used to narrate that the Messenger of Allah forbade that.''\"",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11002",
        "1986"
      ]
    },
    {
      "hadith_no": "5131",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني أحمد بن سعيد بن يعقوب الحمصي، قال حدثنا عثمان بن سعيد، قال حدثنا الليث، عن بكير بن الأشج، عن بسر بن سعيد، عن زينب الثقفية، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ أيتكن خرجت إلى المسجد فلا تقربن طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab Ath-Thaqafiyyah that :                     The Prophet of Allah [SAW] said: \"If any one of you goes out to the Masjid, let her not go near perfume.\"",
      "chain": [
        "38020",
        "28388",
        "20023",
        "11154",
        "11153",
        "498"
      ]
    }
  ],
  "total_hadiths": 15
}