{
  "id": "28389",
  "name": "'Uthman bin 'Abdur Rahman عثمان بن عبد الرحمن بن مسلم - الطرائفي",
  "full_name": "'Uthman bin 'Abdur Rahman عثمان بن عبد الرحمن بن مسلم - الطرائفي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "202",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Taym",
      "Ally B.Umayya",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20646",
      "name": "Ja'far bin Brqan جعفر بن برقان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15370",
      "name": "Asam bin Qdamh al-Bjly عصام بن قدامة البجلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "27533",
      "name": "'Ali bin 'Urwa علي بن عروة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14286",
      "name": "'Umar bin Shakr al-'Abbassri عمر بن شاكر البصري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    }
  ],
  "students": [
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30352",
      "name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30587",
      "name": "Sulaiman bin 'Abdur Rahman سليمان بن عبد الرحمن بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38327",
      "name": "'Abdul Hameed bin Muhammad عبد الحميد بن محمد بن المستام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "33024",
      "name": "Muhammad bin 'Abdullah bin Yazid محمد بن عبد الله بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38412",
      "name": "'Ali bin Maymun al-Rqy علي بن ميمون الرقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38022",
      "name": "Ahmed bin Suliaman أحمد بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31463",
      "name": "Ahmed bin al-Farj bin Sulaiman أحمد بن الفرج بن سليمان",
      "grade": "3rd Century AH"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "991",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عثمان، - يعني ابن عبد الرحمن - حدثنا عصام بن قدامة، - من بني بجيلة - عن مالك بن نمير الخزاعي، عن أبيه، قال رأيت النبي صلى الله عليه وسلم واضعا ذراعه اليمنى على فخذه اليمنى رافعا أصبعه السبابة قد حناها شيئا ‏.‏",
      "text_en": " Narrated AbuMalik Numayr al-Khuza'i:                     I saw the Prophet (peace be upon him placing his right hand on his right thigh and raising his forefinger curving it a little.",
      "chain": [
        "30352",
        "28389",
        "15370",
        "14351"
      ]
    },
    {
      "hadith_no": "4325",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا النفيلي، حدثنا عثمان بن عبد الرحمن، حدثنا ابن أبي ذئب، عن الزهري، عن أبي سلمة، عن فاطمة بنت قيس، أن رسول الله صلى الله عليه وسلم أخر العشاء الآخرة ذات ليلة ثم خرج فقال ‏\"‏ إنه حبسني حديث كان يحدثنيه تميم الداري عن رجل كان في جزيرة من جزائر البحر فإذا أنا بامرأة تجر شعرها قال ما أنت قالت أنا الجساسة اذهب إلى ذلك القصر فأتيته فإذا رجل يجر شعره مسلسل في الأغلال ينزو فيما بين السماء والأرض فقلت من أنت قال أنا الدجال خرج نبي الأميين بعد قلت نعم ‏.‏ قال أطاعوه أم عصوه قلت بل أطاعوه ‏.‏ قال ذاك خير لهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Fatimah, daughter of Qays:                     The Messenger of Allah (ﷺ) once delayed the congregational night prayer.  He came out and said: The talk of Tamim ad-Dari detained me. He transmitted it to me from a man who was on of of the islands of the sea. All of a sudden he found a woman who was trailing her hair. He asked: Who are you?  She said: I am the Jassasah. Go to that castle. So I came to it and found a man who was trailing his hair, chained in iron collars, and leaping between Heaven and Earth.  I asked: Who are you?  He replied: I am the Dajjal (Antichrist). Has the Prophet of the unlettered people come forth now?  I replied: Yes.  He said: Have they obeyed him or disobeyed him?  I said: No, they have obeyed him.  He said: That is better for them.",
      "chain": [
        "30352",
        "28389",
        "20177",
        "11013",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "2457",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو موسى الأنصاري، حدثنا يونس بن بكير، حدثني عثمان بن عبد الرحمن، عن الزهري، عن عروة، عن عائشة، قالت سئل رسول الله صلى الله عليه وسلم عن ورقة فقالت له خديجة إنه كان صدقك ولكنه مات قبل أن تظهر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أريته في المنام وعليه ثياب بياض ولو كان من أهل النار لكان عليه لباس غير ذلك ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ وعثمان بن عبد الرحمن ليس عند أهل الحديث بالقوي ‏.‏",
      "text_en": " 'Aishah said:                      \"The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him:'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been  wearing other than that.'\"",
      "chain": [
        "20118",
        "28389",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2395",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عثمان بن عبد الرحمن، حدثنا علي بن عروة، عن المقبري، عن أبي هريرة، رضى الله عنه قال أمر رسول الله  صلى الله عليه وسلم  الأغنياء باتخاذ الغنم وأمر الفقراء باتخاذ الدجاج وقال ‏\"‏ عند اتخاذ الأغنياء الدجاج يأذن الله بهلاك القرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The  Messenger of Allah (ﷺ) commanded the rich to keep sheep, and he commanded the poor to keep chickens, and he said: 'When the rich keep chickens, then Allah will give permission for the town to be destroyed.\"'",
      "chain": [
        "34188",
        "28389",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عثمان بن عبد الرحمن، حدثنا حميد الطويل، عن أنس بن مالك، قال صنعت أم سليم للنبي  صلى الله عليه وسلم  خبزة وضعت فيها شيئا من سمن ثم قالت اذهب إلى النبي  صلى الله عليه وسلم  فادعه قال فأتيته فقلت أمي تدعوك ‏.‏ قال فقام وقال لمن كان عنده من الناس ‏\"‏ قوموا ‏\"‏ ‏.‏ قال فسبقتهم إليها فأخبرتها فجاء النبي  صلى الله عليه وسلم  فقال ‏\"‏ هاتي ما صنعت ‏\"‏ ‏.‏ فقالت إنما صنعته لك وحدك ‏.‏ فقال ‏\"‏ هاتيه ‏\"‏ ‏.‏ فقال ‏\"‏ يا أنس أدخل على عشرة عشرة ‏\"‏ ‏.‏ قال فما زلت أدخل عليه عشرة عشرة فأكلوا حتى شبعوا وكانوا ثمانين ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “Umm Sulaim made some breadforthe Prophet (ﷺ), and she put a little ghee on it. Then she said:‘Go to the Prophet (ﷺ) and invite him (to come and eat).’ So Iwentand told him: ‘My mother is inviting you (to come and eat).’So hestood up, and said to the people who were with him: ‘Get up.’I wentahead of him and told her. Then the Prophet (ﷺ) came andsaid:‘Bring what you have made.’ She said: ‘I only made it foryou alone.’He said: ‘Bring it.’ Then he said: ‘O Anas, bring(them) in to me tenby ten.’ So I kept bringing them in ten by ten,and they ate theirfill, and there were eighty of them.”",
      "chain": [
        "30423",
        "28389",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3483",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا عثمان بن عبد الرحمن، عن علي بن عروة، عن عبد الملك، عن عطاء، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من السنة أن يخرج الرجل مع ضيفه إلى باب الدار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “It is the Sunnah for a man to go out with his guest to the doorofthe house.’”",
      "chain": [
        "38412",
        "28389",
        "11368",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا عثمان بن عبد الرحمن، حدثنا عبد الله بن عصمة، عن سعيد بن ميمون، عن نافع، قال قال ابن عمر يا نافع تبيغ بي الدم فأتني بحجام واجعله شابا ولا تجعله شيخا ولا صبيا ‏.‏ قال وقال ابن عمر سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الحجامة على الريق أمثل وهي تزيد في العقل وتزيد في الحفظ وتزيد الحافظ حفظا فمن كان محتجما فيوم الخميس على اسم الله واجتنبوا الحجامة يوم الجمعة ويوم السبت ويوم الأحد واحتجموا يوم الاثنين والثلاثاء واجتنبوا الحجامة يوم الأربعاء فإنه اليوم الذي أصيب فيه أيوب بالبلاء وما يبدو جذام ولا برص إلا في يوم الأربعاء أو ليلة الأربعاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Nafi’ said:                      “Ibn ‘Umar said: ‘O Nafi’! Thebloodis boiling in me. Bring me a cupper and let him be a young man,not anold man or a boy.’ Ibn ‘Umar said: ‘I heard theMessenger of Allah(ﷺ) say: “Cupping on an empty stomach isbetter, and it increasesone’s intellect and memory. And itincreases the memory of one who hasa good memory so whoever wants tobe cupped, (let him do it) on aThursday, in the Name of Allah. Avoidcupping on Fridays, Saturdaysand Sundays. Have yourselves cupped onMondays and Tuesdays, and avoidcupping on Wednesdays, for that isthe day on which the calamitybefell Ayyub, and leprosy andleucoderma only appear on Wednesday orthe night of Wednesday.”",
      "chain": [
        "28389",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 7
}