{
  "id": "28422",
  "name": "Amarh bin Abi al-Sh'tha'a عمارة بن أبي الشعثاء",
  "full_name": "Amarh bin Abi al-Sh'tha'a عمارة بن أبي الشعثاء",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ د  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "27014",
      "name": "Snan bin Qays Shamy سنان بن قيس شامي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3082",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني عمارة بن أبي الشعثاء، حدثني سنان بن قيس، حدثني شبيب بن نعيم، حدثني يزيد بن خمير، حدثني أبو الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أخذ أرضا بجزيتها فقد استقال هجرته ومن نزع صغار كافر من عنقه فجعله في عنقه فقد ولى الإسلام ظهره ‏\"‏ ‏.‏ قال فسمع مني خالد بن معدان هذا الحديث فقال لي أشبيب حدثك قلت نعم ‏.‏ قال فإذا قدمت فسله فليكتب إلى بالحديث ‏.‏ قال فكتبه له فلما قدمت سألني خالد بن معدان القرطاس فأعطيته فلما قرأه ترك ما في يديه من الأرضين حين سمع ذلك ‏.‏ قال أبو داود هذا يزيد بن خمير اليزني ليس هو صاحب شعبة ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: If anyone takes land by (paying) its jizyah, he renounces his immigration; and if anyone takes off the disgrace of an unbeliever from his neck he turns away his back from Islam. He (the narrator) said: Thereafter Khalid ibn Ma'dan heard this tradition from me, and he said: Has Shubayb narrated it to you? I said: Yes. He said! When you come to him, ask him to write this tradition to me. He said: He then wrote it for him. When I came, Khalid ibn Ma'dan asked me for the paper and I gave it to him. When he read (the paper), he abandoned the lands he had in his possession the moment he heard this.Abu Dawud said: This Yazid b. Khumair al-Yazani is not the disciple of Shu'bah.",
      "chain": [
        "26010",
        "20644",
        "28422",
        "27014",
        "17033",
        "10981"
      ]
    }
  ],
  "total_hadiths": 1
}