{
  "id": "28427",
  "name": "'Umar bin Rashid bin Shjrh عمر بن راشد بن شجرة",
  "full_name": "'Umar bin Rashid bin Shjrh عمر بن راشد بن شجرة",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Yamama"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Yemami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18793",
      "name": "'Amr bin Sa'd al-Fdky عمرو بن سعد الفدكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10996",
      "name": "Abu Kathir al-Shaymi أبو كثير السحيمي الغبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20195",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Ubaid عبد الرحمن بن عبد الله بن عبيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2131",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن عمر بن راشد، عن إياس بن سلمة بن الأكوع، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الرجل يذهب بنفسه حتى يكتب في الجبارين فيصيبه ما أصابهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Iylas bin Salamah bin Al-Akwa' narrated from his father that the Messenger of Allah said:                     \"A man shall remain exalting himself until he is written among the tyrants, so that he suffers from their afflictions.\"",
      "chain": [
        "30216",
        "20354",
        "28427",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "3596",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء أخبرنا أبو معاوية، عن عمر بن راشد، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سبق المفردون ‏\"‏ ‏.‏ قالوا وما المفردون يا رسول الله قال ‏\"‏ المستهترون في ذكر الله يضع الذكر عنهم أثقالهم فيأتون يوم القيامة خفافا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “The Mufarridun have preceded.” They said: “And who are the Mufarridun, O Messenger of Allah?” He said: “Those who absorb themselves in the remembrance of Allah, and remembrance removed their heavy burdens from them, until they will come on the Day of Judgement being light (in weight of their burdens).”",
      "chain": [
        "30216",
        "20354",
        "28427",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1649",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا عمر بن راشد اليمامي، عن يحيى بن أبي كثير، عن عكرمة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ النياحة على الميت من أمر الجاهلية فإن النائحة إن لم تتب قبل أن تموت فإنها تبعث يوم القيامة عليها سرابيل من قطران ثم يعلى عليها بدروع من لهب النار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Wailing over the dead is one of the affairs of the Days ofIgnorance and if the woman who wails does not repent before she dies,she will be resurrected on the Day of Resurrection wearing a shirt ofpitch (tar), over which she will wear a shirt of flaming fire.”",
      "chain": [
        "11222",
        "30388",
        "28427",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3813",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن عمر بن راشد، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن أبي الدرداء، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ عليك بسبحان الله والحمد لله ولا إله إلا الله والله أكبر فإنها - يعني - يحططن الخطايا كما تحط الشجرة ورقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Darda' said:                     \"The Messenger of Allah (ﷺ) said to me: 'You should recite Subhan-Allah, wal-Hamdu-Lillah, wa la ilahah illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, and Allah is the Most Great), for it sheds sins like the tree sheds its leaves.'\"",
      "chain": [
        "38409",
        "20354",
        "28427",
        "11449",
        "10567",
        "37"
      ]
    }
  ],
  "total_hadiths": 4
}