{
  "id": "28454",
  "name": "'Imarn bin Musa bin 'Amr bin Sa'id عمران بن موسى بن عمرو بن سعيد",
  "full_name": "'Imarn bin Musa bin 'Amr bin Sa'id عمران بن موسى بن عمرو بن سعيد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ت  -  مقبول ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "B.'Abd Shams"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Maqbool] [ د  ت  -  مقبول ]",
        "ar": "Narrator[Grade:Maqbool] [ د  ت  -  مقبول ]",
        "ckb": "Narrator[Grade:Maqbool] [ د  ت  -  مقبول ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "Banu Umayya",
        "ar": "بنو أمية",
        "ckb": "بەنی ئومەیە"
      },
      {
        "en": "B.'Abd Shams",
        "ar": "B.'Abd Shams",
        "ckb": "B.'Abd Shams"
      }
    ]
  },
  "parents": [
    {
      "id": "13125",
      "name": "Musa bin 'Amr bin Sa'id bin al-Aas موسى بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11241",
      "name": "Ayoub bin Musa bin 'Amr bin Sa'id أيوب بن موسى بن عمرو",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-646",
      "hadith_no": "646",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن أبي علي، حدثنا عبد الرزاق، عن ابن جريج، حدثني عمران بن موسى، عن سعيد بن أبي سعيد المقبري، يحدث عن أبيه، أنه رأى أبا رافع مولى النبي صلى الله عليه وسلم مر بحسن بن علي عليهما السلام وهو يصلي قائما وقد غرز ضفره في قفاه فحلها أبو رافع فالتفت حسن إليه مغضبا فقال أبو رافع أقبل على صلاتك ولا تغضب فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذلك كفل الشيطان ‏\"‏ ‏.‏ يعني مقعد الشيطان يعني مغرز ضفره ‏.‏",
      "text_en": " Narrated AbuRafi':                     Sa'id ibn AbuSa'id al-Maqburi reported on the authority of his father that he saw AbuRafi' the freed slave of the Prophet (ﷺ), passing by Hasan ibn Ali (Allah be pleased with them) when he was standing offering his prayer. He had tied the back knot of his hair. AbuRafi' untied it. Hasan turned to him with anger, AbuRafi' said to him: Concentrate on your prayer and do not be angry: I heard the Messenger of Allah (ﷺ)  say: This is the seat of the devil, referring to the back knot of the hair.",
      "usc_msa_ref": "",
      "chain": [
        "20121",
        "11070",
        "28454",
        "11168",
        "11212"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-384",
      "hadith_no": "384",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن عمران بن موسى، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي رافع، أنه مر بالحسن بن علي وهو يصلي وقد عقص ضفرته في قفاه فحلها فالتفت إليه الحسن مغضبا فقال أقبل على صلاتك ولا تغضب فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذلك كفل الشيطان ‏\"‏ ‏.‏ قال وفي الباب عن أم سلمة وعبد الله بن عباس ‏.‏ قال أبو عيسى حديث أبي رافع حديث حسن ‏.‏ والعمل على هذا عند أهل العلم كرهوا أن يصلي الرجل وهو معقوص شعره ‏.‏ قال أبو عيسى وعمران بن موسى هو القرشي المكي وهو أخو أيوب بن موسى ‏.‏",
      "text_en": " Abu Rafi narrated that :                     He passed by Al-Hasan bin Ali while he was performing Salat and he had gathered his locks at the back of his head, so he (Abu Rafi) undid them, and Al-Hasan turned to him angrily. He said: \"Resume your Salat and do not be angry, for indeed I heard Allah's Messenger (S) saying: 'That is the seat of Ash-Shaitan.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20121",
        "11070",
        "28454",
        "11168",
        "11212",
        "479"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2177-2",
      "hadith_no": "2177",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عمران بن موسى القزاز البصري، حدثنا عبد الوارث بن سعيد، حدثنا محمد بن جحادة، عن رجل، عن طاوس، عن أم مالك البهزية، قالت ذكر رسول الله صلى الله عليه وسلم فتنة فقربها قالت قلت يا رسول الله من خير الناس فيها قال ‏\"‏ رجل في ماشيته يؤدي حقها ويعبد ربه ورجل آخذ برأس فرسه يخيف العدو ويخيفونه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أم مبشر وأبي سعيد الخدري وابن عباس ‏.‏ وهذا حديث حسن غريب من هذا الوجه وقد رواه الليث بن أبي سليم عن طاوس عن أم مالك البهزية عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Umm Malik Al-Bahziyyah narrated that the Messenger of Allah (s.a.w) mentioned Fitnah, such that it was drawing near. She said:                     \"I said: 'O Messenger of Allah! Who is the best of people during it?' He said: 'A man among his livestock, who pays what is due on them, and worships his Lord. And a man clutching a head of his horse, terrified of his enemy, and they terrified oh him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "18897",
        "11053"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2191-2",
      "hadith_no": "2191",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عمران بن موسى القزاز البصري، حدثنا حماد بن زيد، حدثنا علي بن زيد بن جدعان القرشي، عن أبي نضرة، عن أبي سعيد الخدري، قال صلى بنا رسول الله صلى الله عليه وسلم يوما صلاة العصر بنهار ثم قام خطيبا فلم يدع شيئا يكون إلى قيام الساعة إلا أخبرنا به حفظه من حفظه ونسيه من نسيه وكان فيما قال ‏\"‏ إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فناظر كيف تعملون ألا فاتقوا الدنيا واتقوا النساء ‏\"‏ ‏.‏ وكان فيما قال ‏\"‏ ألا لا يمنعن رجلا هيبة الناس أن يقول بحق إذا علمه ‏\"‏ ‏.‏ قال فبكى أبو سعيد فقال قد والله رأينا أشياء فهبنا ‏.‏ وكان فيما قال ‏\"‏ ألا إنه ينصب لكل غادر لواء يوم القيامة بقدر غدرته ولا غدرة أعظم من غدرة إمام عامة يركز لواؤه عند استه ‏\"‏ ‏.‏ وكان فيما حفظنا يومئذ ‏\"‏ ألا إن بني آدم خلقوا على طبقات شتى فمنهم من يولد مؤمنا ويحيا مؤمنا ويموت مؤمنا ومنهم من يولد كافرا ويحيا كافرا ويموت كافرا ومنهم من يولد مؤمنا ويحيا مؤمنا ويموت كافرا ومنهم من يولد كافرا ويحيا كافرا ويموت مؤمنا ألا وإن منهم البطيء الغضب سريع الفىء ومنهم سريع الغضب سريع الفىء فتلك بتلك ألا وإن منهم سريع الغضب بطيء الفىء ألا وخيرهم بطيء الغضب سريع الفىء ألا وشرهم سريع الغضب بطيء الفىء ألا وإن منهم حسن القضاء حسن الطلب ومنهم سيئ القضاء حسن الطلب ومنهم حسن القضاء سيئ الطلب فتلك بتلك ألا وإن منهم السيئ القضاء السيئ الطلب ألا وخيرهم الحسن القضاء الحسن الطلب ألا وشرهم سيئ القضاء سيئ الطلب ألا وإن الغضب جمرة في قلب ابن آدم أما رأيتم إلى حمرة عينيه وانتفاخ أوداجه فمن أحس بشيء من ذلك فليلصق بالأرض ‏\"‏ ‏.‏ قال وجعلنا نلتفت إلى الشمس هل بقي منها شيء فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا إنه لم يبق من الدنيا فيما مضى منها إلا كما بقي من يومكم هذا فيما مضى منه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة وأبي مريم وأبي زيد بن أخطب والمغيرة بن شعبة وذكروا أن النبي صلى الله عليه وسلم حدثهم بما هو كائن إلى أن تقوم الساعة ‏.‏ وهذا حديث حسن ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri said:                     \"One day, the Messenger of Allah(s.a.w) led us in Salat Al-Asr while it was still daytime. Then he stood to give us a Khutbah. He did not leave anything that would happen until the Hour of Judgement except that he informed us about it. Whoever remembered it remembered it, and whoever forgot it forgot it. Among what he said was: 'Indeed the world is green and sweet, and indeed Allah has left you to remain to see how you behave. So beware of the world, and beware of the women.' And among what he said was: 'The awe(status) of people should not prevent a man from saying the truth when he knows it.\"'He(one of the narrators) said: \"Abu Sa'eed wept, then he said: 'By Allah! We have seen things and we feared.\"' \"And among what he said in it, was : 'Indeed, for every treacherous person there shall be a banner erected on The Day Of Resurrection in proportion to his treachery. And there is no treachery greater than the treachery of a leader to the masses' whose banner shall be positioned at his buttocks.' And among what we remember from that day is: 'Behold! Indeed the children of Adam were created in various classes. Among them is he who was born a believer, lives as a believer, and dies a believer. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a disbeliever. Among them, is he who was born a believer, lives as a believer, and dies a disbeliever. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a believer. Behold! Among them is the slow to get angry, the quick to calm. Among them is the quick anger and the quick to calm, so this is with that. Behold! Among them is the quick get angry and the slow to calm, and indeed the best of them is the slow to get angry and the quick to calm, and the worst of them is the quick get angry and the slow to calm. Behold! Among them is he who pays back well and collects well. Among them is he who is bad with paying back and good when collecting. Among them is he who pays back well and is bad with collecting, so this is with that. Behold! Among them is he who is bad with paying back and bad with collecting. Indeed the best of them is the one who is good in paying back and good in collecting. And the worst of them is the one who is bad with paying back and bad with collecting. Behold! Anger is an ember in the heart of the son of Adam, as you see it in the redness of his eyes and the bulge of his jugular veins. So whoever senses  something from that, then let him cling to the ground.\"'He said: \"So we began turning towards the sun to see if anything of it remained(meaning whether it has set or not). So the Messenger of Allah(s.a.w) said: 'Behold! The world, in relation to what has passed of it, shall not remain except as what remains of this day of yours, in relation to what has passed of it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-6",
      "hadith_no": "6",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا حميد بن مسعدة، وعمران بن موسى، قالا حدثنا عبد الوارث، قال حدثنا شعيب بن الحبحاب، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قد أكثرت عليكم في السواك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah (ﷺ) said: 'I have indeed urged you with regard to the Siwak.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "28454",
        "20258",
        "11596",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-445",
      "hadith_no": "445",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا محمد بن سواء، عن شعبة، عن معمر، عن الزهري، عن عروة بن الزبير، عن بسرة بنت صفوان، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أفضى أحدكم بيده إلى فرجه فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Busrah bint Safwan that the Prophet (ﷺ) said:                      \"If any one of you touches his private part with his hand, let him perform Wudu'.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20565",
        "20020",
        "20115",
        "11013",
        "10511",
        "861"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-543",
      "hadith_no": "543",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا داود، عن أبي نضرة، عن أبي سعيد الخدري، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة المغرب ثم لم يخرج إلينا حتى ذهب شطر الليل فخرج فصلى بهم ثم قال ‏\"‏ إن الناس قد صلوا وناموا وأنتم لم تزالوا في صلاة ما انتظرتم الصلاة ولولا ضعف الضعيف وسقم السقيم لأمرت بهذه الصلاة أن تؤخر إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"The Messenger of Allah (ﷺ) led us in Maghrib prayer, then he did not come out to us until half the night had passed. Then he came out and led them in prayer, then he said: 'The people have prayed and gone to sleep, but you are still in a state of prayer so long as you are waiting for the prayer. Were it not for the weakness of the weak and, the sickness of the sick, I would have commanded that this prayer be delayed until halfway through the night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-702",
      "hadith_no": "702",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال لما قدم رسول الله صلى الله عليه وسلم نزل في عرض المدينة في حى يقال لهم بنو عمرو بن عوف فأقام فيهم أربع عشرة ليلة ثم أرسل إلى ملإ من بني النجار فجاءوا متقلدي سيوفهم كأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته وأبو بكر - رضى الله عنه - رديفه وملأ من بني النجار حوله حتى ألقى بفناء أبي أيوب وكان يصلي حيث أدركته الصلاة فيصلي في مرابض الغنم ثم أمر بالمسجد فأرسل إلى ملإ من بني النجار فجاءوا فقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏ ‏.‏ قالوا والله لا نطلب ثمنه إلا إلى الله عز وجل ‏.‏ قال أنس وكانت فيه قبور المشركين وكانت فيه خرب وكان فيه نخل فأمر رسول الله صلى الله عليه وسلم بقبور المشركين فنبشت وبالنخل فقطعت وبالخرب فسويت فصفوا النخل قبلة المسجد وجعلوا عضادتيه الحجارة وجعلوا ينقلون الصخر وهم يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم لا خير إلا خير الآخرة فانصر الأنصار والمهاجرة",
      "text_en": " It was narrated that Anas bin Malik said:                      \"When the Messenger of Allah (ﷺ) came to Al-Madinah, he alighted in the upper part of Al-Madinah among the tribe called Banu 'Amr bin 'Awf and he stayed with them for fourteen nights. Then he sent for the chiefs of Banu An-Najjar, and they came with their swords by their sides. It is as if I can see the Messenger of Allah (ﷺ) on his she-camel with Abu Bakr riding behind him (on the same camel) and the chiefs of Banu An-Najjar around him, until he dismounted in the courtyard of Abu Ayyub. The Prophet (ﷺ) used to offer the prayer wherever he was when the time for prayer came, and he would pray even in sheepfolds. Then he ordered that the Masjid be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said: 'O Banu An-Najjar, name me a price for this grove of yours.' They said: 'By Allah, we will not ask for its price except from Allah.'\" Anas said: \"In (that grove) there were graves of idolators, ruins and date-palm trees. The Messenger of Allah (ﷺ) ordered that the graves of the idolators be dug up, the ruins be leveled and the date-palm trees be cut down. The trunks of the trees were arranged so as to form the walls facing the Qiblah. The stone pillars were built at the sides of its gate. They started to move the stones, reciting some lines of verse, and the Messenger of Allah (ﷺ) was with them when they were saying: 'O Allah! There is no good except the good of the Hereafter. So bestow victory on the Ansar and the Muhajirin.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11317",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-943",
      "hadith_no": "943",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا يزيد بن زريع، قال حدثنا شعبة، عن منصور، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ بئسما لأحدهم أن يقول نسيت آية كيت وكيت بل هو نسي استذكروا القرآن فإنه أسرع تفصيا من صدور الرجال من النعم من عقله ‏\"‏.‏",
      "text_en": " It was narrated from Abdullah that:                     The Prophet (ﷺ) said: \"It is not right for any one of you to say: 'I have forgotten such and such a verse.' Rather, he has been caused to forget. Study the Qur'an, for it escapes from the heart of man faster than a camel escapes from its fetter. \"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20304",
        "20020",
        "11067",
        "11353",
        "16"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1491",
      "hadith_no": "1491",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا يونس، عن الحسن، عن أبي بكرة، قال كنا عند رسول الله صلى الله عليه وسلم فانكسفت الشمس فخرج رسول الله صلى الله عليه وسلم يجر رداءه حتى انتهى إلى المسجد وثاب إليه الناس فصلى بنا ركعتين فلما انكشفت الشمس قال ‏\"‏ إن الشمس والقمر آيتان من آيات الله يخوف الله عز وجل بهما عباده وإنهما لا يخسفان لموت أحد ولا لحياته فإذا رأيتم ذلك فصلوا حتى يكشف ما بكم ‏\"‏ ‏.‏ وذلك أن ابنا له مات يقال له إبراهيم فقال له ناس في ذلك ‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"We were with the Messenger of Allah (ﷺ) when the sun became eclipsed. The Messenger of Allah (ﷺ) went out dragging his garment, until he came to the masjid, and the people gathered around him. He led us in praying two rak'ahs and when (the eclipse) ended he said: 'The sun and the moon are two of the signs of Allah (SWT) by means of which Allah (SWT), the Mighty and Sublime, strikes fear into His slaves. They do not become eclipsed for the death or birth of anyone. If you see that, then pray until Allah (SWT)r relieves you of fear.' That was because his son named Ibrahim had died, and the people suggested to him that (the eclipse) happened because of that.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "20475",
        "11016",
        "3229"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1566",
      "hadith_no": "1566",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا يزيد بن زريع، قال حدثنا سفيان بن سعيد، عن زبيد الأيامي، عن عبد الرحمن بن أبي ليلى، ذكره عن عمر بن الخطاب، - رضى الله عنه - قال صلاة الأضحى ركعتان وصلاة الفطر ركعتان وصلاة المسافر ركعتان وصلاة الجمعة ركعتان تمام ليس بقصر على لسان النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab said:                     \"The prayer of Al-Adha is two rak'ahs, the prayer of Al-Fitr is two rak'ahs, the prayer of the traveler is two rak'ahs and the jumu'ah prayer is two rak'ahs, complete and not shortened, upon the tongue of the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20304",
        "20012",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1643",
      "hadith_no": "1643",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمران بن موسى، عن عبد الوارث، قال حدثنا عبد العزيز، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم دخل المسجد فرأى حبلا ممدودا بين ساريتين فقال ‏\"‏ ما هذا الحبل ‏\"‏ ‏.‏ فقالوا لزينب تصلي فإذا فترت تعلقت به ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ حلوه ليصل أحدكم نشاطه فإذا فتر فليقعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     The Messenger of Allah (ﷺ) entered the masjid and saw a rope tied between two pillars. He said: \"What is this?\" They said: \"It is for Zainab when she prays; if she gets tired she holds on to it.\" The Prophet (ﷺ) said: \"Untie it. Let any one of you pray as long as he has energy, and if he gets tired let him sit down.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11295",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1736",
      "hadith_no": "1736",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا محمد بن جحادة، عن زبيد، عن ابن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا فرغ من الصلاة قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " Muhammad bin Juhadah reported from Zubaid, Sa'eed bin 'Abdur-Rahman bin Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he had finished praying, he said: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "18897",
        "11335"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1821",
      "hadith_no": "1821",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل ابن علية، عن عبد العزيز، ح وأنبأنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا عبد العزيز، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا لا يتمنى أحدكم الموت لضر نزل به فإن كان لا بد متمنيا الموت فليقل اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah said: 'None of you should wish for death because of some harm that befalls him. If he must wish for death, let him say: Allahumma ahini ma kanatil-hayatu khairantli wa tawaffani idha kanatil-wafatu khairanli (O Allah, keep me alive so long as life is good for me, and cause me to die when death is good for me)\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11295",
        "28454",
        "20258",
        "11295",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2029",
      "hadith_no": "2029",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن أبي الزبير، عن جابر، قال ‏:‏ نهى رسول الله صلى الله عليه وسلم عن تجصيص القبور ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah forbade plastering over graves.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11015",
        "11263",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2500",
      "hadith_no": "2500",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمران بن موسى، عن عبد الوارث، قال حدثنا أيوب، عن نافع، عن ابن عمر، قال فرض رسول الله صلى الله عليه وسلم زكاة رمضان على الحر والعبد والذكر والأنثى صاعا من تمر أو صاعا من شعير فعدل الناس به نصف صاع من بر ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah enjoined Zakah of Ramadan upon the free and the slave, male and female, a Sa[1] of dates or a Sa of barley, so the people considered that equivalent to half a Sa of wheat.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11015",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2633",
      "hadith_no": "2633",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا أبو التياح، قال حدثني موسى بن سلمة الهذلي، أن ابن عباس، قال أمرت امرأة سنان بن سلمة الجهني أن يسأل، رسول الله صلى الله عليه وسلم أن أمها ماتت ولم تحج أفيجزئ عن أمها أن تحج عنها قال ‏\"‏ نعم لو كان على أمها دين فقضته عنها ألم يكن يجزئ عنها فلتحج عن أمها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                     \"The wife of sinan bin Salamah Al-Juhani ordered that the question be put to the Messenger of Allah about her mother who had died and had not performed Hajj; would it be good enough if she were to perform Hajj on behalf of her mother? He said: 'Yes. If her mother owed a debt and she paid it off, would that not be good enough? Let her perform Hajj on behalf of her mother.'''",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11317",
        "26042",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2953",
      "hadith_no": "2953",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن نافع، عن ابن عمر، قال ما تركت استلام الحجر في رخاء ولا شدة منذ رأيت رسول الله صلى الله عليه وسلم يستلمه ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"Since I saw the Messenger of Allah touch it, I did not fail to touching the Stone whether it was easy or difficult.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11015",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3572",
      "hadith_no": "3572",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا يونس، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير، قال رأيت رسول الله صلى الله عليه وسلم يفتل ناصية فرس بين أصبعيه ويقول ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والغنيمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jarir said:                      \"I saw the Messenger of Allah twisting the forelock of a horse with his two fingers, and saying: 'Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "20475",
        "10602",
        "11406",
        "4057"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3589",
      "hadith_no": "3589",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، عن محمد بن عمرو، عن أبي الحكم، - مولى لبني ليث - عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا سبق إلا في خف أو حافر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"There should be no awards (for victory in a competition) except over camels or horses.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11220",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4059",
      "hadith_no": "4059",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن عكرمة، قال قال ابن عباس قال رسول الله صلى الله عليه وسلم ‏\"‏ من بدل دينه فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                     \"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11015",
        "11023",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4280",
      "hadith_no": "4280",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا يزيد بن زريع، قال حدثنا يونس، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها فاقتلوا منها الأسود البهيم وأيما قوم اتخذوا كلبا ليس بكلب حرث أو صيد أو ماشية فإنه ينقص من أجره كل يوم قيراط ‏\"‏ ‏.‏",
      "text_en": " It was narrated form 'Abdullah bin Mughaffal that the Messenger of Allah said:                     \"Were it not that dogs form one of the communities (or nations - of creatures), I would have commanded that they be killed. But kill those that are all black. Any people who keep a dog, except for dogs used for farming, hunting or herding livestock, one Qirat will be deducted from their reward each day.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20304",
        "20475",
        "11016",
        "3242"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5014",
      "hadith_no": "5014",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا الحسين بن حريث قال أنبأنا إسمعيل عن عبد العزيز ح وأنبأنا عمران بن موسى قال حدثنا عبد الوارث قال حدثنا عبد العزيز عن أنس قال  قال رسول الله صلى الله عليه وسلم لا يؤمن أحدكم حتى أكون أحب إليه من ماله وأهله والناس أجمعين",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah [SAW] said: 'None of you has believed until I am dearer to him than his family, his wealth and all the people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20167",
        "28454",
        "20258",
        "11295",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5282",
      "hadith_no": "5282",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، عن عبد العزيز، عن أنس، أن النبي صلى الله عليه وسلم اصطنع خاتما فقال ‏\"‏ إنا قد اتخذنا خاتما ونقشنا عليه نقشا فلا ينقش عليه أحد ‏\"‏ ‏.‏ وإني لأرى بريقه في خنصر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Anas that:                     The Prophet [SAW] had a ring and he said: \"We have had a ring made with an inscription, and no one else should copy this inscription.\" It is as if I can see its shining on the little finer of the Messenger of Allah [SAW].",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11295",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5300",
      "hadith_no": "5300",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا يحيى، - وهو ابن أبي إسحاق - قال قال سالم ما الإستبرق قلت ما غلظ من الديباج وخشن منه ‏.‏ قال سمعت عبد الله بن عمر يقول رأى عمر مع رجل حلة سندس فأتى بها النبي صلى الله عليه وسلم فقال ‏\"‏ اشتر هذه ‏\"‏ ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Yahya - bin Ishaq - said:                     \"Salim said: 'What is Al-Istabraq?' I said: 'A thick type of Ad-Dibaj, and a coarse type of it.' He said: 'I heard 'Abdullah (bin 'Umar) say: \"Umar saw a Hullah of Sundus with a man, and he brought it to the Messenger of Allah [SAW] and said: 'Buy this'\" and he quoted the Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11314",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-589",
      "hadith_no": "589",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا محمد بن سواء، حدثنا سعيد بن أبي عروبة، عن أيوب، عن نافع، عن ابن عمر، أنه رأى سعد بن مالك وهو يمسح على الخفين فقال إنكم لتفعلون ذلك فاجتمعنا عند عمر فقال سعد لعمر أفت ابن أخي في المسح على الخفين ‏.‏ فقال عمر كنا ونحن مع رسول الله  صلى الله عليه وسلم  نمسح على خفافنا لم نر بذلك بأسا ‏.‏ فقال ابن عمر وإن جاء من الغائط قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     He saw Sa'd bin Malik wiping over his leather socks and said: \"Is it you doing this?\" They both went to 'Umar and Sa'd said to 'Umar: \"Give my brother's son a verdict regarding wiping over leather socks.\" 'Umar said: \"We used to wipe over our leather socks when we were with the Messenger of Allah and we do not see anything wrong with that.\" Ibn 'Umar said: \"Even if that is after one has defecated?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20565",
        "11073",
        "11015",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-693-2",
      "hadith_no": "693",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا عبد الوارث بن سعيد، حدثنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد، قال صلى بنا رسول الله  صلى الله عليه وسلم  صلاة المغرب ثم لم يخرج حتى ذهب شطر الليل فخرج فصلى بهم ثم قال ‏\"‏ إن الناس قد صلوا وناموا وأنتم لم تزالوا في صلاة ما انتظرتم الصلاة ولولا الضعيف والسقيم أحببت أن أؤخر هذه الصلاة إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah led us for the Maghrib prayer. Then he did not come out until half the night had passed. Then he came out and led them in prayer, then he said: \"The people have prayed and gone to sleep, but you are still in a state of prayer so long as you are waiting for the (next) prayer. Were it not for the weak and the sick, I wanted to delay this prayer until the middle of the night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11585",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1433",
      "hadith_no": "1433",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا عبد الوارث بن سعيد، عن عبد العزيز بن صهيب، عن أنس بن مالك، أن رسول الله  صلى الله عليه وسلم  دخل المسجد فرأى حبلا ممدودا بين ساريتين فقال ‏\"‏ ما هذا الحبل ‏\"‏ ‏.‏ قالوا لزينب تصلي فيه فإذا فترت تعلقت به ‏.‏ فقال ‏\"‏ حلوه حلوه ليصل أحدكم نشاطه فإذا فتر فليقعد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)entered the mosque and saw a rope tied between two pillars. He said,“What is this rope?” They said:                      “It belongs to Zainab. Sheprays hereand when she gets tired she holds on to it.” He said:“Untie it, untieit; let any one of you pray when he has energy, ifhe gets tired lethim sit down.”",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11295",
        "19"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2312",
      "hadith_no": "2312",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، ح وحدثنا بشر بن معاذ الضرير، حدثنا أبو عوانة، وحماد بن زيد، قالا حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من ابتاع طعاما فلا يبعه حتى يستوفيه ‏\"‏ ‏.‏ قال أبو عوانة في حديثه قال ابن عباس وأحسب كل شىء مثل الطعام ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever buys food, let him not sell it until he has taken full possession of it.'\" (Sahih)  In his narration, (one of the narrators) Abu 'Awanah said: \"Ibn 'Abbas said: 'I think everything is like food.\"'",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "34041",
        "20469",
        "20022",
        "11081",
        "11053",
        "17"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2865",
      "hadith_no": "2865",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، حدثنا أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل دينار ينفقه الرجل دينار ينفقه على عياله ودينار ينفقه على فرس في سبيل الله ودينار ينفقه الرجل على أصحابه في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban that the Messenger of Allah (ﷺ) said:                     “Thebest Dinar that a man can spend is a Dinar that he spends on hisfamily, a Dinar that he spends on a horse in the cause of Allah, andaDinar that a man spends on his companions in the cause of Allah.”",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "11015",
        "11047",
        "130"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2983",
      "hadith_no": "2983",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، أنبأنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا إنه ينصب لكل غادر لواء يوم القيامة بقدر غدرته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “For every traitor a banner will be set up on the DayofResurrection, commensurate with his treachery.”",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4096",
      "hadith_no": "4096",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا عبد الوارث بن سعيد، حدثنا محمد بن جحادة، عن عبد الرحمن بن ثروان، عن هزيل بن شرحبيل، عن أبي موسى الأشعري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن بين يدى الساعة فتنا كقطع الليل المظلم يصبح الرجل فيها مؤمنا ويمسي كافرا ويمسي مؤمنا ويصبح كافرا القاعد فيها خير من القائم والقائم فيها خير من الماشي والماشي فيها خير من الساعي فكسروا قسيكم وقطعوا أوتاركم واضربوا بسيوفكم الحجارة فإن دخل على أحد منكم فليكن كخير ابنى آدم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa Al-Ash’ari that the Messenger ofAllah(ﷺ) said:                      “Before the Hour comes, there will be tribulationlikepieces of black night, when a man will wake up as a believer butbe adisbeliever by evening, or he will be a believer in the eveningbutwill be a disbeliever by morning. And the one who is sitting willbebetter than the one who is standing, and the one who is standingwillbe better than the one who is walking, and the one who iswalking willbe better than the one who is running. So break yourbows, cut theirstrings and strike your swords against rocks, and ifanyone entersupon anyone of you, let him be like the better of thetwo sons ofAdam. (i.e. the one killed, not the killer).”",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "18897",
        "11637",
        "11660",
        "41"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4135",
      "hadith_no": "4135",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، حدثنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد، أن رسول الله  صلى الله عليه وسلم  قام خطيبا فكان فيما قال ‏\"‏ إن الدنيا خضرة حلوة وإن الله مستخلفكم فيها فناظر كيف تعملون ألا فاتقوا الدنيا واتقوا النساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed that the Messenger of Allah (ﷺ)stood up to deliver a sermon and one of the things that he said was:                     “This world is fresh and sweet, and Allah will make your successivegenerations therein, so look at what you do and beware of (thetemptations of) this world and beware of (the temptations of) women.”",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4143",
      "hadith_no": "4143",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى، أنبأنا حماد بن زيد، حدثنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  قام خطيبا فكان فيما قال ‏\"‏ ألا لا يمنعن رجلا هيبة الناس أن يقول بحق إذا علمه ‏\"‏ ‏.‏ قال فبكى أبو سعيد وقال قد والله رأينا أشياء فهبنا ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed Al-Khudri that the Messenger ofAllah (ﷺ) stood up to deliver a sermon, and one of the things hesaid was:                      “Indeed, fear of people should not prevent a man from speakingthe truth, if he knows it.”Then Abu Sa'eed wept and said: \"By Allah, we have seen things that made us scared (and we did not speak up).\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 34,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}