{
  "id": "28464",
  "name": "al-'Ala' bin Hilal bin 'Umar bin Hilal العلاء بن هلال بن عمر بن هلال",
  "full_name": "al-'Ala' bin Hilal bin 'Umar bin Hilal العلاء بن هلال بن عمر بن هلال",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "215",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ س  -  لين الحديث ]"
    ],
    "tags": [
      "al-Bahali",
      "al-Raqqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "38684",
      "name": "Hilal bin al-'Ala' bin Hilal bin 'Umar هلال بن العلاء بن هلال بن عمر",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "38684",
      "name": "Hilal bin al-'Ala' bin Hilal bin 'Umar هلال بن العلاء بن هلال بن عمر",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1167",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني محمد بن جبلة الرافقي، قال حدثنا العلاء بن هلال، قال حدثنا عبيد الله، - وهو ابن عمرو - عن زيد بن أبي أنيسة، عن حماد، عن إبراهيم، عن علقمة بن قيس، عن عبد الله، قال كنا لا ندري ما نقول إذا صلينا فعلمنا نبي الله صلى الله عليه وسلم جوامع الكلم فقال لنا ‏\"‏ قولوا التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏ قال عبيد الله قال زيد عن حماد عن إبراهيم عن علقمة قال لقد رأيت ابن مسعود يعلمنا هؤلاء الكلمات كما يعلمنا القرآن ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Qais that 'Abdullah said:                     \"We used not to know what to say when we prayed, then the Messenger of Allah (ﷺ) taught us some eloquent and concise words. He said to us: 'Say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\" (One of the narrators) 'Ubaidullah said: \"Zaid bin Hammad said, narrating from Ibrahim, that 'Alqamah said: 'I saw Ibn Mas'ud teaching us these words just as he taught us the Quran.\"",
      "chain": [
        "38485",
        "28464",
        "30024",
        "11340",
        "20022",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1813",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا أبي قال، حدثنا عبيد الله، عن زيد بن أبي أنيسة، قال حدثني أيوب، - رجل من أهل الشام - عن القاسم الدمشقي، عن عنبسة بن أبي سفيان، قال أخبرتني أختي أم حبيبة، زوج النبي صلى الله عليه وسلم أن حبيبها أبا القاسم صلى الله عليه وسلم أخبرها قال ‏\"‏ ما من عبد مؤمن يصلي أربع ركعات بعد الظهر فتمس وجهه النار أبدا إن شاء الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Anbasah bin Abi Sufyan said:                     \"My sister Umm Habibah, the wife of the Prophet (ﷺ), told me that her beloved Abu Al-Qasim (ﷺ) told her: 'There is no believing slave who prays four rak'ahs after Zuhr whose face will ever be touched by the Fire, if Allah, the Mighty and Sublime, wills.'\"",
      "chain": [
        "38684",
        "28464",
        "11201",
        "11340",
        "846"
      ]
    },
    {
      "hadith_no": "2211",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، عن زيد، عن أبي إسحاق، عن عبد الله بن الحارث، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله تبارك وتعالى يقول الصوم لي وأنا أجزي به وللصائم فرحتان حين يفطر وحين يلقى ربه والذي نفسي بيده لخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that the Messenger of Allah said:                     \"Allah, may He be blessed and exalted, says: 'Fasting is for me and I shall reward for it. The fasting person has two moments of joy: When he breaks his fast and when he meets his Lord.' By the One in whose hand is my soul, the smell that comes from the mouth of the fasting person is better before Allah than the fragrance of musk.\" '",
      "chain": [
        "38684",
        "28464",
        "11201",
        "15",
        "11049",
        "912",
        "5"
      ]
    },
    {
      "hadith_no": "2242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء بن هلال، قال حدثنا أبي قال، حدثنا علي بن هاشم، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، قال دخلنا على عبد الله ومعنا علقمة والأسود وجماعة فحدثنا بحديث ما رأيته حدث به القوم إلا من أجلي لأني كنت أحدثهم سنا قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ‏\"‏ ‏.‏ قال علي وسئل الأعمش عن حديث إبراهيم فقال عن إبراهيم عن علقمة عن عبد الله مثله قال نعم ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Yazid said:                     \"We entered upon 'Abdullah along with 'Alqamah, Al-Aswad and a group (of others). He told us a Hadith which he only narrated to the people because of me, as I was the youngest of them. The Messenger of Allah said: 'O young men, whoever among you can afford to get married let him do so, for it is more effective in lowering the gaze and guarding one's chastity.\"' (One of the narrators) 'Ali said: \"Al-Amash was asked about the narrated of Ibrahim, so he (the questioner) said: 'Form Ibrahim, from 'Alqamah, from 'Abdullah; similarly?. Which he (Al-'Amash) replied: 'Yes.",
      "chain": [
        "38684",
        "28464",
        "11060",
        "11379",
        "11055"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، - وهو ابن عمرو - عن سفيان، عن ابن أبي نجيح، عن طاوس، عن زيد بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ الرقبى جائزة ‏\"‏ ‏.‏",
      "text_en": " Hilal bin Al-'Ala' informed us:                      \"My father narrated to us: Ubaidullah -he is, Ibn 'Amr- narrated to us, from Sufyan, from Ibn Abi Najih, from Tawus, from Zaid bin Thabit, that the Prophet said: 'Ar-Ruqba is permissible.'\"",
      "chain": [
        "38684",
        "28464",
        "30024",
        "20005",
        "11254",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثني أبي قال، حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن عطاء، عن صفوان بن أمية، أن رجلا، سرق بردة له فرفعه إلى النبي صلى الله عليه وسلم فأمر بقطعه فقال يا رسول الله قد تجاوزت عنه ‏.‏ فقال ‏\"‏ أبا وهب أفلا كان قبل أن تأتينا به ‏\"‏ ‏.‏ فقطعه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah, that:                     a man stole a Burdah of his, so he brought him before the Messenger of Allah, who ordered that his hand be cut off. He said: \"O Messenger of Allah, I will let him have it.\" He said: \"Abu Wahb! Why didn't you do that before you brought him to us?\" And the Messenger of Allah had (the man's) hand cut off.",
      "chain": [
        "38684",
        "28464",
        "20304",
        "11168",
        "11019",
        "11029",
        "449"
      ]
    },
    {
      "hadith_no": "5479",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، عن إسرائيل، عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون الأودي، قالا كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن في دبر كل صلاة ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mus'ab bin Sa'd and 'Amr bin Maimun Al-Awdi said:                     \"Sa'd used to teach his children these words as a teacher teaches his students, and he would say that the Messenger of Allah [SAW] used to seek refuge (with Allah) with these words at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika mnal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge with You from cowardice, and I seek refuge with You from reaching the age of senility, and I seek refuge with You from the trials of this life and the torment of the grave.)'\"",
      "chain": [
        "38684",
        "28464",
        "11201",
        "20311",
        "11368",
        "10556",
        "11382"
      ]
    },
    {
      "hadith_no": "5534",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني العلاء بن هلال، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن القاسم بن عبد الرحمن، عن مسروق بن الأجدع، عن عائشة، قالت طلبت رسول الله صلى الله عليه وسلم ذات ليلة في فراشي فلم أصبه فضربت بيدي على رأس الفراش فوقعت يدي على أخمص قدميه فإذا هو ساجد يقول ‏\"‏ أعوذ بعفوك من عقابك وأعوذ برضاك من سخطك وأعوذ بك منك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I looked for the Messenger of Allah [SAW] one night in my bed, and I did not find him. I struck my hand on the head of the bed, and my hand fell on the soles of his feet. He was prostrating and saying: 'A'udhu bi 'afwika min 'iqabika, wa a'udhu bi ridaka min sakhatika, wa a'udhu bika minka (I seek refuge in Your forgiveness from Your punishment, and I seek refuge in Your pleasure from Your wrath, and I seek refuge in You from You.)'\"",
      "chain": [
        "38088",
        "28464",
        "11201",
        "15",
        "11381",
        "19896",
        "11018",
        "53"
      ]
    }
  ],
  "total_hadiths": 8
}