{
  "id": "28500",
  "name": "Muhammad bin Thwr al-Sn'any محمد بن ثور الصنعاني أبو عبد الله",
  "full_name": "Muhammad bin Thwr al-Sn'any محمد بن ثور الصنعاني أبو عبد الله",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "190",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Sana'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28635",
      "name": "Yahya bin al-'Ala al-Bijly يحيى بن العلاء البجلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30449",
      "name": "Muhammad bin 'Abdul A'la محمد بن عبد الأعلى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30451",
      "name": "Muhammad bin 'Ubaid bin Hsab محمد بن عبيد بن حساب",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2765",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عبيد، أن محمد بن ثور، حدثهم عن معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، قال خرج النبي صلى الله عليه وسلم زمن الحديبية في بضع عشرة مائة من أصحابه حتى إذا كانوا بذي الحليفة قلد الهدى وأشعره وأحرم بالعمرة ‏.‏ وساق الحديث قال وسار النبي صلى الله عليه وسلم حتى إذا كان بالثنية التي يهبط عليهم منها بركت به راحلته فقال الناس حل حل خلأت القصواء ‏.‏ مرتين فقال النبي صلى الله عليه وسلم ‏\"‏ ما خلأت وما ذلك لها بخلق ولكن حبسها حابس الفيل ‏\"‏ ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لا يسألوني اليوم خطة يعظمون بها حرمات الله إلا أعطيتهم إياها ‏\"‏ ‏.‏ ثم زجرها فوثبت فعدل عنهم حتى نزل بأقصى الحديبية على ثمد قليل الماء فجاءه بديل بن ورقاء الخزاعي ثم أتاه - يعني عروة بن مسعود - فجعل يكلم النبي صلى الله عليه وسلم فكلما كلمه أخذ بلحيته والمغيرة بن شعبة قائم على النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر فضرب يده بنعل السيف وقال أخر يدك عن لحيته ‏.‏ فرفع عروة رأسه فقال من هذا قالوا المغيرة بن شعبة ‏.‏ فقال أى غدر أولست أسعى في غدرتك وكان المغيرة صحب قوما في الجاهلية فقتلهم وأخذ أموالهم ثم جاء فأسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما الإسلام فقد قبلنا وأما المال فإنه مال غدر لا حاجة لنا فيه ‏\"‏ ‏.‏ فذكر الحديث فقال النبي صلى الله عليه وسلم ‏\"‏ اكتب هذا ما قاضى عليه محمد رسول الله ‏\"‏ ‏.‏ وقص الخبر فقال سهيل وعلى أنه لا يأتيك منا رجل وإن كان على دينك إلا رددته إلينا ‏.‏ فلما فرغ من قضية الكتاب قال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ قوموا فانحروا ثم احلقوا ‏\"‏ ‏.‏ ثم جاء نسوة مؤمنات مهاجرات الآية فنهاهم الله أن يردوهن وأمرهم أن يردوا الصداق ثم رجع إلى المدينة فجاءه أبو بصير رجل من قريش - يعني فأرسلوا في طلبه - فدفعه إلى الرجلين فخرجا به حتى إذا بلغا ذا الحليفة نزلوا يأكلون من تمر لهم فقال أبو بصير لأحد الرجلين والله إني لأرى سيفك هذا يا فلان جيدا ‏.‏ فاستله الآخر فقال أجل قد جربت به فقال أبو بصير أرني أنظر إليه فأمكنه منه فضربه حتى برد وفر الآخر حتى أتى المدينة فدخل المسجد يعدو فقال النبي صلى الله عليه وسلم ‏\"‏ لقد رأى هذا ذعرا ‏\"‏ ‏.‏ فقال قد قتل والله صاحبي وإني لمقتول فجاء أبو بصير فقال قد أوفى الله ذمتك فقد رددتني إليهم ثم نجاني الله منهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ويل أمه مسعر حرب لو كان له أحد ‏\"‏ ‏.‏ فلما سمع ذلك عرف أنه سيرده إليهم فخرج حتى أتى سيف البحر وينفلت أبو جندل فلحق بأبي بصير حتى اجتمعت منهم عصابة ‏.‏",
      "text_en": " Al Miswar bin Makhramah said :                      The Messenger of Allah (ﷺ) came out in the year of al-Hudaibbiyyah with over ten hundreds of Companions and when he came to Dhu al Hulaifah. He garlanded and marked the sacrificial animals, and entered the sacred state of Umrah. He then went on with the tradition. The Prophet moved on and when he came to the mountain, pass by which one descends (to Mecca) to them, his riding-beast knelt down, and the people said twice: Go on, go on, al-Qaswa has become jaded. The Prophet (May peace be upon him) said: She has not become jaded and that is not a characteristic of hers, but He Who restrained the elephant has restrained her. He then said: By Him in Whose hand my soul is, they will not ask any me good thing by which they honor which God has made sacred without my giving them it. He then urged her and she leaped up and he turned aside from them, and stopped at the farthest side of al-Hudaibiyyah at a pool with little water. Meanwhile Budail bin Warqa al-Khuza’I came, and ‘Urwah bin Mas’ud joined him. He began to speak to the Prophet (ﷺ). Whenever he spoke to the Prophet (ﷺ), he caught his beard. Al Mughriah bin Shu’bah was standing beside the Prophet (ﷺ).He had a sword with him, wearing a helmet. He (Al Mughriah) struck his (‘Urwah’s) hand with the lower end of his sheath, and said: Keep away your hand from his beard. ‘Urwah then raised his hand and asked: Who is this? They replied: Al-Mughirah bin Shu’bah. He said: O treacherous one! Did I not use my offices in your treachery? In pre-Islamic days Al-Mughirah bin Shu’bah accompanied some people and murdered them, and took their property. He then came (to the Prophet) and embraced Islam. The Prophet (ﷺ) said: As for Islam we accepted it, but as to the property, as it has been taken by treachery, we have no need of it. He went on with the tradition the Prophet (ﷺ) said: Write down: This is what Muhammad, the Messenger of Allah, has decided. He then narrated the tradition. Suhail then said: And that a man will not come to you from us, even if he follows your religion, without you sending him back to us. When he finished drawing up the document, the Prophet (ﷺ) said to his Companions: Get up and sacrifice and then shave. Thereafter some believing women who were immigrants came. (Allah sent down: O yea who believe, when believing women come to you as emigrants). Allah most high forbade them to send them back, but ordered them to restore the dower. He then returned to Medina. Abu Basir a man from the Quraish (who was a Muslim), came to him. And they sent (two men) to look for him; so he handed him over to the two men. They took him away, and when they reached Dhu Al Hulaifah and alighted to eat some dates which they had, Abu Basir said to one of the men : I swear by Allah so-and-so, that I think this sword of yours is a fine one; the other drew the sword and said : Yes I have tried it. Abu Basir said: Let me look at it. He let him have it and he struck him till he died, whereupon the other fled and came to Medina, and running entered the mosque. The Prophet ( may peace be upon him) said: This man has seen something frightful. He said: I swear by Allah that my Companion has been killed, and im as good as dead. Abu Basir then arrived and said: Allah has fulfilled your covenant. You returned me to them, but Allah saved me from them. The Prophet (ﷺ) said: Woe to his mother, stirrer up of war! Would that he had someone (i.e. some kinsfolk). When he heard that he knew that he would send him back to them, so he went out and came to the seashore. Abu Jandal escaped and joined Abu Basir till a band of them collected.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "2964",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا محمد بن ثور، عن معمر، عن الزهري، عن مالك بن أوس، بهذه القصة قال وهما - يعني عليا والعباس رضي الله عنهما - يختصمان فيما أفاء الله على رسوله من أموال بني النضير ‏.‏ قال أبو داود أراد أن لا يوقع عليه اسم قسم ‏.‏",
      "text_en": " Narrating this tradition Malik b. Aws said:                      They i.e 'Ali and al-'Abbas (Allah be pleased with them), were quarrelling about what Allah bestowed on His Messenger of Allah (ﷺ), that is, the property of Banu al-Nadir.Abu Dawud said: He ('Umar) intended that the name of division should not apply to it.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11013"
      ]
    },
    {
      "hadith_no": "3439",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا محمد بن ثور، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم أن يبيع حاضر لباد ‏.‏ فقلت ما يبيع حاضر لباد قال لا يكون له سمسارا ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) forbade a townsman to sell for a man from the desert. I asked: What do you mean by the selling of a townsman for a man from the desert ? He replied: He should not be a broker for him.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا محمد بن ثور، عن معمر، عن ابن خثيم، عن صفية بنت شيبة، عن أم سلمة، قالت لما نزلت ‏{‏ يدنين عليهن من جلابيبهن ‏}‏ خرج نساء الأنصار كأن على رءوسهن الغربان من الأكسية ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     When the verse \"That they should cast their outer garments over their persons\" was revealed, the women of Ansar came out as if they had crows over their heads by wearing outer garments.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "2802",
        "56"
      ]
    },
    {
      "hadith_no": "4107",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا محمد بن ثور، عن معمر، عن الزهري، وهشام بن عروة، عن عروة، عن عائشة، رضى الله عنها قالت كان يدخل على أزواج النبي صلى الله عليه وسلم مخنث فكانوا يعدونه من غير أولي الإربة فدخل علينا النبي صلى الله عليه وسلم يوما وهو عند بعض نسائه وهو ينعت امرأة فقال إنها إذا أقبلت أقبلت بأربع وإذا أدبرت أدبرت بثمان ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا أرى هذا يعلم ما ها هنا لا يدخلن عليكن هذا ‏\"‏ ‏.‏ فحجبوه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     A mukhannath (eunuch) used to enter upon the wives of Prophet (ﷺ). They (the people) counted him among those who were free of physical needs. One day the Prophet (ﷺ) entered upon us when he was with one of his wives, and was describing the qualities of a woman, saying: When she comes forward, she comes forward with four (folds in her stomach), and when she goes backward, she goes backward with eight (folds in her stomach). The Prophet (ﷺ) said: Do I not see that this (man) knows what here lies. Then they (the wives) observed veil from him.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11013",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4655",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عبيد، أن محمد بن ثور، حدثهم عن معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، قال خرج النبي صلى الله عليه وسلم زمن الحديبية فذكر الحديث ‏.‏ قال فأتاه - يعني عروة بن مسعود - فجعل يكلم النبي صلى الله عليه وسلم فكلما كلمه أخذ بلحيته والمغيرة بن شعبة قائم على رأس النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر فضرب يده بنعل السيف وقال أخر يدك عن لحيته ‏.‏ فرفع عروة رأسه فقال من هذا قالوا المغيرة بن شعبة ‏.‏",
      "text_en": " Al-Miswar b. Makhramah said :                      The prophet (ﷺ) went out during the time of (treaty of) al-Hudaibiyyah. He then mentioned the rest of the tradition. He said : ‘Urwah b. Mas’ud then came to him and began to speak to the Prophet (ﷺ). Whenever he talk to him, he caught his beard ; and al-Mughirah b. Shu’bah was standing near the head of the Prophet (ﷺ) with a sword with him and a helmet on him. He then struck his hand with the handle of the sword, saying : Keep away your hand from his beard. ‘Urwah then raised his head and said : Who is this ? The prophet said : Al-Mughirah b. Shu’bah.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "4683",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا محمد بن ثور، عن معمر، قال وأخبرني الزهري، عن عامر بن سعد بن أبي وقاص، عن أبيه، قال أعطى رسول الله صلى الله عليه وسلم رجالا ولم يعط رجلا منهم شيئا فقال سعد يا رسول الله أعطيت فلانا وفلانا ولم تعط فلانا شيئا وهو مؤمن ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أو مسلم ‏\"‏ ‏.‏ حتى أعادها سعد ثلاثا والنبي صلى الله عليه وسلم يقول ‏\"‏ أو مسلم ‏\"‏ ‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ إني أعطي رجالا وأدع من هو أحب إلى منهم لا أعطيه شيئا مخافة أن يكبوا في النار على وجوههم ‏\"‏ ‏.‏",
      "text_en": " Sa’d b. Abi Waqqas said :                      The Prophet (May peace be upon him) gave some people and did not give anything to a man of them. Sa’d said : Messenger of Allah! You gave so and so, so and so, but did not give anything to so and so while he is a believer. The Prophet (May peace be upon him) said : Or he is a Muslim. Sa’d repeated it thrice and the Prophet (May peace be upon him) then said : I give some people and leave him who is dearer to me than them. I do not give him anything fearing lest he should fall into Hell on his face.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "2035",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا محمد، - وهو ابن ثور - عن معمر، عن الزهري، عن سعيد بن المسيب، عن أبيه، قال ‏:‏ لما حضرت أبا طالب الوفاة دخل عليه النبي صلى الله عليه وسلم وعنده أبو جهل وعبد الله بن أبي أمية فقال ‏:‏ ‏\"‏ أى عم قل لا إله إلا الله كلمة أحاج لك بها عند الله عز وجل ‏\"‏ ‏.‏ فقال له أبو جهل وعبد الله بن أبي أمية ‏:‏ يا أبا طالب أترغب عن ملة عبد المطلب ‏.‏ فلم يزالا يكلمانه حتى كان آخر شىء كلمهم به على ملة عبد المطلب ‏.‏ فقال له النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ لأستغفرن لك ما لم أنه عنك ‏\"‏ ‏.‏ فنزلت ‏{‏ ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ‏}‏ ونزلت ‏{‏ إنك لا تهدي من أحببت ‏}‏ ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Al-Musayyab that his father said:                     \"When Abu Talib was dying, the Prophet came to him and found Abu Jahl and 'Abdullah bin  Abi Umayyah with him. He said: 'O uncle, say La ilaha illallah(there is none worthy of worship except Allah), a word with which I will defend you before Allah.' Abu Jahl and 'Abdullah bin Abi Umayyah said: 'O Abu Talib, are you turning away from the religion of 'Abdul-Muttalib.' Then the Prophet said: 'I will keep on asking for Allah's forgiveness for you unless I am forbidden to do so.' Then the following was revealed: It is not (proper) for the Prophet and those who believe to ask Allah's forgiveness for the idolaters. And the following was revealed: Verily, you (O Muhammad) guide not whom you like.\"",
      "chain": [
        "30449",
        "28500",
        "20115",
        "11013",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "2771",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا محمد بن ثور، عن معمر، عن الزهري، عن عروة، عن المسور بن مخرمة، قال خرج رسول الله صلى الله عليه وسلم ح وأنبأنا يعقوب بن إبراهيم قال حدثنا يحيى بن سعيد قال حدثنا عبد الله بن المبارك قال حدثنا معمر عن الزهري عن عروة عن المسور بن مخرمة ومروان بن الحكم قالا خرج رسول الله صلى الله عليه وسلم زمن الحديبية في بضع عشرة مائة من أصحابه حتى إذا كانوا بذي الحليفة قلد الهدى وأشعر وأحرم بالعمرة ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Al-Miswar bin Makhramah and Marwan bin Al-Hakam said:                     \"The Messenger of Allah went out during the time of Al-Hudabiyah with between one-thousand and three-hundred, and one-thousand and five-hundred of his Companions. Then, when they were in Dhul-Hulaifah, he garlanded and marked the Hadi and began the Talbiyah for 'Umrah (Abridged).",
      "chain": [
        "30449",
        "28500",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "3426",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن عبد الأعلى، قال حدثنا محمد، - وهو ابن ثور - عن معمر، عن الزهري، عن عبد الرحمن بن كعب بن مالك، عن أبيه، قال في حديثه إذا رسول من النبي صلى الله عليه وسلم قد أتاني فقال اعتزل امرأتك ‏.‏ فقلت أطلقها قال لا ولكن لا تقربها ‏.‏ ولم يذكر فيه الحقي بأهلك ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Ka'b bin Malik that his father said:                      \"The envoy of the Messenger of Allah came to me and said: 'Keep away from your wife.' I said: 'Should I divorce her?' He said: 'No, but do not approach her.'\" And he (the narrator) did not mention (the words): \"Go to your family.\"",
      "chain": [
        "30449",
        "28500",
        "20115",
        "11013",
        "1134",
        "390"
      ]
    },
    {
      "hadith_no": "3440",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا محمد بن ثور، عن معمر، عن الزهري، عن عروة، عن عائشة، قالت لما نزلت ‏{‏ إن كنتن تردن الله ورسوله ‏}‏ دخل على النبي صلى الله عليه وسلم بدأ بي فقال ‏\"‏ يا عائشة إني ذاكر لك أمرا فلا عليك أن لا تعجلي حتى تستأمري أبويك ‏\"‏ ‏.‏ قالت قد علم والله أن أبوى لم يكونا ليأمراني بفراقه فقرأ على ‏{‏ يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها ‏}‏ فقلت أفي هذا أستأمر أبوى فإني أريد الله ورسوله ‏.‏ قال أبو عبد الرحمن هذا خطأ والأول أولى بالصواب والله سبحانه وتعالى أعلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"When the following was revealed: 'But if you desire Allah and His Messenger,' the Prophet came and started with me. He said: 'O 'Aishah, I am going to say something to you and you do not have to rush (to make a decision) until you consult your parents.'\" She said: \"He knew, by Allah, that my parents would never tell me to leave him. Then he recited to me: 'O Prophet! Say to your wives: If you desire the life of this world, and its glitter.'\" \"I said: 'Do I need to consult my parents concerning this? I desire Allah and His Messenger.'\"",
      "chain": [
        "30449",
        "28500",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4992",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا محمد، - وهو ابن ثور - قال معمر وأخبرني الزهري، عن عامر بن سعد بن أبي وقاص، عن أبيه، قال أعطى النبي صلى الله عليه وسلم رجالا ولم يعط رجلا منهم شيئا قال سعد يا رسول الله أعطيت فلانا وفلانا ولم تعط فلانا شيئا وهو مؤمن ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أو مسلم ‏\"‏ ‏.‏ حتى أعادها سعد ثلاثا والنبي صلى الله عليه وسلم يقول ‏\"‏ أو مسلم ‏\"‏ ‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ إني لأعطي رجالا وأدع من هو أحب إلى منهم لا أعطيه شيئا مخافة أن يكبوا في النار على وجوههم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amir bin Sa'd bin Abi Waqqas that his father said:                     \"The Prophet [SAW] gave a share (of some spoils of war) to some men and not to others. Sa'd said: 'O Messenger of Allah [SAW], you gave to so-and-so and so-and-so, but you did not give anything to so-and-so, and he is a believer.' The Prophet [SAW] said: 'Or a Muslim,' until Sa'd had repeated it three times, and the Prophet [SAW] said: 'I give to some men, and leave those who are dearer to me, without giving them anything, lest (the former) be thrown into Hell on their faces.'\"",
      "chain": [
        "30449",
        "28500",
        "20115",
        "11013",
        "10554",
        "9"
      ]
    }
  ],
  "total_hadiths": 12
}