{
  "id": "28564",
  "name": "Mus'ab bin Thabit bin 'Abdullah مصعب بن ثابت بن عبد الله بن الزبير",
  "full_name": "Mus'ab bin Thabit bin 'Abdullah مصعب بن ثابت بن عبد الله بن الزبير",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "157",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  ق  -  لين الحديث ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "13769",
      "name": "Thabit bin 'Abdullah bin al-Zubair ثابت بن عبد الله بن الزبير",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13769",
      "name": "Thabit bin 'Abdullah bin al-Zubair ثابت بن عبد الله بن الزبير",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "669",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن مصعب بن ثابت بن عبد الله بن الزبير، عن محمد بن مسلم بن السائب، صاحب المقصورة قال صليت إلى جنب أنس بن مالك يوما فقال هل تدري لم صنع هذا العود فقلت لا والله ‏.‏ قال كان رسول الله صلى الله عليه وسلم يضع يده عليه فيقول ‏\"‏ استووا وعدلوا صفوفكم ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Muslim b. al-Sa’ib said:                      one day I prayed by the side of Anas b. Malik. He said ; Do you know why this stick is placed here ? I said : No, by Allah. He said; The Messenger of Allah (ﷺ) used to put his hand upon it and say: Keep straight and straighten your rows.",
      "chain": [
        "30367",
        "20159",
        "28564",
        "167"
      ]
    },
    {
      "hadith_no": "670",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حميد بن الأسود، حدثنا مصعب بن ثابت، عن محمد بن مسلم، عن أنس، بهذا الحديث قال إن رسول الله صلى الله عليه وسلم كان إذا قام إلى الصلاة أخذه بيمينه ثم التفت فقال ‏\"‏ اعتدلوا سووا صفوفكم ‏\"‏ ‏.‏ ثم أخذه بيساره فقال ‏\"‏ اعتدلوا سووا صفوفكم ‏\"‏ ‏.‏",
      "text_en": " This tradition has also ben transmitted by Anas through a different chain of transmitters. This version goes:                      when the Messenger of Allah (ﷺ) stood for prayer, he took it (the stick) in his right hand and turning (to the right side) said; keep straight and straighten your rows. He then took it in his left hand and said; keep straight and straighten your rows.",
      "chain": [
        "30175",
        "20225",
        "28564",
        "167",
        "19"
      ]
    },
    {
      "hadith_no": "1411",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عثمان الدمشقي أبو الجماهر، حدثنا عبد العزيز، - يعني ابن محمد - عن مصعب بن ثابت بن عبد الله بن الزبير، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قرأ عام الفتح سجدة فسجد الناس كلهم منهم الراكب والساجد في الأرض حتى إن الراكب ليسجد على يده ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     In the year of Conquest the Messenger of Allah (ﷺ) recited a verse at which a prostration should be made and all the people prostrated themselves. Some were mounted, and some were prostrating themselves on the ground, and those who were mounted prostrated themselves on their hands.",
      "chain": [
        "38550",
        "20167",
        "28564",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3588",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد الله بن المبارك، حدثنا مصعب بن ثابت، عن عبد الله بن الزبير، قال قضى رسول الله صلى الله عليه وسلم أن الخصمين يقعدان بين يدى الحكم ‏.‏",
      "text_en": " Narrated Abdullah ibn az-Zubayr:                     The Messenger of Allah (ﷺ) gave the decision that the two adversaries should be made to sit in front of the judge.",
      "chain": [
        "30242",
        "20025",
        "28564",
        "106"
      ]
    },
    {
      "hadith_no": "4410",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن عبد الله بن عبيد بن عقيل الهلالي، حدثنا جدي، عن مصعب بن ثابت بن عبد الله بن الزبير، عن محمد بن المنكدر، عن جابر بن عبد الله، قال جيء بسارق إلى النبي صلى الله عليه وسلم فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ فقال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ قال فقطع ثم جيء به الثانية فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ فقال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ قال فقطع ثم جيء به الثالثة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ قال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ ثم أتي به الرابعة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ قال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ فأتي به الخامسة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ قال جابر فانطلقنا به فقتلناه ثم اجتررناه فألقيناه في بئر ورمينا عليه الحجارة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     A thief was brought to the Prophet (ﷺ).  He said: Kill him.  The people said: He has committed theft, Messenger of Allah!  Then he said: Cut off his hand. So his (right) hand was cut off.  He was brought a second time and he said: Kill him.  The people said: He has committed theft, Messenger of Allah!  Then he said: Cut off his foot. So his (left) foot was cut off. He was brought a third time and he said: Kill him.  The people said: He has committed theft, Messenger of Allah!  So he said: Cut off his hand. (So his (left) hand was cut off.) He was brought a fourth time and he said: Kill him.  The people said: He has committed theft, Messenger of Allah!  So he said: Cut off his foot. So his (right) foot was cut off. He was brought a fifth time and he said: Kill him. So we took him away and killed him. We then dragged him and cast him into a well and threw stones over him.",
      "chain": [
        "34214",
        "28564",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4978",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبيد بن عقيل، قال حدثنا جدي، قال حدثنا مصعب بن ثابت، عن محمد بن المنكدر، عن جابر بن عبد الله، قال جيء بسارق إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ قال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ فقطع ثم جيء به الثانية فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ قال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ فقطع فأتي به الثالثة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ قالوا يا رسول الله إنما سرق ‏.‏ فقال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ ثم أتي به الرابعة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ قالوا يا رسول الله إنما سرق ‏.‏ قال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ فأتي به الخامسة قال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ قال جابر فانطلقنا به إلى مربد النعم وحملناه فاستلقى على ظهره ثم كشر بيديه ورجليه فانصدعت الإبل ثم حملوا عليه الثانية ففعل مثل ذلك ثم حملوا عليه الثالثة فرميناه بالحجارة فقتلناه ثم ألقيناه في بئر ثم رمينا عليه بالحجارة ‏.‏ قال أبو عبد الرحمن وهذا حديث منكر ومصعب بن ثابت ليس بالقوي في الحديث والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"A thief was brought to the Messenger of Allah and he said: 'Kill him.' They said: 'O Messenger of Allah, he only stole.' He said: 'Cut off (his hand).' So his hand was cut off. Then he was brought a second time and he said: 'Kill him.' They said; 'O Messenger of Allah, he only stole.' He said: 'Cut off (his foot).' So his foot was cut off. He was brought to him a third time and he said: 'Kill him.' They said: 'O Messenger of Allah, he only stole. He said: 'Cut off (his other hand).' Then he was brought to him a fourth time and he said: Kill him.' They said: 'O Messenger of Allah, he only stole.' He said: 'Cut off (his other foot).' He was brought to him a fifth time and he said: \"So we took him to an animal pen and attacked him. He lay down on his back then waved his arms and legs (in the air), and the camels ran away. Then they attacked him a second time and he did the same thing, then they attacked him a third time, and we threw stones at him and killed him, then we threw him into a well and threw stones on top of him.\" (Hasan)Abu 'Abdur-Rahman (An-Nasai) said: This Hadith is Munkar, Musab bin Thabit is not strong in Hadith.",
      "chain": [
        "34214",
        "28564",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "968",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا بشر بن السري، عن مصعب بن ثابت بن عبد الله بن الزبير، عن إسماعيل بن محمد بن سعد بن أبي وقاص، عن عامر بن سعد، عن أبيه، أن رسول الله  صلى الله عليه وسلم  كان يسلم عن يمينه وعن يساره ‏.‏",
      "text_en": " It wasnarrated from ‘Amir bin Sa’d, from his father, that theMessengerof Allah (ﷺ) used to say the Salam to his right and to hisleft.",
      "chain": [
        "30277",
        "20190",
        "28564",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1819",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سعيد بن يحيى اللخمي، حدثنا محمد بن عمرو، عن مصعب بن ثابت، عن عبد الله بن الزبير، قال أفطر رسول الله  صلى الله عليه وسلم  عند سعد بن معاذ فقال ‏\"‏ أفطر عندكم الصائمون وأكل طعامكم الأبرار وصلت عليكم الملائكة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Zubair said:                      “The Messenger ofAllah(ﷺ) broke his fast with Sa’d bin Mu’adh and said: ‘Aftara‘indakumus-saimun, wa akala ta’amakumul-abrar, wa sallat‘alaikumul-mala’ikah (May fasting people break their fast withyou, may therighteous eat your food, and may the angels sendblessing upon you).”",
      "chain": [
        "30288",
        "30254",
        "11220",
        "28564",
        "106"
      ]
    },
    {
      "hadith_no": "2871",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن مصعب بن ثابت، عن عبد الله بن الزبير، قال خطب عثمان بن عفان الناس فقال يا أيها الناس إني سمعت حديثا من رسول الله صلى الله عليه وسلم لم يمنعني أن أحدثكم به إلا الضن بكم وبصحابتكم فليختر مختار لنفسه أو ليدع سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رابط ليلة في سبيل الله سبحانه كانت كألف ليلة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Zubair said:                      “Uthman bin ‘Affanaddressed the people and said: ‘O people! I heard a Hadith from theMessenger of Allah (ﷺ) and nothing kept me from narrating it to youexcept for the fact that I did not want to lose you and yourcompanionship. So it is up to you. I heard the Messenger of Allah(ﷺ) saying: “Whoever spends a night guarding the frontier in thecause of Allah, it will be like a thousand nights spent in fastingandprayer.”",
      "chain": [
        "30288",
        "28327",
        "11163",
        "28564",
        "106"
      ]
    }
  ],
  "total_hadiths": 9
}