{
  "id": "28603",
  "name": "al-Nadr bin Muhammad النضر بن محمد",
  "full_name": "al-Nadr bin Muhammad النضر بن محمد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "183",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ل  س  -  صدوق ]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19144",
      "name": "Yahya bin Abi Hiyya يحيى بن أبي حية",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30362",
      "name": "'Ali bin al-Hasan bin Shaqayq علي بن الحسن بن شقيق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38480",
      "name": "Muhammad bin A'yn Abu محمد بن أعين أبو الوزير المروزي خادم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38584",
      "name": "Muhammad bin Mazahim al-'Amiri محمد بن مزاحم العامري",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4235",
      "hadith_no": "4235",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني شجاع بن الوليد، سمع النضر بن محمد، حدثنا صخر، عن نافع، قال إن الناس يتحدثون أن ابن عمر، أسلم قبل عمر، وليس كذلك، ولكن عمر يوم الحديبية أرسل عبد الله إلى فرس له عند رجل من الأنصار يأتي به ليقاتل عليه، ورسول الله صلى الله عليه وسلم يبايع عند الشجرة، وعمر لا يدري بذلك، فبايعه عبد الله، ثم ذهب إلى الفرس، فجاء به إلى عمر، وعمر يستلئم للقتال، فأخبره أن رسول الله صلى الله عليه وسلم يبايع تحت الشجرة  قال  فانطلق فذهب معه حتى بايع رسول الله صلى الله عليه وسلم، فهي التي يتحدث الناس أن ابن عمر أسلم قبل عمر‏.‏",
      "text_en": " Narrated Nafi`:                     The people used to say that Ibn `Umar had embraced Islam before `Umar. This is not true. What happened is that `Umar sent `Abdullah to bring his horse from an Ansari man so as to fight on it. At that time the people were giving the Pledge of allegiance to Allah's Apostle near the Tree, and `Umar was not aware of that. So `Abdullah (bin `Umar) gave the Pledge of Allegiance (to the Prophet) and went to take the horse and brought it to `Umar. While `Umar was putting on the armor to get ready for fighting, `Abdullah informed him that the people were giving the Pledge of allegiance to Allah's Apostle beneath the Tree. So `Umar set out and `Abdullah accompanied him till he gave the Pledge of allegiance to Allah's Apostle, and it was this event that made people say that Ibn `Umar had embraced Islam before `Umar. \"Abdullah bin `Umar added, \"The people were along with the Prophet on the day of Al-Hudaibiya spreading in the shade of the trees. Suddenly the people surrounded the Prophet and started looking at him.\" `Umar said, \"O `Abdullah! Go and see why the people are encircling Allah's Apostle and looking at him.\" `Abdullah bin `Umar then saw the people giving the Pledge o allegiance to the Prophet. So he also gave the Pledge of allegiance and returned to `Umar who went out in his turn and gave the Pledge of allegiance to the Prophet.'",
      "usc_msa_ref": "500",
      "chain": [
        "20328",
        "28603",
        "11014"
      ]
    },
    {
      "id": "sahih-muslim-243",
      "hadith_no": "243",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عباس بن عبد العظيم العنبري، حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا أبو زميل، قال حدثني ابن عباس، قال مطر الناس على عهد النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أصبح من الناس شاكر ومنهم كافر قالوا هذه رحمة الله ‏.‏ وقال بعضهم لقد صدق نوء كذا وكذا ‏\"‏ ‏.‏ قال فنزلت هذه الآية ‏{‏ فلا أقسم بمواقع النجوم‏}‏ حتى بلغ ‏{‏ وتجعلون رزقكم أنكم تكذبون‏{‏",
      "text_en": " It is reported on the authority of Ibn 'Abbas that there was (once) a downpour during the life of the Apostle (may peace and blessings be upon him Upon this the Apostle (may peace and blessings be upon him) observed:                      Some people entered the morning with gratitude and some with ingratitude (to Allah). Those who entered with gratitude said: This is the blessing of Allah, and those who entered with ingratitude said: Such and such asterism was right. It was upon this that the verse was revealed: I swear by the setting of the stars to the end and make your provision that you should disbelieve it.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "28603",
        "10704",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-366",
      "hadith_no": "366",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبد الله بن الرومي، حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا يحيى، حدثنا أبو سلمة، عن أبي هريرة، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ لا يزالون يسألونك يا أبا هريرة حتى يقولوا هذا الله فمن خلق الله ‏\"‏ قال فبينا أنا في المسجد إذ جاءني ناس من الأعراب فقالوا يا أبا هريرة هذا الله فمن خلق الله قال فأخذ حصى بكفه فرماهم ثم قال قوموا قوموا صدق خليلي ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said to me: they (the people) till constantly ask you, Abu Huraira, (about different things pertaining to religion) the they would say: Well, there is Allah, but after all who created Allah? He (Abu Huraira) narrated: Once we were in the mosque that some of the Bedouins came there and said: Well, there is Allah, but who created Allah? He (the narrator) said: I took hold of the pebbles in my fist and flung at them and remarked: Stand up, stand up (go away) my friend (the Holy Prophet) told the truth.",
      "usc_msa_ref": "",
      "chain": [
        "28603",
        "10704",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-395-4",
      "hadith_no": "395",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أحمد بن جعفر المعقري، حدثنا النضر بن محمد، حدثنا أبو أويس، أخبرني العلاء، قال سمعت من أبي ومن أبي السائب، وكانا، جليسى أبي هريرة قالا قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاة لم يقرأ فيها بفاتحة الكتاب فهى خداج ‏\"‏ ‏.‏ يقولها ثلاثا بمثل حديثهم ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who said his prayer, but did not recite the opening chapter of al-Kitab, his prayer is incomplete. He repeated it thrice.",
      "usc_msa_ref": "",
      "chain": [
        "30414",
        "28603",
        "20506",
        "10606",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1967",
      "hadith_no": "1967",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني أحمد بن جعفر المعقري، حدثنا النضر بن محمد، حدثنا عكرمة بن عمار، حدثنا شداد بن عبد الله أبو عمار، ويحيى بن أبي كثير، عن أبي أمامة، - قال عكرمة ولقي شداد أبا أمامة وواثلة وصحب أنسا إلى الشام وأثنى عليه فضلا وخيرا - عن أبي أمامة قال قال عمرو بن عبسة السلمي كنت وأنا في الجاهلية أظن أن الناس على ضلالة وأنهم ليسوا على شىء وهم يعبدون الأوثان فسمعت برجل بمكة يخبر أخبارا فقعدت على راحلتي فقدمت عليه فإذا رسول الله صلى الله عليه وسلم مستخفيا جرءاء عليه قومه فتلطفت حتى دخلت عليه بمكة فقلت له ما أنت قال ‏\"‏ أنا نبي ‏\"‏ ‏.‏ فقلت وما نبي قال ‏\"‏ أرسلني الله ‏\"‏ ‏.‏ فقلت وبأى شىء أرسلك قال ‏\"‏ أرسلني بصلة الأرحام وكسر الأوثان وأن يوحد الله لا يشرك به شىء ‏\"‏ ‏.‏ قلت له فمن معك على هذا قال ‏\"‏ حر وعبد ‏\"‏ ‏.‏ قال ومعه يومئذ أبو بكر وبلال ممن آمن به ‏.‏ فقلت إني متبعك ‏.‏ قال ‏\"‏ إنك لا تستطيع ذلك يومك هذا ألا ترى حالي وحال الناس ولكن ارجع إلى أهلك فإذا سمعت بي قد ظهرت فأتني ‏\"‏ ‏.‏ قال فذهبت إلى أهلي وقدم رسول الله صلى الله عليه وسلم المدينة وكنت في أهلي فجعلت أتخبر الأخبار وأسأل الناس حين قدم المدينة حتى قدم على نفر من أهل يثرب من أهل المدينة فقلت ما فعل هذا الرجل الذي قدم المدينة فقالوا الناس إليه سراع وقد أراد قومه قتله فلم يستطيعوا ذلك ‏.‏ فقدمت المدينة فدخلت عليه فقلت يا رسول الله أتعرفني قال ‏\"‏ نعم أنت الذي لقيتني بمكة ‏\"‏ ‏.‏ قال فقلت بلى ‏.‏ فقلت يا نبي الله أخبرني عما علمك الله وأجهله ‏.‏ أخبرني عن الصلاة قال ‏\"‏ صل صلاة الصبح ثم أقصر عن الصلاة حتى تطلع الشمس حتى ترتفع فإنها تطلع حين تطلع بين قرنى شيطان وحينئذ يسجد لها الكفار ثم صل فإن الصلاة مشهودة محضورة حتى يستقل الظل بالرمح ثم أقصر عن الصلاة فإن حينئذ تسجر جهنم فإذا أقبل الفىء فصل فإن الصلاة مشهودة محضورة حتى تصلي العصر ثم أقصر عن الصلاة حتى تغرب الشمس فإنها تغرب بين قرنى شيطان وحينئذ يسجد لها الكفار ‏\"‏ ‏.‏ قال فقلت يا نبي الله فالوضوء حدثني عنه قال ‏\"‏ ما منكم رجل يقرب وضوءه فيتمضمض ويستنشق فينتثر إلا خرت خطايا وجهه وفيه وخياشيمه ثم إذا غسل وجهه كما أمره الله إلا خرت خطايا وجهه من أطراف لحيته مع الماء ثم يغسل يديه إلى المرفقين إلا خرت خطايا يديه من أنامله مع الماء ثم يمسح رأسه إلا خرت خطايا رأسه من أطراف شعره مع الماء ثم يغسل قدميه إلى الكعبين إلا خرت خطايا رجليه من أنامله مع الماء فإن هو قام فصلى فحمد الله وأثنى عليه ومجده بالذي هو له أهل وفرغ قلبه لله إلا انصرف من خطيئته كهيئته يوم ولدته أمه ‏\"‏ ‏.‏ فحدث عمرو بن عبسة بهذا الحديث أبا أمامة صاحب رسول الله صلى الله عليه وسلم فقال له أبو أمامة يا عمرو بن عبسة انظر ما تقول في مقام واحد يعطى هذا الرجل فقال عمرو يا أبا أمامة لقد كبرت سني ورق عظمي واقترب أجلي وما بي حاجة أن أكذب على الله ولا على رسول الله لو لم أسمعه من رسول الله صلى الله عليه وسلم إلا مرة أو مرتين أو ثلاثا - حتى عد سبع مرات - ما حدثت به أبدا ولكني سمعته أكثر من ذلك ‏.‏",
      "text_en": " 'A'isha reported that 'Umar misconstrued the fact that the Messenger of Allah (may peace be upon him) had prohibited the observance of prayer at the time of the rising sun and at the time of its setting.",
      "usc_msa_ref": "",
      "chain": [
        "30414",
        "28603",
        "10704",
        "11449",
        "405",
        "405"
      ]
    },
    {
      "id": "sahih-muslim-2787",
      "hadith_no": "2787",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبد الله بن محمد الرومي، حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا يحيى، قال انطلقت أنا وعبد الله بن يزيد، حتى نأتي أبا سلمة فأرسلنا إليه رسولا فخرج علينا وإذا عند باب داره مسجد - قال - فكنا في المسجد حتى خرج إلينا ‏.‏ فقال إن تشاءوا أن تدخلوا وإن تشاءوا أن تقعدوا ها هنا ‏.‏ - قال - فقلنا لا بل نقعد ها هنا فحدثنا ‏.‏ قال حدثني عبد الله بن عمرو بن العاص - رضى الله عنهما - قال كنت أصوم الدهر وأقرأ القرآن كل ليلة - قال - فإما ذكرت للنبي صلى الله عليه وسلم وإما أرسل إلى فأتيته فقال لي ‏\"‏ ألم أخبر أنك تصوم الدهر وتقرأ القرآن كل ليلة ‏\"‏ ‏.‏ قلت بلى يا نبي الله ولم أرد بذلك إلا الخير ‏.‏ قال ‏\"‏ فإن بحسبك أن تصوم من كل شهر ثلاثة أيام ‏\"‏ ‏.‏ قلت يا نبي الله إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ فإن لزوجك عليك حقا ولزورك عليك حقا ولجسدك عليك حقا - قال - فصم صوم داود نبي الله صلى الله عليه وسلم فإنه كان أعبد الناس ‏\"‏ ‏.‏ قال قلت يا نبي الله وما صوم داود قال ‏\"‏ كان يصوم يوما ويفطر يوما ‏\"‏ ‏.‏ قال ‏\"‏ واقرإ القرآن في كل شهر ‏\"‏ ‏.‏ قال قلت يا نبي الله إني أطيق أفضل من ذلك قال ‏\"‏ فاقرأه في كل عشرين ‏\"‏ ‏.‏ قال قلت يا نبي الله إني أطيق أفضل من ذلك قال ‏\"‏ فاقرأه في كل عشر ‏\"‏ ‏.‏ قال قلت يا نبي الله إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ فاقرأه في كل سبع ولا تزد على ذلك ‏.‏ فإن لزوجك عليك حقا ولزورك عليك حقا ولجسدك عليك حقا ‏\"‏ ‏.‏ قال فشددت فشدد على ‏.‏ قال وقال لي النبي صلى الله عليه وسلم ‏\"‏ إنك لا تدري لعلك يطول بك عمر ‏\"‏ ‏.‏ قال فصرت إلى الذي قال لي النبي صلى الله عليه وسلم فلما كبرت وددت أني كنت قبلت رخصة نبي الله صلى الله عليه وسلم ‏.‏",
      "text_en": "  Yahya reported:                      I and 'Abdullah b. Yazid set out till we came to Abu Salama. We sent a messenger to him (in his house in order to inform him about our arrival) and he came to us. There was a mosque near the door of his house, and we were in that mosque, till he came out to us. He said: If you like you may enter (the house) and, if you like, you may sit here (in the mosque). We said: We would rather sit here and (you) relate to us. He (Yahya) then narrated that 'Abdullah b Amr b. al-'As (Allah be pleased with them) told him: I used to observe fast uninterruptedly and recited the (whole of the) Qur'an every night. It (the uninterrupted fasting and recital of the Qur'an every night) was mentioned to the Apostle of Allah (may peace be upon him) or he sent for me, and I went to him and he said to me: I have been informed that you fast continuously and recite (the whole of the Qur'an) every night. I said: Apostle of Allah, it is right, but I covet thereby nothing but good, whereupon he said: It suffices for you that you should observe fast for three days during every mouth. I said: Apostle of Allah, I am capable of doing more than this. He said: Your wife has a right upon you, your visitor has a right upon you, your body has a right upon you; so observe the fast of David, the Apostle of Allah (peace be upon him), for he was the best worshipper of Allah. I said: Apostle of Allah, what is the fast of David? He said: He used to fast one day and did not fast the other day. He (also) said: Recite the Qur'an during every month. I said: Apostle of Allah, I am capable of doing more than this, whereupon he said: Recite it in twenty days; recite it in ten days. I said: I am capable of doing more than this, whereupon he said: Recite it every week, and do not exceed beyond this, for your wife has a right upon you, your visitor has a right upon you, your body has a right upon you. He ('Amr b. 'As) said: I was hard to myself and thus I was put to hardship. The Apostle of Allah (may peace be upon him) had told me: 'You do not know you may live long (thus and bear the hardships for a long time), and I accepted that which the Apostle of Allah (may peace be upon him) had told me. When I grew old I wished I had availed myself of the concession (granted by) the Apostle of Allah (may-peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "28603",
        "10704",
        "11449"
      ]
    },
    {
      "id": "sahih-muslim-4780",
      "hadith_no": "4780",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "قال إبراهيم حدثنا محمد بن يحيى، حدثنا عبد الصمد بن عبد الوارث، عن عكرمة، بن عمار بهذا الحديث بطوله ‏.‏ وحدثنا أحمد بن يوسف الأزدي السلمي، حدثنا النضر بن محمد، عن عكرمة بن، عمار بهذا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Ikrama b. Ammar.",
      "usc_msa_ref": "",
      "chain": [
        "20150",
        "11222",
        "20250",
        "10704",
        "30535",
        "28603"
      ]
    },
    {
      "id": "sahih-muslim-6276",
      "hadith_no": "6276",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن الرومي اليمامي، وعباس بن عبد العظيم العنبري، وأحمد بن، جعفر المعقري قالوا حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا  أبو النجاشي، حدثني رافع بن خديج، قال قدم نبي الله صلى الله عليه وسلم المدينة وهم يأبرون النخل يقولون يلقحون النخل فقال ‏\"‏ ما تصنعون ‏\"‏ ‏.‏ قالوا كنا نصنعه قال ‏\"‏ لعلكم لو لم تفعلوا كان خيرا ‏\"‏ ‏.‏ فتركوه فنفضت أو فنقصت - قال - فذكروا ذلك له فقال ‏\"‏ إنما أنا بشر إذا أمرتكم بشىء من دينكم فخذوا به وإذا أمرتكم بشىء من رأى فإنما أنا بشر ‏\"‏ ‏.‏ قال عكرمة أو نحو هذا ‏.‏ قال المعقري فنفضت ‏.‏ ولم يشك ‏.‏",
      "text_en": " Rafi' b. Khadij reported that Allah's Messenger (may peace be upon him) came to Medina and the people had been grafting the trees. He said:                      What are you doing? They said: We are grafting them, whereupon he said: It may perhaps be good for you if you do not do that, so they abandoned this practice (and the date-palms) began to yield less fruit. They made a mention of it (to the Holy Prophet), whereupon he said: I am a human being, so when I command you about a thing pertaining to religion, do accept it, and when I command you about a thing out of my personal opinion, keep it in mind that I am a human being. 'Ikrima reported that he said something like this.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30414",
        "28603",
        "10704",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-6413",
      "hadith_no": "6413",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عبد الله بن الرومي اليمامي، وعباس بن عبد العظيم العنبري، قالا حدثنا  النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا إياس، عن أبيه، قال لقد قدت بنبي الله صلى الله عليه وسلم والحسن والحسين بغلته الشهباء حتى أدخلتهم حجرة النبي صلى الله عليه وسلم هذا قدامه وهذا خلفه ‏.‏",
      "text_en": " Iyas reported on the authority of his father:                      I (had the honour of) leading the white mule on which rode Allah's Apostle (may peace be upon him) and with him were Hasan and Husain, till it reached the apartment of Allah's Apostle (may peace be upon him). The one amongst them was seated before him and the other one was seated behind him.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "28603",
        "10704"
      ]
    },
    {
      "id": "sunan-abi-daud-5110",
      "hadith_no": "5110",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عباس بن عبد العظيم، حدثنا النضر بن محمد، حدثنا عكرمة، - يعني ابن عمار - قال حدثنا أبو زميل، قال سألت ابن عباس فقلت ما شىء أجده في صدري قال ما هو قلت والله ما أتكلم به ‏.‏ قال فقال لي أشىء من شك قال وضحك ‏.‏ قال ما نجا من ذلك أحد - قال - حتى أنزل الله عز وجل ‏{‏ فإن كنت في شك مما أنزلنا إليك فاسأل الذين يقرءون الكتاب من قبلك ‏}‏ الآية قال فقال لي إذا وجدت في نفسك شيئا فقل ‏{‏ هو الأول والآخر والظاهر والباطن وهو بكل شىء عليم ‏}‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     AbuZumayl said: I asked Ibn Abbas, saying: What is that I find in my breast? He asked: What is it? I replied: I swear by Allah, I cannot speak about it. He asked me: Is it something doubtful? and he laughed. He then said: No one could escape that, until Allah, the exalted, revealed: \"If thou went in doubt as to what we have revealed unto thee, and ask those who have been reading the Book from before thee.\" He said: If you find something in your heart, say: He is the first and the Last, the Evident and the Immanent, and He has full knowledge of all things.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "28603",
        "10704"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2083",
      "hadith_no": "2083",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عباس بن عبد العظيم العنبري، حدثنا النضر بن محمد الجرشي اليمامي، حدثنا عكرمة بن عمار، حدثنا أبو زميل، عن مالك بن مرثد، عن أبيه، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تبسمك في وجه أخيك لك صدقة وأمرك بالمعروف ونهيك عن المنكر صدقة وإرشادك الرجل في أرض الضلال لك صدقة وبصرك للرجل الرديء البصر لك صدقة وإماطتك الحجر والشوكة والعظم عن الطريق لك صدقة وإفراغك من دلوك في دلو أخيك لك صدقة ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وجابر وحذيفة وعائشة وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو زميل اسمه سماك بن الوليد الحنفي ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah said :                     \"Your smiling in the face of your brother is charity, commanding good and forbidding evil is charity, your giving directions to a man lost in the land is charity for you. Your seeing for a man with bad sight is a charity for you, your removal of a rock, a thorn  or a bone from the road is charity for you. Your pouring what remains from your bucket into the bucket of your brother is charity for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "28603",
        "10704",
        "18966",
        "18973",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3002",
      "hadith_no": "3002",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا عباس العنبري بن عبد العظيم، حدثنا النضر بن محمد، هو الجرشي اليمامي حدثنا عكرمة بن عمار، عن إياس بن سلمة، عن أبيه، قال لقد قدت نبي الله صلى الله عليه وسلم والحسن والحسين على بغلته الشهباء حتى أدخلته حجرة النبي صلى الله عليه وسلم هذا قدامه وهذا خلفه ‏.‏ وفي الباب عن ابن عباس وعبد الله بن جعفر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Iyas bin Salamah:                     from his father who said: \"I guided Allah's Prophet (ﷺ) and Al-Hasan and Al-Husain, on his gray mule until I brought him to the apartment of the Prophet (ﷺ), this one was in front of him, and this one behind him.\"",
      "usc_msa_ref": "",
      "chain": [
        "28603",
        "10704"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4172",
      "hadith_no": "4172",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا العباس العنبري، حدثنا النضر بن محمد، حدثنا عكرمة بن عمار، حدثنا أبو زميل، هو سماك بن الوليد الحنفي عن مالك بن مرثد، عن أبيه، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أظلت الخضراء ولا أقلت الغبراء من ذي لهجة أصدق ولا أوفى من أبي ذر شبه عيسى ابن مريم عليه السلام ‏\"‏ ‏.‏ فقال عمر بن الخطاب كالحاسد يا رسول الله أفنعرف ذلك له قال ‏\"‏ نعم فاعرفوه له ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روى بعضهم هذا الحديث فقال ‏\"‏ أبو ذر يمشي في الأرض بزهد عيسى ابن مريم عليه السلام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     that the Messenger of Allah (ﷺ) said: \"There is no one more truthful in speech, nor in fulfilling of promises, that sky has covered and the earth has carried, than Abu Dharr, the likeness of 'Eisa bin Mariam.\" So 'Umar bin Al-Khattab said, as if out of envy: \"So do you acknowledge that for him, O Messenger of Allah?\" He said: \"Yes, so acknowledge it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "28603",
        "10704",
        "10771",
        "18966",
        "18973",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1665",
      "hadith_no": "1665",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن محمد المروزي، - ثقة - قال حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد الأنصاري، عن حذيفة، أنه صلى مع رسول الله صلى الله عليه وسلم في رمضان فركع فقال في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ مثل ما كان قائما ثم جلس يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ مثل ما كان قائما ثم سجد فقال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ مثل ما كان قائما فما صلى إلا أربع ركعات حتى جاء بلال إلى الغداة ‏.‏ قال أبو عبد الرحمن هذا الحديث عندي مرسل وطلحة بن يزيد لا أعلمه سمع من حذيفة شيئا وغير العلاء بن المسيب قال في هذا الحديث عن طلحة عن رجل عن حذيفة ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He prayed with the Messenger of Allah during Ramadan. He bowed and said: \"Subhana Rabbiyal-Azim while bowing, for as long as he had stood. Then he sat down and said: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me),\" for as long as he had stood. Then he prostrated and said: \"Subhana Rabbiyal-'Ala for as long as he had stood And he prayed no more than four rak'ahs when Bilal came for Al-Ghadah.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "28603",
        "11647",
        "11381",
        "11633",
        "145"
      ]
    }
  ],
  "total_hadiths": 14
}