{
  "id": "28625",
  "name": "Wahb bin Khalid al-Hmyry Abu وهب بن خالد الحميري",
  "full_name": "Wahb bin Khalid al-Hmyry Abu وهب بن خالد الحميري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Humayri",
      "al-Himsi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Hims",
        "ar": "al-Hims",
        "ckb": "al-Hims"
      }
    ],
    "tags_display": [
      {
        "en": "al-Humayri",
        "ar": "al-Humayri",
        "ckb": "al-Humayri"
      },
      {
        "en": "al-Himsi",
        "ar": "al-Himsi",
        "ckb": "al-Himsi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-4699",
      "hadith_no": "4699",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي سنان، عن وهب بن خالد الحمصي، عن ابن الديلمي، قال أتيت أبى بن كعب فقلت له وقع في نفسي شىء من القدر فحدثني بشىء لعل الله أن يذهبه من قلبي ‏.‏ فقال لو أن الله عذب أهل سمواته وأهل أرضه عذبهم وهو غير ظالم لهم ولو رحمهم كانت رحمته خيرا لهم من أعمالهم ولو أنفقت مثل أحد ذهبا في سبيل الله ما قبله الله منك حتى تؤمن بالقدر وتعلم أن ما أصابك لم يكن ليخطئك وأن ما أخطأك لم يكن ليصيبك ولو مت على غير هذا لدخلت النار ‏.‏ قال ثم أتيت عبد الله بن مسعود فقال مثل ذلك - قال - ثم أتيت حذيفة بن اليمان فقال مثل ذلك - قال - ثم أتيت زيد بن ثابت فحدثني عن النبي صلى الله عليه وسلم مثل ذلك ‏.‏",
      "text_en": " Ibn al-Dailami said :                      I went to Ubayy b. Ka’b and said him : I am confused about Divine decree, so tell me something by means of which Allah may remove the confusion from my mind. He replied : were Allah to punish everyone in the heavens and in the earth. He would do so without being unjust to them, and were he to show mercy to them his mercy would be much better than their actions merited. Were you to spend in support of Allah’s cause an amount of gold equivalent to Uhud, Allah would not accept it from you till you believed in divine decree and knew that what has come to you could not miss you and that what has missed you could not come to you. Were you to die believing anything else you would enter Hell. He said : I then went to ‘Abd Allah b. MAs’ud and he said something to the same effect. I next went to Hudhaifah b. al-Yaman and he said something to the same effect. I next went to Zaid b. Thabit who told me something from the Prophet (May peace be upon him) to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "28625",
        "5136"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5197",
      "hadith_no": "5197",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس الذهلي، حدثنا أبو عاصم، عن أبي خالد، وهب عن أبي سفيان الحمصي، عن أبي أمامة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أولى الناس بالله من بدأهم بالسلام ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: Those who are nearest to Allah are they who are first to give a salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30023",
        "20241",
        "28625",
        "11720",
        "405"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-ibn-majah-81",
      "hadith_no": "81",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا إسحاق بن سليمان، قال سمعت أبا سنان، عن وهب بن خالد الحمصي، عن ابن الديلمي، قال وقع في نفسي شىء من هذا القدر خشيت أن يفسد على ديني وأمري فأتيت أبى بن كعب فقلت أبا المنذر إنه قد وقع في قلبي شىء من هذا القدر فخشيت على ديني وأمري فحدثني من ذلك بشىء لعل الله أن ينفعني به ‏.‏ فقال لو أن الله عذب أهل سمواته وأهل أرضه لعذبهم وهو غير ظالم لهم ولو رحمهم لكانت رحمته خيرا لهم من أعمالهم ‏.‏ ولو كان لك مثل جبل أحد ذهبا أو مثل جبل أحد تنفقه في سبيل الله ما قبل منك حتى تؤمن بالقدر ‏.‏ فتعلم أن ما أصابك لم يكن ليخطئك وأن ما أخطأك لم يكن ليصيبك ‏.‏ وأنك إن مت على غير هذا دخلت النار ولا عليك أن تأتي أخي عبد الله بن مسعود فتسأله ‏.‏ فأتيت عبد الله فسألته فذكر مثل ما قال أبى وقال لي ولا عليك أن تأتي حذيفة ‏.‏ فأتيت حذيفة فسألته فقال مثل ما قالا وقال ائت زيد بن ثابت فاسأله ‏.‏ فأتيت زيد بن ثابت فسألته فقال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لو أن الله عذب أهل سمواته وأهل أرضه لعذبهم وهو غير ظالم لهم ولو رحمهم لكانت رحمته خيرا لهم من أعمالهم ولو كان لك مثل أحد ذهبا أو مثل جبل أحد ذهبا تنفقه في سبيل الله ما قبله منك حتى تؤمن بالقدر كله فتعلم أن ما أصابك لم يكن ليخطئك وما أخطأك لم يكن ليصيبك وأنك إن مت على غير هذا دخلت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Dailami said:                     \"I was confused about this Divine Decree (Qadar), and I was afraid lest that adversely affect my religion and my affairs. So I went to Ubayy bin Ka'b and said: 'O Abu Mundhir! I am confused about the Divine Decree, and I fear for my religion and my affairs, so tell me something about that through which Allah may benefit me.' He said: 'If Allah were to punish the inhabitants of His heavens and of his earth, He would do so and He would not be unjust towards them. And if He were to have mercy on them, His mercy would be better for them than their own deeds. If you had the equivalent of Mount Uhud which you spent in the cause of Allah, that would not be accepted from you until you believed in the Divine Decree and you know that whatever has befallen you, could not have passed you by; and whatever has passed you by, could not have befallen you; and that if you were to die believing anything other than this, you would enter Hell. And it will not harm you to go to my brother, 'Abdullah bin Mas'ud, and ask him (about this).' So I went to 'Abdullah and asked him , and he said something similar to what Ubayy had said, and he told me: 'It will not harm you to go to Hudhaifah.' So I went to Hudhaifah and asked him, and he said something similar to what they had said. And he told me: 'Go to Zaid bin Thabit and ask him.' So I went to Zaid bun Thabit and asked him, and he said: 'I heard the Messenger of Allah (ﷺ) say: \"If Allah were to punish the inhabitants of His heavens and of His earth, he would do so and He would not be unjust towards them. And if He were to have mercy on them, His mercy would be better for them than their own deeds. If you had the equivalent of Mount Uhud which you spent in the cause of Allah, that would not be accepted from you until you believed in the Divine Decree and you know that whatever has befallen you, could not have passed you by; and whatever has passed you by, could not have befallen you; and that if you were to die believing anything other than this, you would enter Hell\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20310",
        "28625",
        "5136"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 3,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}