{
  "id": "28643",
  "name": "Yazid bin Sinan bin Yazid al-Tamimi يزيد بن سنان بن يزيد التميمي الجزري",
  "full_name": "Yazid bin Sinan bin Yazid al-Tamimi يزيد بن سنان بن يزيد التميمي الجزري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "155",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Juzri",
      "al-Rahawi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "28545",
      "name": "Muhammad bin Yazid bin Sinan محمد بن يزيد بن سنان الجزري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "28545",
      "name": "Muhammad bin Yazid bin Sinan محمد بن يزيد بن سنان الجزري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-1885",
      "hadith_no": "1885",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن يزيد بن سنان الجزري، عن ابن لعطاء بن أبي رباح، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تشربوا واحدا كشرب البعير ولكن اشربوا مثنى وثلاث وسموا إذا أنتم شربتم واحمدوا إذا أنتم رفعتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ ويزيد بن سنان الجزري هو أبو فروة الرهاوي ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Messenger of Allah (ﷺ) said: \"Let none of you drink all at once like the camel. But drink two or three times, mentioning Allah's Name when you drink, and praising Him when you (finish).\"[Abu 'Eisa said:] This Hadith is Gharib. Yazid bin Sinan Al-Jazari is Abu Farwah Ar-Ruhawi.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "28643",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3168",
      "hadith_no": "3168",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل الواسطي، حدثنا وكيع، حدثنا أبو فروة، يزيد بن سنان عن أبي المبارك، عن صهيب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما آمن بالقرآن من استحل محارمه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بالقوي وقد خولف وكيع في روايته ‏.‏ وقال محمد أبو فروة يزيد بن سنان الرهاوي ليس بحديثه بأس إلا رواية ابنه محمد عنه فإنه يروي عنه مناكير ‏.‏ قال أبو عيسى وقد روى محمد بن يزيد بن سنان عن أبيه هذا الحديث فزاد في هذا الإسناد عن مجاهد عن سعيد بن المسيب عن صهيب ولا يتابع محمد بن يزيد على روايته وهو ضعيف وأبو المبارك رجل مجهول ‏.‏",
      "text_en": " Narrated Suhaib:                     that the Messenger of Allah (ﷺ) said: \"He does not believe in the Qur'an who makes lawful what it prohibits.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20032",
        "28643",
        "182"
      ]
    },
    {
      "id": "sunan-an-nasai-5442",
      "hadith_no": "5442",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يزيد بن سنان، قال حدثنا عبد الرحمن، قال أنبأنا سفيان، عن أبي سنان، عن عبد الله بن أبي الهذيل، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم كان يتعوذ من أربع من علم لا ينفع ومن قلب لا يخشع ودعاء لا يسمع ونفس لا تشبع ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Amr that:                     The Prophet [SAW] used to seek refuge (with Allah) from four things: From knowledge that is of no benefit, from a heart that does not feel humble, from a supplication that is not heard, and a soul that is never satisfied.",
      "usc_msa_ref": "",
      "chain": [
        "28643",
        "20033",
        "20012",
        "10787",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-248",
      "hadith_no": "248",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "قال أبو الحسن وحدثنا أبو حاتم، حدثنا محمد بن يزيد بن سنان الرهاوي، حدثنا يزيد بن سنان، - يعني أباه - حدثني زيد بن أبي أنيسة، عن فليح بن سليمان، عن زيد بن أسلم، عن عبد الله بن أبي قتادة، عن أبيه، سمعت رسول الله  صلى الله عليه وسلم  فذكر نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "28545",
        "28643",
        "11340",
        "20169",
        "11163",
        "11804",
        "391"
      ]
    },
    {
      "id": "sunan-ibn-majah-2679",
      "hadith_no": "2679",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا الخليل بن عمرو، حدثنا مروان بن معاوية، حدثنا يزيد بن سنان الجزري، عن ميمون بن مهران، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتي عند ماله فقوتل فقاتل فقتل فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn `Umar that the Messenger of Allah (ﷺ) said:                     “If a man's property is targeted, and he is fought and fights back and is killed, he is a martyr.”",
      "usc_msa_ref": "",
      "chain": [
        "36552",
        "20201",
        "28643",
        "11012",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2938",
      "hadith_no": "2938",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، حدثني أبو فروة، يزيد بن سنان حدثني عروة بن، رويم اللخمي، عن أبي ثعلبة الخشني، - قال ولقيه وكلمه - قال أتيت رسول الله صلى الله عليه وسلم فسألته فقلت يا رسول الله قدور المشركين نطبخ فيها قال ‏\"‏ لا تطبخوا فيها ‏\"‏ ‏.‏ قلت فإن احتجنا إليها فلم نجد منها بدا قال ‏\"‏ فارحضوها رحضا حسنا ثم اطبخوا وكلوا ‏\"‏ ‏.‏",
      "text_en": " ‘Urwahbin Ruwaim Al-Lakhmi narrated that Abu Tha’labah Al-Khushani –whom he said he met and spoke with – said:                      “I came to theMessenger ofAllah (ﷺ) and asked him: ‘O Messenger of Allah! Canwe cook in thevessels of the idolaters?’ He said: ‘Do not cookin them.’ I said:‘What if we need them and cannot find anythingelse?’ He said: ‘Washthem well, then cook and eat.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20318",
        "28643",
        "4056"
      ]
    }
  ],
  "total_hadiths": 6
}