{
  "id": "28642",
  "name": "Yazid bin Hyan al-Nbty يزيد بن حيان النبطي",
  "full_name": "Yazid bin Hyan al-Nbty يزيد بن حيان النبطي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Bulkh",
      "al-Mada'in"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ قد  ت  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Bulki",
      "al-Mada'in"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10947",
      "name": "'Ata' bin Abi Muslim عطاء بن أبي مسلم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30525",
      "name": "Yahya bin Ishaq يحيى بن إسحاق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30235",
      "name": "'Abdul Ghaffar bin Da'ud, Abu Salah Hira عبد الغفار بن داود - أبو صالح الحراني",
      "grade": "3rd Century AH [10th generation] [Hanafi]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34015",
      "name": "Ibrahim bin al-Hjaj bin Zayd إبراهيم بن الحجاج بن زيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-6378",
      "hadith_no": "6378",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، وشجاع بن مخلد، جميعا عن ابن علية، قال زهير حدثنا  إسماعيل بن إبراهيم، حدثني أبو حيان، حدثني يزيد بن حيان، قال انطلقت أنا وحصين، بن سبرة وعمر بن مسلم إلى زيد بن أرقم فلما جلسنا إليه قال له حصين لقد لقيت يا زيد خيرا كثيرا رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه وغزوت معه وصليت خلفه لقد لقيت يا زيد خيرا كثيرا حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم - قال - يا ابن أخي والله لقد كبرت سني وقدم عهدي ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوا وما لا فلا تكلفونيه ‏.‏ ثم قال قام رسول الله صلى الله عليه وسلم يوما فينا خطيبا بماء يدعى خما بين مكة والمدينة فحمد الله وأثنى عليه ووعظ وذكر ثم قال ‏\"‏ أما بعد ألا أيها الناس فإنما أنا بشر يوشك أن يأتي رسول ربي فأجيب وأنا تارك فيكم ثقلين أولهما كتاب الله فيه الهدى والنور فخذوا بكتاب الله واستمسكوا به ‏\"‏ ‏.‏ فحث على كتاب الله ورغب فيه ثم قال ‏\"‏ وأهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي ‏\"‏ ‏.‏ فقال له حصين ومن أهل بيته يا زيد أليس نساؤه من أهل بيته قال نساؤه من أهل بيته ولكن أهل بيته من حرم الصدقة بعده ‏.‏ قال ومن هم قال هم آل علي وآل عقيل وآل جعفر وآل عباس ‏.‏ قال كل هؤلاء حرم الصدقة قال نعم ‏.‏",
      "text_en": " Yazid b. Hayyan reported, I went along with Husain b. Sabra and 'Umar b. Muslim to Zaid b. Arqam and, as we sat by his side, Husain said to him:                      Zaid. you have been able to acquire a great virtue that you saw Allah's Messenger (may peace be upon him) listened to his talk, fought by his side in (different) battles, offered prayer behind me. Zaid, you have in fact earned a great virtue. Zaid, narrate to us what you heard from Allah's Messenger (may peace be upon him). He said: I have grown old and have almost spent my age and I have forgotten some of the things which I remembered in connection with Allah's Messenger (may peace be upon him), so accept whatever I narrate to you, and which I do not narrate do not compel me to do that. He then said: One day Allah's Messenger (may peace be upon him) stood up to deliver sermon at a watering place known as Khumm situated between Mecca and Medina. He praised Allah, extolled Him and delivered the sermon and. exhorted (us) and said: Now to our purpose. O people, I am a human being. I am about to receive a messenger (the angel of death) from my Lord and I, in response to Allah's call, (would bid good-bye to you), but I am leaving among you two weighty things: the one being the Book of Allah in which there is right guidance and light, so hold fast to the Book of Allah and adhere to it. He exhorted (us) (to hold fast) to the Book of Allah and then said: The second are the members of my household I remind you (of your duties) to the members of my family. He (Husain) said to Zaid: Who are the members of his household? Aren't his wives the members of his family? Thereupon he said: His wives are the members of his family (but here) the members of his family are those for whom acceptance of Zakat is forbidden. And he said: Who are they? Thereupon he said: 'Ali and the offspring of 'Ali, 'Aqil and the offspring of 'Aqil and the offspring of Ja'far and the offspring of 'Abbas. Husain said: These are those for whom the acceptance of Zakat is forbidden. Zaid said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30506",
        "20208",
        "20321",
        "20208",
        "11404",
        "28642"
      ]
    },
    {
      "id": "sahih-muslim-6379",
      "hadith_no": "6379",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن  سعيد بن مسروق، عن يزيد بن حيان، عن زيد بن أرقم، عن النبي صلى الله عليه وسلم ‏.‏ وساق الحديث بنحوه بمعنى حديث زهير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zaid b. Arqam through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "id": "sahih-muslim-6381",
      "hadith_no": "6381",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن سعيد، - وهو ابن مسروق - عن يزيد بن حيان، عن زيد بن أرقم، قال دخلنا عليه فقلنا له لقد رأيت خيرا ‏.‏ لقد صاحبت رسول الله صلى الله عليه وسلم وصليت خلفه ‏.‏ وساق الحديث بنحو حديث أبي حيان غير أنه قال ‏\"‏ ألا وإني تارك فيكم ثقلين أحدهما كتاب الله عز وجل هو حبل الله من اتبعه كان على الهدى ومن تركه كان على ضلالة ‏\"‏ ‏.‏ وفيه فقلنا من أهل بيته نساؤه قال لا وايم الله إن المرأة تكون مع الرجل العصر من الدهر ثم يطلقها فترجع إلى أبيها وقومها أهل بيته أصله وعصبته الذين حرموا الصدقة بعده ‏.‏",
      "text_en": " Yazid b. Hayyan reported:                      We went to him (Zaid b. Arqam) and said to him. You have found goodness (for you had the honour) to live in the company of Allah's Messenger (may peace be upon him) and offered prayer behind him, and the rest of the hadith is the same but with this variation of wording that lie said: Behold, for I am leaving amongst you two weighty things, one of which is the Book of Allah, the Exalted and Glorious, and that is the rope of Allah. He who holds it fast would be on right guidance and he who abandons it would be in error, and in this (hadith) these words are also found: We said: Who are amongst the members of the household? Aren't the wives (of the Holy Prophet) included amongst the members of his house hold? Thereupon he said: No, by Allah, a woman lives with a man (as his wife) for a certain period; he then divorces her and she goes back to her parents and to her people; the members of his household include his ownself and his kith and kin (who are related to him by blood) and for him the acceptance of Zakat is prohibited.",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "id": "sunan-abi-daud-4973",
      "hadith_no": "4973",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن أبي حيان، عن يزيد بن حيان، عن زيد بن أرقم، أن النبي صلى الله عليه وسلم خطبهم فقال ‏\"‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Arqam said that the Prophet (May peace be upon him) addressed them, saying :                      To proceed (amma ba’d)",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11404",
        "28642",
        "384"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1681",
      "hadith_no": "1681",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن رافع، حدثنا يحيى بن إسحاق، وهو السالحاني حدثنا يزيد بن حيان، قال سمعت أبا مجلز، لاحق بن حميد يحدث عن ابن عباس، قال كانت راية رسول الله صلى الله عليه وسلم سوداء ولواؤه أبيض ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث ابن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "30525",
        "28642",
        "11313",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2925",
      "hadith_no": "2925",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن إسحاق الواسطي الناقد، حدثنا يحيى بن إسحاق، عن يزيد بن حيان، سمعت أبا مجلز، يحدث عن ابن عباس، أن راية، رسول الله صلى الله عليه وسلم كانت سوداء ولواؤه أبيض ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the flag of the Messenger ofAllah(ﷺ) was black, and his standard was white.",
      "usc_msa_ref": "",
      "chain": [
        "30525",
        "28642",
        "11313",
        "17"
      ]
    }
  ],
  "total_hadiths": 6
}