{
  "id": "28708",
  "name": "Umm Yonus bin Shadad أم يونس بنت شداد",
  "full_name": "Umm Yonus bin Shadad أم يونس بنت شداد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Undefined",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Undefined] [ د  - ]"
    ],
    "tags": [
      "Female"
    ]
  },
  "parents": [
    {
      "id": "19538",
      "name": "Umm Jahdar al-'Amiriyya أم جحدر العامرية",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19538",
      "name": "Umm Jahdar al-'Amiriyya أم جحدر العامرية",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-388",
      "hadith_no": "388",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو معمر، حدثنا عبد الوارث، حدثتنا أم يونس بنت شداد، قالت حدثتني حماتي أم جحدر العامرية، أنها سألت عائشة عن دم الحيض يصيب الثوب فقالت كنت مع رسول الله صلى الله عليه وسلم وعلينا شعارنا وقد ألقينا فوقه كساء فلما أصبح رسول الله صلى الله عليه وسلم أخذ الكساء فلبسه ثم خرج فصلى الغداة ثم جلس فقال رجل يا رسول الله هذه لمعة من دم ‏.‏ فقبض رسول الله صلى الله عليه وسلم على ما يليها فبعث بها إلى مصرورة في يد الغلام فقال ‏\"‏ اغسلي هذه وأجفيها ثم أرسلي بها إلى ‏\"‏ ‏.‏ فدعوت بقصعتي فغسلتها ثم أجففتها فأحرتها إليه فجاء رسول الله صلى الله عليه وسلم بنصف النهار وهي عليه ‏.‏",
      "text_en": " Umm Jahdar al-'Amiriyyah said that she asked 'Aishah about the blood of menses which drops on the clothe. She replied:                      I was (lying) with the Messenger of Allah (ﷺ) and we had our garment over us, and we had put a blanket over it. When the day broke, the Messenger of Allah (ﷺ) took the blanket, wore it and went out and offered the dawn prayer. He then sat (in the mosque among the people). A man said: Messenger of Allah, this is a spot of blood. The Messenger of Allah (ﷺ) caught hold of it from around and sent it to me folded in the hand of a slave and said: Wash it and dry it and then send it to me. I sent for my vessel and washed it. I then dried it and returned it to him. The Messenger of Allah (ﷺ) came at noon while he had the blanket over him.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30315",
        "20258",
        "28708",
        "53"
      ]
    }
  ],
  "total_hadiths": 1
}