{
  "id": "29225",
  "name": "Ja'far bin Abi Kathir al-Ansari جعفر بن أبي كثير الأنصاري",
  "full_name": "Ja'far bin Abi Kathir al-Ansari جعفر بن أبي كثير الأنصاري",
  "grade": "Succ. (Taba' Tabi')",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": [
      "Ansar",
      "Client",
      "Ally B.Zurayq",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "23595",
      "name": "Kathir bin Ja'far bin Abi Kathir كثير بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22700",
      "name": "Yahya bin Ja'far bin Abi Kathir يحيى بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "22239",
      "name": "Y'aqub bin Ja'far bin Abi Kathir يعقوب بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-220",
      "hadith_no": "220",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، - واللفظ ليحيى - قالا حدثنا إسماعيل بن جعفر، قال أخبرني أبو سهيل، نافع بن مالك بن أبي عامر عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث إذا حدث كذب وإذا وعد أخلف وإذا ائتمن خان ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) said:                      Three are the signs of a hypocrite: when he spoke he told a lie, when he made a promise he acted treacherously against it, when he was trusted he betrayed.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "29225",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-221",
      "hadith_no": "221",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن إسحاق، أخبرنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني العلاء بن عبد الرحمن بن يعقوب، مولى الحرقة عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من علامات المنافق ثلاثة إذا حدث كذب وإذا وعد أخلف وإذا ائتمن خان ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace and blessings be upon him) observed:                      There are three characteristics of a hypocrite: when he spoke he told a lie, when he made promise he acted treacherously, and when he was trusted he betrayed.",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "30232",
        "20173",
        "29225",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-233-2",
      "hadith_no": "233",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، كلهم عن إسماعيل، - قال ابن أيوب حدثنا إسماعيل بن جعفر، - أخبرني العلاء بن عبد الرحمن بن يعقوب، مولى الحرقة عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الصلاة الخمس والجمعة إلى الجمعة كفارة لما بينهن ما لم تغش الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Five prayers and from one Friday prayer to (the next) Friday prayer is an expiation (of the sins committed in between their intervals) if major sins are not committed.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20208",
        "20155",
        "29225",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-260-2",
      "hadith_no": "260",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني أبو بكر بن إسحاق، أخبرنا ابن أبي مريم، أخبرنا محمد بن جعفر، أخبرني العلاء بن عبد الرحمن بن يعقوب، مولى الحرقة عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ جزوا الشوارب وأرخوا اللحى خالفوا المجوس ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Trim closely the moustache, and grow beard, and thus act against the fire-worshippers.",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "30232",
        "20173",
        "29225",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-861",
      "hadith_no": "861",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباد بن موسى الختلي، حدثنا إسماعيل، - يعني ابن جعفر - أخبرني يحيى بن علي بن يحيى بن خلاد بن رافع الزرقي، عن أبيه، عن جده، عن رفاعة بن رافع، أن رسول الله صلى الله عليه وسلم فقص هذا الحديث قال فيه ‏\"‏ فتوضأ كما أمرك الله جل وعز ثم تشهد فأقم ثم كبر فإن كان معك قرآن فاقرأ به وإلا فاحمد الله وكبره وهلله ‏\"‏ ‏.‏ وقال فيه ‏\"‏ وإن انتقصت منه شيئا انتقصت من صلاتك ‏\"‏ ‏.‏",
      "text_en": " Rifa’ah b. Rafi has also narrated this tradition through a different chain from the Messenger of Allah(ﷺ). This version goes:                      Then perform ablution in a way Allah, the exalted, has command you, then say the shahadah and get up and say the takbir. Then if you know any of the Qur’an, recite it; otherwise say: “Praise be to Allah”; “Allah is most great”; “ There is no god but Allah” He ( the narrator) also said in this version: If some defect remains in this, that detect will remain in your prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30255",
        "20155",
        "29225",
        "323"
      ]
    },
    {
      "id": "sunan-abi-daud-1249",
      "hadith_no": "1249",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو معمر عبد الله بن عمرو، حدثنا عبد الوارث، حدثنا محمد بن إسحاق، عن محمد بن جعفر، عن ابن عبد الله بن أنيس، عن أبيه، قال بعثني رسول الله صلى الله عليه وسلم إلى خالد بن سفيان الهذلي - وكان نحو عرنة وعرفات - فقال ‏\"‏ اذهب فاقتله ‏\"‏ ‏.‏ قال فرأيته وحضرت صلاة العصر فقلت إني لأخاف أن يكون بيني وبينه ما إن أؤخر الصلاة فانطلقت أمشي وأنا أصلي أومئ إيماء نحوه فلما دنوت منه قال لي من أنت قلت رجل من العرب بلغني أنك تجمع لهذا الرجل فجئتك في ذاك ‏.‏ قال إني لفي ذاك فمشيت معه ساعة حتى إذا أمكنني علوته بسيفي حتى برد ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Unais:                     The Messenger of Allah (ﷺ) sent me to Khalid b. Sufyan al-Hudhail. This was towards 'Uranah and 'Arafat. He (the Prophet) said: Go and kill him. I saw him when the time of the afternoon prayer had come. I said: I am afraid if a fight takes place between me and him (Khalid b. Sufyan), that might delay the prayer. I proceeded walking towards him while I was praying by making a sign. When I reached near him, he said to me: Who are you ? I replied: A man from the Arabs; it came to me that you were gathering (any army) for this man (i.e. Prophet). Hence I came to you in connection with this matter. He said: I am (engaged) in this (work). I then walked along with him for a while ; when it became convenient for me, I dominated him with my sword until he became cold (dead).",
      "usc_msa_ref": "",
      "chain": [
        "30350",
        "20258",
        "11107",
        "20173",
        "29225"
      ]
    },
    {
      "id": "sunan-an-nasai-2090",
      "hadith_no": "2090",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، - وهو ابن جعفر - قال حدثنا أبو سهيل، عن أبيه، عن طلحة بن عبيد الله، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم ثائر الرأس فقال يا رسول الله أخبرني ماذا فرض الله على من الصلاة قال ‏\"‏ الصلوات الخمس إلا أن تطوع شيئا ‏\"‏ ‏.‏ قال أخبرني بما افترض الله على من الصيام قال ‏\"‏ صيام شهر رمضان إلا أن تطوع شيئا ‏\"‏ ‏.‏ قال أخبرني بما افترض الله على من الزكاة فأخبره رسول الله صلى الله عليه وسلم بشرائع الإسلام ‏.‏ فقال والذي أكرمك لا أتطوع شيئا ولا أنقص مما فرض الله على شيئا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏ ‏.‏ أو ‏\"‏ دخل الجنة إن صدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Talhah bin 'Ubaidullah that:                     a Bedouin came to the Messenger of Allah with unkempt hair and said: \"O Allah has enjoined upon me of Salah.\" He said: \"The five daily prayers, unless you do any more voluntarily.\" He said: \"Tell me what Allah has enjoined upon me voluntarily.\" He said: \"Tell me what Allah has enjoined upon me of fasting.\" He said: \"Fasting the month of Ramadan, unless you do any more voluntarily.\" He said: \"Tell me what Allah has enjoined upon me of Zakah.\" The Messenger of Allah told him of the laws of Islam, He said: \"By the One Who has honored you, I will not do anything voluntarily, and I will not do anything voluntarily, and I will not do less than that which Allah has enjoined upon, me: The Messenger of Allah said: \"He will succeed if he is sincere,\" or \"He will enter Paradise if he is sincere.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "29225",
        "6"
      ]
    }
  ],
  "total_hadiths": 7
}