{
  "id": "3",
  "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
  "full_name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "41",
      "date_gregorian": "582",
      "date_display": [
        "41 BH",
        "582 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "23",
      "date_gregorian": "645",
      "date_display": null,
      "place": "Medinah",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Commander",
      "Khalifah"
    ],
    "tags": [
      "Quraish",
      "B.'Adi",
      "Emigrant",
      "Badr",
      "Uhud",
      "Khandaq",
      "Scribe",
      "Promised Paradise"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "124",
      "name": "Zaynab bint Maz'un ( زينب بنت مظعون بن حبيب الجمحية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "186",
      "name": "Umm Kulthum bint 'Amr ( أم كلثوم بنت عمرو بن جرول الخزاعية ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "81",
      "name": "Qaraybah bint Abi Umayyah al-Sugra ( قريبة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "564",
      "name": "Jamila bint Thabit ibn Abi al-Aflah ( جميلة بنت ثابت بن أبي الأقلح ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "196",
      "name": "'Atikah bint Zayd ( عاتكة بنت زيد بن عمرو بن نفيل ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "99",
      "name": "Umm Kulthum bint 'Ali bin Abi Talib ( أم كلثوم بنت علي بن أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "93",
      "name": "Umm Hakim ( أم حكيم بنت الحارث بن هشام بن المغيرة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "114",
      "name": "Zayd ibn al-Khattab ( زيد بن الخطاب بن نفيل العدوي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "78",
      "name": "Fatima bint al-Khattab ( فاطمة بنت الخطاب بن نفيل القرشية العدوية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "445",
      "name": "Safiyah bint al-Khattab ( صفية بنت الخطاب بن نفيل القرشية العدوية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "560",
      "name": "'Abdur Rahman bin 'Umar ( عبد الرحمن الأكبر بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "561",
      "name": "'Ubaidallah bin 'Umar ( عبيد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "562",
      "name": "Zayd bin 'Umar ( زيد بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "563",
      "name": "'Asim bin 'Umar ( عاصم بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10577",
      "name": "'Iyad bin 'Umar عياض بن عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10575",
      "name": "Zaid bin 'Umar عياض بن عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10576",
      "name": "Ruqayyah bint 'Umar رقية بنت عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10578",
      "name": "Fatima bint 'Umar فاطمة بنت عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10579",
      "name": "Zainab bint 'Umar زينب بنت عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "563",
      "name": "'Asim bin 'Umar ( عاصم بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "189",
      "name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "391",
      "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "212",
      "name": "'Adi ibn Hatim al-Tayyi' ( عدي بن حاتم الطائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "485",
      "name": "Ash'uth bin Qays ( الأشعث بن قيس بن معدي كرب الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4057",
      "name": "Jarir bin 'Abdullah al-Bajli ( جرير بن عبد الله البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4052",
      "name": "Ka'b bin 'Ajra al-Salmi, al-Ansari ( كعب بن عجرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2201",
      "name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5066",
      "name": "Sufyan bin 'Abdullah bin Rabi'a ( سفيان بن عبد الله بن ربيعة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2801",
      "name": "Shayba bin 'Uthman ( شيبة بن عثمان الحجبي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1048",
      "name": "'Abdullah bin 'Unays al-Juhani ( عبد الله بن أنيس الجهني أبو يحيى المدني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4123",
      "name": "Hamza bin 'Amr al-Aslami ( حمزة بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5309",
      "name": "Naf' bin Abd al-Harith ( نافع بن عبد الحارث بن خالد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1935",
      "name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15659",
      "name": "Abu Umamah Or Abu Umayya أبو أمامة / أبو أميمة التميمي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا الحميدي عبد الله بن الزبير، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد الأنصاري، قال أخبرني محمد بن إبراهيم التيمي، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          I heard Allah's Apostle saying, \"The reward of deeds depends upon the      intentions and every person will get the reward according to what he      has intended. So whoever emigrated for worldly benefits or for a woman     to marry, his emigration was for what he emigrated for.\"",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن الصباح، سمع جعفر بن عون، حدثنا أبو العميس، أخبرنا قيس بن مسلم، عن طارق بن شهاب، عن عمر بن الخطاب، أن رجلا، من اليهود قال له يا أمير المؤمنين، آية في كتابكم تقرءونها لو علينا معشر اليهود نزلت لاتخذنا ذلك اليوم عيدا‏.‏ قال أى آية قال ‏{‏اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا‏}‏‏.‏ قال عمر قد عرفنا ذلك اليوم والمكان الذي نزلت فيه على النبي صلى الله عليه وسلم وهو قائم بعرفة يوم جمعة‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Once a Jew said to me, \"O the chief of believers! There is a verse in      your Holy Book Which is read by all of you (Muslims), and had it been      revealed to us, we would have taken that day (on which it was revealed     as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that      verse?\" The Jew replied, \"This day I have perfected your religion For      you, completed My favor upon you, And have chosen for you Islam as      your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where      this verse was revealed to the Prophet. It was Friday and the Prophet      was standing at 'Arafat (i.e. the Day of Hajj)\"",
      "chain": [
        "30244",
        "20416",
        "20342",
        "11386",
        "3680",
        "3"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Allah's Apostle said, \"The reward of deeds depends upon the intention      and every person will get the reward according to what he has      intended. So whoever emigrated for Allah and His Apostle, then his      emigration was for Allah and His Apostle. And whoever emigrated for      worldly benefits or for a woman to marry, his emigration was for what      he emigrated for.\"",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح قال أبو عبد الله وقال ابن وهب أخبرنا يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس، عن عمر، قال كنت أنا وجار، لي من الأنصار في بني أمية بن زيد، وهى من عوالي المدينة، وكنا نتناوب النزول على رسول الله صلى الله عليه وسلم ينزل يوما وأنزل يوما، فإذا نزلت جئته بخبر ذلك اليوم من الوحى وغيره، وإذا نزل فعل مثل ذلك، فنزل صاحبي الأنصاري يوم نوبته، فضرب بابي ضربا شديدا‏.‏ فقال أثم هو ففزعت فخرجت إليه فقال قد حدث أمر عظيم‏.‏ قال فدخلت على حفصة فإذا هي تبكي فقلت طلقكن رسول الله صلى الله عليه وسلم قالت لا أدري‏.‏ ثم دخلت على النبي صلى الله عليه وسلم فقلت وأنا قائم أطلقت نساءك قال ‏\"‏ لا ‏\"‏‏.‏ فقلت الله أكبر‏.‏",
      "text_en": " Narrated `Umar:                     My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to visit the Prophet by turns. He used to go one day and I another day. When I went I used to bring the news of that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked violently at my door and asked if I was there.\" I became horrified and came out to him. He said, \"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did Allah's Apostle divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet and said while standing, \"Have you divorced your wives?\" The Prophet replied in the negative. On what I said, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30184",
        "20029",
        "20475",
        "11013",
        "11200",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "287",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة، قال حدثنا الليث، عن نافع، عن ابن عمر، أن عمر بن الخطاب، سأل رسول الله صلى الله عليه وسلم أيرقد أحدنا وهو جنب قال ‏\"‏ نعم إذا توضأ أحدكم فليرقد وهو جنب ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I asked Allah's Apostle \"Can any one of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution, he can sleep while he is Junub.\"",
      "chain": [
        "30367",
        "20023",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "596",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن جابر بن عبد الله، أن عمر بن الخطاب، جاء يوم الخندق بعد ما غربت الشمس، فجعل يسب كفار قريش قال يا رسول الله ما كدت أصلي العصر حتى كادت الشمس تغرب‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ والله ما صليتها ‏\"‏‏.‏ فقمنا إلى بطحان، فتوضأ للصلاة، وتوضأنا لها فصلى العصر بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Al-Khandaq (the battle of trench.) `Umar bin Al-Khattab came cursing the disbelievers of Quraish after the sun had set and said, \"O Allah's Apostle I could not offer the `Asr prayer till the sun had set.\" The Prophet said, \"By Allah! I, too, have not prayed.\" So we turned towards Buthan, and the Prophet performed ablution and we too performed ablution and offered the `Asr prayer after the sun had set, and then he offered the Maghrib prayer.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن عمر  رضى الله عنه  بينما هو يخطب يوم الجمعة إذ دخل رجل فقال عمر لم تحتبسون عن الصلاة فقال الرجل ما هو إلا سمعت النداء توضأت‏.‏ فقال ألم تسمعوا النبي صلى الله عليه وسلم قال ‏\"‏ إذا راح أحدكم إلى الجمعة فليغتسل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While `Umar (bin Al-Khattab) was delivering the Khutba on a Friday, a man entered (the mosque). `Umar asked him, \"What has detained you from the prayer?\" The man said, \"It was only that when I heard the Adhan I performed ablution (for the prayer).\" On that `Umar said, \"Did you not hear the Prophet saying: 'Anyone of you going out for the Jumua prayer should take a bath'?\".",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "1010",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن محمد، قال حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي عبد الله بن المثنى، عن ثمامة بن عبد الله بن أنس، عن أنس، أن عمر بن الخطاب  رضى الله عنه  كان إذا قحطوا استسقى بالعباس بن عبد المطلب فقال اللهم إنا كنا نتوسل إليك بنبينا فتسقينا وإنا نتوسل إليك بعم نبينا فاسقنا‏.‏ قال فيسقون‏.‏",
      "text_en": " Narrated Anas:                     Whenever drought threatened them, `Umar bin Al-Khattab, used to ask Al-Abbas bin `Abdul Muttalib to invoke Allah for rain. He used to say, \"O Allah! We used to ask our Prophet to invoke You for rain, and You would bless us with rain, and now we ask his uncle to invoke You for rain. O Allah ! Bless us with rain.\"(1) And so it would rain.",
      "chain": [
        "30245",
        "20280",
        "11270",
        "19",
        "3"
      ]
    },
    {
      "hadith_no": "1292",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن قتادة، عن سعيد بن المسيب، عن ابن عمر، عن أبيه  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الميت يعذب في قبره بما نيح عليه ‏\"‏‏.‏ تابعه عبد الأعلى حدثنا يزيد بن زريع حدثنا سعيد حدثنا قتادة‏.‏ وقال آدم عن شعبة ‏\"‏ الميت يعذب ببكاء الحى عليه ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Umar from his father:                          The Prophet said, \"The deceased is tortured in his grave for the      wailing done over him.\"      Narrated Shu'ba:     The deceased is tortured for the wailing of the living ones over him .",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11019",
        "11002",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "1366",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن بكير، حدثني الليث، عن عقيل، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، عن عمر بن الخطاب  رضى الله عنهم  أنه قال لما مات عبد الله بن أبى ابن سلول دعي له رسول الله صلى الله عليه وسلم ليصلي عليه، فلما قام رسول الله صلى الله عليه وسلم وثبت إليه فقلت يا رسول الله، أتصلي على ابن أبى وقد قال يوم كذا وكذا كذا وكذا  أعدد عليه قوله  فتبسم رسول الله صلى الله عليه وسلم وقال ‏\"‏ أخر عني يا عمر ‏\"‏‏.‏ فلما أكثرت عليه قال ‏\"‏ إني خيرت فاخترت، لو أعلم أني إن زدت على السبعين فغفر له لزدت عليها ‏\"‏‏.‏ قال فصلى عليه رسول الله صلى الله عليه وسلم ثم انصرف، فلم يمكث إلا يسيرا حتى نزلت الآيتان من ‏{‏براءة‏}‏ ‏{‏ولا تصل على أحد منهم مات أبدا‏}‏ إلى ‏{‏وهم فاسقون‏}‏ قال فعجبت بعد من جرأتي على رسول الله صلى الله عليه وسلم يومئذ، والله ورسوله أعلم‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     When `Abdullah bin Ubai bin Salul died, Allah's Apostle (p.b.u.h) was called upon to offer his funeral prayer. When Allah's Apostle stood up to offer the prayer, I got up quickly and said, \"O Allah's Apostle! Are you going to pray for Ibn Ubai and he said so and so on such and such occasions?\" And started mentioning all that he had said. Allah's Apostle smiled and said, \"O `Umar! Go away from me.\" When I talked too much he said, \"I have been given the choice and so I have chosen (to offer the prayer). Had I known that he would be forgiven by asking for Allah's forgiveness for more than seventy times, surely I would have done so.\" (`Umar added): Allah's Apostle offered his funeral prayer and returned and after a short while the two verses of Surat Bara' were revealed: i.e. \"And never (O Muhammad) pray for any of them who dies . . . (to the end of the verse) rebellion (9.84)\" -- (`Umar added), \"Later I astonished at my daring before Allah's Apostle on that day. And Allah and His Apostle know better.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11004",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن زيد بن أسلم، عن أبيه، قال سمعت عمر  رضى الله عنه  يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه، وظننت أنه يبيعه برخص، فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتر ولا تعد في صدقتك، وإن أعطاكه بدرهم، فإن العائد في صدقته كالعائد في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     Once I gave a horse in Allah's Cause (in charity) but that person did not take care of it. I intended to buy it, as I thought he would sell it at a low price. So, I asked the Prophet (p.b.u.h) about it. He said, \"Neither buy, nor take back your alms which you have given, even if the seller were willing to sell it for one Dirham, for he who takes back his alms is like the one who swallows his own vomit.\"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1622",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم، عن عابس بن ربيعة، عن عمر  رضى الله عنه  أنه جاء إلى الحجر الأسود فقبله، فقال إني أعلم أنك حجر لا تضر ولا تنفع، ولولا أني رأيت النبي صلى الله عليه وسلم يقبلك ما قبلتك‏.‏",
      "text_en": " Narrated `Abis bin Rabi`a:                     `Umar came near the Black Stone and kissed it and said \"No doubt, I know that you are a stone and can neither benefit anyone nor harm anyone. Had I not seen Allah's Apostle kissing you I would not have kissed you.\"",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11051",
        "3"
      ]
    },
    {
      "hadith_no": "1631",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، أن عمر بن الخطاب  رضى الله عنه  قال للركن أما والله إني لأعلم أنك حجر لا تضر ولا تنفع، ولولا أني رأيت النبي صلى الله عليه وسلم استلمك ما استلمتك‏.‏ فاستلمه، ثم قال فما لنا وللرمل إنما كنا راءينا به المشركين، وقد أهلكهم الله‏.‏ ثم قال شىء صنعه النبي صلى الله عليه وسلم فلا نحب أن نتركه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father who said:                     \"`Umar bin Al-Khattab addressed the Corner (Black Stone) saying, 'By Allah! I know that you are a stone and can neither benefit nor harm. Had I not seen the Prophet touching (and kissing) you, I would never have touched (and kissed) you.' Then he kissed it and said, 'There is no reason for us to do Ramal (in Tawaf) except that we wanted to show off before the pagans, and now Allah has destroyed them.' `Umar added, '(Nevertheless), the Prophet did that and we do not want to leave it (i.e. Ramal).'",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن أبيه، عن عمر  رضى الله عنه  قال اللهم ارزقني شهادة في سبيلك، واجعل موتي في بلد رسولك صلى الله عليه وسلم‏.‏ وقال ابن زريع عن روح بن القاسم، عن زيد بن أسلم، عن أمه، عن حفصة بنت عمر  رضى الله عنهما  قالت سمعت عمر، نحوه‏.‏ وقال هشام عن زيد، عن أبيه، عن حفصة، سمعت عمر، رضى الله عنه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your Apostle.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا جامع، عن أبي وائل، عن حذيفة، قال قال عمر  رضى الله عنه  من يحفظ حديثا عن النبي صلى الله عليه وسلم في الفتنة قال حذيفة أنا سمعته يقول ‏\"‏ فتنة الرجل في أهله وماله وجاره تكفرها الصلاة والصيام والصدقة ‏\"‏‏.‏ قال ليس أسأل عن ذه، إنما أسأل عن التي تموج كما يموج البحر‏.‏ قال وإن دون ذلك بابا مغلقا‏.‏ قال فيفتح أو يكسر قال يكسر‏.‏ قال ذاك أجدر أن لا يغلق إلى يوم القيامة‏.‏ فقلنا لمسروق سله أكان عمر يعلم من الباب فسأله فقال نعم، كما يعلم أن دون غد الليلة‏.‏",
      "text_en": " Narrated Abu Wail from Hudhaifa:                     `Umar asked the people, \"Who remembers the narration of the Prophet about the affliction?\" Hudhaifa said, \"I heard the Prophet saying, 'The affliction of a person in his property, family and neighbors is expiated by his prayers, fasting, and giving in charity.\" `Umar said, \"I do not ask about that, but I ask about those afflictions which will spread like the waves of the sea.\" Hudhaifa replied, \"There is a closed gate in front of those afflictions.\" `Umar asked, \"Will that gate be opened or broken?\" He replied, \"It will be broken.\" `Umar said, \"Then the gate will not be closed again till the Day of Resurrection.\" We said to Masruq, \"Would you ask Hudhaifa whether `Umar knew what that gate symbolized?\" He asked him and he replied \"He (`Umar) knew it as one knows that there will be night before tomorrow, morning.",
      "chain": [
        "30026",
        "20005",
        "11327",
        "11353",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "2042",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن عبد الله، عن أخيه، عن سليمان، عن عبيد الله بن عمر، عن نافع، عن عبد الله بن عمر، عن عمر بن الخطاب  رضى الله عنه  أنه قال يا رسول الله إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أوف نذرك ‏\"‏‏.‏ فاعتكف ليلة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar bin Al-Khattab said, \"O Allah's Apostle! I vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram for one night.\" The Prophet said, \"Fulfill your vow.\" So, he performed I`tikaf for one night.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2043",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن عبيد الله، عن نافع، عن ابن عمر، أن عمر  رضى الله عنه  نذر في الجاهلية أن يعتكف في المسجد الحرام  قال أراه قال  ليلة قال له رسول الله صلى الله عليه وسلم ‏\"‏ أوف بنذرك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     that `Umar had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator thinks that `Umar vowed to perform I`tikaf for one night.) Allah's Apostle said to `Umar, \"Fulfill your vow.\"",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2134",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي، حدثنا سفيان، كان عمرو بن دينار يحدثه عن الزهري، عن مالك بن أوس، أنه قال من عنده صرف فقال طلحة أنا حتى يجيء خازننا من الغابة‏.‏ قال سفيان هو الذي حفظناه من الزهري ليس فيه زيادة‏.‏ فقال أخبرني مالك بن أوس سمع عمر بن الخطاب  رضى الله عنه  يخبر عن رسول الله صلى الله عليه وسلم قال ‏\"‏ الذهب بالذهب ربا إلا هاء وهاء، والبر بالبر ربا إلا هاء وهاء، والتمر بالتمر ربا إلا هاء وهاء، والشعير بالشعير ربا إلا هاء وهاء ‏\"‏‏.‏",
      "text_en": " Narrated Az-Zuhri from Malik bin Aus:                     that the latter said, \"Who has change?\" Talha said, \"I (will have change) when our storekeeper comes from the forest.\" Narrated `Umar bin Al-Khattab: Allah's Apostle said, \"The bartering of gold for silver is Riba, (usury), except if it is from hand to hand and equal in amount, and wheat grain for wheat grain is usury except if it is form hand to hand and equal in amount, and dates for dates is usury except if it is from hand to hand and equal in amount, and barley for barley is usury except if it is from hand to hand and equal in amount.\" (See Riba-Fadl in the glossary).",
      "chain": [
        "5",
        "20005",
        "11081",
        "11013",
        "3"
      ]
    },
    {
      "hadith_no": "2170",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الوليد، حدثنا الليث، عن ابن شهاب، عن مالك بن أوس، سمع عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ البر بالبر ربا إلا هاء وهاء، والشعير بالشعير ربا إلا هاء وهاء، والتمر بالتمر ربا إلا هاء وهاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The selling of wheat for wheat is Riba (usury) except if it is handed from hand to hand and equal in amount. Similarly the selling of barley for barley, is Riba except if it is from hand to hand and equal in amount, and dates for dates is usury except if it is from hand to hand and equal in amount. (See Riba-Fadl in the glossary).",
      "chain": [
        "20296",
        "20023",
        "11013",
        "3"
      ]
    },
    {
      "hadith_no": "2290",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "وقال أبو الزناد عن محمد بن حمزة بن عمرو الأسلمي، عن أبيه، أن عمر  رضى الله عنه  بعثه مصدقا، فوقع رجل على جارية امرأته، فأخذ حمزة من الرجل كفيلا حتى قدم على عمر، وكان عمر قد جلده مائة جلدة، فصدقهم، وعذره بالجهالة‏.‏ وقال جرير والأشعث لعبد الله بن مسعود في المرتدين استتبهم، وكفلهم‏.‏ فتابوا وكفلهم عشائرهم‏.‏ وقال حماد إذا تكفل بنفس فمات فلا شىء عليه‏.‏ وقال الحكم يضمن‏.‏",
      "text_en": " Narrated Muhammad bin 'Amr Al-Aslami that his father Hamza said:                      'Umar (ra) sent him (i.e. Hamza) as a Sadaqa / Zakat collector. A man had committed illegal sexual intercourse with the slave girl of his wife. Hamza took (personal) sureties for the adulterer till they came to 'Umar. 'Umar had lashed the adulterer one hundred lashes. 'Umar confirmed their claim (that the adulterer had already been punished) and excused him because of being Ignorant.Jarir Al-Ash'ath said to Ibn Mas'ud regarding renegades (i.e., those who became infidels after embracing Islam), \"Let them repent and take (personal) sureties for them.\" They repented and their relatives stood sureties for them.According to Hammad, if somebody stands surety for another person and that person dies, the person giving surety will be released from responsibility. According to Al-Hakam, his responsibilities continues.",
      "chain": [
        "11061",
        "12454",
        "3"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه  لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, \"But for the future Muslim generations, I would have distributed the land of the villages I conquer among the soldiers as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2337",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا شعيب بن إسحاق، عن الأوزاعي، قال حدثني يحيى، عن عكرمة، عن ابن عباس، عن عمر  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الليلة أتاني آت من ربي وهو بالعقيق أن صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     While the Prophet was in Al-`Aqiq he said, \"Someone (meaning Gabriel) came to me from my Lord tonight (in my dream) and said, 'Offer the prayer in this blessed valley and say (I intend to perform) `Umra along with Hajj (together).' \"",
      "chain": [
        "30123",
        "20239",
        "20024",
        "11449",
        "11023",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "2419",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، أنه قال سمعت عمر بن الخطاب  رضى الله عنه  يقول سمعت هشام بن حكيم بن حزام، يقرأ سورة الفرقان على غير ما أقرؤها، وكان رسول الله صلى الله عليه وسلم أقرأنيها، وكدت أن أعجل عليه، ثم أمهلته حتى انصرف، ثم لببته بردائه فجئت به رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ على غير ما أقرأتنيها، فقال لي ‏\"‏ أرسله ‏\"‏‏.‏ ثم قال له ‏\"‏ اقرأ ‏\"‏‏.‏ فقرأ‏.‏ قال ‏\"‏ هكذا أنزلت ‏\"‏‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت‏.‏ إن القرآن أنزل على سبعة أحرف فاقرءوا منه ما تيسر ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Hisham bin Hakim bin Hizam reciting Surat-al-Furqan in a way different to that of mine. Allah's Apostle had taught it to me (in a different way). So, I was about to quarrel with him (during the prayer) but I waited till he finished, then I tied his garment round his neck and seized him by it and brought him to Allah's Apostle and said, \"I have heard him reciting Surat-al-Furqan in a way different to the way you taught it to me.\" The Prophet ordered me to release him and asked Hisham to recite it. When he recited it, Allah s Apostle said, \"It was revealed in this way.\" He then asked me to recite it. When I recited it, he said, \"It was revealed in this way. The Qur'an has been revealed in seven different ways, so recite it in the way that is easier for you.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "hadith_no": "2462",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني مالك،‏.‏ وأخبرني يونس، عن ابن شهاب، أخبرني عبيد الله بن عبد الله بن عتبة، أن ابن عباس، أخبره عن عمر  رضى الله عنهم  قال حين توفى الله نبيه صلى الله عليه وسلم إن الأنصار اجتمعوا في سقيفة بني ساعدة، فقلت لأبي بكر انطلق بنا‏.‏ فجئناهم في سقيفة بني ساعدة‏.‏",
      "text_en": " Narrated `Umar:                     When Allah took away the soul of His Prophet at his death, the Ansar assembled In the shed of Bani Sa`ida. I said to Abu Bakr, \"Let us go.\" So, we come to them (i.e. to Ansar) at the shed of Bani Sa`ida. (See Hadith No. 19, Vol. 5 for details)",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، حدثنا يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن علقمة بن وقاص الليثي، قال سمعت عمر بن الخطاب  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The (reward of) deeds depend on intentions, and every person will get the reward according to what he intends. So, whoever migrated for Allah and His Apostle, then his migration will be for Allah and His Apostle, and whoever migrated for worldly benefits or for marrying a woman, then his migration will be for what he migrated for.\" (See Hadith No. 1, Vol. 1)",
      "chain": [
        "28531",
        "20012",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "2623",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن زيد بن أسلم، عن أبيه، سمعت عمر بن الخطاب  رضى الله عنه  يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه منه، وظننت أنه بائعه برخص، فسألت عن ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتره، وإن أعطاكه بدرهم واحد، فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to buy it from him, thinking that he would sell it cheap. When I asked the Prophet he said, \"Don't buy it, even if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is like a dog that swallows back its vomit.\"",
      "chain": [
        "30119",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2636",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا الحميدي، أخبرنا سفيان، قال سمعت مالكا، يسأل زيد بن أسلم قال سمعت أبي يقول، قال عمر  رضى الله عنه  حملت على فرس في سبيل الله، فرأيته يباع، فسألت رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا تشتر، ولا تعد في صدقتك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     Once I gave a horse (for riding) in Allah's Cause. Later I saw it being sold. I asked Allah's Apostle (whether I could buy it). He said, \"Don't buy it, for you should not get back what you have given in charity.\"",
      "chain": [
        "30418",
        "20005",
        "3"
      ]
    },
    {
      "hadith_no": "2641",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا الحكم بن نافع، أخبرنا شعيب، عن الزهري، قال حدثني حميد بن عبد الرحمن بن عوف، أن عبد الله بن عتبة، قال سمعت عمر بن الخطاب  رضى الله عنه  يقول إن أناسا كانوا يؤخذون بالوحى في عهد رسول الله صلى الله عليه وسلم، وإن الوحى قد انقطع، وإنما نأخذكم الآن بما ظهر لنا من أعمالكم، فمن أظهر لنا خيرا أمناه وقربناه، وليس إلينا من سريرته شىء، الله يحاسبه في سريرته، ومن أظهر لنا سوءا لم نأمنه ولم نصدقه، وإن قال إن سريرته حسنة‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     People were (sometimes) judged by the revealing of a Divine Inspiration during the lifetime of Allah's Apostle but now there is no longer any more (new revelation). Now we judge you by the deeds you practice publicly, so we will trust and favor the one who does good deeds in front of us, and we will not call him to account about what he is really doing in secret, for Allah will judge him for that; but we will not trust or believe the one who presents to us with an evil deed even if he claims that his intentions were good.",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10561",
        "4145",
        "3"
      ]
    },
    {
      "hadith_no": "2773",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو عاصم، حدثنا ابن عون، عن نافع، عن ابن عمر، أن عمر، رضى الله عنه وجد مالا بخيبر، فأتى النبي صلى الله عليه وسلم فأخبره، قال ‏\"‏ إن شئت تصدقت بها ‏\"‏‏.‏ فتصدق بها في الفقراء والمساكين وذي القربى والضيف‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar got some property in Khaibar and he came to the Prophet and informed him about it. The Prophet said to him, \"If you wish you can give it in charity.\" So `Umar gave it in charity (i.e. as an endowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and the guests.",
      "chain": [
        "20241",
        "11071",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2881",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن ابن شهاب، قال ثعلبة بن أبي مالك إن عمر بن الخطاب  رضى الله عنه  قسم مروطا بين نساء من نساء المدينة، فبقي مرط جيد فقال له بعض من عنده يا أمير المؤمنين أعط هذا ابنة رسول الله صلى الله عليه وسلم التي عندك‏.‏ يريدون أم كلثوم بنت علي‏.‏ فقال عمر أم سليط أحق‏.‏ وأم سليط من نساء الأنصار، ممن بايع رسول الله صلى الله عليه وسلم‏.‏ قال عمر فإنها كانت تزفر لنا القرب يوم أحد‏.‏ قال أبو عبد الله تزفر تخيط‏.‏",
      "text_en": " Narrated Tha`laba bin Abi Malik:                     `Umar bin Al-Khattab distributed some garments amongst the women of Medina. One good garment remained, and one of those present with him said, \"O chief of the believers! Give this garment to your wife, the (grand) daughter of Allah's Apostle.\" They meant Um Kulthum, the daughter of `Ali. `Umar said, Um Salit has more right (to have it).\" Um Salit was amongst those Ansari women who had given the pledge of allegiance to Allah's Apostle.' `Umar said, \"She (i.e. Um Salit) used to carry the water skins for us on the day of Uhud.\"",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "5004",
        "3"
      ]
    },
    {
      "hadith_no": "2904",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر  رضى الله عنه  قال كانت أموال بني النضير مما أفاء الله على رسوله صلى الله عليه وسلم مما لم يوجف المسلمون عليه بخيل ولا ركاب، فكانت لرسول الله صلى الله عليه وسلم خاصة، وكان ينفق على أهله نفقة سنته، ثم يجعل ما بقي في السلاح والكراع، عدة في سبيل الله‏.‏",
      "text_en": " Narrated `Umar:                     The properties of Bani An-Nadir which Allah had transferred to His Apostle as Fai Booty were not gained by the Muslims with their horses and camels. The properties therefore, belonged especially to Allah's Apostle who used to give his family their yearly expenditure and spend what remained thereof on arms and horses to be used in Allah's Cause.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "2970",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال سمعت مالك بن أنس، سأل زيد بن أسلم، فقال زيد سمعت أبي يقول، قال عمر بن الخطاب  رضى الله عنه  حملت على فرس في سبيل الله، فرأيته يباع، فسألت النبي صلى الله عليه وسلم آشتريه فقال ‏\"‏ لا تشتره، ولا تعد في صدقتك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse to be used in Allah's Cause, but later on I saw it being sold. I asked the Prophet whether I could buy it. He said, \"Don't buy it and don't take back your gift of charity.\"",
      "chain": [
        "30418",
        "20005",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3003",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب  رضى الله عنه  يقول حملت على فرس في سبيل الله فابتاعه  أو فأضاعه  الذي كان عنده، فأردت أن أشتريه، وظننت أنه بائعه برخص، فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتره وإن بدرهم، فإن العائد في هبته كالكلب يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated Aslam:                     I heard `Umar bin Al-Khattab saying, \"I gave a horse to be ridden in Allah's Cause and the person who got it intended to sell it or neglected it. So, I wanted to buy it as I thought he would sell it cheap. I consulted the Prophet who said, \"Do not buy it even if for one Dirham, because he who takes back his gift is like a dog swallowing its vomit.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3052",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن حصين، عن عمرو بن ميمون، عن عمر  رضى الله عنه  قال وأوصيه بذمة الله وذمة رسوله صلى الله عليه وسلم أن يوفى لهم بعهدهم، وأن يقاتل من ورائهم، ولا يكلفوا إلا طاقتهم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     `Umar (after he was stabbed), instructed (his would-be-successor) saying, \"I urge him (i.e. the new Caliph) to take care of those non-Muslims who are under the protection of Allah and His Apostle in that he should observe the convention agreed upon with them, and fight on their behalf (to secure their safety) and he should not over-tax them beyond their capability.\"",
      "chain": [
        "20040",
        "20469",
        "15097",
        "11382",
        "3"
      ]
    },
    {
      "hadith_no": "3059",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب  رضى الله عنه  استعمل مولى له يدعى هنيا على الحمى فقال يا هنى، اضمم جناحك عن المسلمين، واتق دعوة المظلوم، فإن دعوة المظلوم مستجابة، وأدخل رب الصريمة ورب الغنيمة، وإياى ونعم ابن عوف، ونعم ابن عفان، فإنهما إن تهلك ماشيتهما يرجعا إلى نخل وزرع، وإن رب الصريمة ورب الغنيمة إن تهلك ماشيتهما يأتني ببنيه فيقول يا أمير المؤمنين‏.‏ أفتاركهم أنا لا أبا لك فالماء والكلأ أيسر على من الذهب والورق، وايم الله، إنهم ليرون أني قد ظلمتهم، إنها لبلادهم فقاتلوا عليها في الجاهلية، وأسلموا عليها في الإسلام، والذي نفسي بيده لولا المال الذي أحمل عليه في سبيل الله ما حميت عليهم من بلادهم شبرا‏.‏",
      "text_en": " Narrated Aslam:                     `Umar bin Al-Khattab appointed a freed slave of his, called Hunai, manager of the Hima (i.e. a pasture devoted for grazing the animals of the Zakat or other specified animals). He said to him, \"O Hunai! Don't oppress the Muslims and ward off their curse (invocations against you) for the invocation of the oppressed is responded to (by Allah); and allow the shepherd having a few camels and those having a few sheep (to graze their animals), and take care not to allow the livestock of `Abdur-Rahman bin `Auf and the livestock of (`Uthman) bin `Affan, for if their livestock should perish, then they have their farms and gardens, while those who own a few camels and those who own a few sheep, if their livestock should perish, would bring their dependents to me and appeal for help saying, 'O chief of the believers! O chief of the believers!' Would I then neglect them? (No, of course). So, I find it easier to let them have water and grass rather than to give them gold and silver (from the Muslims' treasury). By Allah, these people think that I have been unjust to them. This is their land, and during the prelslamic period, they fought for it and they embraced Islam (willingly) while it was in their possession. By Him in Whose Hand my life is! Were it not for the animals (in my custody) which I give to be ridden for striving in Allah's Cause, I would not have turned even a span of their land into a Hima.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3125",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Aslam:                     `Umar said, \"Were it not for those Muslims who have not come to existence yet, I would have distributed (the land of) every town I conquer among the fighters as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3144",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، أن عمر بن الخطاب  رضى الله عنه  قال يا رسول الله إنه كان على اعتكاف يوم في الجاهلية، فأمره أن يفي به‏.‏ قال وأصاب عمر جاريتين من سبى حنين، فوضعهما في بعض بيوت مكة  قال  فمن رسول الله صلى الله عليه وسلم على سبى حنين، فجعلوا يسعون في السكك فقال عمر يا عبد الله، انظر ما هذا فقال من رسول الله صلى الله عليه وسلم على السبى‏.‏ قال اذهب فأرسل الجاريتين‏.‏ قال نافع ولم يعتمر رسول الله صلى الله عليه وسلم من الجعرانة ولو اعتمر لم يخف على عبد الله‏.‏ وزاد جرير بن حازم عن أيوب عن نافع عن ابن عمر قال من الخمس‏.‏ ورواه معمر عن أيوب عن نافع عن ابن عمر في النذر ولم يقل يوم‏.‏",
      "text_en": " Narrated Nafi`:                     `Umar bin Al-Khattab said, \"O Allah's Apostle! I vowed to observe I`tikaf for one day during the Prelslamic period.\" The Prophet ordered him to fulfill his vow. `Umar gained two lady captives from the war prisoners of Hunain and he left them in some of the houses at Mecca. When Allah's Apostle freed the captives of Hunain without ransom, they came out walking in the streets. `Umar said (to his son), \"O `Abdullah! See what is the matter.\" `Abdullah replied, \"Allah's Apostle has freed the captives without ransom.\" He said (to him), \"Go and set free those two slave girls.\" (Nafi` added:) Allah's Apostle did not perform the `Umra from Al-Jarana, and if he had performed the `Umra, it would not have been hidden from `Abdullah.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "3"
      ]
    },
    {
      "hadith_no": "3156",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال سمعت عمرا، قال كنت جالسا مع جابر بن زيد وعمرو بن أوس، فحدثهما بجالة، سنة سبعين  عام حج مصعب بن الزبير بأهل البصرة  عند درج زمزم قال كنت كاتبا لجزء بن معاوية عم الأحنف، فأتانا كتاب عمر بن الخطاب قبل موته بسنة فرقوا بين كل ذي محرم من المجوس‏.‏ ولم يكن عمر أخذ الجزية من المجوس‏.‏ حتى شهد عبد الرحمن بن عوف أن رسول الله صلى الله عليه وسلم أخذها من مجوس هجر‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     I was sitting with Jabir bin Zaid and `Amr bin Aus, and Bjalla was narrating to them in 70 A.H. the year when Mus`ab bin Az-Zubair was the leader of the pilgrims of Basra. We were sitting at the steps of Zamzam well and Bajala said, \"I was the clerk of Juz bin Muawiya, Al-Ahnaf's paternal uncle. A letter came from `Umar bin Al-Khattab one year before his death; and it was read:-- \"Cancel every marriage contracted among the Magians between relatives of close kinship (marriages that are regarded illegal in Islam: a relative of this sort being called Dhu-Mahram.)\" `Umar did not take the Jizya from the Magian infidels till `Abdur-Rahman bin `Auf testified that Allah's Apostle had taken the Jizya from the Magians of Hajar.",
      "chain": [
        "30026",
        "20005",
        "3"
      ]
    },
    {
      "hadith_no": "3162",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا أبو جمرة، قال سمعت جويرية بن قدامة التميمي، قال سمعت عمر بن الخطاب  رضى الله عنه  قلنا أوصنا يا أمير المؤمنين‏.‏ قال أوصيكم بذمة الله، فإنه ذمة نبيكم، ورزق عيالكم‏.‏",
      "text_en": " Narrated Juwairiya bin Qudama at-Tamimi:                     We said to `Umar bin Al-Khattab, Jo Chief of the believers! Advise us.\" He said, \"I advise you to fulfill Allah's Convention (made with the Dhimmis) as it is the convention of your Prophet and the source of the livelihood of your dependents (i.e. the taxes from the Dhimmis.) \"",
      "chain": [
        "20404",
        "20020",
        "11309",
        "11680",
        "3"
      ]
    },
    {
      "hadith_no": "3192",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وروى عيسى، عن رقبة، عن قيس بن مسلم، عن طارق بن شهاب، قال سمعت عمر  رضى الله عنه  يقول قام فينا النبي صلى الله عليه وسلم مقاما، فأخبرنا عن بدء الخلق حتى دخل أهل الجنة منازلهم، وأهل النار منازلهم، حفظ ذلك من حفظه، ونسيه من نسيه‏.‏",
      "text_en": "     Narrated 'Umar:                      One day the Prophet stood up amongst us for a long period and informed us about the beginning of creation (and talked about everything in detail) till he mentioned how the people of Paradise will enter their places and the people of Hell will enter their places. Some remembered what he had said, and some forgot it.",
      "chain": [
        "11386",
        "3680",
        "3"
      ]
    },
    {
      "hadith_no": "3227",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، عن سالم، عن أبيه، قال وعد النبي صلى الله عليه وسلم جبريل فقال إنا لا ندخل بيتا فيه صورة ولا كلب‏.‏",
      "text_en": " Narrated Salim's father:                     Once Gabriel promised the Prophet (that he would visit him, but Gabriel did not come) and later on he said, \"We, angels, do not enter a house which contains a picture or a dog.\"",
      "chain": [
        "30220",
        "20029",
        "3",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3445",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال سمعت الزهري، يقول أخبرني عبيد الله بن عبد الله، عن ابن عباس، سمع عمر  رضى الله عنه  يقول على المنبر سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تطروني كما أطرت النصارى ابن مريم، فإنما أنا عبده، فقولوا عبد الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     I heard the Prophet saying, \"Do not exaggerate in praising me as the Christians praised the son of Mary, for I am only a Slave. So, call me the Slave of Allah and His Apostle.\"",
      "chain": [
        "30418",
        "20005",
        "11013",
        "11004",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3460",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن طاوس، عن ابن عباس، قال سمعت عمر  رضى الله عنه  يقول قاتل الله فلانا، ألم يعلم أن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله اليهود، حرمت عليهم الشحوم، فجملوها فباعوها ‏\"‏‏.‏ تابعه جابر وأبو هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I heard `Umar saying, \"May Allah Curse so-and-so! Doesn't he know that the Prophet said, 'May Allah curse the Jews for, though they were forbidden (to eat) fat, they liquefied it and sold it. \"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11053",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3628",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة،‏.‏ حدثني بشر بن خالد، حدثنا محمد، عن شعبة، عن سليمان، سمعت أبا وائل، يحدث عن حذيفة، أن عمر بن الخطاب  رضى الله عنه  قال أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتنة فقال حذيفة أنا أحفظ كما قال‏.‏ قال هات إنك لجريء‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فتنة الرجل في أهله وماله وجاره تكفرها الصلاة والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليست هذه، ولكن التي تموج كموج البحر‏.‏ قال يا أمير المؤمنين لا بأس عليك منها، إن بينك وبينها بابا مغلقا‏.‏ قال يفتح الباب أو يكسر قال لا بل يكسر‏.‏ قال ذاك أحرى أن لا يغلق‏.‏ قلنا علم الباب قال نعم، كما أن دون غد الليلة، إني حدثته حديثا ليس بالأغاليط‏.‏ فهبنا أن نسأله، وأمرنا مسروقا، فسأله فقال من الباب قال عمر‏.‏",
      "text_en": " Narrated Hudhaifa:                     Once `Umar bin Al-Khattab said, said, \"Who amongst you remembers the statement of Allah's Apostle regarding the afflictions?\" Hudhaifa replied, \"I remember what he said exactly.\" `Umar said. \"Tell (us), you are really a daring man!'' Hudhaifa said, \"Allah's Apostle said, 'A man's afflictions (i.e. wrong deeds) concerning his relation to his family, his property and his neighbors are expiated by his prayers, giving in charity and enjoining what is good and forbidding what is evil.' \" `Umar said, \"I don't mean these afflictions but the afflictions that will be heaving up and down like waves of the sea.\" Hudhaifa replied, \"O chief of the believers! You need not fear those (afflictions) as there is a closed door between you and them.\" `Umar asked, \"Will that door be opened or broken?\" Hudhaifa replied, \"No, it will be broken.\" `Umar said, \"Then it is very likely that the door will not be closed again.\" Later on the people asked Hudhaifa, \"Did `Umar know what that door meant?\" He said. \"Yes, `Umar knew it as everyone knows that there will be night before the tomorrow morning. I narrated to `Umar an authentic narration, not lies.\" We dared not ask Hudhaifa; therefore we requested Masruq who asked him, \"What does the door stand for?\" He said, \"`Umar.\"",
      "chain": [
        "30160",
        "20276",
        "30126",
        "20278",
        "20020",
        "11005",
        "11353",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "3670",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال كان عمر بن الخطاب  رضى الله عنه  يدني ابن عباس، فقال له عبد الرحمن بن عوف إن لنا أبناء مثله‏.‏ فقال إنه من حيث تعلم‏.‏ فسأل عمر ابن عباس عن هذه الآية ‏{‏إذا جاء نصر الله والفتح‏}‏‏.‏ فقال أجل رسول الله صلى الله عليه وسلم أعلمه إياه‏.‏ قال ما أعلم منها إلا ما تعلم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     About Ibn `Abbas: `Umar bin Al-Khattab used to treat Ibn `Abbas very favorably `Abdur Rahman bin `Auf said to him. \"We also have sons that are equal to him (but you are partial to him.)\" `Umar said, \"It is because of his knowledge.\" Then `Umar asked Ibn `Abbas about the interpretation of the Verse:- 'When come the Help of Allah and the conquest (of Mecca) (110.1) Ibn `Abbas said. \"It portended the death of Allah's Apostle, which Allah had informed him of.\" `Umar said, \"I do not know from this Verse but what you know.\"",
      "chain": [
        "20282",
        "20020",
        "11419",
        "11050",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3886",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، قال قال عمر  رضى الله عنه  إن المشركين كانوا لا يفيضون من جمع حتى تشرق الشمس على ثبير، فخالفهم النبي صلى الله عليه وسلم فأفاض قبل أن تطلع الشمس‏.‏",
      "text_en": " Narrated `Umar:                     The pagans used not to leave Jam' (i.e. Muzdalifa) till the sun had risen on Thabir mountain. The Prophet contradicted them by leaving (Muzdalifa) before the sun rose.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "hadith_no": "3914",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، أن سالما، حدثه عن عبد الله بن عمر، قال ما سمعت عمر، لشىء قط يقول إني لأظنه كذا‏.‏ إلا كان كما يظن، بينما عمر جالس إذ مر به رجل جميل فقال لقد أخطأ ظني، أو إن هذا على دينه في الجاهلية، أو لقد كان كاهنهم، على الرجل، فدعي له، فقال له ذلك، فقال ما رأيت كاليوم استقبل به رجل مسلم، قال فإني أعزم عليك إلا ما أخبرتني‏.‏ قال كنت كاهنهم في الجاهلية‏.‏ قال فما أعجب ما جاءتك به جنيتك قال بينما أنا يوما في السوق جاءتني أعرف فيها الفزع، فقالت ألم تر الجن وإبلاسها ويأسها من بعد إنكاسها ولحوقها بالقلاص وأحلاسها قال عمر صدق، بينما أنا عند آلهتهم إذ جاء رجل بعجل فذبحه، فصرخ به صارخ، لم أسمع صارخا قط أشد صوتا منه يقول يا جليح، أمر نجيح رجل فصيح يقول لا إله إلا أنت‏.‏ فوثب القوم قلت لا أبرح حتى أعلم ما وراء هذا ثم نادى يا جليح، أمر نجيح، رجل فصيح، يقول لا إله إلا الله‏.‏ فقمت فما نشبنا أن قيل هذا نبي‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     I never heard `Umar saying about something that he thought it would be so-and-so, but he was quite right. Once, while `Umar was sitting, a handsome man passed by him, `Umar said, \"If I am not wrong, this person is still on his religion of the pre-lslamic period of ignorance or he was their foreteller. Call the man to me.\" When the man was called to him, he told him of his thought. The man said, \"I have never seen such a day on which a Muslim is faced with such an accusation.\" `Umar said, \"I am determined that you should tell me the truth.\" He said, \"I was a foreteller in the pre-lslamic period of ignorance.\" Then `Umar said, \"Tell me the most astonishing thing your female Jinn has told you of.\" He said, \"One-day while I was in the market, she came to me scared and said, 'Haven't you seen the Jinns and their despair and they were overthrown after their defeat (and prevented from listening to the news of the heaven) so that they (stopped going to the sky and) kept following camel-riders (i.e. 'Arabs)?\" `Umar said, \"He is right.\" and added, \"One day while I was near their idols, there came a man with a calf and slaughtered it as a sacrifice (for the idols). An (unseen) creature shouted at him, and I have never heard harsher than his voice. He was crying, 'O you bold evil-doer! A matter of success! An eloquent man is saying: None has the right to be worshipped except you (O Allah).' On that the people fled, but I said, 'I shall not go away till I know what is behind this.' Then the cry came again: 'O you bold evil-doer! A matter of success! An eloquent man is saying: None has the right to be worshipped except Allah.' I then went away and a few days later it was said, \"A prophet has appeared.\"",
      "chain": [
        "30220",
        "20029",
        "3",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3946",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا حماد  هو ابن زيد  عن يحيى، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الأعمال بالنية، فمن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه، ومن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     I heard the Prophet saying, \"The reward of deeds depends on the intentions, so whoever emigrated for the worldly benefits or to marry a woman, his emigration was for that for which he emigrated, but whoever emigrated for the Sake of Allah and His Apostle, his emigration is for Allah and His Apostle.\"",
      "chain": [
        "30175",
        "20022",
        "20031",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "3960",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن ابن جريج، قال أخبرني عبيد الله بن عمر، عن نافع يعني، عن ابن عمر، عن عمر بن الخطاب، رضى الله عنه قال كان فرض للمهاجرين الأولين أربعة آلاف في أربعة، وفرض لابن عمر ثلاثة آلاف وخمسمائة فقيل له هو من المهاجرين، فلم نقصته من أربعة آلاف فقال إنما هاجر به أبواه‏.‏ يقول ليس هو كمن هاجر بنفسه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar bin Al-Khattab fixed a grant of 4000 (Dirhams) for every Early Emigrant (i.e. Muhajir) and fixed a grant of 3500 (Dirhams) only for Ibn `Umar. Somebody said to `Umar, \"Ibn `Umar is also one of the Early Emigrants; why do you give him less than four-thousand?\" `Umar replied, \"His parents took him with them when they migrated, so he was not like the one who had migrated by himself.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن عبيد الله بن عبد الله، حدثني ابن عباس، عن عمر  رضى الله عنهم  لما توفي النبي صلى الله عليه وسلم قلت لأبي بكر انطلق بنا إلى إخواننا من الأنصار‏.‏ فلقينا منهم رجلان صالحان شهدا بدرا‏.‏ فحدثت عروة بن الزبير فقال هما عويم بن ساعدة، ومعن بن عدي‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar said, \"When the Prophet died I said to Abu Bakr, 'Let us go to our Ansari brethren.' We met two pious men from them, who had fought in the battle of Badr.\" When I mentioned this to `Urwa bin Az-Zubair, he said, \"Those two pious men were 'Uwaim bin Sa`ida and Manbin Adi.\"",
      "chain": [
        "20040",
        "20256",
        "20115",
        "11013",
        "11004",
        "17",
        "3"
      ]
    }
  ],
  "total_hadiths": 376
}