{
  "id": "30007",
  "name": "Ahmad bin Hanbal أحمد بن حنبل",
  "full_name": "Ahmad bin Hanbal أحمد بن حنبل",
  "grade": "3rd Century AH [10th generation] [Hanbali]",
  "biography": {
    "birth": {
      "date_hijri": "164",
      "date_gregorian": "780",
      "date_display": [
        "164 AH",
        "780 CE"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "855",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad",
      "Syria",
      "Hijaz"
    ],
    "area_of_interest": [
      "Fiqh",
      "Hadith",
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]",
      "Tafsir/Quran",
      "Aqeedah"
    ],
    "tags": [
      "Imam",
      "Hafiz",
      "al-Shaybani",
      "al-Murwazi",
      "Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "38291",
      "name": "'Abdullah bin Ahmed bin Hanbal عبد الله بن أحمد بن محمد بن حنبل",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20448",
      "name": "'Ali bin 'Ayyash علي بن عياش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30504",
      "name": "Da'ud bin 'Amr bin Zuhayr داود بن عمرو الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30503",
      "name": "Khlf bin Hisham bin Th'lb خلف بن هشام بن ثعلب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38032",
      "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38181",
      "name": "al-Husain bin Mnswr bin Ja'far الحسين بن منصور بن جعفر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36664",
      "name": "Muhammad bin Yahya bin Abi Samina محمد بن يحيى بن أبي سمينة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38291",
      "name": "'Abdullah bin Ahmed bin Hanbal عبد الله بن أحمد بن محمد بن حنبل",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "25264",
      "name": "Muhammad bin Ziyad al-Yshkry محمد بن زياد اليشكري الطحان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "471",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرني يونس بن يزيد، عن ابن شهاب، حدثني عبد الله بن كعب بن مالك، أن كعب بن مالك، أخبره أنه، تقاضى ابن أبي حدرد دينا له عليه، في عهد رسول الله صلى الله عليه وسلم في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما رسول الله صلى الله عليه وسلم حتى كشف سجف حجرته ونادى ‏\"‏ يا كعب بن مالك، يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ فأشار بيده أن ضع الشطر من دينك‏.‏ قال كعب قد فعلت يا رسول الله‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     During the lifetime of Allah's Apostle I asked Ibn Abi Hadrad in the mosque to pay the debts which he owed to me and our voices grew so loud that Allah's Apostle heard them while he was in his house. So he came to us after raising the curtain of his room. The Prophet said, \"O Ka`b bin Malik!\" I replied, \"Labaik, O Allah's Apostle.\" He gestured with his hand to me to reduce the debt to one half. I said, \"O Allah's Apostle have done it.\" Allah's Apostle said (to Ibn Hadrad), \"Get up and pay it.\"",
      "chain": [
        "30007",
        "20029",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "698",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال نمت عند ميمونة والنبي صلى الله عليه وسلم عندها تلك الليلة، فتوضأ ثم قام يصلي، فقمت على يساره، فأخذني فجعلني عن يمينه، فصلى ثلاث عشرة ركعة، ثم نام حتى نفخ  وكان إذا نام نفخ  ثم أتاه المؤذن، فخرج فصلى ولم يتوضأ‏.‏ قال عمرو فحدثت به بكيرا فقال حدثني كريب بذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of (my aunt) Maimuna and the Prophet was there on that night. He performed ablution and stood up for the prayer. I joined him and stood on his left side but he drew me to his right and prayed thirteen rak`at and then slept till I heard his breath sounds. And whenever he slept, he used to breathe with audible sounds. The Mu'adh-dhin came to the Prophet and he went out and prayed the morning prayer) without repeating the ablution.",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "902",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر بن الزبير، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان الناس ينتابون يوم الجمعة من منازلهم والعوالي، فيأتون في الغبار، يصيبهم الغبار والعرق، فيخرج منهم العرق، فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي، فقال النبي صلى الله عليه وسلم ‏\"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) The people used to come from their abodes and from Al-`Awali (i.e. outskirts of Medina up to a distance of four miles or more from Medina). They used to pass through dust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. One of them came to Allah's Apostle who was in my house. The Prophet said to him, \"I wish that you keep yourself clean on this day of yours (i.e. take a bath).\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511"
      ]
    },
    {
      "hadith_no": "1261",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، أن أيوب، أخبره قال سمعت ابن سيرين، يقول جاءت أم عطية  رضى الله عنها  امرأة من الأنصار من اللاتي بايعن، قدمت البصرة، تبادر ابنا لها فلم تدركه  فحدثتنا قالت دخل علينا النبي صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا ألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ ولم يزد على ذلك، ولا أدري أى بناته‏.‏ وزعم أن الإشعار الففنها فيه، وكذلك كان ابن سيرين يأمر بالمرأة أن تشعر ولا تؤزر‏.‏",
      "text_en": " Narrated Ibn Seereen:                     Um 'Atiyya (an Ansari woman who gave the pledge of allegiance to the Prophet ) came to Basra to visit her son, but she could not find him. She narrated to us, \"The Prophet came to us while we were giving bath to his (dead) daughter, he said: 'Wash her three times, five times or more, if you think it necessary, with water and Sidr, and last of all put camphor, and when you finish, notify me.' \" Um 'Atiyya added, \"After finishing, we informed him and he gave us his waist sheet and told us to shroud her in it and did not say more than that.\"",
      "chain": [
        "30007",
        "20029",
        "11070",
        "11015",
        "11035"
      ]
    },
    {
      "hadith_no": "1604",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عام الفتح من كداء أعلى مكة‏.‏ قال هشام وكان عروة يدخل على كلتيهما من كداء وكدا، وأكثر ما يدخل من كداء، وكانت أقربهما إلى منزله‏.‏",
      "text_en": " Narrated `Aisha:                     In the year of the conquest of Mecca, the Prophet entered Mecca from Kada' at the higher place of Mecca. (Hisham, a sub-narrator said, \" `Urwa used to enter (Mecca) from both Kada' and Kuda and he often entered through Kada' which was nearer to his dwelling place.)\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1618",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا أبي، حدثنا إبراهيم، عن الحجاج بن حجاج، عن قتادة، عن عبد الله بن أبي عتبة، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليحجن البيت وليعتمرن بعد خروج يأجوج ومأجوج ‏\"‏‏.‏ تابعه أبان وعمران عن قتادة‏.‏ وقال عبد الرحمن عن شعبة قال ‏\"‏ لا تقوم الساعة حتى لا يحج البيت ‏\"‏‏.‏ والأول أكثر، سمع قتادة عبد الله وعبد الله أبا سعيد‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said \"The people will continue performing the Hajj and `Umra to the Ka`ba even after the appearance of Gog and Magog.\" Narrated Shu`ba extra: The Hour (Day of Judgment) will not be established till the Hajj (to the Ka`ba) is abandoned.",
      "chain": [
        "30007",
        "11051",
        "11019",
        "11598",
        "38"
      ]
    },
    {
      "hadith_no": "3226",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن بكير بن الأشج، حدثه أن بسر بن سعيد حدثه أن زيد بن خالد الجهني  رضى الله عنه  حدثه ومع، بسر بن سعيد عبيد الله الخولاني الذي كان في حجر ميمونة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حدثهما زيد بن خالد أن أبا طلحة حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ‏\"‏‏.‏ قال بسر فمرض زيد بن خالد، فعدناه فإذا نحن في بيته بستر فيه تصاوير، فقلت لعبيد الله الخولاني ألم يحدثنا في التصاوير فقال إنه قال ‏\"‏ إلا رقم في ثوب ‏\"‏‏.‏ ألا سمعته قلت لا‏.‏ قال بلى قد ذكره‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     That Zaid bin Khalid Al-Juhani narrated to him something in the presence of Sa`id bin 'Ubaidullah Al- Khaulani who was brought up in the house of Maimuna the wife of the Prophet. Zaid narrated to them that Abu Talha said that the Prophet said, \"The Angels (of Mercy) do not enter a house wherein there is a picture.\" Busr said, \"Later on Zaid bin Khalid fell ill and we called on him. To our surprise we saw a curtain decorated with pictures in his house. I said to Ubaidullah Al-Khaulani, \"Didn't he (i.e. Zaid) tell us about the (prohibition of) pictures?\" He said, \"But he excepted the embroidery on garments. Didn't you hear him?\" I said, \"No.\" He said, \"Yes, he did.\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "4260",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الغفار بن داود، حدثنا يعقوب بن عبد الرحمن، ح وحدثني أحمد، حدثنا ابن وهب، قال أخبرني يعقوب بن عبد الرحمن الزهري، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  قال قدمنا خيبر، فلما فتح الله عليه الحصن ذكر له جمال صفية بنت حيى بن أخطب، وقد قتل زوجها وكانت عروسا، فاصطفاها النبي صلى الله عليه وسلم لنفسه، فخرج بها، حتى بلغنا سد الصهباء حلت، فبنى بها رسول الله صلى الله عليه وسلم، ثم صنع حيسا في نطع صغير، ثم قال لي ‏\"‏ آذن من حولك ‏\"‏‏.‏ فكانت تلك وليمته على صفية، ثم خرجنا إلى المدينة، فرأيت النبي صلى الله عليه وسلم يحوي لها وراءه بعباءة، ثم يجلس عند بعيره، فيضع ركبته، وتضع صفية رجلها على ركبته حتى تركب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We arrived at Khaibar, and when Allah helped His Apostle to open the fort, the beauty of Safiya bint Huyai bin Akhtaq whose husband had been killed while she was a bride, was mentioned to Allah's Apostle. The Prophet selected her for himself, and set out with her, and when we reached a place called Sidd-as-Sahba,' Safiya became clean from her menses then Allah's Apostle married her. Hais (i.e. an 'Arabian dish) was prepared on a small leather mat. Then the Prophet said to me, \"I invite the people around you.\" So that was the marriage banquet of the Prophet and Safiya. Then we proceeded towards Medina, and I saw the Prophet, making for her a kind of cushion with his cloak behind him (on his camel). He then sat beside his camel and put his knee for Safiya to put her foot on, in order to ride (on the camel).",
      "chain": [
        "30235",
        "20185",
        "30007",
        "20029",
        "11209",
        "19"
      ]
    },
    {
      "hadith_no": "4305",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، عن عمرو، عن ابن أبي هلال، قال وأخبرني نافع، أن ابن عمر، أخبره أنه، وقف على جعفر يومئذ وهو قتيل، فعددت به خمسين بين طعنة وضربة، ليس منها شىء في دبره‏.‏ يعني في ظهره‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar informed me that on the day (of Mu'tah) he stood beside Ja`far who was dead (i.e. killed in the battle), and he counted fifty wounds in his body, caused by stabs or strokes, and none of those wounds was in his back. `Abdullah bin `Umar said, \"Allah's Apostle appointed Zaid bin Haritha as the commander of the army during the Ghazwa of Mu'tah and said, \"If Zaid is martyred, Ja`far should take over his position, and if Ja`far is martyred, `Abdullah bin Rawaha should take over his position.' \" `Abdulla-h bin `Umar further said, \"I was present amongst them in that battle and we searched for Ja`far bin Abi Talib and found his body amongst the bodies of the martyred ones, and found over ninety wounds over his body, caused by stabs or shots (of arrows).",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4513",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن الحسن، حدثنا أحمد بن محمد بن حنبل بن هلال، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة‏.‏",
      "text_en": " Narrated Buraida:                     That he fought sixteen Ghazawat with Allah''s Apostle.",
      "chain": [
        "30292",
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4694",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني أحمد، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الحميد  هو ابن كرديد صاحب الزيادي  سمع أنس بن مالك  رضى الله عنه  قال أبو جهل ‏{‏اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم‏}‏ فنزلت ‏{‏وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You, then rain down on us a shower of stones from the sky or bring on us a painful torment.\" So Allah revealed:-- \"But Allah would not punish them while you were amongst them, nor He will punish them while they seek (Allah's) forgiveness...\" (8.33) And why Allah should not punish them while they turn away (men) from Al- Masjid-al-Haram (the Sacred Mosque of Mecca)...\" (8.33-34)",
      "chain": [
        "30007",
        "30150",
        "20286",
        "20020",
        "19"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثني ابن وهب، قال أخبرني يونس، قال أحمد حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن كعب، قال أخبرني عبد الله بن كعب  وكان قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أن أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك بعض مالك، فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik talking about the Verse:-- 'And to the three (He also forgave) who remained behind.' (9.118) saying in the last portion of his talk, \"(I said), 'As a part (sign) of my repentance, I would like to give up all my property in the cause of Allah and His Apostle,' The Prophet said to me, 'Keep some of your wealth as it is good for you.\" (To the three (He also forgave) who remained behind till for them the earth, vast as it is, was straitened...\" (9.118)",
      "chain": [
        "30226",
        "20029",
        "20475",
        "30007",
        "11716",
        "20475",
        "11013",
        "1134",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4877",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت ما رأيت رسول الله صلى الله عليه وسلم ضاحكا حتى أرى منه لهواته، إنما كان يتبسم‏.‏         قالت وكان إذا رأى غيما أو ريحا عرف في وجهه‏.‏ قالت يا رسول الله إن الناس إذا رأوا الغيم فرحوا، رجاء أن يكون فيه المطر، وأراك إذا رأيته عرف في وجهك الكراهية‏.‏ فقال ‏\"‏ يا عائشة ما يؤمني أن يكون فيه عذاب عذب قوم بالريح، وقد رأى قوم العذاب فقالوا ‏{‏هذا عارض ممطرنا‏}‏‏\"‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet), I never saw Allah's Apostle laughing loudly enough to enable me to see his uvula, but he used to smile only. And whenever he saw clouds or winds, signs of deep concern would appear on his face. I said, \"O Allah's Apostle! When people see clouds they usually feel happy, hoping that it would rain, while I see that when you see clouds, one could notice signs of dissatisfaction on your face.\" He said, \"O `Aisha! What is the guarantee for me that there will be no punishment in it, since some people were punished with a wind? Verily, some people saw (received) the punishment, but (while seeing the cloud) they said, 'This cloud will give us rain.' \"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "20390",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "5161",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال لنا أحمد بن حنبل حدثنا يحيى بن سعيد، عن سفيان، حدثني حبيب، عن سعيد، عن ابن عباس، حرم من النسب سبع، ومن الصهر سبع‏.‏ ثم قرأ ‏{‏حرمت عليكم أمهاتكم‏}‏ الآية‏.‏ وجمع عبد الله بن جعفر بين ابنة علي وامرأة علي‏.‏ وقال ابن سيرين لا بأس به‏.‏ وكرهه الحسن مرة ثم قال لا بأس به‏.‏ وجمع الحسن بن الحسن بن علي بين ابنتى عم في ليلة، وكرهه جابر بن زيد للقطيعة، وليس فيه تحريم لقوله تعالى ‏{‏وأحل لكم ما وراء ذلكم‏}‏ وقال عكرمة عن ابن عباس إذا زنى بأخت امرأته لم تحرم عليه امرأته‏.‏ ويروى عن يحيى الكندي عن الشعبي وأبي جعفر، فيمن يلعب بالصبي إن أدخله فيه، فلا يتزوجن أمه، ويحيى هذا غير معروف، لم يتابع عليه‏.‏ وقال عكرمة عن ابن عباس إذا زنى بها لم تحرم عليه امرأته‏.‏ ويذكر عن أبي نصر أن ابن عباس حرمه‏.‏ وأبو نصر هذا لم يعرف بسماعه من ابن عباس‏.‏ ويروى عن عمران بن حصين وجابر بن زيد والحسن وبعض أهل العراق تحرم عليه‏.‏ وقال أبو هريرة لا تحرم حتى يلزق بالأرض يعني يجامع‏.‏ وجوزه ابن المسيب وعروة والزهري‏.‏ وقال الزهري قال علي لا تحرم‏.‏ وهذا مرسل‏.‏",
      "text_en": "",
      "chain": [
        "30007",
        "20031",
        "20012",
        "11276",
        "11168"
      ]
    },
    {
      "hadith_no": "7509",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد، حدثنا محمد بن أبي بكر المقدمي، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال جاء زيد بن حارثة يشكو فجعل النبي صلى الله عليه وسلم يقول ‏\"‏ اتق الله، وأمسك عليك زوجك ‏\"‏‏.‏ قالت عائشة لو كان رسول الله صلى الله عليه وسلم كاتما شيئا لكتم هذه‏.‏ قال فكانت زينب تفخر على أزواج النبي صلى الله عليه وسلم تقول زوجكن أهاليكن، وزوجني الله تعالى من فوق سبع سموات‏.‏ وعن ثابت ‏{‏وتخفي في نفسك ما الله مبديه وتخشى الناس‏}‏ نزلت في شأن زينب وزيد بن حارثة‏.‏",
      "text_en": " Narrated Anas:                     Zaid bin Haritha came to the Prophet complaining about his wife. The Prophet kept on saying (to him), \"Be afraid of Allah and keep your wife.\" Aisha said, \"If Allah's Apostle were to conceal anything (of the Qur'an he would have concealed this Verse.\" Zainab used to boast before the wives of the Prophet and used to say, \"You were given in marriage by your families, while I was married (to the Prophet) by Allah from over seven Heavens.\" And Thabit recited, \"The Verse:-- 'But (O Muhammad) you did hide in your heart that which Allah was about to make manifest, you did fear the people,' (33.37) was revealed in connection with Zainab and Zaid bin Haritha.\"",
      "chain": [
        "30007",
        "30161",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو الطاهر، وحرملة بن يحيى، وأحمد بن عيسى، قال أحمد حدثنا وقال الآخران، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah said:                      I have been commanded to fight against people so long as they do not declare that there is no god but Allah, and he who professed it was guaranteed the protection of his property and life on my behalf except for the right affairs rest with Allah.",
      "chain": [
        "30487",
        "30227",
        "30007",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، وسريج بن يونس، قالا حدثنا هشيم، أخبرنا داود بن أبي هند، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بوادي الأزرق فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ فقالوا هذا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى - عليه السلام - هابطا من الثنية وله جؤار إلى الله بالتلبية ‏\"‏ ‏.‏ ثم أتى على ثنية هرشى ‏.‏ فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى قال ‏\"‏ كأني أنظر إلى يونس بن متى - عليه السلام - على ناقة حمراء جعدة عليه جبة من صوف خطام ناقته خلبة وهو يلبي ‏\"‏ ‏.‏ قال ابن حنبل في حديثه قال هشيم يعني ليفا ‏.‏",
      "text_en": " Abu al-'Aliya narrated it on the authority of Ibn 'Abbas that the Messenger of Allah (may peace be upon him) passed through the valley of Azraq, and he asked:                      Which valley is this? They said: This is the valley of Azraq, and he observed: (I perceive) as if I am seeing Moses (peace be upon him) coming down from the mountain track, and he is calling upon Allah loudly (saying: Here I am! at your service! ). Then he came to the mountain track of Harsha. He (the Holy Prophet) said: Which is this mountain track? They said: It is the mountain track of Harsha. He observed (I feel) as If I am seeing Yunus (Jonah-peace be upon him) son of Matta on a well- built red dromedary, with a cloak of wool around him and the rein of his dromedary is made of the fibres of date-palm, and he is calling upon Allah (saying: Here I am! at your service, my Lord! ). Ibn Hanbal said in the hadith narrated by him: Hushaim said that the meaning of khulba was fibre of date-palm.",
      "chain": [
        "30007",
        "30251",
        "20468",
        "11585",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "541",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس، عن عمرو بن العاص، قال سمعت رسول الله صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ ألا إن آل أبي - يعني فلانا - ليسوا لي بأولياء إنما وليي الله وصالح المؤمنين ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. 'As reported:                      I heard it from the Messenger of Allah (may peace be upon him) quite audibly and not secretly: Behold! the posterity of my fathers, that is, so and so, are not my friends. Verily Allah and the pious believers are my friends.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "hadith_no": "502",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا معتمر بن سليمان، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يعرض راحلته وهو يصلي إليها ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Apostle of Allah (may peace be upon him) used to place his camel (towards the Ka'ba) and said prayer in its direction.",
      "chain": [
        "30007",
        "20288",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، عن الحكم، عن مجاهد، عن أبي معمر، عن عبد الله، - قال شعبة - رفعه مرة - أن أميرا أو رجلا سلم تسليمتين فقال عبد الله أنى علقها",
      "text_en": " 'Abdullah reported:                      An Amir or a person pronounced taslim twice. 'Abdullah said: Where did he get this sunnah?",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11069",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن ورقاء، عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏ وحدثنيه محمد بن حاتم وابن رافع قالا حدثنا شبابة حدثني ورقاء بهذا الإسناد ‏.‏",
      "text_en": " Abu Huraira reported the Apostle of Allah (may peace be upon him) as saying:                      When the prayer commences then there is no prayer (valid), but the obligatory prayer. This hadith has been narrated by Warqa' with the same chain of transmitters.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "20363",
        "11081",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2880",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حرملة بن يحيى، وأحمد بن عيسى، قال أحمد حدثنا وقال، حرملة أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن عبيد الله بن عبد الله بن عمر، أخبره عن عبد الله بن عمر، - رضى الله عنهما - أنه قال بات رسول الله صلى الله عليه وسلم بذي الحليفة مبدأه وصلى في مسجدها ‏.‏",
      "text_en": " 'Abdullah b. 'Umar (Allah be pleased with them) reported that the Mes- senger of Allah (may peace be upon him) spent the night at Dhu'l-Hulaifa while com- mencing (the rites of) Pilgrimage and he observed prayer in the mosque.",
      "chain": [
        "30487",
        "30227",
        "30007",
        "30487",
        "20029",
        "20475",
        "11013",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "3155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن المثنى، قالا حدثنا عبد الله بن نمير، ح وحدثنا سعيد بن يحيى الأموي، حدثني أبي قالا، جميعا حدثنا يحيى بن سعيد، عن عبد الله بن، أبي سلمة عن عبد الله بن عبد الله بن عمر، عن أبيه، قال غدونا مع رسول الله صلى الله عليه وسلم من منى إلى عرفات منا الملبي ومنا المكبر ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them). He said:                      As we proceeded in the morning along with AUbs Messenger (may peace be upon him) from Mina to 'Arafat, some of us prounced Talbiya, and some pronounced Takbir (Allah-o-Akbar).",
      "chain": [
        "30007",
        "30170",
        "20331",
        "30254",
        "20367",
        "11062",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا محمد بن سلمة، عن أبي عبد الرحيم، عن زيد، بن أبي أنيسة عن يحيى بن الحصين، عن أم الحصين، جدته قالت حججت مع رسول الله صلى الله عليه وسلم حجة الوداع فرأيت أسامة وبلالا وأحدهما آخذ بخطام ناقة النبي صلى الله عليه وسلم والآخر رافع ثوبه يستره من الحر حتى رمى جمرة العقبة ‏.‏ قال مسلم واسم أبي عبد الرحيم خالد بن أبي يزيد وهو خال محمد بن سلمة روى عنه وكيع وحجاج الأعور ‏.‏",
      "text_en": " Umm al-Husain (Allah be pleased with her) reported:                      I performed Hajj along with Allah's Messenger (may peace be upon him) on the occasion of the Farewell Pilgrimage and saw Usama and Bilal (too), one of whom had caught hold of the lose string of the she-camel of Allah's Apostle (may peace be upon him) while the other one was raising his cloth (over his head) protecting him from the heat, till he flung pebbles at Jamrat al-'Aqaba.",
      "chain": [
        "30007",
        "20672",
        "11340",
        "19143"
      ]
    },
    {
      "hadith_no": "3287",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني أبو الطاهر، وحرملة بن يحيى، وأحمد بن عيسى، قال أحمد حدثنا وقال، الآخران أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، بهذا الإسناد قالت طمثت صفية بنت حيى زوج النبي صلى الله عليه وسلم في حجة الوداع بعد ما أفاضت طاهرا بمثل حديث الليث ‏.‏",
      "text_en": " This hadith is narrated (from 'A'isha) on the authority of Ibn Shihab with the same chain of transmitters (and the words are):                      Safiyyah bint Huyayy, the wife of Allah's Apostle (may peace be upon him), entered the period of menses at the occasion of the Farewell Pilgrimage after she had performed Tawaf Ifada in the state of cleanliness; the rest of the hadith is the same.",
      "chain": [
        "30487",
        "30227",
        "30007",
        "20029",
        "20475"
      ]
    },
    {
      "hadith_no": "4044",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، وزهير بن حرب، - واللفظ لزهير - قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم عامل أهل خيبر بشطر ما يخرج منها من ثمر أو زرع ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) contracted with the people of Khaibar the (trees) on the condition that he would have half the produce in fruits and harvest.",
      "chain": [
        "30007",
        "30022",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4470",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن المثنى، - واللفظ لأحمد - قالا حدثنا عبد الرحمن، بن مهدي عن سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قام فينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ والذي لا إله غيره لا يحل دم رجل مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا ثلاثة نفر التارك الإسلام المفارق للجماعة أو الجماعة - شك فيه أحمد - والثيب الزاني والنفس بالنفس ‏\"‏ ‏.‏ قال الأعمش فحدثت به، إبراهيم فحدثني عن الأسود، عن عائشة، بمثله ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      Allah's Messenger (may peace be upon him) stood up and said: By Him besides Whom there is no god but He, the blood of a Muslim who bears the testimony that there is no god but Allah, and I am His Messenger, may be lawfully shed only in case of three persons: the one who abandons Islam, and deserts the community [Ahmad, one of the narrators, is doubtful whether the Holy Prophet (may peace be upon him) used the word li'l-jama'ah or al-jama'ah), and the married adulterer, and life for life.",
      "chain": [
        "30007",
        "30170",
        "20033",
        "20012",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "4673",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن رافع، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما قرية أتيتموها وأقمتم فيها فسهمكم فيها وأيما قرية عصت الله ورسوله فإن خمسها لله ولرسوله ثم هي لكم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      If you come to a township (which has surrendered without a formal war) and stay therein, you have a share (that will be in the form of an award) in (the properties obtained from) it. If a township disobeys Allah and His Messenger (and actually fights against the Muslims) one-fifth of the booty seized therefrom is for Allah and His Apostle and the rest is for you.",
      "chain": [
        "30007",
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4799",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، أنه قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة ‏.‏",
      "text_en": " It has been narrated by Buraida who heard it from his father that he joined the Messenger of Allah (may peace be upon him) in sixteen military campaigns",
      "chain": [
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أحمد بن حنبل، حدثنا سليمان بن داود، حدثنا أبو عوانة، حدثنا الحكم، وأبو بشر عن ميمون بن مهران، عن ابن عباس، أن رسول الله صلى الله عليه وسلم نهى عن كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Messenger (may peace be upon him) forbade (the eating) of all the fanged beasts of prey, and of all the birds having talons.",
      "chain": [
        "30007",
        "30584",
        "20469",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5106",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن أبي بشر، ح وحدثنا أحمد بن حنبل، حدثنا هشيم، قال أبو بشر أخبرنا عن ميمون بن مهران، عن ابن عباس، قال نهى ح",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Abbas through a different chain of transmitters.",
      "chain": [
        "30399",
        "20468",
        "11419",
        "30007",
        "20468",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5566",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني سريج بن يونس، حدثنا يحيى بن زكرياء بن أبي زائدة، عن أبيه، حوحدثني إبراهيم بن موسى، حدثنا ابن أبي زائدة، ح وحدثنا أحمد بن حنبل، حدثنا يحيى،بن زكرياء أخبرني أبي، عن مصعب بن شيبة، عن صفية بنت شيبة، عن عائشة، قالت خرجالنبي صلى الله عليه وسلم ذات غداة وعليه مرط مرحل من شعر أسود ‏.‏",
      "text_en": " A'isha reported that Allah's Apostle (may peace be upon him) went out one morning wearing a blanket made of (camel's or sheep's) black hair with patterns of camel saddles upon it.",
      "chain": [
        "30251",
        "20366",
        "30007",
        "10658",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5600",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أحمد بن حنبل، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا إسماعيل، - يعنون ابن علية - عن عبد العزيز بن صهيب، عن أنس، عن النبي صلى اللهعليه وسلم بهذا ولم يذكر في الحديث محمد رسول الله ‏.‏",
      "text_en": " This hadith nas been reported on the authority of Anas through another chain of transmitters but there is no mention of the words (Mubamrnad, Messenger of Allah) in it.",
      "chain": [
        "30007",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5727",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن حنبل، وزهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، ومحمد بن بشار قالوا حدثنا يحيى بن سعيد، عن عبيد الله، أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم غير اسم عاصية وقال ‏\"‏ أنت جميلة ‏\"‏ ‏.‏ قال أحمد مكان أخبرني عن ‏.‏",
      "text_en": " Ibn 'Umar reported that Allah's Messenger (may peace be upon him) changed the name of 'Asiya (Disobedient) and said:                      You are Jamila (i. e. good and handsome). Ahmad (one of the narrators) narrated it with a slight variation of wording.",
      "chain": [
        "30007",
        "30022",
        "30170",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5734",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأحمد بن حنبل، وأبو بكر بن أبي شيبة - واللفظ لأحمد - قال الأشعثي أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أخنع اسم عند الله رجل تسمى ملك الأملاك ‏\"‏ ‏.‏ زاد ابن أبي شيبة في روايته ‏\"‏ لا مالك إلا الله عز وجل ‏\"‏ ‏.‏ قال الأشعثي قال سفيان مثل شاهان شاه ‏.‏ وقال أحمد بن حنبل سألت أبا عمرو عن أخنع فقال أوضع ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The vilest name in Allah's sight is Malik al-Amidh (King of Kings). The narration transmitted on the authority of Shaiba (contains these words): There is no king but Allah, the Exalted and Glorious. Sufyan said: Similarly, the word Shahinshah (is also the vilest appellation). Ahmad b. Hanbal said: I asked Abu 'Amr about the meaning of Akhna. He said: The vilest.",
      "chain": [
        "30465",
        "30007",
        "20005",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6021",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأبو طاهر وأحمد بن عيسى قال أحمد حدثنا  وقال الآخران، أخبرنا ابن وهب، أخبرني مخرمة، عن أبيه، عن نافع، قال كان ابن عمر إذا استجمر استجمر بالألوة غير مطراة وبكافور يطرحه مع الألوة ثم قال هكذا كان يستجمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' reported that when Ibn Umar wanted fumigation he got it from aloeswood without mixing anything with it, or he put camphor along with aloeswood and then said:                      This is how Allah's Messenger (may peace be upon him) fumigated.",
      "chain": [
        "30492",
        "30007",
        "20029",
        "11014"
      ]
    },
    {
      "hadith_no": "6153",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه أحمد بن حنبل، وزهير بن حرب، جميعا عن إسماعيل، - واللفظ لأحمد - قالا حدثنا إسماعيل بن إبراهيم، حدثنا عبد العزيز، عن أنس، قال لما قدم رسول الله صلى الله عليه وسلم المدينة أخذ أبو طلحة بيدي فانطلق بي إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أنسا غلام كيس فليخدمك ‏.‏ قال فخدمته في السفر والحضر والله ما قال لي لشىء صنعته لم صنعت هذا هكذا ولا لشىء لم أصنعه لم لم تصنع هذا هكذا",
      "text_en": " Anas reported:                      When Allah's Messenger (may peace be upon him) came to Medina, Abla Talha took hold of my hand and brought me to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, Anas is a prudent young boy, and he will serve you. He (Anas) said: I served him in journey and at home, but, by Allah, he never asked me about a thing which I did as to why I did so, nor about a thing which I did not do as to why I had not done that.",
      "chain": [
        "30007",
        "30022",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6409",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا سفيان بن عيينة، حدثني عبيد الله بن أبي يزيد، عن نافع بن جبير، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال لحسن ‏\"‏ اللهم إني أحبه فأحبه وأحبب من يحبه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying to Hasan:                      O Allah, behold, I love him. Thou too love him and love one who loves him.",
      "chain": [
        "30007",
        "20005",
        "11258",
        "11059",
        "13"
      ]
    },
    {
      "hadith_no": "6462",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن حنبل، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه  أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي رضى الله عنهما لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال له هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى تبلغ نفسي إن علي بن أبي طالب خطب بنت أبي جهل على فاطمة فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وإني أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فأوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " (Imam Zain-ul-'Abidin) 'Ali b. Husain reported that when they came to Medina from Yazid b. Mu'awiya after the martyrdom of Husain b. 'Ali (Allah be pleased with him) Miswar b. Makhramah met him and said to him:                      Is there any work for me which you ask me to do? I said to him: No. He again said to me: Would you not give me the sword of Allah's Messenger (may peace be upon him) for I fear that the people may snatch it from you? By Allah, if you give that to me, no one would be able to take it away, so long as there is life in me. Verily 'Ali b. Abi Talib sent a proposal of marriage to the daughter of Abu Jahl in spite of (the fact that his wife) Fatima (had been living in his house). Thereupon I heard Allah's Messenger (may peace be upon him) say while addressing the people on the pulpit. I was adolescing in those days. He said: Fatima is a part of me and I fear that she may be put to trial in regard to religion. He then made a mention of his son-in law who had been from the tribe of 'Abd Shams and praised his behaviour as a son-in-law and said: Whatever he said to me he told the truth and whatever he promised he fulfilled it for me. I am not going to declare forbidden what is lawful and make lawful what is forbidden, but, by Allah, the daaghter of Allah's Messenger and the daughter of the enemy of Allah can never be combined at one place.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "27",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، والحسن بن علي، قالا حدثنا عبد الرزاق، قال أحمد حدثنا معمر، أخبرني أشعث، وقال الحسن، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبولن أحدكم في مستحمه ثم يغتسل فيه ‏\"‏ ‏.‏ قال أحمد ‏\"‏ ثم يتوضأ فيه فإن عامة الوسواس منه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     The Messenger of Allah (ﷺ) said: No one of you should make water in his bath and then wash himself there (after urination). The version of Ahmad has: Then performs ablution there, for evil thoughts come from it.",
      "chain": [
        "30007",
        "30",
        "20121",
        "30007",
        "20115",
        "11324",
        "11016",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "38",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهانا رسول الله صلى الله عليه وسلم أن نتمسح بعظم أو بعر ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allaah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) forbade us to use a bone or dung for wiping.",
      "chain": [
        "30007",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "60",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقبل الله صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) said : Allaah, the Exalted, does not accept the prayer of any of you when you are defiled until you performed ablution.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "74",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، حدثنا أبو التياح، عن مطرف، عن ابن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم ولها ‏\"‏ ‏.‏ فرخص في كلب الصيد وفي كلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرار والثامنة عفروه بالتراب ‏\"‏ ‏.‏ قال أبو داود وهكذا قال ابن مغفل ‏.‏",
      "text_en": " Narrated Ibn Mughaffal:                     The Messenger of Allaah (sal Allaahu alayhi wa sallam) ordered the killing of the dogs, and then said: Why are they (people) after them (dogs)? and then granted permission (to keep) for hunting  and for (the security) of the herd, and said : When the dog licks the utensil wash it seven times, and rub it with earth the eighth time.Abu Dawud said : Ibn Mughaffal narrated in a similar way.",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، ومسدد، ومحمد بن عيسى، - المعنى - قالوا حدثنا يحيى بن سعيد، عن أبي حزرة، حدثنا عبد الله بن محمد، - قال ابن عيسى في حديثه ابن أبي بكر ثم اتفقوا أخو القاسم بن محمد - قال كنا عند عائشة فجيء بطعامها فقام القاسم يصلي فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يصلى بحضرة الطعام ولا وهو يدافعه الأخبثان ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd Allaah b. Muhammad:                     We were in the company of 'Aishah. When her food was brought in, al-Qasim stood up to say his prayer. Thereupon , 'Aishah said : I heard the Messenger of Allaah (sal Allaahu alayhi wa sallam) say: Prayer should not be offered in presence of meals, nor at the moment  when one is struggling with two evils (e.g. when one is feeling the call of nature.)",
      "chain": [
        "30007",
        "30175",
        "31167",
        "11062",
        "30351"
      ]
    },
    {
      "hadith_no": "93",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا هشيم، أخبرنا يزيد بن أبي زياد، عن سالم بن أبي الجعد، عن جابر، قال كان رسول الله صلى الله عليه وسلم يغتسل بالصاع ويتوضأ بالمد ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) used to take a bath with a sa' (of water) and perform ablution with a mudd (of water)",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "121",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا أبو المغيرة، حدثنا حريز، حدثني عبد الرحمن بن ميسرة الحضرمي، سمعت المقدام بن معديكرب الكندي، قال أتي رسول الله صلى الله عليه وسلم بوضوء فتوضأ فغسل كفيه ثلاثا ثم تمضمض واستنشق ثلاثا وغسل وجهه ثلاثا ثم غسل ذراعيه ثلاثا ثلاثا ثم مسح برأسه وأذنيه ظاهرهما وباطنهما ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib al-Kindi:                     The ablution water was brought to the Messenger (ﷺ) and he performed ablution; he washed his hands up to wrists three times, then washed his forearms three times.  He then rinsed his mouth and snuffed up water three times; then he wiped his head and ears inside and outside.",
      "chain": [
        "30007",
        "20442",
        "18651"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن ثور، عن راشد بن سعد، عن ثوبان، قال بعث رسول الله صلى الله عليه وسلم سرية فأصابهم البرد فلما قدموا على رسول الله صلى الله عليه وسلم أمرهم أن يمسحوا على العصائب والتساخين ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) sent out an expedition. They were affected by cold. When they returned to the Messenger of Allah (ﷺ), he commanded them to wipe over turbans and stockings.",
      "chain": [
        "30007",
        "20031",
        "11155",
        "19909",
        "130"
      ]
    },
    {
      "hadith_no": "199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الرزاق، حدثنا ابن جريج، أخبرني نافع، حدثني عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم شغل عنها ليلة فأخرها حتى رقدنا في المسجد ثم استيقظنا ثم رقدنا ثم استيقظنا ثم رقدنا ثم خرج علينا فقال ‏\"‏ ليس أحد ينتظر الصلاة غيركم ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Umar said:                      One night the Messenger of Allah (May peace be upon him) was busy and he delayed the night (isha) prayer so much so that we dosed in the mosque. We awoke, then dozed, and again awoke and again dozed. He (the prophet) then came upon us and said: There is none except you who is waiting for prayer.",
      "chain": [
        "30007",
        "20121",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، ح حدثنا أحمد بن حنبل، حدثنا إسماعيل بن إبراهيم، قالا حدثنا برد بن سنان، عن عبادة بن نسى، عن غضيف بن الحارث، قال قلت لعائشة أرأيت رسول الله صلى الله عليه وسلم كان يغتسل من الجنابة في أول الليل أو في آخره قالت ربما اغتسل في أول الليل وربما اغتسل في آخره ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏ قلت أرأيت رسول الله صلى الله عليه وسلم كان يوتر أول الليل أم في آخره قالت ربما أوتر في أول الليل وربما أوتر في آخره ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏ قلت أرأيت رسول الله صلى الله عليه وسلم كان يجهر بالقرآن أم يخفت به قالت ربما جهر به وربما خفت ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Ghudayf ibn al-Harith reported: I asked Aisha: Have you seen the Messenger of Allah (ﷺ) washing (because of defilement) at the beginning of the night or at the end?  She replied: Sometimes he would take a bath at the beginning of the night and sometimes at the end.  Thereupon I exclaimed: Allah is most Great. All Praise be to Allah Who made this matter accommodative.  I again asked her: What do you think, did the Messenger of Allah (ﷺ) say the witr prayer (additional prayer after obligatory prayer at night) in the beginning of the night or at the end?  She replied: Sometimes he would say the witr prayer at the beginning of the night and sometimes at the end.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter accommodative.  Again I asked her: What do you think, did the Messenger of Allah (ﷺ) recite the Qur'an (in the prayer) loudly or softly?  She replied: Sometimes he would recite loudly and sometimes softly.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter flexible.",
      "chain": [
        "30175",
        "20288",
        "30007",
        "20208",
        "19839"
      ]
    },
    {
      "hadith_no": "302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الله بن نمير، عن محمد بن أبي إسماعيل، - وهو محمد بن راشد - عن معقل الخثعمي، عن علي، - رضى الله عنه - قال المستحاضة إذا انقضى حيضها اغتسلت كل يوم واتخذت صوفة فيها سمن أو زيت ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The woman who has a prolonged flow of blood should wash herself every day when her  menstrual period is over and take a woollen cloth greased with fat or oil (to tie over the private parts).",
      "chain": [
        "30007",
        "20331",
        "19021",
        "5"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، ح وحدثنا عباس بن الوليد بن مزيد، أخبرني أبي ح، وحدثنا محمود بن خالد، حدثنا عمر، - يعني ابن عبد الواحد - عن الأوزاعي، - المعنى - قال أنبئت أن سعيد بن أبي سعيد المقبري، حدث عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وطئ أحدكم بنعليه الأذى فإن التراب له طهور ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      The Messenger of Allah (ﷺ) said: When any one of you treads with his sandal upon an unclean place, the earth will render it purified.",
      "chain": [
        "30007",
        "20442",
        "38288",
        "28624",
        "37534",
        "27536",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا عباد بن عباد، حدثنا محمد بن عمرو، عن سعيد بن الحارث الأنصاري، عن جابر بن عبد الله، قال كنت أصلي الظهر مع رسول الله صلى الله عليه وسلم فآخذ قبضة من الحصى لتبرد في كفي أضعها لجبهتي أسجد عليها لشدة الحر ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I would offer my noon prayer with the Messenger of Allah (ﷺ) and took a handful of gravels so that they might become cold in my hand and I placed them (before me) so that I may put my forehead on them at the time when I would prostrate. I did this due to the intensity of heat.",
      "chain": [
        "30007",
        "30175",
        "20243",
        "11220",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "517",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن فضيل، حدثنا الأعمش، عن رجل، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإمام ضامن والمؤذن مؤتمن اللهم أرشد الأئمة واغفر للمؤذنين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The imam is responsible and the mu'adhdhin is trusted, O Allah, guide the imams and forgive the mu'adhdhins.",
      "chain": [
        "30007",
        "20356",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "529",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا علي بن عياش، حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته إلا حلت له الشفاعة يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as saying:                      if anyone says when he hears the call to prayer : “O Allah, Lord of this perfect call and of the prayer which is established for all time, grant Muhammad the wasilah and excellency, and raise him up in a praiseworthy position which Thou hast promised, he will be assured of my intercession.",
      "chain": [
        "30007",
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "555",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسحاق بن يوسف، حدثنا سفيان، عن أبي سهل، - يعني عثمان بن حكيم - حدثنا عبد الرحمن بن أبي عمرة، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى العشاء في جماعة كان كقيام نصف ليلة ومن صلى العشاء والفجر في جماعة كان كقيام ليلة ‏\"‏ ‏.‏",
      "text_en": " ‘Uthman b. ‘Affan reported the Messenger of Allah (may peace be him) as saying; if anyone says the night prayer in congregation, he is like one who keeps vigil (in prayer) till midnight; and he who says both the night and dawn prayer in congregation is like one who keeps vigil (in prayer) the whole night.",
      "chain": [
        "30007",
        "20411",
        "20012",
        "1238",
        "4"
      ]
    },
    {
      "hadith_no": "660",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - حدثنا غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع رسول الله صلى الله عليه وسلم في شدة الحر فإذا لم يستطع أحدنا أن يمكن وجهه من الأرض بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " Anas b. Malik said:                      we used to pray along with the Messenger of Allah (ﷺ) in intense heat. When any of us could not rest his face on bare ground while prostrating due to intense heat he spread his cloth and would prostrate on it.",
      "chain": [
        "30007",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "721",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم إذا استفتح الصلاة رفع يديه حتى يحاذي منكبيه وإذا أراد أن يركع وبعد ما يرفع رأسه من الركوع - وقال سفيان مرة وإذا رفع رأسه ‏.‏ وأكثر ما كان يقول وبعد ما يرفع رأسه من الركوع - ولا يرفع بين السجدتين ‏.‏",
      "text_en": " Salim reported on the authority of his father (Ibn ‘Umar):                      I saw the Messenger of Allah(ﷺ) that when he began prayer, he used to raise his hands opposite his shoulders, and he did so when he bowed, and raised his head after bowing. Sufyan(a narrator) once said: “When he raised his head:; and after he used to say: “When he raised his head after bowing. He would not raise (his hands) between the two prostrations.\"",
      "chain": [
        "30007",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، ح وحدثنا مسدد، حدثنا يحيى، - وهذا حديث أحمد قال - أخبرنا عبد الحميد، - يعني ابن جعفر - أخبرني محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فلم فوالله ما كنت بأكثرنا له تبعا ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يرفع يديه حتى يحاذي بهما منكبيه ثم يكبر حتى يقر كل عظم في موضعه معتدلا ثم يقرأ ثم يكبر فيرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه ثم يعتدل فلا يصب رأسه ولا يقنع ثم يرفع رأسه فيقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يرفع يديه حتى يحاذي بهما منكبيه معتدلا ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم يهوي إلى الأرض فيجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتح أصابع رجليه إذا سجد ويسجد ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ويرفع رأسه ويثني رجله اليسرى فيقعد عليها حتى يرجع كل عظم إلى موضعه ثم يصنع في الأخرى مثل ذلك ثم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ثم يصنع ذلك في بقية صلاته حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ قالوا صدقت هكذا كان يصلي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Humaid al-Sa’idi once told a company of ten of the companions of the Messenger of Allah (ﷺ) ; Abu Qatadah was one of them:                      I am one among you who is more informed of the way the Messenger of Allah (ﷺ) prayed. They said: Why, By Allah, you did not follow him more than us, nor did you remain in his company longer than us? He said: Yes. They said: Then describe (how the Prophet prayed). He said: When the Messenger of Allah (ﷺ) stood up to pray, he raised his hands so as to bring them opposite his shoulders, and uttered the takbir (Allah is the most great), until every bone rested in its place properly: then re recited (some verses from the Quran); then he uttered the takbir (Allah is most great), raising his hands so as to bring them opposite his shoulders; then he bowed; placing the palms of his hands on his knees and keeping himself straight, neither raising nor lowering his head; then raised his head saying: “Allah listens to him who praise Him”; then raised his hands so as to bring them exactly opposite to his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated: then he uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of the two Rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders; then he bowed, placing the palms of his hands on his knees and keeping himself straight, neither raising or lowering his head: then raised his head saying: “Allah listens to him who praises Him”; then raised his hands so as to bring them exactly opposite his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated himself; then he prostrated; then uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of two rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders in the way he had uttered the Takbir (Allah is most great) at the beginning of the prayer; then he did that in the remainder of his prayer; and after prostration which if followed by the taslim (salutation) he out his left foot and sat on his left hip. They said: You have spoken the truth. This is how he(peace be upon him) used to pray.",
      "chain": [
        "30007",
        "20241",
        "30175",
        "20031",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "734",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، أخبرني فليح، حدثني عباس بن سهل، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله صلى الله عليه وسلم فقال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم فذكر بعض هذا قال ثم ركع فوضع يديه على ركبتيه كأنه قابض عليهما ووتر يديه فتجافى عن جنبيه قال ثم سجد فأمكن أنفه وجبهته ونحى يديه عن جنبيه ووضع كفيه حذو منكبيه ثم رفع رأسه حتى رجع كل عظم في موضعه حتى فرغ ثم جلس فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ووضع كفه اليمنى على ركبته اليمنى وكفه اليسرى على ركبته اليسرى وأشار بأصبعه ‏.‏ قال أبو داود روى هذا الحديث عتبة بن أبي حكيم عن عبد الله بن عيسى عن العباس بن سهل لم يذكر التورك وذكر نحو حديث فليح وذكر الحسن بن الحر نحو جلسة حديث فليح وعتبة ‏.‏",
      "text_en": " ‘Abbas b. Sahl. Said:                      Abu Humaid, Abu Usaid, Sahl. B Sa’d and Muhammad b. Maslamah (once) got together and discussed how the Messenger of Allah(ﷺ) used to offer his prayer. Abu Humaid said: I am more informed than any of you regarding the prayer offered by the Messenger of Allah (ﷺ). Then he mentioned a part of it, and said: He then bowed and placed his hands upon his knees as if he caught hold of them; and bent them, keeping (his arms) away from his sides. He them prostrated himself and placed his nose and forehead (on the ground); and kept his arms away from his side, and placed his palms (on the ground opposite his shoulders; he then raised his head that every bone returned to its proper place; (he then prostrated twice) until he finished this prostrations). Then he sat down and spread out his left foot, putting forward the front of his right foot towards the qiblah placing the palm of his right hand on his right knee, and the palm of his left hand on his left knee, and he pointed with his finger.Abu Dawud said: This tradition has been narrated by Ibn al-Mubarak from Fulaih who heard ‘Abbas . Sahl narrating it; but I do not remember it. I think he made the mention of ‘Isa b. ‘Abd Allah who heard ‘Abbas b. Sahl saying: I accompanied Abu Humaid al-Sa’idi.",
      "chain": [
        "30007",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن عمرو، سمعه من، جابر قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤمنا - قال مرة ثم يرجع فيصلي بقومه - فأخر النبي صلى الله عليه وسلم ليلة الصلاة - وقال مرة العشاء - فصلى معاذ مع النبي صلى الله عليه وسلم ثم جاء يؤم قومه فقرأ البقرة فاعتزل رجل من القوم فصلى فقيل نافقت يا فلان ‏.‏ فقال ما نافقت ‏.‏ فأتى رسول الله صلى الله عليه وسلم فقال إن معاذا يصلي معك ثم يرجع فيؤمنا يا رسول الله وإنما نحن أصحاب نواضح ونعمل بأيدينا وإنه جاء يؤمنا فقرأ بسورة البقرة ‏.‏ فقال ‏\"‏ يا معاذ أفتان أنت أفتان أنت اقرأ بكذا اقرأ بكذا ‏\"‏ ‏.‏ قال أبو الزبير ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ ‏{‏ والليل إذا يغشى ‏}‏ فذكرنا لعمرو فقال أراه قد ذكره ‏.‏",
      "text_en": " Jabir said:                      mu’adh b. Jabal used to pray along with the prophet (ﷺ); then he returned and led us in prayer. Sometimes he (the narrator) said: then he returned and led his people in prayer. One night the prophet ( may peace be upon him) delayed the prayer. Sometimes he (the narrator) mentioned the word “the night prayer”. Then Mu’adh prayed along with the prophet(ﷺ), then returned to his people and led them in prayer, and recited surah al-baqrah. A mane turned aside and prayed alone. The people said to him: Have you become a hypocrite, so and so? He replied: I did not become a hypocrite. He then came to the prophet (ﷺ) and said (to him): Messenger of Allah. Mu’adh prays along with you and then returns and leads us in prayers. We look after camels used for watering and work for by day. De came to us leading us In prayer, and he recited Surah al-Baqrah(in prayer). He (the prophet) said: Mu’adh, are you a trouble maker? Recite such an d such ; recite such and such (surahs) The narrator Abu al-zubair said(recite) “Glorify the name of the most high lord”(surah lxxxvii.) and “By the night when it covers over” (surah xcii.) we mentioned this to ‘Amr. He said I think he mentioned it (the names of some surahs).",
      "chain": [
        "30007",
        "20005",
        "11081"
      ]
    },
    {
      "hadith_no": "892",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسماعيل، - يعني ابن إبراهيم - عن أيوب، عن نافع، عن ابن عمر، رفعه قال ‏\"‏ إن اليدين تسجدان كما يسجد الوجه فإذا وضع أحدكم وجهه فليضع يديه وإذا رفع فليرفعهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: Both hands prostrate as the face prostrates. When one of you puts his face (on the ground) he should put his hands too (on the ground). And when he raises it, he should raise them too.",
      "chain": [
        "30007",
        "20208",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "905",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الملك بن عمرو، حدثنا هشام، - يعني ابن سعد - عن زيد بن أسلم، عن عطاء بن يسار، عن زيد بن خالد الجهني، أن النبي صلى الله عليه وسلم قال ‏\"‏ من توضأ فأحسن وضوءه ثم صلى ركعتين لا يسهو فيهما غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported the Messenger of Allah (ﷺ) as saying:                      Anyone who performs ablution and performs his ablution well, and then he offers two rak’ahs of prayers in a way that he does not forget ( anything in it), will be forgiven all his past sins.",
      "chain": [
        "30007",
        "20443",
        "20519",
        "11163",
        "11020",
        "3625"
      ]
    },
    {
      "hadith_no": "922",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، - وهذا لفظه - قال حدثنا بشر، - يعني ابن المفضل - حدثنا برد، عن الزهري، عن عروة بن الزبير، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم - قال أحمد - يصلي والباب عليه مغلق فجئت فاستفتحت - قال أحمد - فمشى ففتح لي ثم رجع إلى مصلاه ‏.‏ وذكر أن الباب كان في القبلة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) was praying with his door bolted. I came and asked to have the door opened. He walked and opened the door for me. He then returned to his place for prayer. He (the narrator Urwah) mentioned that the door faced the qiblah.",
      "chain": [
        "30007",
        "30175",
        "20212",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "928",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا غرار في صلاة ولا تسليم ‏\"‏ ‏.‏ قال أحمد يعني فيما أرى أن لا تسلم ولا يسلم عليك ويغرر الرجل بصلاته فينصرف وهو فيها شاك ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying:                      There is no loss in prayer nor in salutation. Ahmad(b. Hanbal) said: This means, I think, that you do not salute nor you are saluted by others. The loss of a man in his prayer is that a man remains doubtful about it when he finishes it.",
      "chain": [
        "30007",
        "20033",
        "20012",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا عبد الحميد يعني ابن جعفر، ح وحدثنا مسدد، حدثنا يحيى، حدثنا عبد الحميد، - يعني ابن جعفر - حدثني محمد بن عمرو، عن أبي حميد الساعدي، قال سمعته في، عشرة من أصحاب رسول الله صلى الله عليه وسلم - وقال أحمد قال أخبرني محمد بن عمرو بن عطاء قال سمعت أبا حميد الساعدي في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة - قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فاعرض ‏.‏ فذكر الحديث ‏.‏ قال ويفتح أصابع رجليه إذا سجد ثم يقول الله أكبر ويرفع ويثني رجله اليسرى فيقعد عليها ثم يصنع في الأخرى مثل ذلك فذكر الحديث ‏.‏ قال حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ زاد أحمد قالوا صدقت هكذا كان يصلي ولم يذكرا في حديثهما الجلوس في الثنتين كيف جلس",
      "text_en": " Abu Humaid al-sa’idi said (in the presence of ten compansions of the prophet):                      I am more informed than any of you regarding the manner in which the Messenger of Allah (ﷺ) offered his prayer. They said: Present it. The narrator then reported the tradition, saying: he bent the toes of his feet turning them towards the Qiblah when he prostrated, then he uttered “ Allah is most great,” and raised (his head), and bent his left foot and sat on it, and he did the same in the second Rakah. The narrator then transmitted the tradition, and added: In the prostration (i.e., the Rakah) which ended at the salutation, he sat on the hips at the left side. ahmad (b. Hanbal) added: they said : You are right. This is how he used to pray. They (Ahmed and Musaddad) did not mention in their versions how he sat after offering two rak’ahs of prayer.",
      "chain": [
        "30007",
        "20241",
        "11875",
        "30175",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، أخبرني فليح، أخبرني عباس بن سهل، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكر هذا الحديث ولم يذكر الرفع إذا قام من ثنتين ولا الجلوس قال حتى فرغ ثم جلس فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ‏.‏",
      "text_en": " ‘Abbas b. Sahl said:                      Abu Humaid, Abu usaid, Sahl b. Sa’d and Muhammad b. Maslamah got together. Then he narrated this tradition. He did not mention the raising of hands when he stood after two rak’ahs, nor did he mention sitting. He said: When he finished (his prostration), he spread his foot (on the ground) and turned the toes of his right feet towards the qiblah(and then he sat on his left foot).",
      "chain": [
        "30007",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "972",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا أبو عوانة، عن قتادة، ح وحدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، حدثنا هشام، عن قتادة، عن يونس بن جبير، عن حطان بن عبد الله الرقاشي، قال صلى بنا أبو موسى الأشعري فلما جلس في آخر صلاته قال رجل من القوم أقرت الصلاة بالبر والزكاة ‏.‏ فلما انفتل أبو موسى أقبل على القوم فقال أيكم القائل كلمة كذا وكذا فأرم القوم فقال أيكم القائل كلمة كذا وكذا فأرم القوم قال فلعلك يا حطان أنت قلتها ‏.‏ قال ما قلتها ولقد رهبت أن تبكعني بها ‏.‏ قال فقال رجل من القوم أنا قلتها وما أردت بها إلا الخير ‏.‏ فقال أبو موسى أما تعلمون كيف تقولون في صلاتكم إن رسول الله صلى الله عليه وسلم خطبنا فعلمنا وبين لنا سنتنا وعلمنا صلاتنا فقال ‏\"‏ إذا صليتم فأقيموا صفوفكم ثم ليؤمكم أحدكم فإذا كبر فكبروا وإذا قرأ ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فقولوا آمين يجبكم الله وإذا كبر وركع فكبروا واركعوا فإن الإمام يركع قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك وإذا قال سمع الله لمن حمده فقولوا اللهم ربنا لك الحمد يسمع الله لكم فإن الله تعالى قال على لسان نبيه صلى الله عليه وسلم سمع الله لمن حمده وإذا كبر وسجد فكبروا واسجدوا فإن الإمام يسجد قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك فإذا كان عند القعدة فليكن من أول قول أحدكم أن يقول التحيات الطيبات الصلوات لله السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏ لم يقل أحمد ‏\"‏ وبركاته ‏\"‏ ‏.‏ ولا قال ‏\"‏ وأشهد ‏\"‏ ‏.‏ قال ‏\"‏ وأن محمدا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     Hittan ibn Abdullah ar-Ruqashi said: AbuMusa al-Ash'ari led us in prayer.  When he sat at the end of his prayer, one of the people said: Prayer has been established by virtue and purity.  When AbuMusa returned (from his prayer or finished his prayer), he gave his attention to the people, and said: Which of you is the speaker of such and such words? The people remained silent. Which of you is the speaker of such and such words? The people remained silent. He said: You might have said them, Hittan.  He replied: I did not say them. I was afraid you might punish me.  One of the people said: I said them and I did not intend by them (anything) except good.  AbuMusa said: Do you not know how you utter (them) in your prayer? The Messenger of Allah (ﷺ) addressed us, and taught us and explained to us our way of doing and taught us our prayer.  He said: When you pray a (congregational) prayer, straighten your rows, then one of you should lead you in prayer. When he says the takbir (Allah is Most Great), say the takbir, and when he recites verses \"Not of those upon whom is Thy anger, nor of those who err\" (i.e. the end of Surah i.), say Amin; Allah will favour you. When he says \"Allah is most great,\" and bows, say \"Allah is most great\" and bow, for the imam will bow before you, and will raise (his head) before you.  The Messenger of Allah (ﷺ) said: This is for that. When he says \"Allah listens to the one who praises Him,\" say: \"O Allah, our Lord, to Thee be praise, Allah be praised,\" Allah will listen to you, for Allah, the Exalted, said by the tongue of His Prophet (ﷺ): \"Allah listens to the one who praises Him.\" When he says \"Allah is most great\" and prostrates, say: \"Allah is most great\" and prostrate, for the imam prostrates before you and raises his head before you.  The Messenger of Allah (ﷺ) said: This is for that. When he sits, each one of you should say \"The adorations of the tongue, all good things, and acts of worship are due to Allah. Peace be upon you, O Prophet, and Allah's mercy and His blessings. Peace be upon us and upon Allah's upright servants. I testify that there is no god but Allah, and I testify that Muhammad is His servant and Apostle.\"This version of Ahmad does not mention the words \"and His blessings\" nor the phrase \"and I testify\"; instead, it has the words \"that Muhammad.\"",
      "chain": [
        "30154",
        "20469",
        "11019",
        "30007",
        "20031",
        "11065",
        "11019",
        "11320",
        "10676"
      ]
    },
    {
      "hadith_no": "983",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني حسان بن عطية، حدثني محمد بن أبي عائشة، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فرغ أحدكم من التشهد الآخر فليتعوذ بالله من أربع من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      When one of you finishes the last tashahhud, he should seek refuge in Allah from four things: the punishment in Hell, the punishment in the grave, the trail of life and death, and the evil of Antichrist.",
      "chain": [
        "30007",
        "20733",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    },
    {
      "hadith_no": "992",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، وأحمد بن محمد بن شبوية، ومحمد بن رافع، ومحمد بن عبد الملك الغزال، قالوا حدثنا عبد الرزاق، عن معمر، عن إسماعيل بن أمية، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم - قال - أحمد بن حنبل - أن يجلس الرجل في الصلاة وهو معتمد على يده ‏.‏ وقال ابن شبوية نهى أن يعتمد الرجل على يده في الصلاة ‏.‏ وقال ابن رافع نهى أن يصلي الرجل وهو معتمد على يده ‏.‏ وذكره في باب الرفع من السجود ‏.‏ وقال ابن عبد الملك نهى أن يعتمد الرجل على يديه إذا نهض في الصلاة ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) prohibited, according to the version of Ahmad ibn Hanbal, that a person should sit during prayer while he is leaning on his hand. According to the version of Ibn Shibwayh, he prohibited that a man should lean on his hand during prayer. According to the version of Ibn Rafi', he prohibited that a man should pray while he is leaning on his hand, and he mentioned this tradition in the chapter on \"Raising the head after prostration.\" According to the version of Ibn AbdulMalik, he prohibited that a man should lean on his hand when he stands up after prostration.",
      "chain": [
        "30007",
        "30304",
        "30375",
        "20121",
        "20115",
        "11417",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1004",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثني محمد بن يوسف الفريابي، حدثنا الأوزاعي، عن قرة بن عبد الرحمن، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حذف السلام سنة ‏\"‏ ‏.‏ قال عيسى نهاني ابن المبارك عن رفع هذا الحديث ‏.‏ قال أبو داود سمعت أبا عمير عيسى بن يونس الفاخوري الرملي قال لما رجع الفريابي من مكة ترك رفع هذا الحديث قال نهاه أحمد بن حنبل عن رفعه ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Shortening the salutation is sunnah (commendable).The narrator 'Isa said: Ibn al-Mubarak prohibited me from reporting this tradition as a statement of the Prophet (ﷺ).Abu Dawud said: I heard Abu 'Umar 'Isa b. Yunus al-Fakhuri al-Ramil saying: When al-Firyabi returned from Mecca, he gave up narrating this tradition as a statement of the Prophet (ﷺ). He said: Ahmad b. Hanbal forbade to report this tradition directly from the Prophet (ﷺ).",
      "chain": [
        "30007",
        "20034",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1043",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى، عن عبيد الله، أخبرني نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوا في بيوتكم من صلاتكم ولا تتخذوها قبورا ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (ﷺ) as saying:                      Offer some of your prayers in your houses, and do not make them graves.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، عن سعيد، عن الوليد أبي بشر، عن طلحة، أنه سمع جابر بن عبد الله، يحدث أن سليكا، جاء فذكر نحوه زاد ثم أقبل على الناس قال ‏\"‏ إذا جاء أحدكم والإمام يخطب فليصل ركعتين يتجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by Jabir b. 'Abd Allah. This version adds:                      He (the Prophet) turned to the people and said: When one of you comes (on Friday) while the imam is preaching, he should pray two rak'ahs and make them short.",
      "chain": [
        "30007",
        "20173",
        "11168",
        "10725",
        "11356",
        "34"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، حدثنا صفوان، حدثنا يزيد بن خمير الرحبي، قال خرج عبد الله بن بسر صاحب رسول الله صلى الله عليه وسلم مع الناس في يوم عيد فطر أو أضحى فأنكر إبطاء الإمام فقال إنا كنا قد فرغنا ساعتنا هذه وذلك حين التسبيح ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     Yazid ibn Khumayr ar-Rahbi said: Abdullah ibn Busr, the Companion of the Messenger of Allah (ﷺ) came out along with the people on the day of the breaking of the fast or on the day of sacrifice (to offer the prayer). He disliked the delay of the imam, and said: We would finish (our 'Id prayer) at this moment, that is, at the time of forenoon.",
      "chain": [
        "30007",
        "20442",
        "10921",
        "10981"
      ]
    },
    {
      "hadith_no": "1141",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، ومحمد بن بكر، قالا أخبرنا ابن جريج، أخبرني عطاء، عن جابر بن عبد الله، قال سمعته يقول إن النبي صلى الله عليه وسلم قام يوم الفطر فصلى فبدأ بالصلاة قبل الخطبة ثم خطب الناس فلما فرغ نبي الله صلى الله عليه وسلم نزل فأتى النساء فذكرهن وهو يتوكأ على يد بلال وبلال باسط ثوبه تلقي فيه النساء الصدقة قال تلقي المرأة فتخها ويلقين ويلقين وقال ابن بكر فتختها ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) stood on the day of the breaking of the fast ('Id) and offered prayer. He began the prayer before the sermon.  He then addressed the people. When the Prophet (ﷺ) finished the sermon, he descended (from the pulpit) and went to women. He gave them an exhortation while he was leaning on the hand of Bilal. Bilal was spreading his garment in which women were putting alms; some women put their rings and others other things.",
      "chain": [
        "30007",
        "20121",
        "20277",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1178",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبد الملك، حدثني عطاء، عن جابر بن عبد الله، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم وكان ذلك في اليوم الذي مات فيه إبراهيم ابن رسول الله صلى الله عليه وسلم فقال الناس إنما كسفت لموت إبراهيم ابنه صلى الله عليه وسلم فقام النبي صلى الله عليه وسلم فصلى بالناس ست ركعات في أربع سجدات كبر ثم قرأ فأطال القراءة ثم ركع نحوا مما قام ثم رفع رأسه فقرأ دون القراءة الأولى ثم ركع نحوا مما قام ثم رفع رأسه فقرأ القراءة الثالثة دون القراءة الثانية ثم ركع نحوا مما قام ثم رفع رأسه فانحدر للسجود فسجد سجدتين ثم قام فركع ثلاث ركعات قبل أن يسجد ليس فيها ركعة إلا التي قبلها أطول من التي بعدها إلا أن ركوعه نحو من قيامه قال ثم تأخر في صلاته فتأخرت الصفوف معه ثم تقدم فقام في مقامه وتقدمت الصفوف فقضى الصلاة وقد طلعت الشمس فقال ‏\"‏ يا أيها الناس إن الشمس والقمر آيتان من آيات الله عز وجل لا ينكسفان لموت بشر فإذا رأيتم شيئا من ذلك فصلوا حتى تنجلي ‏\"‏ ‏.‏ وساق بقية الحديث ‏.‏",
      "text_en": " Narrated Jabir b. Abd Allah:                     There was an eclipse of the sun in the time of the Messenger of Allah (ﷺ) had died.  The people began to to say that there was an eclipse on account of the death of Ibrahim.   The Prophet (ﷺ) stood up and led the people in prayer performing six bowings and four prostrations.  he said: Allah is most great, and then recited from the Qur'an and prolonged the recitation.  He then bowed nearly as long as he stood.  He then raised his head and recited from the Qur'an but it was less than the first (recitation).  He then bowed nearly as long as he stood.  He then raised his head and then recited from the Quran for the third time, but it was less than the second recitation.  He then bowed nearly as long as he stood.  he then raised his head and then recited from the Qur'an for the third time, but it was less than the second recitation.  he then bowed nearly as long as he stood.  Then he raised his head and went down for prostration.  he made two prostrations.  He then stood and made three bowings before prostrating himself, the preceding bowing being more lengthy than the following, but he bowed nearly as long as he stood.  He then stepped back during the prayer and the rows (of the people) too stepped back along with him.  Then he stepped forward and stood in his place, and the rows too stepped forward.  he then finished the prayer and the sun had become bright.  He said: O people, the sun and the moon are two of Allah's signs; they are not eclipsed on account of a man's death.  So when you see anything of that nature, offer prayer until the sun becomes bright.  The narrator then narrated the rest of the tradition.",
      "chain": [
        "30007",
        "20031",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى، عن ابن جريج، ح وحدثنا خشيش، - يعني ابن أصرم - حدثنا عبد الرزاق، عن ابن جريج، قال حدثني عبد الرحمن بن عبد الله بن أبي عمار، عن عبد الله بن بابيه، عن يعلى بن أمية، قال قلت لعمر بن الخطاب أرأيت إقصار الناس الصلاة وإنما قال تعالى ‏{‏ إن خفتم أن يفتنكم الذين كفروا ‏}‏ فقد ذهب ذلك اليوم ‏.‏ فقال عجبت مما عجبت منه فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ صدقة تصدق الله بها عليكم فاقبلوا صدقته ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la b. Umayyah:                     I remarked to 'Umar al-Khattab: Have you seen the shortening of the prayer by the people today while Allah has said: \"If you fear that those who are infidels may afflict you\", whereas those days are gone now? He replied: I have wondered about the same matter for which you wondered. So I mentioned this to the Messenger of Allah (ﷺ). He said: It is an act of charity which Allah has done to you, so accept his charity.",
      "chain": [
        "30007",
        "30175",
        "20031",
        "11070",
        "38204",
        "20121",
        "11070",
        "10647"
      ]
    },
    {
      "hadith_no": "1200",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، ومحمد بن بكر، قالا أخبرنا ابن جريج، سمعت عبد الله بن أبي عمار، يحدث فذكره نحوه ‏.‏ قال أبو داود رواه أبو عاصم وحماد بن مسعدة كما رواه ابن بكر ‏.‏",
      "text_en": " The above mentioned tradition has also been narrated through a different chain of transmitters by 'Abd Allah b. Abi 'Ammar who narrated it in like manner.Abu Dawud said:                      This has been transmitted by Abu 'Asim and Hammad b. Mas'adah as transmitted by Ibn Bakr.",
      "chain": [
        "30007",
        "20121",
        "20277",
        "11070",
        "30002"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن يحيى بن أبي كثير، عن محمد بن عبد الرحمن بن ثوبان، عن جابر بن عبد الله، قال أقام رسول الله صلى الله عليه وسلم بتبوك عشرين يوما يقصر الصلاة ‏.‏ قال أبو داود غير معمر لا يسنده ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) stayed at Tabuk twenty days; he shortened the prayer (during his stay).Abu Dawud said: No one narrates this tradition with continuous chain except Ma'mar.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11449",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "1251",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا خالد، ح وحدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد، - المعنى - عن عبد الله بن شقيق، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم من التطوع فقالت كان يصلي قبل الظهر أربعا في بيتي ثم يخرج فيصلي بالناس ثم يرجع إلى بيتي فيصلي ركعتين وكان يصلي بالناس المغرب ثم يرجع إلى بيتي فيصلي ركعتين وكان يصلي بهم العشاء ثم يدخل بيتي فيصلي ركعتين وكان يصلي من الليل تسع ركعات فيهن الوتر وكان يصلي ليلا طويلا قائما وليلا طويلا جالسا فإذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ وهو قاعد ركع وسجد وهو قاعد وكان إذا طلع الفجر صلى ركعتين ثم يخرج فيصلي بالناس صلاة الفجر صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abd Allah b. Shaqiq:                     I asked A'ishah about the voluntary prayers offered by the Messenger of Allah (ﷺ). She replied: Before the noon prayer he would pray four rak'ahs in my house, then go out and lead the people in prayer, then return to my house and pray two rak'ahs. He would lead the people in the sunset prayer, then return to my house and pray two rak'ahs. Then he would lead the people in the night prayer, and enter my house and pray two rak'ahs. He would pray nine rak'ahs during the night, including witr (prayer). At night he would pray for a long time standing and for a long time sitting. When he recited the Qur'an while standing, he would bow and prostrate himself from the standing position, and when he recited while sitting, he would bow and prostrate himself from the sitting position, and when dawn came he prayed two rak'ahs, then he would come out and lead the people in the dawn prayer.",
      "chain": [
        "30007",
        "20468",
        "11282",
        "30175",
        "20304",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1257",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، حدثنا عبد الله بن العلاء، حدثني أبو زيادة، عبيد الله بن زياد الكندي عن بلال، أنه حدثه أنه، أتى رسول الله صلى الله عليه وسلم ليؤذنه بصلاة الغداة فشغلت عائشة - رضى الله عنها - بلالا بأمر سألته عنه حتى فضحه الصبح فأصبح جدا قال فقام بلال فآذنه بالصلاة وتابع أذانه فلم يخرج رسول الله صلى الله عليه وسلم فلما خرج صلى بالناس وأخبره أن عائشة شغلته بأمر سألته عنه حتى أصبح جدا وأنه أبطأ عليه بالخروج فقال ‏\"‏ إني كنت ركعت ركعتى الفجر ‏\"‏ ‏.‏ فقال يا رسول الله إنك أصبحت جدا ‏.‏ قال ‏\"‏ لو أصبحت أكثر مما أصبحت لركعتهما وأحسنتهما وأجملتهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Bilal:                     Ziyadah al-Kindi reported on the authority of Bilal that he (Bilal) came to the Messenger of Allah (ﷺ) to inform him about the dawn prayer. Aisha kept Bilal engaged in a matter which she asked him till the day was bright and it became fairly light. Bilal then stood up and called him to prayer and called him repeatedly. The Messenger of Allah (ﷺ) did not yet come out. When he came out, he led the people in prayer and he (Bilal) informed him that Aisha had kept him engaged in a matter which she asked him till it became fairly light; hence he became late in reaching him (in time). He (Bilal) said: Messenger of Allah, the dawn became fairly bright. He said: If the dawn became brighter than it is now, I would pray them (the two rak'ahs of the sunnah prayer), offer them well and in a more beautiful manner.",
      "chain": [
        "30007",
        "20442",
        "20399",
        "24"
      ]
    },
    {
      "hadith_no": "1266",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا حماد بن سلمة، ح وحدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن ورقاء، ح وحدثنا الحسن بن علي، حدثنا أبو عاصم، عن ابن جريج، ح وحدثنا الحسن بن علي، حدثنا يزيد بن هارون، عن حماد بن زيد، عن أيوب، ح وحدثنا محمد بن المتوكل، حدثنا عبد الرزاق، أخبرنا زكريا بن إسحاق، كلهم عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ)as saying: When the iqamah is pronounced for prayer, no prayer is valid except the obligatory prayer.",
      "chain": [
        "20285",
        "20021",
        "30007",
        "20173",
        "20020",
        "30",
        "20241",
        "11070",
        "30",
        "20472",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "1311",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام أحدكم من الليل فاستعجم القرآن على لسانه فلم يدر ما يقول فليضطجع ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: When one of you gets up by night (to pray), and falters in reciting the Qur'an (due to sleep), and he does not understand what he utters, he should sleep.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1412",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، ح وحدثنا أحمد بن أبي شعيب، حدثنا ابن نمير، - المعنى - عن عبيد الله، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يقرأ علينا السورة - قال ابن نمير في غير الصلاة ثم اتفقا - فيسجد ونسجد معه حتى لا يجد أحدنا مكانا لموضع جبهته ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) would recite to us a surah (according to the version of Ibn Numair) outside the prayer (the agreed version goes), then he would prostrate along with him, and none of us could find a place for his forehead.",
      "chain": [
        "30007",
        "20031",
        "30301",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1428",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا محمد بن بكر، أخبرنا هشام، عن محمد، عن بعض، أصحابه أن أبى بن كعب، أمهم - يعني في رمضان - وكان يقنت في النصف الآخر من رمضان ‏.‏",
      "text_en": " Muhammad reported on the authority of some of his teachers that Ubayy b. Ka'b led them in prayer during Ramadan. He used to recite the supplication (in the with) during the second half of Ramadan.",
      "chain": [
        "30007",
        "20277",
        "20295",
        "20278",
        "39"
      ]
    },
    {
      "hadith_no": "1438",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، حدثني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ اجعلوا آخر صلاتكم بالليل وترا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported the Prophet (ﷺ) as suing:                      Make the last of your prayer at night a witr.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1449",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا حجاج، قال قال ابن جريج حدثني عثمان بن أبي سليمان، عن علي الأزدي، عن عبيد بن عمير، عن عبد الله بن حبشي الخثعمي، أن النبي صلى الله عليه وسلم سئل أى الأعمال أفضل قال ‏\"‏ طول القيام ‏\"‏ ‏.‏ قيل فأى الصدقة أفضل قال ‏\"‏ جهد المقل ‏\"‏ ‏.‏ قيل فأى الهجرة أفضل قال ‏\"‏ من هجر ما حرم الله عليه ‏\"‏ ‏.‏ قيل فأى الجهاد أفضل قال ‏\"‏ من جاهد المشركين بماله ونفسه ‏\"‏ ‏.‏ قيل فأى القتل أشرف قال ‏\"‏ من أهريق دمه وعقر جواده ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. Habshi al-Khath'ami said:                      The Prophet (ﷺ) was asked: Which of the actions is better ? He replied: Standing for long time (in prayer). He was again asked: Which alms is better ? He replied: The alms given by a man possessing small property acquired by his labour.",
      "chain": [
        "30007",
        "20219",
        "11070",
        "10649",
        "19335",
        "11259",
        "5119"
      ]
    },
    {
      "hadith_no": "1481",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الله بن يزيد، حدثنا حيوة، أخبرني أبو هانئ، حميد بن هانئ أن أبا علي، عمرو بن مالك حدثه أنه، سمع فضالة بن عبيد، صاحب رسول الله صلى الله عليه وسلم يقول سمع رسول الله صلى الله عليه وسلم رجلا يدعو في صلاته لم يمجد الله تعالى ولم يصل على النبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ عجل هذا ‏\"‏ ‏.‏ ثم دعاه فقال له أو لغيره ‏\"‏ إذا صلى أحدكم فليبدأ بتحميد ربه جل وعز والثناء عليه ثم يصلي على النبي صلى الله عليه وسلم ثم يدعو بعد بما شاء ‏\"‏ ‏.‏",
      "text_en": " Narrated Fudalah ibn Ubayd,:                     The Messenger of Allah (ﷺ) heard a person supplicating during prayer. He did not mention the greatness of Allah, nor did he invoke blessings on the Prophet (ﷺ). The Messenger of Allah (ﷺ) said: He made haste. He then called him and said either to him or to any other person: If any of you prays, he should mention the exaltation of his Lord in the beginning and praise Him; he should then invoke blessings on the Prophet (ﷺ); thereafter he should supplicate Allah for anything he wishes.",
      "chain": [
        "30007",
        "1945",
        "26010",
        "10856"
      ]
    },
    {
      "hadith_no": "1551",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا محمد بن عبد الله بن الزبير، ح وحدثنا أحمد، حدثنا وكيع، - المعنى - عن سعد بن أوس، عن بلال العبسي، عن شتير بن شكل، عن أبيه، في حديث أبي أحمد شكل بن حميد - قال - قلت يا رسول الله علمني دعاء قال ‏\"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏",
      "text_en": " Narrated Shakl ibn Humayd:                     I said: Messenger of Allah, teach me a supplication. He said: Say: \"O Allah, I seek refuge in Thee from the evil of what I hear, from the evil of what I see, from the evil of what I speak, from the evil of what I think, and from the evil of my semen\" (i.e. sexual passion).",
      "chain": [
        "30007",
        "30007",
        "20722",
        "10773"
      ]
    },
    {
      "hadith_no": "1584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا زكريا بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم وترد في فقرائهم فإن هم أطاعوك لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     said When the Messenger of Allah(ﷺ) sent Mu’adh to Yemen, he said to him You are going to a people who are people of the book. So call them to bear witness that there is no diety but Allah, and that I am the Messenger of Allah. If they obey you in this respect, tell them that Allah has prescribed five prayers on them every day and night. If they obey you in this regard tell them that Allah has prescribed sadaqah(zakat) on their property and returned it to their poor. If they obey you in this respect, do not take the best of their property. Beware of the curse of the oppressed, for there is no curtain between it and Allah.",
      "chain": [
        "30007",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1649",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبيدة بن حميد التيمي، حدثني أبو الزعراء، عن أبي الأحوص، عن أبيه، مالك بن نضلة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأيدي ثلاثة فيد الله العليا ويد المعطي التي تليها ويد السائل السفلى فأعط الفضل ولا تعجز عن نفسك ‏\"‏ ‏.‏",
      "text_en": " Narrated Malik ibn Nadlah:                     The Prophet (ﷺ) said: Hands are of three types: Allah's hand is the upper one; the bestower's hand is the one near it; the beggar's hand is the lower one. So bestow what is surplus, and do not submit yourself to the demand of your soul.",
      "chain": [
        "30007",
        "20341",
        "20327"
      ]
    },
    {
      "hadith_no": "1727",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن عبيد الله، قال حدثني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تسافر المرأة ثلاثا إلا ومعها ذو محرم ‏\"‏ ‏.‏",
      "text_en": " Ibn `Umr reported the Prophet (SWAS) as saying :                      A woman must not make a journey of three days unless she is accompanied by a man who is within the prohibited degree.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1736",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم بالروحاء فلقي ركبا فسلم عليهم فقال ‏\"‏ من القوم ‏\"‏ ‏.‏ فقالوا المسلمون ‏.‏ فقالوا فمن أنتم قالوا رسول الله صلى الله عليه وسلم ‏.‏ ففزعت امرأة فأخذت بعضد صبي فأخرجته من محفتها فقالت يا رسول الله هل لهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Ibn `Abbas said the Messenger of Allah (SWAS) was at al-Rawha.  There he met some riders. He saluted them and asked who they were.  They replied that they were Muslims.  They asked who are you.  They (the companions) replied he is the Messenger of Allah (SWAS).  A woman became upset :                      she took her child by his arm and lifted him from her litter at the camel. She said Messenger of Allah (SWAS) can this (child) be credited with having performed Hajj.  He replied Yes, and you will have a reward.",
      "chain": [
        "30007",
        "20005",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1740",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا وكيع، حدثنا سفيان، عن يزيد بن أبي زياد، عن محمد بن علي بن عبد الله بن عباس، عن ابن عباس، قال وقت رسول الله صلى الله عليه وسلم لأهل المشرق العقيق ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) appointed al-Aqiq as the place for putting on ihram for the people of East.",
      "chain": [
        "30007",
        "20032",
        "20012",
        "10844",
        "10961",
        "17"
      ]
    },
    {
      "hadith_no": "1761",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن ابن جريج، أخبرني أبو الزبير، سألت جابر بن عبد الله عن ركوب الهدى، فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اركبها بالمعروف إذا ألجئت إليها حتى تجد ظهرا ‏\"‏ ‏.‏",
      "text_en": " Abu al-Zubair said:                       I asked Jabir bin `Abdallah about riding on the sacrificial camels.  He said I heard  The Messenger of Allah (SWAS) saying ride on them gently when you have nothing else till you find a mount.",
      "chain": [
        "30007",
        "20031",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا يونس، أخبرني زياد بن جبير، قال كنت مع ابن عمر بمنى فمر برجل وهو ينحر بدنته وهي باركة فقال ابعثها قياما مقيدة سنة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Ziyad bin Jubair said :                      I was present with Ibn `Umar at Minah.  He passed a man who was sacrificing his camel while it was sitting.  He said make it stand and tie its leg ; thus follow the practice (sunnah) of Muhammad (SWAS).",
      "chain": [
        "30007",
        "20468",
        "20475",
        "11285"
      ]
    },
    {
      "hadith_no": "1773",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن بكر، حدثنا ابن جريج، عن محمد بن المنكدر، عن أنس، قال صلى رسول الله صلى الله عليه وسلم الظهر بالمدينة أربعا وصلى العصر بذي الحليفة ركعتين ثم بات بذي الحليفة حتى أصبح فلما ركب راحلته واستوت به أهل ‏.‏",
      "text_en": " Anas said :                     Messenger of Allah (SWAS) prayed four rak’ahs at Madinah and prayed two rak’ahs of afternoon prayer at Dhu-al Hulaifah.  He then passed the night at Dhu-al Hulaifah till the morning came.  When he rode on his mount and it stood up on its back, he raised his voice in talbiyah.",
      "chain": [
        "30007",
        "20277",
        "11070",
        "11048",
        "19"
      ]
    },
    {
      "hadith_no": "1774",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا روح، حدثنا أشعث، عن الحسن، عن أنس بن مالك، أن النبي صلى الله عليه وسلم صلى الظهر ثم ركب راحلته فلما علا على جبل البيداء أهل ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) offered the noon prayer, and then rode on his mount. When he came to the hill of al-Bayda', he raised his voice in talbiyah.",
      "chain": [
        "30007",
        "20229",
        "11324",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "1776",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عباد بن العوام، عن هلال بن خباب، عن عكرمة، عن ابن عباس، أن ضباعة بنت الزبير بن عبد المطلب، أتت رسول الله صلى الله عليه وسلم فقالت يا رسول الله إني أريد الحج أأشترط قال ‏\"‏ نعم ‏\"‏ ‏.‏ قالت فكيف أقول قال ‏\"‏ قولي لبيك اللهم لبيك ومحلي من الأرض حيث حبستني ‏\"‏ ‏.‏",
      "text_en": " Ibn `Abbas said:                      Duba`ah, daughter of al-Zubair bin `Abd al-Muttalib, came to the Messenger of Allah(SWAS) and said Messenger of Allah (SWAS) I want to perform Hajj; may I make a provision?  He said Yes. She asked how should I say?  He replied : Say “ Labbaik Allahumma Labbaik (I am at Thy service, Oh Allah, I am at Thy service).  The place where I took off Ihram will be where Thou restrainest me.”",
      "chain": [
        "30007",
        "20431",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1786",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، قال حدثنا يحيى بن سعيد، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابرا، قال دخل النبي صلى الله عليه وسلم على عائشة ببعض هذه القصة قال عند قوله ‏\"‏ وأهلي بالحج ‏\"‏ ‏.‏ ‏\"‏ ثم حجي واصنعي ما يصنع الحاج غير أن لا تطوفي بالبيت ولا تصلي ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Jabir through a different chain of narrators. This version has The Prophet(ﷺ) said “Raise your voice in talbiyah for Hajj and then perform Hajj, and do so all the pilgrims do, except that you should not circumambulate the Hose(the Ka’bah) and should not pray.",
      "chain": [
        "30007",
        "20031",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1789",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الوهاب الثقفي، حدثنا حبيب، - يعني المعلم - عن عطاء، حدثني جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أهل هو وأصحابه بالحج وليس مع أحد منهم يومئذ هدى إلا النبي صلى الله عليه وسلم وطلحة وكان علي - رضى الله عنه - قدم من اليمن ومعه الهدى فقال أهللت بما أهل به رسول الله صلى الله عليه وسلم وأن النبي صلى الله عليه وسلم أمر أصحابه أن يجعلوها عمرة يطوفوا ثم يقصروا ويحلوا إلا من كان معه الهدى فقالوا أننطلق إلى منى وذكورنا تقطر فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ لو أني استقبلت من أمري ما استدبرت ما أهديت ولولا أن معي الهدى لأحللت ‏\"‏ ‏.‏",
      "text_en": " Jabir bin Abdullah said The Apostle of Allaah(ﷺ) and his companions raised their voices in talbiyah for Hajj. No one of them had brought the sacrificial animals with them except the Prophet(ﷺ) and Talhah. Ali (may Allaah be pleased with him) had returned from Yemen and had brought sacrificial animals with him. He said I raised my voice in talbiyah for which the Apostle of Allaah (ﷺ) raised his voice. The Prophet (ﷺ) commanded his companions to change it into ‘Umrah and clip their hair after running (between Al Safa’ and Al Marwah), and then take off their ihram except those who brought the sacrificial animals with them. They remarked should we go to Mina with our penises dripping with prostatic fluid? These remarks reached the Apostle of Allaah(ﷺ). Thereupon he said “had I known before hand about my affair what I have come to know later, I would not have brought sacrificial animals. Had I not brought sacrificial animals with me, I would have put off my ihram. “",
      "chain": [
        "30007",
        "20259",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، قال حدثنا هشيم، أخبرنا يحيى بن أبي إسحاق، وعبد العزيز بن صهيب، وحميد الطويل، عن أنس بن مالك، أنهم سمعوه يقول سمعت رسول الله صلى الله عليه وسلم يلبي بالحج والعمرة جميعا يقول ‏\"‏ لبيك عمرة وحجا لبيك عمرة وحجا ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said I heard the Apostle of Allaah(ﷺ) uttering talbiyah(labbaik) aloud for both Hajj and ‘Umrah. He was saying in a loud voice “Labbaik for ‘Umrah and Hajj, labbaik for ‘Umrah and Hajj”.",
      "chain": [
        "30007",
        "20468",
        "11314",
        "11295",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1813",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، حدثنا جعفر، حدثنا أبي، عن جابر بن عبد الله، قال أهل رسول الله صلى الله عليه وسلم فذكر التلبية مثل حديث ابن عمر قال والناس يزيدون ‏\"‏ ذا المعارج ‏\"‏ ‏.‏ ونحوه من الكلام والنبي صلى الله عليه وسلم يسمع فلا يقول لهم شيئا ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) raised his voice in talbiyah; he then mentioned the wordings of talbiyah like the tradition narrated by Ibn Umar. The people used to add the words dhal-ma'arij (the Possessor of ladders) and similar other words (to talbiyah) while the Prophet (ﷺ) heard them utter these words, but he did not say anything to them.",
      "chain": [
        "30007",
        "20031",
        "11407",
        "34"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا ابن جريج، عن عطاء، عن ابن عباس، عن الفضل بن عباس، أن رسول الله صلى الله عليه وسلم لبى حتى رمى جمرة العقبة ‏.‏",
      "text_en": " Al Fadl bin Abbas said The Apostle of Allaah(ﷺ) uttered talbiyah till he threw pebbles at Jamrat Al ‘Aqbah.",
      "chain": [
        "30007",
        "20032",
        "11070",
        "11029",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "1816",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الله بن نمير، حدثنا يحيى بن سعيد، عن عبد الله بن أبي سلمة، عن عبد الله بن عبد الله بن عمر، عن أبيه، قال غدونا مع رسول الله صلى الله عليه وسلم من منى إلى عرفات منا الملبي ومنا المكبر ‏.‏",
      "text_en": " ‘Abd Allah bin Umar said We proceeded along with the Apostle of Allaah(ﷺ) from Mina to ‘Arafat, some of us were uttering talbiyah and the others were shouting “Allaah is most great.”",
      "chain": [
        "30007",
        "20331",
        "11062",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "1818",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن عبد العزيز بن أبي رزمة، أخبرنا عبد الله بن إدريس، أخبرنا ابن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن أسماء بنت أبي بكر، قالت خرجنا مع رسول الله صلى الله عليه وسلم حجاجا حتى إذا كنا بالعرج نزل رسول الله صلى الله عليه وسلم ونزلنا فجلست عائشة - رضى الله عنها - إلى جنب رسول الله صلى الله عليه وسلم وجلست إلى جنب أبي وكانت زمالة أبي بكر وزمالة رسول الله صلى الله عليه وسلم واحدة مع غلام لأبي بكر فجلس أبو بكر ينتظر أن يطلع عليه فطلع وليس معه بعيره قال أين بعيرك قال أضللته البارحة ‏.‏ قال فقال أبو بكر بعير واحد تضله قال فطفق يضربه ورسول الله صلى الله عليه وسلم يتبسم ويقول ‏\"‏ انظروا إلى هذا المحرم ما يصنع ‏\"‏ ‏.‏ قال ابن أبي رزمة فما يزيد رسول الله صلى الله عليه وسلم على أن يقول ‏\"‏ انظروا إلى هذا المحرم ما يصنع ‏\"‏ ‏.‏ ويتبسم ‏.‏",
      "text_en": " Narrated Asma' bint AbuBakr:                     We came out for performing hajj along with the Messenger of Allah (ﷺ). When we reached al-Araj, the Messenger of Allah (ﷺ) alighted and we also alighted. Aisha sat beside the Messenger of Allah (ﷺ) and I sat beside my father (AbuBakr). The equipment and personal effects of AbuBakr and of the Messenger of Allah (ﷺ) were placed with AbuBakr's slave on a camel. AbuBakr was sitting and waiting for his arrival. He arrived but he had no camel with him. He asked:  Where is your camel?  He replied: I lost it last night.  AbuBakr said: There was only one camel, even that you have lost.  He then began to beat him while the Messenger of Allah (ﷺ) was smiling and saying: Look at this man who is in the sacred state (putting on ihram), what is he doing?  Ibn AbuRizmah said: The Messenger of Allah (ﷺ) spoke nothing except the words: Look at this man who is in the sacred state (wearing ihram), what is he doing? He was smiling (when he uttered these words).",
      "chain": [
        "30007",
        "30379",
        "20102",
        "11107",
        "19826",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "1823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، وأحمد بن حنبل، قالا حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، قال سأل رجل رسول الله صلى الله عليه وسلم ما يترك المحرم من الثياب فقال ‏\"‏ لا يلبس القميص ولا البرنس ولا السراويل ولا العمامة ولا ثوبا مسه ورس ولا زعفران ولا الخفين إلا لمن لم يجد النعلين فمن لم يجد النعلين فليلبس الخفين وليقطعهما حتى يكونا أسفل من الكعبين ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allaah bin Umar said A man asked the Apostle of Allaah(ﷺ) What clothing one should put on if one intend to put on ihram? He said He should not wear shirts, turbans, trousers, garments with head coverings and clothing which has any dye of waras or saffron; one should not put on shoes unless one cannot get sandals. If one cannot get sandals, one should wear the shoes, in which case one must cut them to come below the ankles.",
      "chain": [
        "30175",
        "30007",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1827",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يعقوب، حدثنا أبي، عن ابن إسحاق، قال فإن نافعا مولى عبد الله بن عمر حدثني عن عبد الله بن عمر أنه سمع رسول الله صلى الله عليه وسلم نهى النساء في إحرامهن عن القفازين والنقاب وما مس الورس والزعفران من الثياب ولتلبس بعد ذلك ما أحبت من ألوان الثياب معصفرا أو خزا أو حليا أو سراويل أو قميصا أو خفا ‏.‏ قال أبو داود روى هذا الحديث عن ابن إسحاق عن نافع عبدة بن سليمان ومحمد بن سلمة إلى قوله وما مس الورس والزعفران من الثياب ‏.‏ ولم يذكرا ما بعده ‏.‏",
      "text_en": " ‘Abd Allaah bin Umar said that he heard the Apostle of Allaah(ﷺ) prohibiting women in the sacred state (wearing ihram) to wear gloves, veil(their faces) and to wear clothes with dye of waras or saffron on them. But afterwards they can wear any kind of clothing they like dyed yellow or silk or jewelry or trousers or shirts or shoes.Abu Dawud said ‘Abdah and Muhammad bin Ishaq narrated this tradition from Muhammad bin Ishaq up to the words “And to wear clothes with dye of waras or saffron on them”. They did not mention the words after them.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11107",
        "18"
      ]
    },
    {
      "hadith_no": "1832",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء، يقول لما صالح رسول الله صلى الله عليه وسلم أهل الحديبية صالحهم على أن لا يدخلوها إلا بجلبان السلاح فسألته ما جلبان السلاح قال القراب بما فيه ‏.‏",
      "text_en": " Al Bara’ (bin Azib) said When the Apostle of Allaah(ﷺ) concluded the treaty with the people of Al Hudaibiyyah, they stipulated that they (the Muslims)  would not enter (Makkah) except with the bag of armament (julban al-silah). I asked what is julban al-silah? He replied:                      The bag with its contents.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا يزيد بن أبي زياد، عن مجاهد، عن عائشة، قالت كان الركبان يمرون بنا ونحن مع رسول الله صلى الله عليه وسلم محرمات فإذا حاذوا بنا سدلت إحدانا جلبابها من رأسها إلى وجهها فإذا جاوزونا كشفناه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Riders would pass us when we accompanied the Messenger of Allah (ﷺ) while we were in the sacred state (wearing ihram). When they came by us, one of us would let down her outer garment from her head over her face, and when they had passed on, we would uncover our faces.",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "1834",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن سلمة، عن أبي عبد الرحيم، عن زيد بن أبي أنيسة، عن يحيى بن حصين، عن أم الحصين، حدثته قالت، حججنا مع النبي صلى الله عليه وسلم حجة الوداع فرأيت أسامة وبلالا وأحدهما آخذ بخطام ناقة النبي صلى الله عليه وسلم والآخر رافع ثوبه ليستره من الحر حتى رمى جمرة العقبة ‏.‏",
      "text_en": " Umm al Hussain said We performed the Farewell Pilgrimage along with the Prophet(ﷺ) . I saw Usamah and Bilal one of them holding the halter of the she-Camel of the Prophet(ﷺ), while the other raising his garment and sheltering from the heat till he had thrown pebbles at the jamrah of the ‘Aqabah.",
      "chain": [
        "30007",
        "20672",
        "11340"
      ]
    },
    {
      "hadith_no": "1835",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن عمرو بن دينار، عن عطاء، وطاوس، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وهو محرم ‏.‏",
      "text_en": " Ibn ‘Abbas said The Prophet(ﷺ) had himself cupped when he was in the sacred state(wearing ihram).",
      "chain": [
        "30007",
        "20005",
        "11081",
        "11029",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1837",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن قتادة، عن أنس، أن رسول الله صلى الله عليه وسلم احتجم وهو محرم على ظهر القدم من وجع كان به ‏.‏ قال أبو داود سمعت أحمد قال ابن أبي عروبة أرسله يعني عن قتادة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Messenger of Allah (ﷺ) had himself cupped on the surface of his foot because of a pain in it while he was in the sacred state (wearing ihram).Abu Dawud said: I heard Ahmad say: \"Ibn Abi 'Arubah narrated it in Mursal form\". Meaning from Qatadah.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1838",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن أيوب بن موسى، عن نبيه بن وهب، قال اشتكى عمر بن عبيد الله بن معمر عينيه فأرسل إلى أبان بن عثمان - قال سفيان وهو أمير الموسم - ما يصنع بهما قال اضمدهما بالصبر فإني سمعت عثمان - رضى الله عنه - يحدث ذلك عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nubaih bin Wahb said ‘Umar bin ‘Ubaid Allah bin Ma’mar had a complaint in his eyes. He sent (someone) to  Aban bin ‘Uthman  - the narrator Sufyan said that he was the chief of pilgrims during the season of Hajj – asking him what he should do with them. He said Apply aloes to them, for I heard ‘Uthaman narrating this on the authority of the Apostle of Allaah(ﷺ).",
      "chain": [
        "30007",
        "20005",
        "11241",
        "19965",
        "4"
      ]
    },
    {
      "hadith_no": "1846",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، عن الزهري، عن سالم، عن أبيه، سئل النبي صلى الله عليه وسلم عما يقتل المحرم من الدواب فقال ‏\"‏ خمس لا جناح في قتلهن على من قتلهن في الحل والحرم العقرب والفأرة والحدأة والغراب والكلب العقور ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar said The Prophet (ﷺ) was asked as to which of the creatures could be killed by a pilgrim in the sacred state. He said there are five creatures which it is not a sin for anyone to kill, outside or inside the sacred area. The Scorpion, the Crow, the Rat, the Kite and the biting Dog.",
      "chain": [
        "30007",
        "20005",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، حدثنا يزيد بن أبي زياد، حدثنا عبد الرحمن بن أبي نعم البجلي، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم سئل عما يقتل المحرم قال ‏\"‏ الحية والعقرب والفويسقة ويرمي الغراب ولا يقتله والكلب العقور والحدأة والسبع العادي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) was asked which of the creatures a pilgrim in sacred state could kill. He replied: The snake, the scorpion, the rat; he should drive away the pied crow, but should not kill it; the biting dog, the kite, and any wild animal which attacks (man).",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بهز بن أسد، وهاشم، - يعني ابن القاسم - قالا حدثنا سليمان بن المغيرة، عن ثابت، عن عبد الله بن رباح، عن أبي هريرة، قال أقبل رسول الله صلى الله عليه وسلم فدخل مكة فأقبل رسول الله صلى الله عليه وسلم إلى الحجر فاستلمه ثم طاف بالبيت ثم أتى الصفا فعلاه حيث ينظر إلى البيت فرفع يديه فجعل يذكر الله ما شاء أن يذكره ويدعوه قال والأنصار تحته قال هاشم فدعا وحمد الله ودعا بما شاء أن يدعو ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) came an entered Mecca, and after the Messenger of Allah (ﷺ) had gone forward to the Stone, and touched it, he went round the House (the Ka'bah). He then went to as-Safa and mounted it so that he could look at the House. Then he raised his hands began to make mention of Allah as much as he wished and make supplication. The narrator said: The Ansar were beneath him. The narrator Hashim said: He prayed and praised Allah and asked Him for what he wished to ask.",
      "chain": [
        "30007",
        "20214",
        "20390",
        "20236",
        "11269",
        "11865",
        "13"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول طاف النبي صلى الله عليه وسلم في حجة الوداع على راحلته بالبيت وبالصفا والمروة ليراه الناس وليشرف وليسألوه فإن الناس غشوه ‏.‏",
      "text_en": " Jabir bin ‘Abd Allah said The Prophet(ﷺ) performed the circumambulation of the House(the  Ka’bah) on his Camel at the Farewell Pilgrimage and ran between Al Safa’ and Al Marwah, so that the people could see him, remain well informed about him and ask him questions(about Hajj) for the people surrounded him.",
      "chain": [
        "30007",
        "20031",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1887",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، يقول فيم الرملان اليوم والكشف عن المناكب، وقد أطأ الله الإسلام ونفى الكفر وأهله مع ذلك لا ندع شيئا كنا نفعله على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Aslam said:                      I heard Umar ibn al-Khattab say: What is the need of walking proudly (ramal) and moving the shoulders (while going round the Ka'bah)? Allah has now strengthened Islam and obliterated disbelief and the infidels. In spite of that we shall not forsake anything that we used to do during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "30007",
        "20443",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1906",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا سليمان يعني ابن بلال، ح وحدثنا أحمد بن حنبل، حدثنا عبد الوهاب الثقفي، - المعنى واحد - عن جعفر بن محمد، عن أبيه، أن النبي صلى الله عليه وسلم صلى الظهر والعصر بأذان واحد بعرفة ولم يسبح بينهما وإقامتين وصلى المغرب والعشاء بجمع بأذان واحد وإقامتين ولم يسبح بينهما ‏.‏ قال أبو داود هذا الحديث أسنده حاتم بن إسماعيل في الحديث الطويل ووافق حاتم بن إسماعيل على إسناده محمد بن علي الجعفي عن جعفر عن أبيه عن جابر إلا أنه قال فصلى المغرب والعتمة بأذان وإقامة ‏.‏",
      "text_en": " Ja’far bin Muhammad reported on the authority of his father The Prophet (ﷺ) prayed the noon and the afternoon prayers with one adhan and two iqamahs at ‘Arafah and he did not offer supererogatory prayers between them. He prayed the sunset and night prayers at Al Muzdalifah with one adhan and two iqamahs and he did not offer supererogatory prayers between them.Abu Dawud said This tradition has been narrated by Hatim bin Isma’il as a part of the lengthy tradition. Muhammad bin ‘Ali Al Ju’fi narrated it from Ja’far from his father on the authority of Jabir, like the tradition transmitted by Hatim bin Isma’il. But this version has He offered the sunset and night prayers with one adhan and one iqamah.",
      "chain": [
        "20164",
        "20160",
        "30007",
        "20259",
        "10898",
        "11442"
      ]
    },
    {
      "hadith_no": "1907",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، حدثنا جعفر، حدثنا أبي، عن جابر، قال ثم قال النبي صلى الله عليه وسلم ‏\"‏ قد نحرت ها هنا ومنى كلها منحر ‏\"‏ ‏.‏ ووقف بعرفة فقال ‏\"‏ قد وقفت ها هنا وعرفة كلها موقف ‏\"‏ ‏.‏ ووقف في المزدلفة فقال ‏\"‏ قد وقفت ها هنا ومزدلفة كلها موقف ‏\"‏ ‏.‏",
      "text_en": " Jabir said then the Prophet (ﷺ) said “I sacrificed here and the whole of Mina is the place of sacrifice”. He stationed at ‘Arafah and said “I stationed here and the whole of ‘Arafah is the place of station”. He stationed at Al Muzadalifah and said “I stationed here and the whole of Al Muzadalifah is the place of station.”",
      "chain": [
        "30007",
        "20031",
        "11407",
        "34"
      ]
    },
    {
      "hadith_no": "1913",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يعقوب، حدثنا أبي، عن ابن إسحاق، حدثني نافع، عن ابن عمر، قال غدا رسول الله صلى الله عليه وسلم من منى حين صلى الصبح صبيحة يوم عرفة حتى أتى عرفة فنزل بنمرة وهي منزل الإمام الذي ينزل به بعرفة حتى إذا كان عند صلاة الظهر راح رسول الله صلى الله عليه وسلم مهجرا فجمع بين الظهر والعصر ثم خطب الناس ثم راح فوقف على الموقف من عرفة ‏.‏",
      "text_en": " Ibn ‘Umar said the Apostle of Allaah(ﷺ) proceeded from Mina when he offered the dawn prayer on Yaum Al ‘Arafah (9th of Dhu Al Hijjah) in the morning till he came to ‘Arafah and he descended at Namrah. This is the place where the imam (prayer leader at ‘Arafah) takes his place. When the time of the noon prayer came, the Apostle of Allaah(ﷺ) proceeded earlier and combined the noon and afternoon prayers. He then addressed the people (i.e., recited the sermon) and proceeded. He stationed at a place of stationing in ‘Arafah.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11107",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1914",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا نافع بن عمر، عن سعيد بن حسان، عن ابن عمر، قال لما أن قتل الحجاج ابن الزبير، أرسل إلى ابن عمر أية ساعة كان رسول الله صلى الله عليه وسلم يروح في هذا اليوم قال إذا كان ذلك رحنا ‏.‏ فلما أراد ابن عمر أن يروح قالوا لم تزغ الشمس ‏.‏ قال أزاغت قالوا لم تزغ - أو زاغت - قال فلما قالوا قد زاغت ‏.‏ ارتحل ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     When al-Hajjaj killed Ibn Zubayr, he sent a message to Ibn Umar asking him: At which moment the Messenger of Allah (ﷺ) used to proceed (to Arafat) this day? He replied: When it happens so, we shall proceed. When Ibn Umar intended to proceed, the people said: The sun did not decline. He (Ibn Umar) asked: Did it decline? They replied: It did not decline. When they said that the sun had declined, he proceeded.",
      "chain": [
        "30007",
        "20032",
        "20203",
        "10639",
        "18"
      ]
    },
    {
      "hadith_no": "1922",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن آدم، حدثنا سفيان، عن عبد الرحمن بن عياش، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي، قال ثم أردف أسامة فجعل يعنق على ناقته والناس يضربون الإبل يمينا وشمالا لا يلتفت إليهم ويقول ‏\"‏ السكينة أيها الناس ‏\"‏ ‏.‏ ودفع حين غابت الشمس ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet then took up Usamah behind him (on the camel), and drove the camel at a quick pace. The people were beating their camels right and left, but he did not pay attention to them; he was saying: O people, preserve a quiet demeanour. He proceeded (from Arafat) when the sun had set.",
      "chain": [
        "30007",
        "20364",
        "20012",
        "20016",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "1924",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يعقوب، حدثنا أبي، عن ابن إسحاق، حدثني إبراهيم بن عقبة، عن كريب، مولى عبد الله بن عباس عن أسامة، قال كنت ردف النبي صلى الله عليه وسلم فلما وقعت الشمس دفع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Usamah said:                      I rode behind the Prophet(ﷺ) When the sun set Apostle of Allaah(ﷺ) returned from ‘Arafah (to Al Muzdalifah).",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11107",
        "11125",
        "50"
      ]
    },
    {
      "hadith_no": "1927",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا حماد بن خالد، عن ابن أبي ذئب، عن الزهري، بإسناده ومعناه وقال بإقامة إقامة جمع بينهما ‏.‏ قال أحمد قال وكيع صلى كل صلاة بإقامة ‏.‏",
      "text_en": " The aforesaid tradition has been transmitted by Al Zuhri through a different chain of narrators. This version adds “Each prayer with an iqamah”. Ahmad reported on the authority of Waki’ “he offered each prayer with a single iqamah.”",
      "chain": [
        "30007",
        "20537",
        "20177",
        "30007"
      ]
    },
    {
      "hadith_no": "1935",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن آدم، حدثنا سفيان، عن عبد الرحمن بن عياش، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي، قال فلما أصبح - يعني النبي صلى الله عليه وسلم - ووقف على قزح فقال ‏\"‏ هذا قزح وهو الموقف وجمع كلها موقف ونحرت ها هنا ومنى كلها منحر فانحروا في رحالكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When the morning came, the Prophet (ﷺ) stood at the mountain Quzah and said: This is Quzah, and this is a place of stationing, and the whole of al-Muzdalifah is a place of stationing.  I sacrificed the animals here, and the whole of Mina is a place of sacrifice. So sacrifice in your dwellings.",
      "chain": [
        "30007",
        "20364",
        "20012",
        "20016",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "1939",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، أخبرني عبيد الله بن أبي يزيد، أنه سمع ابن عباس، يقول أنا ممن، قدم رسول الله صلى الله عليه وسلم ليلة المزدلفة في ضعفة أهله ‏.‏",
      "text_en": " Ibn ‘Abbas said I was among the weak members of his family whom the Apostle of Allaah(ﷺ) sent ahead on the night of Al Muzdalifah.",
      "chain": [
        "30007",
        "20005",
        "11258",
        "17"
      ]
    },
    {
      "hadith_no": "1951",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن حميد الأعرج، عن محمد بن إبراهيم التيمي، عن عبد الرحمن بن معاذ، عن رجل، من أصحاب النبي صلى الله عليه وسلم قال خطب النبي صلى الله عليه وسلم الناس بمنى ونزلهم منازلهم فقال ‏\"‏ لينزل المهاجرون ها هنا ‏\"‏ ‏.‏ وأشار إلى ميمنة القبلة ‏\"‏ والأنصار ها هنا ‏\"‏ ‏.‏ وأشار إلى ميسرة القبلة ‏\"‏ ثم لينزل الناس حولهم ‏\"‏ ‏.‏",
      "text_en": " AbdurRahman ibn Mu'adh said that he heard a man from the Companions of the Prophet (ﷺ) say:                      The Prophet (ﷺ) addressed the people at Mina and he made them stay in their dwellings. He then said: The Muhajirun (Emigrants) should stay here, and he made a sign to the right side of the qiblah, and the Ansar (the Helpers) here, and he made a sign to the left side of the qiblah; the people should stay around them.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11213"
      ]
    },
    {
      "hadith_no": "1970",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن ابن جريج، أخبرني أبو الزبير، سمعت جابر بن عبد الله، يقول رأيت رسول الله صلى الله عليه وسلم يرمي على راحلته يوم النحر يقول ‏\"‏ لتأخذوا مناسككم فإني لا أدري لعلي لا أحج بعد حجتي هذه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     I saw the Messenger of Allah (ﷺ) throwing pebbles on the day of sacrifice while on his riding beast and saying: Learn your rites, for I do not know whether I am likely to perform Hajj after this occasion.",
      "chain": [
        "30007",
        "20031",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1971",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول رأيت رسول الله صلى الله عليه وسلم يرمي على راحلته يوم النحر ضحى فأما بعد ذلك فبعد زوال الشمس ‏.‏",
      "text_en": " Narrated Jabir :                     I saw the Messenger of Allah (ﷺ) throwing pebbles on the day of sacrifice while on his riding beast in the forenoon, and next when the sun had passed the meridian.",
      "chain": [
        "30007",
        "20031",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1998",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم أفاض يوم النحر ثم صلى الظهر بمنى يعني راجعا ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Prophet (ﷺ) performed the obligatory circumambulation (Tawaf al-Ziyarah) on the day of the sacrifice ; he then offered the noon prayer at Mina when he returned.",
      "chain": [
        "30007",
        "20121",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1999",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، ويحيى بن معين، - المعنى واحد - قالا حدثنا ابن أبي عدي، عن محمد بن إسحاق، حدثنا أبو عبيدة بن عبد الله بن زمعة، عن أبيه، وعن أمه، زينب بنت أبي سلمة عن أم سلمة، - يحدثانه جميعا ذاك عنها - قالت كانت ليلتي التي يصير إلى فيها رسول الله صلى الله عليه وسلم مساء يوم النحر فصار إلى ودخل على وهب بن زمعة ومعه رجل من آل أبي أمية متقمصين فقال رسول الله صلى الله عليه وسلم لوهب ‏\"‏ هل أفضت أبا عبد الله ‏\"‏ ‏.‏ قال لا والله يا رسول الله ‏.‏ قال صلى الله عليه وسلم ‏\"‏ انزع عنك القميص ‏\"‏ ‏.‏ قال فنزعه من رأسه ونزع صاحبه قميصه من رأسه ثم قال ولم يا رسول الله قال ‏\"‏ إن هذا يوم رخص لكم إذا أنتم رميتم الجمرة أن تحلوا ‏\"‏ ‏.‏ يعني من كل ما حرمتم منه إلا النساء ‏\"‏ فإذا أمسيتم قبل أن تطوفوا هذا البيت صرتم حرما كهيئتكم قبل أن ترموا الجمرة حتى تطوفوا به ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The night which the Messenger of Allah (ﷺ) passed with me was the one that followed the day of sacrifice. He came to me and Wahb ibn Zam'ah also visited me. A man belonging to the lineage of AbuUmayyah accompanied him. Both of them were wearing shirts.  The Messenger of Allah (ﷺ) said to Wahb: Did you perform the obligatory circumambulation (Tawaf az-Ziyarah), AbuAbdullah?  He said: No, by Allah Messenger of Allah.  He (the Prophet) said: Take off your shirt. He then took it off over his head, and his companion too took his shirt off over his head.  He then asked: And why (this), Messenger of Allah?  He replied: On this day you have been allowed to take off ihram when you have thrown the stones at the jamrahs, that is, everything prohibited during the state of ihram is lawful except intercourse with a woman. If the evening comes before you go round this House (the Ka'bah) you will remain in the sacred state (i.e. ihram), just like the state in which you were before you threw stones at the jamrahs, until you perform the circumambulation of it (i.e. the Ka'bah).",
      "chain": [
        "30007",
        "30020",
        "20276",
        "11107",
        "11120",
        "244"
      ]
    },
    {
      "hadith_no": "2008",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن هشام، عن أبيه، عن عائشة، قالت إنما نزل رسول الله صلى الله عليه وسلم المحصب ليكون أسمح لخروجه وليس بسنة فمن شاء نزله ومن شاء لم ينزله ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) alighted at al-Muhassab so that it might be easier for him to proceed (to Medina). It is not a sunnah (i.e. a rite of Hajj). Anyone who desires may alight there, and anyone who does not want may not alight.",
      "chain": [
        "30007",
        "20031",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2009",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، وعثمان بن أبي شيبة المعنى، ح وحدثنا مسدد، قالوا حدثنا سفيان، حدثنا صالح بن كيسان، عن سليمان بن يسار، قال قال أبو رافع لم يأمرني رسول الله صلى الله عليه وسلم أن أنزله ولكن ضربت قبته فنزله ‏.‏ قال مسدد وكان على ثقل النبي صلى الله عليه وسلم وقال عثمان يعني في الأبطح ‏.‏",
      "text_en": " Abu Rafi’ said The Apostle of Allaah(ﷺ) did not command me to align there. But when I pitched his tent there, he alighted. The narrator Musaddad said “He (Abu Rafi’) kept watch over the luggage of the Prophet(ﷺ). The narrator ‘Uthman said That is in Al Abtah.",
      "chain": [
        "30007",
        "30175",
        "20005",
        "11176",
        "11005"
      ]
    },
    {
      "hadith_no": "2010",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن علي بن حسين، عن عمرو بن عثمان، عن أسامة بن زيد، قال قلت يا رسول الله أين تنزل غدا في حجته قال ‏\"‏ هل ترك لنا عقيل منزلا ‏\"‏ ‏.‏ ثم قال ‏\"‏ نحن نازلون بخيف بني كنانة حيث قاسمت قريش على الكفر ‏\"‏ ‏.‏ يعني المحصب وذلك أن بني كنانة حالفت قريشا على بني هاشم أن لا يناكحوهم ولا يبايعوهم ولا يئووهم ‏.‏ قال الزهري والخيف الوادي ‏.‏",
      "text_en": " Usamah bin Zaid said I asked Apostle of Allaah(ﷺ) where will you encamp tomorrow? (This is asked on the occasion of his Hajj). He replied “Did ‘Aqil leave any house for us?” He again said “We shall encamp in the valley (Khaif) of Banu Kinanah where the Quraish took an oath upon disbelief, that is, Al Muhassab.” The oath was that Banu Kinanah concluded a pact with the Quraish against Banu Hashim “they would have no marital relationship with them, nor would give them accommodation nor would have any commercial ties with them.”Al Zuhri said Al Khaif means valley.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "11045",
        "10581",
        "50"
      ]
    },
    {
      "hadith_no": "2013",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عفان، حدثنا حماد بن سلمة، أخبرنا حميد، عن بكر بن عبد الله، عن ابن عمر، وأيوب، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم صلى الظهر والعصر والمغرب والعشاء بالبطحاء ثم هجع هجعة ثم دخل مكة وكان ابن عمر يفعله ‏.‏",
      "text_en": " Ibn ‘Umar said “The Prophet(ﷺ) offered noon, afternoon, evening and night prayers at Al Batha(i.e, Al Muhassab). He then napped for a short while and then entered Makkah. Ibn ‘Umar also used to do so.",
      "chain": [
        "30007",
        "30106",
        "20021",
        "11279",
        "11267",
        "18",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2016",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، حدثني كثير بن كثير بن المطلب بن أبي وداعة، عن بعض، أهلي عن جده، أنه رأى النبي صلى الله عليه وسلم يصلي مما يلي باب بني سهم والناس يمرون بين يديه وليس بينهما سترة ‏.‏ قال سفيان ليس بينه وبين الكعبة سترة ‏.‏ قال سفيان كان ابن جريج أخبرنا عنه قال أخبرنا كثير عن أبيه قال فسألته فقال ليس من أبي سمعته ولكن من بعض أهلي عن جدي ‏.‏",
      "text_en": " Narrated Kathir b. Kathir b. al-Muttalib b. Abi Wida'ahFrom his people on the authority of his grandfather:                      He saw that the Prophet (ﷺ) was praying at the place adjacent to the gate of Banu Sahm and the people were passing before him, and there was no covering (sutrah) between them. The narrator Sufyan said: There was no covering between him and the Ka'bah.Sufyan said: Ibn Juraij reported us stating that Kathir reported on the authority of his father saying: I did not hear my father say, but I heard some of my people on the authority of my grandfather.",
      "chain": [
        "30007",
        "20005",
        "11563"
      ]
    },
    {
      "hadith_no": "2017",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني يحيى، - يعني ابن أبي كثير - عن أبي سلمة، عن أبي هريرة، قال لما فتح الله تعالى على رسول الله صلى الله عليه وسلم مكة قام رسول الله صلى الله عليه وسلم فيهم فحمد الله وأثنى عليه ثم قال ‏\"‏ إن الله حبس عن مكة الفيل وسلط عليها رسوله والمؤمنين وإنما أحلت لي ساعة من النهار ثم هي حرام إلى يوم القيامة لا يعضد شجرها ولا ينفر صيدها ولا تحل لقطتها إلا لمنشد ‏\"‏ ‏.‏ فقام عباس أو قال قال العباس يا رسول الله إلا الإذخر فإنه لقبورنا وبيوتنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏ ‏.‏ قال أبو داود وزادنا فيه ابن المصفى عن الوليد فقام أبو شاه - رجل من أهل اليمن - فقال يا رسول الله اكتبوا لي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏ ‏.‏ قلت للأوزاعي ما قوله ‏\"‏ اكتبوا لأبي شاه ‏\"‏ ‏.‏ قال هذه الخطبة التي سمعها من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah said “When Allah, the Exalted, granted the conquest of Makkah to his Apostle, the Prophet(ﷺ) stood among them(the people) and praised Allaah and extolled Him. He then said, Verily Allaah stopped the  Elephant from Makkah, and gave His Apostle  and the believers  sway upon it and it has been made lawful for me only for one hour on one day then it will remain sacred till the Day of Resurrection. Its trees are not to be cut, its game is not to be molested and the things dropped there are to be picked up only by one who publicly announces it. ‘Abbas or Al ‘Abbas suggested “Apostle of Allaah(ﷺ) except the rush(idhkir) for it is useful for our graves and our houses. The Apostle of Allaah(ﷺ) said “Except the rush.” Abu Dawud said “Ibn Al Musaffa added on the authority of Al Walid Abu Shah a man from the people of the Yemen stood and said “Give me in writing, Apostle of Allaah(ﷺ)”. The Apostle of Allaah(ﷺ) said “Give in writing to Abu Shah. I said to Al Awza’i “What does the statement mean? Give Abu Shah in writing?” He said “This was an address which he heard from the Apostle of Allaah(ﷺ).”",
      "chain": [
        "30007",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2019",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، حدثنا إسرائيل، عن إبراهيم بن مهاجر، عن يوسف بن ماهك، عن أمه، عن عائشة، قالت قلت يا رسول الله ألا نبني لك بمنى بيتا أو بناء يظلك من الشمس فقال ‏\"‏ لا إنما هو مناخ من سبق إليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I said: Messenger of Allah, should we not build a house or a building which shades you from the sun? He replied: No, it is a place for the one who reaches there earlier.",
      "chain": [
        "30007",
        "20033",
        "20311",
        "10739",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "2031",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن محمد المحاربي، عن الشيباني، عن واصل الأحدب، عن شقيق، عن شيبة، - يعني ابن عثمان - قال قعد عمر بن الخطاب - رضى الله عنه - في مقعدك الذي أنت فيه فقال لا أخرج حتى أقسم مال الكعبة ‏.‏ قال قلت ما أنت بفاعل ‏.‏ قال بلى لأفعلن ‏.‏ قال قلت ما أنت بفاعل ‏.‏ قال لم قلت لأن رسول الله صلى الله عليه وسلم قد رأى مكانه وأبو بكر - رضى الله عنه - وهما أحوج منك إلى المال فلم يخرجاه ‏.‏ فقام فخرج ‏.‏",
      "text_en": " Shaibah bin ‘Uthman said “‘Umar bin Al Khattab was sitting in the place where you are sitting. He said I shall not go out until I distribute the property of The Ka’bah. I said “You will not do it.” He asked “Why?” I said “For the Apostle of Allaah(ﷺ) and Abu Bakr had seen its place and they were more in need of the property than you, but they did not take it out. He (‘Umar) stood up and went out.”",
      "chain": [
        "30007",
        "20333",
        "11352",
        "11353",
        "2801"
      ]
    },
    {
      "hadith_no": "2048",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، أخبرنا الأعمش، عن سالم بن أبي الجعد، عن جابر بن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أتزوجت ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ بكرا أم ثيبا ‏\"‏ ‏.‏ فقلت ثيبا ‏.‏ قال ‏\"‏ أفلا بكر تلاعبها وتلاعبك ‏\"‏ ‏.‏",
      "text_en": " Jabir bin ‘Abd Allah said “The Apostle of Allaah(ﷺ) said to me “Did you marry?” I said “Yes”. He again said “Virgin or Non Virgin (woman previously married)?” I said “Non Virgin”. He said “Why (did you) not (marry) a virgin with whom you could sport and she could sport with you.",
      "chain": [
        "30007",
        "20354",
        "11060",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "2069",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يعقوب بن إبراهيم بن سعد، حدثني أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي - رضى الله عنهما - لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى يبلغ إلى نفسي إن علي بن أبي طالب - رضى الله عنه - خطب بنت أبي جهل على فاطمة - رضى الله عنها - فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وأنا أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " ‘Ali bin al-Hussain said that when they returned to Madeenah from Yazid bin Mu’awiyah the place of massacre of Al Hussain bin Ali(may Allaah be pleased with him) Al Miswar bin Makhramah met them and said “tell me if you have any need for me. I said to him “No”. He then said Will you not give me the sword of the Apostle of Allaah(ﷺ)? I fear the people may not take it from you by force. (He said) By Allaah if you give it to me no one can take it from me so long as I am alive. Ali bin Abi Talib (may Allaah be pleased with him) asked for the hand of Abu Jahl’s daughter in marriage after the marriage with Fathima. I heard the Apostle of Allaah(ﷺ) say while he was addressing the people about this matter on the pulpit and I was mature in those days. Fathima is from me and I am not afraid that she will be tried in respect of her religion. He then mentioned his other son-in-law who belonged to Banu ‘Abd Shams. He admired him immensely for his relationship with him and extolled him well. He said “He talked to me and talked truly and he made promise with me and fulfilled it. I do not make lawful what Is unlawful and unlawful what is lawful. But, by Allaah the daughter of the Apostle of Allaah(ﷺ) and the daughter of the enemy of Allaah can never be combined together.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "2071",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن يونس، وقتيبة بن سعيد، - المعنى - قال أحمد حدثنا الليث، حدثني عبد الله بن عبيد الله بن أبي مليكة القرشي التيمي، أن المسور بن مخرمة، حدثه أنه، سمع رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ إن بني هشام بن المغيرة استأذنوني أن ينكحوا ابنتهم من علي بن أبي طالب فلا آذن ثم لا آذن ثم لا آذن إلا أن يريد ابن أبي طالب أن يطلق ابنتي وينكح ابنتهم فإنما ابنتي بضعة مني يريبني ما أرابها ويؤذيني ما آذاها ‏\"‏ ‏.‏ والإخبار في حديث أحمد ‏.‏",
      "text_en": " Al Miswar bin Makramah said that he heard the Apostle of Allaah(ﷺ) say on the pulpit Banu Hashim bin Al Mughirah sought permission from me to marry their daughter  to ‘Ali bin Abi Talib. But I do not permit, again, I do not permit, again, I do not permit except that Ibn Abi Talib divorces my daughter and marries their daughter. My daughter is my part, what makes her uneasy makes me uneasy and what troubles her troubles me. The full information rests with the tradition narrated by Ahmad.",
      "chain": [
        "30184",
        "30367",
        "30007",
        "20023",
        "2201"
      ]
    },
    {
      "hadith_no": "2078",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن حنبل، وعثمان بن أبي شيبة، - وهذا لفظ إسناده - وكلاهما عن وكيع، حدثنا الحسن بن صالح، عن عبد الله بن محمد بن عقيل، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما عبد تزوج بغير إذن مواليه فهو عاهر ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: If any slave marries without the permission of his masters, he is a fornicator.",
      "chain": [
        "30007",
        "30203",
        "20032",
        "20647",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "2099",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن زياد بن سعد، عن عبد الله بن الفضل، بإسناده ومعناه قال ‏\"‏ الثيب أحق بنفسها من وليها والبكر يستأمرها أبوها ‏\"‏ ‏.‏ قال أبو داود ‏\"‏ أبوها ‏\"‏ ‏.‏ ليس بمحفوظ ‏.‏",
      "text_en": " The above tradition has been transmitted by ‘Abd Allaah bin Al Fadl through his chain of narrators and with different meaning. The version goes “A woman without a husband has more right to her person than her guardian and the father of a virgin should ask her permission about herself.”Abu Dawud said “ The word “her father” is not guarded.",
      "chain": [
        "30007",
        "20005",
        "11245"
      ]
    },
    {
      "hadith_no": "2257",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، قال سمع عمرو، سعيد بن جبير يقول سمعت ابن عمر، يقول قال رسول الله صلى الله عليه وسلم للمتلاعنين ‏\"‏ حسابكما على الله أحدكما كاذب لا سبيل لك عليها ‏\"‏ ‏.‏ قال يا رسول الله مالي ‏.‏ قال ‏\"‏ لا مال لك إن كنت صدقت عليها فهو بما استحللت من فرجها وإن كنت كذبت عليها فذلك أبعد لك ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar said “The Apostle of Allaah(ﷺ) said to the spouses who invoked curses on each other. Your reckoning is in Allaah’s hands for one of you is liar there is no way for you to (remarry) her. He then asked Apostle of Allaah(ﷺ) what about my property? He replied “There is no property for you. If you have spoken the truth, it is the price for your having had the right to intercourse with her and if you have lied against her it is still more remote for you.",
      "chain": [
        "30007",
        "20005",
        "18"
      ]
    },
    {
      "hadith_no": "2258",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا إسماعيل، حدثنا أيوب، عن سعيد بن جبير، قال قلت لابن عمر رجل قذف امرأته ‏.‏ قال فرق رسول الله صلى الله عليه وسلم بين أخوى بني العجلان وقال ‏\"‏ الله يعلم أن أحدكما كاذب ‏.‏ فهل منكما تائب ‏\"‏ ‏.‏ يرددها ثلاث مرات فأبيا ففرق بينهما ‏.‏",
      "text_en": " Sa’d bin Jubair said I asked Ibn ‘Umar A man accused his wife of adultery? He said “The Apostle of Allaah(ﷺ) separated the brother and the sister of Banu Al ‘Ajilan (i.e., husband and wife). He said Allaah knows that one of you is a liar, will one of you repent? He repeated these words three times, but they refused. So he separated them from each other.",
      "chain": [
        "30007",
        "20208",
        "11015",
        "11050"
      ]
    },
    {
      "hadith_no": "2297",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن ابن جريج، قال أخبرني أبو الزبير، عن جابر، قال طلقت خالتي ثلاثا فخرجت تجد نخلا لها فلقيها رجل فنهاها فأتت النبي صلى الله عليه وسلم فذكرت ذلك له فقال لها ‏\"‏ اخرجي فجدي نخلك لعلك أن تصدقي منه أو تفعلي خيرا ‏\"‏ ‏.‏",
      "text_en": " Jabir said “My maternal aunt was divorced by three pronouncements and she went out to cut down fruit from her palm trees. A man met her and forbade her (to go out). So she went to the Prophet (ﷺ) and mentioned it to him. He said “Go out, and cut down fruit from your palm trees for perhaps you may give alms (sadaqah) or do an act of kindness.",
      "chain": [
        "30007",
        "20031",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثني عبد الرحمن بن مهدي، حدثني معاوية بن صالح، عن عبد الله بن أبي قيس، قال سمعت عائشة، - رضى الله عنها - تقول كان رسول الله صلى الله عليه وسلم يتحفظ من شعبان ما لا يتحفظ من غيره ثم يصوم لرؤية رمضان فإن غم عليه عد ثلاثين يوما ثم صام ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to count the days in Sha'ban in a manner he did not count any other month; then he fasted when he sighted the new moon of Ramadan; but if the weather was cloudy he counted thirty days and then fasted.",
      "chain": [
        "30007",
        "20033",
        "20675",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "2336",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن توبة العنبري، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه لم يكن يصوم من السنة شهرا تاما إلا شعبان يصله برمضان ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     She never saw the Prophet (ﷺ) fasting the whole month except Sha'ban which he combined with Ramadan.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2351",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا هشام، ح وحدثنا مسدد، حدثنا عبد الله بن داود، عن هشام، - المعنى - قال هشام بن عروة عن أبيه، عن عاصم بن عمر، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا جاء الليل من ها هنا وذهب النهار من ها هنا ‏\"‏ ‏.‏ زاد مسدد ‏\"‏ وغابت الشمس فقد أفطر الصائم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Umar:                     The Prophet (ﷺ) as saying: When the night approaches from this side and the day retreats on that side, and the sun sets  - according to the version of Musaddad - he who fasts has reached the time to break it.",
      "chain": [
        "30007",
        "20032",
        "20295",
        "30175",
        "20330",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2356",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا جعفر بن سليمان، حدثنا ثابت البناني، أنه سمع أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يفطر على رطبات قبل أن يصلي فإن لم تكن رطبات فعلى تمرات فإن لم تكن حسا حسوات من ماء ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Messenger of Allah (ﷺ) used to break his fast before praying with some fresh dates; but if there were no fresh dates, he had a few dry dates, and if there were no dry dates, he took some mouthfuls of water.",
      "chain": [
        "30007",
        "20121",
        "20532",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام، ح وحدثنا أحمد بن حنبل، حدثنا حسن بن موسى، حدثنا شيبان، - جميعا - عن يحيى، عن أبي قلابة، عن أبي أسماء، - يعني الرحبي - عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال شيبان أخبرني أبو قلابة أن أبا أسماء الرحبي حدثه أن ثوبان مولى رسول الله صلى الله عليه وسلم أخبره أنه سمع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: A man who cupped and a man  who has himself cupped broke their fast. The narrator Shayban said in his version: AbuQilabah told me that AbuAsma' ar-Rahbi told him that Thawban, the client of the Messenger of Allah (ﷺ), told him that he heard the Prophet (ﷺ) say this.",
      "chain": [
        "30175",
        "20031",
        "11065",
        "30007",
        "20240",
        "11449",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا حسن بن موسى، حدثنا شيبان، عن يحيى، قال حدثني أبو قلابة الجرمي، أنه أخبره أن شداد بن أوس بينما هو يمشي مع النبي صلى الله عليه وسلم فذكر نحوه ‏.‏",
      "text_en": " Narrated Shaddad ibn Aws:                     The tradition mentioned above (No. 2361) has also been transmitted by Shaddad ibn Aws through a different chain of narrators. This version adds: While Shaddad ibn Aws was walking along with the Prophet (ﷺ)....The narrator then transmitted the rest of the tradition to the same effect.",
      "chain": [
        "30007",
        "20240",
        "11449",
        "11047"
      ]
    },
    {
      "hadith_no": "2370",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن بكر، وعبد الرزاق، ح وحدثنا عثمان بن أبي شيبة، حدثنا إسماعيل، - يعني ابن إبراهيم - عن ابن جريج، أخبرني مكحول، أن شيخا، من الحى - قال عثمان في حديثه مصدق - أخبره أن ثوبان مولى رسول الله صلى الله عليه وسلم أخبره أن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban, the client of the Prophet (ﷺ):                     The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.",
      "chain": [
        "30007",
        "20277",
        "20121",
        "30203",
        "20208",
        "11070",
        "11066"
      ]
    },
    {
      "hadith_no": "2374",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن عبد الرحمن بن عابس، عن عبد الرحمن بن أبي ليلى، حدثني رجل، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم نهى عن الحجامة والمواصلة ولم يحرمهما إبقاء على أصحابه فقيل له يا رسول الله إنك تواصل إلى السحر ‏.‏ فقال ‏\"‏ إني أواصل إلى السحر وربي يطعمني ويسقيني ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Abi Laila:                     A man from the Companions of the Prophet (ﷺ) told me that the Messenger of Allah (ﷺ) prohibited cupping and perpetual fasting, but he had not made them unlawful showing mercy on his Companions. Thereupon he was asked: Messenger of Allah, you observe perpetual fast till dawn. He replied: I observe perpetual fast till dawn (for) my Lord gives me food and drink.",
      "chain": [
        "30007",
        "20033",
        "20012",
        "11638",
        "11196"
      ]
    },
    {
      "hadith_no": "2397",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن سفيان، حدثني حبيب، عن عمارة، عن ابن المطوس، - قال فلقيت ابن المطوس فحدثني - عن أبيه، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم مثل حديث ابن كثير وسليمان ‏.‏ قال أبو داود واختلف على سفيان وشعبة عنهما ابن المطوس وأبو المطوس ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Hurairah through a different chain of narrators similar to the tradition narrated by Ibn Kathir and Sulaiman.Abu Dawud said:                      Sufyan and Shu'bah differed among themselves on the name of the narrator Ibn al-Mutawwas and Abu al-Mutawwas.",
      "chain": [
        "30007",
        "20031",
        "20012",
        "11276",
        "11379",
        "13"
      ]
    },
    {
      "hadith_no": "2431",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن عبد الله بن أبي قيس، سمع عائشة، تقول كان أحب الشهور إلى رسول الله صلى الله عليه وسلم أن يصومه شعبان ثم يصله برمضان ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The month most liked by the Messenger of Allah (ﷺ) for fasting was Sha'ban. He then joined it with Ramadan.",
      "chain": [
        "30007",
        "20033",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "2448",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن عيسى، ومسدد، - والإخبار في حديث أحمد - قالوا حدثنا سفيان قال سمعت عمرا قال أخبرني عمرو بن أوس سمعه من عبد الله بن عمرو قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أحب الصيام إلى الله تعالى صيام داود وأحب الصلاة إلى الله صلاة داود كان ينام نصفه ويقوم ثلثه وينام سدسه وكان يفطر يوما ويصوم يوما ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'And (b. al-'As) said:                      The Messenger of Allah (ﷺ) said to me: The fast most liked by Allah is the one observed by Dawud (David), and the prayer dearer to Allah is the one offered by Dawud (David): he would sleep half the night, and stand (in prayer) one-third of it, and sleep one-sixth of it. He would go without fasting one day, and fast the other day.",
      "chain": [
        "30007",
        "31167",
        "20005",
        "3",
        "11437"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عقبة بن خالد، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم سبق بين الخيل وفضل القرح في الغاية ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) used to hold a race between horses and kept the one in the fifth year at a long distance.",
      "chain": [
        "30007",
        "20344",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، قال حدثنا أبو نوح، قال أخبرنا عكرمة بن عمار، قال حدثنا سماك الحنفي، قال حدثنا ابن عباس، قال حدثني عمر بن الخطاب، قال لما كان يوم بدر فأخذ - يعني النبي صلى الله عليه وسلم - الفداء أنزل الله عز وجل ‏{‏ ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض ‏}‏ إلى قوله ‏{‏ لمسكم فيما أخذتم ‏}‏ من الفداء ثم أحل لهم الله الغنائم ‏.‏ قال أبو داود سمعت أحمد بن حنبل يسأل عن اسم أبي نوح فقال أيش تصنع باسمه اسمه اسم شنيع ‏.‏ قال أبو داود اسم أبي نوح قراد والصحيح عبد الرحمن بن غزوان ‏.‏",
      "text_en": " ‘Umar bin Al Khattab said “During the battle of Badr, the Prophet (ﷺ) took ransom”. Thereupon Allaah Most High sent down “It is not fitting for an Apostle that he should have prisoners of war until he hath thoroughly subdued the land. You look on the temporal goods of this world, but Allaah looketh to the Hereafter”. And Allaah is exalted in might and Wise. Had it not been for a previous ordainment from Allaah, a severe penalty would have reached you for the (ransom) that you took. Allaah then made the spoils of war lawful.Abu Dawud said “I heard that Ahmad bin Hanbal was asked about the name of Abu Nuh”. He said “What will you do with his name? His name is a bad one.Abu Dawud said “the name of Abu Nuh is Qurad. What is correct is that his name is ‘Abd Al Rahman bin Ghazwan.",
      "chain": [
        "30007",
        "10704",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "2719",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، قال حدثنا الوليد بن مسلم، قال حدثني صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، قال خرجت مع زيد بن حارثة في غزوة مؤتة فرافقني مددي من أهل اليمن ليس معه غير سيفه فنحر رجل من المسلمين جزورا فسأله المددي طائفة من جلده فأعطاه إياه فاتخذه كهيئة الدرق ومضينا فلقينا جموع الروم وفيهم رجل على فرس له أشقر عليه سرج مذهب وسلاح مذهب فجعل الرومي يغري بالمسلمين فقعد له المددي خلف صخرة فمر به الرومي فعرقب فرسه فخر وعلاه فقتله وحاز فرسه وسلاحه فلما فتح الله عز وجل للمسلمين بعث إليه خالد بن الوليد فأخذ من السلب قال عوف فأتيته فقلت يا خالد أما علمت أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل قال بلى ولكني استكثرته ‏.‏ قلت لتردنه عليه أو لأعرفنكها عند رسول الله صلى الله عليه وسلم فأبى أن يرد عليه قال عوف فاجتمعنا عند رسول الله صلى الله عليه وسلم فقصصت عليه قصة المددي وما فعل خالد فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا خالد ما حملك على ما صنعت ‏\"‏ قال يا رسول الله استكثرته ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا خالد رد عليه ما أخذت منه ‏\"‏ ‏.‏ قال عوف فقلت له دونك يا خالد ألم أف لك فقال رسول الله صلى الله عليه وسلم ‏\"‏ وما ذلك ‏\"‏ فأخبرته قال فغضب رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا خالد لا ترد عليه هل أنتم تاركون لي أمرائي لكم صفوة أمرهم وعليهم كدره ‏\"‏ ‏.‏",
      "text_en": " ‘Awf bin malik Al Ashja’I said “I went out with Zaid bin Harith in the battle of Mutah. For the reinforcement of the Muslim army a man from the people of Yemen accompanied me. He had only his sword with him. A man from the Muslims slaughtered a Camel. The man for the reinforcement asked him for a part of its skin which he gave him. He made it like the shape of a shield. We went on and met the Byzantine armies. There was a man among them on a reddish horse with a golden saddle and golden weapons. This Byzantinian soldiers began to attack the Muslims desperately. The man for reinforcement sat behind a rock for (attacking) him. He hamstrung his horse and overpowered him and then killed him. He took his horse and weapons. When Allah, Most High, bestowed victory on the Muslims. Khalid bin Al Walid sent for him and took his spoils. ‘Awf said “I came to him and said “Khalid, do you know that the Apostle of Allaah(ﷺ) had decided to give spoils to the killer? He said “Yes, I thought it abundant. I said “You should return it to him, or I shall tell you about it before the Apostle of Allaah(ﷺ). But he refused to return it. ‘Awf said “We then assembled with the Apostle of Allaah(ﷺ). I told him the story of the man of reinforcement and what Khalid had done. The Apostle of Allaah(ﷺ) said “Khalid, what made you do the work you have done?” He said “Apostle of Allaah(ﷺ), I considered it to be abundant. The Apostle of Allaah(ﷺ) said “Khalid, return it to him what you have taken from him.” ‘Awf said “I said to him “here you are, Khalid. Did I not keep my word? The Apostle of Allaah(ﷺ) said “What is that? I then informed him.” He said “The Apostle of Allaah(ﷺ) became angry and said “Khalid, do not return it to him. Are you going to leave my commanders? You may take from them what is best for you and eave to them what is worst.",
      "chain": [
        "30007",
        "20733",
        "10921",
        "10942",
        "3051"
      ]
    },
    {
      "hadith_no": "2720",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، قال حدثنا الوليد، قال سألت ثورا عن هذا الحديث، فحدثني عن خالد بن معدان، عن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، نحوه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Awf bin Malik Al Ashja’I through a different chain of narrators.",
      "chain": [
        "30007",
        "20733",
        "11155",
        "11422",
        "4097",
        "4098",
        "3051"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - عن محمد بن زيد، قال حدثني عمير، مولى آبي اللحم قال شهدت خيبر مع سادتي فكلموا في رسول الله صلى الله عليه وسلم فأمر بي فقلدت سيفا فإذا أنا أجره فأخبر أني مملوك فأمر لي بشىء من خرثي المتاع ‏.‏ قال أبو داود معناه أنه لم يسهم له ‏.‏ قال أبو داود وقال أبو عبيد كان حرم اللحم على نفسه فسمي آبي اللحم ‏.‏",
      "text_en": " Narrated Umayr, client of AbulLahm:                     I was present at Khaybar along with my masters who spoke about me to the Messenger of Allah (ﷺ). He ordered about me, and a sword was girded on me and I was trailing it. He was then informed that I was a slave. He, therefore, ordered that I should be given some inferior goods.Abu Dawud said: This means that he (the Prophet) did not allot a portion of the spoils.Abu Dawud said: Abu 'Ubaid said: As he (the narrator Abi al-Lahm) made eating meat unlawful on himself, he was called Abi al-Lahm (one who hates meat).",
      "chain": [
        "30007",
        "20212",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "2733",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أسهم لرجل ولفرسه ثلاثة أسهم سهما له وسهمين لفرسه ‏.‏",
      "text_en": " Ibn ‘Umar said “The Apostle of Allaah(ﷺ) allotted three portions for a man and his horse, one for him and two for his horse.",
      "chain": [
        "30007",
        "20354",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2734",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، حدثنا عبد الله بن يزيد، حدثني المسعودي، حدثني أبو عمرة، عن أبيه، قال أتينا رسول الله صلى الله عليه وسلم أربعة نفر ومعنا فرس فأعطى كل إنسان منا سهما وأعطى للفرس سهمين ‏.‏",
      "text_en": " Narrated AbuUmrah (al-Ansari?):                     We four persons, came to the Messenger of Allah (ﷺ), and we (i.e. each one of us) had horses. He therefore, allotted one portion for each of us, and two portions for his horse.",
      "chain": [
        "30007",
        "20354",
        "1945",
        "20724"
      ]
    },
    {
      "hadith_no": "2778",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا سيار، عن الشعبي، عن جابر بن عبد الله، قال كنا مع النبي صلى الله عليه وسلم في سفر فلما ذهبنا لندخل قال ‏\"‏ أمهلوا حتى ندخل ليلا لكى تمتشط الشعثة وتستحد المغيبة ‏\"‏ ‏.‏ قال أبو داود قال الزهري الطروق بعد العشاء ‏.‏ قال أبو داود وبعد المغرب لا بأس به ‏.‏",
      "text_en": " Jabir bin ‘Abd Allaah said “We were on a journey with the Apostle of Allaah(ﷺ). When we were going to come to our family, he said “Stay till we enter during the night, so that the disheveled woman combs herself and the woman whose husband has been away cleans herself.Abu Dawud aid “Al Zuhri said “(this prohibition applies) when one arrives after the night prayer.Abu dawud said “There is no harm in coming (to one’s family) after the sunset prayer.",
      "chain": [
        "30007",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2807",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، حدثنا عبد الملك، عن عطاء، عن جابر بن عبد الله، قال كنا نتمتع في عهد رسول الله صلى الله عليه وسلم نذبح البقرة عن سبعة والجزور عن سبعة نشترك فيها ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     We performed tamattu' during the lifetime of the Messenger of Allah (ﷺ), sacrificed a cow for seven and a camel for seven people. We shared them.",
      "chain": [
        "30007",
        "20468",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2850",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أحمد بن حنبل، حدثنا يحيى بن زكريا بن أبي زائدة، أخبرني عاصم الأحول، عن الشعبي، عن عدي بن حاتم، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وقعت رميتك في ماء فغرق فمات فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Adi b. Hatim:                     The Prophet (ﷺ) as saying: When the animal at which you shot falls in water, is drowned, and dies, do not eat.",
      "chain": [
        "11222",
        "30007",
        "20366",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "2886",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، قال سمعت ابن المنكدر، أنه سمع جابرا، يقول مرضت فأتاني النبي صلى الله عليه وسلم يعودني هو وأبو بكر ماشيين وقد أغمي على فلم أكلمه فتوضأ وصبه على فأفقت فقلت يا رسول الله كيف أصنع في مالي ولي أخوات قال فنزلت آية المواريث ‏{‏ يستفتونك قل الله يفتيكم في الكلالة ‏}‏ ‏.‏",
      "text_en": " Narrated Jabir:                     I fell ill, and the Prophet (ﷺ) and Abu Bakr came to me on foot to visit me. As I was unconscious, I could not speak to him. He performed ablution and sprinkled water on me ; so I became conscious. I said: Messenger of Allah, how should I do in my property, as I have sisters? Thereafter the verse about inheritance was revealed: \"They ask thee for legal decision. Say: Allah directs (thus) about those who leave no descendants or ascendants as heirs.\"",
      "chain": [
        "30007",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2923",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن حنبل، وعبد العزيز بن يحيى المعنى، - قال أحمد - حدثنا محمد بن سلمة، عن ابن إسحاق، عن داود بن الحصين، قال كنت أقرأ على أم سعد بنت الربيع وكانت يتيمة في حجر أبي بكر فقرأت ‏{‏ والذين عقدت أيمانكم ‏}‏ فقالت لا تقرأ ‏{‏ والذين عاقدت أيمانكم ‏}‏ ولكن ‏{‏ والذين عقدت أيمانكم ‏}‏ إنما نزلت في أبي بكر وابنه عبد الرحمن حين أبى الإسلام فحلف أبو بكر ألا يورثه فلما أسلم أمر الله تعالى نبيه عليه السلام أن يؤتيه نصيبه ‏.‏ زاد عبد العزيز فما أسلم حتى حمل على الإسلام بالسيف ‏.‏ قال أبو داود من قال ‏{‏ عقدت ‏}‏ جعله حلفا ومن قال ‏{‏ عاقدت ‏}‏ جعله حالفا والصواب حديث طلحة ‏{‏ عاقدت ‏}‏ ‏.‏",
      "text_en": " Narrated Dawud b. al-Husain:                     I used to learn the reading of the Qur'an from Umm Sa'd, daughter of al-Rabi'. She was an orphan in the guardianship of Abu Bakr. I read the Qur'anic verse \"To those also to whom your right hand was pledged.\" She said: Do not read the verse; \"To those also to whom your right hand was pledged.\" This was revealed about Abu Bakr and his son 'Abd al-Rahman when he refused to accept Islam. Abu Bakr took an oath that he would not give him a share from inheritance. When he embraced Islam Allah Most High commanded His Prophet (ﷺ) to give him the share.The narrator 'Abd al-Aziz added: He did not accept Islam until he was urged on Islam by sword.Abu Dawud said: He who narrated the word 'aqadat means a pact ; and he who narrated the word 'aaqadat means the party who made a pact. The correct is the tradition of Talhah ('aaqadat).",
      "chain": [
        "30007",
        "30007",
        "20672",
        "11107",
        "11160"
      ]
    },
    {
      "hadith_no": "2956",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، عن معمر، عن الزهري، عن أبي سلمة، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم كان يقول ‏\"‏ أنا أولى بكل مؤمن من نفسه فأيما رجل مات وترك دينا فإلى ومن ترك مالا فلورثته ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     The Prophet (ﷺ) as saying: I am nearer to every believer than himself, and if anyone leaves, it goes to his heirs.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2957",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، أخبرني نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم عرضه يوم أحد وهو ابن أربع عشرة فلم يجزه وعرضه يوم الخندق وهو ابن خمس عشرة سنة فأجازه ‏.‏",
      "text_en": " Narrated Nafi':                     That Ibn 'Umar was presented before the Prophet (ﷺ) on the day of Uhud, when he was fourteen years old, but he did not allow him. He was again presented to him on the day of Khandaq (the battle of Trench) when he was fifteen years old, he allowed him.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3007",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، حدثني نافع، مولى عبد الله بن عمر عن عبد الله بن عمر، أن عمر، قال أيها الناس إن رسول الله صلى الله عليه وسلم كان عامل يهود خيبر على أنا نخرجهم إذا شئنا فمن كان له مال فليلحق به فإني مخرج يهود ‏.‏ فأخرجهم ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Umar said: The Messenger of Allah (ﷺ) had transaction with the Jews of Khaybar on condition that we should expel them when we wish. If anyone has property (with them), he should take it back, for I am going to expel the Jews. So he expelled them.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11107",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "3020",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، عن عمر، قال لولا آخر المسلمين ما فتحت قرية إلا قسمتها كما قسم رسول الله صلى الله عليه وسلم خيبر ‏.‏",
      "text_en": " ‘Umar said “Had I not considered the last Muslim, I would have any town I conquered divided as the Apostle of Allaah(ﷺ) had divided Khaibar.”",
      "chain": [
        "30007",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3031",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو أحمد، محمد بن عبد الله حدثنا سفيان، عن أبي الزبير، عن جابر، عن عمر، قال قال رسول الله صلى الله عليه وسلم بمعناه والأول أتم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Umar through a different chain of narrators.” He said “The Apostle of Allaah(ﷺ) said to the same effect. The former version is ore perfect.”",
      "chain": [
        "30007",
        "20005",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "3036",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم وقال رسول الله صلى الله عليه وسلم ‏\"‏ أيما قرية أتيتموها وأقمتم فيها فسهمكم فيها وأيما قرية عصت الله ورسوله فإن خمسها لله وللرسول ثم هي لكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “Whatever town you come to and stay in , your portion is in it, but whatever town disobeys Allaah and His Apostle a fifth of it goes to Allaah and His Apostle and what remains is yours.”",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "3072",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا حماد بن خالد، عن عبد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم أقطع الزبير حضر فرسه فأجرى فرسه حتى قام ثم رمى بسوطه فقال ‏\"‏ أعطوه من حيث بلغ السوط ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) gave az-Zubayr the land as a fief up to the reach of his horse when he runs. He, therefore, made his horse run until it stopped. He then threw his flog. Thereupon he said: Give him (the land) up to the point where his flog has reached.",
      "chain": [
        "30007",
        "20537",
        "20507",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3077",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن بشر، حدثنا سعيد، عن قتادة، عن الحسن، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحاط حائطا على أرض فهي له ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     The Prophet (ﷺ) said: If anyone surrounds a land with a wall, it belongs to him.",
      "chain": [
        "30007",
        "20352",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "3096",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن محمد بن المنكدر، عن جابر، قال كان النبي صلى الله عليه وسلم يعودني ليس براكب بغل ولا برذون ‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet (ﷺ) would visit me (during my illness) riding neither a mule nor a pony.",
      "chain": [
        "30007",
        "20033",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3120",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم سجي في ثوب حبرة ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) was covered with striped Yemen garment (after his death).",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3148",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن أبي الزبير، أنه سمع جابر بن عبد الله، يحدث عن النبي صلى الله عليه وسلم أنه خطب يوما فذكر رجلا من أصحابه قبض فكفن في كفن غير طائل وقبر ليلا فزجر النبي صلى الله عليه وسلم أن يقبر الرجل بالليل حتى يصلى عليه إلا أن يضطر إنسان إلى ذلك وقال النبي صلى الله عليه وسلم ‏\"‏ إذا كفن أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     The Prophet (ﷺ) made a speech one day and mentioned a man from among his Companions who died and was shrouded in a shroud of bad quality, and was buried at night. The Prophet (ﷺ) rebuked that man be buried at night until prayer was offered over him, except that a man was forced to do that. The Prophet (ﷺ) said: When one of you shrouds his brother, he should use a shroud of good quality.",
      "chain": [
        "30007",
        "20121",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثنا الزهري، عن القاسم بن محمد، عن عائشة، قالت أدرج رسول الله صلى الله عليه وسلم في ثوب حبرة ثم أخر عنه ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Messenger of Allah (ﷺ) was shrouded in a garment of Yemeni stuff, it was then removed from him.",
      "chain": [
        "30007",
        "20733",
        "20024",
        "11013",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3151",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن هشام، قال أخبرني أبي، أخبرتني عائشة، قالت كفن رسول الله صلى الله عليه وسلم في ثلاثة أثواب يمانية بيض ليس فيها قميص ولا عمامة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) was shrouded in three garments of white Yemeni stuff, among which was neither a shirt nor a turban.",
      "chain": [
        "30007",
        "20031",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، وعثمان بن أبي شيبة، قالا حدثنا ابن إدريس، عن يزيد، - يعني ابن أبي زياد - عن مقسم، عن ابن عباس، قال كفن رسول الله صلى الله عليه وسلم في ثلاثة أثواب نجرانية الحلة ثوبان وقميصه الذي مات فيه ‏.‏ قال أبو داود قال عثمان في ثلاثة أثواب حلة حمراء وقميصه الذي مات فيه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) was shrouded in three garments made in Najran: two garments and one shirt in which he died.Abu Dawud said: The narrator 'Uthman said: In three garments: two red garments and a shirt in which he died.",
      "chain": [
        "30007",
        "30203",
        "20102",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3157",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، حدثني نوح بن حكيم الثقفي، - وكان قارئا للقرآن - عن رجل، من بني عروة بن مسعود يقال له داود قد ولدته أم حبيبة بنت أبي سفيان زوج النبي صلى الله عليه وسلم عن ليلى بنت قانف الثقفية قالت كنت فيمن غسل أم كلثوم بنت رسول الله صلى الله عليه وسلم عند وفاتها فكان أول ما أعطانا رسول الله صلى الله عليه وسلم الحقاء ثم الدرع ثم الخمار ثم الملحفة ثم أدرجت بعد في الثوب الآخر قالت ورسول الله صلى الله عليه وسلم جالس عند الباب معه كفنها يناولناها ثوبا ثوبا ‏.‏",
      "text_en": " Narrated Layla daughter of Qa'if ath-Thaqafiyyah:                     I was one of those who washed Umm Kulthum, daughter of the Prophet (ﷺ), when she died. The Messenger of Allah (ﷺ) first gave us lower garment, then shirt, then head-wear, then cloak (which covers the whole body), and then she was shrouded in another garment. She said: The Messenger of Allah (ﷺ) was sitting at the door, and he had shroud with him. He gave us the garments one by one.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11107"
      ]
    },
    {
      "hadith_no": "3225",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابرا، يقول سمعت رسول الله صلى الله عليه وسلم نهى أن يقعد على القبر وأن يقصص ويبنى عليه ‏.‏",
      "text_en": " Narrated Jabir:                     I heard the Prophet (ﷺ) forbid to sit on the grave, to plaster it with gypsum, and to build any structure over it.",
      "chain": [
        "30007",
        "20121",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3250",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن سالم، عن أبيه، عن عمر، - رضى الله عنه - قال سمعني رسول الله صلى الله عليه وسلم نحو معناه إلى ‏\"‏ بآبائكم ‏\"‏ ‏.‏ زاد قال عمر فوالله ما حلفت بهذا ذاكرا ولا آثرا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Umar through a different chain of narrators to the same effect up to the words \"by your fathers\". This version adds:                      \" 'Umar said: I swear by Allah, I never swore by it personally or reporting it from others.\"",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "11011",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "3258",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا زيد بن الحباب، حدثنا حسين، - يعني ابن واقد - حدثني عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ من حلف فقال إني بريء من الإسلام فإن كان كاذبا فهو كما قال، وإن كان صادقا فلن يرجع إلى الإسلام سالما ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: If anyone takes an oath and says: I am free from Islam; now if he is a liar (in his oath), he will not return to Islam with soundness.",
      "chain": [
        "30007",
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3261",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن أيوب، عن نافع، عن ابن عمر، يبلغ به النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من حلف على يمين فقال إن شاء الله فقد استثنى ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: If anyone says when swearing an oath: \"If Allah wills,\" he makes an exception.",
      "chain": [
        "30007",
        "20005",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "3264",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا عكرمة بن عمار، عن عاصم بن شميخ، عن أبي سعيد الخدري، قال ‏:‏ كان رسول الله صلى الله عليه وسلم إذا اجتهد في اليمين قال ‏:‏ ‏\"‏ والذي نفس أبي القاسم بيده ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the Messenger of Allah (ﷺ) swore an oath strongly, he said: No, by Him in Whose hand is the soul of AbulQasim.",
      "chain": [
        "30007",
        "20032",
        "10704",
        "38"
      ]
    },
    {
      "hadith_no": "3267",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، ‏:‏ أن أبا بكر، أقسم على النبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ لا تقسم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     AbuBakr adjured the Prophet (ﷺ). The Prophet (ﷺ) said: Do not adjure an oath.",
      "chain": [
        "30007",
        "20005",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "3325",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، حدثني نافع، عن ابن عمر، عن عمر، رضي الله عنه أنه قال ‏:‏ يا رسول الله إني نذرت في الجاهلية أن أعتكف في المسجد الحرام ليلة ‏.‏ فقال له النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ أوف بنذرك ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That 'Umar said: Messenger of Allah, I took a vow in pre-Islamic times that I would stay in the sacred mosque (Masjid Haram) as a devotion (i'tikaf). The Prophet (ﷺ) said: Fulfill your vow.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، عن شعبة، قال كان سفيان أحفظ مني ‏.‏",
      "text_en": " Shu'bah said:                      The memory of Sufyan was stronger than mine.",
      "chain": [
        "30007",
        "20032",
        "20020"
      ]
    },
    {
      "hadith_no": "3347",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن مسعر، عن محارب بن دثار، قال سمعت جابر بن عبد الله، قال كان لي على النبي صلى الله عليه وسلم دين فقضاني وزادني ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) owed me a debt and gave me something extra when he paid it.",
      "chain": [
        "30007",
        "20031",
        "20359",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "3374",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، ويحيى بن معين، قالا حدثنا سفيان، عن حميد الأعرج، عن سليمان بن عتيق، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم نهى عن بيع السنين ووضع الجوائح ‏.‏ قال أبو داود لم يصح عن النبي صلى الله عليه وسلم في الثلث شىء وهو رأى أهل المدينة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) forbade selling fruits years ahead, and commanded that unforeseen loss be remitted in respect of what is affected by blight.Abu Dawud said: The attribution of the tradition regarding the effect of blight is one-third of the produce to the Prophet (ﷺ) is not correct. This is the opinion of the people of Medina.",
      "chain": [
        "30007",
        "30020",
        "20005",
        "11856",
        "34"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه وقال حبل الحبلة أن تنتج الناقة بطنها ثم تحمل التي نتجت ‏.‏",
      "text_en": " A similar tradition has also been narrated by Ibn 'Umar from the Prophet (ﷺ) through a different chain of transmitters. He said:                      Habal al-habalah means that a she-camel delivers an offspring and then the offspring which it delivers becomes pregnant.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسماعيل، ح وحدثنا مسدد، أن حمادا، وعبد الوارث، حدثاهم كلهم، عن أيوب، عن أبي الزبير، - قال عن حماد، وسعيد بن ميناء، ثم اتفقوا - عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة والمخابرة والمعاومة - قال عن حماد وقال أحدهما والمعاومة وقال الآخر بيع السنين ثم اتفقوا - وعن الثنيا ورخص في العرايا ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     The Messenger of Allah (ﷺ) forbade muhaqalah, muzabanah, mukhabarah, and mu'awanah. One of the two narrators from Hammad said the word mu'awamah, and other said: \"selling many years ahead\". The agreed version then goes: and thunya, but gave license for 'araya.",
      "chain": [
        "30007",
        "20208",
        "30175",
        "20022",
        "11015",
        "11263",
        "20022",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "3408",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم عامل أهل خيبر بشطر ما يخرج من ثمر أو زرع ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) made an agreement with the people of Khaibar to work and cultivate in return for half of the fruits or produce.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3415",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، ومحمد بن بكر، قالا حدثنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول خرصها ابن رواحة أربعين ألف وسق وزعم أن اليهود لما خيرهم ابن رواحة أخذوا الثمر وعليهم عشرون ألف وسق ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     Ibn Rawahah assessed them (the amount of dates) at forty thousand wasqs, and when Ibn Rawahah gave them option, the Jews took the fruits in their possession and twenty thousand wasqs of dates were due from them.",
      "chain": [
        "30007",
        "20121",
        "20277",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3433",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من باع عبدا وله مال فماله للبائع إلا أن يشترطه المبتاع ومن باع نخلا مؤبرا فالثمرة للبائع إلا أن يشترط المبتاع ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Prophet (ﷺ) as saying: If anyone buys a slave who possesses property. his property belongs to the seller unless buyer makes a provision and if anyone buys palm-trees after they have been fecundated, the fruit belongs to the seller unless the buyer make a provision.",
      "chain": [
        "30007",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3449",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا معتمر، سمعت محمد بن فضاء، يحدث عن أبيه، عن علقمة بن عبد الله، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم أن تكسر سكة المسلمين الجائزة بينهم إلا من بأس ‏.‏",
      "text_en": " Narrated 'Alqamah b. 'Abdullah:                     On the authority of his father, who said: The Messenger of Allah (ﷺ) forbade to break the coins of the Muslims current among them except for some defect.",
      "chain": [
        "30007",
        "20288",
        "14347",
        "19855"
      ]
    },
    {
      "hadith_no": "3452",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا سفيان بن عيينة، عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم مر برجل يبيع طعاما فسأله ‏\"‏ كيف تبيع ‏\"‏ ‏.‏ فأخبره فأوحي إليه أن أدخل يدك فيه فأدخل يده فيه فإذا هو مبلول فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من غش ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) passed a man who was selling grain. He asked him: How are you selling? He informed him. Revelation them came down to him saying: \"Put your hand into it.\" So he put his hand into it, and felt that it was damp. The Messenger of Allah (ﷺ) then said: \"He who deceives has nothing to do with us.\"",
      "chain": [
        "30007",
        "20005",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3480",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا عمر بن زيد الصنعاني، أنه سمع أبا الزبير، عن جابر، أن النبي صلى الله عليه وسلم نهى عن ثمن الهرة ‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet (ﷺ) forbade payment for cat.",
      "chain": [
        "30007",
        "20121",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3494",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، أخبرني نافع، عن ابن عمر، قال كانوا يتبايعون الطعام جزافا بأعلى السوق فنهى رسول الله صلى الله عليه وسلم أن يبيعوه حتى ينقلوه ‏.‏",
      "text_en": " Ibn 'Umar said:                      They (the people) used to buy grain in the upper part of the market in the same spot without measuring or weighing it. The Messenger of Allah (ﷺ) forbade them to sell it there before removing it.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3513",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسماعيل بن إبراهيم، عن ابن جريج، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشفعة في كل شرك ربعة أو حائط لا يصلح أن يبيع حتى يؤذن شريكه فإن باع فهو أحق به حتى يؤذنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     The Messenger of Allah (ﷺ) as saying: There is the right of option regarding everything which is shared, whether a dwelling or a garden. It is not lawful to sell before informing one's partner, but if he sells without informing him, he has the greatest right to it.",
      "chain": [
        "30007",
        "20208",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3514",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله، قال إنما جعل رسول الله صلى الله عليه وسلم الشفعة في كل مال لم يقسم فإذا وقعت الحدود وصرفت الطرق فلا شفعة ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Messenger of Allah (ﷺ) decreed the right to buy the neighboring property applicable to everything which is not divided, but when boundaries are fixed and separate roads made, there is no option.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "3518",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا عبد الملك، عن عطاء، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بشفعة جاره ينتظر بها وإن كان غائبا إذا كان طريقهما واحدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: The neighbour is most entitled to the right of pre-emption, and he should wait for its exercise even if he is absent, when the two properties have one road.",
      "chain": [
        "30007",
        "20468",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3555",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن جابر بن عبد الله، قال إنما العمرى التي أجازها رسول الله صلى الله عليه وسلم أن يقول هي لك ولعقبك ‏.‏ فأما إذا قال هي لك ما عشت ‏.‏ فإنها ترجع إلى صاحبها ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The life-tenancy which the Messenger of Allah (ﷺ) allowed was only that one should say: It is for you and your descendants. When he says: It is yours as long as you live, it returns to its owner.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "3558",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا داود، عن أبي الزبير، عن جابر، قال قال رسول صلى الله عليه وسلم ‏\"‏ العمرى جائزة لأهلها والرقبى جائزة لأهلها ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: Life-tenancy is lawful for the one to whom it is given and donation of property to go to the survivor is lawful to whom it is given.",
      "chain": [
        "30007",
        "20468",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، حدثنا قرة بن خالد، حدثنا حميد بن هلال، حدثني أبو بردة، قال قال أبو موسى قال النبي صلى الله عليه وسلم ‏\"‏ لن نستعمل - أو لا نستعمل - على عملنا من أراده ‏\"‏ ‏.‏",
      "text_en": " Abu Buradah reported the Prophet (ﷺ) as saying:                      \"We will never employ or we shall not employ (the narrator is doubtful) in our work one who wants it.\"",
      "chain": [
        "30007",
        "20031",
        "11301",
        "11281",
        "1820",
        "30170"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن حنبل، وسلمة بن شبيب، قالا حدثنا عبد الرزاق، - قال أحمد قال - حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كره الاثنان اليمين أو استحباها فليستهما عليها ‏\"‏ ‏.‏ قال سلمة قال أخبرنا معمر وقال إذا أكره الاثنان على اليمين ‏.‏",
      "text_en": " Abu hurairah reported the holy prophet (peace be upon him) as saying:                      When two men dislike the oath or like it,lots will be cost about it. Salamah said on the authority of Ma’mar who said: when the two are compelled to take an oath.",
      "chain": [
        "30007",
        "30417",
        "20121",
        "30007",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3669",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسماعيل بن إبراهيم، حدثنا أبو حيان، حدثني الشعبي، عن ابن عمر، عن عمر، قال نزل تحريم الخمر يوم نزل وهي من خمسة أشياء من العنب والتمر والعسل والحنطة والشعير والخمر ما خامر العقل وثلاث وددت أن رسول الله صلى الله عليه وسلم لم يفارقنا حتى يعهد إلينا فيهن عهدا ننتهي إليه الجد والكلالة وأبواب من أبواب الربا ‏.‏",
      "text_en": " ’Umar said :                      The prohibition of wine came down when (the Quranic verse ) came down. It was  made from five thing namely, grapes, dates, honey, wheat ,barley. Wine is what infects (khamara) the mind. There are three things I wished that the prophet (ﷺ) would not leave us until he explained them fully to our satisfaction: (share of) grandfather, one who leaves  no  descendants or ascendants as hairs, and the details of usury.",
      "chain": [
        "30007",
        "20208",
        "11404",
        "11052",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "3688",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن حاتم بن حريث، عن مالك بن أبي مريم، قال دخل علينا عبد الرحمن بن غنم فتذاكرنا الطلاء فقال حدثني أبو مالك الأشعري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليشربن ناس من أمتي الخمر يسمونها بغير اسمها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Ghanam:                     Malik ibn AbuMaryam said: AbdurRahman ibn Ghanam entered upon us and we discussed tila' and he said: AbuMalik al-Ash'ari told me that he heard the Messenger of Allah (ﷺ) say: Some of my people will assuredly drink wine calling it by another name.",
      "chain": [
        "30007",
        "20650",
        "20675",
        "18138",
        "17058"
      ]
    },
    {
      "hadith_no": "3714",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا حجاج بن محمد، قال قال ابن جريج عن عطاء، أنه سمع عبيد بن عمير، قال سمعت عائشة، - رضى الله عنها - زوج النبي صلى الله عليه وسلم تخبر أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش فيشرب عندها عسلا فتواصيت أنا وحفصة أيتنا ما دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير فدخل على إحداهن فقالت له ذلك فقال ‏\"‏ بل شربت عسلا عند زينب بنت جحش ولن أعود له ‏\"‏ ‏.‏ فنزلت ‏{‏ لم تحرم ما أحل الله لك تبتغي ‏}‏ إلى ‏{‏ إن تتوبا إلى الله ‏}‏ لعائشة وحفصة رضى الله عنهما ‏{‏ وإذ أسر النبي إلى بعض أزواجه حديثا ‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏ ‏.‏",
      "text_en": " A’ishah said that the prophet (ﷺ) used to stay with Zainab, daughter of Jahsh, and drink honey. I and Hafsah counseled each other that if the Prophet (ﷺ) enters upon any of us, she must say :                      I find the smell of gum (maghafir) from you. He then entered upon one of them; she said that to him. Thereupon he said : No, I drank honey at (the house of) Zainab daughter of jahsh, and I will not do it again. Then the following verse came down :’’O Prophet !why holdest thou to be forbidden that which Allah has made lawful to thee ? ‘’Thou seekest. . . If you two turn in repentance to Allah ‘’ refers to Hafsah and A’ishah , and the verse: ‘’When the Prophet disclosed a matter in confidence to one of his consorts’’ refers to the statements of the Prophet (ﷺ) disclosed a matter in confidence to one of his consorts’’ refers to the statement of the Prophet (ﷺ) :No, I drank honey.",
      "chain": [
        "30007",
        "20381",
        "11070",
        "11029",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن ابن جريج، أخبرني عطاء، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أغلق بابك واذكر اسم الله فإن الشيطان لا يفتح بابا مغلقا وأطف مصباحك واذكر اسم الله وخمر إناءك ولو بعود تعرضه عليه واذكر اسم الله وأوك سقاءك واذكر اسم الله ‏\"‏ ‏.‏",
      "text_en": " Jabir reported the Prophet (ﷺ) as saying:                      Shut your door and make mention of Allah's name, for the devil does not open a door which has been shut; extinguish your lamp and make mention of Allah's name, cover up your vessel even by a piece of wood that you just put on it and make mention of Allah's name, and tie up your water-skin mentioning Allah's name.",
      "chain": [
        "30007",
        "20031",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3757",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، - المعنى - قال أحمد حدثني يحيى القطان، عن عبيد الله، قال حدثني نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وضع عشاء أحدكم وأقيمت الصلاة فلا يقوم حتى يفرغ ‏\"‏ ‏.‏ زاد مسدد وكان عبد الله إذا وضع عشاؤه أو حضر عشاؤه لم يقم حتى يفرغ وإن سمع الإقامة وإن سمع قراءة الإمام ‏.‏",
      "text_en": " Ibn ‘Umar reported the Prophet(ﷺ) as sayings:                      When the evening meal is brought before one of you and the congregational prayer is also ready, he should not get up until he finishes(eating). Musaddad’s version adds: When the evening meal was put before ‘Abd Allah b. ‘Umar, or it was brought to him, he did not get up until he finished it, even if he heard call to prayer(just before it), and even if he heard the recitation of the Qur’an by the leader-in-prayer.",
      "chain": [
        "30007",
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3776",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن الزهري، أخبرني أبو بكر بن عبيد الله بن عبد الله بن عمر، عن جده ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أكل أحدكم فليأكل بيمينه وإذا شرب فليشرب بيمينه فإن الشيطان يأكل بشماله ويشرب بشماله ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Prophet(ﷺ) as sayings:                      When any of you eats, he should eat with his right hand, and when he drinks, he should drink with his right hand, for the devil eats with his left hand and drinks with his left hand.",
      "chain": [
        "30007",
        "20005",
        "11013",
        "18"
      ]
    },
    {
      "hadith_no": "3807",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن عبد الملك، قالا حدثنا عبد الرزاق، عن عمر بن زيد الصنعاني، أنه سمع أبا الزبير، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم نهى عن ثمن الهر ‏.‏ قال ابن عبد الملك عن أكل الهر وأكل ثمنها ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     AbuzZubayr quoted the authority of Jabir ibn Abdullah for the statement that the Prophet (ﷺ) forbade payment for a dog. Ibn AbdulMalik said: to eat a cat and to enjoy its price.",
      "chain": [
        "30007",
        "20121",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3825",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أكل من هذه الشجرة فلا يقربن المساجد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: He who eats from this plant should not come near the mosques.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3844",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - عن ابن عجلان، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وقع الذباب في إناء أحدكم فامقلوه فإن في أحد جناحيه داء وفي الآخر شفاء وإنه يتقي بجناحه الذي فيه الداء فليغمسه كله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when a fly alights in anyone’s vessel, he should plunge it all in, for in one of its wings there is a disease, and in the other is a cure. It prevents the wing of it is which there is a cure, so plunge it all in (the vessel).",
      "chain": [
        "30007",
        "20212",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3868",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا عقيل بن معقل، قال سمعت وهب بن منبه، يحدث عن جابر بن عبد الله، قال سئل رسول الله صلى الله عليه وسلم عن النشرة فقال ‏\"‏ هو من عمل الشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) was asked about a charm for one who is possessed (nashrah). He replied: It pertains to the work of the devil.",
      "chain": [
        "30007",
        "20121",
        "11102",
        "34"
      ]
    },
    {
      "hadith_no": "3872",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حسا سما فسمه في يده يتحساه في نار جهنم خالدا مخلدا فيها أبدا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone drinks poison, the poison will be in his hand (on the Day of Judgement) and he will drink it in Hell-fire and he will live in it eternally.",
      "chain": [
        "30007",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3879",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ العين حق ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying :                      The evil is genuine.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3885",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن صالح، وابن السرح، - قال أحمد حدثنا ابن وهب، وقال ابن السرح، - أخبرنا ابن وهب، حدثنا داود بن عبد الرحمن، عن عمرو بن يحيى، عن يوسف بن محمد، - وقال ابن صالح محمد بن يوسف بن ثابت بن قيس بن شماس - عن أبيه، عن جده، عن رسول الله صلى الله عليه وسلم أنه دخل على ثابت بن قيس - قال أحمد - وهو مريض فقال ‏\"‏ اكشف الباس رب الناس ‏\"‏ ‏.‏ عن ثابت بن قيس ثم أخذ ترابا من بطحان فجعله في قدح ثم نفث عليه بماء وصبه عليه ‏.‏ قال أبو داود قال ابن السرح يوسف بن محمد وهو الصواب ‏.‏",
      "text_en": " Narrated Thabit ibn Qays ibn Shammas:                     The Messenger of Allah (ﷺ) entered upon Thabit ibn Qays. The version of Ahmad (ibn Salih) has: When he was ill He (the Prophet) said: Remove the harm, O Lord of men, from Thabit ibn Qays ibn Shammas. He then took some dust of Bathan, and put it in a bowel, and then mixed it with water and blew in it, and poured it on him.Abu Dawud said: Ibn al-Sarh said: Yusuf bin Muhammad is correct (and not Muhammad bin Yusuf)",
      "chain": [
        "30226",
        "30485",
        "30007",
        "20029",
        "30485",
        "20029",
        "20192",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "3919",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن حنبل، وأبو بكر بن أبي شيبة المعنى قالا حدثنا وكيع، عن سفيان، عن حبيب بن أبي ثابت، عن عروة بن عامر، - قال أحمد القرشي - قال ذكرت الطيرة عند النبي صلى الله عليه وسلم فقال ‏\"‏ أحسنها الفأل ولا ترد مسلما فإذا رأى أحدكم ما يكره فليقل اللهم لا يأتي بالحسنات إلا أنت ولا يدفع السيئات إلا أنت ولا حول ولا قوة إلا بك ‏\"‏ ‏.‏",
      "text_en": " Narrated Urwah ibn Amir al-Qurashi:                     When taking omens was mentioned in the presence of the Prophet (ﷺ), he said: The best type is the good omen, and it does not turn back a Muslim. If one of you sees anything he dislikes, he should say: O Allah, no one brings good things except Thee, and no one averts evil things except Thee and there is no might and power but in Allah.",
      "chain": [
        "30007",
        "20032",
        "20012",
        "11331",
        "5177"
      ]
    },
    {
      "hadith_no": "3947",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن عمرو بن دينار، عن سالم، عن أبيه، يبلغ به النبي صلى الله عليه وسلم ‏\"‏ إذا كان العبد بين اثنين فأعتق أحدهما نصيبه فإن كان موسرا يقوم عليه قيمة لا وكس ولا شطط ثم يعتق ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported the Prophet (ﷺ) as saying:                      If a man is shared by two men, and one of them emancipates his share, a price of the slave will be fixed, not more or less, and he will be emancipated by him in case he is rich.",
      "chain": [
        "30007",
        "20005",
        "11081",
        "11011"
      ]
    },
    {
      "hadith_no": "3948",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن خالد، عن أبي بشر العنبري، عن ابن التلب، عن أبيه، أن رجلا، أعتق نصيبا له من مملوك فلم يضمنه النبي صلى الله عليه وسلم ‏.‏ قال أحمد إنما هو بالتاء - يعني التلب - وكان شعبة ألثغ لم يبين التاء من الثاء ‏.‏",
      "text_en": " Narrated ath-Thalabb:                     On the authority of his father: A man emancipated his share in a slave. The Prophet (ﷺ) did not put the responsibility on him to emancipate the rest.Ahmad said: The name Ibn al-Thalabb is to be pronounced with a ta' (and not with tha). As Shu'bah could not pronounce ta, he said tha.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11282"
      ]
    },
    {
      "hadith_no": "3955",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، عن عبد الملك بن أبي سليمان، عن عطاء، وإسماعيل بن أبي خالد، عن سلمة بن كهيل، عن عطاء، عن جابر بن عبد الله، أن رجلا، أعتق غلاما له عن دبر منه ولم يكن له مال غيره فأمر به النبي صلى الله عليه وسلم فبيع بسبعمائة أو بتسعمائة ‏.‏",
      "text_en": " Jabir b. 'Abd Allah said:                      A man declared that his slave would be free after his death, but he had no other property. So the Prophet (ﷺ) ordered (to sell him). He was then sold for seven hundred or nine hundred (dirhams).",
      "chain": [
        "30007",
        "20468",
        "10945",
        "11029",
        "11418",
        "11350",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3957",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن أبي الزبير، عن جابر، أن رجلا، من الأنصار يقال له أبو مذكور أعتق غلاما له يقال له يعقوب عن دبر ولم يكن له مال غيره فدعا به رسول الله صلى الله عليه وسلم فقال ‏\"‏ من يشتريه ‏\"‏ ‏.‏ فاشتراه نعيم بن عبد الله بن النحام بثمانمائة درهم فدفعها إليه ثم قال ‏\"‏ إذا كان أحدكم فقيرا فليبدأ بنفسه فإن كان فيها فضل فعلى عياله فإن كان فيها فضل فعلى ذي قرابته ‏\"‏ ‏.‏ أو قال ‏\"‏ على ذي رحمه فإن كان فضلا فها هنا وها هنا ‏\"‏ ‏.‏",
      "text_en": " Jabir said:                      A man of the Ansar called Abu Madhkur declared that his slave called Ya'qub would be free after his death, but he had no other property. So the Messenger of Allah (ﷺ) called him and said: Who will buy him ? Nu'aim b. 'Abd Allah b. al-Nahham bought him for eight hundred dirhams. When he handed them over to him, he  (Prophet) said: If any of you is poor, he should begin from himself ; if anything is left over, give it to your family; if anything is left over, give it to your relatives ; if anything is left over (when they received something), then here and here.",
      "chain": [
        "30007",
        "20208",
        "11015",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3992",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن حنبل، وأحمد بن عبدة، قالا حدثنا سفيان، عن عمرو، عن عطاء، - قال ابن حنبل لم أفهمه جيدا - عن صفوان، - قال ابن عبدة ابن يعلى - عن أبيه، قال سمعت النبي صلى الله عليه وسلم على المنبر يقرأ ‏{‏ ونادوا يا مالك ‏}‏ ‏.‏ قال أبو داود يعني بلا ترخيم ‏.‏",
      "text_en": " Safwan b. Ya'la quoting his father said:                      I heard the Prophet (ﷺ) read on the pulpit the verse: \"They will cry: O Malik.\"Abu Dawud said: That is, without shortening the name (Malik).",
      "chain": [
        "30007",
        "30423",
        "20005",
        "11081",
        "11029",
        "10921"
      ]
    },
    {
      "hadith_no": "4000",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال معمر وربما ذكر ابن المسيب قال كان النبي صلى الله عليه وسلم وأبو بكر وعمر وعثمان يقرءون ‏{‏ مالك يوم الدين ‏}‏ وأول من قرأها ‏{‏ ملك يوم الدين ‏}‏ مروان ‏.‏ قال أبو داود هذا أصح من حديث الزهري عن أنس والزهري عن سالم عن أبيه ‏.‏",
      "text_en": " Narrated Ibn al-Musayyab:                     The Prophet (ﷺ), AbuBakr, Umar and Uthman used to read \"maliki yawmid-din (master of the Day of Judgment)\". The first to read maliki yawmid-din was Marwan.Abu Dawud said: This is sounder that the tradition which transmitted by al-Zuhri from Anas, and al-Zuhri from Salim, from his father (Ibn 'Umar).",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "4143",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، ح وحدثنا عبد الله بن الجراح، عن وكيع، عن إسرائيل، عن سماك، عن جابر بن سمرة، قال دخلت على النبي صلى الله عليه وسلم في بيته فرأيته متكئا على وسادة - زاد ابن الجراح - على يساره ‏.‏ قال أبو داود رواه إسحاق بن منصور عن إسرائيل أيضا على يساره ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     When I came to the Prophet (ﷺ) in his house, I saw him sitting reclining on a pillow. The narrator Ibn al-Jarrah added: \"on his left side\".Abu Dawud said: Ishaq b. Mansur transmitted it from Isra'il, also mentioning the words \"on his left side\".",
      "chain": [
        "30007",
        "20032",
        "20032",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4168",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى، عن عبيد الله، قال حدثني نافع، عن عبد الله، قال لعن رسول الله صلى الله عليه وسلم الواصلة والمستوصلة والواشمة والمستوشمة ‏.‏",
      "text_en": " 'Abd Allah said:                      The Messenger of Allah (ﷺ) cursed the woman who adds some false hair and the woman who asks for it, the woman who tattoos and the woman who asks for it.",
      "chain": [
        "30007",
        "30175",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4171",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، قال حدثنا شريك، عن سالم، عن سعيد بن جبير، قال لا بأس بالقرامل ‏.‏ قال أبو داود كأنه يذهب إلى أن المنهي، عنه شعور النساء ‏.‏ قال أبو داود كان أحمد يقول القرامل ليس به بأس ‏.‏",
      "text_en": " Sa'id b. Jubair said:                      There is no harm in fastening the hair with silk or woollen threads.Abu Dawud said: It appears that he held the view that what is prohibited is the adding of the hair of women.Abu Dawud said: Ahmad (b. hanbal) used to say: There is no harm in tying the hair with silk or woollen threads.",
      "chain": [
        "20173",
        "11858",
        "11011",
        "11050",
        "30002",
        "30007"
      ]
    },
    {
      "hadith_no": "4193",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عثمان بن عثمان، - قال أحمد كان رجلا صالحا - قال أخبرنا عمر بن نافع عن أبيه عن ابن عمر قال نهى رسول الله صلى الله عليه وسلم عن القزع والقزع أن يحلق رأس الصبي فيترك بعض شعره ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) forbade qaza'. Qaza' means having part of a boy's head shaved and leaving part unshaven.",
      "chain": [
        "30007",
        "30007",
        "11713",
        "18"
      ]
    },
    {
      "hadith_no": "4195",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن أيوب، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم رأى صبيا قد حلق بعض شعره وترك بعضه فنهاهم عن ذلك وقال ‏\"‏ احلقوه كله أو اتركوه كله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) saw a boy with part of his head shaved and part left unshaven. He forbade them to do that, saying: Shave it all or leave it all.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4275",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن، حدثنا سفيان، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال ‏{‏ ومن يقتل مؤمنا متعمدا ‏}‏ قال ما نسخها شىء ‏.‏",
      "text_en": " Ibn 'Abbas said:                      No other verse has repealed the verse \"If a man kills a believer intentionally\"",
      "chain": [
        "30007",
        "20033",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4348",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني سالم بن عبد الله، وأبو بكر بن سليمان أن عبد الله بن عمر، قال صلى بنا رسول الله صلى الله عليه وسلم ذات ليلة صلاة العشاء في آخر حياته فلما سلم قام فقال ‏\"‏ أرأيتم ليلتكم هذه فإن على رأس مائة سنة منها لا يبقى ممن هو على ظهر الأرض أحد ‏\"‏ ‏.‏ قال ابن عمر فوهل الناس في مقالة رسول الله صلى الله عليه وسلم تلك فيما يتحدثون عن هذه الأحاديث عن مائة سنة وإنما قال رسول الله صلى الله عليه وسلم لا يبقى ممن هو اليوم على ظهر الأرض يريد أن ينخرم ذلك القرن ‏.‏",
      "text_en": " ‘Abd Allah b.  ‘Umar said :                      The Messenger of Allah (ﷺ) led us in the night prayer one night towards the end of his life. When he uttered the salutation, he got up and said : Have you seen this night of yours ? No one of those who are on the surface of the earth will survive at the ends of one hundred years. Ibn ‘Umar said: The people fell into fallacy by this statement of the Messenger of Allah (ﷺ) about the traditions they used to narrate concerning one hundred years. The Messenger of Allah (ﷺ) said: No one of those who are present today on the surface of the earth will survive, meaning when that century comes to and end.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4351",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا إسماعيل بن إبراهيم، أخبرنا أيوب، عن عكرمة، أن عليا، عليه السلام أحرق ناسا ارتدوا عن الإسلام فبلغ ذلك ابن عباس فقال لم أكن لأحرقهم بالنار إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تعذبوا بعذاب الله ‏\"‏ ‏.‏ وكنت قاتلهم بقول رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من بدل دينه فاقتلوه ‏\"‏ ‏.‏ فبلغ ذلك عليا عليه السلام فقال ويح ابن عباس ‏.‏",
      "text_en": " ‘Ikrimah said:                      ‘Ali burned some people who retreated from islam. When Ibn ‘Abbas was informed of it, he said: If it had been I, I would not have then burned , for the Messenger of Allah (ﷺ) said: Do not inflict Allah’s punishment on anyone , but would have had killed them on account of the statement of the Messenger of Allah (ﷺ). The Apostle said: Kill those who change their religion. When ‘All was informed about it he said: How truly Ibn ‘Abbas said!",
      "chain": [
        "30007",
        "20208",
        "11015",
        "11023"
      ]
    },
    {
      "hadith_no": "4354",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى بن سعيد، - قال مسدد - حدثنا قرة بن خالد، قال حدثنا حميد بن هلال، حدثنا أبو بردة، قال قال أبو موسى أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين أحدهما عن يميني والآخر عن يساري فكلاهما سأل العمل والنبي صلى الله عليه وسلم ساكت فقال ‏\"‏ ما تقول يا أبا موسى ‏\"‏ ‏.‏ أو ‏\"‏ يا عبد الله بن قيس ‏\"‏ ‏.‏ قلت والذي بعثك بالحق ما أطلعاني على ما في أنفسهما وما شعرت أنهما يطلبان العمل ‏.‏ قال وكأني أنظر إلى سواكه تحت شفته قلصت قال ‏\"‏ لن نستعمل - أو لا نستعمل - على عملنا من أراده ولكن اذهب أنت يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ فبعثه على اليمن ثم أتبعه معاذ بن جبل قال فلما قدم عليه معاذ قال انزل ‏.‏ وألقى له وسادة فإذا رجل عنده موثق قال ما هذا قال هذا كان يهوديا فأسلم ثم راجع دينه دين السوء ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ‏.‏ قال اجلس نعم ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ‏.‏ ثلاث مرات فأمر به فقتل ثم تذاكرا قيام الليل فقال أحدهما معاذ بن جبل أما أنا فأنام وأقوم - أو أقوم وأنام - وأرجو في نومتي ما أرجو في قومتي ‏.‏",
      "text_en": " Abu Burdah said on the authority of Abu Musa :                      I went to the Prophet (ﷺ) while two men who were Ash’ arIs were with me. One of them was on my right and the other on my left side. Bothe of them asked him for employment. The prophet (ﷺ) was silent. He asked : What do you say Abu Musa, or ‘Abd Allah b. Qais (Abu Musa’s name)? I replied: By him who has sent you with truth, they did not inform me of what they had in their hearts, and I did not know that they would ask for an employment. He said  : I have  the scene before my eyes that he had his toothstick below his lip  which receded. He (the prophet) said: We will never or will not put in charge of our work anyone who asks for it. But go, ye, Abu Musa, or ‘Abd Allah b. Qais. He then sent him as a Governor of the Yemen, After him he sent Muadh b. Jabal. When Muadh came to him, he said: come down , and he put a cushion for him.  He saw that a man was chained with him. He asked : What is this? He replied: He was a Jew and he accepted Islam. He then converted to his religion, an evil religion. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (ﷺ). He said: Yes, be seated. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (peace be upon him). He said it three times. He then commanded for it and he was killed. Both of them then discussed the question of prayer and vigilance at night. One of them, probably Muadh, said : So far as I am concerned, I sleep and I keep vigilance: I keep vigilance and I sleep: I hope for the same reward for my sleep as for my vigilance.",
      "chain": [
        "30007",
        "30175",
        "20031",
        "30175",
        "11301",
        "11281",
        "1820"
      ]
    },
    {
      "hadith_no": "4383",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا سفيان، عن الزهري، قال سمعته منه، عن عمرة، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم كان يقطع في ربع دينار فصاعدا ‏.‏",
      "text_en": " ‘A’ishah said:                      The prophet (ﷺ) used to cut off a thief’s hand for a quarter of a dinar and upwards.",
      "chain": [
        "30007",
        "20005",
        "11013",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "4386",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني إسماعيل بن أمية، أن نافعا، مولى عبد الله بن عمر حدثه أن عبد الله بن عمر حدثهم أن النبي صلى الله عليه وسلم قطع يد رجل سرق ترسا من صفة النساء ثمنه ثلاثة دراهم ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) had a man's hand cut off who had stolen from the place reserved for women a shield whose price was three dirhams.",
      "chain": [
        "30007",
        "20121",
        "11070",
        "11417"
      ]
    },
    {
      "hadith_no": "4406",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم عرضه يوم أحد وهو ابن أربع عشرة سنة فلم يجزه وعرضه يوم الخندق وهو ابن خمس عشرة سنة فأجازه ‏.‏",
      "text_en": " Ibn ‘Umar said:                      He was presented before the prophet (ﷺ) on the day of Uhd when he was fourteen years old, but he did not allow him (to participate in the battle). He was again presented before him on the day of Khandaq when he was fifteen years old, Then he allowed him.",
      "chain": [
        "30007",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4514",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إبراهيم بن خالد، حدثنا رباح، عن معمر، عن الزهري، عن عبد الرحمن بن عبد الله بن كعب بن مالك، عن أمه، أن أم مبشر، - قال أبو سعيد بن الأعرابي كذا قال عن أمه، والصواب، عن أبيه، عن أم مبشر، - دخلت على النبي صلى الله عليه وسلم فذكر معنى حديث مخلد بن خالد نحو حديث جابر قال فمات بشر بن البراء بن معرور فأرسل إلى اليهودية فقال ‏\"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ فذكر نحو حديث جابر فأمر بها رسول الله صلى الله عليه وسلم فقتلت ولم يذكر الحجامة ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. 'Abd Allah b. Ka'b b. Malik :                     On the authority of his mother than Umm Mubashshir said (Abu Sa'id b. al-A'rabi said: So he said it on the authority of his mother ; what is correct is: on the authority of his father, instead of his mother): I entered upon the Prophet (ﷺ). He then mentioned the tradition of Makhlad b. Khalid in a way similar to the tradition of Jabir. The narrator said: Then Bishr b. al-Bara' b. Ma'rur died. So he (the Prophet) sent for the Jewess and said: What did motivate you for your work you have done ? He (the narrator) then mentioned the rest of the tradition like the tradition of Jabir. The Messenger of Allah (ﷺ) ordered regarding her and she was killed. He (the narrator in this version) did not mention cupping.",
      "chain": [
        "30007",
        "38072",
        "20115",
        "11013",
        "11519",
        "1293"
      ]
    },
    {
      "hadith_no": "4530",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى بن سعيد، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن قيس بن عباد، قال انطلقت أنا والأشتر، إلى علي عليه السلام فقلنا هل عهد إليك رسول الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس عامة قال لا إلا ما في كتابي هذا - قال مسدد قال - فأخرج كتابا - وقال أحمد كتابا من قراب سيفه - فإذا فيه ‏\"‏ المؤمنون تكافأ دماؤهم وهم يد على من سواهم ويسعى بذمتهم أدناهم ألا لا يقتل مؤمن بكافر ولا ذو عهد في عهده من أحدث حدثا فعلى نفسه ومن أحدث حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏ قال مسدد عن ابن أبي عروبة فأخرج كتابا ‏.‏",
      "text_en": " Narrated Qays ibn Abbad :                     I and Ashtar went to Ali and said to him: Did the Messenger of Allah (ﷺ) give you any instruction about anything for which he did not give any instruction to the people in general?  He said: No, except what is contained in this document of mine. Musaddad said: He then took out a document. Ahmad said: A document from the sheath of his sword.  It contained: The lives of all Muslims are equal; they are one hand against others; the lowliest of them can guarantee their protection. Beware, a Muslim must not be killed for an infidel, nor must one who has been given a covenant be killed while his covenant holds. If anyone introduces an innovation, he will be responsible for it. If anyone introduces an innovation or gives shelter to a man who introduces an innovation (in religion), he is cursed by Allah, by His angels, and by all the people. Musaddad said: Ibn AbuUrubah's version has: He took out a document.",
      "chain": [
        "30007",
        "30175",
        "20031",
        "11073",
        "11019",
        "11016",
        "11609"
      ]
    },
    {
      "hadith_no": "4590",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي نضرة، عن عمران بن حصين، أن غلاما، لأناس فقراء قطع أذن غلام لأناس أغنياء فأتى أهله النبي صلى الله عليه وسلم فقالوا يا رسول الله إنا أناس فقراء ‏.‏ فلم يجعل عليه شيئا ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     A servant of some poor people cut off the ear of the servant of some rich people. His people came to the Prophet (ﷺ) and said: Messenger of Allah! we are poor people. So he imposed no compensation on them.",
      "chain": [
        "30007",
        "20287",
        "20295",
        "11019",
        "10721",
        "123"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن يحيى، قالا حدثنا أبو المغيرة، حدثنا صفوان، ح وحدثنا عمرو بن عثمان، حدثنا بقية، قال حدثني صفوان، نحوه قال حدثني أزهر بن عبد الله الحرازي، عن أبي عامر الهوزني، عن معاوية بن أبي سفيان، أنه قام فينا فقال ألا إن رسول الله صلى الله عليه وسلم قام فينا فقال ‏\"‏ ألا إن من قبلكم من أهل الكتاب افترقوا على ثنتين وسبعين ملة وإن هذه الملة ستفترق على ثلاث وسبعين ثنتان وسبعون في النار وواحدة في الجنة وهي الجماعة ‏\"‏ ‏.‏ زاد ابن يحيى وعمرو في حديثيهما ‏\"‏ وإنه سيخرج من أمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكلب لصاحبه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ الكلب بصاحبه لا يبقى منه عرق ولا مفصل إلا دخله ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Amir al-Hawdhani said:                      Mu’awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of ALLA H (SAWS) stood among us and said: Beware! The people of the Book before were split up into seventy-two sects, and this community will be split into seventy three: seventy-two of them will go to Hell and one of them will go to Paradise, and it is the majority group.Ibn Yahya and ‘Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, ‘Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
      "chain": [
        "30007",
        "11222",
        "20442",
        "10921",
        "10581",
        "20644",
        "10921",
        "18019",
        "27"
      ]
    },
    {
      "hadith_no": "4603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يزيد، - يعني ابن هارون - أخبرنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المراء في القرآن كفر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Controverting about the Qur'an is disbelief.",
      "chain": [
        "30007",
        "20472",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، وعبد الله بن محمد النفيلي، قالا حدثنا سفيان، عن أبي النضر، عن عبيد الله بن أبي رافع، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ألفين أحدكم متكئا على أريكته يأتيه الأمر من أمري مما أمرت به أو نهيت عنه فيقول لا ندري ما وجدنا في كتاب الله اتبعناه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuRafi':                     The Prophet (ﷺ) said: Let me not find one of you reclining on his couch when he hears something regarding me which I have commanded or forbidden and saying: We do not know. What we found in Allah's Book we have followed.",
      "chain": [
        "30007",
        "30352",
        "20012",
        "11164",
        "11199",
        "479"
      ]
    },
    {
      "hadith_no": "4607",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا الوليد بن مسلم، حدثنا ثور بن يزيد، قال حدثني خالد بن معدان، قال حدثني عبد الرحمن بن عمرو السلمي، وحجر بن حجر، قالا أتينا العرباض بن سارية وهو ممن نزل فيه ‏{‏ ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه ‏}‏ فسلمنا وقلنا أتيناك زائرين وعائدين ومقتبسين ‏.‏ فقال العرباض صلى بنا رسول الله صلى الله عليه وسلم ذات يوم ثم أقبل علينا فوعظنا موعظة بليغة ذرفت منها العيون ووجلت منها القلوب فقال قائل يا رسول الله كأن هذه موعظة مودع فماذا تعهد إلينا فقال ‏\"‏ أوصيكم بتقوى الله والسمع والطاعة وإن عبدا حبشيا فإنه من يعش منكم بعدي فسيرى اختلافا كثيرا فعليكم بسنتي وسنة الخلفاء المهديين الراشدين تمسكوا بها وعضوا عليها بالنواجذ وإياكم ومحدثات الأمور فإن كل محدثة بدعة وكل بدعة ضلالة ‏\"‏ ‏.‏",
      "text_en": " Narrated Irbad ibn Sariyah:                     AbdurRahman ibn Amr as-Sulami and Hujr ibn Hujr said: We came to Irbad ibn Sariyah who was among those about whom the following verse was revealed: \"Nor (is there blame) on those who come to thee to be provided with mounts, and when thou saidst: \"I can find no mounts for you.\"  We greeted him and said: We have come to see you to give healing and obtain benefit from you.  Al-Irbad said: One day the Messenger of Allah (ﷺ) led us in prayer, then faced us and gave us a lengthy exhortation at which the eyes shed tears and the hearts were afraid.  A man said: Messenger of Allah! It seems as if it were a farewell exhortation, so what injunction do you give us?  He then said: I enjoin you to fear Allah, and to hear and obey even if it be an Abyssinian slave, for those of you who live after me will see great disagreement. You must then follow my sunnah and that of the rightly-guided caliphs. Hold to it and stick fast to it. Avoid novelties, for every novelty is an innovation, and every innovation is an error.",
      "chain": [
        "30007",
        "20733",
        "20415",
        "11422",
        "17046"
      ]
    },
    {
      "hadith_no": "4613",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، قال حدثنا عبد الله بن يزيد، قال حدثنا سعيد، - يعني ابن أبي أيوب - قال أخبرني أبو صخر، عن نافع، قال كان لابن عمر صديق من أهل الشام يكاتبه فكتب إليه عبد الله بن عمر إنه بلغني أنك تكلمت في شىء من القدر فإياك أن تكتب إلى فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه سيكون في أمتي أقوام يكذبون بالقدر ‏\"‏ ‏.‏",
      "text_en": " Nafi said:                      Ibn ‘Umar had a friend from the people of Syria who used to correspond with him. ‘Abd Allah b. ‘Umar wrote to him: I have been informed that you have talked something about Divine decree. You should write it to me, for I heard the Messenger of Allah (ﷺ) say: Among my community there will be people who will falsify Divine decree.",
      "chain": [
        "30007",
        "1945",
        "20375",
        "11014"
      ]
    },
    {
      "hadith_no": "4677",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثني يحيى بن سعيد، عن شعبة، حدثني أبو جمرة، قال سمعت ابن عباس، قال إن وفد عبد القيس لما قدموا على رسول الله صلى الله عليه وسلم أمرهم بالإيمان بالله قال ‏\"‏ أتدرون ما الإيمان بالله ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وأن تعطوا الخمس من المغنم ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      When the deputation of ‘Abd al-Qais came to the Messenger of Allah (May peace be upon him), he commanded them to believe in Allah. He asked : Do you know what faith in Allah is? They replied : Allah and his Apostle know best. He said: It includes the testimony that there is no god but Allah, and that Muhammad is Allah’s Apostle, the observance of the prayer, the payment of zakat, the fasts of Ramadan, and your giving a fifth of the booty.",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4678",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا سفيان، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين العبد وبين الكفر ترك الصلاة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported the Messenger of Allah (May peace be upon him) as saying :                      Between a servant and unbelief there is the abandonment of prayer.",
      "chain": [
        "30007",
        "20032",
        "20012",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4682",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكمل المؤمنين إيمانا أحسنهم خلقا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The most perfect believer in respect of faith is he who is best of them in manners.",
      "chain": [
        "30007",
        "20031",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4685",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، ح وحدثنا إبراهيم بن بشار، حدثنا سفيان، - المعنى - قالا حدثنا معمر، عن الزهري، عن عامر بن سعد، عن أبيه، أن النبي صلى الله عليه وسلم قسم بين الناس قسما فقلت أعط فلانا فإنه مؤمن ‏.‏ قال ‏\"‏ أو مسلم إني لأعطي الرجل العطاء وغيره أحب إلى منه مخافة أن يكب على وجهه ‏\"‏ ‏.‏",
      "text_en": " Sa’d said :                      The Prophet (May peace be upon him) distributed (spoils) among the people I said to him : Give so and so for he is a believer. He said : Or he is a Muslim. I give a man something while another man is dearer to me than him, fearing that he may fall into Hell on his face.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الله بن يزيد المقرئ أبو عبد الرحمن، قال حدثني سعيد بن أبي أيوب، قال حدثني عطاء بن دينار، عن حكيم بن شريك الهذلي، عن يحيى بن ميمون الحضرمي، عن ربيعة الجرشي، عن أبي هريرة، عن عمر بن الخطاب، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تجالسوا أهل القدر ولا تفاتحوهم ‏\"‏ ‏.‏",
      "text_en": " ‘Umar reported the Prophet (May peace be upon him) was asked :                      Do not sit which those who believe in free will and do not address them before they address you.",
      "chain": [
        "30007",
        "20375",
        "16075",
        "26009",
        "16112",
        "14894",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "4782",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، حدثنا داود بن أبي هند، عن أبي حرب بن الأسود، عن أبي ذر، قال إن رسول الله صلى الله عليه وسلم قال لنا ‏\"‏ إذا غضب أحدكم وهو قائم فليجلس فإن ذهب عنه الغضب وإلا فليضطجع ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to us: When one of you becomes angry while standing, he should sit down. If the anger leaves him, well and good; otherwise he should lie down.",
      "chain": [
        "30007",
        "20354",
        "11585",
        "10729",
        "23"
      ]
    },
    {
      "hadith_no": "4952",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم غير اسم عاصية وقال ‏\"‏ أنت جميلة ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar said :                      The Messenger of Allah (May peace be upon him) changed the name of ‘Asiyah and called her Jamilah.",
      "chain": [
        "30007",
        "30175",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4959",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا المعتمر، قال سمعت الركين، يحدث عن أبيه، عن سمرة، قال نهى رسول الله صلى الله عليه وسلم أن نسمي رقيقنا أربعة أسماء أفلح ويسارا ونافعا ورباحا ‏.‏",
      "text_en": " Samurah said:                      The Aposlte of Allah (May peace be upon him) forbade giving four names to our slaves : Aflah (successful), Yasar (wealth), Naf(beneficial) and Rabah (profit).",
      "chain": [
        "30007",
        "20288",
        "11289",
        "394"
      ]
    },
    {
      "hadith_no": "4961",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ أخنع اسم عند الله تبارك وتعالى يوم القيامة رجل تسمى ملك الأملاك ‏\"‏ ‏.‏ قال أبو داود رواه شعيب بن أبي حمزة عن أبي الزناد بإسناده قال ‏\"‏ أخنى اسم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the prophet (May peace be upon him) as saying :                      The vilest names in Allah’s sight on the Day of resurrection will be that of a man called Malik al-Amlak.Abu Dawud said: This tradition has also been transmitted by Shu'aib b. Abi Hamzah from Abi al-Zinad through different chain of narrators. This version has the words \"akhna' ismin\" (most obscene name) instead of \"akhna ismin\" (the vilest name).",
      "chain": [
        "30007",
        "20005",
        "11061",
        "11197"
      ]
    },
    {
      "hadith_no": "5020",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا يعلى بن عطاء، عن وكيع بن عدس، عن عمه أبي رزين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الرؤيا على رجل طائر ما لم تعبر فإذا عبرت وقعت ‏\"‏ ‏.‏ قال وأحسبه قال ‏\"‏ ولا يقصها إلا على واد أو ذي رأى ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuRazin:                     The Prophet (ﷺ) said: The vision flutters over a man as long as it is not interpreted , but when it is interpreted, it settles. And I think he said: Tell it only to one who loves (i.e. friend) or one who has judgment.",
      "chain": [
        "30007",
        "20468",
        "10986",
        "10826"
      ]
    },
    {
      "hadith_no": "5134",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، عن منصور، عن ابن سيرين، - قال أحمد قال مرة يعني هشيما - عن بعض ولد العلاء أن العلاء بن الحضرمي كان عامل النبي صلى الله عليه وسلم على البحرين فكان إذا كتب إليه بدأ بنفسه ‏.‏",
      "text_en": " Narrated al-Ala' ibn al-Hadrami:                     Some of the children of al-Ala' ibn al-Hadrami said: Al-Ala' ibn al-Hadrami was the governor of the Prophet (ﷺ) at al-Bahrayn, and when he wrote to him he began with his won name.",
      "chain": [
        "30007",
        "20468",
        "11067",
        "11035",
        "30007",
        "586"
      ]
    },
    {
      "hadith_no": "5198",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الصغير على الكبير والمار على القاعد والقليل على الكثير ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      The young should salute the old, the one who is passing by should salute the one who is sitting, and a small company should salute a large one.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5208",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا بشر، - يعنيان ابن المفضل - عن ابن عجلان، عن المقبري، - قال مسدد سعيد بن أبي سعيد المقبري - عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا انتهى أحدكم إلى المجلس فليسلم فإذا أراد أن يقوم فليسلم فليست الأولى بأحق من الآخرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When one of you comes to an assembly, he should give a salutation and if he feels inclined to get up, he should give a salutation, for the former is not more of a duty than the latter.",
      "chain": [
        "30007",
        "30175",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "5246",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، رواية وقال مرة يبلغ به النبي صلى الله عليه وسلم ‏\"‏ لا تتركوا النار في بيوتكم حين تنامون ‏\"‏ ‏.‏",
      "text_en": " Salim quoting his father(Ibn ‘Umar) said( sometimes he traced back to the Prophet(ﷺ):                      Do not leave a fire burning in your houses while you are asleep.",
      "chain": [
        "30007",
        "20005",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "5262",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن عامر بن سعد، عن أبيه، قال أمر رسول الله صلى الله عليه وسلم بقتل الوزغ وسماه فويسقا ‏.‏",
      "text_en": " ‘Amir b. Sa’d, quoting his father, said :                      The Messenger of Allah (May peace be upon him) ordered a gecko to be killed, and calling it a noxious little creature.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5267",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، قال إن النبي صلى الله عليه وسلم نهى عن قتل أربع من الدواب النملة والنحلة والهدهد والصرد ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) prohibited to kill four creatures: ants, bees, hoopoes, and sparrow-hawks.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا عوف، قال أحمد وحدثنا عباد بن عباد، هو المهلبي وإسماعيل ابن علية جميعا عن عوف، عن سيار بن سلامة، هو أبو المنهال الرياحي عن أبي برزة، قال كان النبي صلى الله عليه وسلم يكره النوم قبل العشاء والحديث بعدها ‏.‏ قال وفي الباب عن عائشة وعبد الله بن مسعود وأنس ‏.‏ قال أبو عيسى حديث أبي برزة حديث حسن صحيح ‏.‏ وقد كره أكثر أهل العلم النوم قبل صلاة العشاء والحديث بعدها ورخص في ذلك بعضهم ‏.‏ وقال عبد الله بن المبارك أكثر الأحاديث على الكراهية ‏.‏ ورخص بعضهم في النوم قبل صلاة العشاء في رمضان ‏.‏ وسيار بن سلامة هو أبو المنهال الرياحي ‏.‏",
      "text_en": " Abu Barzah narrated:                     \"The Prophet would dislike to sleep before Isha and to talk after it.\"",
      "chain": [
        "30242",
        "20468",
        "11298",
        "30007",
        "20243",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "554",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الصمد بن سليمان، حدثنا زكريا اللؤلؤي، حدثنا أبو بكر الأعين، حدثنا علي بن المديني، حدثنا أحمد بن حنبل، حدثنا قتيبة، بهذا الحديث يعني حديث معاذ ‏.‏ وحديث معاذ حديث حسن غريب تفرد به قتيبة لا نعرف أحدا رواه عن الليث غيره ‏.‏ وحديث الليث عن يزيد بن أبي حبيب عن أبي الطفيل عن معاذ حديث غريب ‏.‏ والمعروف عند أهل العلم حديث معاذ من حديث أبي الزبير عن أبي الطفيل عن معاذ أن النبي صلى الله عليه وسلم جمع في غزوة تبوك بين الظهر والعصر وبين المغرب والعشاء ‏.‏ رواه قرة بن خالد وسفيان الثوري ومالك وغير واحد عن أبي الزبير المكي ‏.‏ وبهذا الحديث يقول الشافعي ‏.‏ وأحمد وإسحاق يقولان لا بأس أن يجمع بين الصلاتين في السفر في وقت إحداهما ‏.‏",
      "text_en": " [(Another chain) Qutaibah narrated :                     this Hadith to us, meaning the Hadith of Mu'adh]",
      "chain": [
        "30026",
        "30007",
        "30367",
        "11411",
        "3660"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني محمد بن يحيى بن عبد الله، قال حدثنا أحمد بن حنبل، قال حدثنا إبراهيم بن خالد، عن رباح، عن معمر، عن الزهري، قال حدثني سعيد، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن في الجمعة ساعة لا يوافقها عبد مسلم يسأل الله فيها شيئا إلا أعطاه إياه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"On Friday, there is an hour when, if a Muslim slave asks Allah (SWT) for something at that time, He will give it to him.\"",
      "chain": [
        "11222",
        "30007",
        "38072",
        "20115",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1884",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أحمد بن محمد بن حنبل، قال حدثنا إسماعيل، عن خالد، عن حفصة، عن أم عطية، أن رسول الله صلى الله عليه وسلم قال في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm 'Atiyyah that:                     the Messenger of Allah said concerning the washing of his daughter: \"Start on the right and the parts that were washed in wudu.\"'",
      "chain": [
        "38433",
        "30007",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2718",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن إسماعيل الطبراني أبو بكر، قال حدثنا أحمد بن محمد بن حنبل، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، حدثني منصور، وسليمان، عن إبراهيم، عن الأسود، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نرى إلا أنه الحج ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"We set out with the Messenger of Allah (ﷺ) thinking that it was for nothing other than Hajj.\"",
      "chain": [
        "34188",
        "30007",
        "20031",
        "20020",
        "11067",
        "11005",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4446",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن داود المصيصي، قال حدثنا أحمد بن حنبل، قال حدثنا أبو عبيدة عبد الواحد بن واصل، عن خلف، - يعني ابن مهران - قال حدثنا عامر الأحول، عن صالح بن دينار، عن عمرو بن الشريد، قال سمعت الشريد، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قتل عصفورا عبثا عج إلى الله عز وجل يوم القيامة يقول يا رب إن فلانا قتلني عبثا ولم يقتلني لمنفعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Sharid said:                     \"I heard Sharid say: 'I herd the Messenger of Allah say: Whoever kills a small bird for no reason, it will beseech Allah on the Day of Resurrection saying: O Lord, so and so killed me for no reason. And he did not kill me for any beneficial purpose.\"'",
      "chain": [
        "38505",
        "30007",
        "14105",
        "10693",
        "28245",
        "10952"
      ]
    },
    {
      "hadith_no": "5583",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا أحمد بن حنبل، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام وكل مسكر خمر ‏\"‏ ‏.‏ قال الحسين قال أحمد وهذا حديث صحيح ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Every intoxicant is unlawful and every intoxicant is Khamr.'\"",
      "chain": [
        "38181",
        "30007",
        "20033",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5685",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد، ح وأنبأنا الحسين بن منصور، قال حدثنا أحمد بن حنبل، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن مسعر، عن أبي عون، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر بعينها قليلها وكثيرها والسكر من كل شراب ‏.‏ لم يذكر ابن الحكم قليلها وكثيرها ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in and of itself, in small or large amounts, as was every kind of intoxicating drink.\"",
      "chain": [
        "30213",
        "38181",
        "30007",
        "20173",
        "20020",
        "20359",
        "11649",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "5686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أحمد بن حنبل، قال حدثنا إبراهيم بن أبي العباس، قال حدثنا شريك، عن عباس بن ذريح، عن أبي عون، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر قليلها وكثيرها وما أسكر من كل شراب ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من حديث ابن شبرمة وهشيم بن بشير كان يدلس وليس في حديثه ذكر السماع من ابن شبرمة ورواية أبي عون أشبه بما رواه الثقات عن ابن عباس ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in small or large amounts, as was every kind of drink that intoxicates.\"",
      "chain": [
        "38181",
        "30007",
        "11858",
        "11649",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أحمد بن حنبل، حدثنا أبو القاسم بن أبي الزناد، قال حدثني إسحاق بن حازم، عن عبيد الله، - هو ابن مقسم - عن جابر، أن النبي  صلى الله عليه وسلم  سئل عن ماء البحر فقال ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that:                     The Prophet was asked about seawater, and he said: \"its water is a means of purification, and its dead meat is permissible.\" (Hasan)Another chain with similar wording.",
      "chain": [
        "11222",
        "30007",
        "22258",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "420",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن بن سلمة حدثنا علي بن الحسن الهسنجاني، حدثنا أحمد بن حنبل، حدثنا أبو القاسم بن أبي الزناد، حدثني إسحاق بن حازم، عن عبيد الله، - هو ابن مقسم - عن جابر بن عبد الله، أن النبي  صلى الله عليه وسلم  فذكر نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30007",
        "22258",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "1532",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أحمد بن حنبل، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن يعقوب بن عتبة، عن الزهري، عن عبيد الله بن عبد الله، عن عائشة، قالت رجع رسول الله  صلى الله عليه وسلم  من البقيع فوجدني وأنا أجد صداعا في رأسي وأنا أقول وارأساه فقال ‏\"‏ بل أنا يا عائشة وارأساه ‏\"‏ ‏.‏ ثم قال ‏\"‏ ما ضرك لو مت قبلي فقمت عليك فغسلتك وكفنتك وصليت عليك ودفنتك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ) cameback from Al-Baqi’ and I had a headache and was saying: ‘O myhead!’He said: ‘Rather, I should say, O my head, O ‘Aishah!’Thenhe said:‘It will not matter if you were to die before me, forI will take careof you, wash you, shroud you, offer the funeralprayer for you andbury you.’”",
      "chain": [
        "11222",
        "30007",
        "20672",
        "11107",
        "19192",
        "11013",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "1598",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، ومحمد بن يحيى، قالا حدثنا أحمد بن حنبل، حدثنا غندر، عن شعبة، عن حبيب بن الشهيد، عن ثابت، عن أنس، أن النبي  صلى الله عليه وسلم  صلى على قبر بعد ما قبر ‏.‏",
      "text_en": " It wasnarrated from Anas that the Prophet (ﷺ) offered the funeralprayerat a grave after the burial.",
      "chain": [
        "30437",
        "11222",
        "30007",
        "20278",
        "20020",
        "11275",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 281
}