{
  "id": "30002",
  "name": "Abu Da'ud أبو داود السجستاني الأزدي",
  "full_name": "Abu Da'ud أبو داود السجستاني الأزدي",
  "grade": "3rd Century AH [11th generation] [Hanafi]",
  "biography": {
    "birth": {
      "date_hijri": "202",
      "date_gregorian": "817",
      "date_display": [
        "202 AH",
        "817 CE"
      ],
      "place": "Sajistan, Afghanistan"
    },
    "death": {
      "date_hijri": "275",
      "date_gregorian": "889",
      "date_display": null,
      "place": "Basra, Iraq",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Iraq",
      "Egypt",
      "Syria",
      "Hijaz",
      "Marv"
    ],
    "area_of_interest": [
      "Hadith",
      "Narrator[Grade:No Doubt] [ ت  س  -  ثقة حافظ ]",
      "Fiqh",
      "Aqeedah"
    ],
    "tags": [
      "Imam",
      "Hafiz",
      "Hadith Compiler",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30169",
      "name": "Muhammad bin Kathir al-'Abdi محمد بن كثير العبدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34062",
      "name": "Hafs bin 'Umar Abu حفص بن عمر أبو عمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30335",
      "name": "al-Rabi' bin Nafi' Abu Tawba al-Halbi الربيع بن نافع أبو توبة الحلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30587",
      "name": "Sulaiman bin 'Abdur Rahman سليمان بن عبد الرحمن بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30252",
      "name": "Sa'id bin Sulaiman al-Dabi سعيد بن سليمان - سعدويه الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37511",
      "name": "Safwan bin Salah bin Safwan صفوان بن صالح بن صفوان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30352",
      "name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30444",
      "name": "Qtn bin Nsyr قطن بن نسير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "82",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا محمود بن غيلان، حدثنا أبو داود، قال قال لي شعبة ايت جرير بن حازم فقل له لا يحل لك أن تروي عن الحسن بن عمارة فإنه يكذب ‏.‏ قال أبو داود قلت لشعبة وكيف ذاك فقال حدثنا عن الحكم بأشياء لم أجد لها أصلا ‏.‏ قال قلت له بأى شىء قال قلت للحكم أصلى النبي صلى الله عليه وسلم على قتلى أحد فقال لم يصل عليهم ‏.‏ فقال الحسن بن عمارة عن الحكم عن مقسم عن ابن عباس إن النبي صلى الله عليه وسلم صلى عليهم ودفنهم ‏.‏ قلت للحكم ما تقول في أولاد الزنا قال يصلى عليهم ‏.‏ قلت من حديث من يروى قال يروى عن الحسن البصري ‏.‏ فقال الحسن بن عمارة حدثنا الحكم عن يحيى بن الجزار عن علي ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "30002",
        "25053",
        "30002"
      ]
    },
    {
      "hadith_no": "277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا أبو داود، حدثنا شعبة، عن أبان بن تغلب، عن فضيل، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah that the Apostle of Allah (may peace be upon him) observed:                      He who as in his heart the weight of a mustard seed of pride shall not enter Paradise.",
      "chain": [
        "30160",
        "30002",
        "20020",
        "20577",
        "20271",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، في هذا الإسناد ‏.‏ وزاد قال شعبة فقلت لقتادة أسمعته من أنس قال نعم نحن سألناه عنه ‏.‏",
      "text_en": " Shu'ba reported it with the same chain of transmitters. with she addition of these words:                     \" I said to Qatada: Did you hear it from Anas? He replied in the affir- mative and added: We had inquired of him about it.\"",
      "chain": [
        "30170",
        "30002"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، أخبرني قتادة، قال سمعت مطرف بن عبد الله بن الشخير، قال أبو داود وحدثني هشام، عن قتادة، عن مطرف، عن عائشة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'A'isha by another chain of transmitters.",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11019",
        "11305",
        "30002",
        "20295",
        "11019",
        "11395",
        "53"
      ]
    },
    {
      "hadith_no": "1894",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن المثنى، حدثنا عبد الرحمن بن مهدي، وأبو داود قالا حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء، يقول ‏.‏ فذكرا نحوه غير أنهما قالا تنقز ‏.‏",
      "text_en": " Abu Sa'id al-Khudri told of Usaid b. Hudair saying that one night he recited the Qur'an in his enclosure, when the horse began to jump about. He again recited and (the horse) again jumped. He again recited and it jumped as before. Usaid said:                      I was afraid lest it should trample (his son) Yahya. I stood near it (the horse) and saw something like a canopy over my head with what seemed to be lamps in it, rising up in the sky till it disappeared. I went to the Messenger of Allah (may peace be upon him) on the next day and said: Messenger of Allah, I recited the Qur'an during the night in my enclosure and my horse began to jump. Upon this the Messenger of Allah (may peace be upon him) said: You should have kept on reciting, Ibn Hudair. He (Ibn Hudair) said: I recited. It jumped (as before). Upon this the Messenger of Allah (may peace be upon him) again said: You should have kept on reciting, Ibn Hudair. He (Ibn Hudair) said: I recited and it again jumped (as before). The Messenger of Allah (may peace be upon him) again said: You should kave kept on reciting, Ibu Hudair. He (Ibn Hudair) said: (Messenger of Allah) I finished (the recitation) for Yahya was near (the horse) and I was afraid lest it should trample him. I saw something like a canopy with what seemed to be lamps in it rising up in the sky till it disappeared. Upon this the Messenger of Allah (may peace be upon him) said: Those were the angels who listened to you; and if you had continued reciting, the people would have seen them in the morning and they would not have concealed themselves from them.",
      "chain": [
        "20033",
        "30002",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2600",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه ابن المثنى، حدثنا أبو داود، أخبرنا شعبة، أخبرني سوادة بن حنظلة، القشيري قال سمعت سمرة بن جندب، - رضى الله عنه - يقول قال رسول الله صلى الله عليه وسلم ‏.‏ فذكر هذا ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Samura b. Jundub.",
      "chain": [
        "30002",
        "20020",
        "10687",
        "394"
      ]
    },
    {
      "hadith_no": "2670",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه أحمد بن عثمان النوفلي، حدثنا أبو داود، حدثنا شعبة، بهذا الإسناد ‏.‏ نحوه وزاد قال شعبة وكان يبلغني عن يحيى بن أبي كثير أنه كان يزيد في هذا الحديث وفي هذا الإسناد أنه قال ‏\"‏ عليكم برخصة الله الذي رخص لكم ‏\"‏ ‏.‏ قال فلما سألته لم يحفظه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with this addition that he (the Holy Prophet) said:                     \" Take advantage of the concession of Allah Who Wanted it to you.\" When he (one of the narrators) asked him (the other one, Yabya b. Abi Kathar) he did not retain it in his mind.",
      "chain": [
        "30185",
        "30002",
        "20020",
        "11449"
      ]
    },
    {
      "hadith_no": "3559",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو داود، ح وحدثنا محمد بن رافع، وهارون، بن عبد الله قالا حدثنا وهب بن جرير، ح وحدثنا أحمد بن خراش، حدثنا شبابة، كلهم عن شعبة، عن حميد، بهذا الإسناد غير أن في، حديث وهب قال قال عبد الرحمن تزوجت امرأة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Humaid with the same chain of transmitters except (with this minor alteration of words) that 'Abd al-Rahman said:                     \" I married a woman.\"",
      "chain": [
        "30170",
        "30002",
        "30375",
        "30524",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "3561",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا ابن المثنى، حدثنا أبو داود، حدثنا شعبة، عن أبي حمزة، - قال شعبة واسمه عبد الرحمن بن أبي عبد الله - عن أنس بن مالك، أن عبد الرحمن، تزوج امرأة على وزن نواة من ذهب ‏.‏",
      "text_en": "  Anas b. Malik reported that 'Abd al-Rahman married a woman for a datestone weight of gold.",
      "chain": [
        "30002",
        "20020",
        "20458",
        "19"
      ]
    },
    {
      "hadith_no": "3784",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أحمد بن عبدة الضبي، حدثنا أبو داود، حدثنا سليمان بن معاذ، عن أبي، إسحاق بهذا الإسناد نحو حديث أبي أحمد عن عمار بن رزيق، بقصته ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Ishaq with the same chain of transmitters.",
      "chain": [
        "30423",
        "30002"
      ]
    },
    {
      "hadith_no": "3857",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثناه أحمد بن عثمان النوفلي، حدثنا أبو داود، حدثنا شعبة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30185",
        "30002"
      ]
    },
    {
      "hadith_no": "4706",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، بهذا الإسناد غير أنه قال جراب من شحم ولم يذكر الطعام ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Shu'ba with a slight variation of words.",
      "chain": [
        "30170",
        "30002"
      ]
    },
    {
      "hadith_no": "4738",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت أبي، حدثنا قتادة، قال سمعت أنس بن مالك، ح وحدثنا ابن المثنى، حدثنا أبو داود، حدثنا همام، ح وحدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، جميعا عن قتادة، عن أنس، نحو حديث ابن أبي عروبة ‏.‏",
      "text_en": " This tradition has been narrated through a different chain of transmitters.",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19",
        "30002",
        "20297",
        "30553",
        "20393",
        "11019"
      ]
    },
    {
      "hadith_no": "4923",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا ابن المثنى، حدثنا أبو داود، ح وحدثناه إسحاق بن إبراهيم، أخبرنا النضر بن شميل، جميعا عن شعبة، بهذا الإسناد مثله ‏.‏",
      "text_en": " The same tradition has been handed down through a different chain of transmitters.",
      "chain": [
        "30002",
        "30123",
        "20291"
      ]
    },
    {
      "hadith_no": "5316",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا أبو داود، حدثنا شعبة، في هذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30170",
        "30160",
        "30002"
      ]
    },
    {
      "hadith_no": "5690",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا أبو داود، حدثنا شعبة، ح وحدثنا  أبو بكر بن أبي شيبة، - واللفظ له - حدثنا يحيى بن أبي بكير، عن شعبة، عن عمرو بن، مرة قال سمعت الحسن بن مسلم، يحدث عن صفية بنت شيبة، عن عائشة، أن جارية، من الأنصار تزوجت وأنها مرضت فتمرط شعرها فأرادوا أن يصلوه فسألوا رسول الله صلى الله عليه وسلم عن ذلك فلعن الواصلة والمستوصلة ‏.‏",
      "text_en": " A'isha reported that a girl of the Ansar who had fallen ill and had lost the hair was married. They (her relatives) thought of adding false hair (to her head). so they asked Allah's Messenger (may peace be upon him) about it, whereupon he cursed the woman who adds false hair and the woman who asks for it.",
      "chain": [
        "30170",
        "30160",
        "30002",
        "20020",
        "20436",
        "20365",
        "20020",
        "11381",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "6046",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، وأبو داود ح وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، كلهم عن شعبة، ح وحدثنا عبيد، الله بن معاذ - واللفظ له - حدثنا أبي، حدثنا شعبة، عن قتادة، عن أنس بن مالك، عن  عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رؤيا المؤمن جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " Ubida b. as-Samit reported Allah's Messenger (may peace be upon him) as saying:                      The vision of a believer is the forty-sixth part of Prophecy.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30002",
        "30022",
        "20020",
        "13898",
        "20020",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "6186",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه ابن بشار، حدثنا أبو داود، حدثنا هشام، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم ولم يذكر حاد حسن الصوت ‏.‏",
      "text_en": " Anas reported this hadith through another chain of transmitters, but he made no mention of a camel-driver having a melodious voice.",
      "chain": [
        "30160",
        "30002",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6225",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار وأحمد بن إبراهيم الدورقي وهارون بن عبد الله جميعا عن أبي داود، قال ابن المثنى حدثنا سليمان بن داود، حدثنا شعبة، عن  خليد بن جعفر، سمع أبا إياس، عن أنس، أنه سئل عن شيب النبي، صلى الله عليه وسلم فقال ما شانه الله ببيضاء ‏.‏",
      "text_en": " Anas (b. Malik) was asked about the old age of Allah's Apostle (may peace be upon him). He said:                      Allah did not blemish him with white hair.",
      "chain": [
        "30170",
        "30002",
        "30584",
        "20020",
        "10682",
        "11306",
        "19"
      ]
    },
    {
      "hadith_no": "6494",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، عن قتادة، قال سمعت أنسا، يقول جمع القرآن على عهد رسول الله صلى الله عليه وسلم أربعة كلهم من الأنصار معاذ بن جبل وأبى بن كعب وزيد بن ثابت وأبو زيد ‏.‏ قال قتادة قلت لأنس من أبو زيد قال أحد عمومتي ‏.‏",
      "text_en": " Anas is reported to have said:                      Four persons collected the Qur'an during the lifetime of Allah's Messenger (may peace be upon him) and all of them were Ansar: Mu'adh b. Jabal, Ubayy b. Ka'b, Zaid b. Thabit, Abu Zaid. Qatada said: Anas, who was Abu Zaid? He said: He was one of my uncles.",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6503",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا أبو داود، حدثنا شعبة، أنبأني أبو إسحاق، قال سمعت البراء بن عازب، يقول أتي رسول الله صلى الله عليه وسلم بثوب حرير ‏.‏ فذكر الحديث ثم قال ابن عبدة أخبرنا أبو داود حدثنا شعبة حدثني قتادة عن أنس بن مالك عن النبي صلى الله عليه وسلم بنحو هذا أو بمثله ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "30002",
        "400"
      ]
    },
    {
      "hadith_no": "6528",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، عن قتادة، سمعت أنسا، يقول قالت أم سليم يا رسول الله خادمك أنس ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " Anas reported (that his mother) Umm Sulaim said (to the Holy Prophet) Allah's Messenger, here is your servant Anas. The rest of the hadith is the same.",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6578",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثناه محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، عن قتادة، سمعت أنسا، يحدث عن أبي أسيد الأنصاري، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Abu Usaid Ansari has reported this hadith through another chain of transmitters. When the Holy Prophet (may peace be upon him) was marching towards Badr in order",
      "chain": [
        "30002",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6582",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو بن علي بن بحر، حدثني أبو داود، حدثنا حرب بن شداد، عن يحيى، بن أبي كثير حدثني أبو سلمة، أن أبا أسيد الأنصاري، حدثه أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الأنصار أو خير دور الأنصار ‏\"‏ ‏.‏ بمثل حديثهم في ذكر الدور ولم يذكر قصة سعد بن عبادة رضى الله عنه ‏.‏",
      "text_en": " Abu Usaid Ansari reported that he heard Allah's Messenger (may peace be upon him) as saying:                      The worthiest of the Ansar or the worthiest of the settlements and the clans of Ansar; the rest of the hadith is the same, but there is no mention of the story of Sa'd b. 'Ubida (Allah be pleased with him).",
      "chain": [
        "30153",
        "30002",
        "20220",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "6587",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثناه محمد بن المثنى، وابن، بشار قالا حدثنا أبو داود، حدثنا شعبة، في هذا الإسناد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30160",
        "30002"
      ]
    },
    {
      "hadith_no": "6695",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، عن قتادة، عن أنس، أنوسلم قال ‏\"‏ لا تحاسدوا ولا تباغضوا ولا تقاطعوا وكونوا عباد الله إخوانا ‏\"‏ ‏.‏  حدثنيه علي بن نصر الجهضمي، حدثنا وهب بن جرير، حدثنا شعبة، بهذا الإسناد مثله وزاد ‏\"‏ كما أمركم الله ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Apostle (may peace be upon him) as saying:                      Nurse no grudge, nurse no aversion and do not sever ties of kinship and live like fellow-brothers as servants of Allah. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with this addition:\" As Allah has commanded you.\"",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11019",
        "20298"
      ]
    },
    {
      "hadith_no": "7059",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، ح وحدثنا ابن بشار، حدثنا  عبد الرحمن، وأبو داود قالا حدثنا شعبة، عن عمرو بن مرة، قال سمعت سعد بن عبيدة، يحدث عن البراء بن عازب، أن رسول الله صلى الله عليه وسلم أمر رجلا إذا أخذ مضجعه من الليل أن يقول ‏\"‏ اللهم أسلمت نفسي إليك ووجهت وجهي إليك وألجأت ظهري إليك وفوضت أمري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت وبرسولك الذي أرسلت ‏.‏ فإن مات مات على الفطرة ‏\"‏ ‏.‏ ولم يذكر ابن بشار في حديثه من الليل ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that Allah's Messenger (in may peace be upon him) commanded a person (in these words):                      When you go to bed during night, you should say:\" O Allah, I surrender myself to Thee and entrust my affair to Thee, with hope in Thee and fear of Thee. There is no resort and no deliverer (from hardship but Thou). I affirm my faith in the Book which Thou revealed and in the Messengers whom Thou sent.\" If you die in this state you would die on Fitra, and Ibn Bashshdr did not make a mention of\" night\" in this hadith.",
      "chain": [
        "30170",
        "30002",
        "20020",
        "30160",
        "20033",
        "30002",
        "20020",
        "11381",
        "11344",
        "400"
      ]
    },
    {
      "hadith_no": "7173",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا أبان بن يزيد، وحرب بن شداد، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل رواية حجاج حديث أبي هريرة خاصة ولم يذكر حديث أسماء ‏.‏",
      "text_en": " Abu Salama reported from Abu Huraira that he narrated that Allah's Messenger (may peace be upon hin) said:                      There is none more self-respecting than Allah, the Exalted and Glorious There is no mention of the narration of Asma'.",
      "chain": [
        "30170",
        "30002",
        "20205",
        "20220",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7256",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، وأبو داود ح وحدثنا ابن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وأبو داود كلهم عن شعبة، عن قتادة، عن أنس، قال انشق القمر فرقتين ‏.‏ وفي حديث أبي داود انشق القمر على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported that the moon was split up in two parts and in the hadith recorded in Abu Dawud, the words are:                     \" The moon was split up into two parts during the life of Allah's Messenger (may peace be upon him).\"",
      "chain": [
        "30170",
        "20173",
        "30002",
        "30160",
        "20031",
        "20173",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7510",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أحمد بن إبراهيم الدورقي، وأحمد بن عثمان النوفلي، قالا حدثنا أبو داود حدثنا شعبة، في هذا الإسناد في معناه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30494",
        "30185",
        "30002"
      ]
    },
    {
      "hadith_no": "7665",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه أحمد بن عبدة الضبي، أخبرنا أبو داود، حدثنا عبد العزيز بن أبي سلمة، حدثنا وهب بن كيسان، بهذا الإسناد غير أنه قال ‏\"‏ وأجعل ثلثه في المساكين والسائلين وابن السبيل ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Wahb b. Kaisan with the same chain of transmitters but with this change that he said:                     \" I earmark one-third for the poor, the needy and the wayfarers.\"",
      "chain": [
        "30423",
        "30002",
        "32017",
        "11231"
      ]
    },
    {
      "hadith_no": "204",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد بن السري، وإبراهيم بن أبي معاوية، عن أبي معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثني شريك، وجرير، وابن، إدريس عن الأعمش، عن شقيق، قال قال عبد الله كنا لا نتوضأ من موطئ ولا نكف شعرا ولا ثوبا ‏.‏ قال أبو داود قال إبراهيم بن أبي معاوية فيه عن الأعمش عن شقيق عن مسروق أو حدثه عنه قال قال عبد الله وقال هناد عن شقيق أو حدثه عنه ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We would not wash our feet after treading on something unclean, nor would we hold our hair and garments (during prayer).Abu Dawud said: The tradition has been reported by Ibrahim b. Abi Mu'awiyah through a different chain of narrators: A'mash - Shaqiq - Masruq - 'Abd Allah (b. Mas'ud). And Hannad reported from Shaqiq, or reported on his authority saying: 'Abd Allah (b. Mas'ud) said.",
      "chain": [
        "30480",
        "20354",
        "30203",
        "20587",
        "4057",
        "20102",
        "11060",
        "11353",
        "30002",
        "11060"
      ]
    },
    {
      "hadith_no": "209",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، قال حدثنا أبي، عن هشام بن عروة، عن أبيه، عن حديث، حدثه عن علي بن أبي طالب، قال قلت للمقداد ‏.‏ فذكر معناه ‏.‏ قال أبو داود ورواه المفضل بن فضالة وجماعة والثوري وابن عيينة عن هشام عن أبيه عن علي بن أبي طالب ورواه ابن إسحاق عن هشام بن عروة عن أبيه عن المقداد عن النبي صلى الله عليه وسلم لم يذكر ‏\"‏ أنثييه ‏\"‏ ‏.‏",
      "text_en": " ‘Urwah reported on the Authority of his father a tradition from ‘Ali b. Abi Talib who said :                      I Asked al-Miqdad (to consult the prophet). He then narrated the tradition bearing the same meaning.Abu Dawud said; this tradition has been reported with another chain of narrators. This version does not mention the word “testicles”.",
      "chain": [
        "20164",
        "24428",
        "11065",
        "10511",
        "5",
        "30002",
        "20378",
        "11065",
        "10511",
        "5",
        "11107"
      ]
    },
    {
      "hadith_no": "223",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا ابن المبارك، عن يونس، عن الزهري، بإسناده ومعناه زاد ‏\"‏ وإذا أراد أن يأكل وهو جنب غسل يديه ‏\"‏ ‏.‏ قال أبو داود ورواه ابن وهب عن يونس فجعل قصة الأكل قول عائشة مقصورا ورواه صالح بن أبي الأخضر عن الزهري كما قال ابن المبارك إلا أنه قال عن عروة أو أبي سلمة ورواه الأوزاعي عن يونس عن الزهري عن النبي صلى الله عليه وسلم كما قال ابن المبارك ‏.‏",
      "text_en": " This Tradition has been narrated on the Authority of al-Zuhri through a different chain. It adds :                      If he intends to eat while he is defiled, he should wash both his hands.Abu Dawud said: Ibn Wahb narrated this tradition on the authority of  Yunus. He described the fact of eating as the statement of ‘A’ishah (not the saying of the prophet). It has also been narrated it from ‘Urwah or Abu Salamah. Al-Awza’I narrated it from Yunus on the Authority of Al-Zuhri from the prophet (ﷺ) as narrated by Ibn al-Mubarak.",
      "chain": [
        "30269",
        "20025",
        "20475",
        "30002",
        "20029",
        "20714"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، بإسناده ومعناه قال في أوله فكبر ‏.‏ وقال في آخره فلما قضى الصلاة قال ‏\"‏ إنما أنا بشر وإني كنت جنبا ‏\"‏ ‏.‏ قال أبو داود رواه الزهري عن أبي سلمة بن عبد الرحمن عن أبي هريرة قال فلما قام في مصلاه وانتظرنا أن يكبر انصرف ثم قال ‏\"‏ كما أنتم ‏\"‏ ‏.‏ قال أبو داود ورواه أيوب وابن عون وهشام عن محمد مرسلا عن النبي صلى الله عليه وسلم قال فكبر ثم أومأ بيده إلى القوم أن اجلسوا فذهب فاغتسل ‏.‏ وكذلك رواه مالك عن إسماعيل بن أبي حكيم عن عطاء بن يسار أن رسول الله صلى الله عليه وسلم كبر في صلاة ‏.‏ قال أبو داود وكذلك حدثناه مسلم بن إبراهيم حدثنا أبان عن يحيى عن الربيع بن محمد عن النبي صلى الله عليه وسلم أنه كبر ‏.‏",
      "text_en": " This tradition has been reported by Hammad b. Salamah through the same chain of narrators and conveying a similar meaning. This version adds in the beginning:                      He uttered TAKBIR (Allahu akbar), and in the end : when he finished the prayer, he said : I am a human being; I was sexually defiled.Abu Dawud said : This tradition has been narrated al-Zuhri from Abu Salamah b. ‘Abd al-Rahman on the authority of Abu Hurairah. It says: When he stood at the place of prayer, we waited for his utterance of takbir (Allah-u akbar).He went away and said : (remain) as you were.Another version on the authority of Muhammad reporting  from the Prophet (ﷺ) says: He uttered takbir (Allah-u-Akbar) and then made a sign to the people, meaning \"sit down\". He then went away and took a bath. This tradition has also been narrated through a different chain. It says: The Messenger of Allah (ﷺ) uttered takbir (Allah-u-akbar) in a prayer.Abu Dawud said: Another version through a different chain says; The Prophet (May peace be upon him) uttered takbir (Allah-u akbar).",
      "chain": [
        "30203",
        "20472",
        "20021",
        "30002",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثني الليث بن سعد، عن ابن شهاب، عن عروة، عن عائشة، بهذا الحديث قال فيه فكانت تغتسل لكل صلاة ‏.‏ قال أبو داود رواه القاسم بن مبرور عن يونس عن ابن شهاب عن عمرة عن عائشة عن أم حبيبة بنت جحش وكذلك رواه معمر عن الزهري عن عمرة عن عائشة وربما قال معمر عن عمرة عن أم حبيبة بمعناه وكذلك رواه إبراهيم بن سعد وابن عيينة عن الزهري عن عمرة عن عائشة وقال ابن عيينة في حديثه ولم يقل إن النبي صلى الله عليه وسلم أمرها أن تغتسل ‏.‏ وكذلك رواه الأوزاعي أيضا قال فيه قالت عائشة فكانت تغتسل لكل صلاة ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\tThis has bee\tn narrated though a different chain of narrators by 'Aishah. This version has the words:                      \"She used to take a bath for every prayer.\"Abu Dawud said: Al-Qasim b. Mabrur reported from Yunus from Ibn Shihab from 'Amrah from 'Aishah from Umm Habibah daughter of Jahsh. Similarly, it was reported by Ma'mar from al-Zuhri from 'Amrah from 'Aishah. Ma'mar sometimes reported from 'Amrah on the authority of Umm Habibah to the same effect. Similarly, it was reported by Ibrahim b. Sa'd and Ibn 'Uyainah from al-Zuhri from 'Amrah from 'Aishah. Ibn 'Uyainah said in his version: He (al-Zuhri) did not say that the Prophet (ﷺ) commanded her to take bath.It has also been transmitted by al-Awza'i in a similar way. In this version he said: 'Aishah said: She used to take bath for very prayer.",
      "chain": [
        "38715",
        "20023",
        "11013",
        "10511",
        "53",
        "30002",
        "28488",
        "20475",
        "11013",
        "11455",
        "53",
        "20115",
        "11013"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الملك بن شعيب، حدثني عبد الله بن وهب، أخبرنا الليث، عن ربيعة، أنه كان لا يرى على المستحاضة وضوءا عند كل صلاة إلا أن يصيبها حدث غير الدم فتوضأ ‏.‏ قال أبو داود هذا قول مالك يعني ابن أنس ‏.‏",
      "text_en": " Rabi'ah said:                      Umm Habibah daughter of Jahsh had a prolonged flow of blood. The Prophet (ﷺ) commander her to refrain (from prayer) during her menstrual period; then she should wash and pray. If she sees anything (which renders ablution void) she should perform ablution and pray.Abu Dawud said: This is the view held by Malik b. Anas.",
      "chain": [
        "30489",
        "20029",
        "20023",
        "11162",
        "30002"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، عن أبي داود، ح وحدثنا نصر بن المهاجر، حدثنا يزيد بن هارون، عن المسعودي، عن عمرو بن مرة، عن ابن أبي ليلى، عن معاذ بن جبل، قال أحيلت الصلاة ثلاثة أحوال وأحيل الصيام ثلاثة أحوال وساق نصر الحديث بطوله واقتص ابن المثنى منه قصة صلاتهم نحو بيت المقدس قط قال الحال الثالث أن رسول الله صلى الله عليه وسلم قدم المدينة فصلى - يعني نحو بيت المقدس - ثلاثة عشر شهرا فأنزل الله تعالى هذه الآية ‏{‏ قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا وجوهكم شطره ‏}‏ فوجهه الله تعالى إلى الكعبة ‏.‏ وتم حديثه وسمى نصر صاحب الرؤيا قال فجاء عبد الله بن زيد رجل من الأنصار وقال فيه فاستقبل القبلة قال الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة مرتين حى على الفلاح مرتين الله أكبر الله أكبر لا إله إلا الله ثم أمهل هنية ثم قام فقال مثلها إلا أنه قال زاد بعد ما قال ‏\"‏ حى على الفلاح ‏\"‏ ‏.‏ قد قامت الصلاة قد قامت الصلاة ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقنها بلالا ‏\"‏ ‏.‏ فأذن بها بلال وقال في الصوم قال فإن رسول الله صلى الله عليه وسلم كان يصوم ثلاثة أيام من كل شهر ويصوم يوم عاشوراء فأنزل الله تعالى ‏{‏ كتب عليكم الصيام كما كتب على الذين من قبلكم ‏}‏ إلى قوله ‏{‏ طعام مسكين ‏}‏ فكان من شاء أن يصوم صام ومن شاء أن يفطر ويطعم كل يوم مسكينا أجزأه ذلك وهذا حول فأنزل الله تعالى ‏{‏ شهر رمضان الذي أنزل فيه القرآن ‏}‏ إلى ‏{‏ أيام أخر ‏}‏ فثبت الصيام على من شهد الشهر وعلى المسافر أن يقضي وثبت الطعام للشيخ الكبير والعجوز اللذين لا يستطيعان الصوم وجاء صرمة وقد عمل يومه وساق الحديث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     Prayer passed through three stages and fasting also passed through three stages. The narrator Nasr reported the rest of the tradition completely. The narrator, Ibn al-Muthanna, narrated the story of saying prayer facing in the direction of Jerusalem.  He said: The third stage is that the Messenger of Allah (ﷺ) came to Medina and prayed, i.e. facing Jerusalem, for thirteen months.  Then Allah, the Exalted, revealed the verse: \"We have seen thee turning thy face to Heaven (for guidance, O Muhammad). And now verily We shall make thee turn (in prayer) toward a qiblah which is dear to thee. So turn thy face toward the Inviolable Place of Worship, and ye (O Muslims), wherever ye may be, turn your face (when ye pray) toward it\" (ii.144). And Allah, the Reverend and the Majestic, turned (them) towards the Ka'bah. He (the narrator) completed his tradition.  The narrator, Nasr, mentioned the name of the person who had the dream, saying: And Abdullah ibn Zayd, a man from the Ansar, came. The same version reads: And he turned his face towards the qiblah and said: Allah is most great, Allah is most great; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah; come to prayer (he pronounced it twice), come to salvation (he pronounced it twice); Allah is Most Great, Allah is most great. He then paused for a while, and then got up and pronounced in a similar way, except that after the phrase \"Come to salvation\" he added. \"The time for prayer has come, the time for prayer has come.\"  The Messenger of Allah (ﷺ) said: Teach it to Bilal, then pronounce the adhan (call to prayer) with the same words. As regards fasting, he said: The Messenger of Allah (ﷺ) used to fast for three days every month, and would fast on the tenth of Muharram. Then Allah, the Exalted, revealed the verse: \".......Fasting was prescribed for those before you, that ye may ward off (evil)......and for those who can afford it there is a ransom: the feeding of a man in need (ii.183-84). If someone wished to keep the fast, he would keep the fast; if someone wished to abandon the fast, he would feed an indigent every day; it would do for him. But this was changed. Allah, the Exalted, revealed: \"The month of Ramadan in which was revealed the Qur'an ..........(let him fast the same) number of other days\" (ii.185).  Hence the fast was prescribed for the one who was present in the month (of Ramadan) and the traveller was required to atone (for them); feeding (the indigent) was prescribed for the old man and woman who were unable to fast. (The narrator, Nasr, further reported): The companion Sirmah, came after finishing his day's work......and he narrated the rest of the tradition.",
      "chain": [
        "30170",
        "30002",
        "20472",
        "20724",
        "11381",
        "11196",
        "32"
      ]
    },
    {
      "hadith_no": "621",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زهير بن حرب، وهارون بن معروف، - المعنى - قالا حدثنا سفيان، عن أبان بن تغلب، - قال أبو داود قال زهير حدثنا الكوفيون، أبان وغيره - عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء، قال كنا نصلي مع النبي صلى الله عليه وسلم فلا يحنو أحد منا ظهره حتى يرى النبي صلى الله عليه وسلم يضع ‏.‏",
      "text_en": " Al-Bara b.‘Azib said ; we used to pray along with the prophet (ﷺ); none of us bowed his back until he saw that the prophet (ﷺ) bowed (his back).",
      "chain": [
        "30022",
        "30280",
        "20005",
        "20577",
        "30002",
        "20321",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "637",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زيد بن أخزم، حدثنا أبو داود، عن أبي عوانة، عن عاصم، عن أبي عثمان، عن ابن مسعود، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أسبل إزاره في صلاته خيلاء فليس من الله في حل ولا حرام ‏\"‏ ‏.‏ قال أبو داود روى هذا جماعة عن عاصم موقوفا على ابن مسعود منهم حماد بن سلمة وحماد بن زيد وأبو الأحوص وأبو معاوية ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     I heard the Messenger of Allah (ﷺ) say: He who lets his garment trail during prayer out of pride, Allah, the Almighty, has nothing to do with pardoning him and protecting him from Hell.",
      "chain": [
        "30136",
        "30002",
        "20469",
        "11080",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "644",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى بن الطباع، حدثنا حجاج، عن ابن جريج، قال أكثر ما رأيت عطاء يصلي سادلا ‏.‏ قال أبو داود وهذا يضعف ذلك الحديث ‏.‏",
      "text_en": " Ibn Juraij said; I often saw ‘Ata praying while letting his garment trail.Abu Dawud said:                      This (practice of ‘Ata’) weakens the tradition (narrated by Abu Hurairah).",
      "chain": [
        "36649",
        "20219",
        "11070",
        "30002"
      ]
    },
    {
      "hadith_no": "706",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا كثير بن عبيد يعني المذحجي، حدثنا أبو حيوة، عن سعيد، بإسناده ومعناه زاد فقال ‏\"‏ قطع صلاتنا قطع الله أثره ‏\"‏ ‏.‏ قال أبو داود ورواه أبو مسهر عن سعيد قال فيه ‏\"‏ قطع صلاتنا ‏\"‏ ‏.‏",
      "text_en": " This tradition as also been reported by Sa’id through the same chain of narrators and to the same effect. He added:                      He cut off our prayer, may Allah cut off his walking.Abu Dawud said: This version narrated by Mushir on the authority of Sa’id has: He cut off our prayer.",
      "chain": [
        "38462",
        "30002",
        "30284",
        "11168"
      ]
    },
    {
      "hadith_no": "714",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، ح قال أبو داود وحدثنا القعنبي، حدثنا عبد العزيز، - يعني ابن محمد وهذا لفظه - عن محمد بن عمرو، عن أبي سلمة، عن عائشة، أنها قالت كنت أنام وأنا معترضة، في قبلة رسول الله صلى الله عليه وسلم فيصلي رسول الله صلى الله عليه وسلم وأنا أمامه فإذا أراد أن يوتر ‏.‏ زاد عثمان غمزني ثم اتفقا فقال ‏\"‏ تنحى ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I used to sleep lying between the Messenger of Allah (ﷺ) and the qiblah. The Messenger of Allah (ﷺ) used to pray when I (was lying) in front of him. When he wanted to offer the witr prayer - added by the narrator Uthman - he pinched me - then the narrators are agreed - and said: Set aside.",
      "chain": [
        "30203",
        "20352",
        "30002",
        "20164",
        "20167",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "735",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني عتبة، حدثني عبد الله بن عيسى، عن العباس بن سهل الساعدي، عن أبي حميد، بهذا الحديث قال وإذا سجد فرج بين فخذيه غير حامل بطنه على شىء من فخذيه ‏.‏ قال أبو داود رواه ابن المبارك أخبرنا فليح سمعت عباس بن سهل يحدث فلم أحفظه فحدثنيه أراه ذكر عيسى بن عبد الله أنه سمعه من عباس بن سهل قال حضرت أبا حميد الساعدي بهذا الحديث ‏.‏",
      "text_en": " Abu Humaid reported to the same effect. He said:                      When he (the Prophet) prostrated he kept his thighs wide and did not let his belly touch the thighs.Abu Dawud says that Ibn Mubarak narrated this hadith from ‘Abbas b. Sahl, which he did not remember well. It is thought that he has mentioned ‘Isa b. ‘Abd Allah, ‘Abbas b. Sahl and Abu Humaid al-Sa’idi.",
      "chain": [
        "10581",
        "20644",
        "11361",
        "1457",
        "30002",
        "20025",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "758",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، عن عبد الرحمن بن إسحاق الكوفي، عن سيار أبي الحكم، عن أبي وائل، قال قال أبو هريرة أخذ الأكف على الأكف في الصلاة تحت السرة ‏.‏ قال أبو داود سمعت أحمد بن حنبل يضعف عبد الرحمن بن إسحاق الكوفي ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     (The established way of folding hands is) to hold the hands by the hands in prayer below the navel.Abu Dawud said: I heard Ahmad b. Hanbal say: The narrator 'Abd al-Rahman b. Ishaq al-Kufi is weak (i.e. not reliable).",
      "chain": [
        "30175",
        "20256",
        "11429",
        "11353",
        "30002"
      ]
    },
    {
      "hadith_no": "813",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا هشام بن عروة، أن أباه، كان يقرأ في صلاة المغرب بنحو ما تقرءون ‏{‏ والعاديات ‏}‏ ونحوها من السور ‏.‏ قال أبو داود هذا يدل على أن ذاك منسوخ وهذا أصح ‏.‏",
      "text_en": " HIsham b . ‘Urwah said that his father (‘Umrah) used to recite the surahs as you recite like Wa’l-Adiyat(surah c).Abu Dawud said:                      This indicates that those (traditions indicating long surahs) are abrogated, and this is more sound tradition.",
      "chain": [
        "20040",
        "20022",
        "11065",
        "10511",
        "30002"
      ]
    },
    {
      "hadith_no": "837",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، وابن المثنى، قالا حدثنا أبو داود، حدثنا شعبة، عن الحسن بن عمران، - قال ابن بشار الشامي وقال أبو داود أبو عبد الله العسقلاني - عن ابن عبد الرحمن بن أبزى، عن أبيه، أنه صلى مع رسول الله صلى الله عليه وسلم وكان لا يتم التكبير ‏.‏ قال أبو داود معناه إذا رفع رأسه من الركوع وأراد أن يسجد لم يكبر وإذا قام من السجود لم يكبر ‏.‏",
      "text_en": " ‘Abd al Rahman b. Abza said that he offered prayer along with the Messenger of Allah(ﷺ) but he did not complete the takbir.Abu Dawud said:                      This means that when he raised his head after bowing and when he was about to prostrate, he did not utter the takbir, and when he stood up after prostration, he did not utter the takbir.",
      "chain": [
        "30160",
        "30170",
        "30002",
        "20020",
        "28103",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "886",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الملك بن مروان الأهوازي، حدثنا أبو عامر، وأبو داود عن ابن أبي ذئب، عن إسحاق بن يزيد الهذلي، عن عون بن عبد الله، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ركع أحدكم فليقل ثلاث مرات سبحان ربي العظيم وذلك أدناه وإذا سجد فليقل سبحان ربي الأعلى ثلاثا وذلك أدناه ‏\"‏ ‏.‏ قال أبو داود هذا مرسل عون لم يدرك عبد الله ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: When one of you bows, he should say three time,:\"Glory be to my mighty Lord,\" and when he prostrates, he should say: \"Glory be to my most high Lord\" three times. This is the minimum number.Abu Dawud said: The chain of this tradition is broken. The narrator 'Awn did not see 'Abd Allah (b. Mas'ud).",
      "chain": [
        "20443",
        "30002",
        "20177",
        "12010",
        "10806",
        "16"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا معاوية بن هشام، عن سفيان، عن أبي مالك، عن أبي حازم، عن أبي هريرة، قال - أراه رفعه - قال ‏\"‏ لا غرار في تسليم ولا صلاة ‏\"‏ ‏.‏ قال أبو داود ورواه ابن فضيل على لفظ ابن مهدي ولم يرفعه ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet(ﷺ) as saying :                      There is no loss in salutation and in prayer.Abu Dawud said: According to the version of Ibn Mahdi, this tradition has been narrated by Ibn Fudail as a statement of Abu Hurairah and not as a saying of the Prophet(ﷺ)",
      "chain": [
        "30216",
        "20609",
        "20012",
        "10766",
        "11349",
        "13",
        "30002"
      ]
    },
    {
      "hadith_no": "960",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن يحيى، بإسناده مثله ‏.‏ قال أبو داود قال حماد بن زيد عن يحيى، أيضا من السنة كما قال جرير ‏.‏",
      "text_en": " (There is another chain) from Yahya with his chain and similar (to the previous hadith). Abu Dawud said:                      Hammad bin Zaid also said (the wording): \"From the Sunnah\" (narrating) from Yahya just as Jarir did.",
      "chain": [
        "30203",
        "20028",
        "30002",
        "20022",
        "11449"
      ]
    }
  ],
  "total_hadiths": 209
}