{
  "id": "30008",
  "name": "Ibn Sa'd محمد بن سعد البغدادي",
  "full_name": "Ibn Sa'd محمد بن سعد البغدادي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "168",
      "date_gregorian": "784",
      "date_display": [
        "168 AH",
        "784 CE"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "230",
      "date_gregorian": "45",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra",
      "Baghdad",
      " Kufa",
      " Medina"
    ],
    "area_of_interest": [
      "History",
      "Seerah",
      "Narrator[Grade:No Doubt] [ د  -  صدوق ]"
    ],
    "tags": [
      "Ally B.Hashim",
      "Basri",
      "Katib"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20738",
      "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "31513",
      "name": "al-Harith bin Muhammad bin Abi Usama الحارث بن محمد بن أبي أسامة",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "398",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا الحسن الحلواني، حدثنا يعقوب، حدثنا أبي، عن صالح، عن إسماعيل بن محمد، قال سمعت محمد بن سعد، يحدث هذا فقال في حديثه فضرب رسول الله صلى الله عليه وسلم بيده بين عنقي وكتفي ثم قال ‏\"‏ أقتالا أى سعد إني لأعطي الرجل ‏\"‏ ‏.‏",
      "text_en": " The same hadith has been narrated on the authority of Muhammad b Sa'd and these words (are also there):                      The Messenger of Allah (may peace be upon him) gave a stroke on my neck or between my two shoulders and said: Sa'd, do you fight with me simply because I gave (a share) to a man?",
      "chain": [
        "20184",
        "20150",
        "11176",
        "30008"
      ]
    },
    {
      "hadith_no": "2482",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، عن إسماعيل بن محمد بن سعد، قال سمعت محمد بن سعد، يحدث بهذا الحديث - يعني حديث الزهري الذي ذكرنا - فقال في حديثه فضرب رسول الله صلى الله عليه وسلم بيده بين عنقي وكتفي ثم قال ‏\"‏ أقتالا أى سعد إني لأعطي الرجل ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Muhammad b. Sa'd through another chain of transmitters (and the words are):                     \" The Messenger of Allah (may peace be upon him) struck between my neck and shoulder with his hand and said: Do you wrangle,0 Sa'd, because I bestow (some gifts) upon a person?\"",
      "chain": [
        "30115",
        "20184",
        "20150",
        "11176",
        "11500",
        "30008"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا إسماعيل بن أبي خالد، حدثني محمد بن سعد، عن سعد بن أبي وقاص، - رضى الله عنه - قال ضرب رسول الله صلى الله عليه وسلم بيده على الأخرى فقال ‏\"‏ الشهر هكذا وهكذا ‏\"‏ ‏.‏ ثم نقص في الثالثة إصبعا ‏.‏",
      "text_en": " Sa'd b. Abi Waqqas (Allah be pleased with him) said that the Messenger of Allah (may peace be upon him) struck his hand against the other and (then with the gesture of his two hands) said:                      The month is thus, thus (two times). He then withdrew (one of) his fingers at the third turn.",
      "chain": [
        "30201",
        "20352",
        "11418",
        "30008",
        "9"
      ]
    },
    {
      "hadith_no": "4081",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا منصور بن أبي مزاحم، ومحمد بن جعفر بن زياد، - قال منصور حدثنا إبراهيم بن سعد، عن الزهري، وقال ابن جعفر، أخبرنا إبراهيم، وهو ابن سعد عن ابن، شهاب عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كان رجل يداين الناس فكان يقول لفتاه إذا أتيت معسرا فتجاوز عنه لعل الله يتجاوز عنا ‏.‏ فلقي الله فتجاوز عنه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      There was a person who gave loans to the people and said to his men: When an insolvent comes to you show him leniency that Allah may overlook our (faults). So when he met Allah, He overlooked his faults (forgave him).",
      "chain": [
        "30523",
        "20173",
        "11067",
        "20150",
        "11013",
        "11051",
        "30008",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "6031",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن يونس بن جبير، عن محمد بن سعد، عن سعد، عن النبي صلى الله عليه وسلم قال ‏\"‏ لأن يمتلئ جوف أحدكم قيحا يريه خير من أن يمتلئ شعرا ‏\"‏ ‏.‏",
      "text_en": " Sa'd reported Allah's Apostle (may peace be upon him) as saying:                      It is better for the belly of any one of you to be stuffed with pus rather than to stuff (one's mind) with poetry.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "11320",
        "30008",
        "9"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو صالح، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن أبي إسحاق الشيباني، عن ابن سعد، - قال غير أبي صالح عن الحسن بن سعد، - عن عبد الرحمن بن عبد الله، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فانطلق لحاجته فرأينا حمرة معها فرخان فأخذنا فرخيها فجاءت الحمرة فجعلت تفرش فجاء النبي صلى الله عليه وسلم فقال ‏\"‏ من فجع هذه بولدها ردوا ولدها إليها ‏\"‏ ‏.‏ ورأى قرية نمل قد حرقناها فقال ‏\"‏ من حرق هذه ‏\"‏ ‏.‏ قلنا نحن ‏.‏ قال ‏\"‏ إنه لا ينبغي أن يعذب بالنار إلا رب النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We were with the Messenger of Allah (ﷺ) during a journey. He went to ease himself. We saw a bird with her two young ones and we captured her young ones. The bird came and began to spread its wings. The Messenger of Allah (ﷺ) came and said: Who grieved this for its young ones? Return its young ones to it. He also saw an ant village that we had burnt. He asked: Who has burnt this? We replied: We. He said: It is not proper to punish with fire except the Lord of fire.",
      "chain": [
        "20405",
        "11352",
        "30008",
        "10754",
        "20439",
        "11183"
      ]
    },
    {
      "hadith_no": "5268",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو صالح، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن أبي إسحاق الشيباني، عن ابن سعد، - قال أبو داود وهو الحسن بن سعد - عن عبد الرحمن بن عبد الله، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فانطلق لحاجته فرأينا حمرة معها فرخان فأخذنا فرخيها فجاءت الحمرة فجعلت تعرش فجاء النبي صلى الله عليه وسلم فقال ‏\"‏ من فجع هذه بولدها ردوا ولدها إليها ‏\"‏ ‏.‏ ورأى قرية نمل قد حرقناها فقال ‏\"‏ من حرق هذه ‏\"‏ ‏.‏ قلنا نحن ‏.‏ قال ‏\"‏ إنه لا ينبغي أن يعذب بالنار إلا رب النار ‏\"‏ ‏.‏",
      "text_en": " ‘Abd al-Rahman b. ‘Abd Allah quoted his father as saying :                      When we were on a journey with the Messenger of Allah (ﷺ) and he had gone to releive himself, we saw a Hummarah with two young ones. We took the young ones. The Hummarah came and began to spread out its wings. Then the prophet (May peace be upon him) came and said : who has pained this young by the loss of her young? Give her young ones back to her. We also saw an ant-hill which we had burned. He asked? Who has burned this? We replied : we have. He said: it is not fitting that anyone but the lord of the fire should punish with fire.",
      "chain": [
        "20405",
        "11352",
        "30008",
        "20439",
        "11183"
      ]
    },
    {
      "hadith_no": "3089",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، أخبرنا يحيى بن سعيد، عن شعبة، عن قتادة، عن يونس بن جبير، عن محمد بن سعد بن أبي وقاص، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يمتلئ جوف أحدكم قيحا خير له من أن يمتلئ شعرا ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Muhammad bin Sa'd bin Abi Waqqas:                     from his father that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11019",
        "11320",
        "30008"
      ]
    },
    {
      "hadith_no": "3490",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن فضيل، عن محمد بن سعد الأنصاري، عن عبد الله بن ربيعة الدمشقي، حدثنا عائذ الله أبو إدريس الخولاني، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كان من دعاء داود يقول اللهم إني أسألك حبك وحب من يحبك والعمل الذي يبلغني حبك اللهم اجعل حبك أحب إلى من نفسي وأهلي ومن الماء البارد ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم إذا ذكر داود يحدث عنه قال ‏\"‏ كان أعبد البشر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Ad-Darda narrated that :                     the Messenger of Allah said: “It used to be from the supplication of Dawud that he would say: ‘O Allah, indeed, I ask You for Your love and the love of those who love You, and for the action that will cause me to attain Your love, O Allah, make You love more beloved to me than myself, my family and cold water (Allahumma Inni-As’aluka Hubbaka Wa Hubba Man Yuhibbuka Wal-Amalalladhi Yuballighuni Hubbak. Allahummaj’al Hubbaka Ahabba Ilaiya  Min Nafsi, Wa Ahli Wa Minal-Ma’il-Barid)He said: “And when the Prophet would mention Dawud, he would narrate about him, saying: “He was the best in worship out of all men.”",
      "chain": [
        "30216",
        "20356",
        "30008",
        "37"
      ]
    },
    {
      "hadith_no": "4281",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا سليمان بن داود الهاشمي، حدثنا إبراهيم بن سعد، حدثني صالح بن كيسان، عن الزهري، عن محمد بن أبي سفيان، عن يوسف بن الحكم، عن محمد بن سعد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد هوان قريش أهانه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Sa'd:                     that the Messenger of Allah (ﷺ) said: \"Whoever wishes to humiliate the Quraish then Allah will humiliate him.\"",
      "chain": [
        "30292",
        "30584",
        "20150",
        "11176",
        "11013",
        "30008"
      ]
    },
    {
      "hadith_no": "922",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا محمد بن سعد الأنصاري، قال حدثني محمد بن عجلان، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الإمام ليؤتم به فإذا كبر فكبروا وإذا قرأ فأنصتوا ‏\"‏ ‏.‏ قال أبو عبد الرحمن كان المخرمي يقول هو ثقة يعني محمد بن سعد الأنصاري ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'The Imam is appointed to be followed, so when he says the takbir, say the takbir, and when he recites, be silent.'\"",
      "chain": [
        "30008",
        "10616",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2135",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا محمد بن بشر، عن إسماعيل بن أبي خالد، عن محمد بن سعد بن أبي وقاص، عن أبيه، عن النبي صلى الله عليه وسلم أنه ضرب بيده على الأخرى وقال ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ ونقص في الثالثة إصبعا ‏.‏",
      "text_en": " It was narrated form Muhammad bin Sad Abi Waqqas, from his father, that:                     the Prophet struck one hand with the other and said: \"The month is like this and like this and like this,\" retaining one finger the third time.",
      "chain": [
        "30123",
        "20352",
        "11418",
        "30008"
      ]
    },
    {
      "hadith_no": "2136",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن إسماعيل، عن محمد بن سعد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ يعني تسعة وعشرين ‏.‏ رواه يحيى بن سعيد وغيره عن إسماعيل عن محمد بن سعد عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Muhammad bin Sad that his father said:                     \"The Messenger of Allah said: \"The month is like this and like this and like this,\"' meaning twenty-nine. Yahya bin Saeed and others narrated it from Ismail, from Muhammad bin Sad, from the Prophet.",
      "chain": [
        "38265",
        "20025",
        "11418",
        "30008"
      ]
    },
    {
      "hadith_no": "2137",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا إسماعيل، عن محمد بن سعد بن أبي وقاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وصفق محمد بن عبيد بيديه ينعتها ثلاثا ثم قبض في الثالثة الإبهام في اليسرى ‏.‏ قال يحيى بن سعيد قلت لإسماعيل عن أبيه قال لا ‏.‏",
      "text_en": " It was narrated that Muhammad bin Sad bin Abi Waqqas said:                     \"The Messenger of Allah said: 'The month is like this and like this and like this.\" (One of the narrators) Muhammad bin 'Ubaid clapped his hands three time to demonstrate it, then he withheld his left thumb the third time. Yahya bin Saeed said to Ismail (One of the narrators): \"Form his father?' He said: \"No.\"",
      "chain": [
        "38022",
        "30213",
        "11418",
        "30008"
      ]
    },
    {
      "hadith_no": "3635",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا حجاج بن المنهال، قال حدثنا همام، عن قتادة، عن يونس بن جبير، عن محمد بن سعد، عن أبيه، سعد بن مالك أن النبي صلى الله عليه وسلم جاءه وهو مريض فقال إنه ليس لي ولد إلا ابنة واحدة فأوصي بمالي كله قال النبي صلى الله عليه وسلم ‏\"‏ لا ‏\"‏‏.‏ قال فأوصي بنصفه قال النبي صلى الله عليه وسلم ‏\"‏ لا ‏\"‏‏.‏ قال فأوصي بثلثه قال ‏\"‏ الثلث والثلث كثير ‏\"‏‏.‏",
      "text_en": " It was narrated from Muhammad bin Sa'd, from his father Sa'd bin Malik, that the Prophet came to him when he was sick and he said:                      \"I do not have any children apart from one daughter. Shall I bequeath all my wealth?\" The Prophet said: \"No.\" He said: \"Shall I bequeath half of it?\" The Prophet said: \"No.\" He said: \"Shall I bequeath one-third of it?\" He said: \"One-third, and one-third is much or large.\"",
      "chain": [
        "30170",
        "20219",
        "20297",
        "11019",
        "11320",
        "30008"
      ]
    },
    {
      "hadith_no": "1726",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، عن إسماعيل بن أبي خالد، عن محمد بن سعد بن أبي وقاص، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وعقد تسعا وعشرين في الثالثة ‏.‏",
      "text_en": " It wasnarrated from Muhammad bin Sa’d bin Abu Waqqas that his fathersaid:                      “The Messenger of Allah (ﷺ) said: ‘The month is like thatandlike that and like that,’ and he showed nine fingers on thethird timeto indicate twenty-nine.”",
      "chain": [
        "30212",
        "20352",
        "11418",
        "30008"
      ]
    },
    {
      "hadith_no": "3760",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، قالا حدثنا شعبة، حدثني قتادة، عن يونس بن جبير، عن محمد بن سعد بن أبي وقاص، عن سعد بن أبي وقاص، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لأن يمتلئ جوف أحدكم قيحا حتى يريه خير له من أن يمتلئ شعرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sad bin Abu Waqas that the Prophet(ﷺ) said:                     \"If a man were to fill his stomach completely with pus until it destroyed him, that would be better for him than filling (his mind) with poetry.\"",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20020",
        "11019",
        "11320",
        "30008",
        "9"
      ]
    },
    {
      "hadith_no": "4076",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شريك، عن أبي إسحاق، عن محمد بن سعد، عن سعد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa’d that the Messenger of Allah (ﷺ) said:                     “Verbally abusing a Muslim is Fusuq (disobedience) and fightinghimis Kufr.”",
      "chain": [
        "38409",
        "20032",
        "20587",
        "11049",
        "30008",
        "9"
      ]
    }
  ],
  "total_hadiths": 18
}