{
  "id": "30007",
  "name": "Ahmad bin Hanbal أحمد بن حنبل",
  "full_name": "Ahmad bin Hanbal أحمد بن حنبل",
  "grade": "3rd Century AH [10th generation] [Hanbali]",
  "biography": {
    "birth": {
      "date_hijri": "164",
      "date_gregorian": "780",
      "date_display": [
        "164 AH",
        "780 CE"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "855",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad",
      "Syria",
      "Hijaz"
    ],
    "area_of_interest": [
      "Fiqh",
      "Hadith",
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]",
      "Tafsir/Quran",
      "Aqeedah"
    ],
    "tags": [
      "Imam",
      "Hafiz",
      "al-Shaybani",
      "al-Murwazi",
      "Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "38291",
      "name": "'Abdullah bin Ahmed bin Hanbal عبد الله بن أحمد بن محمد بن حنبل",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20448",
      "name": "'Ali bin 'Ayyash علي بن عياش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30504",
      "name": "Da'ud bin 'Amr bin Zuhayr داود بن عمرو الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30503",
      "name": "Khlf bin Hisham bin Th'lb خلف بن هشام بن ثعلب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38032",
      "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38181",
      "name": "al-Husain bin Mnswr bin Ja'far الحسين بن منصور بن جعفر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36664",
      "name": "Muhammad bin Yahya bin Abi Samina محمد بن يحيى بن أبي سمينة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38291",
      "name": "'Abdullah bin Ahmed bin Hanbal عبد الله بن أحمد بن محمد بن حنبل",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "25264",
      "name": "Muhammad bin Ziyad al-Yshkry محمد بن زياد اليشكري الطحان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "471",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرني يونس بن يزيد، عن ابن شهاب، حدثني عبد الله بن كعب بن مالك، أن كعب بن مالك، أخبره أنه، تقاضى ابن أبي حدرد دينا له عليه، في عهد رسول الله صلى الله عليه وسلم في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما رسول الله صلى الله عليه وسلم حتى كشف سجف حجرته ونادى ‏\"‏ يا كعب بن مالك، يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ فأشار بيده أن ضع الشطر من دينك‏.‏ قال كعب قد فعلت يا رسول الله‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     During the lifetime of Allah's Apostle I asked Ibn Abi Hadrad in the mosque to pay the debts which he owed to me and our voices grew so loud that Allah's Apostle heard them while he was in his house. So he came to us after raising the curtain of his room. The Prophet said, \"O Ka`b bin Malik!\" I replied, \"Labaik, O Allah's Apostle.\" He gestured with his hand to me to reduce the debt to one half. I said, \"O Allah's Apostle have done it.\" Allah's Apostle said (to Ibn Hadrad), \"Get up and pay it.\"",
      "chain": [
        "30007",
        "20029",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "698",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال نمت عند ميمونة والنبي صلى الله عليه وسلم عندها تلك الليلة، فتوضأ ثم قام يصلي، فقمت على يساره، فأخذني فجعلني عن يمينه، فصلى ثلاث عشرة ركعة، ثم نام حتى نفخ  وكان إذا نام نفخ  ثم أتاه المؤذن، فخرج فصلى ولم يتوضأ‏.‏ قال عمرو فحدثت به بكيرا فقال حدثني كريب بذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of (my aunt) Maimuna and the Prophet was there on that night. He performed ablution and stood up for the prayer. I joined him and stood on his left side but he drew me to his right and prayed thirteen rak`at and then slept till I heard his breath sounds. And whenever he slept, he used to breathe with audible sounds. The Mu'adh-dhin came to the Prophet and he went out and prayed the morning prayer) without repeating the ablution.",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "902",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر بن الزبير، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان الناس ينتابون يوم الجمعة من منازلهم والعوالي، فيأتون في الغبار، يصيبهم الغبار والعرق، فيخرج منهم العرق، فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي، فقال النبي صلى الله عليه وسلم ‏\"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) The people used to come from their abodes and from Al-`Awali (i.e. outskirts of Medina up to a distance of four miles or more from Medina). They used to pass through dust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. One of them came to Allah's Apostle who was in my house. The Prophet said to him, \"I wish that you keep yourself clean on this day of yours (i.e. take a bath).\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511"
      ]
    },
    {
      "hadith_no": "1261",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، أن أيوب، أخبره قال سمعت ابن سيرين، يقول جاءت أم عطية  رضى الله عنها  امرأة من الأنصار من اللاتي بايعن، قدمت البصرة، تبادر ابنا لها فلم تدركه  فحدثتنا قالت دخل علينا النبي صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا ألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ ولم يزد على ذلك، ولا أدري أى بناته‏.‏ وزعم أن الإشعار الففنها فيه، وكذلك كان ابن سيرين يأمر بالمرأة أن تشعر ولا تؤزر‏.‏",
      "text_en": " Narrated Ibn Seereen:                     Um 'Atiyya (an Ansari woman who gave the pledge of allegiance to the Prophet ) came to Basra to visit her son, but she could not find him. She narrated to us, \"The Prophet came to us while we were giving bath to his (dead) daughter, he said: 'Wash her three times, five times or more, if you think it necessary, with water and Sidr, and last of all put camphor, and when you finish, notify me.' \" Um 'Atiyya added, \"After finishing, we informed him and he gave us his waist sheet and told us to shroud her in it and did not say more than that.\"",
      "chain": [
        "30007",
        "20029",
        "11070",
        "11015",
        "11035"
      ]
    },
    {
      "hadith_no": "1604",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عام الفتح من كداء أعلى مكة‏.‏ قال هشام وكان عروة يدخل على كلتيهما من كداء وكدا، وأكثر ما يدخل من كداء، وكانت أقربهما إلى منزله‏.‏",
      "text_en": " Narrated `Aisha:                     In the year of the conquest of Mecca, the Prophet entered Mecca from Kada' at the higher place of Mecca. (Hisham, a sub-narrator said, \" `Urwa used to enter (Mecca) from both Kada' and Kuda and he often entered through Kada' which was nearer to his dwelling place.)\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1618",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا أبي، حدثنا إبراهيم، عن الحجاج بن حجاج، عن قتادة، عن عبد الله بن أبي عتبة، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليحجن البيت وليعتمرن بعد خروج يأجوج ومأجوج ‏\"‏‏.‏ تابعه أبان وعمران عن قتادة‏.‏ وقال عبد الرحمن عن شعبة قال ‏\"‏ لا تقوم الساعة حتى لا يحج البيت ‏\"‏‏.‏ والأول أكثر، سمع قتادة عبد الله وعبد الله أبا سعيد‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said \"The people will continue performing the Hajj and `Umra to the Ka`ba even after the appearance of Gog and Magog.\" Narrated Shu`ba extra: The Hour (Day of Judgment) will not be established till the Hajj (to the Ka`ba) is abandoned.",
      "chain": [
        "30007",
        "11051",
        "11019",
        "11598",
        "38"
      ]
    },
    {
      "hadith_no": "3226",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن بكير بن الأشج، حدثه أن بسر بن سعيد حدثه أن زيد بن خالد الجهني  رضى الله عنه  حدثه ومع، بسر بن سعيد عبيد الله الخولاني الذي كان في حجر ميمونة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حدثهما زيد بن خالد أن أبا طلحة حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ‏\"‏‏.‏ قال بسر فمرض زيد بن خالد، فعدناه فإذا نحن في بيته بستر فيه تصاوير، فقلت لعبيد الله الخولاني ألم يحدثنا في التصاوير فقال إنه قال ‏\"‏ إلا رقم في ثوب ‏\"‏‏.‏ ألا سمعته قلت لا‏.‏ قال بلى قد ذكره‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     That Zaid bin Khalid Al-Juhani narrated to him something in the presence of Sa`id bin 'Ubaidullah Al- Khaulani who was brought up in the house of Maimuna the wife of the Prophet. Zaid narrated to them that Abu Talha said that the Prophet said, \"The Angels (of Mercy) do not enter a house wherein there is a picture.\" Busr said, \"Later on Zaid bin Khalid fell ill and we called on him. To our surprise we saw a curtain decorated with pictures in his house. I said to Ubaidullah Al-Khaulani, \"Didn't he (i.e. Zaid) tell us about the (prohibition of) pictures?\" He said, \"But he excepted the embroidery on garments. Didn't you hear him?\" I said, \"No.\" He said, \"Yes, he did.\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "4260",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الغفار بن داود، حدثنا يعقوب بن عبد الرحمن، ح وحدثني أحمد، حدثنا ابن وهب، قال أخبرني يعقوب بن عبد الرحمن الزهري، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  قال قدمنا خيبر، فلما فتح الله عليه الحصن ذكر له جمال صفية بنت حيى بن أخطب، وقد قتل زوجها وكانت عروسا، فاصطفاها النبي صلى الله عليه وسلم لنفسه، فخرج بها، حتى بلغنا سد الصهباء حلت، فبنى بها رسول الله صلى الله عليه وسلم، ثم صنع حيسا في نطع صغير، ثم قال لي ‏\"‏ آذن من حولك ‏\"‏‏.‏ فكانت تلك وليمته على صفية، ثم خرجنا إلى المدينة، فرأيت النبي صلى الله عليه وسلم يحوي لها وراءه بعباءة، ثم يجلس عند بعيره، فيضع ركبته، وتضع صفية رجلها على ركبته حتى تركب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We arrived at Khaibar, and when Allah helped His Apostle to open the fort, the beauty of Safiya bint Huyai bin Akhtaq whose husband had been killed while she was a bride, was mentioned to Allah's Apostle. The Prophet selected her for himself, and set out with her, and when we reached a place called Sidd-as-Sahba,' Safiya became clean from her menses then Allah's Apostle married her. Hais (i.e. an 'Arabian dish) was prepared on a small leather mat. Then the Prophet said to me, \"I invite the people around you.\" So that was the marriage banquet of the Prophet and Safiya. Then we proceeded towards Medina, and I saw the Prophet, making for her a kind of cushion with his cloak behind him (on his camel). He then sat beside his camel and put his knee for Safiya to put her foot on, in order to ride (on the camel).",
      "chain": [
        "30235",
        "20185",
        "30007",
        "20029",
        "11209",
        "19"
      ]
    },
    {
      "hadith_no": "4305",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، عن عمرو، عن ابن أبي هلال، قال وأخبرني نافع، أن ابن عمر، أخبره أنه، وقف على جعفر يومئذ وهو قتيل، فعددت به خمسين بين طعنة وضربة، ليس منها شىء في دبره‏.‏ يعني في ظهره‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar informed me that on the day (of Mu'tah) he stood beside Ja`far who was dead (i.e. killed in the battle), and he counted fifty wounds in his body, caused by stabs or strokes, and none of those wounds was in his back. `Abdullah bin `Umar said, \"Allah's Apostle appointed Zaid bin Haritha as the commander of the army during the Ghazwa of Mu'tah and said, \"If Zaid is martyred, Ja`far should take over his position, and if Ja`far is martyred, `Abdullah bin Rawaha should take over his position.' \" `Abdulla-h bin `Umar further said, \"I was present amongst them in that battle and we searched for Ja`far bin Abi Talib and found his body amongst the bodies of the martyred ones, and found over ninety wounds over his body, caused by stabs or shots (of arrows).",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4513",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن الحسن، حدثنا أحمد بن محمد بن حنبل بن هلال، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة‏.‏",
      "text_en": " Narrated Buraida:                     That he fought sixteen Ghazawat with Allah''s Apostle.",
      "chain": [
        "30292",
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4694",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني أحمد، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الحميد  هو ابن كرديد صاحب الزيادي  سمع أنس بن مالك  رضى الله عنه  قال أبو جهل ‏{‏اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم‏}‏ فنزلت ‏{‏وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You, then rain down on us a shower of stones from the sky or bring on us a painful torment.\" So Allah revealed:-- \"But Allah would not punish them while you were amongst them, nor He will punish them while they seek (Allah's) forgiveness...\" (8.33) And why Allah should not punish them while they turn away (men) from Al- Masjid-al-Haram (the Sacred Mosque of Mecca)...\" (8.33-34)",
      "chain": [
        "30007",
        "30150",
        "20286",
        "20020",
        "19"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثني ابن وهب، قال أخبرني يونس، قال أحمد حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن كعب، قال أخبرني عبد الله بن كعب  وكان قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أن أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك بعض مالك، فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik talking about the Verse:-- 'And to the three (He also forgave) who remained behind.' (9.118) saying in the last portion of his talk, \"(I said), 'As a part (sign) of my repentance, I would like to give up all my property in the cause of Allah and His Apostle,' The Prophet said to me, 'Keep some of your wealth as it is good for you.\" (To the three (He also forgave) who remained behind till for them the earth, vast as it is, was straitened...\" (9.118)",
      "chain": [
        "30226",
        "20029",
        "20475",
        "30007",
        "11716",
        "20475",
        "11013",
        "1134",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4877",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت ما رأيت رسول الله صلى الله عليه وسلم ضاحكا حتى أرى منه لهواته، إنما كان يتبسم‏.‏         قالت وكان إذا رأى غيما أو ريحا عرف في وجهه‏.‏ قالت يا رسول الله إن الناس إذا رأوا الغيم فرحوا، رجاء أن يكون فيه المطر، وأراك إذا رأيته عرف في وجهك الكراهية‏.‏ فقال ‏\"‏ يا عائشة ما يؤمني أن يكون فيه عذاب عذب قوم بالريح، وقد رأى قوم العذاب فقالوا ‏{‏هذا عارض ممطرنا‏}‏‏\"‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet), I never saw Allah's Apostle laughing loudly enough to enable me to see his uvula, but he used to smile only. And whenever he saw clouds or winds, signs of deep concern would appear on his face. I said, \"O Allah's Apostle! When people see clouds they usually feel happy, hoping that it would rain, while I see that when you see clouds, one could notice signs of dissatisfaction on your face.\" He said, \"O `Aisha! What is the guarantee for me that there will be no punishment in it, since some people were punished with a wind? Verily, some people saw (received) the punishment, but (while seeing the cloud) they said, 'This cloud will give us rain.' \"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "20390",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "5161",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال لنا أحمد بن حنبل حدثنا يحيى بن سعيد، عن سفيان، حدثني حبيب، عن سعيد، عن ابن عباس، حرم من النسب سبع، ومن الصهر سبع‏.‏ ثم قرأ ‏{‏حرمت عليكم أمهاتكم‏}‏ الآية‏.‏ وجمع عبد الله بن جعفر بين ابنة علي وامرأة علي‏.‏ وقال ابن سيرين لا بأس به‏.‏ وكرهه الحسن مرة ثم قال لا بأس به‏.‏ وجمع الحسن بن الحسن بن علي بين ابنتى عم في ليلة، وكرهه جابر بن زيد للقطيعة، وليس فيه تحريم لقوله تعالى ‏{‏وأحل لكم ما وراء ذلكم‏}‏ وقال عكرمة عن ابن عباس إذا زنى بأخت امرأته لم تحرم عليه امرأته‏.‏ ويروى عن يحيى الكندي عن الشعبي وأبي جعفر، فيمن يلعب بالصبي إن أدخله فيه، فلا يتزوجن أمه، ويحيى هذا غير معروف، لم يتابع عليه‏.‏ وقال عكرمة عن ابن عباس إذا زنى بها لم تحرم عليه امرأته‏.‏ ويذكر عن أبي نصر أن ابن عباس حرمه‏.‏ وأبو نصر هذا لم يعرف بسماعه من ابن عباس‏.‏ ويروى عن عمران بن حصين وجابر بن زيد والحسن وبعض أهل العراق تحرم عليه‏.‏ وقال أبو هريرة لا تحرم حتى يلزق بالأرض يعني يجامع‏.‏ وجوزه ابن المسيب وعروة والزهري‏.‏ وقال الزهري قال علي لا تحرم‏.‏ وهذا مرسل‏.‏",
      "text_en": "",
      "chain": [
        "30007",
        "20031",
        "20012",
        "11276",
        "11168"
      ]
    },
    {
      "hadith_no": "7509",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد، حدثنا محمد بن أبي بكر المقدمي، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال جاء زيد بن حارثة يشكو فجعل النبي صلى الله عليه وسلم يقول ‏\"‏ اتق الله، وأمسك عليك زوجك ‏\"‏‏.‏ قالت عائشة لو كان رسول الله صلى الله عليه وسلم كاتما شيئا لكتم هذه‏.‏ قال فكانت زينب تفخر على أزواج النبي صلى الله عليه وسلم تقول زوجكن أهاليكن، وزوجني الله تعالى من فوق سبع سموات‏.‏ وعن ثابت ‏{‏وتخفي في نفسك ما الله مبديه وتخشى الناس‏}‏ نزلت في شأن زينب وزيد بن حارثة‏.‏",
      "text_en": " Narrated Anas:                     Zaid bin Haritha came to the Prophet complaining about his wife. The Prophet kept on saying (to him), \"Be afraid of Allah and keep your wife.\" Aisha said, \"If Allah's Apostle were to conceal anything (of the Qur'an he would have concealed this Verse.\" Zainab used to boast before the wives of the Prophet and used to say, \"You were given in marriage by your families, while I was married (to the Prophet) by Allah from over seven Heavens.\" And Thabit recited, \"The Verse:-- 'But (O Muhammad) you did hide in your heart that which Allah was about to make manifest, you did fear the people,' (33.37) was revealed in connection with Zainab and Zaid bin Haritha.\"",
      "chain": [
        "30007",
        "30161",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو الطاهر، وحرملة بن يحيى، وأحمد بن عيسى، قال أحمد حدثنا وقال الآخران، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah said:                      I have been commanded to fight against people so long as they do not declare that there is no god but Allah, and he who professed it was guaranteed the protection of his property and life on my behalf except for the right affairs rest with Allah.",
      "chain": [
        "30487",
        "30227",
        "30007",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، وسريج بن يونس، قالا حدثنا هشيم، أخبرنا داود بن أبي هند، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بوادي الأزرق فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ فقالوا هذا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى - عليه السلام - هابطا من الثنية وله جؤار إلى الله بالتلبية ‏\"‏ ‏.‏ ثم أتى على ثنية هرشى ‏.‏ فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى قال ‏\"‏ كأني أنظر إلى يونس بن متى - عليه السلام - على ناقة حمراء جعدة عليه جبة من صوف خطام ناقته خلبة وهو يلبي ‏\"‏ ‏.‏ قال ابن حنبل في حديثه قال هشيم يعني ليفا ‏.‏",
      "text_en": " Abu al-'Aliya narrated it on the authority of Ibn 'Abbas that the Messenger of Allah (may peace be upon him) passed through the valley of Azraq, and he asked:                      Which valley is this? They said: This is the valley of Azraq, and he observed: (I perceive) as if I am seeing Moses (peace be upon him) coming down from the mountain track, and he is calling upon Allah loudly (saying: Here I am! at your service! ). Then he came to the mountain track of Harsha. He (the Holy Prophet) said: Which is this mountain track? They said: It is the mountain track of Harsha. He observed (I feel) as If I am seeing Yunus (Jonah-peace be upon him) son of Matta on a well- built red dromedary, with a cloak of wool around him and the rein of his dromedary is made of the fibres of date-palm, and he is calling upon Allah (saying: Here I am! at your service, my Lord! ). Ibn Hanbal said in the hadith narrated by him: Hushaim said that the meaning of khulba was fibre of date-palm.",
      "chain": [
        "30007",
        "30251",
        "20468",
        "11585",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "541",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس، عن عمرو بن العاص، قال سمعت رسول الله صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ ألا إن آل أبي - يعني فلانا - ليسوا لي بأولياء إنما وليي الله وصالح المؤمنين ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. 'As reported:                      I heard it from the Messenger of Allah (may peace be upon him) quite audibly and not secretly: Behold! the posterity of my fathers, that is, so and so, are not my friends. Verily Allah and the pious believers are my friends.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "hadith_no": "502",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا معتمر بن سليمان، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يعرض راحلته وهو يصلي إليها ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Apostle of Allah (may peace be upon him) used to place his camel (towards the Ka'ba) and said prayer in its direction.",
      "chain": [
        "30007",
        "20288",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، عن الحكم، عن مجاهد، عن أبي معمر، عن عبد الله، - قال شعبة - رفعه مرة - أن أميرا أو رجلا سلم تسليمتين فقال عبد الله أنى علقها",
      "text_en": " 'Abdullah reported:                      An Amir or a person pronounced taslim twice. 'Abdullah said: Where did he get this sunnah?",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11069",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن ورقاء، عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏ وحدثنيه محمد بن حاتم وابن رافع قالا حدثنا شبابة حدثني ورقاء بهذا الإسناد ‏.‏",
      "text_en": " Abu Huraira reported the Apostle of Allah (may peace be upon him) as saying:                      When the prayer commences then there is no prayer (valid), but the obligatory prayer. This hadith has been narrated by Warqa' with the same chain of transmitters.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "20363",
        "11081",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2880",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حرملة بن يحيى، وأحمد بن عيسى، قال أحمد حدثنا وقال، حرملة أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن عبيد الله بن عبد الله بن عمر، أخبره عن عبد الله بن عمر، - رضى الله عنهما - أنه قال بات رسول الله صلى الله عليه وسلم بذي الحليفة مبدأه وصلى في مسجدها ‏.‏",
      "text_en": " 'Abdullah b. 'Umar (Allah be pleased with them) reported that the Mes- senger of Allah (may peace be upon him) spent the night at Dhu'l-Hulaifa while com- mencing (the rites of) Pilgrimage and he observed prayer in the mosque.",
      "chain": [
        "30487",
        "30227",
        "30007",
        "30487",
        "20029",
        "20475",
        "11013",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "3155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن المثنى، قالا حدثنا عبد الله بن نمير، ح وحدثنا سعيد بن يحيى الأموي، حدثني أبي قالا، جميعا حدثنا يحيى بن سعيد، عن عبد الله بن، أبي سلمة عن عبد الله بن عبد الله بن عمر، عن أبيه، قال غدونا مع رسول الله صلى الله عليه وسلم من منى إلى عرفات منا الملبي ومنا المكبر ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them). He said:                      As we proceeded in the morning along with AUbs Messenger (may peace be upon him) from Mina to 'Arafat, some of us prounced Talbiya, and some pronounced Takbir (Allah-o-Akbar).",
      "chain": [
        "30007",
        "30170",
        "20331",
        "30254",
        "20367",
        "11062",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا محمد بن سلمة، عن أبي عبد الرحيم، عن زيد، بن أبي أنيسة عن يحيى بن الحصين، عن أم الحصين، جدته قالت حججت مع رسول الله صلى الله عليه وسلم حجة الوداع فرأيت أسامة وبلالا وأحدهما آخذ بخطام ناقة النبي صلى الله عليه وسلم والآخر رافع ثوبه يستره من الحر حتى رمى جمرة العقبة ‏.‏ قال مسلم واسم أبي عبد الرحيم خالد بن أبي يزيد وهو خال محمد بن سلمة روى عنه وكيع وحجاج الأعور ‏.‏",
      "text_en": " Umm al-Husain (Allah be pleased with her) reported:                      I performed Hajj along with Allah's Messenger (may peace be upon him) on the occasion of the Farewell Pilgrimage and saw Usama and Bilal (too), one of whom had caught hold of the lose string of the she-camel of Allah's Apostle (may peace be upon him) while the other one was raising his cloth (over his head) protecting him from the heat, till he flung pebbles at Jamrat al-'Aqaba.",
      "chain": [
        "30007",
        "20672",
        "11340",
        "19143"
      ]
    },
    {
      "hadith_no": "3287",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني أبو الطاهر، وحرملة بن يحيى، وأحمد بن عيسى، قال أحمد حدثنا وقال، الآخران أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، بهذا الإسناد قالت طمثت صفية بنت حيى زوج النبي صلى الله عليه وسلم في حجة الوداع بعد ما أفاضت طاهرا بمثل حديث الليث ‏.‏",
      "text_en": " This hadith is narrated (from 'A'isha) on the authority of Ibn Shihab with the same chain of transmitters (and the words are):                      Safiyyah bint Huyayy, the wife of Allah's Apostle (may peace be upon him), entered the period of menses at the occasion of the Farewell Pilgrimage after she had performed Tawaf Ifada in the state of cleanliness; the rest of the hadith is the same.",
      "chain": [
        "30487",
        "30227",
        "30007",
        "20029",
        "20475"
      ]
    },
    {
      "hadith_no": "4044",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، وزهير بن حرب، - واللفظ لزهير - قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم عامل أهل خيبر بشطر ما يخرج منها من ثمر أو زرع ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) contracted with the people of Khaibar the (trees) on the condition that he would have half the produce in fruits and harvest.",
      "chain": [
        "30007",
        "30022",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4470",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن المثنى، - واللفظ لأحمد - قالا حدثنا عبد الرحمن، بن مهدي عن سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قام فينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ والذي لا إله غيره لا يحل دم رجل مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا ثلاثة نفر التارك الإسلام المفارق للجماعة أو الجماعة - شك فيه أحمد - والثيب الزاني والنفس بالنفس ‏\"‏ ‏.‏ قال الأعمش فحدثت به، إبراهيم فحدثني عن الأسود، عن عائشة، بمثله ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      Allah's Messenger (may peace be upon him) stood up and said: By Him besides Whom there is no god but He, the blood of a Muslim who bears the testimony that there is no god but Allah, and I am His Messenger, may be lawfully shed only in case of three persons: the one who abandons Islam, and deserts the community [Ahmad, one of the narrators, is doubtful whether the Holy Prophet (may peace be upon him) used the word li'l-jama'ah or al-jama'ah), and the married adulterer, and life for life.",
      "chain": [
        "30007",
        "30170",
        "20033",
        "20012",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "4673",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن رافع، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما قرية أتيتموها وأقمتم فيها فسهمكم فيها وأيما قرية عصت الله ورسوله فإن خمسها لله ولرسوله ثم هي لكم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      If you come to a township (which has surrendered without a formal war) and stay therein, you have a share (that will be in the form of an award) in (the properties obtained from) it. If a township disobeys Allah and His Messenger (and actually fights against the Muslims) one-fifth of the booty seized therefrom is for Allah and His Apostle and the rest is for you.",
      "chain": [
        "30007",
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4799",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، أنه قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة ‏.‏",
      "text_en": " It has been narrated by Buraida who heard it from his father that he joined the Messenger of Allah (may peace be upon him) in sixteen military campaigns",
      "chain": [
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أحمد بن حنبل، حدثنا سليمان بن داود، حدثنا أبو عوانة، حدثنا الحكم، وأبو بشر عن ميمون بن مهران، عن ابن عباس، أن رسول الله صلى الله عليه وسلم نهى عن كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Messenger (may peace be upon him) forbade (the eating) of all the fanged beasts of prey, and of all the birds having talons.",
      "chain": [
        "30007",
        "30584",
        "20469",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5106",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن أبي بشر، ح وحدثنا أحمد بن حنبل، حدثنا هشيم، قال أبو بشر أخبرنا عن ميمون بن مهران، عن ابن عباس، قال نهى ح",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Abbas through a different chain of transmitters.",
      "chain": [
        "30399",
        "20468",
        "11419",
        "30007",
        "20468",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5566",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني سريج بن يونس، حدثنا يحيى بن زكرياء بن أبي زائدة، عن أبيه، حوحدثني إبراهيم بن موسى، حدثنا ابن أبي زائدة، ح وحدثنا أحمد بن حنبل، حدثنا يحيى،بن زكرياء أخبرني أبي، عن مصعب بن شيبة، عن صفية بنت شيبة، عن عائشة، قالت خرجالنبي صلى الله عليه وسلم ذات غداة وعليه مرط مرحل من شعر أسود ‏.‏",
      "text_en": " A'isha reported that Allah's Apostle (may peace be upon him) went out one morning wearing a blanket made of (camel's or sheep's) black hair with patterns of camel saddles upon it.",
      "chain": [
        "30251",
        "20366",
        "30007",
        "10658",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5600",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أحمد بن حنبل، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا إسماعيل، - يعنون ابن علية - عن عبد العزيز بن صهيب، عن أنس، عن النبي صلى اللهعليه وسلم بهذا ولم يذكر في الحديث محمد رسول الله ‏.‏",
      "text_en": " This hadith nas been reported on the authority of Anas through another chain of transmitters but there is no mention of the words (Mubamrnad, Messenger of Allah) in it.",
      "chain": [
        "30007",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5727",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن حنبل، وزهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، ومحمد بن بشار قالوا حدثنا يحيى بن سعيد، عن عبيد الله، أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم غير اسم عاصية وقال ‏\"‏ أنت جميلة ‏\"‏ ‏.‏ قال أحمد مكان أخبرني عن ‏.‏",
      "text_en": " Ibn 'Umar reported that Allah's Messenger (may peace be upon him) changed the name of 'Asiya (Disobedient) and said:                      You are Jamila (i. e. good and handsome). Ahmad (one of the narrators) narrated it with a slight variation of wording.",
      "chain": [
        "30007",
        "30022",
        "30170",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5734",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأحمد بن حنبل، وأبو بكر بن أبي شيبة - واللفظ لأحمد - قال الأشعثي أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أخنع اسم عند الله رجل تسمى ملك الأملاك ‏\"‏ ‏.‏ زاد ابن أبي شيبة في روايته ‏\"‏ لا مالك إلا الله عز وجل ‏\"‏ ‏.‏ قال الأشعثي قال سفيان مثل شاهان شاه ‏.‏ وقال أحمد بن حنبل سألت أبا عمرو عن أخنع فقال أوضع ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The vilest name in Allah's sight is Malik al-Amidh (King of Kings). The narration transmitted on the authority of Shaiba (contains these words): There is no king but Allah, the Exalted and Glorious. Sufyan said: Similarly, the word Shahinshah (is also the vilest appellation). Ahmad b. Hanbal said: I asked Abu 'Amr about the meaning of Akhna. He said: The vilest.",
      "chain": [
        "30465",
        "30007",
        "20005",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6021",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأبو طاهر وأحمد بن عيسى قال أحمد حدثنا  وقال الآخران، أخبرنا ابن وهب، أخبرني مخرمة، عن أبيه، عن نافع، قال كان ابن عمر إذا استجمر استجمر بالألوة غير مطراة وبكافور يطرحه مع الألوة ثم قال هكذا كان يستجمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' reported that when Ibn Umar wanted fumigation he got it from aloeswood without mixing anything with it, or he put camphor along with aloeswood and then said:                      This is how Allah's Messenger (may peace be upon him) fumigated.",
      "chain": [
        "30492",
        "30007",
        "20029",
        "11014"
      ]
    },
    {
      "hadith_no": "6153",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه أحمد بن حنبل، وزهير بن حرب، جميعا عن إسماعيل، - واللفظ لأحمد - قالا حدثنا إسماعيل بن إبراهيم، حدثنا عبد العزيز، عن أنس، قال لما قدم رسول الله صلى الله عليه وسلم المدينة أخذ أبو طلحة بيدي فانطلق بي إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أنسا غلام كيس فليخدمك ‏.‏ قال فخدمته في السفر والحضر والله ما قال لي لشىء صنعته لم صنعت هذا هكذا ولا لشىء لم أصنعه لم لم تصنع هذا هكذا",
      "text_en": " Anas reported:                      When Allah's Messenger (may peace be upon him) came to Medina, Abla Talha took hold of my hand and brought me to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, Anas is a prudent young boy, and he will serve you. He (Anas) said: I served him in journey and at home, but, by Allah, he never asked me about a thing which I did as to why I did so, nor about a thing which I did not do as to why I had not done that.",
      "chain": [
        "30007",
        "30022",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6409",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا سفيان بن عيينة، حدثني عبيد الله بن أبي يزيد، عن نافع بن جبير، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال لحسن ‏\"‏ اللهم إني أحبه فأحبه وأحبب من يحبه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying to Hasan:                      O Allah, behold, I love him. Thou too love him and love one who loves him.",
      "chain": [
        "30007",
        "20005",
        "11258",
        "11059",
        "13"
      ]
    },
    {
      "hadith_no": "6462",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن حنبل، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه  أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي رضى الله عنهما لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال له هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى تبلغ نفسي إن علي بن أبي طالب خطب بنت أبي جهل على فاطمة فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وإني أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فأوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " (Imam Zain-ul-'Abidin) 'Ali b. Husain reported that when they came to Medina from Yazid b. Mu'awiya after the martyrdom of Husain b. 'Ali (Allah be pleased with him) Miswar b. Makhramah met him and said to him:                      Is there any work for me which you ask me to do? I said to him: No. He again said to me: Would you not give me the sword of Allah's Messenger (may peace be upon him) for I fear that the people may snatch it from you? By Allah, if you give that to me, no one would be able to take it away, so long as there is life in me. Verily 'Ali b. Abi Talib sent a proposal of marriage to the daughter of Abu Jahl in spite of (the fact that his wife) Fatima (had been living in his house). Thereupon I heard Allah's Messenger (may peace be upon him) say while addressing the people on the pulpit. I was adolescing in those days. He said: Fatima is a part of me and I fear that she may be put to trial in regard to religion. He then made a mention of his son-in law who had been from the tribe of 'Abd Shams and praised his behaviour as a son-in-law and said: Whatever he said to me he told the truth and whatever he promised he fulfilled it for me. I am not going to declare forbidden what is lawful and make lawful what is forbidden, but, by Allah, the daaghter of Allah's Messenger and the daughter of the enemy of Allah can never be combined at one place.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "27",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، والحسن بن علي، قالا حدثنا عبد الرزاق، قال أحمد حدثنا معمر، أخبرني أشعث، وقال الحسن، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبولن أحدكم في مستحمه ثم يغتسل فيه ‏\"‏ ‏.‏ قال أحمد ‏\"‏ ثم يتوضأ فيه فإن عامة الوسواس منه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     The Messenger of Allah (ﷺ) said: No one of you should make water in his bath and then wash himself there (after urination). The version of Ahmad has: Then performs ablution there, for evil thoughts come from it.",
      "chain": [
        "30007",
        "30",
        "20121",
        "30007",
        "20115",
        "11324",
        "11016",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "38",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهانا رسول الله صلى الله عليه وسلم أن نتمسح بعظم أو بعر ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allaah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) forbade us to use a bone or dung for wiping.",
      "chain": [
        "30007",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "60",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقبل الله صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) said : Allaah, the Exalted, does not accept the prayer of any of you when you are defiled until you performed ablution.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "74",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، حدثنا أبو التياح، عن مطرف، عن ابن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم ولها ‏\"‏ ‏.‏ فرخص في كلب الصيد وفي كلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرار والثامنة عفروه بالتراب ‏\"‏ ‏.‏ قال أبو داود وهكذا قال ابن مغفل ‏.‏",
      "text_en": " Narrated Ibn Mughaffal:                     The Messenger of Allaah (sal Allaahu alayhi wa sallam) ordered the killing of the dogs, and then said: Why are they (people) after them (dogs)? and then granted permission (to keep) for hunting  and for (the security) of the herd, and said : When the dog licks the utensil wash it seven times, and rub it with earth the eighth time.Abu Dawud said : Ibn Mughaffal narrated in a similar way.",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، ومسدد، ومحمد بن عيسى، - المعنى - قالوا حدثنا يحيى بن سعيد، عن أبي حزرة، حدثنا عبد الله بن محمد، - قال ابن عيسى في حديثه ابن أبي بكر ثم اتفقوا أخو القاسم بن محمد - قال كنا عند عائشة فجيء بطعامها فقام القاسم يصلي فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يصلى بحضرة الطعام ولا وهو يدافعه الأخبثان ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd Allaah b. Muhammad:                     We were in the company of 'Aishah. When her food was brought in, al-Qasim stood up to say his prayer. Thereupon , 'Aishah said : I heard the Messenger of Allaah (sal Allaahu alayhi wa sallam) say: Prayer should not be offered in presence of meals, nor at the moment  when one is struggling with two evils (e.g. when one is feeling the call of nature.)",
      "chain": [
        "30007",
        "30175",
        "31167",
        "11062",
        "30351"
      ]
    },
    {
      "hadith_no": "93",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا هشيم، أخبرنا يزيد بن أبي زياد، عن سالم بن أبي الجعد، عن جابر، قال كان رسول الله صلى الله عليه وسلم يغتسل بالصاع ويتوضأ بالمد ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) used to take a bath with a sa' (of water) and perform ablution with a mudd (of water)",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "121",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا أبو المغيرة، حدثنا حريز، حدثني عبد الرحمن بن ميسرة الحضرمي، سمعت المقدام بن معديكرب الكندي، قال أتي رسول الله صلى الله عليه وسلم بوضوء فتوضأ فغسل كفيه ثلاثا ثم تمضمض واستنشق ثلاثا وغسل وجهه ثلاثا ثم غسل ذراعيه ثلاثا ثلاثا ثم مسح برأسه وأذنيه ظاهرهما وباطنهما ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib al-Kindi:                     The ablution water was brought to the Messenger (ﷺ) and he performed ablution; he washed his hands up to wrists three times, then washed his forearms three times.  He then rinsed his mouth and snuffed up water three times; then he wiped his head and ears inside and outside.",
      "chain": [
        "30007",
        "20442",
        "18651"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن ثور، عن راشد بن سعد، عن ثوبان، قال بعث رسول الله صلى الله عليه وسلم سرية فأصابهم البرد فلما قدموا على رسول الله صلى الله عليه وسلم أمرهم أن يمسحوا على العصائب والتساخين ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) sent out an expedition. They were affected by cold. When they returned to the Messenger of Allah (ﷺ), he commanded them to wipe over turbans and stockings.",
      "chain": [
        "30007",
        "20031",
        "11155",
        "19909",
        "130"
      ]
    },
    {
      "hadith_no": "199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الرزاق، حدثنا ابن جريج، أخبرني نافع، حدثني عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم شغل عنها ليلة فأخرها حتى رقدنا في المسجد ثم استيقظنا ثم رقدنا ثم استيقظنا ثم رقدنا ثم خرج علينا فقال ‏\"‏ ليس أحد ينتظر الصلاة غيركم ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Umar said:                      One night the Messenger of Allah (May peace be upon him) was busy and he delayed the night (isha) prayer so much so that we dosed in the mosque. We awoke, then dozed, and again awoke and again dozed. He (the prophet) then came upon us and said: There is none except you who is waiting for prayer.",
      "chain": [
        "30007",
        "20121",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، ح حدثنا أحمد بن حنبل، حدثنا إسماعيل بن إبراهيم، قالا حدثنا برد بن سنان، عن عبادة بن نسى، عن غضيف بن الحارث، قال قلت لعائشة أرأيت رسول الله صلى الله عليه وسلم كان يغتسل من الجنابة في أول الليل أو في آخره قالت ربما اغتسل في أول الليل وربما اغتسل في آخره ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏ قلت أرأيت رسول الله صلى الله عليه وسلم كان يوتر أول الليل أم في آخره قالت ربما أوتر في أول الليل وربما أوتر في آخره ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏ قلت أرأيت رسول الله صلى الله عليه وسلم كان يجهر بالقرآن أم يخفت به قالت ربما جهر به وربما خفت ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Ghudayf ibn al-Harith reported: I asked Aisha: Have you seen the Messenger of Allah (ﷺ) washing (because of defilement) at the beginning of the night or at the end?  She replied: Sometimes he would take a bath at the beginning of the night and sometimes at the end.  Thereupon I exclaimed: Allah is most Great. All Praise be to Allah Who made this matter accommodative.  I again asked her: What do you think, did the Messenger of Allah (ﷺ) say the witr prayer (additional prayer after obligatory prayer at night) in the beginning of the night or at the end?  She replied: Sometimes he would say the witr prayer at the beginning of the night and sometimes at the end.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter accommodative.  Again I asked her: What do you think, did the Messenger of Allah (ﷺ) recite the Qur'an (in the prayer) loudly or softly?  She replied: Sometimes he would recite loudly and sometimes softly.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter flexible.",
      "chain": [
        "30175",
        "20288",
        "30007",
        "20208",
        "19839"
      ]
    },
    {
      "hadith_no": "302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الله بن نمير، عن محمد بن أبي إسماعيل، - وهو محمد بن راشد - عن معقل الخثعمي، عن علي، - رضى الله عنه - قال المستحاضة إذا انقضى حيضها اغتسلت كل يوم واتخذت صوفة فيها سمن أو زيت ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The woman who has a prolonged flow of blood should wash herself every day when her  menstrual period is over and take a woollen cloth greased with fat or oil (to tie over the private parts).",
      "chain": [
        "30007",
        "20331",
        "19021",
        "5"
      ]
    }
  ],
  "total_hadiths": 281
}