{
  "id": "30021",
  "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
  "full_name": "Ishaq bin Rahwaya إسحاق بن راهويه",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "161",
      "date_gregorian": "NA",
      "date_display": [
        "161 AH"
      ],
      "place": "Merv"
    },
    "death": {
      "date_hijri": "238",
      "date_gregorian": "852",
      "date_display": null,
      "place": "Nisapur",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv",
      " Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  ت  س  -  ثقة حافظ ]",
      "Hadith",
      "Fiqh"
    ],
    "tags": [
      "al-Hanzali",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20446",
      "name": "'Atab bin Bashayr عتاب بن بشير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20239",
      "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38481",
      "name": "Muhammad bin Aflah al-Tark محمد بن أفلح بن عبد الملك - الترك",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "135",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، قال أخبرنا عبد الرزاق، قال أخبرنا معمر، عن همام بن منبه، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقبل صلاة من أحدث حتى يتوضأ ‏\"‏‏.‏ قال رجل من حضرموت ما الحدث يا أبا هريرة قال فساء أو ضراط‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not accepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is 'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "613",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن راهويه، قال حدثنا وهب بن جرير، قال حدثنا هشام، عن يحيى، نحوه‏.‏ قال يحيى وحدثني بعض، إخواننا أنه قال لما قال حى على الصلاة‏.‏ قال لا حول ولا قوة إلا بالله‏.‏ وقال هكذا سمعنا نبيكم صلى الله عليه وسلم يقول‏.‏",
      "text_en": " Narrated Yahya as above (586) and added:                     \"Some of my companions told me that Hisham had said, \"When the Mu'adh-dhin said, \"Haiyi `alassala (come for the prayer).\" Muawiya said, \"La hawla wala quwata illa billah (There is neither might nor any power except with Allah)\" and added, \"We heard your Prophet saying the same.\"",
      "chain": [
        "30021",
        "20298",
        "20295",
        "11449"
      ]
    },
    {
      "hadith_no": "623",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا أبو أسامة، قال عبيد الله حدثنا عن القاسم بن محمد، عن عائشة،‏.‏ وعن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال‏.‏ حوحدثني يوسف بن عيسى المروزي، قال حدثنا الفضل، قال حدثنا عبيد الله بن عمر، عن القاسم بن محمد، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن بلالا يؤذن بليل، فكلوا واشربوا حتى يؤذن ابن أم مكتوم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Bilal pronounces the Adhan at night, so eat and drink (Suhur) till Ibn Um Maktum pronounces the Adhan.\"",
      "chain": [
        "30021",
        "20318",
        "11201",
        "10535",
        "53",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "633",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا جعفر بن عون، قال حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم بالأبطح فجاءه بلال فآذنه بالصلاة، ثم خرج بلال بالعنزة حتى ركزها بين يدى رسول الله صلى الله عليه وسلم بالأبطح وأقام الصلاة‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     My father said, \"I saw Allah's Apostle at a place called Al-Abtah. Bilal came and informed him about the prayer and then came out with a short spear (or stick) and planted it in front of Allah's Apostle at Al-Abtah and pronounced the Iqama.\"",
      "chain": [
        "30021",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1045",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يحيى بن صالح، قال حدثنا معاوية بن سلام بن أبي سلام الحبشي الدمشقي، قال حدثنا يحيى بن أبي كثير، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف الزهري، عن عبد الله بن عمرو  رضى الله عنهما  قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     \"When the sun eclipsed in the lifetime of Allah's Apostle an announcement was made that a prayer was to be offered in congregation.\"",
      "chain": [
        "30021",
        "20470",
        "20401",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1086",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، قال قلت لأبي أسامة حدثكم عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تسافر المرأة ثلاثة أيام إلا مع ذي محرم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"A woman should not travel for more than three days except with a Dhi-Mahram (i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own husband.)\"",
      "chain": [
        "30021",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1110",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، حدثنا حرب، حدثنا يحيى، قال حدثني حفص بن عبيد الله بن أنس، أن أنسا  رضى الله عنه  حدثه أن رسول الله صلى الله عليه وسلم كان يجمع بين هاتين الصلاتين في السفر‏.‏ يعني المغرب والعشاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet started a journey before noon, he used to delay the Zuhr prayer till the time of `Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer and then ride (for the journey).",
      "chain": [
        "30021",
        "20250",
        "20220",
        "11449",
        "11686",
        "19"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، قال حدثني أبي، عن صالح، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبيه، أنه أخبره أنه، لما حضرت أبا طالب الوفاة جاءه رسول الله صلى الله عليه وسلم فوجد عنده أبا جهل بن هشام، وعبد الله بن أبي أمية بن المغيرة، قال رسول الله صلى الله عليه وسلم لأبي طالب ‏\"‏ يا عم، قل لا إله إلا الله، كلمة أشهد لك بها عند الله ‏\"‏‏.‏ فقال أبو جهل وعبد الله بن أبي أمية يا أبا طالب، أترغب عن ملة عبد المطلب فلم يزل رسول الله صلى الله عليه وسلم يعرضها عليه، ويعودان بتلك المقالة، حتى قال أبو طالب آخر ما كلمهم هو على ملة عبد المطلب، وأبى أن يقول لا إله إلا الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والله لأستغفرن لك، ما لم أنه عنك ‏\"‏‏.‏ فأنزل الله تعالى فيه ‏{‏ما كان للنبي‏}‏ الآية‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab from his father:                     When the time of the death of Abu Talib approached, Allah's Apostle went to him and found Abu Jahl bin Hisham and `Abdullah bin Abi Umaiya bin Al-Mughira by his side. Allah's Apostle said to Abu Talib, \"O uncle! Say: None has the right to be worshipped but Allah, a sentence with which I shall be a witness (i.e. argue) for you before Allah. Abu Jahl and `Abdullah bin Abi Umaiya said, \"O Abu Talib! Are you going to denounce the religion of `Abdul Muttalib?\" Allah's Apostle kept on inviting Abu Talib to say it (i.e. 'None has the right to be worshipped but Allah') while they (Abu Jahl and `Abdullah) kept on repeating their statement till Abu Talib said as his last statement that he was on the religion of `Abdul Muttalib and refused to say, 'None has the right to be worshipped but Allah.' (Then Allah's Apostle said, \"I will keep on asking Allah's forgiveness for you unless I am forbidden (by Allah) to do so.\" So Allah revealed (the verse) concerning him (i.e. It is not fitting for the Prophet and those who believe that they should invoke (Allah) for forgiveness for pagans even though they be of kin, after it has become clear to them that they are companions of the fire (9.113).",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني عيسى بن طلحة بن عبيد الله، أنه سمع عبد الله بن عمرو بن العاص  رضى الله عنهما  قال وقف رسول الله صلى الله عليه وسلم على ناقته‏.‏ فذكر الحديث‏.‏ تابعه معمر عن الزهري‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle stopped while on his she-camel (the sub-narrator then narrated the Hadith as above, i.e. 793).",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "1888",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  قال أقبلت وقد ناهزت الحلم، أسير على أتان لي، ورسول الله صلى الله عليه وسلم قائم يصلي بمنى، حتى سرت بين يدى بعض الصف الأول، ثم نزلت عنها فرتعت، فصففت مع الناس وراء رسول الله صلى الله عليه وسلم‏.‏ وقال يونس عن ابن شهاب بمنى في حجة الوداع‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Apostle was praying at Mina. I passed in front of a part of the first row and then dismounted from it, and the animal started grazing. I aligned with the people behind Allah's Apostle (The sub-narrator added that happened in Mina during the Prophet's Hajjat-al-Wada`.)",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير بن حازم، أخبرنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية وكان لي على العاص بن وائل دراهم، فأتيته أتقاضاه فقال لا أقضيك حتى تكفر بمحمد، فقلت لا والله لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله ثم يبعثك‏.‏ قال فدعني حتى أموت ثم أبعث فأوتى مالا وولدا، ثم أقضيك‏.‏ فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ الآية‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith In the Pre-Islamic period of ignorance, and 'Asi bin Wail owed me some money. I went to him to demand it, but he said to me, \"I will not pay you unless you reject faith in Muhammad.\" I replied, \"By Allah, I will never disbelieve Muhammad till Allah let you die and then resurrect you.\" He said, \"Then wait till I die and come to life again, for then I will be given property and offspring and will pay your right.\" So, thus revelation came: \"Have you seen him who disbelieved in Our signs and yet says, 'I will be given property and offspring?' \" (19.77)",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثني إسحاق، أخبرنا يزيد بن هارون، أخبرنا العوام، قال حدثني إبراهيم أبو إسماعيل السكسكي، سمع عبد الله بن أبي أوفى  رضى الله عنهما  يقول أقام رجل سلعته فحلف بالله لقد أعطي بها ما لم يعطها فنزلت ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ وقال ابن أبي أوفى الناجش آكل ربا خائن‏.‏",
      "text_en": " Narrated `Abdullah bin Abu `Aufa:                     A man displayed some goods in the market and took a false oath that he had been offered so much for them though he was not offered that amount Then the following Divine Verse was revealed:-- \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . Will get painful punishment.\" (3.77) Ibn Abu `Aufa added, \"Such person as described above is a treacherous Riba eater (i.e. eater of usury).",
      "chain": [
        "30021",
        "20472",
        "11441",
        "11619",
        "5115"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، قال سمعت أبي، حدثنا أبو التياح، قال حدثني أنس بن مالك  رضى الله عنه  لما قدم رسول الله صلى الله عليه وسلم المدينة أمر بالمسجد وقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏‏.‏ قالوا لا والله لا نطلب ثمنه إلا إلى الله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle came to Medina, he ordered that a mosque be built. He said, \"O Bani An- Najjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price except from Allah.\"",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم كتب إلى قيصر، وقال ‏\"‏ فإن توليت فإن عليك إثم الأريسيين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle wrote a letter to Caesar saying, \"If you reject Islam, you will be responsible for the sins of the peasants (i.e. your people).",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3214",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وحدثنا إسحاق، أخبرنا وهب بن جرير، حدثنا أبي قال، سمعت حميد بن هلال، عن أنس بن مالك  رضى الله عنه  قال كأني أنظر إلى غبار ساطع في سكة بني غنم‏.‏ زاد موسى موكب جبريل‏.‏",
      "text_en": " Narrated Jarir:                     as below.Narrated Humaid bin Hilal:Anas bin Malik said, \"As if I say a cloud of dust swirling up in the lane of Bani Ghanim.\" Musa added, \"That was caused by the procession of Gabriel.\"",
      "chain": [
        "30021",
        "20298",
        "11272",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "3429",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق، أخبرنا عيسى بن يونس، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على المسلمين، فقالوا يا رسول الله، أينا لا يظلم نفسه قال ‏\"‏ ليس ذلك، إنما هو الشرك، ألم تسمعوا ما قال لقمان لابنه وهو يعظه ‏{‏يا بنى لا تشرك بالله إن الشرك لظلم عظيم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Verse:-- 'Those who believe and mix not their belief with wrong.' was revealed, the Muslims felt it very hard on them and said, \"O Allah's Apostle! Who amongst us does not do wrong to himself?\" He replied, \"The Verse does not mean this. But that (wrong) means to associate others in worship to Allah: Don't you listen to what Luqman said to his son when he was advising him,\" O my son! Join not others in worship with Allah. Verily joining others in worship with Allah is a great wrong indeed.\" (31.13)",
      "chain": [
        "30021",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3854",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا قتادة، قال سمعت أنس بن مالك  رضى الله عنه  قال أبو أسيد قال رسول الله صلى الله عليه وسلم ‏\"‏ خير دور الأنصار بنو النجار، ثم بنو عبد الأشهل، ثم بنو الحارث بن الخزرج، ثم بنو ساعدة وفي كل دور الأنصار خير ‏\"‏‏.‏ فقال سعد بن عبادة  وكان ذا قدم في الإسلام  أرى رسول الله صلى الله عليه وسلم قد فضل علينا‏.‏ فقيل له قد فضلكم على ناس كثير‏.‏",
      "text_en": " Narrated Abu Usaid:                     Allah's Apostle said, \"The best of the Ansar's houses are those of Bani An-Najjar, then those of Bani `Abdul Ash-hal, then those of Bani Al-Harith bin Al-Khazraj, then those of Bani Saida; but there is goodness in all the houses of the Ansar.\" Sa`d bin Ubada who was one of those who embraced Islam early, said, \"I see that Allah's Apostle is giving others superiority above us.\" Some people said to him, \"But he has given you superiority above many other people.\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4161",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه قال يوم الخندق ‏\"‏ ملأ الله عليهم بيوتهم وقبورهم نارا كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     On the day of Al-Khandaq (i.e. Trench), the Prophet said '(Let) Allah fill their (i.e. the infidels') houses and graves with fire just as they have prevented us from offering the Middle Prayer (i.e. `Asr prayer) till the sun had set.\"",
      "chain": [
        "30021",
        "20229",
        "20295",
        "11263",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4230",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا يعقوب، حدثني ابن أخي ابن شهاب، عن عمه، أخبرني عروة بن الزبير، أنه سمع مروان بن الحكم، والمسور بن مخرمة، يخبران خبرا من خبر رسول الله صلى الله عليه وسلم في عمرة الحديبية فكان فيما أخبرني عروة عنهما أنه لما كاتب رسول الله صلى الله عليه وسلم سهيل بن عمرو، يوم الحديبية على قضية المدة، وكان فيما اشترط سهيل بن عمرو أنه قال لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ وأبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، فكره المؤمنون ذلك وامعضوا، فتكلموا فيه، فلما أبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، كاتبه رسول الله صلى الله عليه وسلم، فرد رسول الله صلى الله عليه وسلم أبا جندل بن سهيل يومئذ إلى أبيه سهيل بن عمرو، ولم يأت رسول الله صلى الله عليه وسلم أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاءت المؤمنات مهاجرات، فكانت أم كلثوم بنت عقبة بن معيط ممن خرج إلى رسول الله صلى الله عليه وسلم وهى عاتق، فجاء أهلها يسألون رسول الله صلى الله عليه وسلم أن يرجعها إليهم، حتى أنزل الله تعالى في المؤمنات ما أنزل‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     That he heard Marwan bin Al-Hakam and Al-Miswar bin Makhrama relating one of the events that happened to Allah's Apostle in the `Umra of Al-Hudaibiya. They said, \"When Allah's Apostle concluded the truce with Suhail bin `Amr on the day of Al-Hudaibiya, one of the conditions which Suhail bin `Amr stipulated, was his saying (to the Prophet), \"If anyone from us (i.e. infidels) ever comes to you, though he has embraced your religion, you should return him to us, and should not interfere between us and him.\" Suhail refused to conclude the truce with Allah's Apostle except on this condition. The believers disliked this condition and got disgusted with it and argued about it. But when Suhail refused to conclude the truce with Allah's Apostle except on that condition, Allah's Apostle concluded it. Accordingly, Allah's Apostle then returned Abu Jandal bin Suhail to his father, Suhail bin `Amr, and returned every man coming to him from them during that period even if he was a Muslim. The believing women Emigrants came (to Medina) and Um Kulthum, the daughter of `Uqba bin Abi Mu'ait was one of those who came to Allah's Apostle and she was an adult at that time. Her relatives came, asking Allah's Apostle to return her to them, and in this connection, Allah revealed the Verses dealing with the believing (women). Aisha said, \"Allah's Apostle used to test all the believing women who migrated to him, with the following Verse:-- \"O Prophet! When the believing Women come to you, to give the pledge of allegiance to you.\" (60.12) `Urwa's uncle said, \"We were informed when Allah ordered His Apostle to return to the pagans what they had given to their wives who lately migrated (to Medina) and we were informed that Abu Basir...\" relating the whole narration.",
      "chain": [
        "30021",
        "20184",
        "20176",
        "10511",
        "858"
      ]
    },
    {
      "hadith_no": "4271",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عدي بن ثابت، سمعت البراء، وابن أبي أوفى، يحدثان عن النبي صلى الله عليه وسلم أنه قال يوم خيبر وقد نصبوا القدور أكفئوا القدور‏.‏",
      "text_en": " Narrated Al-Bara' and Ibn Abi `Aufa:                     On the day of Khaibar when the cooking pots were put on the fire, the Prophet said, \"Turn the cooking pots upside down.\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11372",
        "400",
        "5115"
      ]
    },
    {
      "hadith_no": "4363",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني ليث، حدثني عقيل، عن ابن شهاب،‏.‏ وحدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب،، قال محمد بن شهاب وزعم عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم، فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بكم ‏\"‏‏.‏ وكان أنظرهم رسول الله صلى الله عليه وسلم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب منكم أن يكون على حظه، حتى نعطيه إياه من أول ما يفيء الله علينا، فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏ هذا الذي بلغني عن سبى هوازن‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegate of Hawazin came to Allah's Apostle declaring their conversion to Islam and asked him to return their properties and captives, Allah's Apostle got up and said to them, \"There Is involved in this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So choose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. have not distributed the booty).\" Allah's Apostle had delayed the distribution of their booty over ten nights after his return from Ta'if. So when they came to know that Allah's Apostle was not going to return to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Apostle got up amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have come to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to do that as a favor then he can do it. And whoever of you likes to stick to his share till we give him from the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that (i.e. return the captives) willingly as a favor, 'O Allah's Apostle!\" Allah's Apostle said, \"We do not know which of you have agreed to it and which have not; so go back and let your chiefs forward us your decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to Allah's Apostle and informed him that all of them had agreed (to give up their captives) with pleasure, and had given their permission (i.e. that the captives be returned to their people). (The sub-narrator said, \"That is what has reached me about the captives of Hawazin tribe.\")",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "4411",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا أبو عامر العقدي، حدثنا قرة، عن أبي جمرة، قلت لابن عباس  رضى الله عنهما  إن لي جرة ينتبذ لي نبيذ، فأشربه حلوا في جر إن أكثرت منه، فجالست القوم، فأطلت الجلوس خشيت أن أفتضح فقال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقال ‏\"‏ مرحبا بالقوم غير خزايا ولا الندامى ‏\"‏‏.‏ فقالوا يا رسول الله، إن بيننا وبينك المشركين من مضر، وإنا لا نصل إليك إلا في أشهر الحرم، حدثنا بجمل من الأمر، إن عملنا به دخلنا الجنة، وندعو به من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع، الإيمان بالله، هل تدرون ما الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة وصوم رمضان، وأن تعطوا من المغانم الخمس، وأنهاكم عن أربع ما انتبذ في الدباء، والنقير، والحنتم، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Jamra:                     I said to Ibn `Abbas, \"I have an earthenware pot containing Nabidh (i.e. water and dates or grapes) for me, and I drink of it while it is sweet. If I drink much of it and stay with the people for a long time, I get afraid that they may discover it (for I will appear as if I were drunk). Ibn `Abbas said, \"A delegation of `Abdul Qais came to Allah's Apostle and he said, \"Welcome, O people! Neither will you have disgrace nor will you regret.\" They said, \"O Allah's Apostle! There are the Mudar pagans between you and us, so we cannot come to you except in the sacred Months. So please teach us some orders on acting upon which we will enter Paradise. Besides, we will preach that to our people who are behind us.\" The Prophet said, \"I order you to do four things and forbid you from four things (I order you): To believe in Allah...Do you know what is to believe in Allah? That is to testify that None has the right to be worshipped except Allah: (I order you also to offer prayers perfectly to pay Zakat; and to fast the month of Ramadan and to give the Khumus (i.e. one-fifth of the booty) (for Allah's Sake). I forbid you from four other things (i.e. the wine that is prepared in) Ad-Dubba, An-Naquir, Az-Hantam and Al-Muzaffat. (See Hadith No. 50 Vol. 1)",
      "chain": [
        "30021",
        "20443",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4468",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله، أن ابن عباس، أخبره أن رسول الله صلى الله عليه وسلم بعث بكتابه إلى كسرى مع عبد الله بن حذافة السهمي، فأمره أن يدفعه إلى عظيم البحرين، فدفعه عظيم البحرين إلى كسرى، فلما قرأه مزقه  فحسبت أن ابن المسيب قال  فدعا عليهم رسول الله صلى الله عليه وسلم أن يمزقوا كل ممزق‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle sent a letter to Khosrau with `Abdullah bin Hudhafa As-Sahmi and told him to hand it over to the governor of Al-Bahrain. The governor of Al-Bahrain handed it over to Khosrau, and when he read the latter, he tore it into pieces. (The sub-narrator added, \"I think that Ibn Al-Musaiyab said, 'Allah 's Apostle invoked (Allah) to tear them all totally Khosrau and his companions) into pieces.",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4490",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا بشر بن شعيب بن أبي حمزة، قال حدثني أبي، عن الزهري، قال أخبرني عبد الله بن كعب بن مالك الأنصاري  وكان كعب بن مالك أحد الثلاثة الذين تيب عليهم أن عبد الله بن عباس أخبره أن علي بن أبي طالب  رضى الله عنه  خرج من عند رسول الله صلى الله عليه وسلم في وجعه الذي توفي فيه، فقال الناس يا أبا حسن، كيف أصبح رسول الله صلى الله عليه وسلم فقال أصبح بحمد الله بارئا، فأخذ بيده عباس بن عبد المطلب، فقال له أنت والله بعد ثلاث عبد العصا، وإني والله لأرى رسول الله صلى الله عليه وسلم سوف يتوفى من وجعه هذا، إني لأعرف وجوه بني عبد المطلب عند الموت، اذهب بنا إلى رسول الله صلى الله عليه وسلم فلنسأله فيمن هذا الأمر، إن كان فينا علمنا ذلك، وإن كان في غيرنا علمناه فأوصى بنا‏.‏ فقال علي إنا والله لئن سألناها رسول الله صلى الله عليه وسلم فمنعناها لا يعطيناها الناس بعده، وإني والله لا أسألها رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     `Ali bin Abu Talib came out of the house of Allah's Apostle during his fatal illness. The people asked, \"O Abu Hasan (i.e. `Ali)! How is the health of Allah's Apostle this morning?\" `Ali replied, \"He has recovered with the Grace of Allah.\" `Abbas bin `Abdul Muttalib held him by the hand and said to him, \"In three days you, by Allah, will be ruled (by somebody else ), And by Allah, I feel that Allah's Apostle will die from this ailment of his, for I know how the faces of the offspring of `Abdul Muttalib look at the time of their death. So let us go to Allah's Apostle and ask him who will take over the Caliphate. If it is given to us we will know as to it, and if it is given to somebody else, we will inform him so that he may tell the new ruler to take care of us.\" `Ali said, \"By Allah, if we asked Allah's Apostle for it (i.e. the Caliphate) and he denied it us, the people will never give it to us after that. And by Allah, I will not ask Allah's Apostle for it.\"",
      "chain": [
        "30021",
        "30317",
        "20428",
        "11013",
        "1131",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "4546",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا روح، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، عن عطاء، سمع ابن عباس، يقرأ ‏{‏وعلى الذين يطوقونه فدية طعام مسكين ‏}‏‏.‏ قال ابن عباس ليست بمنسوخة، هو الشيخ الكبير والمرأة الكبيرة لا يستطيعان أن يصوما، فليطعمان مكان كل يوم مسكينا‏.‏",
      "text_en": " Narrated 'Ata:                     That he heard Ibn `Abbas reciting the Divine Verse:-- \"And for those who can fast they had a choice either fast, or feed a poor for every day..\" (2.184) Ibn `Abbas said, \"This Verse is not abrogated, but it is meant for old men and old women who have no strength to fast, so they should feed one poor person for each day of fasting (instead of fasting).",
      "chain": [
        "30021",
        "20229",
        "11244",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "4638",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم ح، وحدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عبد الكريم، أن مقسما، مولى عبد الله بن الحارث أخبره أن ابن عباس  رضى الله عنهما  أخبره ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ عن بدر والخارجون إلى بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Not equal are those believers who sat (at home) and did not join the Badr battle and those who joined the Badr battle.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "30021",
        "20121",
        "11070",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "4662",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى، وابن، إدريس عن أبي حيان، عن الشعبي، عن ابن عمر، قال سمعت عمر  رضى الله عنه  على منبر النبي صلى الله عليه وسلم يقول أما بعد أيها الناس إنه نزل تحريم الخمر وهى من خمسة، من العنب والتمر والعسل والحنطة والشعير، والخمر ما خامر العقل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard `Umar while he was on the pulpit of the Prophet saying, \"Now then O people! The revelation about the prohibition of alcoholic drinks was revealed; and alcoholic drinks are extracted from five things: Grapes, dates, honey, wheat and barley. And the alcoholic drink is that which confuses and stupefies the mind.\"",
      "chain": [
        "30021",
        "20347",
        "20102",
        "11404",
        "11052",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4940",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني عروة، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يمتحن من هاجر إليه من المؤمنات بهذه الآية، بقول الله ‏{‏يا أيها النبي إذا جاءك المؤمنات يبايعنك‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏‏.‏ قال عروة قالت عائشة فمن أقر بهذا الشرط من المؤمنات قال لها رسول الله صلى الله عليه وسلم ‏\"‏ قد بايعتك ‏\"‏‏.‏ كلاما ولا والله ما مست يده يد امرأة قط في المبايعة، ما يبايعهن إلا بقوله ‏\"‏ قد بايعتك على ذلك ‏\"‏‏.‏ تابعه يونس ومعمر وعبد الرحمن بن إسحاق عن الزهري‏.‏ وقال إسحاق بن راشد عن الزهري عن عروة وعمرة‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha the wife of the Prophet, said, \"Allah's Apostle used to examine the believing women who migrated to him in accordance with this Verse: 'O Prophet! When believing women come to you to take the oath of allegiance to you... Verily! Allah is Oft-Forgiving Most Merciful.' (60.12) `Aisha said, \"And if any of the believing women accepted the condition (assigned in the above-mentioned Verse), Allah's Apostle would say to her. \"I have accepted your pledge of allegiance.\" \"He would only say that, for, by Allah, his hand never touched, any lady during that pledge of allegiance. He did not receive their pledge except by saying, \"I have accepted your pledge of allegiance for that.\"",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5109",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثني إسحاق، أخبرنا عبيد الله، عن شيبان، عن يحيى، عن محمد بن عبد الرحمن، مولى بني زهرة عن أبي سلمة  قال وأحسبني قال  سمعت أنا من أبي سلمة، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ القرآن في شهر ‏\"‏‏.‏ قلت إني أجد قوة حتى قال ‏\"‏ فاقرأه في سبع ولا تزد على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power (to do more than that).\" Allah's Apostle said, \"Then finish the recitation of the Qur'an in seven days, and do not finish it in less than this period.\"",
      "chain": [
        "30021",
        "11201",
        "20240",
        "11449",
        "10960",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "5194",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق، أخبرنا يزيد، أخبرنا يحيى، أن القاسم بن محمد، حدثه أن عبد الرحمن بن يزيد ومجمع بن يزيد حدثاه أن رجلا يدعى خذاما أنكح ابنة له‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid and Majammi bin Yazid:                     The same ,Hadith above: A man called Khidam married a daughter of his (to somebody) against her consent. 'If you fear that you shall not be able to deal justly with the orphan girls then marry (other) women of your choice.' (4.3) And if somebody says to the guardian (of a woman), \"Marry me to soand- so,\" and the guardian remained silent or said to him, \"What have you got?\" And the other said, \"I have so much and so much (Mahr),\" or kept quiet, and then the guardian said, \"I have married her to you,\" then the marriage is valid (legal). This narration was told by Sahl on the authority of the Prophet.",
      "chain": [
        "30021",
        "20472",
        "11062",
        "10535",
        "1799"
      ]
    },
    {
      "hadith_no": "5291",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، عن عيسى، عن الأوزاعي، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  قالت رأيت النبي صلى الله عليه وسلم يسترني بردائه، وأنا أنظر إلى الحبشة يلعبون في المسجد، حتى أكون أنا الذي أسأم، فاقدروا قدر الجارية الحديثة السن الحريصة على اللهو‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was screening me with his Rida' (garment covering the upper part of the body) while I was looking at the Ethiopians who were playing in the courtyard of the mosque. (I continued watching) till I was satisfied. So you may deduce from this event how a little girl (who has not reached the age of puberty) who is eager to enjoy amusement should be treated in this respect.",
      "chain": [
        "30021",
        "20347",
        "20024",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5486",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، عن أبي أسامة، عن هشام، قال أخبرني أبي، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يحب الحلواء والعسل‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to love sweet edible things and honey.",
      "chain": [
        "30021",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5569",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسحاق، سمع عبدة، عن هشام، عن فاطمة، عن أسماء، قالت ذبحنا على عهد رسول الله صلى الله عليه وسلم فرسا ونحن بالمدينة فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse (by Dhabh) during the lifetime of Allah's Apostle while we were at Medina, and we ate it.",
      "chain": [
        "30021",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5885",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud, on the right and on the left of the Prophet were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
      "chain": [
        "30021",
        "20352",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "hadith_no": "5945",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا ورقاء بن عمر، عن عبيد الله بن أبي يزيد، عن نافع بن جبير، عن أبي هريرة  رضى الله عنه  قال كنت مع رسول الله صلى الله عليه وسلم في سوق من أسواق المدينة فانصرف فانصرفت فقال ‏\"‏ أين لكع  ثلاثا  ادع الحسن بن علي ‏\"‏‏.‏ فقام الحسن بن علي يمشي وفي عنقه السخاب، فقال النبي صلى الله عليه وسلم بيده هكذا، فقال الحسن بيده، هكذا فالتزمه فقال ‏\"‏ اللهم إني أحبه، فأحبه، وأحب من يحبه ‏\"‏‏.‏ قال أبو هريرة فما كان أحد أحب إلى من الحسن بن علي بعد ما قال رسول الله صلى الله عليه وسلم ما قال‏.‏",
      "text_en": " Narrated Abu Huraira:                     I was with Allah's Apostle in one of the Markets of Medina. He left (the market) and so did I. Then he asked thrice, \"Where is the small (child)?\" Then he said, \"Call Al-Hasan bin `Ali.\" So Al-Hasan bin `Ali got up and started walking with a necklace (of beads) around his neck. The Prophet stretched his hand out like this, and Al-Hasan did the same. The Prophet embraced him and said, \"0 Allah! l love him, so please love him and love those who love him.\" Since Allah's Apostle said that. nothing has been dearer to me than Al-Hasan.",
      "chain": [
        "30021",
        "20364",
        "20363",
        "11258",
        "11059",
        "13"
      ]
    },
    {
      "hadith_no": "6282",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، قال كان للنبي صلى الله عليه وسلم حاد يقال له أنجشة، وكان حسن الصوت، فقال له النبي صلى الله عليه وسلم ‏\"‏ رويدك يا أنجشة، لا تكسر القوارير ‏\"‏‏.‏ قال قتادة يعني ضعفة النساء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet had a Had (a camel driver) called Anjasha, and he had a nice voice. The Prophet said to him, \"(Drive) slowly, O Anjasha! Do not break the glass vessels!\" And Qatada said, \"(By vessels') he meant the weak women.\"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6312",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت كان عمر بن الخطاب يقول لرسول الله صلى الله عليه وسلم احجب نساءك‏.‏ قالت فلم يفعل، وكان أزواج النبي صلى الله عليه وسلم يخرجن ليلا إلى ليل قبل المناصع، خرجت سودة بنت زمعة، وكانت امرأة طويلة فرآها عمر بن الخطاب وهو في المجلس فقال عرفتك يا سودة‏.‏ حرصا على أن ينزل الحجاب‏.‏ قالت فأنزل الله عز وجل آية الحجاب‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) `Umar bin Al-Khattab used to say to Allah's Apostle \"Let your wives be veiled\" But he did not do so. The wives of the Prophet used to go out to answer the call of nature at night only at Al-Manasi.' Once Sauda, the daughter of Zam`a went out and she was a tall woman. `Umar bin Al-Khattab saw her while he was in a gathering, and said, \"I have recognized you, O Sauda!\" He (`Umar) said so as he was anxious for some Divine orders regarding the veil (the veiling of women.) So Allah revealed the Verse of veiling. (Al-Hijab; a complete body cover excluding the eyes). (See Hadith No. 148, Vol. 1)",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6316",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الله بن المثنى، حدثنا ثمامة بن عبد الله، عن أنس  رضى الله عنه أن رسول الله صلى الله عليه وسلم كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle greeted somebody, he used to greet him three times, and if he spoke a sentence, he used to repeat it thrice.",
      "chain": [
        "30021",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6382",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن النبي صلى الله عليه وسلم‏.‏ وحدثنا هدبة، حدثنا همام، حدثنا قتادة، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الله أفرح بتوبة عبده من أحدكم سقط على بعيره، وقد أضله في أرض فلاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Allah is more pleased with the repentance of His slave than anyone of you is pleased with finding his camel which he had lost in the desert. \"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6403",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثني إسحاق، أخبرنا يزيد، أخبرنا ورقاء، عن سمى، عن أبي صالح، عن أبي هريرة،‏.‏ قالوا يا رسول الله ذهب أهل الدثور بالدرجات والنعيم المقيم‏.‏ قال ‏\"‏ كيف ذاك ‏\"‏‏.‏ قال صلوا كما صلينا، وجاهدوا كما جاهدنا، وأنفقوا من فضول أموالهم، وليست لنا أموال‏.‏ قال ‏\"‏ أفلا أخبركم بأمر تدركون من كان قبلكم، وتسبقون من جاء بعدكم، ولا يأتي أحد بمثل ما جئتم، إلا من جاء بمثله، تسبحون في دبر كل صلاة عشرا، وتحمدون عشرا، وتكبرون عشرا ‏\"‏‏.‏ تابعه عبيد الله بن عمر عن سمى ورواه ابن عجلان عن سمى ورجاء بن حيوة‏.‏ ورواه جرير عن عبد العزيز بن رفيع عن أبي صالح عن أبي الدرداء‏.‏ ورواه سهيل عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people said, \"O Allah's Apostle! The rich people have got the highest degrees of prestige and the permanent pleasures (in this life and the life to come in the Hereafter).\" He said, \"How is that?\" They said, \"The rich pray as we pray, and strive in Allah's Cause as we do, and spend from their surplus wealth in charity, while we have no wealth (to spend likewise).\" He said, \"Shall I not tell you a thing, by doing which, you will catch up with those who are ahead of you and supersede those who will come after you; and nobody will be able to do such a good deed as you do except the one who does the same (deed as you do). That deed is to recite 'Subhan Allah ten times, and 'Al-Hamduli l-lah ten times, and 'AllahuAkbar' ten times after every prayer.\"",
      "chain": [
        "30021",
        "20472",
        "20363",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6550",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إسحاق، حدثنا روح بن عبادة، حدثنا شعبة، قال سمعت حصين بن عبد الرحمن، قال كنت قاعدا عند سعيد بن جبير فقال عن ابن عباس أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب، هم الذين لا يسترقون، ولا يتطيرون، وعلى ربهم يتوكلون ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"Seventy thousand people of my followers will enter Paradise without accounts, and they are those who do not practice Ar-Ruqya and do not see an evil omen in things, and put their trust in their Lord.",
      "chain": [
        "30021",
        "20229",
        "20020",
        "15097",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "6701",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، أخبرنا النضر، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن يحيى بن يعمر، أن عائشة  رضى الله عنها  أخبرته أنها، سألت رسول الله صلى الله عليه وسلم عن الطاعون فقال ‏\"‏ كان عذابا يبعثه الله على من يشاء، فجعله الله رحمة للمؤمنين، ما من عبد يكون في بلد يكون فيه، ويمكث فيه، لا يخرج من البلد، صابرا محتسبا، يعلم أنه لا يصيبه إلا ما كتب الله له، إلا كان له مثل أجر شهيد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked Allah's Apostle about the plague. He said, \"That was a means of torture which Allah used to send upon whom-so-ever He wished, but He made it a source of mercy for the believers, for anyone who is residing in a town in which this disease is present, and remains there and does not leave that town, but has patience and hopes for Allah's reward, and knows that nothing will befall him except what Allah has written for him, then he will get such reward as that of a martyr.\"",
      "chain": [
        "30021",
        "20291",
        "20424",
        "11432",
        "11316",
        "53"
      ]
    },
    {
      "hadith_no": "6725",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ أتموا الركوع والسجود، فوالذي نفسي بيده إني لأراكم من بعد ظهري إذا ما ركعتم وإذا ما سجدتم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard the Prophet saying, \"Perform the bowing and the prostration properly (with peace of mind), for, by Him in Whose Hand my soul is, I see you from behind my back when you bow and when you prostrate.\"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6726",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير، أخبرنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، من الأنصار أتت النبي صلى الله عليه وسلم معها أولاد لها فقال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده إنكم لأحب الناس إلى ‏\"‏‏.‏ قالها ثلاث مرار‏.‏",
      "text_en": " Narrated Anas bin Malik:                     An Ansari woman came to the Prophet in the company of her children, and the Prophet said to her, \"By Him in Whose Hand my soul is, you are the most beloved people to me!\" And he repeated the statement thrice.",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "6968",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، أن يهوديا، رض رأس جارية بين حجرين، فقيل لها من فعل بك هذا أفلان أفلان حتى سمي اليهودي فأومأت برأسها، فجيء باليهودي فاعترف، فأمر به النبي صلى الله عليه وسلم فرض رأسه بالحجارة‏.‏ وقد قال همام بحجرين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jew crushed the head of a girl between two stones. It was said to her. \"Who has done this to you, such-and-such person, such-and-such person?\" When the name of the Jew was mentioned, she nodded with her head, agreeing. So the Jew was brought and he confessed. The Prophet ordered that his head be crushed with the stones. (Hammam said, \"with two stones.\")",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7122",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We (Muslims) are the last (to come) but (will be) the foremost (on the Day of Resurrection).\" Allah's Apostle further said, ''While sleeping, I was given the treasures of the world and two golden bangles were put in my hands, but I felt much annoyed, and those two bangles distressed me very much, but I was inspired that I should blow them off, so I blew them and they flew away. Then I interpreted that those two bangles were the liars between whom I was (i.e., the one of San`a' and the one of Yamama).",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "7242",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا شعبة، حدثنا ثابت البناني، عن أنس بن مالك، يقول لامرأة من أهله تعرفين فلانة قالت نعم‏.‏ قال فإن النبي صلى الله عليه وسلم مر بها وهى تبكي عند قبر فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏ فقالت إليك عني، فإنك خلو من مصيبتي‏.‏ قال فجاوزها ومضى فمر بها رجل فقال ما قال لك رسول الله صلى الله عليه وسلم‏.‏ قالت ما عرفته قال إنه لرسول الله صلى الله عليه وسلم قال فجاءت إلى بابه فلم تجد عليه بوابا فقالت يا رسول الله والله ما عرفتك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الصبر عند أول صدمة ‏\"‏‏.‏",
      "text_en": " Narrated Thabit Al-Bunani:                     Anas bin Malik said to a woman of his family, \"Do you know such-and-such a woman?\" She replied, \"Yes.\" He said, \"The Prophet passed by her while she was weeping over a grave, and he said to her, 'Be afraid of Allah and be patient.' The woman said (to the Prophet). 'Go away from me, for you do not know my calamity.'\" Anas added, \"The Prophet left her and proceeded. A man passed by her and asked her, 'What has Allah's Apostle said to you?' She replied, 'I did not recognize him.' The man said, 'He was Allah's Apostle.\"' Anas added, \"So that woman came to the gate of the Prophet and she did not find a gate-keeper there, and she said, 'O Allah's Apostle! By Allah. I did not recognize you!' The Prophet said, 'No doubt, patience is at the first stroke of a calamity.'\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7376",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عفان، حدثنا وهيب، حدثنا موسى بن عقبة، سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير، فصلى رسول الله صلى الله عليه وسلم فيها ليالي، حتى اجتمع إليه ناس، ثم فقدوا صوته ليلة فظنوا أنه قد نام، فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنيعكم، حتى خشيت أن يكتب عليكم، ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم، فإن أفضل صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     The Prophet took a room made of date palm leaves mats in the mosque. Allah's Apostle prayed in it for a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the 4th night the people did not hear his voice and they thought he had slept, so some of them started humming in order that he might come out. The Prophet then said, \"You continued doing what I saw you doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined on you, you would not continue performing it. Therefore, O people! Perform your prayers at your homes, for the best prayer of a person is what is performed at his home except the compulsory congregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "7423",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "وحدثني إسحاق، أخبرنا عيسى، وابن، إدريس وابن أبي غنية عن أبي حيان، عن الشعبي، عن ابن عمر  رضى الله عنهما  قال سمعت عمر، على منبر النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard `Umar (delivering a sermon) on the pulpit of the Prophet.",
      "chain": [
        "30021",
        "20347",
        "20614",
        "11404",
        "11052",
        "18"
      ]
    },
    {
      "hadith_no": "7451",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرحمن بن مهدي، عن سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Allah's Apostle said, \"Recite (and study) the Qur'an as long as you are in agreement as to its interpretation and meanings, but when you have differences regarding its interpretation and meanings, then you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)",
      "chain": [
        "30021",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "7498",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسحاق، حدثنا عفان، حدثنا وهيب، حدثنا موسى  هو ابن عقبة  حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن أبي سعيد الخدري، في غزوة بني المصطلق أنهم أصابوا سبايا فأرادوا أن يستمتعوا بهن ولا يحملن فسألوا النبي صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما عليكم أن لا تفعلوا، فإن الله قد كتب من هو خالق إلى يوم القيامة ‏\"‏‏.‏ وقال مجاهد عن قزعة سمعت أبا سعيد فقال قال النبي صلى الله عليه وسلم ‏\"‏ ليست نفس مخلوقة إلا الله خالقها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     That during the battle with Bani Al-Mustaliq they (Muslims) captured some females and intended to have sexual relation with them without impregnating them. So they asked the Prophet about coitus interrupt us. The Prophet said, \"It is better that you should not do it, for Allah has written whom He is going to create till the Day of Resurrection.\" Qaza'a said, \"I heard Abu Sa`id saying that the Prophet said, 'No soul is ordained to be created but Allah will create it.\"",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11222",
        "11253",
        "38"
      ]
    },
    {
      "hadith_no": "28",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى، - وهو ابن يونس - حدثنا الأوزاعي، عن سليمان بن موسى، قال لقيت طاوسا فقلت حدثني فلان، كيت وكيت ‏.‏ قال إن كان صاحبك مليا فخذ عنه ‏.‏",
      "text_en": "",
      "chain": [
        "30021",
        "20347",
        "20024",
        "10880"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، قال سمعت بعض، أصحاب عبد الله قال قال ابن المبارك نعم الرجل بقية لولا أنه كان يكني الأسامي ويسمي الكنى كان دهرا يحدثنا عن أبي سعيد الوحاظي فنظرنا فإذا هو عبد القدوس ‏.‏",
      "text_en": "",
      "chain": [
        "30021"
      ]
    },
    {
      "hadith_no": "345",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم - واللفظ لأبي بكر قال إسحاق أخبرنا وقال الآخران، حدثنا - وكيع، عن سفيان، عن آدم بن سليمان، مولى خالد قال سمعت سعيد بن جبير، يحدث عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله‏}‏ قال دخل قلوبهم منها شىء لم يدخل قلوبهم من شىء فقال النبي صلى الله عليه وسلم ‏\"‏ قولوا سمعنا وأطعنا وسلمنا ‏\"‏ ‏.‏ قال فألقى الله الإيمان في قلوبهم فأنزل الله تعالى ‏{‏ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا‏}‏ قال قد فعلت ‏{‏ ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا‏}‏ - قال قد فعلت ‏{‏ واغفر لنا وارحمنا أنت مولانا‏}‏ قال قد فعلت ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas:                      When this verse:\" Whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it\" (ii 284), there entered in their minds something (of that fear) such as had never entered their hearts (before). The Apostle (may peace be upon him) observed: Say: We have heard and obeyed and submitted ourselves. He (the reporter) said: Allah instilled faith in their hearts and He revealed this verse:\" Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, call us not to account if we forget or make a mistake. He the (Lord) said: I indeed did it. Our Lord! do not lay on us a burden as Thou didst lay on those before us. He (our Lord) said: I indeed did it. And pardon us, have mercy on us. Thou art our Protector\" (ii. 286). He said: I indeed did it.",
      "chain": [
        "30201",
        "30021",
        "20032",
        "20012",
        "20576",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الرزاق، أخبرنا الثوري، عن عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن شريح بن هانئ، قال أتيت عائشة أسألها عن المسح، على الخفين فقالت عليك بابن أبي طالب فسله فإنه كان يسافر مع رسول الله صلى الله عليه وسلم ‏.‏ فسألناه فقال جعل رسول الله صلى الله عليه وسلم ثلاثة أيام ولياليهن للمسافر ويوما وليلة للمقيم ‏.‏ قال وكان سفيان إذا ذكر عمرا أثنى عليه ‏.‏",
      "text_en": " Shuraih b. Hani said:                      I came to 'A'isha to ask her about wiping over the socks. She said: You better ask ('Ali) son of Abu Talib for he used to travel with Allah's Messenger (may peace be upon him). We asked him and he said: The Messenger of Allah (may peace be upon him) stipulated (the upper limit) of three days and three nights for a traveller and one day and one night for the resident.",
      "chain": [
        "30021",
        "20121",
        "20012",
        "10803",
        "11069",
        "10812",
        "10774"
      ]
    },
    {
      "hadith_no": "292",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو سعيد الأشج، وأبو كريب محمد بن العلاء وإسحاق بن إبراهيم قال إسحاق أخبرنا وقال الآخران، حدثنا وكيع، حدثنا الأعمش، قال سمعت مجاهدا، يحدث عن طاوس، عن ابن عباس، قال مر رسول الله صلى الله عليه وسلم على قبرين فقال ‏\"‏ أما إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان يمشي بالنميمة وأما الآخر فكان لا يستتر من بوله ‏\"‏ ‏.‏ قال فدعا بعسيب رطب فشقه باثنين ثم غرس على هذا واحدا وعلى هذا واحدا ثم قال ‏\"‏ لعله أن يخفف عنهما ما لم ييبسا ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported:                      The Messenger of Allah (may peace be upon him) happened to pass by two graves and said: They (their occupants) are being tormented, but they are not tormented for a grievous sin. One of them carried tales and the other did not keep himself safe from being defiled by urine. He then called for a fresh twig and split it into two parts, and planted them on each grave and then said: Perhaps, their punishment way be mitigated as long as these twigs remain fresh.",
      "chain": [
        "30200",
        "30216",
        "30021",
        "20032",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن حاتم، قال إسحاق أخبرنا وقال ابن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عمرو بن دينار، قال أكبر علمي والذي يخطر على بالي أن أبا الشعثاء أخبرني أن ابن عباس أخبره أن رسول الله صلى الله عليه وسلم كان يغتسل بفضل ميمونة ‏.‏",
      "text_en": " Ibn Abbas reported that the Messenger of Allah (may peace be upon him) took a bath with the water left over by Maimuna.",
      "chain": [
        "30021",
        "30514",
        "20277",
        "11070",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا موسى القارئ، حدثنا زائدة، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، قالت وضعت للنبي صلى الله عليه وسلم ماء وسترته فاغتسل ‏.‏",
      "text_en": " Maimuna reported:                      I placed water for the Apostle (may peace be upon him) and provided privacy for him, and he took a bath.",
      "chain": [
        "30021",
        "20320",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن حاتم بن ميمون، جميعا عن محمد بن بكر، قال أخبرنا ابن جريج، ح وحدثني إسحاق بن منصور، ومحمد بن رافع، واللفظ، لهما - قال إسحاق أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، - أخبرنا ابن جريج، أخبرني عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان حجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على عاتقك من الحجارة ‏.‏ ففعل فخر إلى الأرض وطمحت عيناه إلى السماء ثم قام فقال ‏\"‏ إزاري إزاري ‏\"‏ ‏.‏ فشد عليه إزاره ‏.‏ قال ابن رافع في روايته على رقبتك ‏.‏ ولم يقل على عاتقك ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      When the Ka'ba was constructed the Apostle of Allah (may peace be upon him) and Abbas went and lifted stones. Abbas said to the Messenger of Allah (may peace be upon him): Place your lower garment on your shoulder (so that you may protect yourself from the roughness and hardness of stones). He (the Holy Prophet) did this, but fell down upon the ground in a state of unconciousness and his eyes were turned towards the sky. He then stood up and said: My lower garment, my lower garment; and this wrapper was tied around him. In the hadith transmitted by Ibn Rafi', there is the word:\" On his neck\" and he did not say:\" Upon his shoulder.\"",
      "chain": [
        "30021",
        "38487",
        "20277",
        "11070",
        "30313",
        "30375",
        "30312",
        "20121",
        "11070",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا محمد بن بكر، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، قالا أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، - واللفظ له - قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، مولى ابن عمر عن عبد الله بن عمر، أنه قال كان المسلمون حين قدموا المدينة يجتمعون فيتحينون الصلوات وليس ينادي بها أحد فتكلموا يوما في ذلك فقال بعضهم اتخذوا ناقوسا مثل ناقوس النصارى وقال بعضهم قرنا مثل قرن اليهود فقال عمر أولا تبعثون رجلا ينادي بالصلاة قال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فناد بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported:                      When the Muslims came to Medina, they gathered and sought to know the time of prayer but no one summoned them. One day they discussed the matter, and some of them said: Use something like the bell of the Christians and some of them said: Use horn like that of the Jews. Umar said: Why may not a be appointed who should call (people) to prayer? The Messenger of Allah (may peace be upon him) said: O Bilal, get up and summon (the people) to prayer.",
      "chain": [
        "30021",
        "20277",
        "30375",
        "20121",
        "11070",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الوهاب الثقفي، حدثنا خالد الحذاء، عن أبي قلابة، عن أنس بن مالك، قال ذكروا أن يعلموا، وقت الصلاة بشىء يعرفونه فذكروا أن ينوروا نارا أو يضربوا ناقوسا فأمر بلال أن يشفع الأذان ويوتر الإقامة ‏.‏",
      "text_en": " Anas b. Malik reported:                      They (the Companions) discussed that they should know the timings of prayer by means of something recognized by all. Some of them said that fire should be lighted or a bell should be rung. But Bilal was ordered to repeat the phrases twice in Adhan, and once in Iqama.",
      "chain": [
        "30021",
        "20259",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا سفيان بن عيينة، عن العلاء، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى صلاة لم يقرأ فيها بأم القرآن فهى خداج - ثلاثا - غير تمام ‏\"‏ ‏.‏ فقيل لأبي هريرة إنا نكون وراء الإمام ‏.‏ فقال اقرأ بها في نفسك فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله تعالى قسمت الصلاة بيني وبين عبدي نصفين ولعبدي ما سأل فإذا قال العبد ‏{‏ الحمد لله رب العالمين‏}‏ ‏.‏ قال الله تعالى حمدني عبدي وإذا قال ‏{‏ الرحمن الرحيم‏}‏ ‏.‏ قال الله تعالى أثنى على عبدي ‏.‏ وإذا قال ‏{‏ مالك يوم الدين‏}‏ ‏.‏ قال مجدني عبدي - وقال مرة فوض إلى عبدي - فإذا قال ‏{‏ إياك نعبد وإياك نستعين‏}‏ ‏.‏ قال هذا بيني وبين عبدي ولعبدي ما سأل ‏.‏ فإذا قال ‏{‏ اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين‏}‏ ‏.‏ قال هذا لعبدي ولعبدي ما سأل ‏\"‏ ‏.‏ قال سفيان حدثني به العلاء بن عبد الرحمن بن يعقوب دخلت عليه وهو مريض في بيته فسألته أنا عنه ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: If anyone observes prayer in which he does not recite Umm al-Qur'an, It is deficient [he said this three times] and not complete. It was said to Abu Huraira: At times we are behind the Imam. He said: Recite it inwardly, for he had heard the Messenger of Allah (may peace be upon him) declare that Allah the Exalted had said: I have divided the prayer into two halves between Me and My servant, and My servant will receive what he asks. When the servant says: Praise be to Allah, the Lord of the universe, Allah the Most High says: My servant has praised Me. And when he (the servant) says: The Most Compassionate, the Merciful, Allah the Most High says: My servant has lauded Me. And when he (the servant) says: Master of the Day of judg- ment, He remarks: My servant has glorified Me. and sometimes He would say: My servant entrusted (his affairs) to Me. And when he (the worshipper) says: Thee do we worship and of Thee do we ask help, He (Allah) says: This is between Me and My servant, and My servant will receive what he asks for. Then, when he (the worshipper) says: Guide us to the straight path, the path of those to whom Thou hast been Gracious not of those who have incurred Thy displeasure, nor of those who have gone astray, He (Allah) says: This is for My servant, and My servant will receive what he asks for. Sufyan said: 'Ala b. 'Abd al-Rahman b. Ya'qub narrated it to me when I went to him and he was confined to his home on account of illness, and I asked him about it.",
      "chain": [
        "30021",
        "20005",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "497",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا مروان بن معاوية الفزاري، قال حدثنا عبيد الله بن عبد الله بن الأصم، عن يزيد بن الأصم، أنه أخبره عن ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا سجد خوى بيديه - يعني جنح - حتى يرى وضح إبطيه من ورائه وإذا قعد اطمأن على فخذه اليسرى ‏.‏",
      "text_en": " Maimuna, the wife of the Apostle of Allah (may peace be upon him), reported:                      When the Messenger of Allah (may peace be upon him) prostrated himself, he spread his arms, i. e. he separated them so much that the whiteness of his armpits became visible from behind and when he sat (for Jalsa) he rested on his left thigh.",
      "chain": [
        "30021",
        "20201",
        "10946",
        "10842"
      ]
    },
    {
      "hadith_no": "1460",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا الفضيل بن مرزوق، عن شقيق بن عقبة، عن البراء بن عازب، قال نزلت هذه الآية حافظوا على الصلوات وصلاة العصر ‏.‏ فقرأناها ما شاء الله ثم نسخها الله فنزلت ‏{‏ حافظوا على الصلوات والصلاة الوسطى‏}‏ فقال رجل كان جالسا عند شقيق له هي إذا صلاة العصر ‏.‏ فقال البراء قد أخبرتك كيف نزلت وكيف نسخها الله ‏.‏ والله أعلم ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported:                      This verse was revealed (in this way):\" Guard the prayers and the 'Asr prayer.\" We recited it (in this very way) so long as Allah desired. Allah, then, abrogated it and it was revealed:\" Guard the prayers, and the middle prayer.\" A person who was sitting with Shaqiq (one of the narrators in the chain of transmitters) said: Now it implies the 'Asr prayer. Upon this al-Bara' said: I have already informed you how this (verse) was revealed and how Allah abrogated it, and Allah knows best.",
      "chain": [
        "30021",
        "20364",
        "10775",
        "400"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا شعيب بن إسحاق الدمشقي، حدثنا الأوزاعي، حدثني أبو النجاشي، حدثني رافع بن خديج، قال كنا نصلي المغرب ‏.‏ بنحوه ‏.‏",
      "text_en": " A hadith like this, i. e.\" We used to observe evening prayer....\" so on and so forth, has been narrated by Rafi' b. Khadij by another chain of transmitters.",
      "chain": [
        "30021",
        "20239",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "1570",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الوهاب الثقفي، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت النبي صلى الله عليه وسلم أنا وصاحب لي فلما أردنا الإقفال من عنده قال لنا ‏\"‏ إذا حضرت الصلاة فأذنا ثم أقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " Malik b Huwairith reported:                      I came to the Apostle of Allah (may peace be upon him) along with a companion of mine, and when we intended to return from him, he said: When there is time for prayer, announce prayer, pronounce Iqama, and the oldest amongst you should lead the prayer.",
      "chain": [
        "30021",
        "20259",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "1596",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا النضر بن شميل، حدثنا عوف بن أبي جميلة الأعرابي، عن أبي رجاء العطاردي، عن عمران بن الحصين، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فسرينا ليلة حتى إذا كان من آخر الليل قبيل الصبح وقعنا تلك الوقعة التي لا وقعة عند المسافر أحلى منها فما أيقظنا إلا حر الشمس ‏.‏ وساق الحديث بنحو حديث سلم بن زرير وزاد ونقص ‏.‏ وقال في الحديث فلما استيقظ عمر بن الخطاب ورأى ما أصاب الناس وكان أجوف جليدا فكبر ورفع صوته بالتكبير حتى استيقظ رسول الله صلى الله عليه وسلم لشدة صوته بالتكبير فلما استيقظ رسول الله صلى الله عليه وسلم شكوا إليه الذي أصابهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ضير ارتحلوا ‏\"‏ ‏.‏ واقتص الحديث ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      We were with the Messenger of Allah (may peace be upon him) in a journey and we travelled throughout the night till at the end, just before dawn, we lay down (for rest), and nothing is sweeter for a traveller than this and none awakened us but the heat of the sun, and the rest of the hadith is the same (as mentioned above) except this additien:\" When 'Umar b. Khattab woke up, he saw what had happened to the people. And he was a man having a big belly and strongly built; he recited takbir in a loud voice till the Messenger of Allah (may peace be upon him) woke up by the loudness of his voice in takbir. When the Messenger of Allah (may peace be upon him) got up, the people told him what had happened. Upon this the Messenger of Allah (may peace be upon him) said: There is no harm; you better proceed further,\" and (the rest of the hadith) was narrated.",
      "chain": [
        "30021",
        "20291",
        "11440"
      ]
    },
    {
      "hadith_no": "2475",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم الحنظلي، قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن الأعمش، عن أبي وائل، عن سلمان، بن ربيعة قال قال عمر بن الخطاب رضى الله عنه قسم رسول الله صلى الله عليه وسلم قسما فقلت والله يا رسول الله لغير هؤلاء كان أحق به منهم ‏.‏ قال ‏\"‏ إنهم خيروني أن يسألوني بالفحش أو يبخلوني فلست بباخل ‏\"‏ ‏.‏",
      "text_en": " Umar b. Khattab (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) distributed something. Upon this I said:                      Messenger of Allah, I swear by God, the others besides them were more deserving than these (to whom you gave charity). He said: They had in fact left no other alternative for me. but (that they should) either beg importunately from me or they would regard me as a miser, but I am not a miser.",
      "chain": [
        "30203",
        "30022",
        "30021",
        "30312",
        "4057",
        "11060",
        "11353",
        "5067",
        "3"
      ]
    },
    {
      "hadith_no": "2844",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وابن أبي عمر، جميعا عن ابن عيينة، - قال إسحاق أخبرنا سفيان بن عيينة، - عن أبي يعفور، عن مسلم بن صبيح، عن مسروق، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم إذا دخل العشر أحيا الليل وأيقظ أهله وجد وشد المئزر ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that when the last ten nights began Allah's Messenger (may peace be upon him) kept awake at night (for prayer and devotion), wakened his family, and prepared himself to observe prayer (with more vigour).",
      "chain": [
        "30021",
        "30421",
        "20005",
        "30312",
        "20005",
        "11403",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2945",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، حدثنا عبد الصمد بن عبد الوارث، حدثني أبي، حدثنا أيوب بن موسى، حدثني نبيه بن وهب، أن عمر بن عبيد الله بن معمر، رمدت عينه فأراد أن يكحلها، فنهاه أبان بن عثمان وأمره أن يضمدها بالصبر وحدث عن عثمان بن عفان عن النبي صلى الله عليه وسلم أنه فعل ذلك ‏.‏",
      "text_en": " Nubaih b Wahb reported that the eyes of Umar b. Ubaidnllah b. Ma'mar were swollen, and he decided to use antimony. Aban b. 'Uthman forbade him to do so and commanded him to apply aloes on them, and reported on the authority of 'Uthman b. Affan that the Apostle of Allah (may peace be upon him) had done that.",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11241",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "hadith_no": "3368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم يوم الفتح فتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية وإذا استنفرتم فانفروا ‏\"‏ ‏.‏ وقال يوم الفتح فتح مكة ‏\"‏ إن هذا البلد حرمه الله يوم خلق السموات والأرض فهو حرام بحرمة الله إلى يوم القيامة وإنه لم يحل القتال فيه لأحد قبلي ولم يحل لي إلا ساعة من نهار فهو حرام بحرمة الله إلى يوم القيامة لا يعضد شوكه ولا ينفر صيده ولا يلتقط إلا من عرفها ولا يختلى خلاها ‏\"‏ ‏.‏ فقال العباس يا رسول الله إلا الإذخر فإنه لقينهم ولبيوتهم ‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying on the Day of Victory over Mecca:                      There is no Hijra (emigration) but only Jihad and good intention; and when you are called to battle, then go forth. He also said on the Day of Victory over Mecca: Allah made this town sacred on the day He created the earth and the heavens; so it is -sacred by the sacred- ness conferred on it by Allah until the Day of Resurrection and fighting in it was not lawful to anyone before me, and it was made lawful for me only during an hour on one day, for it is sacred by the sacredness conferred on it by Allah until the Day of Resurrection. Its thorns are not to be cut, its game is not to be molested, and the things dropped are to be picked up only by one who makes a public announcement of it, and its fresh herbage is not to be cut. Abbas (Allah be pleased with him) said: Messenger of Allah, exception may be made in case of rush, for it is useful for their blacksmiths and for their houses. He (the Holy Prophet) conceding the suggestion of 'Abbas) said: Except rush.",
      "chain": [
        "30021",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3674",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن أبي عمر، جميعا عن الثقفي، - قال ابن أبي عمر حدثنا عبد الوهاب الثقفي، - عن أيوب، عن ابن أبي مليكة، عن القاسم، عن عائشة، أن سالما، مولى أبي حذيفة كان مع أبي حذيفة وأهله في بيتهم فأتت - تعني ابنة سهيل - النبي صلى الله عليه وسلم فقالت إن سالما قد بلغ ما يبلغ الرجال وعقل ما عقلوا وإنه يدخل علينا وإني أظن أن في نفس أبي حذيفة من ذلك شيئا ‏.‏ فقال لها النبي صلى الله عليه وسلم ‏\"‏ أرضعيه تحرمي عليه ويذهب الذي في نفس أبي حذيفة ‏\"‏ ‏.‏ فرجعت فقالت إني قد أرضعته فذهب الذي في نفس أبي حذيفة ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Salim, the freed slave of Abu Hadhaifa, lived with him and his family in their house. She (i. e. the daughter of Suhail came to Allah's Apostle (may peace be upon him) and said:                      Salim has attained (purbety) as men attain, and he understands what they understand, and he enters our house freely, I, however, perceive that something (rankles) in the heart of Abu Hudhaifa, whereupon Allah's Apostle (may peace be upon him) said to her: Suckle him and you would become unlawful for him, and (the rankling) which Abu Hudhaifa feels in his heart will disappear. She returned and said: So I suckled him, and what (was there) in the heart of Abu Hudhaifa disappeared.",
      "chain": [
        "30021",
        "30421",
        "20259",
        "11015",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3768",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن أبي عمر، - وتقاربا في لفظ الحديث - قال ابن أبي عمر حدثنا وقال، إسحاق أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبيد الله بن عبد الله بن أبي ثور، عن ابن عباس، قال لم أزل حريصا أنأسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله تعالى ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ حتى حج عمر وحججت معه فلما كنا ببعض الطريق عدل عمر وعدلت معه بالإداوة فتبرز ثم أتاني فسكبت على يديه فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله عز وجل لهما ‏{‏ إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ قال عمر واعجبا لك يا ابن عباس - قال الزهري كره والله ما سأله عنه ولم يكتمه - قال هي حفصة وعائشة ‏.‏ ثم أخذ يسوق الحديث قال كنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم - قال - وكان منزلي في بني أمية بن زيد بالعوالي فتغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت أن تراجعني ‏.‏ فقالت ما تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ فانطلقت فدخلت على حفصة فقلت أتراجعين رسول الله صلى الله عليه وسلم فقالت نعم ‏.‏ فقلت أتهجره إحداكن اليوم إلى الليل قالت نعم ‏.‏ قلت قد خاب من فعل ذلك منكن وخسر أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله صلى الله عليه وسلم فإذا هي قد هلكت لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني ما بدا لك ولا يغرنك أن كانت جارتك هي أوسم وأحب إلى رسول الله صلى الله عليه وسلم منك - يريد عائشة - قال وكان لي جار من الأنصار فكنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم فينزل يوما وأنزل يوما فيأتيني بخبر الوحى وغيره وآتيه بمثل ذلك وكنا نتحدث أن غسان تنعل الخيل لتغزونا فنزل صاحبي ثم أتاني عشاء فضرب بابي ثم ناداني فخرجت إليه فقال حدث أمر عظيم ‏.‏ قلت ماذا أجاءت غسان قال لا بل أعظم من ذلك وأطول طلق النبي صلى الله عليه وسلم نساءه ‏.‏ فقلت قد خابت حفصة وخسرت قد كنت أظن هذا كائنا حتى إذا صليت الصبح شددت على ثيابي ثم نزلت فدخلت على حفصة وهى تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم فقالت لا أدري ها هو ذا معتزل في هذه المشربة ‏.‏ فأتيت غلاما له أسود فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى فقال قد ذكرتك له فصمت فانطلقت حتى انتهيت إلى المنبر فجلست فإذا عنده رهط جلوس يبكي بعضهم فجلست قليلا ثم غلبني ما أجد ثم أتيت الغلام فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى ‏.‏ فقال قد ذكرتك له فصمت ‏.‏ فوليت مدبرا فإذا الغلام يدعوني فقال ادخل فقد أذن لك فدخلت فسلمت على رسول الله صلى الله عليه وسلم فإذا هو متكئ على رمل حصير قد أثر في جنبه فقلت أطلقت يا رسول الله نساءك فرفع رأسه إلى وقال ‏\"‏ لا ‏\"‏ ‏.‏ فقلت الله أكبر لو رأيتنا يا رسول الله وكنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فتغضبت على امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني ‏.‏ فقالت ما تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ فقلت قد خاب من فعل ذلك منهن وخسر أفتأمن إحداهن أن يغضب الله عليها لغضب رسوله صلى الله عليه وسلم فإذا هي قد هلكت فتبسم رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد دخلت على حفصة فقلت لا يغرنك أن كانت جارتك هي أوسم منك وأحب إلى رسول الله صلى الله عليه وسلم منك ‏.‏ فتبسم أخرى فقلت أستأنس يا رسول الله ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ فجلست فرفعت رأسي في البيت فوالله ما رأيت فيه شيئا يرد البصر إلا أهبا ثلاثة فقلت ادع الله يا رسول الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدون الله فاستوى جالسا ثم قال ‏\"‏ أفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏ ‏.‏ فقلت استغفر لي يا رسول الله ‏.‏ وكان أقسم أن لا يدخل عليهن شهرا من شدة موجدته عليهن ‏.‏ حتى عاتبه الله عز وجل ‏.‏ قال الزهري فأخبرني عروة، عن عائشة، قالت لما مضى تسع وعشرون ليلة دخل على رسول الله صلى الله عليه وسلم بدأ بي فقلت يا رسول الله إنك أقسمت أن لا تدخل علينا شهرا وإنك دخلت من تسع وعشرين أعدهن ‏.‏ فقال ‏\"‏ إن الشهر تسع وعشرون - ثم قال - يا عائشة إني ذاكر لك أمرا فلا عليك أن لا تعجلي فيه حتى تستأمري أبويك ‏\"‏ ‏.‏ ثم قرأ على الآية ‏{‏ يا أيها النبي قل لأزواجك‏}‏ حتى بلغ ‏{‏ أجرا عظيما‏}‏ قالت عائشة قد علم والله أن أبوى لم يكونا ليأمراني بفراقه قالت فقلت أوفي هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة ‏.‏ قال معمر فأخبرني أيوب أن عائشة قالت لا تخبر نساءك أني اخترتك فقال لها النبي صلى الله عليه وسلم ‏\"‏ إن الله أرسلني مبلغا ولم يرسلني متعنتا ‏\"‏ ‏.‏ قال قتادة صغت قلوبكما مالت قلوبكما‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported. I had always been anxious to ask 'Umar (Allah be pleased with him) about the two ladies amongst the wives of Allah's Prophet (may peace be upon Lim) about whom Allah, the Exalted, said:                     \" If you both turn in repentance to Allah, then indeed your hearts are inclined (to this)\" (Ixvi. 4), until 'Umar (Allah be pleased with him) set out for Hajj and I also went along with him. And as we were going along a path, 'Umar (Allah be pleased with hiyn) went aside and I also went aside with him with a jug (of water). He answered the call of nature, and then came to me and I poured water over his hands and he performed ablution I said: Commander of the Faithful, who are the two ladies amongst the wives of Allah's Prophet (may peace be upon him) about whom Allah, the Exalted and Majestic, said: 'If you both turn to Allah in repentance, then indeed your heart are inclined to it\"? 'Umar (Allah he pleased with him) said: How strange is it for you, Ibn 'Abbas! (Zuhri said: By Allah, he disliked what he asked about, but did not keep it a secret.) He ('Umar) said: They are Hafsa and 'A'isha; and he then began to narrate the hadith and said: We were such people among the Quraish who dominated women, and as we reached Medina we found there people who were dominated by their women, and our women began to learn (the habits) of their women. He further said: And my house was situated in the suburb of Aledina in the tribe of Banu Umayya b. Zaid. One day I became angry with my wife and she retorted upon me. I did not like that she should retort upon me. She said: You disapprove of my retorting upon you By Allah, the wives of Allah's Apostle (may peace be upon him) retort upon him, and one of them detaches herself from him for the day until the night. So I ('Umar) went out and visited Hafsa and said: Do you retort upon Allah's Messenger (may peace be upon him)? She said: Yes. I said; Does any one of you detach herself from him from the day to the night? She said: Yes. He said: She who did like it amongst you in fact failed and incurred loss. Does everyone amongst you not fear the wrath of Allah upon her due to the wrath of His Messenger (may peace be upon him), and (as a result thereof) she may perish? So do not retort upon Allah's Messenger (may peace be upon him) and do not ask him for anything, but ask me that which you desire, (and the frank behaviour) of your companion may not mislead you, if she is more graceful and is dearer to Allah's Messenger (may peace be upon him) than you (meaning 'A'isha) (Allah be pleased with her). He (Hadrat 'Umar further) said: I had a compalaion from the Ansar and, we used to remain in the company of the Messenger (may peace be upon him) turn by turn. He remained there for a day while I remained there on the other day, and he brought me the news about the revelation and other (matter), and I brought him (the news) like this. And we discussed that the Ghassanids were shoeing the horses in order to attack us. Id y companion once attended (the Apostle). and then came to me at night and knocked at my door and called me, and I came out to him, and he said: A matter of great importance has happened. I said: What is that? Have the Ghassanids come? He said: No, but even more serious and more significant than that: the Holy Prophet (may peace be upon him) has divorced his wives. I said: Hafsa has failed and has incurred loss. and I feared that it would happen. When it was dawn I observed the dawn prayer and dressed myself, and then came there (in the house of the Holy Prophet) and visited Hafsa, and she was weeping. I said: Has Allah's Messenger (may peace be upon him) divorced you (all)? She said: I do not know. He has, however, separated himself in his attic. I came to a black servant and said to him: Seek permission for 'Umar. He went in and then came to me and said: I made mention of you to him, but he kept quiet. I then went to the pulpit and sat there, and there was a group of people sitting by it and some of then were weeping. I sat there for some time, until I was overpowered (by that very idea) which was in my mind. I then came back to the boy and said to him: Seek permission for Umar. He went in and came to me and said: I made mention of you to him but he kept quiet. I was about to turn back when the boy called me and said: Go in; permission has been granted to you. I went in and greeted Allah's Messenger (may peace be upon him) and he was reclining against the couch of mat and it had left its marks upon his side. I said: Messenger of Allah, have you divorced your wives? He raised his head towards me and said: No. I said: Allah is the Greatest. Messenger of Allah, I wish if you had seen how we the people of Quraish had domination over women but when we came to Medina we found people whom their women dominated. So our women began to learn from their women. One dily I became angry with my wife and she began to retort upon me. I did not approve that she should retort upon me. She said: You do not like that I should retort upon you, but, by Allah. the wives of Allah's Apostle (may peace be upon him) retort upon him and any one of them separates herself from him for a day until night. I said: He who did that amongst them in fact failed and incurred loss. Does any of them feel sate from the wrath of Allahupon her due to the wrath of Allah's Messenger (may peace be upon him), and she has certainly perished. Allah's Messtnger (may peace be upon him) smiled, I said: Messenger of Allah, I visited Hafsa and said: (The behaviour) of your companion ('A'isha) may not mislead you, If she is more graceful than you and is dearer to Allah's Messenger (may peace be upon him) than you. Allah's Messenger (may peace be upon him) smiled for the second time. I said: Allah's Messenger, way I talk to you about agreeable things? He said: Yes. I sat down and lifted my head (to see things) in the house and, by Allah, I did not see anything significant besides three hides. I said: Messenger of Allah, supplicate the Lord that He should make (life) prosperous for your Ummah as He has made plentiful for the people of Persia and Rome (in spite of the fact) that they do no, worship Allah, the Exalted and Majestic, whereupon he (Allah's Messenger) sat up an I then said: Ibn Khattab, do you doubt that they are a nation whom their nice things have been given immediately in the life of this world. I said: Allah's Messenger! seek pardon for me. And he (Allah's Messenger) had taken an oath that he would not visit them for a month due to extreme annoyance with them until Allah showed His displeasure to him (Allah's Messenger). Zuhri said: 'Urwa informed me that 'A'Isha (Allah be pleased with her) said: When twenty-nine nights were over, Allah's Messenger (may peace be upon him) visited me, and he began (his visit) with me. I said: Messenger of Allah, you had taken an oath that you would not visit us for a month, while you have visited after I have counted only twenty-nine (nights). Thereupon he said: The month may also be of twenty-nine (days). He then said: 'A'isha, I am going to talk to you about a matter, and you should not be hasty in it (and do not give your final decision) until you have consulted your parents. He then recited this verse to me:\" O Prophet, say to your wives\" till he reached\" mighty reward\" (xxxiii. 28). 'A'isha (Allah be pleased with her) said: By Allah, he knew that my parents would not allow me to separate from him. I said: Is there any need to consult my parents in this matter? I in fact choose Allah and His Messenger (may peace be upon him) and the abode in the Hereafter. Ma'mar said: Ayyub reported to me that 'A'isha said: Don't inform your wives that I have chosen you, whereupon Allah's Apostle (may peace be upon him) said: Verily Allah has sent me as a conveyer of message, and He has not sent me as a source of hardship (to others). Qatada said:\" Saghat qulubukum\" means\" Your hearts have inclined.\"",
      "chain": [
        "30021",
        "30421",
        "30312",
        "20121",
        "20115",
        "11013",
        "11200",
        "17"
      ]
    },
    {
      "hadith_no": "3782",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا عمار بن، رزيق عن أبي إسحاق، عن الشعبي، عن فاطمة بنت قيس، قالت طلقني زوجي ثلاثا فأردت النقلة فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ انتقلي إلى بيت ابن عمك عمرو بن أم مكتوم فاعتدي عنده ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported:                      My husband divorced me with three pronouncements. I decided to move (from his house to another place). So I came to Allah's Messenger (may peace be upon him), and he said: Move to the house of your cousin 'Amr b. Umm Maktum and spend your period of 'Idda there.",
      "chain": [
        "30021",
        "20364",
        "20595",
        "11049",
        "11052",
        "224"
      ]
    },
    {
      "hadith_no": "3991",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا مخلد بن يزيد الجزري، حدثنا ابن، جريج أخبرني عطاء، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن المخابرة والمحاقلة والمزابنة وعن بيع الثمرة حتى تطعم ولا تباع إلا بالدراهم والدنانير إلا العرايا ‏.‏ قال عطاء فسر لنا جابر قال أما المخابرة فالأرض البيضاء يدفعها الرجل إلى الرجل فينفق فيها ثم يأخذ من الثمر ‏.‏ وزعم أن المزابنة بيع الرطب في النخل بالتمر كيلا ‏.‏ والمحاقلة في الزرع على نحو ذلك يبيع الزرع القائم بالحب كيلا ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) forbade Mukhabara and Muhaqala, and Muzabana, and the sale of the fruit until it is fit for eating, and its sale but with dirham and dinar. Exception is made in case of 'araya. Ata' said:                      Jabir explained (these terms) for us. As for Mukhabara it is this that a wasteland is given by a person to another and he makes an investment in it and then gets a share in the produce. According to him (Jabir), Muzabana is the sell of fresh dates on the tree for dry dates with a measure, and Muhaqala in agriculture implies that one should sell the standing crop for grains with a measure.",
      "chain": [
        "30021",
        "20462",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4136",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا روح بن عبادة، حدثنا ابن جريج، أخبرني ابن شهاب، عن سعيد بن المسيب، أنه حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قاتل الله اليهود حرم الله عليهم الشحوم فباعوها وأكلوا أثمانها‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30021",
        "20229",
        "11070",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "4199",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وعلي بن خشرم، قالا أخبرنا عيسى بن، يونس عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت اشترى رسول الله صلى الله عليه وسلم من يهودي طعاما ورهنه درعا من حديد ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Allah's Messenger (may peace be upon him) bought from a Jew grain (as loan) and pledged him his iron coat-of-mail.",
      "chain": [
        "30021",
        "30556",
        "20347",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4200",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا المخزومي، حدثنا عبد الواحد بن، زياد عن الأعمش، قال ذكرنا الرهن في السلم عند إبراهيم النخعي فقال حدثنا الأسود بن يزيد عن عائشة أن رسول الله صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل ورهنه درعا له من حديد ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) bought from a Jew grain for a specified time; and gave him iron coat-of-mail of his as a pledge.",
      "chain": [
        "30021",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4239",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى، - وهو ابن يونس - حدثنا زكرياء، عن أبي إسحاق، عن البراء، أن آخر، سورة أنزلت تامة سورة التوبة وأن آخر آية أنزلت آية الكلالة ‏.‏",
      "text_en": " Abu Ishaq said that he heard al-Bara' b. 'Azib (Allah be pleased with him) say:                      The last complete sura revealed (in the Holy Qur'an) is Sura Tauba (i e. al-Bara'at, ix.), and the last verse revealed is that pertaining to Kalala.",
      "chain": [
        "30021",
        "20347",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4487",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن منصور، عن إبراهيم، عن عبيد بن نضيلة الخزاعي، عن المغيرة بن شعبة، قال ضربت امرأة ضرتها بعمود فسطاط وهي حبلى فقتلتها - قال - وإحداهما لحيانية - قال - فجعل رسول الله صلى الله عليه وسلم دية المقتولة على عصبة القاتلة وغرة لما في بطنها ‏.‏ فقال رجل من عصبة القاتلة أنغرم دية من لا أكل ولا شرب ولا استهل فمثل ذلك يطل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ قال وجعل عليهم الدية ‏.‏",
      "text_en": " Al-Mughira b. Shu'ba reported that a woman struck her co-wife with a tent-pole and she was pregnant and she killed her. One of them belonged to the tribe of Lihyan. Allah's Messenger (may peace be upon him) made the relatives of the murderer responsible for the payment of blood-wit on her behalf, and fixed a slave or a female slave as the indemnity for what was in her womb. One of the persons amongst the relatives of the murderer said:                      Should we pay indemnity for one who, neither ate, nor drank, nor made any noise, who was just like a nonentity? Thereupon Allah's Messenger (may peace be upon him) remarked: He speaks rhymed phrases like the people of the desert. He did impose indemnity upon them.",
      "chain": [
        "30021",
        "20028",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4580",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن منصور، عن الشعبي، عن وراد، مولى المغيرة بن شعبة عن المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل حرم عليكم عقوق الأمهات ووأد البنات ومنعا وهات وكره لكم ثلاثا قيل وقال وكثرة السؤال وإضاعة المال ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported Allah's Messenger (may peace be upon him) as saying:                      Verity Allah, the Glorious and Majestic, has forbidden for you: disobedience to mothers, and burying alive daughters, withholding the right of others in spite of having the power to return that to them and demanding that (which is not one's legitimate right). And He disapproved three things for you; irrelevant talk, persistent questioning and wasting of wealth.",
      "chain": [
        "30021",
        "20028",
        "11067",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "4707",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وابن أبي عمر، ومحمد بن رافع، وعبد بن، حميد - واللفظ لابن رافع - قال ابن رافع وابن أبي عمر حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، أن أبا سفيان، أخبره من، فيه إلى فيه قال انطلقت في المدة التي كانت بيني وبين رسول الله صلى الله عليه وسلم قال فبينا أنا بالشأم إذ جيء بكتاب من رسول الله صلى الله عليه وسلم إلى هرقل يعني عظيم الروم - قال - وكان دحية الكلبي جاء به فدفعه إلى عظيم بصرى فدفعه عظيم بصرى إلى هرقل فقال هرقل هل ها هنا أحد من قوم هذا الرجل الذي يزعم أنه نبي قالوا نعم - قال - فدعيت في نفر من قريش فدخلنا على هرقل فأجلسنا بين يديه فقال أيكم أقرب نسبا من هذا الرجل الذي يزعم أنه نبي فقال أبو سفيان فقلت أنا ‏.‏ فأجلسوني بين يديه وأجلسوا أصحابي خلفي ثم دعا بترجمانه فقال له قل لهم إني سائل هذا عن الرجل الذي يزعم أنه نبي فإن كذبني فكذبوه ‏.‏ قال فقال أبو سفيان وايم الله لولا مخافة أن يؤثر على الكذب لكذبت ‏.‏ ثم قال لترجمانه سله كيف حسبه فيكم قال قلت هو فينا ذو حسب قال فهل كان من آبائه ملك قلت لا ‏.‏ قال فهل كنتم تتهمونه بالكذب قبل أن يقول ما قال قلت لا ‏.‏ قال ومن يتبعه أشراف الناس أم ضعفاؤهم قال قلت بل ضعفاؤهم ‏.‏ قال أيزيدون أم ينقصون قال قلت لا بل يزيدون ‏.‏ قال هل يرتد أحد منهم عن دينه بعد أن يدخل فيه سخطة له قال قلت لا ‏.‏ قال فهل قاتلتموه قلت نعم ‏.‏ قال فكيف كان قتالكم إياه قال قلت تكون الحرب بيننا وبينه سجالا يصيب منا ونصيب منه ‏.‏ قال فهل يغدر قلت لا ‏.‏ ونحن منه في مدة لا ندري ما هو صانع فيها ‏.‏ قال فوالله ما أمكنني من كلمة أدخل فيها شيئا غير هذه ‏.‏ قال فهل قال هذا القول أحد قبله قال قلت لا ‏.‏ قال لترجمانه قل له إني سألتك عن حسبه فزعمت أنه فيكم ذو حسب وكذلك الرسل تبعث في أحساب قومها ‏.‏ وسألتك هل كان في آبائه ملك فزعمت أن لا ‏.‏ فقلت لو كان من آبائه ملك قلت رجل يطلب ملك آبائه ‏.‏ وسألتك عن أتباعه أضعفاؤهم أم أشرافهم فقلت بل ضعفاؤهم وهم أتباع الرسل ‏.‏ وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فزعمت أن لا ‏.‏ فقد عرفت أنه لم يكن ليدع الكذب على الناس ثم يذهب فيكذب على الله ‏.‏ وسألتك هل يرتد أحد منهم عن دينه بعد أن يدخله سخطة له فزعمت أن لا ‏.‏ وكذلك الإيمان إذا خالط بشاشة القلوب ‏.‏ وسألتك هل يزيدون أو ينقصون فزعمت أنهم يزيدون وكذلك الإيمان حتى يتم ‏.‏ وسألتك هل قاتلتموه فزعمت أنكم قد قاتلتموه فتكون الحرب بينكم وبينه سجالا ينال منكم وتنالون منه ‏.‏ وكذلك الرسل تبتلى ثم تكون لهم العاقبة وسألتك هل يغدر فزعمت أنه لا يغدر ‏.‏ وكذلك الرسل لا تغدر ‏.‏ وسألتك هل قال هذا القول أحد قبله فزعمت أن لا ‏.‏ فقلت لو قال هذا القول أحد قبله قلت رجل ائتم بقول قيل قبله ‏.‏ قال ثم قال بم يأمر كم قلت يأمرنا بالصلاة والزكاة والصلة والعفاف قال إن يكن ما تقول فيه حقا فإنه نبي وقد كنت أعلم أنه خارج ولم أكن أظنه منكم ولو أني أعلم أني أخلص إليه لأحببت لقاءه ولو كنت عنده لغسلت عن قدميه وليبلغن ملكه ما تحت قدمى ‏.‏ قال ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرأه فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم من محمد رسول الله إلى هرقل عظيم الروم سلام على من اتبع الهدى أما بعد فإني أدعوك بدعاية الإسلام أسلم تسلم وأسلم يؤتك الله أجرك مرتين وإن توليت فإن عليك إثم الأريسيين و ‏{‏ يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون‏}‏ فلما فرغ من قراءة الكتاب ارتفعت الأصوات عنده وكثر اللغط وأمر بنا فأخرجنا ‏.‏ قال فقلت لأصحابي حين خرجنا لقد أمر أمر ابن أبي كبشة إنه ليخافه ملك بني الأصفر - قال - فما زلت موقنا بأمر رسول الله صلى الله عليه وسلم أنه سيظهر حتى أدخل الله على الإسلام ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Abbas who learnt the tradition personally from Abu Safyan. The latter said:                      I went out (on a mercantile venture) during the period (of truce) between me and the Messenger of Allah (may peace be upon him). While I was in Syria, the letter of the Messenger of Allah (may peace be upon him) was handed over to Hiraql (Ceasar), the Emperor of Rome (who was on a visit to Jerusalem at that time). The letter was brought by Dihya Kalbi who delivered it to the governor of Busra The governor passed it on to Hiraql, (On receiving the letter), he said: Is there anyone from the people of this man who thinks that he is a prophet. People said: Yes. So, I was called along with a few others from the Quraish. We were admitted to Hiraql and he seated usbefore him. He asked: Which of you has closer kinship with the man who thinks that he is a prophet? Abu Sufyan said: I. So they seated me in front of him and stated my companions behind me. Then, he called his interpreter and said to him: Tell them that I am going to ask this fellow (i. e. Abu Sufyan) about the man who thinks that he is a prophet. It he tells me a lie, then refute him. Abu Sufyan told (the narrator): By God, if there was not the fear that falsehood would be imputed to me I would have lied. (Then) Hiraqi said to his interpreter: Inquire from him about his ancestry, I said: He is of good ancestry among us. He asked: Has there been a king among his ancestors? I said: No. He asked: Did you accuse him of falsehood before he proclaimed his prophethood? I said: No. He asked: Who are his follower people of high status or low status? I said: (They are) of low status. He asked: Are they increasing in number or decreasing? I said. No. they are rather increasing. He asked: Does anyone give up his religion, being dissatisfied with it, after having embraced it? I said: No. He asked: Have you been at war with him? I said: Yes. He asked: How did you fare in that war? I said: The war between us and him has been wavering like a bucket, up at one turn and down at the other (i. e. the victory has been shared between us and him by turns). Sometimes he suffered loss at our hands and sometimes we suffered loss at his (hand). He asked: Has he (ever) violated his covenant? I said: No. but we have recently concluded a peace treaty with him for a petiod and we do not know what he is going to do about it. (Abu Sufyin said on oath that he could not interpolate in this dialogue anything from himself more than these words ) He asked: Did anyone make the proclamation (Of prophethood) before him? I said: No. He (now) said to his interpreter: Tell him, I asked him about his ancestry and he had replied that he had the best ancestry. This is the case with Prophets; they are the descendants of the noblest among their people (Addressing Abu Sufyan), he continued: I asked you if there had been a king among his ancestors. You said that there had been none. If there had been a king among his ancestors, I would have said that he was a man demanding his ancestral kingdom. I asked you about his followers whether they were people of high or low status, and you said that they were of rather low status. Such are the followers of the Prophets. I asked you whether you used to accuse him of falsehood before he proclaimed his prophethood, and you said that you did not. So I have understood that when he did not allow himself to tell a lie about the poeple, he would never go to the length of forging a falsehood about Allah. I asked you whether anyone renounced his religion being dissatisfied with it after he had embraced it, and you replied in the negative. Faith is like this when it enters the depth of the heart (it perpetuates them). I asked you whether his followers were increasing or decreasing. You said they were increasing. Faith is like this until it reaches its consummation. I asked you whether you had been at war with him, and you replied that you had been and that the victory between you and him had been shared by turns, sometimes he suffering loss at your hand and sometimes you suffering lost at his. This is how the Prophets are tried before the final victory its theirs. I asked you whether he (ever) violated his covenant, and you said that he did not. This is how the Prophets behave. They never violate (their covenants). I asked you whether anyone before him had proclaimed the same thing, and you replied in the negative. I said: If anyone had made the same proclamation before, I would have thought that he was a man following what had been proclaimed before. (Then) he asked: What does he enjoin upon you? I said: He exhorts us to offer Salat, to pay Zakat, to show due regard to kinship and to practise chastity. He said: It what you have told about him is true, he is certainly a Prophet. I knew that he was to appear but I did not think that he would be from among you. If I knew that I would be able to reach him. I would love to meet him; and it I had been with him. I would have washed his feet (out of reverence). His dominion would certainly extend to this place which is under my feet. Then he called for the letter of the Messenger of Allah (may pface be upon him) and read it. The letter ran as follows:\" In the name of Allah, Most Gracious and Most Merciful. From Muhammad, the Messenger of Allah, to Hiraql, the Emperor of the Romans. Peace be upon him who follows the guidance. After this, I extend to you the invitation to accept Islam. Embrace Islam and you will be safe. Accept Islam, God will give you double the reward. And if you turn away, upon you will be the sin of your subjects.\" O People of the Book, come to the word that is common between us that we should worship none other than Allah, should not ascribe any partner to Him and some of us should not take their fellows as Lords other than Allah. If they turn away, you should say that we testify to our being Muslims [iii. 64].\" When he hid finished the reading of the letter, noise and confused clamour was raise around him, and he ordered us to leave. Accordingly, we left. (Addressing my companions) while we were coming out (of the place). I said: Ibn Abu Kabsha (referring sarcastically to the Holy Prophet) has come to wield a great power. Lo! (even) the king of the Romans is afraid of him. I continued to believe that the authority of the Messenger of Allah (may peace be upon him) would triumph until God imbued me with (the spirit of) Islam.",
      "chain": [
        "30021",
        "30421",
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وأحمد بن جناب المصيصي، جميعا عن عيسى بن يونس، - واللفظ لإسحاق - أخبرنا عيسى بن يونس، أخبرنا زكرياء، عن أبي إسحاق، عن البراء، قال لما أحصر النبي صلى الله عليه وسلم عند البيت صالحه أهل مكة على أن يدخلها فيقيم بها ثلاثا ولا يدخلها إلا بجلبان السلاح السيف وقرابه ‏.‏ ولا يخرج بأحد معه من أهلها ولا يمنع أحدا يمكث بها ممن كان معه ‏.‏ قال لعلي ‏\"‏ اكتب الشرط بيننا بسم الله الرحمن الرحيم هذا ما قاضى عليه محمد رسول الله ‏\"‏ ‏.‏ فقال له المشركون لو نعلم أنك رسول الله تابعناك ولكن اكتب محمد بن عبد الله ‏.‏ فأمر عليا أن يمحاها فقال علي لا والله لا أمحاها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرني مكانها ‏\"‏ ‏.‏ فأراه مكانها فمحاها وكتب ‏\"‏ ابن عبد الله ‏\"‏ ‏.‏ فأقام بها ثلاثة أيام فلما أن كان يوم الثالث قالوا لعلي هذا آخر يوم من شرط صاحبك فأمره فليخرج ‏.‏ فأخبره بذلك فقال ‏\"‏ نعم ‏\"‏ ‏.‏ فخرج ‏.‏ وقال ابن جناب في روايته مكان تابعناك بايعناك ‏.‏",
      "text_en": " It has been narrated on the authority of Bara' who said:                      When the Prophet (may peace be upon him) was checked from going to the Ka'ba, the people of Mecca made peace with him'on the condition that he would (be allowed to) enter Mecca (next year) and stay there for three days, that he would not enter (the city) except with swords in their sheaths and arms encased in their covers, that he would not take eway with him anyone from its dwellers, nor would he prevent anyone from those with him to stay on in Mecca (if he so desired). He said to 'Ali: Write down the terms settled between us. (So 'Ali wrote): In the name of Allah, most Gracious and most Merciful. This is what Muhammad, the Messenger of Allah, has settled (with the Meccans), The polytheists said to him: If we knew that thou art the Messenger of of Allah, we would follow you. But write: Muhammad b. 'Abdullah. So he told 'Ali to strike out these words. 'Ali said: No, by Allah, I will not strike them out. The Messenger of Allah (may Peace be upon him) said: Show me their place (on the parchment). So he ('Ali) showed him their place and he (the Holy Prophet) struck them out; and 'Ali wrote: Ibn 'Abdullah. (According to the terms of the treaty, next year) the Holy Prophet (may peace be upon him) stayed there for three days When it was the third day, they said to 'Ali: This is the last day according to the terms of your companion. So tell him to leave. 'Ali informed the Prophet (may peace be upon him) accordingly. He said: Yes, and left (the city). Ibn Janab in his version of the tradition used:\" we would swear allegiance to you\" instead of\" we would follow you\".",
      "chain": [
        "30021",
        "20347",
        "20347",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4760",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن رافع، وعبد بن حميد، - واللفظ لابن رافع - قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن  الزهري، عن عروة، أن أسامة بن زيد، أخبره أن النبي صلى الله عليه وسلم ركب حمارا عليه إكاف تحته قطيفة فدكية وأردف وراءه أسامة وهو يعود سعد بن عبادة في بني الحارث بن الخزرج وذاك قبل وقعة بدر حتى مر بمجلس فيه أخلاط من المسلمين والمشركين عبدة الأوثان واليهود فيهم عبد الله بن أبى وفي المجلس عبد الله بن رواحة فلما غشيت المجلس عجاجة الدابة خمر عبد الله بن أبى أنفه بردائه ثم قال لا تغبروا علينا ‏.‏ فسلم عليهم النبي صلى الله عليه وسلم ثم وقف فنزل فدعاهم إلى الله وقرأ عليهم القرآن فقال عبد الله بن أبى أيها المرء لا أحسن من هذا إن كان ما تقول حقا فلا تؤذنا في مجالسنا وارجع إلى رحلك فمن جاءك منا فاقصص عليه ‏.‏ فقال عبد الله بن رواحة اغشنا في مجالسنا فإنا نحب ذلك ‏.‏ قال فاستب المسلمون والمشركون واليهود حتى هموا أن يتواثبوا فلم يزل النبي صلى الله عليه وسلم يخفضهم ثم ركب دابته حتى دخل على سعد بن عبادة فقال ‏\"‏ أى سعد ألم تسمع إلى ما قال أبو حباب - يريد عبد الله بن أبى - قال كذا وكذا ‏\"‏ ‏.‏ قال اعف عنه يا رسول الله واصفح فوالله لقد أعطاك الله الذي أعطاك ولقد اصطلح أهل هذه البحيرة أن يتوجوه فيعصبوه بالعصابة فلما رد الله ذلك بالحق الذي أعطاكه شرق بذلك فذلك فعل به ما رأيت ‏.‏ فعفا عنه النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated on the authority of Usama b. Zaid that the Prophet (may peace be upon him) rode a donkey. It had on it a saddle under which was a mattress made at Fadak (a place near Medina). Behind him he seated Usama. He was going to the street of Banu Harith al-Khazraj to inquire after the health of Sa'd b. Ubada This happened before the Battle of Badr. (He proceeded) until he passed by a mixed company of people in which were Muslims, polytheists, idol worshippers and the Jews and among them were 'Abdullah b. Ubayy and 'Abdullah b. Rawaha. When the dust raised by the hoofs of the animal spread over the company, 'Abdullah b. Ubayy covered his nose with his mantle and said:                      Do not scatter the dust over us (Not minding this remark), the Holy Prophet (may peace be upon him) greeted them, stopped, got down from his animal, invited them to Allah, and recited to them the Qur'an. 'Abdullah b. Ubayy said: O man, if what you say is the truth, the best thing for you would be not to bother us with it in our assemblies. Get back to your place. Whoso comes to you from us, tell him (all) this. Abdullah b. Rawaha said: Come to us in our gatherings, for we love (to hear) it. The narrator says: (At this), the Muslims, the polytheists and the Jews began to rebuke one another until they were determined to come to blows. The Holy Prophet (may peace be upon him) continued to pacify them. (When they were pacified), he rode his animal and came to Sa'd b. 'Ubida. He said: Sa'd, haven't you heard what Abu Hubab (meaning 'Abdullah b. Ubayy) has said? He has said so and so. Sa'd said: Messenger of Allah, forgive and pardon. God has granted you a sublime position, (but so far as he is concerned) the people of this settlement had-decided to make him their king by making him wear a crown and a turban (in token thereof), but God has circumvented this by the truth He has granted you. This has made him jealous and his jealousy (must have) prompted the behaviour that you have witnessed. So, the Holy Prophet (may peace upon him) forgave him.",
      "chain": [
        "30021",
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "10511",
        "50"
      ]
    },
    {
      "hadith_no": "4765",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وعبد الله بن محمد بن عبد الرحمن بن المسور، الزهري كلاهما عن ابن عيينة، - واللفظ للزهري - حدثنا سفيان، عن عمرو، سمعت جابرا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من لكعب بن الأشرف فإنه قد آذى الله ورسوله ‏\"‏ ‏.‏ فقال محمد بن مسلمة يا رسول الله أتحب أن أقتله قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال ائذن لي فلأقل قال ‏\"‏ قل ‏\"‏ ‏.‏ فأتاه فقال له وذكر ما بينهما وقال إن هذا الرجل قد أراد صدقة وقد عنانا ‏.‏ فلما سمعه قال وأيضا والله لتملنه ‏.‏ قال إنا قد اتبعناه الآن ونكره أن ندعه حتى ننظر إلى أى شىء يصير أمره - قال - وقد أردت أن تسلفني سلفا قال فما ترهنني قال ما تريد ‏.‏ قال ترهنني نساءكم قال أنت أجمل العرب أنرهنك نساءنا قال له ترهنوني أولادكم ‏.‏ قال يسب ابن أحدنا فيقال رهن في وسقين من تمر ‏.‏ ولكن نرهنك اللأمة - يعني السلاح - قال فنعم ‏.‏ وواعده أن يأتيه بالحارث وأبي عبس بن جبر وعباد بن بشر قال فجاءوا فدعوه ليلا فنزل إليهم قال سفيان قال غير عمرو قالت له امرأته إني لأسمع صوتا كأنه صوت دم قال إنما هذا محمد بن مسلمة ورضيعه وأبو نائلة إن الكريم لو دعي إلى طعنة ليلا لأجاب ‏.‏ قال محمد إني إذا جاء فسوف أمد يدي إلى رأسه فإذا استمكنت منه فدونكم قال فلما نزل نزل وهو متوشح فقالوا نجد منك ريح الطيب قال نعم تحتي فلانة هي أعطر نساء العرب ‏.‏ قال فتأذن لي أن أشم منه قال نعم فشم ‏.‏ فتناول فشم ثم قال أتأذن لي أن أعود قال فاستمكن من رأسه ثم قال دونكم ‏.‏ قال فقتلوه ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir that the Messenger of Allah (may peace be upon him) said:                      Who will kill Ka'b b. Ashraf? He has maligned Allah, the Exalted, and His Messenger. Muhammad b. Maslama said: Messenger of Allah, do you wish that I should kill him? He said: Yes. He said: Permit me to talk (to him in the way I deem fit). He said: Talk (as you like). So, Muhammad b. Maslama came to Ka'b and talked to him, referred to the old friendship between them and said: This man (i. e. the Holy Prophet) has made up his mind to collect charity (from us) and this has put us to a great hardship. When be heard this, Ka'b said: By God, you will be put to more trouble by him. Muhammad b. Maslama said: No doubt, now we have become his followers and we do not like to forsake him until we see what turn his affairs will take. I want that you should give me a loan. He said: What will you mortgage? He said: What do you want? He said: Pledge me your women. He said: You are the most handsome of the Arabs; should we pledge our women to you? He said: Pledge me your children. He said: The son of one of us may abuse us saying that he was pledged for two wasqs of dates, but we can pledge you (cur) weapons. He said: All right. Then Muhammad b. Maslama promised that he would come to him with Harith, Abu 'Abs b. Jabr and Abbad b. Bishr. So they came and called upon him at night. He came down to them. Sufyan says that all the narrators except 'Amr have stated that his wife said: I hear a voice which sounds like the voice of murder. He said: It is only Muhammad b. Maslama and his foster-brother, Abu Na'ila. When a gentleman is called at night even it to be pierced with a spear, he should respond to the call. Muhammad said to his companions: As he comes down, I will extend my hands towards his head and when I hold him fast, you should do your job. So when he came down and he was holding his cloak under his arm, they said to him: We sense from you a very fine smell. He said: Yes, I have with me a mistress who is the most scented of the women of Arabia. He said: Allow me to smell (the scent on your head). He said: Yes, you may smell. So he caught it and smelt. Then he said: Allow me to do so (once again). He then held his head fast and said to his companions: Do your job. And they killed him.",
      "chain": [
        "30021",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4850",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا الفضل بن موسى، حدثنا إسماعيل، بن أبي خالد أخبرنا قيس بن أبي حازم، قال سمعت عدي بن عميرة الكندي، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديثهم ‏.‏",
      "text_en": " Adi b. 'Amira al-Kindi heard Allah's Messenger (may peace be upon him) as saying (as) was narrated in the (above-mentioned) hadith.",
      "chain": [
        "30021",
        "20452",
        "11418",
        "11046",
        "5171"
      ]
    },
    {
      "hadith_no": "4910",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، عن يزيد بن يزيد بن جابر، عن رزيق بن حيان، عن مسلم بن قرظة، عن عوف بن مالك، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ خيار أئمتكم الذين تحبونهم ويحبونكم ويصلون عليكم وتصلون عليهم وشرار أئمتكم الذين تبغضونهم ويبغضونكم وتلعنونهم ويلعنونكم ‏\"‏ ‏.‏ قيل يا رسول الله أفلا ننابذهم بالسيف فقال ‏\"‏ لا ما أقاموا فيكم الصلاة وإذا رأيتم من ولاتكم شيئا تكرهونه فاكرهوا عمله ولا تنزعوا يدا من طاعة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of 'Auf b. Malik that the Messenger of Allah (may peace be upon him) said:                      The best of your rulers are those whom you love and who love you, who invoke God's blessings upon you and you invoke His blessings upon them. And the worst of your rulers are those whom you hate and who hate you and whom you curse and who curse you. It was asked (by those present): Shouldn't we overthrow them with the help of the sword? He said: No, as long as they establish prayer among you. If you then find anything detestable in them. You should hate their administration, but do not withdraw yourselves from their obedience.",
      "chain": [
        "30021",
        "20347",
        "20024",
        "10885",
        "10879",
        "10963",
        "10805"
      ]
    },
    {
      "hadith_no": "5005",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن الأعمش، عن أبي عمرو، الشيباني عن أبي مسعود الأنصاري، قال جاء رجل بناقة مخطومة فقال هذه في سبيل الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لك بها يوم القيامة سبعمائة ناقة كلها مخطومة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Mas'ud al-Ansari who said A man brought a muzzled she-camel and said:                      It is (offered) in the way of Allah. The Messenger of Allah (may peace be upon him) said: For this you will have seven hundred she-camels on the Day of Judgment all of which will be muzzled.",
      "chain": [
        "30021",
        "20028",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "5081",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن منصور، عن إبراهيم، عن  همام بن الحارث، عن عدي بن حاتم، قال قلت يا رسول الله إني أرسل الكلاب المعلمة فيمسكن على وأذكر اسم الله عليه فقال ‏\"‏ إذا أرسلت كلبك المعلم وذكرت اسم الله عليه فكل ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ما لم يشركها كلب ليس معها ‏\"‏ ‏.‏ قلت له فإني أرمي بالمعراض الصيد فأصيب فقال ‏\"‏ إذا رميت بالمعراض فخزق فكله وإن أصابه بعرضه فلا تأكله ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported:                      I said: Messenger of Allah, I set off trained dogs and they catch for me (the game) and I recite the came of Allah over it (I slaughter the game by reciting Bismillah-i-Allah-o-Akbar), whereupon he said: When you set off your trained dogs and you recited the name of Allah (while setting them off), then eat (the game). I said: Even if them (the trained dogs) kill that (the game)? He (the Holy Prophet) said: Even if these kill, but (on the condition) that no other dog, which you did not set off (along with your dogs), participates (in catching the game). I said to him: I throw Mi'rad, a heavy featherless blunt arrow, for hunting and killing (the game). Thereupon he said: When you throw Mi'rad, and it pierces, then eat, but if it falls flatly (and beats the game to death), then do not eat that.",
      "chain": [
        "30021",
        "20028",
        "11067",
        "11051",
        "11400",
        "212"
      ]
    },
    {
      "hadith_no": "5215",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا روح، حدثنا مالك، عن عبد الله بن، أبي بكر عن عبد الله بن واقد، قال نهى رسول الله صلى الله عليه وسلم عن أكل لحوم الضحايا بعد ثلاث ‏.‏ قال عبد الله بن أبي بكر فذكرت ذلك لعمرة فقالت صدق سمعت عائشة تقول دف أهل أبيات من أهل البادية حضرة الأضحى زمن رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ ادخروا ثلاثا ثم تصدقوا بما بقي ‏\"‏ ‏.‏ فلما كان بعد ذلك قالوا يا رسول الله إن الناس يتخذون الأسقية من ضحاياهم ويحملون منها الودك فقال رسول الله صلى الله عليه وسلم ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا نهيت أن تؤكل لحوم الضحايا بعد ثلاث ‏.‏ فقال ‏\"‏ إنما نهيتكم من أجل الدافة التي دفت فكلوا وادخروا وتصدقوا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Waqid reported:                      Allah's Messenger (may peace be upon him) forbade (people) to cat the flesh of sacrificed animals beyond three days. Abdullah b. Abu Bakr said, I made a mention of that to 'Amra, whereupon she said: He has told the truth, for I heard 'A'isha say: The poor among the people of the desert come (to the towns) on the occasion of Id al-Adha during the lifetime of Allah's Messenger (may peace be upon him). Upon this Allah's Messenger (may peace be upon him) said: Retain with you (the flesh) sufficing for three (days), and whatever is left out of that give in charity. After this. they (the Muslims) said: Allah's Messenger, the people make waterskins with the (hides) of their sacrificed animals and they melt fat out of them. Thereupon he said. What the then? They said: You forbade (us) to eat the flesh of sacrificial animals beyond threoq (days), whereupon he said: I forbade you for those (poor persons) who flocked (to the towns on this occasion for getting meat) but now when (this situation has improved) you may eat, preserve and give -in charity.",
      "chain": [
        "30021",
        "20229",
        "20001",
        "11104"
      ]
    },
    {
      "hadith_no": "5224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، رافع قالا حدثنا زيد بن حباب، ح وحدثنا  إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الرحمن بن مهدي، كلاهما عن معاوية بن صالح، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mu'awiya b. Salih with the same chain of transmitters.",
      "chain": [
        "30201",
        "20650",
        "30021"
      ]
    },
    {
      "hadith_no": "5379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى بن يونس، أخبرنا الأعمش، عن خيثمة بن عبد الرحمن، عن أبي حذيفة الأرحبي، عن حذيفة بن اليمان، قال كنا إذا دعينا مع رسول الله صلى الله عليه وسلم إلى طعام ‏.‏ فذكر بمعنى حديث أبي معاوية وقال ‏\"‏ كأنما يطرد ‏\"‏ ‏.‏ وفي الجارية ‏\"‏ كأنما تطرد ‏\"‏ ‏.‏ وقدم مجيء الأعرابي في حديثه قبل مجيء الجارية وزاد في آخر الحديث ثم ذكر اسم الله وأكل ‏.‏",
      "text_en": " Hudhaifa b. al-Yaman reported:                      When we were invited to a dinner with Allah's Messenger (may peace be upon him) ; the rest of hadith is the same but there is a slight variation of wording (and the variation is) that in that hadith the desert Arab precedes the arrival of that girl, and at the conclusion there is an addition (to this effect):\" He (the Holy Prophet) then mentioned the name of Allah and ate.\" This hadith is reported on the authority of A'mash with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30021",
        "20347",
        "11060",
        "11332",
        "145"
      ]
    },
    {
      "hadith_no": "5540",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وإسحاق بن إبراهيم الحنظلي، ويحيى بن حبيب، وحجاج بن الشاعر - واللفظ لابن حبيب - قال إسحاق أخبرنا وقال الآخرون، حدثنا روح بن عبادة، حدثنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول لبس النبي صلى الله عليه وسلم يوما قباء من ديباج أهدي له ثم أوشك أن نزعه فأرسل به إلى عمر بن الخطاب فقيل له قد أوشك ما نزعته يا رسول الله ‏.‏ فقال ‏\"‏ نهاني عنه جبريل ‏\"‏ ‏.‏ فجاءه عمر يبكي فقال يا رسول الله كرهت أمرا وأعطيتنيه فما لي قال ‏\"‏ إني لم أعطكه لتلبسه إنما أعطيتكه تبيعه ‏\"‏ ‏.‏ فباعه بألفى درهم ‏.‏",
      "text_en": " Jabir b. Abdullah reported that one day Allah's Apostle (may peace be upon him) put on a cloak made of brocade, which had been presented to him. He then quickly put it off and sent it to 'Umar b. Khattab, and it was said to him:                      Messenger of Allah. why is it that you put it of immediately. whereupon he said: Gabriel forbade me from it (i. e. wearing of Ods garment), and 'Umar came to him weeping and said: Messenger of Allah you disapproved a thing but you gave it to me. What about me, then? Thereupon be (the Holy Prophet) Wd: I did not give it to you to wear it, but I gave you that you might sell it; and so he (Hadrat Umar) sold it for two thousand dirhams.",
      "chain": [
        "30212",
        "30021",
        "38834",
        "30312",
        "20229",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5634",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا المخزومي، حدثنا وهيب، عن أبي،حازم بهذا الإسناد أن جبريل، وعد رسول الله صلى الله عليه وسلم أن يأتيه ‏.‏ فذكر الحديثولم يطوله كتطويل ابن أبي حازم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Hazim with the same chain of transmitters that Gabriel had promised Allah's Messenger (may peace be upon him) that he would come; the rest of the hadith is the same, but it is not so lengthy as the other one.",
      "chain": [
        "30021",
        "20299"
      ]
    },
    {
      "hadith_no": "5948",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الله بن الحارث، عن ابن، جريج أخبرني أبو الزبير، أنه سمع جابرا، يخبر عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن كان في شىء ففي الربع والخادم والفرس ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      If bad luck were to be in anything, it is found in the land, in the servant and in the horse.",
      "chain": [
        "30021",
        "912",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "6250",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا روح، حدثنا حماد بن سلمة، عن  عمار بن أبي عمار، عن ابن عباس، قال أقام رسول الله صلى الله عليه وسلم بمكة خمس عشرة سنة يسمع الصوت ويرى الضوء سبع سنين ولا يرى شيئا وثمان سنين يوحى إليه وأقام بالمدينة عشرا ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) stayed in Mecca for fifteen years (after his advent as a Prophet) and he heard the voice of Gabriel and saw his radiance for seven years but did not see any visible form, and then received revelation for ten years, and he stayed in Medina for ten years.",
      "chain": [
        "30021",
        "20229",
        "20021",
        "10951",
        "17"
      ]
    },
    {
      "hadith_no": "6254",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن الأعمش، عن عمرو، بن مرة عن أبي عبيدة، عن أبي موسى الأشعري، قال كان رسول الله صلى الله عليه وسلم يسمي لنا نفسه أسماء فقال ‏\"‏ أنا محمد وأحمد والمقفي والحاشر ونبي التوبة ونبي الرحمة ‏\"‏ ‏.‏",
      "text_en": " Abu Musa Ash'ari reported that Allah's Messenger (may peace be upon him) mentioned many names of his and said:                      I am Muhammad, Ahmad. Muqaffi (the last in succession), Hashir, the Prophet of repentance, and the Prophet of Mercy.",
      "chain": [
        "30021",
        "20028",
        "11060",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "hadith_no": "6313",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عمرو بن محمد الناقد، وإسحاق بن إبراهيم الحنظلي، وعبيد الله بن سعيد، ومحمد بن أبي عمر المكي كلهم عن ابن عيينة، - واللفظ لابن أبي عمر - حدثنا سفيان، بن عيينة حدثنا عمرو بن دينار، عن سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى عليه السلام صاحب بني إسرائيل ليس هو موسى صاحب الخضر عليه السلام ‏.‏ فقال كذب عدو الله سمعت أبى بن كعب يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قام موسى عليه السلام خطيبا في بني إسرائيل فسئل أى الناس أعلم فقال أنا أعلم ‏.‏ قال فعتب الله عليه إذ لم يرد العلم إليه فأوحى الله إليه أن عبدا من عبادي بمجمع البحرين هو أعلم منك قال موسى أى رب كيف لي به فقيل له احمل حوتا في مكتل فحيث تفقد الحوت فهو ثم ‏.‏ فانطلق وانطلق معه فتاه وهو يوشع بن نون فحمل موسى عليه السلام حوتا في مكتل وانطلق هو وفتاه يمشيان حتى أتيا الصخرة فرقد موسى عليه السلام وفتاه فاضطرب الحوت في المكتل حتى خرج من المكتل فسقط في البحر - قال - وأمسك الله عنه جرية الماء حتى كان مثل الطاق فكان للحوت سربا وكان لموسى وفتاه عجبا فانطلقا بقية يومهما وليلتهما ونسي صاحب موسى أن يخبره فلما أصبح موسى عليه السلام قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا - قال - ولم ينصب حتى جاوز المكان الذي أمر به ‏.‏ قال أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا ‏.‏ قال موسى ذلك ما كنا نبغي فارتدا على آثارهما قصصا ‏.‏ قال يقصان آثارهما حتى أتيا الصخرة فرأى رجلا مسجى عليه بثوب فسلم عليه موسى ‏.‏ فقال له الخضر أنى بأرضك السلام قال أنا موسى ‏.‏ قال موسى بني إسرائيل قال نعم ‏.‏ قال إنك على علم من علم الله علمكه الله لا أعلمه وأنا على علم من علم الله علمنيه لا تعلمه ‏.‏ قال له موسى عليه السلام هل أتبعك على أن تعلمني مما علمت رشدا قال إنك لن تستطيع معي صبرا وكيف تصبر على ما لم تحط به خبرا قال ستجدني إن شاء الله صابرا ولا أعصي لك أمرا ‏.‏ قال له الخضر فإن اتبعتني فلا تسألني عن شىء حتى أحدث لك منه ذكرا ‏.‏ قال نعم ‏.‏ فانطلق الخضر وموسى يمشيان على ساحل البحر فمرت بهما سفينة فكلماهم أن يحملوهما فعرفوا الخضر فحملوهما بغير نول فعمد الخضر إلى لوح من ألواح السفينة فنزعه فقال له موسى قوم حملونا بغير نول عمدت إلى سفينتهم فخرقتها لتغرق أهلها لقد جئت شيئا إمرا ‏.‏ قال ألم أقل إنك لن تستطيع معي صبرا قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا ثم خرجا من السفينة فبينما هما يمشيان على الساحل إذا غلام يلعب مع الغلمان فأخذ الخضر برأسه فاقتلعه بيده فقتله ‏.‏ فقال موسى أقتلت نفسا زاكية بغير نفس لقد جئت شيئا نكرا ‏.‏ قال ألم أقل لك إنك لن تستطيع معي صبرا قال وهذه أشد من الأولى ‏.‏ قال إن سألتك عن شىء بعدها فلا تصاحبني قد بلغت من لدني عذرا ‏.‏ فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض فأقامه ‏.‏ يقول مائل ‏.‏ قال الخضر بيده هكذا فأقامه ‏.‏ قال له موسى قوم أتيناهم فلم يضيفونا ولم يطعمونا لو شئت لتخذت عليه أجرا ‏.‏ قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحم الله موسى لوددت أنه كان صبر حتى يقص علينا من أخبارهما ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ كانت الأولى من موسى نسيانا ‏\"‏ ‏.‏ قال ‏\"‏ وجاء عصفور حتى وقع على حرف السفينة ثم نقر في البحر ‏.‏ فقال له الخضر ما نقص علمي وعلمك من علم الله إلا مثل ما نقص هذا العصفور من البحر ‏\"‏ ‏.‏ قال سعيد بن جبير وكان يقرأ وكان أمامهم ملك يأخذ كل سفينة صالحة غصبا ‏.‏ وكان يقرأ وأما الغلام فكان كافرا ‏.‏",
      "text_en": " Sa'id b. jubair reported:                      I said to Ibn Abbas that Nauf al-Bikali was of the opinion that Moses (peace be upon him), the Apostle of Bani Isra'il, was not the same who accompanied Khadir, whereupon he said: The enemy of Allah tells a lie. I heard Ubayy b. Ka'b say: Moses (peace be upon him) stood up to give sermon to the people of Isra'il. He was asked as to who amongst the people has the best knowledge, whereupon he said: I have the best knowledge. Thereupon Allah was annoyed with him that he did not attribute (the best knowledge) to Him. He revealed to him: A servant amongst My servants is at the junction of two rivers who has more knowledge than yours. Moses said: How can I meet him? It was said to him: Carry a fish in the large basket and the place where you find it missing there you will find him. Thereupon Moses proceeded forth along with a young man (Yusha'). Joshua b. Nan and Moses (peace be upon him) put the fish in the basket and there went along with him the young man (Yusha') until they came to a certain rock and Moses and his companion went to sleep and the fish stirred in that basket and fell into the ocean and Allah stopped the current of water like a vault until the way was made for the fish. Moses and his youn. companion were astonished and they walked for the rest of the day and the night and the friend of Moses forgot to inform him of this incident. When it was morning, Moses (peace be upon him) said to the young man: Bring for us the breakfast for we are dead tired because of this journey, and they did not feel exhausted until they had passed that place where they had been commanded (to stay). He said: Don't you know that when we reached the Sakhra (rock) I forgot the fisii and noth ng made me forget it but the satan that I. could nit remember it? How strange is it that the fish found a way in the river? Moses said: That was what we had been aiming at. Then both of them retraced their steps until they reached Sakhra; there they saw a man covered with a cloth. Moses greeted him. Khadir said to him: Where is as-Salam in our country.? He said: I am Moses, whereupon he (Khadir) said: You mean the Moses of Bani Isra'il? He said: Yes. He (Khadir) said: You have a knowledge out of the knowledge of Allah which in fact Allah imparted to you and about that I know nothing and I have knowledge out of Allah's knowledge which He imparted to me and about that you do not know. Moses (peace be upon him) said to him: May I follow you so that you may teach me that with which you have been taught righteousness. He said: You will not be able to bear with me; how you will be able to bear that about which you do not know? Moses said: Thou wilt find me patient, nor shalt I disobey you in aught. Khadir said to him: If you were to follow me, then do not ask me about anything until I myself speak to you about it. He said: Yes. So Khadir and Moses set forth on the bank of the river that there came before them a boat. Both of theni talked to them (the owners of the boat) so that they might carry both of them. They had recognised Khadir and they carried them free. Khadir thereupon took hold of a plank in the boat and broke it away. Moses said: These people have carried us without any charge and you attempt to break their boat so that the people sailing in the boat may drown. This is (something) grievous that you have done. He said: Did I not say that you would not bear with me? He said: Blame me not for what I forgot and be not hard upon what I did. Then both of them got down from the boat and began to walk along the coastline that they saw a boy who had been playing with other boys. Khadir pulled up his head and killed him. Moses said: Have you killed an innocent person who is in no way guilty of slaying another? You have done something horrible. Thereupon he said: Did I not say to you that you will not be able to bear with me? He (Moses) said: This (act) is more grievous than the first one. He (Moses) further said. If I ask you about anything after this, keep not company with me, then you would no doubt find (a plausible) excuse for this. Then they both walked on until they reached the inhabitants of a village. They asked its inhabitants for food but they refused to entertain them as their guests. They found in it a wall which had been bent on one side and was about to fall. Khadir set it right with his own hand. Moses, said to him: It is the people to whom we came but they showed us no hospitality and they did not serve us food. If you wish you can get wages for it. He (Khadir) said: This is the parting of ways between mt and you. Now I wish to reveal to you the significance of that for which you could not bear with me. Allah's Messenger (may peace be upon him) said. May Allah have mercy upon Moses! I wish if Moses could show patience and a (fuller) story of both of them could have been told. Allah's Messenger (may peace be upon him) said that the first thing which Moses said was out of forgetfulness. Then there came a sparrow until it perched on the wall of the boat and took water from the ocean. Thereupon, Khadir said: My knowledge and your knowledge in comparison with the knowledge of Allah is even less than the water taken by the sparrow in its beak in comparison to the water of the ocean, and Sa'id b. jubair used to recite (verses 79 and 80 of Sura Kahf) in this way: There was before them a king who used to seize every boat by force which was in order, the boy was an unbeliever.",
      "chain": [
        "30263",
        "30021",
        "20005",
        "11081",
        "11050"
      ]
    },
    {
      "hadith_no": "6451",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وحدثنا عبد بن حميد، كلاهما عن أبي نعيم، قال عبد حدثنا أبو نعيم، حدثنا عبد الواحد بن أيمن، حدثني ابن أبي مليكة، عن القاسم، بن محمد عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا خرج أقرع بين نسائه فطارت القرعة على عائشة وحفصة فخرجتا معه جميعا وكان رسول الله صلى الله عليه وسلم إذا كان بالليل سار مع عائشة يتحدث معها فقالت حفصة لعائشة ألا تركبين الليلة بعيري وأركب بعيرك فتنظرين وأنظر قالت بلى ‏.‏ فركبت عائشة على بعير حفصة وركبت حفصة على بعير عائشة فجاء رسول الله صلى الله عليه وسلم إلى جمل عائشة وعليه حفصة فسلم ثم صار معها حتى نزلوا فافتقدته عائشة فغارت فلما نزلوا جعلت تجعل رجلها بين الإذخر وتقول يا رب سلط على عقربا أو حية تلدغني رسولك ولا أستطيع أن أقول له شيئا ‏.‏",
      "text_en": " 'A'isha reported that when Allah's Messenger (may peace be upon him) set ont on a journey, he used to cast lots amongst his wives. Once this lot came out in my favour and that of Hafsa. They (Hafsi, and 'A'isha) both went along with him and Allah's Messenger (may peace be upon him) used to travel (on camel) when it was night along with 'A'isha and talked with her. Hafsa said to 'A'isha:                      Would you like to ride upon my camel tonight and allow me to ride upon your camel and you would see (what you do not generally see) and I would see (what I do not see) generally? She said: Yes. So 'A'isha rode upon the camel of Hafsa and Hafsa rode upon the camel of 'A'isha and Allah's Messenger (may peace be upon him) came near the camel of 'A'isha. (whereas) Hafsa had been riding over that. He greeted her and then rode with her until they came down. She ('A'isha) thus missed (the company of the Holy Prophet) and when they sat down, 'A'isha felt jealous. She put her foot in the grass and said: O Allah, let the scorpion sting me or the serpent bite me. And so far as thy Messenger is concerned, I cannot say anything about him.",
      "chain": [
        "30021",
        "30553",
        "20348",
        "20348",
        "11560",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "6480",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن رافع، - واللفظ لابن رافع - قال إسحاق أخبرنا وقال ابن رافع، حدثنا يحيى بن آدم، حدثنا ابن أبي زائدة، عن أبيه، عن أبي إسحاق، عن الأسود بن يزيد، عن أبي موسى، قال قدمت أنا وأخي، من اليمن فكنا حينا وما نرى ابن مسعود وأمه إلا من أهل بيت رسول الله صلى الله عليه وسلم من كثرة دخولهم ولزومهم له ‏.‏",
      "text_en": " Abu Musa reported:                      When I and my brother came from Yemen we used to consider Ibn Mas'ud and his mother amongst the members of the household. of Allah's Messenger (may peace be upon him) because of their visiting them frequently and staying there for long (periods of) time.",
      "chain": [
        "30021",
        "30375",
        "30312",
        "20364",
        "20366",
        "11338",
        "11049",
        "11054",
        "41"
      ]
    },
    {
      "hadith_no": "6486",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبدة بن سليمان، حدثنا الأعمش، عن شقيق، عن عبد الله، أنه قال ‏{‏ ومن يغلل يأت بما غل يوم القيامة‏}‏ ثم قال على قراءة من تأمروني أن أقرأ فلقد قرأت على رسول الله صلى الله عليه وسلم بضعا وسبعين سورة ولقد علم أصحاب رسول الله صلى الله عليه وسلم أني أعلمهم بكتاب الله ولو أعلم أن أحدا أعلم مني لرحلت إليه ‏.‏ قال شقيق فجلست في حلق أصحاب محمد صلى الله عليه وسلم فما سمعت أحدا يرد ذلك عليه ولا يعيبه ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported that he (said to his companions to conceal their copies of the Qur'an) and further said:                      He who conceals anything he shall have to bring that which he had concealed on the Day of judgment, and then said: After whose mode of recitation you command me to recite? I in fact recited before AIlah's Messenger (may peace be upon him) more than seventy chapters of the Qur'an and the Companions of Allah's Messenger (may peace be upon him) know it that I have better understanding of the Book of Allah (than they do), and if I were to know that someone had better understanding than I, I would have gone to him. Shaqiq said: I sat in the company of the Companions of Mubkmmad (may peace be upon him) but I did not hear anyone having rejected that (that is, his recitation) or finding fault with it.",
      "chain": [
        "30021",
        "20337",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6514",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا النضر بن شميل، حدثنا سليمان، بن المغيرة حدثنا حميد بن هلال، بهذا الإسناد وزاد بعد قوله قلت فاكفني حتى أذهب فأنظر ‏.‏ قال نعم وكن على حذر من أهل مكة فإنهم قد شنفوا له وتجهموا ‏.‏",
      "text_en": " This hadlth has been narrated on the authority of Humaid b. Hilal with the same chain of transmitters but with this addition:                     \" As I came to Mecca, Unais said: (Well), go but be on your guard against the Meccans for they are his enemies and are annoyed with him.\"",
      "chain": [
        "30021",
        "20291",
        "20236",
        "11281"
      ]
    },
    {
      "hadith_no": "6569",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وأحمد بن عبدة، - واللفظ لإسحاق - قالا أخبرنا سفيان، عن عمرو، عن جابر بن عبد الله، قال فينا نزلت ‏{‏ إذ همت طائفتان منكم أن تفشلا والله وليهما‏}‏ بنو سلمة وبنو حارثة وما نحب أنها لم تنزل لقول الله عز وجل ‏{‏ والله وليهما‏}‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that it was concerning them (the Ansar) that this verse was revealed, that when the two groups amongst you were about to lose heart and Allah was the Guardian of them both. This concerned Banu Salama and Banu Haritha and we did not like that Allah, the Exalted and Glorious, should not have revealed this verse for the fact that Allah (gave an assurance) of being the Guardian of both.",
      "chain": [
        "30021",
        "30423",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "6633",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم الحنظلي، قال إسحاق أخبرنا  وقال، عثمان حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال سئل رسول الله صلى الله عليه وسلم أى الناس خير قال ‏\"‏ قرني ثم الذين يلونهم ثم الذين يلونهم ثم يجيء قوم تبدر شهادة أحدهم يمينه وتبدر يمينه شهادته ‏\"‏ ‏.‏ قال إبراهيم كانوا ينهوننا ونحن غلمان عن العهد والشهادات ‏.‏",
      "text_en": " Abdullah reported:                      It was asked from Allah's Apostle (may peace be upon him) who amongst the people were the best. He said: (People) of my generation, then those next to them, then those next to them, then there would come a people whose evidence would precede their oath and their oath would precede their evidence. Ibrahim said: They forbade us to make vows and bear witness when we were too young.",
      "chain": [
        "30203",
        "30021",
        "30312",
        "30203",
        "20028",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "6656",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن المثنى، ومحمد بن بشار، - قال إسحاق أخبرنا وقال الآخران، حدثنا - واللفظ، لابن المثنى - حدثنا معاذ بن هشام، حدثني  أبي، عن قتادة، عن زرارة بن أوفى، عن أسير بن جابر، قال كان عمر بن الخطاب إذا أتى عليه أمداد أهل اليمن سألهم أفيكم أويس بن عامر حتى أتى على أويس فقال أنت أويس بن عامر قال نعم ‏.‏ قال من مراد ثم من قرن قال نعم ‏.‏ قال فكان بك برص فبرأت منه إلا موضع درهم قال نعم ‏.‏ قال لك والدة قال نعم ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يأتي عليكم أويس بن عامر مع أمداد أهل اليمن من مراد ثم من قرن كان به برص فبرأ منه إلا موضع درهم له والدة هو بها بر لو أقسم على الله لأبره فإن استطعت أن يستغفر لك فافعل ‏\"‏ ‏.‏ فاستغفر لي ‏.‏ فاستغفر له ‏.‏ فقال له عمر أين تريد قال الكوفة ‏.‏ قال ألا أكتب لك إلى عاملها قال أكون في غبراء الناس أحب إلى ‏.‏ قال فلما كان من العام المقبل حج رجل من أشرافهم فوافق عمر فسأله عن أويس قال تركته رث البيت قليل المتاع ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يأتي عليكم أويس بن عامر مع أمداد أهل اليمن من مراد ثم من قرن كان به برص فبرأ منه إلا موضع درهم له والدة هو بها بر لو أقسم على الله لأبره فإن استطعت أن يستغفر لك فافعل ‏\"‏ ‏.‏ فأتى أويسا فقال استغفر لي ‏.‏ قال أنت أحدث عهدا بسفر صالح فاستغفر لي ‏.‏ قال استغفر لي ‏.‏ قال أنت أحدث عهدا بسفر صالح فاستغفر لي ‏.‏ قال لقيت عمر قال نعم ‏.‏ فاستغفر له ‏.‏ ففطن له الناس فانطلق على وجهه ‏.‏ قال أسير وكسوته بردة فكان كلما رآه إنسان قال من أين لأويس هذه البردة",
      "text_en": " Usair b. Jabir reported that when people from Yemen came to help (the Muslim army at the time of jihad) he asked them:                      Is there amongst you Uwais b. 'Amir? (He continued finding him out) until he met Uwais. He said: Are you Uwais b., Amir? He said: Yes. He said: Are you from the tribe of Qaran? He said: Yes. He (Hadrat) 'Umar (again) said: Did you suffer from leprosy and then you were cured from it but for the space of a dirham? He said: Yes. He ('Umar) said: Is your mother (living)? He said: Yes. He ('Umar) said: I heard Allah's Messenger (may peace be upon him) say: There would come to you Uwais b. Amir with the reinforcement from the people of Yemen. (He would be) from Qaran, (the branch) of Murid. He had been suffering from leprosy from which he was cured but for a spot of a dirham. His treatment with his mother would have been excellent. If he were to take an oath in the name of Allah, He would honour that. And if it is possible for you, then do ask him to beg forgiveness for you (from your Lord). So he (Uwais) begged forgiveness for him. Umar said: Where do you intend to go? He said: To Kufa. He ('Umar) said: Let me write a letter for you to its governor, whereupon he (Uwais) said: I love to live amongst the poor people. When it was the next year, a person from among the elite (of Kufa) performed Hajj and he met Umar. He asked him about Uwais. He said: I left him in a state with meagre means of sustenance. (Thereupon) Umar said: I heard Allah's Messenger (may peace be upon him) as saying: There would come to you Uwais b. 'Amir, of Qaran, a branch (of the tribe) of Murid, along with the reinforcement of the people of Yemen. He had been suffering from leprosy which would have been cured but for the space of a dirham. His treatment with his mother would have been very kind. If he would take an oath in the name of Allah (for something) He would honour it. Ask him to beg forgiveness for you (from Allah) in case it is possible for you. So he came to Uwais and said.: Beg forgiveness (from Allah) for me. He (Uwais) said: You have just come from a sacred journey (Hajj) ; you, therefore, ask forgiveness for me. He (the person who had performed Hajj) said: Ask forgiveness for me (from Allah). He (Uwais again) said: You have just come from the sacred journey, so you ask forgiveness for me. (Uwais further) said: Did you meet Umar? He said: Yes. He (Uwais) then begged forgiveness for him (from Allah). So the people came to know about (the status of religious piety) of Uwais. He went away (from that place). Usair said: His clothing consisted of a mantle, and whosoever saw him said: From where did Uwais get this mantle?",
      "chain": [
        "30021",
        "30170",
        "30160",
        "30312",
        "20287",
        "20295",
        "11019",
        "11284"
      ]
    },
    {
      "hadith_no": "6698",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا  سفيان، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا حاجب، بن الوليد حدثنا محمد بن حرب، عن الزبيدي، ح وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد، بن رافع وعبد بن حميد عن عبد الرزاق، عن معمر، كلهم عن الزهري، بإسناد مالك ومثل حديثه إلا قوله ‏\"‏ فيعرض هذا ويعرض هذا ‏\"‏ ‏.‏ فإنهم جميعا قالوا في حديثهم غير مالك ‏\"‏ فيصد هذا ويصد هذا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri with a slight variation of wording (and the words are):                     \" The one turning away and the other turning away when they meet and one avoids the other and the other also avoids him.\"",
      "chain": [
        "30367",
        "20005",
        "30487",
        "20029",
        "20475",
        "30373",
        "20459",
        "30021",
        "30375",
        "20121"
      ]
    },
    {
      "hadith_no": "6806",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح وحدثنا إسحاق بن، إبراهيم الحنظلي أخبرنا عيسى بن يونس، كلاهما عن الأعمش، بهذا الإسناد ‏.‏ ولم يذكر في حديث عيسى ‏\"‏ ويتحرى الصدق ويتحرى الكذب ‏\"‏ ‏.‏ وفي حديث ابن مسهر ‏\"‏ حتى يكتبه الله ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of A'mash with the same chain of transmitters and no mention is made in the hadith transmitted on the authority of 'Isa (of these words):                     \" He who endeavours to tell the truth and endeavours to tell a lie,\" and in the hadith transmitted on the authority of Mushir (the words are):\" Until Allah records it\".",
      "chain": [
        "30479",
        "30021",
        "20347"
      ]
    },
    {
      "hadith_no": "6909",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا عثمان بن عمر، حدثنا عزرة بن، ثابت عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الدئلي، قال قال لي عمران بن الحصين أرأيت ما يعمل الناس اليوم ويكدحون فيه أشىء قضي عليهم ومضى عليهم من قدر ما سبق أو فيما يستقبلون به مما أتاهم به نبيهم وثبتت الحجة عليهم فقلت بل شىء قضي عليهم ومضى عليهم قال فقال أفلا يكون ظلما قال ففزعت من ذلك فزعا شديدا وقلت كل شىء خلق الله وملك يده فلا يسأل عما يفعل وهم يسألون ‏.‏ فقال لي يرحمك الله إني لم أرد بما سألتك إلا لأحزر عقلك إن رجلين من مزينة أتيا رسول الله صلى الله عليه وسلم فقالا يا رسول الله أرأيت ما يعمل الناس اليوم ويكدحون فيه أشىء قضي عليهم ومضى فيهم من قدر قد سبق أو فيما يستقبلون به مما أتاهم به نبيهم وثبتت الحجة عليهم فقال ‏\"‏ لا بل شىء قضي عليهم ومضى فيهم وتصديق ذلك في كتاب الله عز وجل ‏{‏ ونفس وما سواها * فألهمها فجورها وتقواها‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Abu al-Aswad reported that 'Imran b Husain asked him:                      What is your view, what the people do today in the world, and strive for, is it something decreed for them or preordained for them or will their fate in the Hereafter be deterrained by the fact that their Prophets brought them teaching which they did not act upon? I said: Of course, it is something which is predetermined for them and preordained for them. He (further) said: Then, would it not be an injustice (to punish them)? I felt greatly disturbed because of that, and said: Everything is created by Allah and lies in His Power. He would not be questioned as to what He does, but they would be questioned; thereupon he said to me: May Allah have mercy upon you, I did not mean to ask you but for testing your intelligence. Two men of the tribe of Muzaina came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, what is your opinion that the people do in the world and strive for, is something decreed for them; something preordained for them and will their fate in the Hereafter be determined by the fact that their Prophets brought them teachings which they did not act upon. and thus they became deserving of punishment? Thereupon, he said: Of course, it happens as it is decreed by Destiny and preordained for them, and this view is confirmed by this verse of the Book of Allah, the Exalted and Glorious:\" Consider the soul and Him Who made it perfect, then breathed into it its sin and its piety\" (xci. 8).",
      "chain": [
        "30021",
        "20262",
        "20561",
        "10726",
        "11316"
      ]
    },
    {
      "hadith_no": "6943",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وحجاج بن الشاعر، - واللفظ لحجاج - قال إسحاق أخبرنا وقال، حجاج حدثنا عبد الرزاق، أخبرنا الثوري، عن علقمة بن مرثد، عن المغيرة بن عبد الله اليشكري، عن معرور بن سويد، عن عبد الله بن مسعود، قال قالت أم حبيبة اللهم متعني بزوجي رسول الله صلى الله عليه وسلم وبأبي أبي سفيان وبأخي معاوية ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إنك سألت الله لآجال مضروبة وآثار موطوءة وأرزاق مقسومة لا يعجل شيئا منها قبل حله ولا يؤخر منها شيئا بعد حله ولو سألت الله أن يعافيك من عذاب في النار وعذاب في القبر لكان خيرا لك ‏\"‏ ‏.‏ قال فقال رجل يا رسول الله القردة والخنازير هي مما مسخ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله عز وجل لم يهلك قوما أو يعذب قوما فيجعل لهم نسلا وإن القردة والخنازير كانوا قبل ذلك ‏\"‏ ‏.‏  حدثنيه أبو داود، سليمان بن معبد حدثنا الحسين بن حفص، حدثنا سفيان، بهذا الإسناد غير أنه قال ‏\"‏ وآثار مبلوغة ‏\"‏ ‏.‏ قال ابن معبد وروى بعضهم ‏\"‏ قبل حله ‏\"‏ ‏.‏ أى نزوله ‏.‏",
      "text_en": " Ibn Mas'dd reported that Umm Habiba said:                      0 Allah, enable me to derive benefit from my husband, Allah's Messenger (may peace be upon him), and from my father Abu Sufyan, and from my brother Mu'awiya. Allah's Messenger (may peace be upon him) said to her: Verily, you have asked Allah about the durations of life already set, and the steps which you would take, and the sustenances the share of which is fixed. Nothing would take place earlier than its due time, and nothing would be deferred beyond that when it is due. So, if you were to ask Allah about your safety from the torment of Hell-Fire and from the torment of the grave, it would have been better for you. A person said: Allah's Messenger, what about those apes and swine which suffered metamorphosis? Thereupon Allah's Apostle (may peace be upon him) said: Verily, Allah, the Exalted and Glorious, did not destroy a people or did not torment a people, and let their race grow. Apes and swine had been even before that (when the deniers of truth were tormented and suffered metamorphosis). This hadith has been narrated on the authority of Sufyin through another chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30021",
        "38834",
        "30312",
        "20219",
        "20121",
        "20012",
        "11374",
        "10829",
        "16"
      ]
    },
    {
      "hadith_no": "7003",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرني جرير، عن مطرف، بهذا الإسناد نحو حديث عبثر ‏.‏",
      "text_en": " This hadith has been reported on the authority of Mutarrif with the same chain of transmitters.",
      "chain": [
        "30021",
        "20028"
      ]
    },
    {
      "hadith_no": "7196",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله بن المبارك، أخبرنا يونس بن يزيد، الأيلي ح وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن رافع، وعبد بن حميد، قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، والسياق، حديث معمر من رواية عبد وابن رافع قال يونس ومعمر جميعا عن الزهري أخبرني سعيد بن المسيب وعروة بن الزبير وعلقمة بن وقاص وعبيد الله بن عبد الله بن عتبة بن مسعود عن حديث عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله مما قالوا وكلهم حدثني طائفة من حديثها وبعضهم كان أوعى لحديثها من بعض وأثبت اقتصاصا وقد وعيت عن كل واحد منهم الحديث الذي حدثني وبعض حديثهم يصدق بعضا ذكروا أن عائشة زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج سفرا أقرع بين نسائه فأيتهن خرج سهمها خرج بها رسول الله صلى الله عليه وسلم معه - قالت عائشة - فأقرع بيننا في غزوة غزاها فخرج فيها سهمي فخرجت مع رسول الله صلى الله عليه وسلم وذلك بعد ما أنزل الحجاب فأنا أحمل في هودجي وأنزل فيه مسيرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوه وقفل ودنونا من المدينة آذن ليلة بالرحيل فقمت حين آذنوا بالرحيل فمشيت حتى جاوزت الجيش فلما قضيت من شأني أقبلت إلى الرحل فلمست صدري فإذا عقدي من جزع ظفار قد انقطع فرجعت فالتمست عقدي فحبسني ابتغاؤه وأقبل الرهط الذين كانوا يرحلون لي فحملوا هودجي فرحلوه على بعيري الذي كنت أركب وهم يحسبون أني فيه - قالت - وكانت النساء إذ ذاك خفافا لم يهبلن ولم يغشهن اللحم إنما يأكلن العلقة من الطعام فلم يستنكر القوم ثقل الهودج حين رحلوه ورفعوه وكنت جارية حديثة السن فبعثوا الجمل وساروا ووجدت عقدي بعد ما استمر الجيش فجئت منازلهم وليس بها داع ولا مجيب فتيممت منزلي الذي كنت فيه وظننت أن القوم سيفقدوني فيرجعون إلى فبينا أنا جالسة في منزلي غلبتني عيني فنمت وكان صفوان بن المعطل السلمي ثم الذكواني قد عرس من وراء الجيش فادلج فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني فعرفني حين رآني وقد كان يراني قبل أن يضرب الحجاب على فاستيقظت باسترجاعه حين عرفني فخمرت وجهي بجلبابي ووالله ما يكلمني كلمة ولا سمعت منه كلمة غير استرجاعه حتى أناخ راحلته فوطئ على يدها فركبتها فانطلق يقود بي الراحلة حتى أتينا الجيش بعد ما نزلوا موغرين في نحر الظهيرة فهلك من هلك في شأني وكان الذي تولى كبره عبد الله بن أبى ابن سلول فقدمنا المدينة فاشتكيت حين قدمنا المدينة شهرا والناس يفيضون في قول أهل الإفك ولا أشعر بشىء من ذلك وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي إنما يدخل رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏ ‏.‏ فذاك يريبني ولا أشعر بالشر حتى خرجت بعد ما نقهت وخرجت معي أم مسطح قبل المناصع وهو متبرزنا ولا نخرج إلا ليلا إلى ليل وذلك قبل أن نتخذ الكنف قريبا من بيوتنا وأمرنا أمر العرب الأول في التنزه وكنا نتأذى بالكنف أن نتخذها عند بيوتنا فانطلقت أنا وأم مسطح وهي بنت أبي رهم بن المطلب بن عبد مناف وأمها ابنة صخر بن عامر خالة أبي بكر الصديق وابنها مسطح بن أثاثة بن عباد بن المطلب فأقبلت أنا وبنت أبي رهم قبل بيتي حين فرغنا من شأننا فعثرت أم مسطح في مرطها فقالت تعس مسطح ‏.‏ فقلت لها بئس ما قلت أتسبين رجلا قد شهد بدرا ‏.‏ قالت أى هنتاه أولم تسمعي ما قال قلت وماذا قال قالت فأخبرتني بقول أهل الإفك فازددت مرضا إلى مرضي فلما رجعت إلى بيتي فدخل على رسول الله صلى الله عليه وسلم فسلم ثم قال ‏\"‏ كيف تيكم ‏\"‏ ‏.‏ قلت أتأذن لي أن آتي أبوى قالت وأنا حينئذ أريد أن أتيقن الخبر من قبلهما ‏.‏ فأذن لي رسول الله صلى الله عليه وسلم فجئت أبوى فقلت لأمي يا أمتاه ما يتحدث الناس فقالت يا بنية هوني عليك فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا كثرن عليها - قالت - قلت سبحان الله وقد تحدث الناس بهذا قالت فبكيت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم ثم أصبحت أبكي ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يستشيرهما في فراق أهله - قالت - فأما أسامة بن زيد فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله وبالذي يعلم في نفسه لهم من الود فقال يا رسول الله هم أهلك ولا نعلم إلا خيرا ‏.‏ وأما علي بن أبي طالب فقال لم يضيق الله عليك والنساء سواها كثير وإن تسأل الجارية تصدقك - قالت - فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة هل رأيت من شىء يريبك من عائشة ‏\"‏ ‏.‏ قالت له بريرة والذي بعثك بالحق إن رأيت عليها أمرا قط أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن عجين أهلها فتأتي الداجن فتأكله - قالت - فقام رسول الله صلى الله عليه وسلم على المنبر فاستعذر من عبد الله بن أبى ابن سلول - قالت - فقال رسول الله صلى الله عليه وسلم وهو على المنبر ‏\"‏ يا معشر المسلمين من يعذرني من رجل قد بلغ أذاه في أهل بيتي فوالله ما علمت على أهلي إلا خيرا ولقد ذكروا رجلا ما علمت عليه إلا خيرا وما كان يدخل على أهلي إلا معي ‏\"‏ ‏.‏ فقام سعد بن معاذ الأنصاري فقال أنا أعذرك منه يا رسول الله إن كان من الأوس ضربنا عنقه وإن كان من إخواننا الخزرج أمرتنا ففعلنا أمرك - قالت - فقام سعد بن عبادة وهو سيد الخزرج وكان رجلا صالحا ولكن اجتهلته الحمية فقال لسعد بن معاذ كذبت لعمر الله لا تقتله ولا تقدر على قتله ‏.‏ فقام أسيد بن حضير وهو ابن عم سعد بن معاذ فقال لسعد بن عبادة كذبت لعمر الله لنقتلنه فإنك منافق تجادل عن المنافقين فثار الحيان الأوس والخزرج حتى هموا أن يقتتلوا ورسول الله صلى الله عليه وسلم قائم على المنبر فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت - قالت - وبكيت يومي ذلك لا يرقأ لي دمع ولا أكتحل بنوم ثم بكيت ليلتي المقبلة لا يرقأ لي دمع ولا أكتحل بنوم وأبواى يظنان أن البكاء فالق كبدي فبينما هما جالسان عندي وأنا أبكي استأذنت على امرأة من الأنصار فأذنت لها فجلست تبكي - قالت - فبينا نحن على ذلك دخل علينا رسول الله صلى الله عليه وسلم فسلم ثم جلس - قالت - ولم يجلس عندي منذ قيل لي ما قيل وقد لبث شهرا لا يوحى إليه في شأني بشىء - قالت - فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد يا عائشة فإنه قد بلغني عنك كذا وكذا فإن كنت بريئة فسيبرئك الله وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه فإن العبد إذا اعترف بذنب ثم تاب تاب الله عليه ‏\"‏ ‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة فقلت لأبي أجب عني رسول الله صلى الله عليه وسلم فيما قال ‏.‏ فقال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت لأمي أجيبي عني رسول الله صلى الله عليه وسلم فقالت والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن إني والله لقد عرفت أنكم قد سمعتم بهذا حتى استقر في نفوسكم وصدقتم به فإن قلت لكم إني بريئة والله يعلم أني بريئة لا تصدقوني بذلك ولئن اعترفت لكم بأمر والله يعلم أني بريئة لتصدقونني وإني والله ما أجد لي ولكم مثلا إلا كما قال أبو يوسف فصبر جميل والله المستعان على ما تصفون ‏.‏ قالت ثم تحولت فاضطجعت على فراشي - قالت - وأنا والله حينئذ أعلم أني بريئة وأن الله مبرئي ببراءتي ولكن والله ما كنت أظن أن ينزل في شأني وحى يتلى ولشأني كان أحقر في نفسي من أن يتكلم الله عز وجل في بأمر يتلى ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها قالت فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه ولا خرج من أهل البيت أحد حتى أنزل الله عز وجل على نبيه صلى الله عليه وسلم فأخذه ما كان يأخذه من البرحاء عند الوحى حتى إنه ليتحدر منه مثل الجمان من العرق في اليوم الشات من ثقل القول الذي أنزل عليه - قالت - فلما سري عن رسول الله صلى الله عليه وسلم وهو يضحك فكان أول كلمة تكلم بها أن قال ‏\"‏ أبشري يا عائشة أما الله فقد برأك ‏\"‏ ‏.‏ فقالت لي أمي قومي إليه فقلت والله لا أقوم إليه ولا أحمد إلا الله هو الذي أنزل براءتي - قالت - فأنزل الله عز وجل ‏{‏ إن الذين جاءوا بالإفك عصبة منكم‏}‏ عشر آيات فأنزل الله عز وجل هؤلاء الآيات براءتي - قالت - فقال أبو بكر وكان ينفق على مسطح لقرابته منه وفقره والله لا أنفق عليه شيئا أبدا بعد الذي قال لعائشة ‏.‏ فأنزل الله عز وجل ‏{‏ ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ إلى قوله ‏{‏ ألا تحبون أن يغفر الله لكم‏}‏ قال حبان بن موسى قال عبد الله بن المبارك هذه أرجى آية في كتاب الله ‏.‏ فقال أبو بكر والله إني لأحب أن يغفر الله لي ‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال لا أنزعها منه أبدا ‏.‏ قالت عائشة وكان رسول الله صلى الله عليه وسلم سأل زينب بنت جحش زوج النبي صلى الله عليه وسلم عن أمري ‏\"‏ ما علمت أو ما رأيت ‏\"‏ ‏.‏ فقالت يا رسول الله أحمي سمعي وبصري والله ما علمت إلا خيرا ‏.‏ قالت عائشة وهي التي كانت تساميني من أزواج النبي صلى الله عليه وسلم فعصمها الله بالورع وطفقت أختها حمنة بنت جحش تحارب لها فهلكت فيمن هلك ‏.‏ قال الزهري فهذا ما انتهى إلينا من أمر هؤلاء الرهط ‏.‏ وقال في حديث يونس احتملته الحمية ‏.‏",
      "text_en": " Sa'id b. Musayyib, 'Urwa b. Zubair, 'Alqama b. Waqqas and 'Ubaidullah b. Abdullah b. 'Utba b. Mas'ud--all of them reported the story of the false allegation against 'A'isha, the wife of Allah's Apostle (may peace be upon him). And they (the slanderers) said what they had to say, but Allah exonerated her of this charge and all of them reported a part of the hadith and some of them who had better memories reported more and with better retention, and I tried to retain this hadith (listening) from every one of them that they reported to me and some of them attested the other. (The sumaried substance of the false allegation is this):                      'A'isha said: Whenever Allah's Messenger (may peace be upon him) intended to set out on a journey he cast lots amongst his wives and he took one with him in whose favour the lot was cast. It so happened that he cast lots amongst us while setting out on a battle and it was cast in my favour, so I set out along with Allah's Messenger (may peace be upon him). This relates to the period when the revelation concerning the commands of veil had been made. I was carried in a haudaj and I was brought down where we had to stay. In short, when we set out for return journey from the expedition and our caravan was near Medina, Allah's Messenger (may peace be upon him) commanded one night to march forward. I also got up when the command for the march was given and moved on until I went out of the encampments of the army and after relieving myself I came to my place. I touched my chest and found that my necklace which had been made of the stones of zafar had been broken. I retraced my steps and tried to search my necklace and this detained me there. The group of people who saddled my ride and placed my haudaj carrying me upon the camels marched on. They were under the impression that I was in it. The women in those days were light of weight and they did not wear much flesh, as they ate less food; so they did not perceive the weight of my haudaj as they placed it upon the camel as I was a young girl at that time. So they drove the camel and Eet out and I found my necklace after the army had marched. I came to my place and there was none to call and none to respond (the call). I waited at my place under the impression that when the people would riot find me they would come back. So I kept sitting at my place. I was overpowered by sleep and slept. Safwan b. Mu'attal Sulami Dhakwini, who had lagged behind the army because of taking rest came to my place walking in the latter part of the night and he saw the body of a person who was asleep. He came to me and recognised me as he had seen rue before it was enjoined to observe purda. I got ap by his voice as he recited Inna lillahi wa inna ilaihi raji'un [we are for Allah and to Him we have to return. ] and I covered my head with my headdress. By Allah, he did not speak to me a word and I did not hear a word from him except Inna lillahi. He made his camel kneel down and I amounted the camel as he pressed tLe camel's foreleg and he moved on leaning the camel by the nose string on which I was riding until we came to the army where it had encamped for rest because of extreme heat. Woe be upon those who harboured doubts about me and the most notorious among them was 'Abdullah b. Ubayy, the great hypocrite. We came to Medina and I fell sick for a month. The people had been deliberating over the statements of those who had brought these calumnies against me. I was absolutely unaware of anything concerning that. This, however, caused doubt in my mind that I did not see Allah's Messenger (may peace be upon him.) treating me with such kindness with which he treated me as I fell ill before this. The Holy Prophet (may peace be upon him) would coome and greet me with Assalam-o-'Alaikum and only ask me how I was. This caused doubt in my mind, but I was unaware of the evil. I wept outside despite my failing health and there went along with me Umm Mistah and she said the daughter of Abu Rhm b. Muttalib b. 'Abd Manaf and his mother was the daughter of Sakhr b. 'Amir, the sister of the mother of Abu Bakr Sidiq and his son was Mistah b. Uthatha b. 'Abbad b. Muttalib. I and the daughter of Abu Rahm set towards the direction of my house. Something got into the head dress of Umm Mistah and she said: Woe be upon Mistah. And I said. Woe be upon what you say. Do you curse people who had participated in Badr? She said: Innocent woman, have you not heard what he said? I said: What did he say? She conveyed to me the statement of those who had brought false allegations against me. So my illness was aggravated. I went to my house and Allah's Messenger (may peace be upon him) came to me and he greeted me and then said: How is that woman? I said: Do you permit me to go to the (house) of my parents? She (further) said: I had at that time made up my mind to confirm this news from them. Allah's Messenger (may peace be upon him) permitted me. So I came to (the house of) my parents and said to my mother: Mother, do you know what the people are talking about? She said: My daughter, you should not worry. By Allah, if there is a handsome woman who is loved by her husband and he has co-wives also they talk many a thing about her. I said: Hallowed be Allah, what are the people talking about? I wept during the whole night until it was morning and I did not have a wink of sleep and I wept even in the morning. As the revelation was delayed (in regard to this matter), so Allah's Messenger (may peace be upon him) called 'Ali ibn Abi 'Talib and Usama b. Zaid in order to seek their advice in regard to the separation of his wife. Usama b. Zaid told Allah's Messenger (may peace be apen him) about the innocence of his wives and what he knew about his love for them. He said: Allah's Messenger, they are your wives and we know nothing else about thembut goodness. And as for 'Ali b. Abu Talib, he said: Allah has not put any unnecessary burden upon you (in regard to your wives). There are a number of women besides her and if you ask that maidservant (Barira) she will tell you the truth. So, Allah's Messenger (may peace be upon him) called Bailra and said: Barira, did you see anything in 'A'isha which can cause doubt about her? Barira said: By Him Who sent thee with the truth, I have seen nothing objectionable in her but only this much that she is a young girl and she goes to sleep while kneading the flour and the lamb eats that. Thereupon Allah's Messenger (may peace be upon him) mounted the pulpit and sought vindication against 'Abdullah b. Ubayy b. Salul, and he further said: Who would exonerate me from imputations of that person who has troubled (me) in regard to my family? By Allah, I find nothing in my wife but goodness and the person whom the people have mentioned in this connection is, according to my knowledge, a thoroughly pious person, and he did never get into my house but along with me. Sa'd b. Mu'adh stood up and said: Allah's Messenger, I defend your honour against him. If he belong to the tribe of Aus we would strike his neck and if he belongs to the tribe of our brother Khazraj and you order us we would comply with your order. Then Sa'd b. 'Ubada stood up. He was chief of the Khazraj tribe. He was otherwise a pioas man but he had some what tribal partisanship in him and he said to Sa'd b. Mu'adh: By the everlasting existence of Allah. you are not stating the fact, you will not be able to kill him and you will not have the power to do so. Thereupon, Usaid b. Hudair stood up, and he was the first cousin of Sa'd b. Mu'adh and said to Sa'd b. 'Ubada: By the everlasting existence of Allah, you are not stating the fact. We would kill him. You are a hypocrite and so you argue in defence of the hypocrites, and thus both the tribes Aus and Khazraj were flared up, until they were about to fall upon one another and Allah's Messenger (may peace be upon him) kept standing upon the pulpit and Allah's Messenger (may peace be upon him) tried to subside their anger until they became silent and thus there was silence. 'A'isha further reported: I spent the whole day in weeping and even the night and could not have a wink of sleep even next night. My parents thought that this constant weeping of mine would break my heart. I wept and they sat beside me. In the meanwhile a woman of the Ansar came to see me. I permitted her to see me and she also began to weep. And we were in this very state that Allah's Messenger (may peace be upon him) came and he greeted me and then sat down. He had never sat with me since a month when this rumour was afloat, and there was no revelation (to clarity) my case. Allah's Messenger (may peace be upon him) recited Tashahhud (there is no god but Allah and Muhammad is His Apostle) and then said: Coming to the point, 'A'isha, this is what has reached me about you and if you are innocent, Allah would Himself vindicate your honour, and if accidentally there has been a lapse on your part sock forgiveness of Allah; He will pardon thee for when a servant makes a confession of his fault and turns (to Him) penitently, Allah also turns to him (mercifully) accepting his repentance. When Allah's Messenger (may peace be upon him) talked, my tears dried up and not even a single drop of tear was perceived by me (rolling out of my eyes). I said to my father: You give a reply to Allah's Messenger (may peace be upon him) on my behalf. He said: By Allah, I do not know what I should say to Allah's Messenger (may peace be upon him). I then said to my mother: Give a reply to Allah's Messenger (may peace be upon him) on my behalf, but she said: By Allah, I do not know what I should say to Allah's Messenger (may peace be upon him). I was a small girl at that time and I had not read much of the Qur'an (but I said): By Allah, I perceive that you have heard about this and it has settled down in your mind and you have taken it to be true, so if I say to you that I am quite innocent, and Allah knows that I am innocent, you would never believe me to be true, and if I confess to (the alleged) lapse before you, whereas Allah knows that I am completely innocent (and I have not committed this sin at all), in that case You will take me to be true and, by Allah, I, therefore, find no other alternative for me and for you except that what the father of Yousuf said:, (My course is) comely patience. And Allah it is Whose help is to be sought for in that (predicament) which ye describe\" (xii 18). After this I turned my face to the other side and lay down on my bed. By Allah, I was fully aware of this fact that I was innocent but I did not expect that Allah would descend Wahy Matlu (Qur'anic Wahy) in my case as I did not think myself so much important that Allah, the Exalted and Glorious, would speak in this matter in words to be recited. I only hoped that Allah would in vision give an indication of my innocence to Allah's Messenger (may peace be upon him) during his sleep. And, by Allah, Allah's Messenger (may peace be upon him) had not moved an inch from where he had been sitting and none from the members of my family had gone that Allah, the Exalted and Glorious, descended revelation upon Allah's Messenger (may peace be upon him) there and then and he felt the burden which he used to feel at the time of receiving revelation. He began to perspire because of the burden of words of Allah as they descended upon him even during the winter season and there fell the drops of his sweat like silvery beads. When this state of receiving revelation was over, the Messenger of Allah (may peace be upon him) smiled and the first words which he spoke to me were that he said: 'A'isha, there is glad tidings for you. Verily, Allah has vindicated your honour, and my mother who had been standing by me said: Get up (and thank him, i. e. the Holy Prophet). I said: By Allah, I shall not thank him and laud him but Allah Who has descended revelation vindicating my honour. She ('A'isha) said: Allah, the Exalted and Glorious, revealed:\" 'Verily, those who spread the slander are a gang among you\" (and) ten (subsequent) verses in regard to my innocence. She further said: Abu Bakr used to give to Mistah (some stipend) as a token of kinship with him and for his poverty and he (Abu Bakr) said: By Allah, now I would not spend anything for him. 'A'isha said: It was upon this that Allah the Exalted and Glorious revealed this verse:\" And let not those who possess dignity and ease among you swear to give to the near of the kin\" up to\" Yearn ye not that Allah may forgive you?\" Hibban b. Musa' said that 'Abdullah b. Mubarak used to say: It is a verse contained in the Book which most (eminently) brightens the hope. Abu Bakr said: By Allah, I wish that Allah should pardon me. I shall never stop this stipend. So he continued to give him the stipend which he had withdrawn. 'A'isha said that Allah's Messenger (way peace be upon him) asked Zainab, daughter of Jahsh, the wife of Allah's Apostle (may peace be upon him), about me what she knew or what she had seen in me, and she said: Allah's Messenger, I shall not say anything without hearing (with my ears) and seeing with my eyes. By Allah, I find nothing in her but goodness. (And she stated this in spite of the fact) that she was the only lady who amongst the wives of Allah's Apostle (may peace be upon him) used to vie with me but Allah saved her in bringing false allegation against me because of her God-consciousness. Her sister Hamna bint Jahsh, however, opposed her and she was undone along with others.",
      "chain": [
        "30322",
        "20025",
        "20475",
        "30021",
        "30375",
        "30553",
        "20121",
        "20115",
        "11013"
      ]
    },
    {
      "hadith_no": "7238",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، ح وحدثنا  إسحاق بن إبراهيم الحنظلي، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، كلاهما عن  الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أمشي مع النبي صلى الله عليه وسلم في حرث بالمدينة ‏.‏ بنحو حديث حفص غير أن في حديث وكيع وما أوتيتم من العلم إلا قليلا ‏.‏ وفي حديث عيسى بن يونس وما أوتوا ‏.‏ من رواية ابن خشرم ‏.‏",
      "text_en": " Abdullah reported:                      I was walking along with Allah's Apostle (may peace be upon him) in a field of Medina. The rest of the hadith is the same, but there is a slight variation of wording.",
      "chain": [
        "30201",
        "30200",
        "20032",
        "30021",
        "30556",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7316",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا المخزومي، حدثنا وهيب، عن أبي، حازم عن سهل بن سعد، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن في الجنة لشجرة يسير الراكب في ظلها مائة عام لا يقطعها ‏\"‏ ‏.‏  قال أبو حازم فحدثت به النعمان بن أبي عياش الزرقي، فقال حدثني أبو سعيد الخدري عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة شجرة يسير الراكب الجواد المضمر السريع مائة عام ما يقطعها ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa'd reported Allah's Messenger (may peace be upon him) as saying:                      In Paradise, there is a tree under the shadow of which a rider can travel for a hundred years without covering (the distance) completely. This hadith has also been transmitted on the authority of Abu Sa'id al-Khudri that Allah's Apostle (may peace be upon him) is reported to have said: In Paradise, there is a tree under the shadow of which a rider of a fine and swift-footed horse would travel for a hundred years without covering the distance completely. There would be the pleasure of Allah for the inmates of Paradise and He would never be annoyed with them.",
      "chain": [
        "30021",
        "20299",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "7557",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا علي بن حجر السعدي، وإسحاق بن إبراهيم، - واللفظ لابن حجر قال إسحاق أخبرنا وقال ابن حجر، حدثنا جرير، عن المغيرة، عن نعيم بن أبي هند، عن ربعي، بن حراش قال اجتمع حذيفة وأبو مسعود فقال حذيفة ‏\"‏ لأنا بما مع الدجال أعلم منه إن معه نهرا من ماء ونهرا من نار فأما الذي ترون أنه نار ماء وأما الذي ترون أنه ماء نار فمن أدرك ذلك منكم فأراد الماء فليشرب من الذي يراه أنه نار فإنه سيجده ماء ‏\"‏ ‏.‏ قال أبو مسعود هكذا سمعت النبي صلى الله عليه وسلم يقول ‏.‏",
      "text_en": " Hudhaifa and Ibn Mas'ud met together. Hudhaifa said:                      I know more than you as to what there would be along with the Dajjal. There would be along with him two canals (one flowing with water) and the other one (having) fire (within it), and what you would see as fire would be water and what you would see as water would be fire. So he who amongst you is able to see that and is desirous of water should drink out of that which he sees as fire.",
      "chain": [
        "20387",
        "30021",
        "20028",
        "11072",
        "10973",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7633",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، زهير حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت ما شبع آل محمد صلى الله عليه وسلم منذ قدم المدينة من طعام بر ثلاث ليال تباعا حتى قبض ‏.‏",
      "text_en": " 'A'isha reported:                      Never had the family of Muhammad (may peace be upon him) eaten to the fill since their, arrival in Medina with the bread of wheat for three successive nights until his (Holy Prophet's) death.",
      "chain": [
        "30022",
        "30021",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "7634",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم قال إسحاق أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت ما شبع رسول الله صلى الله عليه وسلم ثلاثة أيام تباعا من خبز بر حتى مضى لسبيله ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      Never did Allah's Messenger (may peace be upon him) eat to his fill the bread of wheat for three successive days until he had run the course of his life.",
      "chain": [
        "30201",
        "30216",
        "30021",
        "20354",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "7663",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، حدثنا أبو بكر الحنفي، وعبد الملك بن، الصباح كلاهما عن عبد الحميد بن جعفر، بهذا الإسناد غير أن في، حديثهما ‏\"‏ بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ja'far with the same chain of transmitters with this variation (that the words are):                     \" Allah would build for him a house in Paradise.\"",
      "chain": [
        "30021",
        "20254"
      ]
    },
    {
      "hadith_no": "1811",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا إسحاق بن إسماعيل الطالقاني، وهناد بن السري، - المعنى واحد - قال إسحاق - حدثنا عبدة بن سليمان، عن ابن أبي عروبة، عن قتادة، عن عزرة، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم سمع رجلا يقول لبيك عن شبرمة ‏.‏ قال ‏\"‏ من شبرمة ‏\"‏ ‏.‏ قال أخ لي أو قريب لي ‏.‏ قال ‏\"‏ حججت عن نفسك ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ حج عن نفسك ثم حج عن شبرمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) heard a man say: Labbayk (always ready to obey) on behalf of Shubrumah. He asked: Who is Shubrumah? He replied: A brother or relative of mine. He asked: Have you performed hajj on your own behalf? He said: No. He said: perform hajj on your own behalf, then perform it on behalf of Shubrumah.",
      "chain": [
        "30480",
        "30021",
        "20337",
        "11073",
        "11019",
        "10799",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي بن نصر الجهضمي، أخبرنا أبو أحمد، أخبرنا إسرائيل، عن إسحاق، عن البراء، قال كان الرجل إذا صام فنام لم يأكل إلى مثلها وإن صرمة بن قيس الأنصاري أتى امرأته وكان صائما فقال عندك شىء قالت لا لعلي أذهب فأطلب لك شيئا ‏.‏ فذهبت وغلبته عينه فجاءت فقالت خيبة لك ‏.‏ فلم ينتصف النهار حتى غشي عليه وكان يعمل يومه في أرضه فذكر ذلك للنبي صلى الله عليه وسلم فنزلت ‏{‏ أحل لكم ليلة الصيام الرفث إلى نسائكم ‏}‏ قرأ إلى قوله ‏{‏ من الفجر ‏}‏ ‏.‏",
      "text_en": " Al Bara’ (bin Azib) said “When a man fasted and slept, he could not eat till (another nigh) like it.” Sarmah bin Qais Al Ansari came to his wife while he was fasting and asked her Do you have something (to eat)? She replied “No”. Let me go and seek something for you. So, she went out and sleep overcame him. She came (back) and said (to him) .You are deprived (of food). He fainted before noon. He used to work all day long at his land. This was mentioned to the Prophet (ﷺ). So the following verse was revealed. “Permitted to you on the nights of the fasts, is the approach to your wives. They are your garments and ye are their garments. Allah knoweth what yes used to do secretly amongst yourselves. But he turned to you and forgave you. So now associate with them and seek what Allaah hath ordained for you. And eat and drink until the white thread of dawn appears to you. He recited up to the words “of dawn”.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "30021",
        "400"
      ]
    },
    {
      "hadith_no": "4027",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا معاذ بن هشام، عن أبيه، عن بديل بن ميسرة، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت كانت يد كم قميص رسول الله صلى الله عليه وسلم إلى الرصغ ‏.‏",
      "text_en": " Narrated Asma', daughter of Yazid,:                     The sleeve of the shirt of the Messenger of Allah (ﷺ) came to the wrist.",
      "chain": [
        "30021",
        "20287",
        "20295",
        "10672",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "87",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر، - وهو أحمد بن عبد الله الهمداني الكوفي وإسحاق بن منصور قال أبو عبيدة حدثنا وقال، إسحاق أخبرنا عبد الصمد بن عبد الوارث، حدثني أبي، عن حسين المعلم، عن يحيى بن أبي كثير، قال حدثني عبد الرحمن بن عمرو الأوزاعي، عن يعيش بن الوليد المخزومي، عن أبيه، عن معدان بن أبي طلحة، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قاء فأفطر فتوضأ ‏.‏ فلقيت ثوبان في مسجد دمشق فذكرت ذلك له فقال صدق أنا صببت له وضوءه ‏.‏ قال أبو عيسى وقال إسحاق بن منصور معدان بن طلحة ‏.‏ قال أبو عيسى وابن أبي طلحة أصح ‏.‏ قال أبو عيسى وقد رأى غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم من التابعين الوضوء من القىء والرعاف ‏.‏ وهو قول سفيان الثوري وابن المبارك وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم ليس في القىء والرعاف وضوء ‏.‏ وهو قول مالك والشافعي ‏.‏ وقد جود حسين المعلم هذا الحديث ‏.‏ وحديث حسين أصح شيء في هذا الباب ‏.‏ وروى معمر هذا الحديث عن يحيى بن أبي كثير فأخطأ فيه فقال عن يعيش بن الوليد عن خالد بن معدان عن أبي الدرداء ولم يذكر فيه الأوزاعي وقال عن خالد بن معدان وإنما هو معدان بن أبي طلحة ‏.‏",
      "text_en": " Madan bin Abi Talhah narrated from Abu Ad-Darda that :                     \"Allah's Messenger vomited [so he broke fast] so he performed Wudu.\" So I met Thawban in a Masjid in Damascus, and I mentioned that to him. He said: 'He told the truth, I poured the water for his Wudu.\"",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11278",
        "11449",
        "20024",
        "17555",
        "10977"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "قال إسحاق أنبأنا أبو معاوية، عن الأعمش، بهذا الإسناد مثله ‏.‏",
      "text_en": " (Another chain) with similarity.",
      "chain": [
        "30021",
        "20354",
        "11060"
      ]
    },
    {
      "hadith_no": "1721",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن قتادة، عن زرارة بن أوفى، أن سعد بن هشام بن عامر، لما أن قدم، علينا أخبرنا أنه، أتى ابن عباس فسأله عن وتر، رسول الله صلى الله عليه وسلم قال ألا أدلك أو ألا أنبئك بأعلم أهل الأرض بوتر رسول الله صلى الله عليه وسلم ‏.‏ قلت من قال عائشة ‏.‏ فأتيناها فسلمنا عليها ودخلنا فسألناها فقلت أنبئيني عن وتر رسول الله صلى الله عليه وسلم ‏.‏ قالت كنا نعد له سواكه وطهوره فيبعثه الله عز وجل ما شاء أن يبعثه من الليل فيتسوك ويتوضأ ثم يصلي تسع ركعات ولا يقعد فيهن إلا في الثامنة فيحمد الله ويذكره ويدعو ثم ينهض ولا يسلم ثم يصلي التاسعة فيجلس فيحمد الله ويذكره ويدعو ثم يسلم تسليما يسمعنا ثم يصلي ركعتين وهو جالس فتلك إحدى عشرة ركعة يا بنى فلما أسن رسول الله صلى الله عليه وسلم وأخذ اللحم أوتر بسبع ثم يصلي ركعتين وهو جالس بعد ما يسلم فتلك تسعا أى بنى وكان رسول الله صلى الله عليه وسلم إذا صلى صلاة أحب أن يداوم عليها ‏.‏",
      "text_en": " It was narrated from Zurarah bin Awfa:                     \"When Sa'd bin Hisham bin Amir came to visit us, he told us that he came to Ibn Abbas and asked him about the witr of the Messenger of Allah (ﷺ). He said: 'Shall I not tell you of the most knowledgeable person on Earth about the witr of the Messenger of Allah (ﷺ)?' I said: 'Who?' He said: 'Aishah.' So we went to her and greeted her with Salam and entered and asked her. I said: 'Tell me about the witr of the Messenger of Allah (ﷺ).' She said: 'We used to prepare for him his siwak and water for wudu, then Allah (SWT) would wake him when He willed to wake him at night. He would clean his teeth and perform wudu, then he would pray nine rak'ahs, during which he would not sit until the eighth. Then he would praise Allah (SWT) and remember Him and supplicate, then he would get up and not say the taslim. Then he would pray the ninth, then sit and praise Allah (SWT) and remember Him and supplicate, then he would say a taslim that we could hear. Then he prayed two rak'ahs sitting, and that was eleven rak'ahs, O my son. When the Messenger of Allah (ﷺ) grew older and put on weight, he prayed witr with seven, then he prayed two rak'ahs sitting after saying the taslim, and that was nine, O my son. And when the Messenger of Allah (ﷺ) offered a prayer, he liked to persist in offering it.'\"",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11019",
        "11284",
        "11166"
      ]
    },
    {
      "hadith_no": "1810",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق، قال حدثنا النضر، قال حدثنا حماد بن سلمة، عن عاصم، عن أبي صالح، عن أم حبيبة، قالت من صلى في يوم اثنتى عشرة ركعة بني له بيت في الجنة ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs in a day, a house will be built for him in Paradise.\"",
      "chain": [
        "30021",
        "20291",
        "20021",
        "11080",
        "11161",
        "59"
      ]
    },
    {
      "hadith_no": "1852",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم أخذ على النساء حين بايعهن أن لا ينحن فقلن يا رسول الله إن نساء أسعدننا في الجاهلية أفنسعدهن فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا إسعاد في الإسلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     when the Messenger of Allah accepted  the women's oath of allegiance, he accepted their pledge that they would not wail (over the death). They said: \"O Messenger of Allah, there are women who helped us to mourn during the Jahiliyyah should we help them to mourn?\" The Messenger of Allah said: \"There is no helping to mourn in Islam.\"",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1877",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا جرير، قال حدثني طلق بن معاوية، وحفص بن غياث، قال حدثني جدي، طلق بن معاوية عن أبي زرعة، عن أبي هريرة، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم بابن لها يشتكي فقالت يا رسول الله أخاف عليه وقد قدمت ثلاثة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد احتظرت بحظار شديد من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A woman came to the Messenger of Allah with a son of hers who was ill and said: 'O Messenger of Allah, I fear for him, and I have already lost three.' The Messenger of Allah said: \"You have a great protection against the Hellfire.\"",
      "chain": [
        "30021",
        "20028",
        "10777",
        "20317",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "1878",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن حميد بن هلال، عن أنس، أن رسول الله صلى الله عليه وسلم نعى زيدا وجعفرا قبل أن يجيء خبرهم فنعاهم وعيناه تذرفان ‏.‏",
      "text_en": " It was narrated from Anas:                     that the Messenger of Allah announced the news of the death of Zaid and Ja'far before news of them came. He announced their death and his eyes were overflowing with tears.",
      "chain": [
        "30021",
        "20193",
        "20022",
        "11015",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "1897",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن الزهري، عن عروة، عن عائشة، قالت كفن النبي صلى الله عليه وسلم في ثلاثة أثواب سحولية بيض ‏.‏",
      "text_en": " It was narrated from Samurah that the Prophet said:                     \"Wear white clothes for they are purer and better, and shroud your dead in them.\"'",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا النضر، قال حدثنا حماد بن سلمة، عن قتادة، عن أنس، أن جنازة، مرت برسول الله صلى الله عليه وسلم فقام فقيل إنها جنازة يهودي ‏.‏ فقال ‏\"‏ إنما قمنا للملائكة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     a funeral passed by the Messenger of Allah and he stood up. It was said: \"It is the funeral of a Jew.\" He said: \"We stood up for the angels.\"",
      "chain": [
        "30021",
        "20291",
        "20021",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1949",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا سفيان، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي هريرة، قال سئل رسول الله صلى الله عليه وسلم عن أولاد المشركين فقال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah was asked about the children of the idolators and he said: 'Allah knows best what they would have done.\"'",
      "chain": [
        "30021",
        "20005",
        "11013",
        "11206",
        "13"
      ]
    },
    {
      "hadith_no": "2094",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا إسحاق، قال حدثنا أبو عمارة، حمزة بن الحارث بن عمير قال سمعت أبي يذكر، عن عبيد الله بن عمر، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال بينما النبي صلى الله عليه وسلم مع أصحابه جاء رجل من أهل البادية قال أيكم ابن عبد المطلب قالوا هذا الأمغر المرتفق - قال حمزة الأمغر الأبيض مشرب حمرة - فقال إني سائلك فمشتد عليك في المسألة قال ‏\"‏ سل عما بدا لك ‏\"‏ ‏.‏ قال أسألك بربك ورب من قبلك ورب من بعدك آلله أرسلك قال ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك به آلله أمرك أن تصلي خمس صلوات في كل يوم وليلة قال ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك به آلله أمرك أن تأخذ من أموال أغنيائنا فترده على فقرائنا قال ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك به آلله أمرك أن تصوم هذا الشهر من اثنى عشر شهرا قال ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك به آلله أمرك أن يحج هذا البيت من استطاع إليه سبيلا قال ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فإني آمنت وصدقت وأنا ضمام بن ثعلبة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"While the Prophet was with his Companions a man from among the desert people came and said: 'Which of you is the son of 'Abdul-Muttalib?' They said: 'This Anghar man who is reclining on a pillow.' (One of the narrators) Hamzah said: \"Amghar means white with a reddish complexion.'- The man said: 'I am going to ask you questions and I will be harsh in asking.' He said: 'ask whatever you like.' He said: 'I ask you by your Lord and the Lord of those who came before you, and the Lord of those who will come after you; has Allah sent you?' He said: 'By Allah, yes.' He said: 'I adjure you by Him, has Allah commanded you to offer five prayers each day and night?' He said: 'By Allah, yes.; He said: 'I adjure you by Him, has Allah commanded you to take from the wealth of our rich and give it to our poor?' he said: 'By Allah, yes He said: 'I adjure you by Allah, has Allah commanded you to fast this month out of the twelve months?' He said: 'By Allah, yes.' He said: 'I adjure you by Him, has Allah commanded you to go on pilgrimage to this House, where can afford it?' He said: 'By Allah yes.' He said: 'I belive, and I am Dimam bin Thalabah.\"'",
      "chain": [
        "30021",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2193",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال أنبأنا إسحاق، قال أنبأنا عبد الله بن الحارث، عن يونس الأيلي، عن الزهري، قال أخبرني عروة بن الزبير، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم خرج في جوف الليل يصلي في المسجد فصلى بالناس وساق الحديث وفيه قالت فكان يرغبهم في قيام رمضان من غير أن يأمرهم بعزيمة ويقول ‏\"‏ من قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال فتوفي رسول الله صلى الله عليه وسلم والأمر على ذلك ‏.‏",
      "text_en": " It was narrated that Az-Zuhir said:                     \"Urwah bin Az-Zubair told me that 'Aishah told him: 'The Messenger of Allah went out in the middle of the night to pray in the Masjid, and he led the people in prayer; and he quoted the same Hadith, in which she said: 'He used to encourage the people to pray Qiyam n Ramadan, without insisting on that.' He said: 'Whoever spends the night of Lailat Al-Qadr in prayer out of faith and in the hope of reward, he will be forgiven his previous sins.' He said: 'And the Messenger of Allah passed away when this was the state of affairs.\"\" '",
      "chain": [
        "30021",
        "912",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا إسحاق، قال أنبأنا النضر، قال أنبأنا حماد، عن عاصم بن أبي النجود، عن سواء، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يصوم من كل شهر يوم الخميس ويوم الاثنين ومن الجمعة الثانية يوم الاثنين ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"The Messenger of Allah used to fast Thursday and Monday of each month, and Monday of the following week.\"",
      "chain": [
        "30021",
        "20291",
        "20022",
        "11358",
        "54"
      ]
    },
    {
      "hadith_no": "2898",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، ومحمد بن رافع، قال إسحاق أنبأنا وقال، محمد حدثنا عبد الرزاق، قال حدثنا ابن جريج، قال سمعت نافعا، يقول حدثنا إبراهيم بن عبد الله بن معبد بن عباس، حدثه أن ميمونة زوج النبي صلى الله عليه وسلم قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الكعبة ‏\"‏ ‏.‏",
      "text_en": " Maimunah, the wife of the Prophet said:                     \"I heard the Messenger of Allah say: 'One prayer in this Masjid of mine is better than a thousand prayers in any other Masjid except Al-Masjid Al-Haram.'\"",
      "chain": [
        "30123",
        "30375",
        "30021",
        "20278",
        "20121",
        "11070",
        "11014",
        "11825"
      ]
    },
    {
      "hadith_no": "3701",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا إسحاق، قال حدثنا المخزومي، قال حدثنا وهيب، قال حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العائد في هبته كالكلب يقيء ثم يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Tawus, from his father, from Ibn 'Abbas, that the Messenger of Allah said:                      \"The one who takes back his gift, is like the dog which vomits then goes back to its vomit.\"",
      "chain": [
        "30021",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق، عن عوف الأعرابي، عن علقمة بن وائل الحضرمي، عن أبيه، قال جيء بالقاتل الذي قتل إلى رسول الله صلى الله عليه وسلم جاء به ولي المقتول فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب دعاه قال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب قال ‏\"‏ أما إنك إن عفوت عنه فإنه يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه فأرسله - قال - فرأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated from 'Alqamah binWa'il Al-Hadrami that his farther said:                     A man who had killed someone was brought to the Messenger of Allah, and he was brought by the heir of the victim. The Messenger of Allah said to him. 'Will you forgive him? He said: No.' He said: 'Will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he went away, he called him back and said: will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah? He said: 'No.' He said: 'will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he had gone he said: If you forgive him, he will carry your sin and the sin of your companion (the victim).\" So he forgave him and let him go.\" He said: \"And I saw him dragging his string.\"",
      "chain": [
        "34188",
        "30021",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "5258",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا وكيع، قال حدثنا عزرة بن ثابت، عن ثمامة بن عبد الله بن أنس، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا أتي بطيب لم يرده ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"If perfume was brought to the Prophet [SAW], he would not refuse it.\"",
      "chain": [
        "30021",
        "20032",
        "20561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "132",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، أنبأنا إسحاق، عن موسى بن طلحة، قال كنا عند معاوية فقال أشهد لسمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ طلحة ممن قضى نحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Musa bin Talhah said:                     We were with Mu'awiyah and he said: \"I heard the Messenger of Allah say: 'Talhah is one of those who fulfilled their covenant.'\"",
      "chain": [
        "30297",
        "20472",
        "30021",
        "579"
      ]
    }
  ],
  "total_hadiths": 138
}