{
  "id": "30020",
  "name": "Yahya bin Ma'in يحيى بن معين",
  "full_name": "Yahya bin Ma'in يحيى بن معين",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "158",
      "date_gregorian": "NA",
      "date_display": [
        "158 AH"
      ],
      "place": "Baghdad"
    },
    "death": {
      "date_hijri": "233",
      "date_gregorian": "847",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]",
      "Hadith",
      "Seerah"
    ],
    "tags": [
      "al-Baghdadi",
      "Ghatafani",
      "Client",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20467",
      "name": "Hisham bin Yusuf al-Sana'i هشام بن يوسف الصنعاني أبو عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25208",
      "name": "'Umar bin 'Abdur Rahman عمر بن عبد الرحمن بن قيس",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20314",
      "name": "Isma'il bin Mjald bin Sa'id إسماعيل بن مجالد بن سعيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24167",
      "name": "al-Skn bin Isma'il al-Ansari السكن بن إسماعيل الأنصاري ويقال",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20257",
      "name": "'Abdul Wahid bin Wasil عبد الواحد بن واصل أبو عبيدة الحداد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20537",
      "name": "Hmad bin Khalid al-Khyat حماد بن خالد الخياط القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "314",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى، قال حدثنا ابن عيينة، عن منصور ابن صفية، عن أمه، عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم عن غسلها من المحيض، فأمرها كيف تغتسل قال ‏\"‏ خذي فرصة من مسك فتطهري بها ‏\"‏‏.‏ قالت كيف أتطهر قال ‏\"‏ تطهري بها ‏\"‏‏.‏ قالت كيف قال ‏\"‏ سبحان الله تطهري ‏\"‏‏.‏ فاجتبذتها إلى فقلت تتبعي بها أثر الدم‏.‏",
      "text_en": " Narrated `Aisha:                     A woman asked the Prophet about the bath which is take after finishing from the menses. The Prophet told her what to do and said, \"Purify yourself with a piece of cloth scented with musk.\" The woman asked, \"How shall I purify myself with it\" He said, \"Subhan Allah! Purify yourself (with it).\" I pulled her to myself and said, \"Rub the place soiled with blood with it.\"",
      "chain": [
        "30020",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "363",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى، قال حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن مسروق، عن مغيرة بن شعبة، قال كنت مع النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ يا مغيرة، خذ الإداوة ‏\"‏‏.‏ فأخذتها فانطلق رسول الله صلى الله عليه وسلم حتى توارى عني فقضى حاجته، وعليه جبة شأمية، فذهب ليخرج يده من كمها فضاقت، فأخرج يده من أسفلها، فصببت عليه فتوضأ وضوءه للصلاة، ومسح على خفيه، ثم صلى‏.‏",
      "text_en": " Narrated Mughira bin Shu`ba:                     Once I was traveling with the Prophet and he said, \"O Mughira! take this container of water.\" I took it and Allah's Apostle went far away till he disappeared. He answered the call of nature and was wearing a Syrian cloak. He tried to take out his hands from its sleeve but it was very tight so he took out his hands from under it. I poured water and he performed ablution like that for prayers and passed his wet hands over his Khuff (socks made from thick fabric or leather) and then prayed .",
      "chain": [
        "30020",
        "20354",
        "11060",
        "20285",
        "11018"
      ]
    },
    {
      "hadith_no": "393",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "قال ابن أبي مريم أخبرنا يحيى، حدثنا حميد، حدثنا أنس، عن النبي صلى الله عليه وسلم‏.‏ وقال علي بن عبد الله حدثنا خالد بن الحارث قال حدثنا حميد قال سأل ميمون بن سياه أنس بن مالك قال يا أبا حمزة، ما يحرم دم العبد وماله فقال من شهد أن لا إله إلا الله، واستقبل قبلتنا، وصلى صلاتنا، وأكل ذبيحتنا، فهو المسلم، له ما للمسلم، وعليه ما على المسلم‏.‏",
      "text_en": " Narrated Maimun bin Siyah that he asked Anas bin Malik, \"O Abu Hamza! What makes the life and property of a person sacred?\" He replied, \"Whoever says, 'None has the right to be worshipped but Allah', faces our Qibla during the prayers, prays like us and eats our slaughtered animal, then he is a Muslim, and has got the same rights and obligations as other Muslims have.\"",
      "chain": [
        "30232",
        "30020",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "423",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى، قال أخبرنا عبد الرزاق، قال أخبرنا ابن جريج، قال أخبرني ابن شهاب، عن سهل بن سعد، أن رجلا، قال يا رسول الله، أرأيت رجلا وجد مع امرأته رجلا أيقتله فتلاعنا في المسجد وأنا شاهد‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A man said, \"O Allah's Apostle! If a man finds another man with his wife, (committing adultery) should the husband kill him?\" Later on I saw them (the man and his wife) doing Li`an in the mosque (taking oaths, one accusing, and the other denying adultery).",
      "chain": [
        "30020",
        "20121",
        "11070",
        "11013",
        "399"
      ]
    },
    {
      "hadith_no": "945",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى، قال حدثنا وكيع، عن علي بن مبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن جابر بن عبد الله، قال جاء عمر يوم الخندق، فجعل يسب كفار قريش ويقول يا رسول الله ما صليت العصر حتى كادت الشمس أن تغيب‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ وأنا والله ما صليتها بعد ‏\"‏‏.‏ قال فنزل إلى بطحان فتوضأ، وصلى العصر بعد ما غابت الشمس، ثم صلى المغرب بعدها‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of the Khandaq `Umar came, cursing the disbelievers of Quraish and said, \"O Allah's Apostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet replied, \"By Allah! I too, have not offered the prayer yet. \"The Prophet then went to Buthan, performed ablution and performed the `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"",
      "chain": [
        "30020",
        "20032",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "1204",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى، أخبرنا وكيع، عن سفيان، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ التسبيح للرجال والتصفيح للنساء ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"The saying 'Sub Han Allah' is for men and clapping is for women.",
      "chain": [
        "30020",
        "20032",
        "20012",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى، حدثنا أبو معاوية، عن الأعمش، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه مر بقبرين يعذبان فقال ‏\"‏ إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان لا يستتر من البول، وأما الآخر فكان يمشي بالنميمة ‏\"‏‏.‏ ثم أخذ جريدة رطبة فشقها بنصفين، ثم غرز في كل قبر واحدة‏.‏ فقالوا يا رسول الله، لم صنعت هذا فقال ‏\"‏ لعله أن يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once passed by two graves, and those two persons (in the graves) were being tortured. He said, \"They are being tortured not for a great thing (to avoid). One of them never saved himself from being soiled with his urine, while the other was going about with calumnies (to make enmity between friends). He then took a green leaf of a date-palm tree split it into two pieces and fixed one on each grave. The people said, \"O Allah's Apostle! Why have you done so?\" He replied, \"I hope that their punishment may be lessened till they (the leaf) become dry.\"",
      "chain": [
        "30020",
        "20354",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1966",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، أنه سمع أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والوصال ‏\"‏‏.‏ مرتين قيل إنك تواصل‏.‏ قال ‏\"‏ إني أبيت يطعمني ربي ويسقين، فاكلفوا من العمل ما تطيقون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said twice, \"(O you people) Be cautious! Do not practice Al-Wisal.\" The people said to him, \"But you practice Al-Wisal?\" The Prophet replied, \"My Lord gives me food and drink during my sleep. Do that much of deeds which is within your ability.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3038",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن شعبة، عن سعيد بن أبي بردة، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعث معاذا وأبا موسى إلى اليمن قال ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ولا تختلفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     That his father said, \"The Prophet sent Mu`adh and Abu Musa to Yemen telling them. 'Treat the people with ease and don't be hard on them; give them glad tidings and don't fill them with aversion; and love each other, and don't differ.\"",
      "chain": [
        "30020",
        "20032",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "3595",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، حدثنا ابن جريج، قال أخبرني ابن شهاب، عن عروة، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم دخل عليها مسرورا تبرق أسارير وجهه، فقال ‏\"‏ ألم تسمعي ما قال المدلجي لزيد وأسامة  ورأى أقدامهما  إن بعض هذه الأقدام من بعض ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     That Allah's Apostle came to her in a happy mood with his features glittering with joy, and said, \"Have you not heard what the Qaif has said about Zaid and Us-ama? He saw their feet and remarked. These belong to each other.\" (i.e. They are father and son.)",
      "chain": [
        "30020",
        "20121",
        "11070",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3632",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تقاتلوا خوزا وكرمان من الأعاجم، حمر الوجوه، فطس الأنوف، صغار الأعين، وجوههم المجان المطرقة، نعالهم الشعر ‏\"‏‏.‏ تابعه غيره عن عبد الرزاق‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Hour will not be established till you fight with the Khudh and the Kirman from among the non-Arabs. They will be of red faces, flat noses and small eyes; their faces will look like flat shields, and their shoes will be of hair.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3796",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني يحيى بن معين، وصدقة، قالا أخبرنا محمد بن جعفر، عن شعبة، عن واقد بن محمد، عن أبيه، عن ابن عمر  رضى الله عنهما  قال قال أبو بكر ارقبوا محمدا صلى الله عليه وسلم في أهل بيته‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Abu Bakr used to say, \"Please Muhammad (i.e. the Prophet) by doing good to his family.\"",
      "chain": [
        "30020",
        "30343",
        "20173",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "3905",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن حماد الآملي، قال حدثني يحيى بن معين، حدثنا إسماعيل بن مجالد، عن بيان، عن وبرة، عن همام بن الحارث، قال قال عمار بن ياسر رأيت رسول الله صلى الله عليه وسلم وما معه إلا خمسة أعبد وامرأتان، وأبو بكر‏.‏",
      "text_en": " Narrated `Ammar bin Yasir:                     I saw Allah's Apostle , and the only converts (to Islam) with him, were five slaves, two women and Abu Bakr.",
      "chain": [
        "30347",
        "30020",
        "20314",
        "11326",
        "11662",
        "11400"
      ]
    },
    {
      "hadith_no": "4196",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يحيى، حدثنا وكيع، عن نافع بن عمر، عن ابن أبي مليكة، عن عائشة  رضى الله عنها  كانت تقرأ ‏{‏إذ تلقونه بألسنتكم‏}‏ وتقول الولق الكذب‏.‏ قال ابن أبي مليكة وكانت أعلم من غيرها بذلك لأنه نزل فيها‏.‏",
      "text_en": " Narrated Ibn Abi Malaika:                     `Aisha used to recite this Verse:-- 'Ida taliqunahu bi-alsinatikum' (24.15) \"(As you tell lie with your tongues.)\" and used to say \"Al-Walaq\" means \"telling of a lie. \"She knew this Verse more than anybody else as it was revealed about her.",
      "chain": [
        "30020",
        "20032",
        "20203",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "4688",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن هشام، عن أبيه، عن عبد الله بن الزبير، ‏{‏خذ العفو وأمر بالعرف‏}‏ قال ما أنزل الله إلا في أخلاق الناس‏.‏",
      "text_en": " Narrated `Abdullah bin AzZubair:                     (The Verse) \"Hold to forgiveness; command what is right...\" was revealed by Allah except in connection with the character of the people. `Abdullah bin Az-Zubair said: Allah ordered His Prophet to forgive the people their misbehavior (towards him).",
      "chain": [
        "30020",
        "20032",
        "20295"
      ]
    },
    {
      "hadith_no": "4711",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن محمد، قال حدثني يحيى بن معين، حدثنا حجاج، قال ابن جريج قال ابن أبي مليكة وكان بينهما شىء فغدوت على ابن عباس فقلت أتريد أن تقاتل ابن الزبير، فتحل حرم الله‏.‏ فقال معاذ الله، إن الله كتب ابن الزبير وبني أمية محلين، وإني والله لا أحله أبدا‏.‏ قال قال الناس بايع لابن الزبير‏.‏ فقلت وأين بهذا الأمر عنه أما أبوه فحواري النبي صلى الله عليه وسلم، يريد الزبير، وأما جده فصاحب الغار، يريد أبا بكر، وأمه فذات النطاق، يريد أسماء، وأما خالته فأم المؤمنين، يريد عائشة، وأما عمته فزوج النبي صلى الله عليه وسلم، يريد خديجة، وأما عمة النبي صلى الله عليه وسلم فجدته، يريد صفية، ثم عفيف في الإسلام، قارئ للقرآن‏.‏ والله إن وصلوني وصلوني من قريب، وإن ربوني ربني أكفاء كرام، فآثر التويتات والأسامات والحميدات، يريد أبطنا من بني أسد بني تويت وبني أسامة وبني أسد، إن ابن أبي العاص برز يمشي القدمية، يعني عبد الملك بن مروان، وإنه لوى ذنبه، يعني ابن الزبير‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     There was a disagreement between them (i.e. Ibn `Abbas and Ibn Az-Zubair) so I went to Ibn `Abbas in the morning and said (to him), \"Do you want to fight against Ibn Zubair and thus make lawful what Allah has made unlawful (i.e. fighting in Meccas?\" Ibn `Abbas said, \"Allah forbid! Allah ordained that Ibn Zubair and Bani Umaiya would permit (fighting in Mecca), but by Allah, I will never regard it as permissible.\" Ibn `Abbas added. \"The people asked me to take the oath of allegiance to Ibn AzZubair. I said, 'He is really entitled to assume authority for his father, Az-Zubair was the helper of the Prophet, his (maternal) grandfather, Abu Bakr was (the Prophet's) companion in the cave, his mother, Asma' was 'Dhatun-Nitaq', his aunt, `Aisha was the mother of the Believers, his paternal aunt, Khadija was the wife of the Prophet , and the paternal aunt of the Prophet was his grandmother. He himself is pious and chaste in Islam, well versed in the Knowledge of the Qur'an. By Allah! (Really, I left my relatives, Bani Umaiya for his sake though) they are my close relatives, and if they should be my rulers, they are equally apt to be so and are descended from a noble family.",
      "chain": [
        "30351",
        "30020",
        "20219",
        "11070",
        "11090"
      ]
    },
    {
      "hadith_no": "4719",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الرحمن بن عبد الله، أن عبد الله بن كعب بن مالك، قال سمعت كعب بن مالك، حين تخلف عن تبوك، والله، ما أنعم الله على من نعمة بعد إذ هداني أعظم من صدقي رسول الله صلى الله عليه وسلم أن لا أكون كذبته فأهلك كما هلك الذين كذبوا حين أنزل الوحى ‏{‏سيحلفون بالله لكم إذا انقلبتم إليهم‏}‏ إلى ‏{‏الفاسقين‏}‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik at the time he remained behind and did not join (the battle of) Tabuk, saying, \"By Allah, no blessing has Allah bestowed upon me, besides my guidance to Islam, better than that of helping me speak the truth to Allah's Apostle otherwise I would have told the Prophet a lie and would have been ruined like those who had told a lie when the Divine Inspiration was revealed:-- \"They will swear by Allah to you (Muslims) when you return to them.. the rebellious people.\" (9.95-96)",
      "chain": [
        "30020",
        "20023",
        "11207",
        "11013",
        "20439",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4782",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت رجلا قينا، وكان لي على العاصي بن وائل دين فأتيته أتقاضاه، فقال لي لا أقضيك حتى تكفر بمحمد‏.‏ قال قلت لن أكفر به حتى تموت ثم تبعث‏.‏ قال وإني لمبعوث من بعد الموت فسوف أقضيك إذا رجعت إلى مال وولد‏.‏ قال فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا * كلا سنكتب ما يقول ونمد له من العذاب مدا * ونرثه ما يقول ويأتينا فردا‏}‏‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith and Al-Asi Bin Wail owed me a debt, so I went to him to demand it. He said to me. \"I will not pay you your debt till you disbelieve in Muhammad.\" I said, \"I will not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I be resurrected after my death? If so, I shall pay you (there) if I should find wealth and children.\" So there was revealed:-- 'Have you seen him who disbelieved in Our Signs, and yet says: I shall certainly be given wealth and children? Has he, known to the unseen or has he taken a covenant from (Allah) the Beneficent? Nay ! We shall record what he says, and we shall add and add to his punishment. And We shall inherit from him all that he talks of, and he shall appear before Us alone.' (19.77-80)",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "4870",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن مسروق، قال قال عبد الله إنما كان هذا لأن قريشا لما استعصوا على النبي صلى الله عليه وسلم دعا عليهم بسنين كسني يوسف، فأصابهم قحط وجهد حتى أكلوا العظام، فجعل الرجل ينظر إلى السماء فيرى ما بينه وبينها كهيئة الدخان من الجهد، فأنزل الله تعالى ‏{‏فارتقب يوم تأتي السماء بدخان مبين * يغشى الناس هذا عذاب أليم‏}‏ قال فأتي رسول الله صلى الله عليه وسلم فقيل يا رسول الله استسق الله لمضر، فإنها قد هلكت‏.‏ قال ‏\"‏ لمضر إنك لجريء ‏\"‏‏.‏ فاستسقى فسقوا‏.‏ فنزلت ‏{‏إنكم عائدون‏}‏ فلما أصابتهم الرفاهية عادوا إلى حالهم حين أصابتهم الرفاهية‏.‏ فأنزل الله عز وجل ‏{‏يوم نبطش البطشة الكبرى إنا منتقمون‏}‏ قال يعني يوم بدر‏.‏",
      "text_en": " Narrated `Abdullah:                     It (i.e., the imagined smoke) was because, when the Quraish refused to obey the Prophet, he asked Allah to afflict them with years of famine similar to those of (Prophet) Joseph. So they were stricken with famine and fatigue, so much so that they ate even bones. A man would look towards the sky and imagine seeing something like smoke between him and the sky because of extreme fatigue. So Allah revealed:-- 'Then watch you for the Day that the sky will bring forth a kind of smoke plainly visible, covering the people; this is a painfull of torment.' (44.10-11) Then someone (Abu Sufyan) came to Allah's Apostle and said, \"O Allah's Apostle! Invoke Allah to send rain for the tribes of Mudar for they are on the verge of destruction.\" On that the Prophet said (astonishingly) \"Shall I invoke Allah) for the tribes of Mudar? Verily, you are a brave man!\" But the Prophet prayed for rain and it rained for them. Then the Verse was revealed. 'But truly you will return (to disbelief).' (44.15) (When the famine was over and) they restored prosperity and welfare, they reverted to their ways (of heathenism) whereupon Allah revealed: 'On the Day when We shall seize you with a Mighty Grasp. We will indeed (then) exact retribution.' (44.16) The narrator said, \"That was the day of the Battle of Badr.\"",
      "chain": [
        "30020",
        "20354",
        "11060",
        "20285",
        "11018"
      ]
    },
    {
      "hadith_no": "4871",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن أبي الضحى، عن مسروق، قال دخلت على عبد الله فقال إن من العلم أن تقول لما لا تعلم الله أعلم، إن الله قال لنبيه صلى الله عليه وسلم ‏{‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏}‏",
      "text_en": " Narrated `Abdullah:                     It is a sign of having knowledge that, when you do not know something, you say: 'Allah knows better.' Allah said to his Prophet: 'Say: No wage do I ask of you for this (Qur'an), nor am I one of the pretenders (a person who pretends things which do not exist)' (38.86) When the Quraish troubled and stood against the Prophet he said, \"O Allah! Help me against them by afflicting them with seven years of famine like the seven years of Joseph.\" So they were stricken with a year of famine during which they ate bones and dead animals because of too much suffering, and one of them would see something like smoke between him and the sky because of hunger. Then they said: Our Lord! Remove the torment from us, really we are believers. (44.12) And then it was said to the Prophet (by Allah), \"If we remove it from them. they will revert to their ways (of heathenism).\" So the Prophet invoked his Lord, who removed the punishment from them, but later they reverted (to heathenism), whereupon Allah punished them on the day of the Battle of Badr, and that is what Allah's Statement indicates: 'Then watch for the day that the sky will bring forth a kind of smoke plainly visible...we will indeed (then) exact retribution.' (44.10).",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4874",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن مسلم، عن مسروق، عن عبد الله، قال خمس قد مضين اللزام والروم والبطشة والقمر والدخان‏.‏",
      "text_en": " Narrated `Abdullah:                     Five things have passed: Al-Lizam, the defeat of the Romans, the mighty grasp, the splitting of the moon, and the smoke.",
      "chain": [
        "30020",
        "20032",
        "11060",
        "20285",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "4904",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن إسماعيل بن أبي خالد، عن عامر، عن مسروق، قال قلت لعائشة  رضى الله عنها  يا أمتاه هل رأى محمد صلى الله عليه وسلم ربه فقالت لقد قف شعري مما قلت، أين أنت من ثلاث من حدثكهن فقد كذب، من حدثك أن محمدا صلى الله عليه وسلم رأى ربه فقد كذب‏.‏ ثم قرأت ‏{‏لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير‏}‏ ‏{‏وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب‏}‏ ومن حدثك أنه يعلم ما في غد فقد كذب ثم قرأت ‏{‏وما تدري نفس ماذا تكسب غدا‏}‏ ومن حدثك أنه كتم فقد كذب ثم قرأت ‏{‏يا أيها الرسول بلغ ما أنزل إليك من ربك‏}‏ الآية، ولكنه رأى جبريل  عليه السلام  في صورته مرتين‏.‏",
      "text_en": " Narrated Masruq:                     I said to `Aisha, \"O Mother! Did Prophet Muhammad see his Lord?\" Aisha said, \"What you have said makes my hair stand on end ! Know that if somebody tells you one of the following three things, he is a liar: Whoever tells you that Muhammad saw his Lord, is a liar.\" Then Aisha recited the Verse: 'No vision can grasp Him, but His grasp is over all vision. He is the Most Courteous Well-Acquainted with all things.' (6.103) 'It is not fitting for a human being that Allah should speak to him except by inspiration or from behind a veil.' (42.51) `Aisha further said, \"And whoever tells you that the Prophet knows what is going to happen tomorrow, is a liar.\" She then recited: 'No soul can know what it will earn tomorrow.' (31.34) She added: \"And whoever tell you that he concealed (some of Allah's orders), is a liar.\" Then she recited: 'O Apostle! Proclaim (the Message) which has been sent down to you from your Lord..' (5.67) `Aisha added. \"But the Prophet saw Gabriel in his true form twice.\"",
      "chain": [
        "30020",
        "20032",
        "11418",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "4923",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن إسرائيل، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله، قال قرأت على النبي صلى الله عليه وسلم فهل من مذكر فقال النبي صلى الله عليه وسلم ‏{‏فهل من مدكر‏}‏",
      "text_en": " Narrated `Abdullah:                     I recited before the Prophet 'Fahal-min-Mudhdhakir'. The Prophet said, \"It is Fahal-min Muddakir.\"",
      "chain": [
        "30020",
        "20032",
        "20311",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "4971",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، سألت أبا سلمة بن عبد الرحمن عن أول، ما نزل من القرآن‏.‏ قال ‏{‏يا أيها المدثر‏}‏ قلت يقولون ‏{‏اقرأ باسم ربك الذي خلق‏}‏ فقال أبو سلمة سألت جابر بن عبد الله رضى الله عنهما عن ذلك وقلت له مثل الذي قلت فقال جابر لا أحدثك إلا ما حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ جاورت بحراء، فلما قضيت جواري هبطت فنوديت فنظرت عن يميني فلم أر شيئا، ونظرت عن شمالي فلم أر شيئا، ونظرت أمامي فلم أر شيئا، ونظرت خلفي فلم أر شيئا، فرفعت رأسي فرأيت شيئا، فأتيت خديجة فقلت دثروني وصبوا على ماء باردا  قال  فدثروني وصبوا على ماء باردا قال فنزلت ‏{‏يا أيها المدثر * قم فأنذر * وربك فكبر‏}‏ ‏\"‏‏.‏",
      "text_en": " Narrated Yahya bin Abi Kathir:                     I asked Aba Salama bin `Abdur-Rahman about the first Sura revealed of the Qur'an. He replied \"O you, wrapped-up (i.e. Al Muddaththir).\" I said, \"They say it was, 'Read, in the Name of your Lord Who created,' (i.e. Surat Al-`Alaq (the Clot).\" On that, Abu Salama said, \"I asked Jabir bin `Abdullah about that, saying the same as you have said, whereupon he said, 'I will not tell you except what Allah's Apostle had told us. Allah's Apostle said, \"I was in seclusion in the cave of Hiram', and after I completed the limited period of my seclusion. I came down (from the cave) and heard a voice calling me. I looked to my right, but saw nothing. Then I looked up and saw something. So I went to Khadija (the Prophet's wife) and told her to wrap me up and pour cold water on me. So they wrapped me up and poured cold water on me.\" Then, 'O you, (Muhammad) wrapped up! Arise and warn,' (Surat Al Muddaththir) was revealed.\" (74.1)",
      "chain": [
        "30020",
        "20032",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "4998",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  عليه السلام  قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏\"‏ ما منكم من أحد إلا وقد كتب مقعده من الجنة ومقعده من النار ‏\"‏‏.‏ فقلنا يا رسول الله أفلا نتكل قال ‏\"‏ لا، اعملوا فكل ميسر ‏\"‏‏.‏ ثم قرأ ‏{‏فأما من أعطى واتقى * وصدق بالحسنى * فسنيسره لليسرى‏}‏ إلى قوله ‏{‏فسنيسره للعسرى‏}‏",
      "text_en": " Narrated `Ali:                     We were in the company of the Prophet and he said, \"There is none among you but has his place written for him, either in Paradise or in the Hell-Fire.\" We said, \"O Allah's Apostle! Shall we depend (on this fact and give up work)?\" He replied, \"No! Carry on doing good deeds, for everybody will find easy (to do) such deeds as will lead him to his destined place.\" Then the Prophet recited: 'As for him who gives (in charity) and keeps his duty to Allah, and believes in the Best reward. We will make smooth for him the path of ease....the path for evil.' (92.5-10)",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "5005",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثني سعيد بن مروان، حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرنا أبو صالح، سلمويه قال حدثني عبد الله، عن يونس بن يزيد، قال أخبرني ابن شهاب، أن عروة بن الزبير، أخبره أن عائشة زوج النبي صلى الله عليه وسلم قالت كان أول ما بدئ به رسول الله صلى الله عليه وسلم الرؤيا الصادقة في النوم، فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح، ثم حبب إليه الخلاء فكان يلحق بغار حراء فيتحنث فيه  قال والتحنث التعبد  الليالي ذوات العدد قبل أن يرجع إلى أهله، ويتزود لذلك، ثم يرجع إلى خديجة فيتزود بمثلها، حتى فجئه الحق وهو في غار حراء فجاءه الملك فقال اقرأ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنا بقارئ ‏\"‏‏.‏ قال ‏\"‏ فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني‏.‏ فقال اقرأ‏.‏ قلت ما أنا بقارئ‏.‏ فأخذني فغطني الثانية حتى بلغ مني الجهد، ثم أرسلني‏.‏ فقال اقرأ‏.‏ قلت ما أنا بقارئ‏.‏ فأخذني فغطني الثالثة حتى بلغ مني الجهد ثم أرسلني‏.‏ فقال ‏{‏اقرأ باسم ربك الذي خلق * خلق الإنسان من علق * اقرأ وربك الأكرم * الذي علم بالقلم‏}‏ ‏\"‏‏.‏ الآيات إلى قوله ‏{‏علم الإنسان ما لم يعلم‏}‏ فرجع بها رسول الله صلى الله عليه وسلم ترجف بوادره حتى دخل على خديجة فقال ‏\"‏ زملوني زملوني ‏\"‏‏.‏ فزملوه حتى ذهب عنه الروع قال لخديجة ‏\"‏ أى خديجة ما لي، لقد خشيت على نفسي ‏\"‏‏.‏ فأخبرها الخبر‏.‏ قالت خديجة كلا أبشر، فوالله لا يخزيك الله أبدا، فوالله إنك لتصل الرحم، وتصدق الحديث، وتحمل الكل، وتكسب المعدوم، وتقري الضيف، وتعين على نوائب الحق‏.‏ فانطلقت به خديجة حتى أتت به ورقة بن نوفل وهو ابن عم خديجة أخي أبيها، وكان امرأ تنصر في الجاهلية، وكان يكتب الكتاب العربي ويكتب من الإنجيل بالعربية ما شاء الله أن يكتب، وكان شيخا كبيرا قد عمي فقالت خديجة يا ابن عم اسمع من ابن أخيك‏.‏ قال ورقة يا ابن أخي ماذا ترى فأخبره النبي صلى الله عليه وسلم خبر ما رأى‏.‏ فقال ورقة هذا الناموس الذي أنزل على موسى، ليتني فيها جذعا، ليتني أكون حيا‏.‏ ذكر حرفا‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أومخرجي هم ‏\"‏‏.‏ قال ورقة نعم لم يأت رجل بما جئت به إلا أوذي، وإن يدركني يومك حيا أنصرك نصرا مؤزرا‏.‏ ثم لم ينشب ورقة أن توفي، وفتر الوحى، فترة حتى حزن رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) The commencement (of the Divine Inspiration) to Allah's Apostle was in the form of true dreams in his sleep, for he never had a dream but it turned out to be true and clear as the bright daylight. Then he began to like seclusions, so he used to go in seclusion in the cave of Hira where he used to worship Allah continuously for many nights before going back to his family to take the necessary provision (of food) for the stay. He come back to (his wife) Khadija again to take his provision (of food) likewise, till one day he received the Guidance while he was in the cave of Hira. An Angel came to him and asked him to read. Allah's Apostle replied, \"I do not know how to read.\" The Prophet added, \"Then the Angel held me (forcibly) and pressed me so hard that I felt distressed. Then he released me and again asked me to read, and I replied, 'I do not know how to read.' Thereupon he held me again and pressed me for the second time till I felt distressed. He then released me and asked me to read, but again I replied. 'I do not know how to read.' Thereupon he held me for the third time and pressed me till I got distressed, and then he released me and said, 'Read, in the Name of your Lord Who has created (all that exists), has created man out of a clot, Read! And your Lord is the Most Generous. Who has taught (the writing) by the pen, has taught man that which he knew not.\" (96.1-5). Then Allah's Apostle returned with that experience; and the muscles between his neck and shoulders were trembling till he came upon Khadija (his wife) and said, \"Cover me!\" They covered him, and when the state of fear was over, he said to Khadija, \"O Khadija! What is wrong with me? I was afraid that something bad might happen to me.\" Then he told her the story. Khadija said, \"Nay! But receive the good tidings! By Allah, Allah will never disgrace you, for by Allah, you keep good relations with your Kith and kin, speak the truth, help the poor and the destitute, entertain your guests generously and assist those who are stricken with calamities.\" Khadija then took him to Waraqa bin Naufil, the son of Khadija's paternal uncle. Waraqa had been converted to Christianity in the Pre-lslamic Period and used to write Arabic and write of the Gospel in Arabic as much as Allah wished him to write. He was an old man and had lost his eyesight. Khadija said (to Waraqa), \"O my cousin! Listen to what your nephew is going to say.\" Waraqa said, \"O my nephew! What have you seen?\" The Prophet then described whatever he had seen. Waraqa said, \"This is the same Angel (Gabriel) who was sent to Moses. I wish I were young.\" He added some other statement. Allah's Apostle asked, \"Will these people drive me out?\" Waraqa said, \"Yes, for nobody brought the like of what you have brought, but was treated with hostility. If I were to remain alive till your day (when you start preaching). then I would support you strongly.\" But a short while later Waraqa died and the Divine Inspiration was paused (stopped) for a while so that Allah's Apostle was very much grieved. Narrated Jabir bin `Abdullah: While Allah's Apostle was talking about the period of pause in revelation. he said in his narration. \"Once while I was walking, all of a sudden I heard a voice from the sky. I looked up and saw to my surprise, the same Angel as had visited me in the cave of Hira.' He was sitting on a chair between the sky and the earth. I got afraid of him and came back home and said, Wrap me! Wrap me!\" So they covered him and then Allah revealed: 'O you, wrapped up! Arise and warn and your Lord magnify, and your garments purify and dessert the idols.' (74.1-5) Abu Salama said, \"(Rijz) are the idols which the people of the Pre-lslamic period used to worship.\" After this the revelation started coming frequently and regularly.",
      "chain": [
        "30020",
        "20023",
        "11207",
        "11013",
        "30339",
        "30379",
        "30341",
        "20025",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "5010",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن عبد الكريم الجزري، عن عكرمة، قال ابن عباس قال أبو جهل لئن رأيت محمدا يصلي عند الكعبة لأطأن على عنقه‏.‏ فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو فعله لأخذته الملائكة ‏\"‏‏.‏ تابعه عمرو بن خالد عن عبيد الله عن عبد الكريم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Jahl said, \"If I see Muhammad praying at the Ka`ba, I will tread on his neck.\" When the Prophet heard of that, he said, \"If he does so, the Angels will snatch him away.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5183",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن عائشة، ‏{‏وما يتلى عليكم في الكتاب في يتامى النساء اللاتي لا تؤتونهن ما كتب لهن وترغبون أن تنكحوهن‏}‏‏.‏ قالت هذا في اليتيمة التي تكون عند الرجل، لعلها أن تكون شريكته في ماله، وهو أولى بها، فيرغب أن ينكحها، فيعضلها لمالها، ولا ينكحها غيره، كراهية أن يشركه أحد في مالها‏.‏",
      "text_en": " Narrated `Aisha:                     (as regards the Verse): 'And about what is recited unto you in the Book, concerning orphan girls to whom you give not the prescribed portions and yet, whom you desire to marry.' (4.127) This Verse is about the female orphan who is under the guardianship of a man with whom she shares her property and he has more right over her (than anybody else) but does not like to marry her, so he prevents her, from marrying somebody else, lest he should share the property with him.",
      "chain": [
        "30020",
        "20032",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "5205",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن سفيان، عن أبي حازم، عن سهل بن سعد، أن النبي صلى الله عليه وسلم قال لرجل ‏\"‏ تزوج ولو بخاتم من حديد ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said to a man, \"Marry, even with (a Mahr equal to) an iron ring.\"",
      "chain": [
        "30020",
        "20032",
        "20012",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5278",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وعن يحيى، أن أبا سلمة، حدثه أن أبا هريرة حدثه أنه، سمع النبي صلى الله عليه وسلم‏.‏ حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، أنه سمع أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن الله يغار وغيرة الله أن يأتي المؤمن ما حرم الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet; said, \"Allah has a sense of Ghira, and Allah's sense of Ghira is provoked when a believer does something which Allah has prohibited.\"",
      "chain": [
        "30020",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5366",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا يحيى، أخبرنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني ابن شهاب، عن الملاعنة، وعن السنة، فيها عن حديث، سهل بن سعد أخي بني ساعدة أن رجلا، من الأنصار جاء إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت رجلا وجد مع امرأته رجلا، أيقتله أم كيف يفعل فأنزل الله في شأنه ما ذكر في القرآن من أمر المتلاعنين، فقال النبي صلى الله عليه وسلم ‏\"‏ قد قضى الله فيك وفي امرأتك ‏\"‏‏.‏ قال فتلاعنا في المسجد وأنا شاهد، فلما فرغا قال كذبت عليها يا رسول الله إن أمسكتها‏.‏ فطلقها ثلاثا قبل أن يأمره رسول الله صلى الله عليه وسلم حين فرغا من التلاعن، ففارقها عند النبي صلى الله عليه وسلم فقال ‏\"‏ ذاك تفريق بين كل متلاعنين ‏\"‏‏.‏ قال ابن جريج قال ابن شهاب فكانت السنة بعدهما أن يفرق بين المتلاعنين، وكانت حاملا، وكان ابنها يدعى لأمه، قال ثم جرت السنة في ميراثها أنها ترثه ويرث منها ما فرض الله له‏.‏ قال ابن جريج عن ابن شهاب عن سهل بن سعد الساعدي في هذا الحديث إن النبي صلى الله عليه وسلم قال ‏\"‏ إن جاءت به أحمر قصيرا كأنه وحرة، فلا أراها إلا قد صدقت وكذب عليها، وإن جاءت به أسود أعين ذا أليتين، فلا أراه إلا قد صدق عليها ‏\"‏‏.‏ فجاءت به على المكروه من ذلك‏.‏",
      "text_en": " Narrated Ibn Juraij:                     Ibn Shihab informed me of Lian and the tradition related to it, referring to the narration of Sahl bin Sa`d, the brother of Bani Sa`idi He said, \"An Ansari man came to Allah's Apostle and said, 'O Allah's Apostle! If a man saw another man with his wife, should he kill him, or what should he do?' So Allah revealed concerning his affair what is mentioned in the Holy Qur'an about the affair of those involved in a case of Lian. The Prophet said, 'Allah has given His verdict regarding you and your wife.' So they carried out Lian in the mosque while I was present there. When they had finished, the man said, \"O Allah's Apostle! If I should now keep her with me as a wife then I have told a lie about her. Then he divorced her thrice before Allah's Apostle ordered him, when they had finished the Lian process. So he divorced her in front of the Prophet .\" Ibn Shihab added, \"After their case, it became a tradition that a couple involved in a case of Lian should be separated by divorce. That lady was pregnant then, and later on her son was called by his mother's name. The tradition concerning their inheritance was that she would be his heir and he would inherit of her property the share Allah had prescribed for him.\" Ibn Shihab said that Sahl bin Sa`d As'Saidi said that the Prophet said (in the above narration), \"If that lady delivers a small red child like a lizard, then the lady has spoken the truth and the man was a liar, but if she delivers a child with black eyes and huge lips, then her husband has spoken the truth.\" Then she delivered it in the shape one would dislike (as it proved her guilty).",
      "chain": [
        "30020",
        "20121",
        "11070",
        "11013"
      ]
    },
    {
      "hadith_no": "5414",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، قال سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفقت المرأة من كسب زوجها عن غير أمره فله نصف أجره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If the wife gives of her husband's property (something in charity) without his permission, he will get half the reward.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5511",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "قال يحيى سمعت بشيرا، يقول حدثنا سويد، خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر، فلما كنا بالصهباء  قال يحيى وهى من خيبر على روحة  دعا بطعام فما أتي إلا بسويق، فلكناه فأكلنا معه، ثم دعا بماء فمضمض ومضمضنا معه، ثم صلى بنا المغرب ولم يتوضأ‏.‏ وقال سفيان كأنك تسمعه من يحيى‏.‏",
      "text_en": " Narrated Suwaid bin An Nu`man:                     We went out with Allah's Apostle to Khaibar, and when we reached As-Sahba', the Prophet asked for food, and he was offered nothing but Sawiq. We ate, and then Allah's Apostle stood up for the prayer. He rinsed his mouth with water, and we too, rinsed our mouths. Narrated Suwaid; We went out with Allah's Apostle to Khaibar. and when we reached As-Sahba', which (Yahya says) is one day' journey from Khaibar, the Prophet asked for food, and he was offered nothing but Sawiq which we chewed and ate. Then the Prophet asked for water and rinsed his mouth, and we too, rinsed our mouths along with him. He then led us in the Maghrib prayer without performing ablution again.",
      "chain": [
        "30020",
        "11810"
      ]
    },
    {
      "hadith_no": "5576",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن سفيان، عن أيوب، عن أبي قلابة، عن زهدم الجرمي، عن أبي موسى  يعني الأشعري  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم يأكل دجاجا‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I saw the Prophet eating chicken.",
      "chain": [
        "30020",
        "20032",
        "20012",
        "11015",
        "11047",
        "11589",
        "41"
      ]
    },
    {
      "hadith_no": "6007",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العين حق ‏\"‏‏.‏ ونهى عن الوشم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The evil eye is a fact,\" and he forbade tattooing.",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6046",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا يحيى، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبيد الله بن عبد الله، أن عبد الله بن عباس، أخبره أن أبا سفيان أخبره أن هرقل أرسل إليه فقال يعني النبي صلى الله عليه وسلم يأمرنا بالصلاة والصدقة والعفاف والصلة‏.‏",
      "text_en": " Narrated Abu Sufyan:                     That Heraclius sent for him and said, \"What did he, i.e. the Prophet order you?\" I replied, \"He orders us to offer prayers; to give alms; to be chaste; and to keep good relations with our relatives.",
      "chain": [
        "30020",
        "20023",
        "11207",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "6121",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، قال سمعت مجاهدا، يحدث عن طاوس، عن ابن عباس  رضى الله عنهما  قال مر رسول الله صلى الله عليه وسلم على قبرين فقال ‏\"‏ إنهما ليعذبان، وما يعذبان في كبير، أما هذا فكان لا يستتر من بوله، وأما هذا فكان يمشي بالنميمة ‏\"‏‏.‏ ثم دعا بعسيب رطب، فشقه باثنين، فغرس على هذا واحدا وعلى هذا واحدا ثم قال ‏\"‏ لعله يخفف عنهما، ما لم ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle passed by two graves and said, \"Both of them (persons in the grave) are being tortured, and they are not being tortured for a major sin. This one used not to save himself from being soiled with his urine, and the other used to go about with calumnies (among the people to rouse hostilities, e.g., one goes to a person and tells him that so-and-so says about him such-and-such evil things). The Prophet then asked for a green leaf of a date-palm tree, split it into two pieces and planted one on each grave and said, \"It is hoped that their punishment may be abated till those two pieces of the leaf get dried.\" (See Hadith No 215, Vol 1).",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6900",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "قال يحيى وحدثنا سفيان، حدثني واصل، عن أبي وائل، عن عبد الله، قلت يا رسول الله، مثله، قال عمرو فذكرته لعبد الرحمن وكان حدثنا عن سفيان عن الأعمش ومنصور وواصل عن أبي وائل عن أبي ميسرة قال دعه دعه‏.‏",
      "text_en": "",
      "chain": [
        "30020",
        "20005",
        "11401",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7086",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا يحيى، حدثنا الليث، عن يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، أن ابن عباس، كان يحدث أن رجلا، أتى رسول الله صلى الله عليه وسلم فقال إني أريت الليلة في المنام، وساق الحديث‏.‏ وتابعه سليمان بن كثير وابن أخي الزهري وسفيان بن حسين عن الزهري عن عبيد الله عن ابن عباس عن النبي صلى الله عليه وسلم‏.‏ وقال الزبيدي عن الزهري عن عبيد الله أن ابن عباس أو أبا هريرة عن النبي صلى الله عليه وسلم‏.‏ وقال شعيب وإسحاق بن يحيى عن الزهري كان أبو هريرة يحدث عن النبي صلى الله عليه وسلم وكان معمر لا يسنده حتى كان بعد‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     About a man who came to Allah's Apostle and said, \"I was shown in a dream last night...\" Then Ibn `Abbas mentioned the narration.",
      "chain": [
        "30020",
        "20023",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "7254",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن شهاب، عن سهل، أخي بني ساعدة أن رجلا، من الأنصار جاء إلى النبي صلى الله عليه وسلم فقال أرأيت رجلا وجد مع امرأته رجلا، أيقتله فتلاعنا في المسجد وأنا شاهد‏.‏",
      "text_en": " Narrated Sahl:                     (the brother of Bani Sa`ida) A man from the Ansar came to the Prophet and said, \"If a man finds another man sleeping with his wife, should he kill him?\" That man and his wife then did Lian in the mosque while I was present.",
      "chain": [
        "30020",
        "20121",
        "11070",
        "11013"
      ]
    },
    {
      "hadith_no": "7339",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن إسرائيل، عن أبي إسحاق، عن البراء، قال لما قدم رسول الله صلى الله عليه وسلم المدينة صلى نحو بيت المقدس ستة عشر، أو سبعة عشر شهرا، وكان يحب أن يوجه إلى الكعبة فأنزل الله تعالى ‏{‏قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها‏}‏ فوجه نحو الكعبة، وصلى معه رجل العصر، ثم خرج فمر على قوم من الأنصار فقال هو يشهد أنه صلى مع النبي صلى الله عليه وسلم وأنه قد وجه إلى الكعبة‏.‏ فانحرفوا وهم ركوع في صلاة العصر‏.‏",
      "text_en": " Narrated Al-Bara':                     When Allah's Apostle arrived at Medina, he prayed facing Jerusalem for sixteen or seventeen months but he wished that he would be ordered to face the Ka`ba. So Allah revealed: -- 'Verily! We have seen the turning of your face towards the heaven; surely we shall turn you to a prayer direction (Qibla) that shall please you.' (2.144) Thus he was directed towards the Ka`ba. A man prayed the `Asr prayer with the Prophet and then went out, and passing by some people from the Ansar, he said, \"I testify. that I have prayed with the Prophet and he (the Prophet) has prayed facing the Ka`ba.\" Thereupon they, who were bowing in the `Asr prayer, turned towards the Ka`ba.",
      "chain": [
        "30020",
        "20032",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "7444",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا يحيى، حدثنا ابن عيينة، عن منصور بن صفية، عن أمه، عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم‏.‏ حدثنا محمد  هو ابن عقبة  حدثنا الفضيل بن سليمان النميري البصري حدثنا منصور بن عبد الرحمن ابن شيبة حدثتني أمي عن عائشة  رضى الله عنها  أن امرأة سألت النبي صلى الله عليه وسلم عن الحيض كيف تغتسل منه قال ‏\"‏ تأخذين فرصة ممسكة فتوضئين بها ‏\"‏‏.‏ قالت كيف أتوضأ بها يا رسول الله قال النبي صلى الله عليه وسلم ‏\"‏ توضئي ‏\"‏‏.‏ قالت كيف أتوضأ بها يا رسول الله قال النبي صلى الله عليه وسلم ‏\"‏ توضئين بها ‏\"‏‏.‏ قالت عائشة فعرفت الذي يريد رسول الله صلى الله عليه وسلم فجذبتها إلى فعلمتها‏.‏",
      "text_en": " Narrated `Aisha:                     A woman asked the Prophet (Hadith 456).Narrated `Aisha:A woman asked the Prophet about the periods: How to take a bath after the periods. He said, \"Take a perfumed piece of cloth and clean yourself with it.\" She said,' \"How shall I clean myself with it, O Allah's Apostle?\" The Prophet said, \"Clean yourself\" She said again, \"How shall I clean myself, O Allah's Apostle?\" The Prophet said, \"Clean yourself with it.\" Then I knew what Allah's Apostle meant. So I pulled her aside and explained it to her.",
      "chain": [
        "30020",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "7546",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أمشي مع رسول الله صلى الله عليه وسلم في حرث بالمدينة وهو متكئ على عسيب، فمر بقوم من اليهود فقال بعضهم لبعض سلوه عن الروح‏.‏ وقال بعضهم لا تسألوه عن الروح‏.‏ فسألوه فقام متوكئا على العسيب وأنا خلفه، فظننت أنه يوحى إليه فقال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏ فقال بعضهم لبعض قد قلنا لكم لا تسألوه‏.‏",
      "text_en": " Narrated `Abdullah:                     While I was walking with Allah's Apostle in one of the fields of Medina and he was walking leaning on a stick, he passed a group of Jews. Some of them said to the others, \"Ask him (the Prophet) about the spirit.\" Others said, \"Do not ask him.\" But they asked him and he stood leaning on the stick and I was standing behind him and I thought that he was being divinely inspired. Then he said, \"They ask you concerning the spirit say: The spirit, its knowledge is with My Lord. And of knowledge you (O men!) have been given only a little.\" ...(17.85) On that some of the Jews said to the others, \"Didn't we tell you not to ask?\"",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7567",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، سمع أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقل أحدكم اللهم اغفر لي إن شئت، ارحمني إن شئت، ارزقني إن شئت، وليعزم مسألته، إنه يفعل ما يشاء، لا مكره له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None of you should say: 'O Allah! Forgive me if You wish,' or 'Bestow Your Mercy on me if You wish,' or 'Provide me with means of subsistence if You wish,' but he should be firm in his request, for Allah does what He will and nobody can force Him (to do anything).",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني الفضل بن سهل، قال حدثني يحيى بن معين، حدثنا حجاج، حدثنا ابن أبي ذئب، عن شرحبيل بن سعد، وكان، متهما ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "30020",
        "20219",
        "20177",
        "11101"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني يحيى بن معين، حدثنا غندر، حدثنا شعبة، ح وحدثنيه بشر بن خالد، - واللفظ له - أخبرنا محمد، - يعني ابن جعفر - عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال أمرنا بالصدقة ‏.‏ قال كنا نحامل - قال - فتصدق أبو عقيل بنصف صاع - قال - وجاء إنسان بشىء أكثر منه فقال المنافقون إن الله لغني عن صدقة هذا وما فعل هذا الآخر إلا رياء فنزلت ‏{‏ الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ ولم يلفظ بشر بالمطوعين ‏.‏",
      "text_en": " Abu Mas'ud reported:                      We were commanded to give charity (despite the fact.) that we were coolies. Abu 'Aqil donated half a sa'. And there came another man with more than this. The hypocrites said: Verily Allah does not stand in need of the charity of this, and the second one has done nothing but only made a show (of his charity). Then this verse was revealed.\" Those who scoff at the voluntary givers of charity among the believers as well as those who cannot find anything (to give) but with their hard labour\" (ix. 80). And Bishr did not utter the word Muttawwi'in.",
      "chain": [
        "30020",
        "20278",
        "20020",
        "20173",
        "20020",
        "11005",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني يحيى بن معين، حدثنا مروان بن معاوية الفزاري، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني تزوجت امرأة من الأنصار ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل نظرت إليها فإن في عيون الأنصار شيئا ‏\"‏ ‏.‏ قال قد نظرت إليها ‏.‏ قال ‏\"‏ على كم تزوجتها ‏\"‏ ‏.‏ قال على أربع أواق ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ على أربع أواق كأنما تنحتون الفضة من عرض هذا الجبل ما عندنا ما نعطيك ولكن عسى أن نبعثك في بعث تصيب منه ‏\"‏ ‏.‏ قال فبعث بعثا إلى بني عبس بعث ذلك الرجل فيهم ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      A man came to Allah's Messenger (may peace be upon him) and said: I have contracted marriage with a woman of the Ansar, whereupon Allah's Apostle (may peace be upon him) said: Did you cast a glance at her, for there is something in the eyes of the Ansar? He said: I did cast a glance at her, whereupon he said: For what (dower) did you marry her? He said: For four 'uqiyas. Thereupon Allah's Apostle (may peace be upon him) said: For four 'uqiyas; it seems as if you dig out silver from the side of this mountain (and that is why you are prepared to pay such a large amount of dower). We have nothing which we should give you. There is a possibility that we may send you to an (expedition) where you may get (booty). So he sent that man (in the expedition) which was despatched to Banu 'Abs.",
      "chain": [
        "30020",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3977",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثني يحيى بن معين، وهارون بن عبد الله، وحسين بن عيسى، قالوا حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمزابنة بيع ثمر النخل بالتمر كيلا وبيع الزبيب بالعنب كيلا وعن كل ثمر بخرصه ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) having forbidden Muzabana, and Muzabana is the selling of dry dates by measure for fresh dates and the selling of raisins by measure for grapes and selling of all Ports of fruits on the basis of calculation.",
      "chain": [
        "30020",
        "30524",
        "30326",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7172",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "قال يحيى وحدثني أبو سلمة، أن عروة بن الزبير، حدثه أن أسماء بنت أبي بكر حدثته أنها، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس شىء أغير من الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Asma' daughter of Abu Bakr, through another chain of transmitters.",
      "chain": [
        "30020",
        "10567",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "7207",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "وقال حدثنا يحيى، حدثنا سفيان، حدثني منصور، عن مجاهد، عن أبي معمر، عن عبد الله، بنحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30020",
        "20005",
        "11067",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "53",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، حدثنا وكيع، عن زكريا بن أبي زائدة، عن مصعب بن شيبة، عن طلق بن حبيب، عن ابن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ عشر من الفطرة قص الشارب وإعفاء اللحية والسواك والاستنشاق بالماء وقص الأظفار وغسل البراجم ونتف الإبط وحلق العانة وانتقاص الماء ‏\"‏ ‏.‏ يعني الاستنجاء بالماء ‏.‏ قال زكريا قال مصعب ونسيت العاشرة إلا أن تكون المضمضة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: Ten are the acts according to fitrah (nature): clipping the moustache, letting the beard grow, using the tooth-stick, cutting the nails, washing the finger joints, plucking the hair under the arm-pits, shaving the pubes, and cleansing one's private parts (after easing or urinating) with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth.",
      "chain": [
        "30020",
        "20032",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "158",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، حدثنا عمرو بن الربيع بن طارق، أخبرنا يحيى بن أيوب، عن عبد الرحمن بن رزين، عن محمد بن يزيد، عن أيوب بن قطن، عن أبى بن عمارة، - قال يحيى بن أيوب وكان قد صلى مع رسول الله صلى الله عليه وسلم للقبلتين - أنه قال يا رسول الله أمسح على الخفين قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال يوما قال ‏\"‏ يوما ‏\"‏ ‏.‏ قال ويومين قال ‏\"‏ ويومين ‏\"‏ ‏.‏ قال وثلاثة قال ‏\"‏ نعم وما شئت ‏\"‏ ‏.‏ قال أبو داود رواه ابن أبي مريم المصري عن يحيى بن أيوب عن عبد الرحمن بن رزين عن محمد بن يزيد بن أبي زياد عن عبادة بن نسى عن أبى بن عمارة قال فيه حتى بلغ سبعا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم وما بدا لك ‏\"‏ قال أبو داود وقد اختلف في إسناده وليس هو بالقوي ورواه ابن أبي مريم ويحيى بن إسحاق السيلحيني عن يحيى بن أيوب وقد اختلف في إسناده ‏.‏",
      "text_en": " Narrated Ubayy ibn Umarah:                     I asked: Messenger of Allah (ﷺ) may I wipe over the socks? He replied: Yes. He asked: For one day? He replied: For one day. He again asked: And for two days? He replied: For two days too. He again asked: And for three days? He replied: Yes, as long as you wish.Abu Dawud said: Another version says: He asked him about the period until he reached the period of seven days. The Messenger of Allah (ﷺ) replied: Yes, as long as you wish (i.e. there is no time limit).Abu Dawud said: There is a variance in the chain of narrators of this tradition. The chain is not strong.Another chain from Yahya b. Ayyub is also disputed.",
      "chain": [
        "30020",
        "30206",
        "20379",
        "34204",
        "18069",
        "30526"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، وهناد بن السري، وعثمان بن أبي شيبة، عن عبد السلام بن حرب، - وهذا لفظ حديث يحيى - عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يسجد وينام وينفخ ثم يقوم فيصلي ولا يتوضأ ‏.‏ قال فقلت له صليت ولم تتوضأ وقد نمت فقال ‏\"‏ إنما الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ زاد عثمان وهناد ‏\"‏ فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو داود قوله ‏\"‏ الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ هو حديث منكر لم يروه إلا يزيد أبو خالد الدالاني عن قتادة وروى أوله جماعة عن ابن عباس ولم يذكروا شيئا من هذا وقال كان النبي صلى الله عليه وسلم محفوظا وقالت عائشة - رضى الله عنها - قال النبي صلى الله عليه وسلم ‏\"‏ تنام عيناى ولا ينام قلبي ‏\"‏ ‏.‏ وقال شعبة إنما سمع قتادة من أبي العالية أربعة أحاديث حديث يونس بن متى وحديث ابن عمر في الصلاة وحديث القضاة ثلاثة وحديث ابن عباس حدثني رجال مرضيون منهم عمر وأرضاهم عندي عمر ‏.‏ قال أبو داود وذكرت حديث يزيد الدالاني لأحمد بن حنبل فانتهرني استعظاما له وقال ما ليزيد الدالاني يدخل على أصحاب قتادة ولم يعبأ بالحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) used to prostrate and sleep (in prostration) and produce puffing sounds (during sleep). Then he would stand and pray and would not perform ablution. I said to him: you prayed but did not perform ablution though you slept (in prostration). He replied: Ablution is necessary for one who sleeps while he is lying down. Uthman and Hannad added: For when he lies down, his joints are relaxed.Abu Dawud said: The statement \"ablution is necessary for one who sleeps while one is lying down\" is a munkar (rejected) tradition. It has been narrated only by Yazid Abu Khalid al-Dalani, on the authority of Qatadah. And its earlier part has been narrated by a group (of narrators) from Ibn 'Abbas; they did not mention anything about it. He (Ibn 'Abbas) said: The Prophet (ﷺ) was protected (during his sleep). 'Aishah reported: The Prophet (ﷺ) said: My eyes sleep, but my heart does not sleep. Shu'bah said: Qatadah heard from Abu'l-'Aliyah only four traditions: the tradition about Jonah son of Matthew, the tradition reported by Ibn 'Umar about prayer, the tradition stating that the judges are three, and the tradition narrated by Ibn 'Abbas saying: (This tradition) has been narrated to me by reliable persons ; 'Umar is one of them, and the most reliable of them in my opinion is 'Umar. Abu Dawud said: I asked Ahmad b. Hanbal about the tradition narrated by Yazid al-Dalani. He rebuked me out of respect for him. Then he said: Yazid al-Dalani does not add anything to what has been narrated by the teachers of Qatadah. He did not care of this tradition (due to its weakness).",
      "chain": [
        "30020",
        "30480",
        "30203",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "561",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن معين، حدثنا أبو عبيدة الحداد، حدثنا إسماعيل أبو سليمان الكحال، عن عبد الله بن أوس، عن بريدة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بشر المشائين في الظلم إلى المساجد بالنور التام يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: Give good tidings to those who walk to the mosques in darkness for having a perfect light on the Day of Judgment.",
      "chain": [
        "30020",
        "20257"
      ]
    },
    {
      "hadith_no": "679",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن معين، حدثنا عبد الرزاق، عن عكرمة بن عمار، عن يحيى بن أبي كثير، عن أبي سلمة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال قوم يتأخرون عن الصف الأول حتى يؤخرهم الله في النار ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah reported the Messenger of Allah (ﷺ) as saying the people will continue to keep themselves away from the front row until Allah will keep them away (from the front) in the Hell-fire.",
      "chain": [
        "30020",
        "20121",
        "10704",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "845",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني أبو الزبير، أنه سمع طاوسا، يقول قلنا لابن عباس في الإقعاء على القدمين في السجود ‏.‏ فقال هي السنة ‏.‏ قال قلنا إنا لنراه جفاء بالرجل ‏.‏ فقال ابن عباس هي سنة نبيك صلى الله عليه وسلم ‏.‏",
      "text_en": " Tawus said:                      we asked Ibn ‘Abbas about sitting on heels between the two prostrations. He said: It is the sunnah. We said: We look upon it as a pressure on the foot. He said: This is the sunnah of your  Prophet(ﷺ)",
      "chain": [
        "30020",
        "20381",
        "11070",
        "11263",
        "11053"
      ]
    },
    {
      "hadith_no": "1256",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن معين، حدثنا مروان بن معاوية، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) would recite in both rak'ahs of the dawn prayer: \"Say, O unbelievers\" and \"Say: He is Allah, the one\"",
      "chain": [
        "30020",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1606",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج، عن ابن جريج، قال أخبرت عن ابن شهاب، عن عروة، عن عائشة، - رضى الله عنها - أنها قالت وهي تذكر شأن خيبر كان النبي صلى الله عليه وسلم يبعث عبد الله بن رواحة إلى يهود خيبر فيخرص النخل حين يطيب قبل أن يؤكل منه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Describing the conquest of Khaybar Aisha said: The Prophet (ﷺ) used to send Abdullah ibn Rawahah to the Jews of Khaybar, and he would make an estimate of the palm trees when the fruit was in good condition before any of it was eaten.",
      "chain": [
        "30020",
        "20219",
        "11070",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1797",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن معين، قال حدثنا حجاج، حدثنا يونس، عن أبي إسحاق، عن البراء بن عازب، قال كنت مع علي حين أمره رسول الله صلى الله عليه وسلم على اليمن قال فأصبت معه أواقي فلما قدم علي من اليمن على رسول الله صلى الله عليه وسلم وجد فاطمة - رضى الله عنها - قد لبست ثيابا صبيغا وقد نضحت البيت بنضوح فقالت ما لك فإن رسول الله صلى الله عليه وسلم قد أمر أصحابه فأحلوا قال قلت لها إني أهللت بإهلال النبي صلى الله عليه وسلم ‏.‏ قال فأتيت النبي صلى الله عليه وسلم فقال لي ‏\"‏ كيف صنعت ‏\"‏ ‏.‏ فقال قلت أهللت بإهلال النبي صلى الله عليه وسلم ‏.‏ قال ‏\"‏ فإني قد سقت الهدى وقرنت ‏\"‏ ‏.‏ قال فقال لي ‏\"‏ انحر من البدن سبعا وستين أو ستا وستين وأمسك لنفسك ثلاثا وثلاثين أو أربعا وثلاثين وأمسك لي من كل بدنة منها بضعة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     I was with Ali (may Allah be pleased with him) when the Messenger of Allah (ﷺ) appointed him to be the governor of the Yemen. I collected some ounces of gold during my stay with him.  When Ali returned from the Yemen to the Messenger of Allah (ﷺ) he said: I found that Fatimah had put on coloured clothes and the smell of the perfume she had used was pervading the house. (He expressed his amazement at the use of coloured clothes and perfume.)  She said: What is wrong with you? The Messenger of Allah (ﷺ) has ordered his companions to put off their ihram and they did so.  Ali said: I said to her: I raised my voice in talbiyah for which the Prophet (ﷺ) raised his voice (i.e. I wore ihram for qiran). Then I came to the Prophet (ﷺ).  He asked (me): How did you do?  I replied: I raised my voice in talbiyah, for which the Prophet (ﷺ) raised his voice.  He said: I have brought the sacrificial animals with me and combined umrah and hajj. He said to me: Sacrifice sixty-seven or sixty-six camels (for me) and withhold for yourself thirty-three or thirty-four, and withhold a piece (of flesh) for me from every camel.",
      "chain": [
        "30020",
        "20219",
        "20475",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1870",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن معين، أن محمد بن جعفر، حدثهم حدثنا شعبة، قال سمعت أبا قزعة، يحدث عن المهاجر المكي، قال سئل جابر بن عبد الله عن الرجل، يرى البيت يرفع يديه فقال ما كنت أرى أحدا يفعل هذا إلا اليهود وقد حججنا مع رسول الله صلى الله عليه وسلم فلم يكن يفعله ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     was asked about a man who looks at the House (the Ka'bah) and raises his hands (for prayer). He replied: I did not find anyone doing this except the Jews. We performed hajj along with the Messenger of Allah (ﷺ), but he did not do so.",
      "chain": [
        "30020",
        "20173",
        "20020",
        "10689"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن حنبل، حدثنا يحيى، عن ابن جريج، قال أخبرني أبو الزبير، قال سمعت جابر بن عبد الله، يقول لم يطف النبي صلى الله عليه وسلم ولا أصحابه بين الصفا والمروة إلا طوافا واحدا طوافه الأول ‏.‏",
      "text_en": " Jabir bin ‘Abdallah said “Neither the Prophet (ﷺ) nor his Companions ran between Al Safa’ and Al Marwah except once and that was his first running.”",
      "chain": [
        "30020",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1943",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن خلاد الباهلي، حدثنا يحيى، عن ابن جريج، أخبرني عطاء، أخبرني مخبر، عن أسماء، أنها رمت الجمرة قلت إنا رمينا الجمرة بليل ‏.‏ قالت إنا كنا نصنع هذا على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ata' said:                      A reporter reported to me about Asma' that she threw pebbles at the jamrah at night. I said: We threw pebbles (at the jamrah) at night. She said: We used to do so in the lifetime of the Messenger of Allah (ﷺ).",
      "chain": [
        "30020",
        "11070",
        "11029",
        "70"
      ]
    },
    {
      "hadith_no": "1958",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر، محمد بن خلاد الباهلي حدثنا يحيى، عن ابن جريج، حدثني حريز، أو أبو حريز - الشك من يحيى - أنه سمع عبد الرحمن بن فروخ، يسأل ابن عمر قال إنا نتبايع بأموال الناس فيأتي أحدنا مكة فيبيت على المال فقال أما رسول الله صلى الله عليه وسلم فبات بمنى وظل ‏.‏",
      "text_en": " Ibn Jurayj asked Ibn Umar:                      We sell the property of the people; so one of us goes to Mecca and passes the night there with the property (during the stay at Mina). He said: The Messenger of Allah (ﷺ) used to pass night and day at Mina.",
      "chain": [
        "30020",
        "11070"
      ]
    },
    {
      "hadith_no": "1999",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، ويحيى بن معين، - المعنى واحد - قالا حدثنا ابن أبي عدي، عن محمد بن إسحاق، حدثنا أبو عبيدة بن عبد الله بن زمعة، عن أبيه، وعن أمه، زينب بنت أبي سلمة عن أم سلمة، - يحدثانه جميعا ذاك عنها - قالت كانت ليلتي التي يصير إلى فيها رسول الله صلى الله عليه وسلم مساء يوم النحر فصار إلى ودخل على وهب بن زمعة ومعه رجل من آل أبي أمية متقمصين فقال رسول الله صلى الله عليه وسلم لوهب ‏\"‏ هل أفضت أبا عبد الله ‏\"‏ ‏.‏ قال لا والله يا رسول الله ‏.‏ قال صلى الله عليه وسلم ‏\"‏ انزع عنك القميص ‏\"‏ ‏.‏ قال فنزعه من رأسه ونزع صاحبه قميصه من رأسه ثم قال ولم يا رسول الله قال ‏\"‏ إن هذا يوم رخص لكم إذا أنتم رميتم الجمرة أن تحلوا ‏\"‏ ‏.‏ يعني من كل ما حرمتم منه إلا النساء ‏\"‏ فإذا أمسيتم قبل أن تطوفوا هذا البيت صرتم حرما كهيئتكم قبل أن ترموا الجمرة حتى تطوفوا به ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The night which the Messenger of Allah (ﷺ) passed with me was the one that followed the day of sacrifice. He came to me and Wahb ibn Zam'ah also visited me. A man belonging to the lineage of AbuUmayyah accompanied him. Both of them were wearing shirts.  The Messenger of Allah (ﷺ) said to Wahb: Did you perform the obligatory circumambulation (Tawaf az-Ziyarah), AbuAbdullah?  He said: No, by Allah Messenger of Allah.  He (the Prophet) said: Take off your shirt. He then took it off over his head, and his companion too took his shirt off over his head.  He then asked: And why (this), Messenger of Allah?  He replied: On this day you have been allowed to take off ihram when you have thrown the stones at the jamrahs, that is, everything prohibited during the state of ihram is lawful except intercourse with a woman. If the evening comes before you go round this House (the Ka'bah) you will remain in the sacred state (i.e. ihram), just like the state in which you were before you threw stones at the jamrahs, until you perform the circumambulation of it (i.e. the Ka'bah).",
      "chain": [
        "30007",
        "30020",
        "20276",
        "11107",
        "11120",
        "244"
      ]
    },
    {
      "hadith_no": "2007",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن معين، حدثنا هشام بن يوسف، عن ابن جريج، أخبرني عبيد الله بن أبي يزيد، أن عبد الرحمن بن طارق، أخبره عن أمه، أن رسول الله صلى الله عليه وسلم كان إذا جاز مكانا من دار يعلى - نسيه عبيد الله - استقبل البيت فدعا ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Tariq:                     AbdurRahman reported on the authority of his mother: When the Messenger of Allah (ﷺ) passed any place from the house of Ya'la,--the narrator Ubaydullah forgot its name--he faced the House (the Ka'bah) and supplicated.",
      "chain": [
        "30020",
        "20467",
        "11070",
        "11258"
      ]
    },
    {
      "hadith_no": "2051",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا إبراهيم بن محمد التيمي، حدثنا يحيى، عن عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، أن مرثد بن أبي مرثد الغنوي، كان يحمل الأسارى بمكة وكان بمكة بغي يقال لها عناق وكانت صديقته قال جئت إلى النبي صلى الله عليه وسلم فقلت يا رسول الله أنكح عناق قال فسكت عني فنزلت ‏{‏ والزانية لا ينكحها إلا زان أو مشرك ‏}‏ فدعاني فقرأها على وقال ‏\"‏ لا تنكحها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     Marthad ibn AbuMarthad al-Ghanawi used to take prisoners (of war) from Mecca (to Medina). At Mecca there was a prostitute called Inaq who had illicit relations with him. (Marthad said:) I came to the Prophet (ﷺ) and said to him: May I marry Inaq, Messenger of Allah? The narrator said: He kept silence towards me. Then the verse was revealed:\"....and the adulteress none shall marry save and adulterer or an idolater.\" He called me and recited this (verse) to me, and said: Do not marry her.",
      "chain": [
        "30020",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2136",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن معين، ومحمد بن عيسى، - المعنى - قالا حدثنا عباد بن عباد، عن عاصم، عن معاذة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستأذننا إذا كان في يوم المرأة منا بعد ما نزلت ‏{‏ ترجي من تشاء منهن وتؤوي إليك من تشاء ‏}‏ قالت معاذة فقلت لها ما كنت تقولين لرسول الله صلى الله عليه وسلم قالت كنت أقول إن كان ذلك إلى لم أوثر أحدا على نفسي ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to aske our permission on the day he had to stay with one of his wives (by turns) after the following Qur'anic verse was revealed: \"You may distance those whom you like, and draw close to those whom you like\" [33:51]. The narrator Mu'adhah said: I said to her: What did you say to the Messenger of Allah (ﷺ) ? She said: I used to say: If had an option for that, I would not preferred anyone to myself.",
      "chain": [
        "30020",
        "31167",
        "20243",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "2243",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن معين، حدثنا وهب بن جرير، عن أبيه، قال سمعت يحيى بن أيوب، عن يزيد بن أبي حبيب، عن أبي وهب الجيشاني، عن الضحاك بن فيروز، عن أبيه، قال قلت يا رسول الله إني أسلمت وتحتي أختان ‏.‏ قال ‏\"‏ طلق أيتهما شئت ‏\"‏ ‏.‏",
      "text_en": " Al-Dahhak b. Firuz reported on the authority of his father:                       I said: Messenger of Allah, I have embraced Islam and two sisters are my wives. He said: Divorce any one of them you wish.",
      "chain": [
        "30020",
        "20298",
        "11272",
        "20379",
        "11411",
        "18453"
      ]
    },
    {
      "hadith_no": "2492",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن معين، حدثنا هشام بن يوسف، عن معمر، عن زيد بن أسلم، عن عطاء بن يسار، عن أخت أم سليم الرميصاء، قالت نام النبي صلى الله عليه وسلم فاستيقظ وكانت تغسل رأسها فاستيقظ وهو يضحك فقالت يا رسول الله أتضحك من رأسي قال ‏\"‏ لا ‏\"‏ ‏.‏ وساق هذا الخبر يزيد وينقص ‏.‏",
      "text_en": " Umm Sulaim Al Rumaisa said “The Prophet(ﷺ) slept and awoke while she was washing her head.” He awoke laughing. She asked “Apostle of Allaah(ﷺ) are you laughing at my head?” He replied, No. She then narrated the rest of the tradition enlarging and reducing.Abu Dawud said:                      Al-Rumaisa was the foster sister of Umm Sulaim.",
      "chain": [
        "30020",
        "20467",
        "20115",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "2545",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حسين بن محمد، عن شيبان، عن عيسى بن علي، عن أبيه، عن جده ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ يمن الخيل في شقرها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: The most favoured horses are the sorrel.",
      "chain": [
        "30020",
        "20384",
        "20240",
        "17"
      ]
    },
    {
      "hadith_no": "2627",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن معين، حدثنا عبد الصمد بن عبد الوارث، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن بشر بن عاصم، عن عقبة بن مالك، من رهطه قال بعث النبي صلى الله عليه وسلم سرية فسلحت رجلا منهم سيفا فلما رجع قال لو رأيت ما لامنا رسول الله صلى الله عليه وسلم قال ‏\"‏ أعجزتم إذ بعثت رجلا منكم فلم يمض لأمري أن تجعلوا مكانه من يمضي لأمري ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Malik:                     The Prophet (ﷺ) sent a detachment. I gave a sword to a man from among them. When he came back, he said: Would that you saw us how the Messenger of Allah (ﷺ) rebuked us, saying: When I sent out a man who does not fulfil my command, are you unable to appoint in his place one who will fulfil my command.",
      "chain": [
        "30020",
        "20250",
        "20236",
        "11281"
      ]
    },
    {
      "hadith_no": "2732",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، ويحيى بن معين، قالا حدثنا يحيى، عن مالك، عن الفضيل، عن عبد الله بن نيار، عن عروة، عن عائشة، قال يحيى أن رجلا، من المشركين لحق بالنبي صلى الله عليه وسلم ليقاتل معه فقال ‏\"‏ ارجع ‏\"‏ ‏.‏ ثم اتفقا فقال ‏\"‏ إنا لا نستعين بمشرك ‏\"‏ ‏.‏",
      "text_en": " A’ishah said (this is the version of narrator Yahya). A man from the polytheists accompanied the Prophet (ﷺ) to fight along with him. He said “Go back. Both the narrators (Musaddad and Yahya) then agreed. The Prophet said “We do not want any help from a polytheist.”",
      "chain": [
        "30175",
        "30020",
        "20031",
        "20001",
        "20271",
        "10511",
        "53",
        "20031"
      ]
    },
    {
      "hadith_no": "2796",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حفص، عن جعفر، عن أبيه، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم يضحي بكبش أقرن فحيل ينظر في سواد ويأكل في سواد ويمشي في سواد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) used to sacrifice a choice, horned ram with black round the eyes, the mouth and the feet.",
      "chain": [
        "30020",
        "20317",
        "11407",
        "38"
      ]
    },
    {
      "hadith_no": "2861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حماد بن خالد الخياط، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة الخشني، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رميت الصيد فأدركته بعد ثلاث ليال وسهمك فيه فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Prophet (ﷺ) said: When you shoot your arrow (and the animal goes out of your sight) and you come three days later on it, and in it there is your arrow, then eat provided it has not stench.",
      "chain": [
        "30020",
        "20537",
        "20675",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "3088",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا يحيى بن معين، حدثنا وهب بن جرير، حدثنا أبي، سمعت محمد بن إسحاق، يحدث عن إسماعيل بن أمية، عن بجير بن أبي بجير، قال سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول حين خرجنا معه إلى الطائف فمررنا بقبر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا قبر أبي رغال وكان بهذا الحرم يدفع عنه فلما خرج أصابته النقمة التي أصابت قومه بهذا المكان فدفن فيه وآية ذلك أنه دفن معه غصن من ذهب إن أنتم نبشتم عنه أصبتموه معه ‏\"‏ ‏.‏ فابتدره الناس فاستخرجوا الغصن ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     When we went out along with the Messenger of Allah (ﷺ) to at-Ta'if we passed a grave. I heard the Messenger of Allah (ﷺ) say: This is the grave of AbuRighal. He was in this sacred mosque (sanctuary) protecting himself (from punishment). When he came out, he suffered the same punishment which his people suffered at this place, and he was buried in it. The sign of it is that a golden bough was buried with him. If you dig it out, you will find it with him. The people hastened to it and took out the bough.",
      "chain": [
        "30020",
        "20298",
        "11272",
        "11107",
        "11417",
        "29"
      ]
    },
    {
      "hadith_no": "3302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج، عن ابن جريج، قال أخبرني الأحول، أن طاوسا، أخبره عن ابن عباس، ‏:‏ أن النبي صلى الله عليه وسلم مر وهو يطوف بالكعبة بإنسان يقوده بخزامة في أنفه، فقطعها النبي صلى الله عليه وسلم بيده وأمره أن يقوده بيده ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Prophet (ﷺ) while going round the Ka'bah passed a man who was led with a ring of bridle in his nose. The Prophet (ﷺ) cut it off with his hand and ordered to lead him by catching his hand.",
      "chain": [
        "30020",
        "20219",
        "11070",
        "11053"
      ]
    },
    {
      "hadith_no": "3338",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن أبي رزمة، سمعت أبي يقول، قال رجل لشعبة خالفك سفيان ‏.‏ قال دمغتني ‏.‏ وبلغني عن يحيى بن معين قال كل من خالف سفيان فالقول قول سفيان ‏.‏",
      "text_en": " Narrated Ibn Abi Rizmah:                     I heard my father say: A man said to Shu'bah: Sufyan opposed you (i.e. narrated a tradition which differs from your version). He replied: You racked my mind. I have been told that Yahya b. Ma'in said: If anyone opposes Sufyan, the version of Sufyan will be acceptable.",
      "chain": [
        "30020"
      ]
    },
    {
      "hadith_no": "3374",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، ويحيى بن معين، قالا حدثنا سفيان، عن حميد الأعرج، عن سليمان بن عتيق، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم نهى عن بيع السنين ووضع الجوائح ‏.‏ قال أبو داود لم يصح عن النبي صلى الله عليه وسلم في الثلث شىء وهو رأى أهل المدينة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) forbade selling fruits years ahead, and commanded that unforeseen loss be remitted in respect of what is affected by blight.Abu Dawud said: The attribution of the tradition regarding the effect of blight is one-third of the produce to the Prophet (ﷺ) is not correct. This is the opinion of the people of Medina.",
      "chain": [
        "30007",
        "30020",
        "20005",
        "11856",
        "34"
      ]
    },
    {
      "hadith_no": "3406",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن معين، حدثنا ابن رجاء، - يعني المكي - قال ابن خثيم حدثني عن أبي الزبير، عن جابر بن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من لم يذر المخابرة فليأذن بحرب من الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     I heard the Messenger of Allah (ﷺ) say: If any of you does not leave mukhabarah, he should take notice of war from Allah and His Apostle (ﷺ).",
      "chain": [
        "30020",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3413",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج، عن ابن جريج، قال أخبرت عن ابن شهاب، عن عروة، عن عائشة، - رضى الله عنها - قالت كان النبي صلى الله عليه وسلم يبعث عبد الله بن رواحة فيخرص النخل حين يطيب قبل أن يؤكل منه ثم يخير يهود يأخذونه بذلك الخرص أو يدفعونه إليهم بذلك الخرص لكى تحصى الزكاة قبل أن تؤكل الثمار وتفرق ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) used to send Abdullah ibn Rawahah (to Khaybar), and he would assess the amount of dates when they began to ripen before they were eaten (by the Jews). He would then give choice to the Jews that they have them (on their possession) by that assessment or could assign to them (Muslims) by that assignment, so that the (amount of) zakat could be calculated before the fruit became eatable and distributed (among the people).",
      "chain": [
        "30020",
        "20219",
        "11070",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3460",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حفص، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أقال مسلما أقاله الله عثرته ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone rescinds a sale with a Muslim, Allah will cancel his slip, on the Day of Resurrection.",
      "chain": [
        "30020",
        "20317",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4999",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج بن محمد، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن العيزار بن حريث، عن النعمان بن بشير، قال استأذن أبو بكر رحمة الله عليه على النبي صلى الله عليه وسلم فسمع صوت عائشة عاليا فلما دخل تناولها ليلطمها وقال لا أراك ترفعين صوتك على رسول الله صلى الله عليه وسلم فجعل النبي صلى الله عليه وسلم يحجزه وخرج أبو بكر مغضبا فقال النبي صلى الله عليه وسلم حين خرج أبو بكر ‏\"‏ كيف رأيتني أنقذتك من الرجل ‏\"‏ ‏.‏ قال فمكث أبو بكر أياما ثم استأذن على رسول الله صلى الله عليه وسلم فوجدهما قد اصطلحا فقال لهما أدخلاني في سلمكما كما أدخلتماني في حربكما ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قد فعلنا قد فعلنا ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     When AbuBakr asked the permission of the Prophet (ﷺ) to come in, he heard Aisha speaking in a loud voice.  So when he entered, he caught hold of her in order to slap her, and said: Do I see you raising your voice to the Messenger of Allah? The Prophet (ﷺ) began to prevent him and AbuBakr went out angry. The Prophet (ﷺ) said when AbuBakr went out: You see I rescued you from the man.  AbuBakr waited for some days, then asked permission of the Messenger of Allah (ﷺ) to enter, and found that they had made peace with each other. He said to them: Bring me into your peace as you brought me into your war.  The Prophet (ﷺ) said: We have done so: we have done so.",
      "chain": [
        "30020",
        "20381",
        "10846",
        "11049",
        "10808",
        "274"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد، حدثنا يحيى بن معين، حدثنا هشام بن يوسف، حدثني عبد الله بن بحير، أنه سمع هانئا، مولى عثمان قال كان عثمان إذا وقف على قبر بكى حتى يبل لحيته فقيل له تذكر الجنة والنار فلا تبكي وتبكي من هذا فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن القبر أول منازل الآخرة فإن نجا منه فما بعده أيسر منه وإن لم ينج منه فما بعده أشد منه ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ ما رأيت منظرا قط إلا والقبر أفظع منه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث هشام بن يوسف ‏.‏",
      "text_en": " Hani' the freed slave of 'Uthman said:                     When 'Uthman would stop at a grave he would cry until his beard was soaked (in tears). It was said to him: 'The Paradise and the Fire were mentioned and you did not cry, yet you cry because of this?' So he said: 'Indeed the Messenger of Allah said: \"Indeed the grave isAllah the first stage among the stages of the Hereafter. So if one is saved from it, then what comes after it is easier than it. And if one is not saved from it, then what comes after it is worse than it.\" And the Messenger of Allah said: \"I have not seen any sight except that the grave is more horrible than it.\"",
      "chain": [
        "30480",
        "30020",
        "20467",
        "28278"
      ]
    },
    {
      "hadith_no": "3604e",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى، أخبرنا يعلى بن عبيد، قال أخبرنا يحيى بن عبيد الله، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يرفع يديه حتى يبدو إبطه يسأل الله مسألة إلا آتاها إياه ما لم يعجل ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف عجلته قال ‏\"‏ يقول قد سألت وسألت ولم أعط شيئا ‏\"‏ ‏.‏ وروى هذا الحديث الزهري عن أبي عبيد مولى ابن أزهر عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ يستجاب لأحدكم ما لم يعجل يقول دعوت فلم يستجب لي ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated the the Messenger of Allah said:                     “There is not a worshipper who raises his hands, such that his armpit becomes visible, asking Allah for something, except that He shall grant it to him - as long as he does not become hasty.” They said: “O Messenger of Allah, and how is haste made concerning it?” He said: “He says: ‘I did ask and ask, and I was not given a thing.’”",
      "chain": [
        "30020",
        "20372",
        "10841",
        "13"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو داود، سليمان بن الأشعث قال أخبرنا يحيى بن معين، قال حدثنا هشام بن يوسف، عن عبد الله بن سليمان النوفلي، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحبوا الله لما يغذوكم من نعمه وأحبوني بحب الله وأحبوا أهل بيتي لحبي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"Love Allah for what He nourishes you with of His Blessings, love me due to the love of Allah, and love the people of my house due to love of me.\"",
      "chain": [
        "30020",
        "20467",
        "28290",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن امرأة، قالت يا رسول الله إن الله لا يستحيي من الحق هل على المرأة غسل إذا هي احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏ ‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ففيم يشبهها الولد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that a woman said:                      \"O Messenger of Allah, Allah is not shy to tell the truth. Does a women have to perform Ghusl if she has a wet dream?\" He said: \"Yes, if she sees water.\"[1] Umm Salamah laughed and said: \"Do women really have wet dreams?\" The Messenger of Allah (ﷺ) said: \"How else would her child resemble her?\"[1] That is, if she has an emission of the fluid of an orgasm.",
      "chain": [
        "30020",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أخبرنا يحيى، قال حدثنا مسعر، قال حدثني واصل، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم لقيه وهو جنب ‏.‏ فأهوى إلى فقلت إني جنب فقال ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Huthaifah that the Prophet (ﷺ) met him when he was Junub:                      \"And he came close to me and reached out his hand. I said: 'I am Junub.' He said: 'The Muslim is not made impure (Najis).'\"",
      "chain": [
        "30313",
        "30020",
        "20359",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عمر بن حفص، قال حدثنا أبي ح، وأنبأنا إبراهيم بن يعقوب، قال حدثنا يحيى بن معين، قال حدثنا حفص، ح وأنبأنا عمرو بن منصور، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن الحسن بن عبيد الله، عن إبراهيم، عن يزيد بن أوس، عن ثابت بن قيس، عن أبي موسى، يرفعه قال ‏\"‏ أبردوا بالظهر فإن الذي تجدون من الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa in a Marfu' [1] report:                      \"Wait until it cools down to pray Zuhr, for the heat you experience is a breeze from Hell.\"[1] Meaning he attributed it to the Prophet (ﷺ).",
      "chain": [
        "38088",
        "30204",
        "20317",
        "38088",
        "30020",
        "20317",
        "38433",
        "30204",
        "20317",
        "10755",
        "11051",
        "15634",
        "239"
      ]
    },
    {
      "hadith_no": "707",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا يحيى، عن ابن جريج، قال حدثنا عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة ‏\"‏ ‏.‏ قال أول يوم ‏\"‏ الثوم ‏\"‏ ‏.‏ ثم قال ‏\"‏ الثوم والبصل والكراث فلا يقربنا في مساجدنا فإن الملائكة تتأذى مما يتأذى منه الإنس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever eats of this plant' - the first time he said 'garlic' then he said, 'garlic, onions and leeks' [1] - 'let him not approach us in our Masjids, for the angels are offended by that which offends mankinds.'\"[1] In Fath, Al-Bari, Ibn Hajar is of the opinion that it was Ibn Juraij who was talking, explaining that 'Ata' - who reported it from Jabir - narrated it both ways.",
      "chain": [
        "30313",
        "30020",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1148",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبيد الله بن سعيد أبو قدامة، قال حدثنا يحيى، عن شعبة، قال حدثني الحكم، عن ابن أبي ليلى، عن البراء، قال كان صلاة رسول الله صلى الله عليه وسلم ركوعه وسجوده وقيامه بعد ما يرفع رأسه من الركوع وبين السجدتين قريبا من السواء ‏.‏",
      "text_en": " It was narrated that Al-Bara' said:                     \"In the prayer of the Messenger of Allah (ﷺ), his bowing, his prostration, standing after he raised his head from bowing and (sitting) between the two prostrations, were almost the same.\"",
      "chain": [
        "30020",
        "20020",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أبو حفص، عمرو بن علي قال حدثنا يحيى، قال حدثنا الأعمش، عن عمارة، عن الأسود، قال قال عبد الله لا يجعلن أحدكم للشيطان من نفسه جزءا يرى أن حتما عليه أن لا ينصرف إلا عن يمينه لقد رأيت رسول الله صلى الله عليه وسلم أكثر انصرافه عن يساره ‏.‏",
      "text_en": " It was narrated that Al-Aswad said:                     \"Abdullah said: 'No one among you should allow the Shaitan to give him wrong ideas by making him believe that he can only leave after praying by moving to his right, because I saw the Messenger of Allah (ﷺ) usually departing to the left.'\"",
      "chain": [
        "30286",
        "30020",
        "11060",
        "11379",
        "11054"
      ]
    },
    {
      "hadith_no": "1640",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى، قال حدثنا زهير، عن أبي إسحاق، قال أتيت الأسود بن يزيد وكان لي أخا صديقا فقلت يا أبا عمرو حدثني ما حدثتك به أم المؤمنين عن صلاة رسول الله صلى الله عليه وسلم ‏.‏ قال قالت كان ينام أول الليل ويحيي آخره ‏.‏",
      "text_en": " It was narrated that Abu Ishaq said:                     \"I came to Al-Aswad bin Yazid, who was a close friend of mine and said: 'O Abu 'Amr, tell me what the Mother of the Believers told you about the prayer of the Messenger of Allah (ﷺ).' He said: 'She said: \"He used to sleep for the first part of the night and stay up for the latter part.'\"",
      "chain": [
        "30020",
        "20321",
        "11049"
      ]
    },
    {
      "hadith_no": "1642",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا شعيب بن يوسف، عن يحيى، عن هشام، قال أخبرني أبي، عن عائشة، أن النبي صلى الله عليه وسلم دخل عليها وعندها امرأة فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قالت فلانة لا تنام ‏.‏ فذكرت من صلاتها فقال ‏\"‏ مه عليكم بما تطيقون فوالله لا يمل الله عز وجل حتى تملوا ولكن أحب الدين إليه ما داوم عليه صاحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Prophet (ﷺ) came in to her and there was a woman with her. He said: \"Who is this?\" She said: \"So-and-so, and she does not sleep.\" And she told him about how she prayed a great deal. He said: \"Stop praising her. You should do what you can, for by Allah (SWT), Allah never gets tired (of giving reward) until you get tired. And the most beloved of religious actions to Him is that in which a person persists.\"",
      "chain": [
        "30020",
        "20295",
        "53"
      ]
    },
    {
      "hadith_no": "1767",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا يحيى، قال حدثنا الأوزاعي، قال حدثني يحيى، عن نافع، عن ابن عمر، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يركع بين النداء والصلاة ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that Hafsah said:                     \"The Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the call (the Adhan) and the prayer.\"",
      "chain": [
        "30313",
        "30020",
        "20024",
        "11449",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2725",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني معاوية بن صالح، قال حدثني يحيى بن معين، قال حدثنا حجاج، قال حدثنا يونس، عن أبي إسحاق، عن البراء، قال كنت مع علي بن أبي طالب حين أمره رسول الله صلى الله عليه وسلم على اليمن فلما قدم على النبي صلى الله عليه وسلم قال علي فأتيت رسول الله صلى الله عليه وسلم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ كيف صنعت ‏\"‏ ‏.‏ قلت أهللت بإهلالك ‏.‏ قال ‏\"‏ فإني سقت الهدى وقرنت ‏\"‏ ‏.‏ قال وقال صلى الله عليه وسلم لأصحابه ‏\"‏ لو استقبلت من أمري ما استدبرت لفعلت كما فعلتم ولكني سقت الهدى وقرنت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Bara said:                     \"I was with 'Ali bin Abi Talib when the Messenger of All appointed him as governor of Yemen. When he came to the Messenger of Allah, Ali said: 'I came to the Messenger of and the Messenger of Allah said: \"What did you do?\" I said; \"I entered Ihram for that for which you entered Ihram.\" He said: \"I have brought the Hadi and am performing Qiran\" And he said to his companions: \"If I had known what I know now, I would have done what you have done, but I brought the Hadi and I am performing Qiran",
      "chain": [
        "20675",
        "30020",
        "20219",
        "20475",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2745",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني أحمد بن محمد بن جعفر، قال حدثني يحيى بن معين، قال حدثنا حجاج، قال حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن البراء، قال كنت مع علي حين أمره النبي صلى الله عليه وسلم على اليمن فأصبت معه أواقي فلما قدم علي على النبي صلى الله عليه وسلم قال علي وجدت فاطمة قد نضحت البيت بنضوح قال فتخطيته فقالت لي ما لك فإن رسول الله صلى الله عليه وسلم قد أمر أصحابه فأحلوا قال قلت إني أهللت بإهلال النبي صلى الله عليه وسلم ‏.‏ قال فأتيت النبي صلى الله عليه وسلم فقال لي ‏\"‏ كيف صنعت ‏\"‏ ‏.‏ قلت إني أهللت بما أهللت ‏.‏ قال ‏\"‏ فإني قد سقت الهدى وقرنت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Bara' said:                     \"I was with 'Ali when the Messenger of Allah appointed him as governor of Yemen. When 'Ali came to the Messenger of Allah, 'Ali said: 'I found that Fatimah had perfumed the house with perfume.' He said: 'I tried to avoid it, and she said to me: what is the matter with you? The messenger of Allah told his Companions to exit Ihram.' He said: 'I said: I have entered Ihram for that for which the Prophet entered Ihram.\"\" He said: 'So I went to the Prophet and he said to me: \"What did you do?\" I said: \"I entered Ihram for that for which you entered Ihram.\" He said: \"I have brought the Hadi and am performing Qiran.\"",
      "chain": [
        "30304",
        "30020",
        "20219",
        "10846",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2832",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد أبو قدامة، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ خمس من الدواب لا جناح على من قتلهن - أو في قتلهن - وهو حرام الحدأة والفأرة والكلب العقور والعقرب والغراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Umar that:                     the Prophet said \"There are five kinds of animals for which there is no sin on the one who kills them when he is in a state of Ihram: Kites, mice, vicious dogs, scorpions and crows.\" (Sahih) Chpater 87. Killing Kites",
      "chain": [
        "30020",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3053",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إبراهيم بن محمد، قال حدثنا يحيى، عن سفيان، عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم أوضع في وادي محسر ‏.‏",
      "text_en": " It was narrated from Jabir that:                     the Prophet hurried in the valley of Muhassir.",
      "chain": [
        "30020",
        "20005",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3309",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا شعيب بن يوسف، عن يحيى، عن هشام، قال حدثني أبي، عن عبد الله بن الزبير، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحرم المصة والمصتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Az-Zubair that the Prophet said:                      \"Suckling once or twice does not make (marriage) prohibited.\"",
      "chain": [
        "30020",
        "20295",
        "106"
      ]
    },
    {
      "hadith_no": "3792",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إبراهيم بن محمد، قال حدثنا يحيى، عن عبيد الله بن الأخنس، قال أخبرني عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر ولا يمين فيما لا تملك ولا في معصية ولا قطيعة رحم ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that the Messenger of Allah said:                      \"There is no vow and no oath concerning that which one does not possess, nor to commit sin, nor to sever the ties of kinship.\"",
      "chain": [
        "30020",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4294",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا شعيب بن يوسف، عن يحيى، عن محمد بن يوسف، عن السائب بن يزيد، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شر الكسب مهر البغي وثمن الكلب وكسب الحجام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Waqi bin Khadij said:                     \"The Messenger of Allah said: 'The worst of earnings arte the gift of a female fornicator, the price of a dog and the earnings of a cupper.\"\"",
      "chain": [
        "30020",
        "30388",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4695",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا هشام بن عمار، قال حدثنا يحيى، قال حدثنا الزبيدي، عن الزهري، عن عبيد الله بن عبد الله، أنه سمع أبا هريرة، يقول إن النبي صلى الله عليه وسلم قال ‏\"‏ كان رجل يداين الناس وكان إذا رأى إعسار المعسر قال لفتاه تجاوز عنه لعل الله تعالى يتجاوز عنا ‏.‏ فلقي الله فتجاوز عنه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     The prophet said: \"A man used to lend to people, but if he realized that someone was going through hardship, he would say to his slave: 'Let him off, perhaps Allah, the Most High, will let us off.' And when he met Allah, He let him off.\"",
      "chain": [
        "30288",
        "30020",
        "20459",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "5405",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبد الأعلى بن حماد، قال حدثنا بشر بن السري، قال حدثنا عبد الله بن المبارك، عن معمر، ح وأنبأنا أحمد بن علي بن سعيد، قال حدثنا يحيى بن معين، قال حدثنا هشام بن يوسف، وعبد الرزاق، عن معمر، عن الزهري، عن سالم، عن أبيه، قال بعث النبي صلى الله عليه وسلم خالد بن الوليد إلى بني جذيمة فدعاهم إلى الإسلام فلم يحسنوا أن يقولوا أسلمنا فجعلوا يقولون صبأنا وجعل خالد قتلا وأسرا - قال - فدفع إلى كل رجل أسيره حتى إذا أصبح يومنا أمر خالد بن الوليد أن يقتل كل رجل منا أسيره ‏.‏ قال ابن عمر فقلت والله لا أقتل أسيري ولا يقتل أحد - وقال بشر - من أصحابي أسيره - قال - فقدمنا على النبي صلى الله عليه وسلم فذكر له صنع خالد فقال النبي صلى الله عليه وسلم ورفع يديه ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ قال زكريا في حديثه فذكر وفي حديث بشر فقال ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"The Prophet [SAW] sent Khalid bin Al-Walid to Banu Jadhimah. He called them to Islam, but they could not say Aslamna (we submitted, i.e., became Muslim) so they started to say Saba'na (we changed our religion). Khalid started killing and taking prisoners, and he gave a prisoner to each man. The next day Khalid bin Al-Walid issued orders that each man among us kill his prisoner.\" Ibn 'Umar said: \"I said: 'By Allah, I will not kill my prisoner, and no one (among my companions) will kill his prisoner.' We came to the Prophet [SAW], and he was told of what Khalid had done. The Prophet [SAW] said: 'I disavow what Khalid has done,' twice.\"",
      "chain": [
        "30146",
        "20190",
        "20025",
        "20115",
        "28001",
        "30020",
        "20467",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 103
}