{
  "id": "30021",
  "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
  "full_name": "Ishaq bin Rahwaya إسحاق بن راهويه",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "161",
      "date_gregorian": "NA",
      "date_display": [
        "161 AH"
      ],
      "place": "Merv"
    },
    "death": {
      "date_hijri": "238",
      "date_gregorian": "852",
      "date_display": null,
      "place": "Nisapur",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv",
      " Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  ت  س  -  ثقة حافظ ]",
      "Hadith",
      "Fiqh"
    ],
    "tags": [
      "al-Hanzali",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20446",
      "name": "'Atab bin Bashayr عتاب بن بشير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20239",
      "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38481",
      "name": "Muhammad bin Aflah al-Tark محمد بن أفلح بن عبد الملك - الترك",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "135",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، قال أخبرنا عبد الرزاق، قال أخبرنا معمر، عن همام بن منبه، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقبل صلاة من أحدث حتى يتوضأ ‏\"‏‏.‏ قال رجل من حضرموت ما الحدث يا أبا هريرة قال فساء أو ضراط‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not accepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is 'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "613",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن راهويه، قال حدثنا وهب بن جرير، قال حدثنا هشام، عن يحيى، نحوه‏.‏ قال يحيى وحدثني بعض، إخواننا أنه قال لما قال حى على الصلاة‏.‏ قال لا حول ولا قوة إلا بالله‏.‏ وقال هكذا سمعنا نبيكم صلى الله عليه وسلم يقول‏.‏",
      "text_en": " Narrated Yahya as above (586) and added:                     \"Some of my companions told me that Hisham had said, \"When the Mu'adh-dhin said, \"Haiyi `alassala (come for the prayer).\" Muawiya said, \"La hawla wala quwata illa billah (There is neither might nor any power except with Allah)\" and added, \"We heard your Prophet saying the same.\"",
      "chain": [
        "30021",
        "20298",
        "20295",
        "11449"
      ]
    },
    {
      "hadith_no": "623",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا أبو أسامة، قال عبيد الله حدثنا عن القاسم بن محمد، عن عائشة،‏.‏ وعن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال‏.‏ حوحدثني يوسف بن عيسى المروزي، قال حدثنا الفضل، قال حدثنا عبيد الله بن عمر، عن القاسم بن محمد، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن بلالا يؤذن بليل، فكلوا واشربوا حتى يؤذن ابن أم مكتوم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Bilal pronounces the Adhan at night, so eat and drink (Suhur) till Ibn Um Maktum pronounces the Adhan.\"",
      "chain": [
        "30021",
        "20318",
        "11201",
        "10535",
        "53",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "633",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا جعفر بن عون، قال حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم بالأبطح فجاءه بلال فآذنه بالصلاة، ثم خرج بلال بالعنزة حتى ركزها بين يدى رسول الله صلى الله عليه وسلم بالأبطح وأقام الصلاة‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     My father said, \"I saw Allah's Apostle at a place called Al-Abtah. Bilal came and informed him about the prayer and then came out with a short spear (or stick) and planted it in front of Allah's Apostle at Al-Abtah and pronounced the Iqama.\"",
      "chain": [
        "30021",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1045",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يحيى بن صالح، قال حدثنا معاوية بن سلام بن أبي سلام الحبشي الدمشقي، قال حدثنا يحيى بن أبي كثير، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف الزهري، عن عبد الله بن عمرو  رضى الله عنهما  قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     \"When the sun eclipsed in the lifetime of Allah's Apostle an announcement was made that a prayer was to be offered in congregation.\"",
      "chain": [
        "30021",
        "20470",
        "20401",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1086",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، قال قلت لأبي أسامة حدثكم عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تسافر المرأة ثلاثة أيام إلا مع ذي محرم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"A woman should not travel for more than three days except with a Dhi-Mahram (i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own husband.)\"",
      "chain": [
        "30021",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1110",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، حدثنا حرب، حدثنا يحيى، قال حدثني حفص بن عبيد الله بن أنس، أن أنسا  رضى الله عنه  حدثه أن رسول الله صلى الله عليه وسلم كان يجمع بين هاتين الصلاتين في السفر‏.‏ يعني المغرب والعشاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet started a journey before noon, he used to delay the Zuhr prayer till the time of `Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer and then ride (for the journey).",
      "chain": [
        "30021",
        "20250",
        "20220",
        "11449",
        "11686",
        "19"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، قال حدثني أبي، عن صالح، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبيه، أنه أخبره أنه، لما حضرت أبا طالب الوفاة جاءه رسول الله صلى الله عليه وسلم فوجد عنده أبا جهل بن هشام، وعبد الله بن أبي أمية بن المغيرة، قال رسول الله صلى الله عليه وسلم لأبي طالب ‏\"‏ يا عم، قل لا إله إلا الله، كلمة أشهد لك بها عند الله ‏\"‏‏.‏ فقال أبو جهل وعبد الله بن أبي أمية يا أبا طالب، أترغب عن ملة عبد المطلب فلم يزل رسول الله صلى الله عليه وسلم يعرضها عليه، ويعودان بتلك المقالة، حتى قال أبو طالب آخر ما كلمهم هو على ملة عبد المطلب، وأبى أن يقول لا إله إلا الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والله لأستغفرن لك، ما لم أنه عنك ‏\"‏‏.‏ فأنزل الله تعالى فيه ‏{‏ما كان للنبي‏}‏ الآية‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab from his father:                     When the time of the death of Abu Talib approached, Allah's Apostle went to him and found Abu Jahl bin Hisham and `Abdullah bin Abi Umaiya bin Al-Mughira by his side. Allah's Apostle said to Abu Talib, \"O uncle! Say: None has the right to be worshipped but Allah, a sentence with which I shall be a witness (i.e. argue) for you before Allah. Abu Jahl and `Abdullah bin Abi Umaiya said, \"O Abu Talib! Are you going to denounce the religion of `Abdul Muttalib?\" Allah's Apostle kept on inviting Abu Talib to say it (i.e. 'None has the right to be worshipped but Allah') while they (Abu Jahl and `Abdullah) kept on repeating their statement till Abu Talib said as his last statement that he was on the religion of `Abdul Muttalib and refused to say, 'None has the right to be worshipped but Allah.' (Then Allah's Apostle said, \"I will keep on asking Allah's forgiveness for you unless I am forbidden (by Allah) to do so.\" So Allah revealed (the verse) concerning him (i.e. It is not fitting for the Prophet and those who believe that they should invoke (Allah) for forgiveness for pagans even though they be of kin, after it has become clear to them that they are companions of the fire (9.113).",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني عيسى بن طلحة بن عبيد الله، أنه سمع عبد الله بن عمرو بن العاص  رضى الله عنهما  قال وقف رسول الله صلى الله عليه وسلم على ناقته‏.‏ فذكر الحديث‏.‏ تابعه معمر عن الزهري‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle stopped while on his she-camel (the sub-narrator then narrated the Hadith as above, i.e. 793).",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "1888",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  قال أقبلت وقد ناهزت الحلم، أسير على أتان لي، ورسول الله صلى الله عليه وسلم قائم يصلي بمنى، حتى سرت بين يدى بعض الصف الأول، ثم نزلت عنها فرتعت، فصففت مع الناس وراء رسول الله صلى الله عليه وسلم‏.‏ وقال يونس عن ابن شهاب بمنى في حجة الوداع‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Apostle was praying at Mina. I passed in front of a part of the first row and then dismounted from it, and the animal started grazing. I aligned with the people behind Allah's Apostle (The sub-narrator added that happened in Mina during the Prophet's Hajjat-al-Wada`.)",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير بن حازم، أخبرنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية وكان لي على العاص بن وائل دراهم، فأتيته أتقاضاه فقال لا أقضيك حتى تكفر بمحمد، فقلت لا والله لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله ثم يبعثك‏.‏ قال فدعني حتى أموت ثم أبعث فأوتى مالا وولدا، ثم أقضيك‏.‏ فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ الآية‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith In the Pre-Islamic period of ignorance, and 'Asi bin Wail owed me some money. I went to him to demand it, but he said to me, \"I will not pay you unless you reject faith in Muhammad.\" I replied, \"By Allah, I will never disbelieve Muhammad till Allah let you die and then resurrect you.\" He said, \"Then wait till I die and come to life again, for then I will be given property and offspring and will pay your right.\" So, thus revelation came: \"Have you seen him who disbelieved in Our signs and yet says, 'I will be given property and offspring?' \" (19.77)",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثني إسحاق، أخبرنا يزيد بن هارون، أخبرنا العوام، قال حدثني إبراهيم أبو إسماعيل السكسكي، سمع عبد الله بن أبي أوفى  رضى الله عنهما  يقول أقام رجل سلعته فحلف بالله لقد أعطي بها ما لم يعطها فنزلت ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ وقال ابن أبي أوفى الناجش آكل ربا خائن‏.‏",
      "text_en": " Narrated `Abdullah bin Abu `Aufa:                     A man displayed some goods in the market and took a false oath that he had been offered so much for them though he was not offered that amount Then the following Divine Verse was revealed:-- \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . Will get painful punishment.\" (3.77) Ibn Abu `Aufa added, \"Such person as described above is a treacherous Riba eater (i.e. eater of usury).",
      "chain": [
        "30021",
        "20472",
        "11441",
        "11619",
        "5115"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، قال سمعت أبي، حدثنا أبو التياح، قال حدثني أنس بن مالك  رضى الله عنه  لما قدم رسول الله صلى الله عليه وسلم المدينة أمر بالمسجد وقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏‏.‏ قالوا لا والله لا نطلب ثمنه إلا إلى الله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle came to Medina, he ordered that a mosque be built. He said, \"O Bani An- Najjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price except from Allah.\"",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم كتب إلى قيصر، وقال ‏\"‏ فإن توليت فإن عليك إثم الأريسيين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle wrote a letter to Caesar saying, \"If you reject Islam, you will be responsible for the sins of the peasants (i.e. your people).",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3214",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وحدثنا إسحاق، أخبرنا وهب بن جرير، حدثنا أبي قال، سمعت حميد بن هلال، عن أنس بن مالك  رضى الله عنه  قال كأني أنظر إلى غبار ساطع في سكة بني غنم‏.‏ زاد موسى موكب جبريل‏.‏",
      "text_en": " Narrated Jarir:                     as below.Narrated Humaid bin Hilal:Anas bin Malik said, \"As if I say a cloud of dust swirling up in the lane of Bani Ghanim.\" Musa added, \"That was caused by the procession of Gabriel.\"",
      "chain": [
        "30021",
        "20298",
        "11272",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "3429",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق، أخبرنا عيسى بن يونس، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على المسلمين، فقالوا يا رسول الله، أينا لا يظلم نفسه قال ‏\"‏ ليس ذلك، إنما هو الشرك، ألم تسمعوا ما قال لقمان لابنه وهو يعظه ‏{‏يا بنى لا تشرك بالله إن الشرك لظلم عظيم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Verse:-- 'Those who believe and mix not their belief with wrong.' was revealed, the Muslims felt it very hard on them and said, \"O Allah's Apostle! Who amongst us does not do wrong to himself?\" He replied, \"The Verse does not mean this. But that (wrong) means to associate others in worship to Allah: Don't you listen to what Luqman said to his son when he was advising him,\" O my son! Join not others in worship with Allah. Verily joining others in worship with Allah is a great wrong indeed.\" (31.13)",
      "chain": [
        "30021",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3854",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا قتادة، قال سمعت أنس بن مالك  رضى الله عنه  قال أبو أسيد قال رسول الله صلى الله عليه وسلم ‏\"‏ خير دور الأنصار بنو النجار، ثم بنو عبد الأشهل، ثم بنو الحارث بن الخزرج، ثم بنو ساعدة وفي كل دور الأنصار خير ‏\"‏‏.‏ فقال سعد بن عبادة  وكان ذا قدم في الإسلام  أرى رسول الله صلى الله عليه وسلم قد فضل علينا‏.‏ فقيل له قد فضلكم على ناس كثير‏.‏",
      "text_en": " Narrated Abu Usaid:                     Allah's Apostle said, \"The best of the Ansar's houses are those of Bani An-Najjar, then those of Bani `Abdul Ash-hal, then those of Bani Al-Harith bin Al-Khazraj, then those of Bani Saida; but there is goodness in all the houses of the Ansar.\" Sa`d bin Ubada who was one of those who embraced Islam early, said, \"I see that Allah's Apostle is giving others superiority above us.\" Some people said to him, \"But he has given you superiority above many other people.\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4161",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه قال يوم الخندق ‏\"‏ ملأ الله عليهم بيوتهم وقبورهم نارا كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     On the day of Al-Khandaq (i.e. Trench), the Prophet said '(Let) Allah fill their (i.e. the infidels') houses and graves with fire just as they have prevented us from offering the Middle Prayer (i.e. `Asr prayer) till the sun had set.\"",
      "chain": [
        "30021",
        "20229",
        "20295",
        "11263",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4230",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا يعقوب، حدثني ابن أخي ابن شهاب، عن عمه، أخبرني عروة بن الزبير، أنه سمع مروان بن الحكم، والمسور بن مخرمة، يخبران خبرا من خبر رسول الله صلى الله عليه وسلم في عمرة الحديبية فكان فيما أخبرني عروة عنهما أنه لما كاتب رسول الله صلى الله عليه وسلم سهيل بن عمرو، يوم الحديبية على قضية المدة، وكان فيما اشترط سهيل بن عمرو أنه قال لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ وأبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، فكره المؤمنون ذلك وامعضوا، فتكلموا فيه، فلما أبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، كاتبه رسول الله صلى الله عليه وسلم، فرد رسول الله صلى الله عليه وسلم أبا جندل بن سهيل يومئذ إلى أبيه سهيل بن عمرو، ولم يأت رسول الله صلى الله عليه وسلم أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاءت المؤمنات مهاجرات، فكانت أم كلثوم بنت عقبة بن معيط ممن خرج إلى رسول الله صلى الله عليه وسلم وهى عاتق، فجاء أهلها يسألون رسول الله صلى الله عليه وسلم أن يرجعها إليهم، حتى أنزل الله تعالى في المؤمنات ما أنزل‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     That he heard Marwan bin Al-Hakam and Al-Miswar bin Makhrama relating one of the events that happened to Allah's Apostle in the `Umra of Al-Hudaibiya. They said, \"When Allah's Apostle concluded the truce with Suhail bin `Amr on the day of Al-Hudaibiya, one of the conditions which Suhail bin `Amr stipulated, was his saying (to the Prophet), \"If anyone from us (i.e. infidels) ever comes to you, though he has embraced your religion, you should return him to us, and should not interfere between us and him.\" Suhail refused to conclude the truce with Allah's Apostle except on this condition. The believers disliked this condition and got disgusted with it and argued about it. But when Suhail refused to conclude the truce with Allah's Apostle except on that condition, Allah's Apostle concluded it. Accordingly, Allah's Apostle then returned Abu Jandal bin Suhail to his father, Suhail bin `Amr, and returned every man coming to him from them during that period even if he was a Muslim. The believing women Emigrants came (to Medina) and Um Kulthum, the daughter of `Uqba bin Abi Mu'ait was one of those who came to Allah's Apostle and she was an adult at that time. Her relatives came, asking Allah's Apostle to return her to them, and in this connection, Allah revealed the Verses dealing with the believing (women). Aisha said, \"Allah's Apostle used to test all the believing women who migrated to him, with the following Verse:-- \"O Prophet! When the believing Women come to you, to give the pledge of allegiance to you.\" (60.12) `Urwa's uncle said, \"We were informed when Allah ordered His Apostle to return to the pagans what they had given to their wives who lately migrated (to Medina) and we were informed that Abu Basir...\" relating the whole narration.",
      "chain": [
        "30021",
        "20184",
        "20176",
        "10511",
        "858"
      ]
    },
    {
      "hadith_no": "4271",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عدي بن ثابت، سمعت البراء، وابن أبي أوفى، يحدثان عن النبي صلى الله عليه وسلم أنه قال يوم خيبر وقد نصبوا القدور أكفئوا القدور‏.‏",
      "text_en": " Narrated Al-Bara' and Ibn Abi `Aufa:                     On the day of Khaibar when the cooking pots were put on the fire, the Prophet said, \"Turn the cooking pots upside down.\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11372",
        "400",
        "5115"
      ]
    },
    {
      "hadith_no": "4363",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني ليث، حدثني عقيل، عن ابن شهاب،‏.‏ وحدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب،، قال محمد بن شهاب وزعم عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم، فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بكم ‏\"‏‏.‏ وكان أنظرهم رسول الله صلى الله عليه وسلم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب منكم أن يكون على حظه، حتى نعطيه إياه من أول ما يفيء الله علينا، فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏ هذا الذي بلغني عن سبى هوازن‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegate of Hawazin came to Allah's Apostle declaring their conversion to Islam and asked him to return their properties and captives, Allah's Apostle got up and said to them, \"There Is involved in this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So choose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. have not distributed the booty).\" Allah's Apostle had delayed the distribution of their booty over ten nights after his return from Ta'if. So when they came to know that Allah's Apostle was not going to return to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Apostle got up amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have come to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to do that as a favor then he can do it. And whoever of you likes to stick to his share till we give him from the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that (i.e. return the captives) willingly as a favor, 'O Allah's Apostle!\" Allah's Apostle said, \"We do not know which of you have agreed to it and which have not; so go back and let your chiefs forward us your decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to Allah's Apostle and informed him that all of them had agreed (to give up their captives) with pleasure, and had given their permission (i.e. that the captives be returned to their people). (The sub-narrator said, \"That is what has reached me about the captives of Hawazin tribe.\")",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "4411",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا أبو عامر العقدي، حدثنا قرة، عن أبي جمرة، قلت لابن عباس  رضى الله عنهما  إن لي جرة ينتبذ لي نبيذ، فأشربه حلوا في جر إن أكثرت منه، فجالست القوم، فأطلت الجلوس خشيت أن أفتضح فقال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقال ‏\"‏ مرحبا بالقوم غير خزايا ولا الندامى ‏\"‏‏.‏ فقالوا يا رسول الله، إن بيننا وبينك المشركين من مضر، وإنا لا نصل إليك إلا في أشهر الحرم، حدثنا بجمل من الأمر، إن عملنا به دخلنا الجنة، وندعو به من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع، الإيمان بالله، هل تدرون ما الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة وصوم رمضان، وأن تعطوا من المغانم الخمس، وأنهاكم عن أربع ما انتبذ في الدباء، والنقير، والحنتم، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Jamra:                     I said to Ibn `Abbas, \"I have an earthenware pot containing Nabidh (i.e. water and dates or grapes) for me, and I drink of it while it is sweet. If I drink much of it and stay with the people for a long time, I get afraid that they may discover it (for I will appear as if I were drunk). Ibn `Abbas said, \"A delegation of `Abdul Qais came to Allah's Apostle and he said, \"Welcome, O people! Neither will you have disgrace nor will you regret.\" They said, \"O Allah's Apostle! There are the Mudar pagans between you and us, so we cannot come to you except in the sacred Months. So please teach us some orders on acting upon which we will enter Paradise. Besides, we will preach that to our people who are behind us.\" The Prophet said, \"I order you to do four things and forbid you from four things (I order you): To believe in Allah...Do you know what is to believe in Allah? That is to testify that None has the right to be worshipped except Allah: (I order you also to offer prayers perfectly to pay Zakat; and to fast the month of Ramadan and to give the Khumus (i.e. one-fifth of the booty) (for Allah's Sake). I forbid you from four other things (i.e. the wine that is prepared in) Ad-Dubba, An-Naquir, Az-Hantam and Al-Muzaffat. (See Hadith No. 50 Vol. 1)",
      "chain": [
        "30021",
        "20443",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4468",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله، أن ابن عباس، أخبره أن رسول الله صلى الله عليه وسلم بعث بكتابه إلى كسرى مع عبد الله بن حذافة السهمي، فأمره أن يدفعه إلى عظيم البحرين، فدفعه عظيم البحرين إلى كسرى، فلما قرأه مزقه  فحسبت أن ابن المسيب قال  فدعا عليهم رسول الله صلى الله عليه وسلم أن يمزقوا كل ممزق‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle sent a letter to Khosrau with `Abdullah bin Hudhafa As-Sahmi and told him to hand it over to the governor of Al-Bahrain. The governor of Al-Bahrain handed it over to Khosrau, and when he read the latter, he tore it into pieces. (The sub-narrator added, \"I think that Ibn Al-Musaiyab said, 'Allah 's Apostle invoked (Allah) to tear them all totally Khosrau and his companions) into pieces.",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4490",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا بشر بن شعيب بن أبي حمزة، قال حدثني أبي، عن الزهري، قال أخبرني عبد الله بن كعب بن مالك الأنصاري  وكان كعب بن مالك أحد الثلاثة الذين تيب عليهم أن عبد الله بن عباس أخبره أن علي بن أبي طالب  رضى الله عنه  خرج من عند رسول الله صلى الله عليه وسلم في وجعه الذي توفي فيه، فقال الناس يا أبا حسن، كيف أصبح رسول الله صلى الله عليه وسلم فقال أصبح بحمد الله بارئا، فأخذ بيده عباس بن عبد المطلب، فقال له أنت والله بعد ثلاث عبد العصا، وإني والله لأرى رسول الله صلى الله عليه وسلم سوف يتوفى من وجعه هذا، إني لأعرف وجوه بني عبد المطلب عند الموت، اذهب بنا إلى رسول الله صلى الله عليه وسلم فلنسأله فيمن هذا الأمر، إن كان فينا علمنا ذلك، وإن كان في غيرنا علمناه فأوصى بنا‏.‏ فقال علي إنا والله لئن سألناها رسول الله صلى الله عليه وسلم فمنعناها لا يعطيناها الناس بعده، وإني والله لا أسألها رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     `Ali bin Abu Talib came out of the house of Allah's Apostle during his fatal illness. The people asked, \"O Abu Hasan (i.e. `Ali)! How is the health of Allah's Apostle this morning?\" `Ali replied, \"He has recovered with the Grace of Allah.\" `Abbas bin `Abdul Muttalib held him by the hand and said to him, \"In three days you, by Allah, will be ruled (by somebody else ), And by Allah, I feel that Allah's Apostle will die from this ailment of his, for I know how the faces of the offspring of `Abdul Muttalib look at the time of their death. So let us go to Allah's Apostle and ask him who will take over the Caliphate. If it is given to us we will know as to it, and if it is given to somebody else, we will inform him so that he may tell the new ruler to take care of us.\" `Ali said, \"By Allah, if we asked Allah's Apostle for it (i.e. the Caliphate) and he denied it us, the people will never give it to us after that. And by Allah, I will not ask Allah's Apostle for it.\"",
      "chain": [
        "30021",
        "30317",
        "20428",
        "11013",
        "1131",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "4546",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا روح، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، عن عطاء، سمع ابن عباس، يقرأ ‏{‏وعلى الذين يطوقونه فدية طعام مسكين ‏}‏‏.‏ قال ابن عباس ليست بمنسوخة، هو الشيخ الكبير والمرأة الكبيرة لا يستطيعان أن يصوما، فليطعمان مكان كل يوم مسكينا‏.‏",
      "text_en": " Narrated 'Ata:                     That he heard Ibn `Abbas reciting the Divine Verse:-- \"And for those who can fast they had a choice either fast, or feed a poor for every day..\" (2.184) Ibn `Abbas said, \"This Verse is not abrogated, but it is meant for old men and old women who have no strength to fast, so they should feed one poor person for each day of fasting (instead of fasting).",
      "chain": [
        "30021",
        "20229",
        "11244",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "4638",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم ح، وحدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عبد الكريم، أن مقسما، مولى عبد الله بن الحارث أخبره أن ابن عباس  رضى الله عنهما  أخبره ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ عن بدر والخارجون إلى بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Not equal are those believers who sat (at home) and did not join the Badr battle and those who joined the Badr battle.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "30021",
        "20121",
        "11070",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "4662",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى، وابن، إدريس عن أبي حيان، عن الشعبي، عن ابن عمر، قال سمعت عمر  رضى الله عنه  على منبر النبي صلى الله عليه وسلم يقول أما بعد أيها الناس إنه نزل تحريم الخمر وهى من خمسة، من العنب والتمر والعسل والحنطة والشعير، والخمر ما خامر العقل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard `Umar while he was on the pulpit of the Prophet saying, \"Now then O people! The revelation about the prohibition of alcoholic drinks was revealed; and alcoholic drinks are extracted from five things: Grapes, dates, honey, wheat and barley. And the alcoholic drink is that which confuses and stupefies the mind.\"",
      "chain": [
        "30021",
        "20347",
        "20102",
        "11404",
        "11052",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4940",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني عروة، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يمتحن من هاجر إليه من المؤمنات بهذه الآية، بقول الله ‏{‏يا أيها النبي إذا جاءك المؤمنات يبايعنك‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏‏.‏ قال عروة قالت عائشة فمن أقر بهذا الشرط من المؤمنات قال لها رسول الله صلى الله عليه وسلم ‏\"‏ قد بايعتك ‏\"‏‏.‏ كلاما ولا والله ما مست يده يد امرأة قط في المبايعة، ما يبايعهن إلا بقوله ‏\"‏ قد بايعتك على ذلك ‏\"‏‏.‏ تابعه يونس ومعمر وعبد الرحمن بن إسحاق عن الزهري‏.‏ وقال إسحاق بن راشد عن الزهري عن عروة وعمرة‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha the wife of the Prophet, said, \"Allah's Apostle used to examine the believing women who migrated to him in accordance with this Verse: 'O Prophet! When believing women come to you to take the oath of allegiance to you... Verily! Allah is Oft-Forgiving Most Merciful.' (60.12) `Aisha said, \"And if any of the believing women accepted the condition (assigned in the above-mentioned Verse), Allah's Apostle would say to her. \"I have accepted your pledge of allegiance.\" \"He would only say that, for, by Allah, his hand never touched, any lady during that pledge of allegiance. He did not receive their pledge except by saying, \"I have accepted your pledge of allegiance for that.\"",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5109",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثني إسحاق، أخبرنا عبيد الله، عن شيبان، عن يحيى، عن محمد بن عبد الرحمن، مولى بني زهرة عن أبي سلمة  قال وأحسبني قال  سمعت أنا من أبي سلمة، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ القرآن في شهر ‏\"‏‏.‏ قلت إني أجد قوة حتى قال ‏\"‏ فاقرأه في سبع ولا تزد على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power (to do more than that).\" Allah's Apostle said, \"Then finish the recitation of the Qur'an in seven days, and do not finish it in less than this period.\"",
      "chain": [
        "30021",
        "11201",
        "20240",
        "11449",
        "10960",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "5194",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق، أخبرنا يزيد، أخبرنا يحيى، أن القاسم بن محمد، حدثه أن عبد الرحمن بن يزيد ومجمع بن يزيد حدثاه أن رجلا يدعى خذاما أنكح ابنة له‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid and Majammi bin Yazid:                     The same ,Hadith above: A man called Khidam married a daughter of his (to somebody) against her consent. 'If you fear that you shall not be able to deal justly with the orphan girls then marry (other) women of your choice.' (4.3) And if somebody says to the guardian (of a woman), \"Marry me to soand- so,\" and the guardian remained silent or said to him, \"What have you got?\" And the other said, \"I have so much and so much (Mahr),\" or kept quiet, and then the guardian said, \"I have married her to you,\" then the marriage is valid (legal). This narration was told by Sahl on the authority of the Prophet.",
      "chain": [
        "30021",
        "20472",
        "11062",
        "10535",
        "1799"
      ]
    },
    {
      "hadith_no": "5291",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، عن عيسى، عن الأوزاعي، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  قالت رأيت النبي صلى الله عليه وسلم يسترني بردائه، وأنا أنظر إلى الحبشة يلعبون في المسجد، حتى أكون أنا الذي أسأم، فاقدروا قدر الجارية الحديثة السن الحريصة على اللهو‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was screening me with his Rida' (garment covering the upper part of the body) while I was looking at the Ethiopians who were playing in the courtyard of the mosque. (I continued watching) till I was satisfied. So you may deduce from this event how a little girl (who has not reached the age of puberty) who is eager to enjoy amusement should be treated in this respect.",
      "chain": [
        "30021",
        "20347",
        "20024",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5486",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، عن أبي أسامة، عن هشام، قال أخبرني أبي، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يحب الحلواء والعسل‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to love sweet edible things and honey.",
      "chain": [
        "30021",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5569",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسحاق، سمع عبدة، عن هشام، عن فاطمة، عن أسماء، قالت ذبحنا على عهد رسول الله صلى الله عليه وسلم فرسا ونحن بالمدينة فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse (by Dhabh) during the lifetime of Allah's Apostle while we were at Medina, and we ate it.",
      "chain": [
        "30021",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5885",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud, on the right and on the left of the Prophet were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
      "chain": [
        "30021",
        "20352",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "hadith_no": "5945",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا ورقاء بن عمر، عن عبيد الله بن أبي يزيد، عن نافع بن جبير، عن أبي هريرة  رضى الله عنه  قال كنت مع رسول الله صلى الله عليه وسلم في سوق من أسواق المدينة فانصرف فانصرفت فقال ‏\"‏ أين لكع  ثلاثا  ادع الحسن بن علي ‏\"‏‏.‏ فقام الحسن بن علي يمشي وفي عنقه السخاب، فقال النبي صلى الله عليه وسلم بيده هكذا، فقال الحسن بيده، هكذا فالتزمه فقال ‏\"‏ اللهم إني أحبه، فأحبه، وأحب من يحبه ‏\"‏‏.‏ قال أبو هريرة فما كان أحد أحب إلى من الحسن بن علي بعد ما قال رسول الله صلى الله عليه وسلم ما قال‏.‏",
      "text_en": " Narrated Abu Huraira:                     I was with Allah's Apostle in one of the Markets of Medina. He left (the market) and so did I. Then he asked thrice, \"Where is the small (child)?\" Then he said, \"Call Al-Hasan bin `Ali.\" So Al-Hasan bin `Ali got up and started walking with a necklace (of beads) around his neck. The Prophet stretched his hand out like this, and Al-Hasan did the same. The Prophet embraced him and said, \"0 Allah! l love him, so please love him and love those who love him.\" Since Allah's Apostle said that. nothing has been dearer to me than Al-Hasan.",
      "chain": [
        "30021",
        "20364",
        "20363",
        "11258",
        "11059",
        "13"
      ]
    },
    {
      "hadith_no": "6282",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، قال كان للنبي صلى الله عليه وسلم حاد يقال له أنجشة، وكان حسن الصوت، فقال له النبي صلى الله عليه وسلم ‏\"‏ رويدك يا أنجشة، لا تكسر القوارير ‏\"‏‏.‏ قال قتادة يعني ضعفة النساء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet had a Had (a camel driver) called Anjasha, and he had a nice voice. The Prophet said to him, \"(Drive) slowly, O Anjasha! Do not break the glass vessels!\" And Qatada said, \"(By vessels') he meant the weak women.\"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6312",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت كان عمر بن الخطاب يقول لرسول الله صلى الله عليه وسلم احجب نساءك‏.‏ قالت فلم يفعل، وكان أزواج النبي صلى الله عليه وسلم يخرجن ليلا إلى ليل قبل المناصع، خرجت سودة بنت زمعة، وكانت امرأة طويلة فرآها عمر بن الخطاب وهو في المجلس فقال عرفتك يا سودة‏.‏ حرصا على أن ينزل الحجاب‏.‏ قالت فأنزل الله عز وجل آية الحجاب‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) `Umar bin Al-Khattab used to say to Allah's Apostle \"Let your wives be veiled\" But he did not do so. The wives of the Prophet used to go out to answer the call of nature at night only at Al-Manasi.' Once Sauda, the daughter of Zam`a went out and she was a tall woman. `Umar bin Al-Khattab saw her while he was in a gathering, and said, \"I have recognized you, O Sauda!\" He (`Umar) said so as he was anxious for some Divine orders regarding the veil (the veiling of women.) So Allah revealed the Verse of veiling. (Al-Hijab; a complete body cover excluding the eyes). (See Hadith No. 148, Vol. 1)",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6316",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الله بن المثنى، حدثنا ثمامة بن عبد الله، عن أنس  رضى الله عنه أن رسول الله صلى الله عليه وسلم كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle greeted somebody, he used to greet him three times, and if he spoke a sentence, he used to repeat it thrice.",
      "chain": [
        "30021",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6382",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن النبي صلى الله عليه وسلم‏.‏ وحدثنا هدبة، حدثنا همام، حدثنا قتادة، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الله أفرح بتوبة عبده من أحدكم سقط على بعيره، وقد أضله في أرض فلاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Allah is more pleased with the repentance of His slave than anyone of you is pleased with finding his camel which he had lost in the desert. \"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6403",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثني إسحاق، أخبرنا يزيد، أخبرنا ورقاء، عن سمى، عن أبي صالح، عن أبي هريرة،‏.‏ قالوا يا رسول الله ذهب أهل الدثور بالدرجات والنعيم المقيم‏.‏ قال ‏\"‏ كيف ذاك ‏\"‏‏.‏ قال صلوا كما صلينا، وجاهدوا كما جاهدنا، وأنفقوا من فضول أموالهم، وليست لنا أموال‏.‏ قال ‏\"‏ أفلا أخبركم بأمر تدركون من كان قبلكم، وتسبقون من جاء بعدكم، ولا يأتي أحد بمثل ما جئتم، إلا من جاء بمثله، تسبحون في دبر كل صلاة عشرا، وتحمدون عشرا، وتكبرون عشرا ‏\"‏‏.‏ تابعه عبيد الله بن عمر عن سمى ورواه ابن عجلان عن سمى ورجاء بن حيوة‏.‏ ورواه جرير عن عبد العزيز بن رفيع عن أبي صالح عن أبي الدرداء‏.‏ ورواه سهيل عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people said, \"O Allah's Apostle! The rich people have got the highest degrees of prestige and the permanent pleasures (in this life and the life to come in the Hereafter).\" He said, \"How is that?\" They said, \"The rich pray as we pray, and strive in Allah's Cause as we do, and spend from their surplus wealth in charity, while we have no wealth (to spend likewise).\" He said, \"Shall I not tell you a thing, by doing which, you will catch up with those who are ahead of you and supersede those who will come after you; and nobody will be able to do such a good deed as you do except the one who does the same (deed as you do). That deed is to recite 'Subhan Allah ten times, and 'Al-Hamduli l-lah ten times, and 'AllahuAkbar' ten times after every prayer.\"",
      "chain": [
        "30021",
        "20472",
        "20363",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6550",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إسحاق، حدثنا روح بن عبادة، حدثنا شعبة، قال سمعت حصين بن عبد الرحمن، قال كنت قاعدا عند سعيد بن جبير فقال عن ابن عباس أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب، هم الذين لا يسترقون، ولا يتطيرون، وعلى ربهم يتوكلون ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"Seventy thousand people of my followers will enter Paradise without accounts, and they are those who do not practice Ar-Ruqya and do not see an evil omen in things, and put their trust in their Lord.",
      "chain": [
        "30021",
        "20229",
        "20020",
        "15097",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "6701",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، أخبرنا النضر، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن يحيى بن يعمر، أن عائشة  رضى الله عنها  أخبرته أنها، سألت رسول الله صلى الله عليه وسلم عن الطاعون فقال ‏\"‏ كان عذابا يبعثه الله على من يشاء، فجعله الله رحمة للمؤمنين، ما من عبد يكون في بلد يكون فيه، ويمكث فيه، لا يخرج من البلد، صابرا محتسبا، يعلم أنه لا يصيبه إلا ما كتب الله له، إلا كان له مثل أجر شهيد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked Allah's Apostle about the plague. He said, \"That was a means of torture which Allah used to send upon whom-so-ever He wished, but He made it a source of mercy for the believers, for anyone who is residing in a town in which this disease is present, and remains there and does not leave that town, but has patience and hopes for Allah's reward, and knows that nothing will befall him except what Allah has written for him, then he will get such reward as that of a martyr.\"",
      "chain": [
        "30021",
        "20291",
        "20424",
        "11432",
        "11316",
        "53"
      ]
    },
    {
      "hadith_no": "6725",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ أتموا الركوع والسجود، فوالذي نفسي بيده إني لأراكم من بعد ظهري إذا ما ركعتم وإذا ما سجدتم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard the Prophet saying, \"Perform the bowing and the prostration properly (with peace of mind), for, by Him in Whose Hand my soul is, I see you from behind my back when you bow and when you prostrate.\"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6726",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير، أخبرنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، من الأنصار أتت النبي صلى الله عليه وسلم معها أولاد لها فقال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده إنكم لأحب الناس إلى ‏\"‏‏.‏ قالها ثلاث مرار‏.‏",
      "text_en": " Narrated Anas bin Malik:                     An Ansari woman came to the Prophet in the company of her children, and the Prophet said to her, \"By Him in Whose Hand my soul is, you are the most beloved people to me!\" And he repeated the statement thrice.",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "6968",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، أن يهوديا، رض رأس جارية بين حجرين، فقيل لها من فعل بك هذا أفلان أفلان حتى سمي اليهودي فأومأت برأسها، فجيء باليهودي فاعترف، فأمر به النبي صلى الله عليه وسلم فرض رأسه بالحجارة‏.‏ وقد قال همام بحجرين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jew crushed the head of a girl between two stones. It was said to her. \"Who has done this to you, such-and-such person, such-and-such person?\" When the name of the Jew was mentioned, she nodded with her head, agreeing. So the Jew was brought and he confessed. The Prophet ordered that his head be crushed with the stones. (Hammam said, \"with two stones.\")",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7122",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We (Muslims) are the last (to come) but (will be) the foremost (on the Day of Resurrection).\" Allah's Apostle further said, ''While sleeping, I was given the treasures of the world and two golden bangles were put in my hands, but I felt much annoyed, and those two bangles distressed me very much, but I was inspired that I should blow them off, so I blew them and they flew away. Then I interpreted that those two bangles were the liars between whom I was (i.e., the one of San`a' and the one of Yamama).",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "7242",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا شعبة، حدثنا ثابت البناني، عن أنس بن مالك، يقول لامرأة من أهله تعرفين فلانة قالت نعم‏.‏ قال فإن النبي صلى الله عليه وسلم مر بها وهى تبكي عند قبر فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏ فقالت إليك عني، فإنك خلو من مصيبتي‏.‏ قال فجاوزها ومضى فمر بها رجل فقال ما قال لك رسول الله صلى الله عليه وسلم‏.‏ قالت ما عرفته قال إنه لرسول الله صلى الله عليه وسلم قال فجاءت إلى بابه فلم تجد عليه بوابا فقالت يا رسول الله والله ما عرفتك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الصبر عند أول صدمة ‏\"‏‏.‏",
      "text_en": " Narrated Thabit Al-Bunani:                     Anas bin Malik said to a woman of his family, \"Do you know such-and-such a woman?\" She replied, \"Yes.\" He said, \"The Prophet passed by her while she was weeping over a grave, and he said to her, 'Be afraid of Allah and be patient.' The woman said (to the Prophet). 'Go away from me, for you do not know my calamity.'\" Anas added, \"The Prophet left her and proceeded. A man passed by her and asked her, 'What has Allah's Apostle said to you?' She replied, 'I did not recognize him.' The man said, 'He was Allah's Apostle.\"' Anas added, \"So that woman came to the gate of the Prophet and she did not find a gate-keeper there, and she said, 'O Allah's Apostle! By Allah. I did not recognize you!' The Prophet said, 'No doubt, patience is at the first stroke of a calamity.'\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7376",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عفان، حدثنا وهيب، حدثنا موسى بن عقبة، سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير، فصلى رسول الله صلى الله عليه وسلم فيها ليالي، حتى اجتمع إليه ناس، ثم فقدوا صوته ليلة فظنوا أنه قد نام، فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنيعكم، حتى خشيت أن يكتب عليكم، ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم، فإن أفضل صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     The Prophet took a room made of date palm leaves mats in the mosque. Allah's Apostle prayed in it for a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the 4th night the people did not hear his voice and they thought he had slept, so some of them started humming in order that he might come out. The Prophet then said, \"You continued doing what I saw you doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined on you, you would not continue performing it. Therefore, O people! Perform your prayers at your homes, for the best prayer of a person is what is performed at his home except the compulsory congregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "7423",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "وحدثني إسحاق، أخبرنا عيسى، وابن، إدريس وابن أبي غنية عن أبي حيان، عن الشعبي، عن ابن عمر  رضى الله عنهما  قال سمعت عمر، على منبر النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard `Umar (delivering a sermon) on the pulpit of the Prophet.",
      "chain": [
        "30021",
        "20347",
        "20614",
        "11404",
        "11052",
        "18"
      ]
    },
    {
      "hadith_no": "7451",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرحمن بن مهدي، عن سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Allah's Apostle said, \"Recite (and study) the Qur'an as long as you are in agreement as to its interpretation and meanings, but when you have differences regarding its interpretation and meanings, then you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)",
      "chain": [
        "30021",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    }
  ],
  "total_hadiths": 138
}