{
  "id": "30025",
  "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
  "full_name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "181",
      "date_gregorian": "NA",
      "date_display": [
        "181 AH"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "255",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Samarqand"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ م  د  ت  -  الحافظ ]",
      "Hadith"
    ],
    "tags": [
      "Hafiz",
      "Imam",
      "al-Tamimi",
      "al-Darami",
      "al-Samarqandi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20260",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30244",
      "name": "al-Hasan bin al-Sbah al-Bzar الحسن بن الصباح البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3816",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني محمد بن جعفر، عن عبد الله بن عبد الرحمن، أنه سمع أنس بن مالك  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فضل عائشة على النساء كفضل الثريد على الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"The superiority of `Aisha over other women is like the superiority of Tharid to other meals.\"",
      "chain": [
        "30105",
        "20173",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "5483",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا عبد الله بن عبد الرحمن، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid to other kinds of food.\"",
      "chain": [
        "30175",
        "20423",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "7382",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا الحسن بن صباح، حدثنا شبابة، حدثنا ورقاء، عن عبد الله بن عبد الرحمن، سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يبرح الناس يتساءلون حتى يقولوا هذا الله خالق كل شىء فمن خلق الله ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"People will not stop asking questions till they say, 'This is Allah, the Creator of everything, then who created Allah?' \"",
      "chain": [
        "30244",
        "20426",
        "20363",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "29",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا مروان، - يعني ابن محمد الدمشقي - حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، قال قلت لطاوس إن فلانا حدثني بكذا، وكذا، ‏.‏ قال إن كان صاحبك مليا فخذ عنه ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "20640",
        "20638",
        "10880"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا زكرياء بن عدي، قال قال لي أبو إسحاق الفزاري اكتب عن بقية، ما روى عن المعروفين، ولا تكتب عنه ما روى عن غير المعروفين، ولا تكتب عن إسماعيل بن عياش، ما روى عن المعروفين، ولا عن غيرهم، ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "30464",
        "20405",
        "20736"
      ]
    },
    {
      "hadith_no": "92",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، قال سمعت أبا نعيم، ‏.‏ وذكر المعلى بن عرفان فقال قال حدثنا أبو وائل، قال خرج علينا ابن مسعود بصفين ‏.‏ فقال أبو نعيم أتراه بعث بعد الموت",
      "text_en": "",
      "chain": [
        "30025",
        "11353"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، بهذا الإسناد مثله وزاد ‏\"‏ الإيمان يمان والحكمة يمانية ‏\"‏ ‏.‏",
      "text_en": " The same hadith has been narrated by Zuhri with the same chain of authorities with the addition:                      The belief is among the Yemenites, the sagacity is that of the Yemenites.",
      "chain": [
        "30025",
        "30330",
        "20428"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا أبو اليمان، عن شعيب، عن الزهري، حدثني سعيد بن المسيب، أن أبا هريرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ جاء أهل اليمن هم أرق أفئدة وأضعف قلوبا الإيمان يمان والحكمة يمانية السكينة في أهل الغنم والفخر والخيلاء في الفدادين أهل الوبر قبل مطلع الشمس ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      I heard the Prophet (may peace and blessings be upon him) saying: There came the people of Yemen, they are tender of feelings and meek of hearts. The belief is that of the Yemenites, the sagacity is that of the Yemenites, the tranquillity is among the owners of goats and sheep, and pride and conceitedness is among the uncivil owners of the camels, the people of the tents in the direction of sunrise.",
      "chain": [
        "30025",
        "30330",
        "20428",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "470",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، وعطاء بن يزيد الليثي، أن أبا هريرة، أخبرهما أن الناس قالوا للنبي صلى الله عليه وسلم يا رسول الله هل نرى ربنا يوم القيامة وساق الحديث بمثل معنى حديث إبراهيم بن سعد ‏.‏",
      "text_en": " Abu Huraira reported:                      The people said to the Apostle of Allah (may peace be upon him): Messenger of Allah I shall we see our Lord on the Day of Resurrection? The rest of the hadith was narrated according to the narration of Ibrahim b. Sa'd.",
      "chain": [
        "30025",
        "30330",
        "20428",
        "11013",
        "11002",
        "11206"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن عبد الله الرقاشي، حدثنا بشر بن منصور، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال رأى رسول الله صلى الله عليه وسلم قوما في مؤخر المسجد ‏.‏ فذكر مثله ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) saw people at the end of the mosque, and then the (above-mentioned hadith) was narrated.",
      "chain": [
        "30025",
        "30168",
        "20531",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا مروان بن محمد الدمشقي، حدثنا سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم إذا رفع رأسه من الركوع قال ‏\"‏ ربنا لك الحمد ملء السموات والأرض وملء ما شئت من شىء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      When the Messenger of Allah (may peace be upon him) raised his head after bowing, he said: O Allah! our Lord, to Thee be the praise that would fill all the heavens and the earth, and all that it pleases Thee besides (them). O, thou art worthy of praise and glory, most worthy of what a servant says, and we all are Thy servants, no one can withhold what Thou givest or give what Thou withholdest, and riches cannot avail a wealthy person against Thee.",
      "chain": [
        "30025",
        "20640",
        "20638",
        "10877",
        "38"
      ]
    },
    {
      "hadith_no": "1221",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا عبيد الله بن موسى، عن إسرائيل، عن منصور، عن إبراهيم، عن علقمة، والأسود، أنهما دخلا على عبد الله فقال أصلى من خلفكم قالا نعم ‏.‏ فقام بينهما وجعل أحدهما عن يمينه والآخر عن شماله ثم ركعنا فوضعنا أيدينا على ركبنا فضرب أيدينا ثم طبق بين يديه ثم جعلهما بين فخذيه فلما صلى قال هكذا فعل رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Alqama and Aswad reported that they went to 'Abdullah. He said:                      Have (people) behind you said prayer? They said: Yes. He stood between them ('Alqama and Aswad). One was on his right aide and the other was on his left. We then bowed and placed our hands on our knees. He struck our hands and then putting his hands together, palm to palm, placed them between his thighs. When he completed the prayer he said: This is how the Messenger of Allah (may peace be upon him) used to do.",
      "chain": [
        "30025",
        "20340",
        "20311",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1304",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثنا وهيب بن خالد، حدثنا منصور، بهذا الإسناد وقال منصور ‏\"‏ فلينظر أحرى ذلك للصواب ‏\"‏ ‏.‏",
      "text_en": " This hadith is reported by Mansur with the same chain of transmitters, but with these words:                     \" He should aim at correct (prayer) and it is advisable.\"",
      "chain": [
        "30025",
        "20300",
        "20299"
      ]
    },
    {
      "hadith_no": "1911",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - يعني ابن حسان - حدثنا معاوية، بهذا الإسناد ‏.‏ مثله غير أنه قال ‏\"‏ وكأنهما ‏\"‏ ‏.‏ في كليهما ولم يذكر قول معاوية بلغني ‏.‏",
      "text_en": " An-Nawwas b. Sam'an said he heard the Apostle (may peace be upon him) say:                      On the Day of Resurrection the Qur'an and those who acted according to it will be brought with Surah al-Baqara and AI 'Imran preceding them. The Messenger of Allah (may peace be upon him) likened them to three things, which I did not forget afterwards. He (the Holy Prophet) likened them to two clouds, or two black canopies with light between them, or like two flocks of birds in ranks pleading for one who recited them.",
      "chain": [
        "30025",
        "20300"
      ]
    },
    {
      "hadith_no": "1935",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، وأبو بكر بن إسحاق قالا أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عامر بن واثلة الليثي، أن نافع بن، عبد الحارث الخزاعي لقي عمر بن الخطاب بعسفان ‏.‏ بمثل حديث إبراهيم بن سعد عن الزهري، ‏.‏",
      "text_en": " 'Umar b. Khattab said:                      I heard Hisham b. Hakim b. Hizam reciting Surah al-Furqan in a style different from that in which I used to recite it, and in which Allah's Messenger (may peace be upon him) had taught me to recite it. I was about to dispute with him (on this style) but I delayed till he had finished that (the recitation). Then I caught hold of his cloak and brought him to the Messenger of Allah (may peace be upon him) and said: Messenger of Allah, I heard this man reciting Surah al-Furqan in a style different from the one in which you taught me to recite. Upon this the Messenger of Allah (may peace be upon him) told (me) to leave him alone and asked him to recite. He then recited in the style in which I beard him recite it. The Messenger of Allah (may peace be upon him) then said: Thus was it sent down. He then told me to recite and I recited it, and he said: Thus was it sent down. The Qur'an was sent down in seven dialects. So recite what seems easy therefrom.",
      "chain": [
        "30025",
        "11108",
        "30330",
        "20428",
        "11013"
      ]
    },
    {
      "hadith_no": "1987",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - يعني ابن حسان - حدثنا معاوية، - وهو ابن سلام - أخبرني يحيى، أخبرني أبو سلمة بن عبد الرحمن، أن جابرا، أخبره أنه، صلى مع رسول الله صلى الله عليه وسلم صلاة الخوف فصلى رسول الله صلى الله عليه وسلم بإحدى الطائفتين ركعتين ثم صلى بالطائفة الأخرى ركعتين فصلى رسول الله صلى الله عليه وسلم أربع ركعات وصلى بكل طائفة ركعتين ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "20300",
        "20401",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2027",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا خالد بن مخلد، ح وحدثني عبد الله بن عبد، الرحمن الدارمي حدثنا يحيى بن حسان، قالا جميعا حدثنا سليمان بن بلال، عن جعفر، عن أبيه، أنه سأل جابر بن عبد الله متى كان رسول الله صلى الله عليه وسلم يصلي الجمعة قال كان يصلي ثم نذهب إلى جمالنا فنريحها ‏.‏ زاد عبد الله في حديثه حين تزول الشمس يعني النواضح ‏.‏",
      "text_en": " Ja'far reported on the authority of his father:                      that he asked Jabir b. 'Abdullah when the Messenger of Allah (may peace be upon him) observed Jumu'a prayer. He said: He used to observe prayer, and we then went (back) to our camels and gave them rest. 'Abdullah made this addition in his narration: \"Till the sun passed the meridian. and the camels used for carrying water (took rest).\"",
      "chain": [
        "30463",
        "30025",
        "20300",
        "20160",
        "11407"
      ]
    },
    {
      "hadith_no": "2049",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثنا سليمان، بن بلال عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن أخت، لعمرة قالت أخذت ‏{‏ ق والقرآن المجيد‏}‏ من في رسول الله صلى الله عليه وسلم يوم الجمعة وهو يقرأ بها على المنبر في كل جمعة ‏.‏",
      "text_en": " 'Amra daughter of Abd al-Rahman reported on the authority of the sister of Amra, I memorised (surah) Qaf=surah l.):                     \" By the glorious Qur'an\" from the mouth of the Messenger of Allah (may peace be upon him) on Friday for he recited it on the pulpit on-every Friday.",
      "chain": [
        "30025",
        "20300",
        "20160",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "2151",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثني محمد بن رافع، حدثنا أبو النضر، حدثنا أبو معاوية، - وهو شيبان النحوي - عن يحيى، عن أبي سلمة، عن عبد الله بن عمرو بن العاص، ح . وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثنا معاوية، بن سلام عن يحيى بن أبي كثير، قال أخبرني أبو سلمة بن عبد الرحمن، عن خبر عبد، الله بن عمرو بن العاص أنه قال لما انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي ب ‏{‏ الصلاة جامعة ‏}‏ فركع رسول الله صلى الله عليه وسلم ركعتين في سجدة ثم قام فركع ركعتين في سجدة ثم جلي عن الشمس فقالت عائشة ما ركعت ركوعا قط ولا سجدت سجودا قط كان أطول منه ‏.‏",
      "text_en": " 'Amr b. al-'As reported:                      When the sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him), they (the people) were called to congregational prayers. The Messenger of Allah (may peace be upon him) observed two ruku's in one rak'ah. He then stood and observed two ruku's in (the second) rak'ah. The sun then became bright, and 'A'isha said; Never did I observe, ruku' and prostration longer than this (ruku' and prostration).",
      "chain": [
        "30375",
        "20390",
        "20031",
        "10567",
        "29",
        "30025",
        "20300",
        "20401",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "2227",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، بهذا الإسناد سواء ‏.‏",
      "text_en": " This hadith has been narrated by Zuhri with the same chain of transmitters.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "30025",
        "30330",
        "20428"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثني معاوية، أخبرني أخي، زيد بهذا الإسناد ‏.‏ مثله غير أنه قال ‏\"‏ أو أمر بمعروف ‏\"‏ ‏.‏ وقال ‏\"‏ فإنه يمسي يومئذ ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zaid with the same chain of transmitters except with (a slight) change of words (i. e. he [the Holy Prophet]) said:                      Or he enjoined what is good,... and said: He enters the evening [ie. he walks till eveningl.",
      "chain": [
        "30025",
        "20300",
        "27"
      ]
    },
    {
      "hadith_no": "2450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، وسلمة بن شبيب، - قال سلمة حدثنا وقال الدارمي، أخبرنا مروان، وهو ابن محمد الدمشقي - حدثنا سعيد، - وهو ابن عبد العزيز - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو فحبيب إلى وأما هو عندي فأمين عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم تسعة أو ثمانية أو سبعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ وكنا حديث عهد ببيعة فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ قال فبسطنا أيدينا وقلنا قد بايعناك يا رسول الله فعلام نبايعك قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ فلقد رأيت بعض أولئك النفر يسقط سوط أحدهم فما يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " Malik al-Ashja'i reported:                      We, nine, eight or seven men, were in the company of the Messenger of Allah (may peace be upon him) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
      "chain": [
        "30025",
        "30417",
        "237",
        "30025",
        "20201",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "hadith_no": "2830",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا عبد الله، بن عبد الرحمن الدارمي أخبرنا أبو المغيرة، حدثنا الأوزاعي، كلاهما عن يحيى بن أبي، كثير بهذا الإسناد ‏.‏ نحوه وفي حديثهما رأيت رسول الله صلى الله عليه وسلم حين انصرف وعلى جبهته وأرنبته أثر الطين ‏.‏",
      "text_en": " This badith has been reported on the authority of Yahya b. Abu Kathir with the same chain of transmitters (with a slight variation of these words):                      I saw the Messenger of Allah (may peace be upon him) after he had completed (the prayer) and there was a trace of clay on his forehead and tip (of the nose).",
      "chain": [
        "30553",
        "20121",
        "20115",
        "30025",
        "20442"
      ]
    },
    {
      "hadith_no": "2914",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثنا معاوية، - وهو ابن سلام - أخبرني يحيى، أخبرني عبد الله بن أبي قتادة، أن أباه، - رضى الله عنه - أخبره أنه، غزا مع رسول الله صلى الله عليه وسلم غزوة الحديبية قال فأهلوا بعمرة غيري - قال - فاصطدت حمار وحش فأطعمت أصحابي وهم محرمون ثم أتيت رسول الله صلى الله عليه وسلم فأنبأته أن عندنا من لحمه فاضلة ‏.‏ فقال ‏\"‏ كلوه ‏\"‏ وهم محرمون ‏.‏",
      "text_en": " Abdullah b. Abu Qatada narrated on the authority of his father (Allah be pleased with him) that they went with the Messenger of Allah (may peace be upon him) on an expedition to Hudaibiya. He (further) said:                      They had entered upon the state of Ihram except I for 'Umra. He (again) said: I (Abu Qatada) hunted a wild ass and fed my companions In the state of their being Muhrim. 1 then came to the Messenger of Allah (may peace be upon him) and informed him that we had with us the meat that was left out of it Thereupon he said: Eat It, while they were in the state of Ibrim.",
      "chain": [
        "30025",
        "20300",
        "20401",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "4043",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عبد الملك أبي زيد، عن طاوس، عن ابن، عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ من كانت له أرض فإنه أن يمنحها أخاه خير ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:                      He who has land, it is better for him that he should let it out to his brother.",
      "chain": [
        "30025",
        "30346",
        "30024",
        "11340",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4387",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا حجاج بن المنهال، حدثنا حماد، عن أيوب، ح وحدثنا يحيى بن خلف، حدثنا عبد الأعلى، عن محمد بن إسحاق، كلاهما عن نافع، عن ابن عمر، ‏.‏ بهذا الحديث في النذر وفي حديثهما جميعا اعتكاف يوم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn Umar through another chain of transmitters but with a slight variation of words.",
      "chain": [
        "30025",
        "20219",
        "20022",
        "11015",
        "30460",
        "20246",
        "11107",
        "11014"
      ]
    },
    {
      "hadith_no": "4449",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا الحسن بن أبي شعيب الحراني، حدثنا مسكين، - وهو ابن بكير الحراني - أخبرنا الأوزاعي، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي قلابة، عن أنس بن مالك، قال قدم على رسول الله صلى الله عليه وسلم ثمانية نفر من عكل ‏.‏ بنحو حديثهم ‏.‏ وزاد في الحديث ولم يحسمهم ‏.‏",
      "text_en": " Anas b. Malik reported:                      There came to Allah's Messenger (may peace be upon him) eight persons from the tribe of 'Ukl, but with this addition that he did not cauterise (the wounds which hid been inflicted upon them while punishing them).",
      "chain": [
        "20463",
        "20024",
        "30025",
        "30388",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4502",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو نعيم، حدثنا سفيان، عن أيوب، وإسماعيل بن أمية، وعبيد الله، وموسى بن عقبة، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني إسماعيل بن أمية، ح وحدثني أبو الطاهر، أخبرنا ابن وهب، عن حنظلة بن أبي سفيان الجمحي، وعبيد الله بن عمر، ومالك بن أنس، وأسامة، بن زيد الليثي كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث يحيى عن مالك غير أن بعضهم قال قيمته وبعضهم قال ثمنه ثلاثة دراهم ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "20348",
        "20012",
        "11015",
        "11417",
        "11201",
        "11106",
        "30375",
        "20121",
        "11070",
        "11417",
        "20029",
        "11243",
        "11201"
      ]
    },
    {
      "hadith_no": "4586",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا مروان، - يعني ابن محمد الدمشقي - حدثنا الليث بن سعد، حدثني يزيد بن عبد الله بن أسامة بن الهاد الليثي، بهذا الحديث مثل رواية عبد العزيز بن محمد بالإسنادين جميعا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Usama b. al-Had al-Laithi.",
      "chain": [
        "30025",
        "20640",
        "20023"
      ]
    },
    {
      "hadith_no": "4628",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو الربيع العتكي، حدثنا حماد، حدثنا أيوب، ح وحدثنا عبد الله بن عبد، الرحمن الدارمي حدثنا عفان، حدثنا صخر بن جويرية، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Umar through some other Chains of transmitters.",
      "chain": [
        "20022",
        "11015",
        "30025",
        "30106",
        "20429",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4724",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى بن حسان، حدثنا حماد، بن سلمة أخبرنا ثابت، عن عبد الله بن رباح، قال وفدنا إلى معاوية بن أبي سفيان وفينا أبو هريرة فكان كل رجل منا يصنع طعاما يوما لأصحابه فكانت نوبتي فقلت يا أبا هريرة اليوم نوبتي ‏.‏ فجاءوا إلى المنزل ولم يدرك طعامنا فقلت يا أبا هريرة لو حدثتنا عن رسول الله صلى الله عليه وسلم حتى يدرك طعامنا فقال كنا مع رسول الله صلى الله عليه وسلم يوم الفتح فجعل خالد بن الوليد على المجنبة اليمنى وجعل الزبير على المجنبة اليسرى وجعل أبا عبيدة على البياذقة وبطن الوادي فقال ‏\"‏ يا أبا هريرة ادع لي الأنصار ‏\"‏ ‏.‏ فدعوتهم فجاءوا يهرولون فقال ‏\"‏ يا معشر الأنصار هل ترون أوباش قريش ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ انظروا إذا لقيتموهم غدا أن تحصدوهم حصدا ‏\"‏ ‏.‏ وأخفى بيده ووضع يمينه على شماله وقال ‏\"‏ موعدكم الصفا ‏\"‏ ‏.‏ قال فما أشرف يومئذ لهم أحد إلا أناموه - قال - وصعد رسول الله صلى الله عليه وسلم الصفا وجاءت الأنصار فأطافوا بالصفا فجاء أبو سفيان فقال يا رسول الله أبيدت خضراء قريش لا قريش بعد اليوم ‏.‏ قال أبو سفيان قال رسول الله صلى الله عليه وسلم ‏\"‏ من دخل دار أبي سفيان فهو آمن ومن ألقى السلاح فهو آمن ومن أغلق بابه فهو آمن ‏\"‏ ‏.‏ فقالت الأنصار أما الرجل فقد أخذته رأفة بعشيرته ورغبة في قريته ‏.‏ ونزل الوحى على رسول الله صلى الله عليه وسلم قال ‏\"‏ قلتم أما الرجل فقد أخذته رأفة بعشيرته ورغبة في قريته ‏.‏ ألا فما اسمي إذا - ثلاث مرات - أنا محمد عبد الله ورسوله هاجرت إلى الله وإليكم فالمحيا محياكم والممات مماتكم ‏\"‏ ‏.‏ قالوا والله ما قلنا إلا ضنا بالله ورسوله ‏.‏ قال ‏\"‏ فإن الله ورسوله يصدقانكم ويعذرانكم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. Rabah who said:                      We came to Mu'awiya b. Abu Sufyan as a deputation and Abu Huraira was among us. Each of us would prepare food for his companions turn by turn for a day. (Accordingly) when it was my turn I said: Abu Huraira, it is my turn today. So they came to my place. The food was not yet ready, so I said to Abu Huraira: I wish you could narrate to us a tradition from the Messenger of Allah (may peace be upon him) until the food was ready. (Complying with my request) Abu Huraira said: We were with the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca. He appointed Khalid b. Walid as commander of the right flank, Zubair as commander of the left flank, and Abu 'Ubaida as commander of the foot-soldiers (who were to advance) to the interior of the valley. He (then) said: Abu Huraira, call the Ansar to me. So I called out to them and they came hurriedly. He said: O ye Assembly of the Ansaar, do you see the ruffians of the Quraish? They said: Yes. He said: See, when you meet them tomorrow, wipe them out. He hinted at this with his hand, placing his right hand on his left and said: You will meet us at as-Safa'. (Abu Huraira continued): Whoever was seen by them that day was put to death. The Messenger of Allah (may peace be upon him) ascended the mount of as-Safa'. The Ansar also came there and surrounded the mount. Then came Abu Sufyan and said: Messenger ot Allah, the Quraish have perished. No member of the Quraish tribe will survive this day. The Messenger of Allah (may peace be upon him) said: Who enters the house of Abu Safyin will be safe, who lays down arms will be safe, who locks his door will be safe. (some of) the Ansar said: (After all) the man has been swayed by tenderness towards his family and love for his city. At this, Divine inspiration descended upon the Messenger of Allah (may peace be upon him). He said: You were saying that the man has been swayed by tenderness towards his family and love for his city. Do you know what my name is? I am Muhammad, the bondman of God and His Messenger. (He repeated this thrice.) I left my native place for the take of Allah and joined you. So I will live with you and die with you. Now the Ansar said: By God, we said (that) only out of our greed for Allah and His Messenger. He said: Allah and His Apostle testify to you and accept your apology.",
      "chain": [
        "30025",
        "20300",
        "20021",
        "11269",
        "11865"
      ]
    },
    {
      "hadith_no": "4786",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا عبد الله بن عمرو، - وهو أبو معمر المنقري - حدثنا عبد الوارث، حدثنا عبد العزيز، - وهو ابن صهيب - عن أنس، بن مالك قال لما كان يوم أحد انهزم ناس من الناس عن النبي صلى الله عليه وسلم وأبو طلحة بين يدى النبي صلى الله عليه وسلم مجوب عليه بحجفة - قال - وكان أبو طلحة رجلا راميا شديد النزع وكسر يومئذ قوسين أو ثلاثا - قال - فكان الرجل يمر معه الجعبة من النبل فيقول انثرها لأبي طلحة ‏.‏ قال ويشرف نبي الله صلى الله عليه وسلم ينظر إلى القوم فيقول أبو طلحة يا نبي الله بأبي أنت وأمي لا تشرف لا يصبك سهم من سهام القوم نحري دون نحرك قال ولقد رأيت عائشة بنت أبي بكر وأم سليم وإنهما لمشمرتان أرى خدم سوقهما تنقلان القرب على متونهما ثم تفرغانه في أفواههم ثم ترجعان فتملآنها ثم تجيئان تفرغانه في أفواه القوم ولقد وقع السيف من يدى أبي طلحة إما مرتين وإما ثلاثا من النعاس ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik who said:                      On the Day of Ubud some of the people, being defeated, left the Holy Prophet (may peace he upon him), but Abu Talha stood before him covering him with a shield. Abu Talha was a powerful archer who broke two or three bows that day. When a man would pass by carrying a quiver containing arrows, he would say: Spare them for Abu Talha. Whenever the Holy Prophet (way peace be upon him) raised his head to look at the people, Abd Talba would say: Prophet of Allah, may my father and my mother be thy ransom, do not raise your head lest you be struck by an arrow shot by the enemy. My neck is before your neck. The narrator said: I saw A'isha bint Abu Bakr and Umm Sulaim. Both of them had tucked up their garments, so I could me the anklets on their feet. They were carrying water-skins on their backs and would pour water into the mouths of the people. They would then go back (to the well), would fill them again and would return to pour water into the mouths of the soldiers. (On this day). Abu Talha's sword dropped down from his hands twice or thrice because of drowsiness.",
      "chain": [
        "30025",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4891",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن سهل بن عسكر التميمي، حدثنا يحيى بن حسان، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - وهو ابن حسان - حدثنا معاوية، - يعني ابن سلام - حدثنا زيد بن سلام، عن أبي سلام، قال قال حذيفة بن اليمان قلت يا رسول الله إنا كنا بشر فجاء الله بخير فنحن فيه فهل من وراء هذا الخير شر قال نعم ‏.‏ قلت هل وراء ذلك الشر خير قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت فهل وراء ذلك الخير شر قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت كيف قال ‏\"‏ يكون بعدي أئمة لا يهتدون بهداى ولا يستنون بسنتي وسيقوم فيهم رجال قلوبهم قلوب الشياطين في جثمان إنس ‏\"‏ ‏.‏ قال قلت كيف أصنع يا رسول الله إن أدركت ذلك قال ‏\"‏ تسمع وتطيع للأمير وإن ضرب ظهرك وأخذ مالك فاسمع وأطع ‏\"‏ ‏.‏",
      "text_en": " It his been narrated through a different chain of transmitters, on the authority of Hudhaifa b. al-Yaman who said:                      Messenger of Allah, no doubt, we had an evil time (i. e. the days of Jahiliyya or ignorance) and God brought us a good time (i. e. Islamic period) through which we are now living Will there be a bad time after this good time? He (the Holy Prophet) said: Yes. I said: Will there be a good time after this bad time? He said: Yes. I said: Will there be a bad time after good time? He said: Yes. I said: How? Whereupon he said: There will be leaders who will not be led by my guidance and who will not adopt my ways? There will be among them men who will have the hearts of devils in the bodies of human beings. I said: What should I do. Messenger of Allah, if I (happen) to live in that time? He replied: You will listen to the Amir and carry out his orders; even if your back is flogged and your wealth is snatched, you should listen and obey.",
      "chain": [
        "20300",
        "30025",
        "20300",
        "20401",
        "10912",
        "145"
      ]
    },
    {
      "hadith_no": "4940",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن يوسف، عن الأوزاعي، بهذا الإسناد ‏.‏ مثله غير أنه قال ‏\"‏ إن الله لن يترك من عملك شيئا ‏\"‏ ‏.‏ وزاد في الحديث قال ‏\"‏ فهل تحلبها يوم وردها ‏\"‏ ‏.‏ قال نعم ‏.‏",
      "text_en": " This tradition has been handed down through a different chain of transmitter with the addition of the following words at the end:                     \" Do you milk them on the day they arrive at the water? He replied: Yes.\"",
      "chain": [
        "30025",
        "30388"
      ]
    },
    {
      "hadith_no": "4996",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن الأوزاعي، عن ابن شهاب، بهذا الإسناد فقال ‏\"‏ ورجل في شعب ‏\"‏ ‏.‏ ولم يقل ‏\"‏ ثم رجل ‏\"‏ ‏.‏",
      "text_en": " A version of the tradition narrated on the authority of Ibn Shihab has a little differently worded ending. i. e.\" A man in a mountain valley.\" but did not mention\" next to him a man who....\"",
      "chain": [
        "30025",
        "30388",
        "20024"
      ]
    },
    {
      "hadith_no": "5046",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن عبد الرحمن، أنه سمع أنس بن مالك، يقول أتى رسول الله صلى الله عليه وسلم ابنة ملحان خالة أنس فوضع رأسه عندها ‏.‏ وساق الحديث بمعنى حديث إسحاق بن أبي طلحة ومحمد بن يحيى بن حبان ‏.‏",
      "text_en": " It has been reported by 'Abdullah b. 'Abd al-Rahman that he heard Anas b. Malik say:                      The Messenger of Allah (may peace be upon him) paid a visit to Milhan's daughter, maternal aunt of Anas (and the sister of the Holy Prophet's foster-mother). He placed his head near her (from this point onward, the narrator carried on the previous tradition to its end).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "5168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثناه يحيى بن يحيى، حدثنا هشيم، ح وحدثنا إسحاق بن إبراهيم، أخبرنا  عبد الوهاب الثقفي، ح وحدثنا أبو بكر بن نافع، حدثنا غندر، حدثنا شعبة، ح وحدثنا  عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن سفيان، ح وحدثنا إسحاق، بن إبراهيم أخبرنا جرير، عن منصور، كل هؤلاء عن خالد الحذاء، بإسناد حديث ابن علية ومعنى حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Khalid al-Hadhdha' through different chains o transmitters.",
      "chain": [
        "30399",
        "20468",
        "30123",
        "20259",
        "20523",
        "20278",
        "20020",
        "30025",
        "30388",
        "20005",
        "30123",
        "4057"
      ]
    },
    {
      "hadith_no": "5198",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى، - يعني ابن حسان - أخبرنا معاوية، - وهو ابن سلام - حدثني يحيى بن أبي كثير، أخبرني بعجة بن عبد، الله أن عقبة بن عامر الجهني، أخبره أن رسول الله صلى الله عليه وسلم قسم ضحايا بين أصحابه ‏.‏ بمثل معناه ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Uqba b. 'Amir al-Juhan with a slight change of wording.",
      "chain": [
        "30025",
        "20300",
        "20401",
        "11449",
        "189"
      ]
    },
    {
      "hadith_no": "5411",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، - واللفظ له - حدثنا سليمان، - يعني ابن بلال - عن عبد الله بن عبد الرحمن، أنه سمع أنس بن مالك، يحدث قال أتانا رسول الله صلى الله عليه وسلم في دارنا فاستسقى فحلبنا له شاة ثم شبته من ماء بئري هذه - قال - فأعطيت رسول الله صلى الله عليه وسلم فشرب رسول الله صلى الله عليه وسلم وأبو بكر عن يساره وعمر وجاهه وأعرابي عن يمينه فلما فرغ رسول الله صلى الله عليه وسلم من شربه قال عمر هذا أبو بكر يا رسول الله ‏.‏ يريه إياه فأعطى رسول الله صلى الله عليه وسلم الأعرابي وترك أبا بكر وعمر وقال رسول الله صلى الله عليه وسلم ‏\"‏ الأيمنون الأيمنون الأيمنون ‏\"‏ ‏.‏ قال أنس فهي سنة فهي سنة فهي سنة ‏.‏",
      "text_en": " Anas b. Malik reported:                      Allah's Messenger (may peace be upon him) came to our house and he asked for a drink. We milked a goat for him and then mixed it (the milk) with the water of this well of mine. I gave it to Allah's Messenger (may peace be upon him) and he drank it, while Abu Bakr was on his left and 'Umar was in front of him, and a desert Arab was on his right. When Allah's Messenger (may peace be upon him) had finished the drink, Umar said: Allah's Messenger, here is Abu Bakr, give him to drink; but Allah's Messenger (may peace be upon him) gave it to the desert Arab and he left out Abu Bakr and Umar. And Allah's Messenger (may peace be upon him) said: Those on the right, those on the right, those on the right (deserve preference). Anas said: This is the Sunnah, this is the Sunnah, this is the Sunnah.",
      "chain": [
        "20160",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "5430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن أبي معاوية، ح وحدثناه نصر بن علي الجهضمي، وأبو سعيد الأشج قالا حدثنا أبو أسامة، ح وحدثنا  عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن يوسف، عن سفيان، كلهم عن الأعمش، عن أبي وائل، عن أبي مسعود، بهذا الحديث عن النبي صلى الله عليه وسلم بنحو حديث جرير ‏.‏ قال نصر بن علي في روايته لهذا الحديث حدثنا أبو أسامة، حدثنا الأعمش، حدثنا شقيق بن سلمة، حدثنا أبو مسعود، الأنصاري ‏.‏ وساق الحديث ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Mas'ud Ansari through another chain of transmitters.",
      "chain": [
        "30201",
        "30123",
        "20354",
        "30395",
        "30200",
        "20318",
        "30150",
        "20286",
        "20020",
        "30025",
        "30388",
        "11060"
      ]
    },
    {
      "hadith_no": "5457",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثنا سليمان، بن بلال عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجوع أهل بيت عندهم التمر ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      A family which has dates will not be hungry.",
      "chain": [
        "30025",
        "20300",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5459",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن  عبد الله بن عبد الرحمن، عن عامر بن سعد بن أبي وقاص، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أكل سبع تمرات مما بين لابتيها حين يصبح لم يضره سم حتى يمسي ‏\"‏ ‏.‏",
      "text_en": " Amir b. Sa'd b. Abu Waqqas, on the authority of his father, reported Allah's Messenger (may peace be upon him) having said:                      He who ate seven dates (of the land situated) between these two lava plains in the morning, no poison will harm him until it is evening.",
      "chain": [
        "20160",
        "30025",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5471",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، أخبرنا سليمان، بن بلال عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ نعم الأدم - أو الإدام - الخل ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Apostle (may peace be upon him) as saying:                      The best of condiments or condiment is vinegar.",
      "chain": [
        "30025",
        "20300",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5509",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني زيد بن يزيد أبو معن الرقاشي، حدثنا أبو عاصم، عن عثمان، - يعني ابن مرة - حدثنا عبد الله بن عبد الرحمن، عن خالته أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب في إناء من ذهب أو فضة فإنما يجرجر في بطنه نارا من جهنم ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman reported on the authority of his mother's sister Umm Salama who said that Allah's Messenger (may peace be upon him) said:                      He who drank in vessels of gold or silver he in fact drank down in his belly the fire of Hell.",
      "chain": [
        "20241",
        "30025",
        "56"
      ]
    },
    {
      "hadith_no": "5831",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، وحجاج بن الشاعر، وأحمد بن خراش، قال عبد الله أخبرنا وقال الآخران، حدثنا مسلم بن إبراهيم، قال حدثنا وهيب، عن ابن، طاوس عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ العين حق ولو كان شىء سابق القدر سبقته العين وإذا استغسلتم فاغسلوا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported Allah's Messenger (may peace be upon him) as saying:                      The influence of an evil eye is a fact; if anything would precede the destiny it would be the influence of an evil eye, and when you are asked to take bath (as a cure) from the influence of an evil eye, you should take bath.",
      "chain": [
        "30025",
        "38834",
        "18",
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "5898",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، وابن أبي عمر، قالوا حدثنا سفيان بن عيينة، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، كلهم عن  الزهري، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث عقيل وفي حديث سفيان ويونس الحبة السوداء ‏.‏ ولم يقل الشونيز ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "30263",
        "30022",
        "30421",
        "20005",
        "30553",
        "20121",
        "20115",
        "30025",
        "30330",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5921",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، عن شعيب، عن  الزهري، أخبرني سنان بن أبي سنان الدؤلي، أن أبا هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا عدوى ‏\"‏ ‏.‏ فقام أعرابي ‏.‏ فذكر بمثل حديث يونس وصالح ‏.‏ وعن شعيب عن الزهري قال حدثني السائب بن يزيد ابن أخت نمر أن النبي صلى الله عليه وسلم قال ‏\"‏ لا عدوى ولا صفر ولا هامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There is no trahsitive disease. Thereupon a desert Arab stood up. The rest of the hadith is the same and in the hadith transmitted on the authority of Zuhri' the Prophet (may peace be upon him) is reported to have said: There is no transitive disease, no safar, no hama.",
      "chain": [
        "30025",
        "30330",
        "20428",
        "11013",
        "11511",
        "13"
      ]
    },
    {
      "hadith_no": "6069",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن كثير، حدثنا سليمان، - وهو ابن كثير - عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان مما يقول لأصحابه ‏\"‏ من رأى منكم رؤيا فليقصها أعبرها له ‏\"‏ ‏.‏ قال فجاء رجل فقال يا رسول الله رأيت ظلة ‏.‏ بنحو حديثهم ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) used to say to his Companions:                      He who amongst you sees a vision should narrate it and I would interpret it for him, and a person came and said: Allah's Messenger, I saw a canopy. The rest of the hadith is the same.",
      "chain": [
        "30025",
        "28531",
        "20235",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "6086",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا أبو علي الحنفي، حدثنا مالك، - وهو ابن أنس - عن أبي الزبير المكي، أن أبا الطفيل، عامر بن واثلة أخبره أن معاذ بن جبل أخبره قال خرجنا مع رسول الله صلى الله عليه وسلم عام غزوة تبوك فكان يجمع الصلاة فصلى الظهر والعصر جميعا والمغرب والعشاء جميعا حتى إذا كان يوما أخر الصلاة ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج بعد ذلك فصلى المغرب والعشاء جميعا ثم قال ‏\"‏ إنكم ستأتون غدا إن شاء الله عين تبوك وإنكم لن تأتوها حتى يضحي النهار فمن جاءها منكم فلا يمس من مائها شيئا حتى آتي ‏\"‏ ‏.‏ فجئناها وقد سبقنا إليها رجلان والعين مثل الشراك تبض بشىء من ماء - قال - فسألهما رسول الله صلى الله عليه وسلم ‏\"‏ هل مسستما من مائها شيئا ‏\"‏ ‏.‏ قالا نعم ‏.‏ فسبهما النبي صلى الله عليه وسلم وقال لهما ما شاء الله أن يقول - قال - ثم غرفوا بأيديهم من العين قليلا قليلا حتى اجتمع في شىء - قال - وغسل رسول الله صلى الله عليه وسلم فيه يديه ووجهه ثم أعاده فيها فجرت العين بماء منهمر أو قال غزير - شك أبو علي أيهما قال - حتى استقى الناس ثم قال ‏\"‏ يوشك يا معاذ إن طالت بك حياة أن ترى ما ها هنا قد ملئ جنانا ‏\"‏ ‏.‏",
      "text_en": " Mu'adh b. Jabal reported that he went along with Allah's Apostle (may peace be upon him) in the expedition of Tabuk and he (the Holy Prophet) combined the prayers. He offered the noon and afternoon prayers together and the sunset and night prayers together and on the other day he deferred the prayers; he then came out and offered the noon and afternoon prayers together. He then went in and (later on) came out and then after that offered the sunset and night prayers together and then said:                      God willing, you would reach by tomorrow the fountain of Tabuk and you should not come to that until it is dawn, and he who amongst you happens to go there should not touch its water until I come. We came to that and two persons (amongst) us reached that fountain ahead of us. It was a thin flow of water like the shoelace. Allah's Messenger (may peace be upon him) asked them whether they had touched the water. They said: Yes. Allah's Apostle (may peace be upon him) scolded them, and he said to them what he had to say by the will of God. The people then took water of the fountain in their palms until it became somewhat significant and Allah's Messenger (may peace be upon him) washed his hands and his face too in it, and then, took it again in that (fountain) and there gushed forth abundant water from that fountain, until all the people drank to their fill. He then said: Mu'adh, it is hoped that if you live long you would see its water irrigating well the gardens.",
      "chain": [
        "30025",
        "20260",
        "20001",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "6091",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، وأبو بكر بن إسحاق قالا أخبرنا  أبو اليمان، أخبرنا شعيب، عن الزهري، حدثني سنان بن أبي سنان الدؤلي، وأبو سلمة بن عبد الرحمن أن جابر بن عبد الله الأنصاري، وكان، من أصحاب النبي صلى الله عليه وسلم أخبرهما أنه غزا مع النبي صلى الله عليه وسلم غزوة قبل نجد فلما قفل النبي صلى الله عليه وسلم قفل معه فأدركتهم القائلة يوما ثم ذكر نحو حديث إبراهيم بن سعد ومعمر ‏.‏",
      "text_en": " Jabir b. 'Abdullah al-Ansiri, who was one amongst the Companions of Allah's Apostle (may peace be upon him), reported that he went on an expedition along with Allah's Messenger (may peace be upon him) towards Najd and Allah's Messenger (may peace be upon him) stayed there, and when Allah's Messenger (may peace be upon him) came back he also came back along with him. They, for one day, stayed for rest; the rest of the hadith is the same.",
      "chain": [
        "30025",
        "11108",
        "30330",
        "20428",
        "11013",
        "11511",
        "10567",
        "34"
      ]
    }
  ],
  "total_hadiths": 129
}