{
  "id": "30029",
  "name": "Muhammad bin 'Abdullah bin 'Ammar محمد بن عبد الله بن عمار",
  "full_name": "Muhammad bin 'Abdullah bin 'Ammar محمد بن عبد الله بن عمار",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": [
        "170 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "242",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad",
      "Musal"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  -  ثقة حافظ ]",
      "Hadith"
    ],
    "tags": [
      "al-Azdi",
      "al-Ghamdi",
      "al-Baghdadi",
      "Hafiz",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20614",
      "name": "Yahya bin 'Abdul Malik يحيى بن عبد الملك بن حميد بن أبي غنية",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20464",
      "name": "al-Ma'afa bin 'Imaran bin Naufayl المعافى بن عمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "22225",
      "name": "al-Walid bin Kathir bin Sinan الوليد بن كثير بن سنان المزني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "38557",
      "name": "Muhammad bin 'Ali al-'Asady محمد بن علي الأسدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "28492",
      "name": "al-Qasim bin Yazid al-Jrmy القاسم بن يزيد الجرمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34169",
      "name": "'Amr bin Harun عمرو بن هارون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "28194",
      "name": "Zayd bin Abi al-Zrqa'a زيد بن أبي الزرقاء يزيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20667",
      "name": "'Umar bin Ayoub al-Bdy عمر بن أيوب العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38388",
      "name": "'Ali bin Harb bin Muhammad علي بن حرب بن محمد بن علي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-an-nasai-1220",
      "hadith_no": "1220",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا ابن أبي غنية، - واسمه يحيى بن عبد الملك - والقاسم بن يزيد الجرمي عن سفيان، عن الزبير بن عدي، عن كلثوم، عن عبد الله بن مسعود، - وهذا حديث القاسم - قال كنت آتي النبي صلى الله عليه وسلم وهو يصلي فأسلم عليه فيرد على فأتيته فسلمت عليه وهو يصلي فلم يرد على فلما سلم أشار إلى القوم فقال ‏\"‏ إن الله عز وجل - يعني - أحدث في الصلاة أن لا تكلموا إلا بذكر الله وما ينبغي لكم وأن تقوموا لله قانتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah bin Mas'ud said:                     \"I used to come to the Prophet (ﷺ) when he was praying, and I would greet him with Salam, he would return my greeting. Then I came to him when he was praying, and he did not return my greeting. When he said the Taslim, he pointed to the people and said: \"Allah (SWT) has decreed that in the prayer you should not speak except to remember Allah (SWT), and it is not appropriate for you, and that you should stand before Allah (SWT) with obedience.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20005",
        "11336",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1271",
      "hadith_no": "1271",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرني محمد بن عبد الله بن عمار الموصلي، عن المعافى، عن عصام بن قدامة، عن مالك، - وهو ابن نمير الخزاعي - عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم واضعا يده اليمنى على فخذه اليمنى في الصلاة ويشير بأصبعه ‏.‏",
      "text_en": " It was narrated from Malik bin Numair Al-Khuza'I that his father said:                     \"I saw the Messenger of Allah (ﷺ) putting his right hand on his right thigh when praying and pointing with his finger.\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "15370",
        "14351"
      ]
    },
    {
      "id": "sunan-an-nasai-1310",
      "hadith_no": "1310",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرني محمد بن عبد الله بن عمار الموصلي، عن المعافى، عن الأوزاعي، ح وأنبأنا علي بن خشرم، عن عيسى بن يونس، - واللفظ له - عن الأوزاعي، عن حسان بن عطية، عن محمد بن أبي عائشة، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا تشهد أحدكم فليتعوذ بالله من أربع من عذاب جهنم وعذاب القبر وفتنة المحيا والممات ومن شر المسيح الدجال ثم يدعو لنفسه بما بدا له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muhammad bin Abi 'Aishah said:                     \"I heard Abu Hurairah say: 'The Messenger of Allah (ﷺ) said: When one of you recites the tashahhud, let him seek refuge with Allah (SWT) from our things: From the torment of hell, from the torment of the grave, from the trials of life and death and from the evils of the Dajjal. Then let him pray for himself asking whatever he wants.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20024",
        "30556",
        "20347",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-3",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، عن إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة، قال إن أول جمعة جمعت بعد جمعة جمعت مع رسول الله صلى الله عليه وسلم بمكة جمعة بجواثا بالبحرين قرية لعبد القيس ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The first Jumu'ah that was held with the Messenger of Allah (ﷺ) in Makkah, was a Jum'ah in Juwatha in al-Bahrain, a village of 'Abdul-Qais.\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2435",
      "hadith_no": "2435",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار الموصلي، عن المعافى، عن زكريا بن إسحاق المكي، قال حدثنا يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمعاذ حين بعثه إلى اليمن ‏\"‏ إنك تأتي قوما أهل كتاب فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإن هم أطاعوك بذلك فأخبرهم أن الله عز وجل فرض عليهم خمس صلوات في يوم وليلة فإن هم - يعني أطاعوك بذلك - فأخبرهم أن الله عز وجل فرض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم فإن هم أطاعوك بذلك فاتق دعوة المظلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said to Mu'adh when he sent him to Yemen: 'You are going to some of the People of the book. When you come to them, call them to testify that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they obey you in that, then tell them that Allah, the Mighty and Sublime, has enjoined on them a charity (Zakah) to be taken from their rich and given to their poor. If they obey you in that, then beware of the supplication of the oppressed person.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2656",
      "hadith_no": "2656",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن عبد الله بن عمار الموصلي، قال حدثنا أبو هاشم، محمد بن علي عن المعافى، عن أفلح بن حميد، عن القاسم، عن عائشة، قالت وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة ولأهل الشام ومصر الجحفة ولأهل العراق ذات عرق ولأهل نجد قرنا ولأهل اليمن يلملم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah designated Dhul-Hulaifah as the Miqat for the people of Al-Madinah, Al-Juhfah for the people Ash-sham and Egypt, Dhat 'Irq for the people Al-'Iraq, Qarn for the people of Najd and Yalamlam for the people of Yemen.\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4589",
      "hadith_no": "4589",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، عن حماد بن سلمة، عن سماك بن حرب، عن سعيد بن جبير، عن ابن عمر، قال أتيت النبي صلى الله عليه وسلم فقلت رويدك أسألك إني أبيع الإبل بالبقيع بالدنانير وآخذ الدراهم ‏.‏ قال ‏\"‏ لا بأس أن تأخذ بسعر يومها ما لم تفترقا وبينكما شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"I came to the Prophet and said: 'Wait, I want to ask you something. I sell camels in Al-Baqi with a price set in Dinars but I accept Dirhams instead.' He said: 'There is nothing wrong with it if you take the price on that day, still unfinished business between you both (buyer and seller)\"'",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20021",
        "10770",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5001",
      "hadith_no": "5001",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، - يعني ابن عمران - عن حنظلة بن أبي سفيان، عن عكرمة بن خالد، عن ابن عمر، أن رجلا، قال له ألا تغزو قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بني الإسلام على خمس شهادة أن لا إله إلا الله وإقام الصلاة وإيتاء الزكاة والحج وصيام رمضان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     A man said to him: \"Why don't you go out and fight?\" He said: \"I heard the Messenger of Allah [SAW] say: 'Islam is built on five (pillars): Testimony that there is none worthy of worship except Allah, establishing Salah, giving Zakah, Hajj, and fasting Ramadan.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "11243",
        "11709",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5060",
      "hadith_no": "5060",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، عن إسرائيل، عن أبي إسحاق، عن البراء، قال ما رأيت أحدا أحسن في حلة حمراء من رسول الله صلى الله عليه وسلم وجمته تضرب منكبيه ‏.‏",
      "text_en": " It was narrated that Al-Bara' said:                     \"I have never seen anyone who looked more handsome in a red Hullah than the Messenger of Allah [SAW], with his long hair that came down to his shoulders.\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-5571",
      "hadith_no": "5571",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، - يعني ابن عمران - عن إسماعيل بن مسلم، عن أبي المتوكل، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم نهى أن ينبذ التمر والزبيب والتمر والبسر وقال ‏\"‏ انتبذوا الزبيب فردا والتمر فردا والبسر فردا ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو كثير اسمه يزيد بن عبد الرحمن ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Prophet [SAW] forbade soaking dried dates and raisins, and dried dates and Al-Busr, and he said: \"Soak raisins on their own, and dried dates on their own, and Al-Busr on their own.\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "22025",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-5609",
      "hadith_no": "5609",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا الوليد بن كثير، عن الضحاك بن عثمان، عن بكير بن عبد الله بن الأشج، عن عامر بن سعد، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن قليل ما أسكر كثيره ‏.‏",
      "text_en": " It was narrated from 'Amir bin Sa'd, from his father, that:                     The Prophet [SAW] forbade a small amount of whatever intoxicates in large amounts.",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "11230",
        "20504",
        "11154",
        "10554",
        "9"
      ]
    }
  ],
  "total_hadiths": 11
}