{
  "id": "30024",
  "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
  "full_name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "152",
      "date_gregorian": "NA",
      "date_display": [
        "152 AH"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "235",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  س  -  ثقة ثبت ]",
      "Hadith"
    ],
    "tags": [
      "al-Jashmi",
      "al-Qawariri",
      "Basri",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20221",
      "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20271",
      "name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30566",
      "name": "al-Mthna bin Mua'dh bin Mua'dh المثنى بن معاذ بن معاذ العنبري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30273",
      "name": "Muhammad bin 'Ubaidullah محمد بن عبيد الله بن يزيد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "920",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، قال حدثنا خالد بن الحارث، قال حدثنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يخطب قائما ثم يقعد ثم يقوم، كما تفعلون الآن‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) used to deliver the Khutba while standing and then he would sit, then stand again as you do now-a-days.",
      "chain": [
        "30024",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "76",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، قال كان رجل قد لزم أيوب وسمع منه ففقده أيوب فقالوا يا أبا بكر إنه قد لزم عمرو بن عبيد ‏.‏ قال حماد فبينا أنا يوما مع أيوب وقد بكرنا إلى السوق فاستقبله الرجل فسلم عليه أيوب وسأله ثم قال له أيوب بلغني أنك لزمت ذاك الرجل ‏.‏ قال حماد سماه ‏.‏ يعني عمرا ‏.‏ قال نعم يا أبا بكر إنه يجيئنا بأشياء غرائب ‏.‏ قال يقول له أيوب إنما نفر أو نفرق من تلك الغرائب ‏.‏",
      "text_en": "",
      "chain": [
        "30024",
        "20022"
      ]
    },
    {
      "hadith_no": "86",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "قال مسلم وسمعت عبيد الله بن عمر القواريري، يقول سمعت حماد بن زيد، يقول لرجل بعد ما جلس مهدي بن هلال بأيام ما هذه العين المالحة التي نبعت قبلكم قال نعم يا أبا إسماعيل ‏.‏",
      "text_en": "",
      "chain": [
        "20285",
        "30024",
        "20022"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني الفضل بن سهل، حدثنا وليد بن صالح، قال قال عبيد الله بن عمرو قال زيد يعني ابن أبي أنيسة لا تأخذوا عن أخي، ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "20392",
        "30024",
        "11340"
      ]
    },
    {
      "hadith_no": "98",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني أحمد بن إبراهيم الدورقي، قال حدثني عبد السلام الوابصي، قال حدثني عبد الله بن جعفر الرقي، عن عبيد الله بن عمرو، قال كان يحيى بن أبي أنيسة كذابا ‏.‏",
      "text_en": "",
      "chain": [
        "30494",
        "30346",
        "30024"
      ]
    },
    {
      "hadith_no": "523",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، حدثنا أبو عوانة، عن عبد الملك بن عمير، بهذا الإسناد وحديث جرير أتم وأشبع ‏.‏",
      "text_en": " The same hadith is narrated by Ubaidallah b. Umar al-Qawariri from Abu 'Uwana, who transmitted it to 'Abd al-Malik b. 'Umair on the same chain of transmitter and the hadith of Jarir is more perfect and comprehensive.",
      "chain": [
        "30024",
        "20469"
      ]
    },
    {
      "hadith_no": "531",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، ومحمد بن أبي بكر المقدمي، ومحمد بن عبد الملك الأموي، قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الله بن الحارث بن نوفل، عن العباس بن عبد المطلب، أنه قال يا رسول الله هل نفعت أبا طالب بشىء فإنه كان يحوطك ويغضب لك قال ‏\"‏ نعم هو في ضحضاح من نار ولولا أنا لكان في الدرك الأسفل من النار ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'Abbas b. Abd al-Muttalib that he said:                      Messenger of Allah, have you benefited Abu Talib in any way for he defended you and was fervent in your defence? The Messenger of Allah (may peace he upon him) said: Yes; he would be in the most shallow part of the Fire: and but for me he would have been in the lowest part of Hell.",
      "chain": [
        "30024",
        "30161",
        "20469",
        "11368",
        "912",
        "100"
      ]
    },
    {
      "hadith_no": "276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا إسحاق، أخبرنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن الحكم، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith is narrated by Ubaidullah b. 'Amr and Zaid b. Abu Unaisa with the same chain of transmitters.",
      "chain": [
        "30312",
        "30464",
        "30024",
        "11340"
      ]
    },
    {
      "hadith_no": "378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا عبد الوارث بن سعيد، وعبد الوهاب بن عبد المجيد، قالا حدثنا أيوب، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان ويوتر الإقامة ‏.‏",
      "text_en": " Anas reported:                      Bilal was commanded (by the Holy Prophet) to repeat the phrases twice in Adhan, and once in lqama.",
      "chain": [
        "30024",
        "20258",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر - قال إسحاق أخبرنا وقال أبو بكر، حدثنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن عبد الله بن الحارث النجراني، قال حدثني جندب، قال سمعت النبي صلى الله عليه وسلم قبل أن يموت بخمس وهو يقول ‏\"‏ إني أبرأ إلى الله أن يكون لي منكم خليل فإن الله تعالى قد اتخذني خليلا كما اتخذ إبراهيم خليلا ولو كنت متخذا من أمتي خليلا لاتخذت أبا بكر خليلا ألا وإن من كان قبلكم كانوا يتخذون قبور أنبيائهم وصالحيهم مساجد ألا فلا تتخذوا القبور مساجد إني أنهاكم عن ذلك ‏\"‏ ‏.‏",
      "text_en": " Jundub reported:                      I heard from the Apostle of Allah (may peace be upon him) five days before his death and he said: I stand acquitted before Allah that I took any one of you as friend, for Allah has taken me as His friend, as he took Ibrahim as His friend. Had I taken any one of my Ummah as a friend, I would have taken Abu Bakr as a friend. Beware of those who preceded you and used to take the graves of their prophets and righteous men as places of worship, but you must not take graves as mosques; I forbid you to do that.",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "30464",
        "30024",
        "11340",
        "11381",
        "10780",
        "4053"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا زكرياء بن عدي، أخبرنا عبيد الله، - يعني ابن عمرو - عن زيد بن أبي أنيسة، عن عدي بن ثابت، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تطهر في بيته ثم مشى إلى بيت من بيوت الله ليقضي فريضة من فرائض الله كانت خطوتاه إحداهما تحط خطيئة والأخرى ترفع درجة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be' upon him) said: He who purified himself in his house, and then he walked to one of the houses of Allah for the sake of performing a Fard (obligatory act) out of the Fara'id (obligatory acts) of Allah, both his steps (would be significant) as one of them would obliterate his sin and the second one would raise his status.",
      "chain": [
        "30313",
        "30464",
        "30024",
        "11340",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1646",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا يحيى بن سعيد، عن عبد الملك بن أبي سليمان، قال حدثنا سعيد بن جبير، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يصلي وهو مقبل من مكة إلى المدينة على راحلته حيث كان وجهه - قال - وفيه نزلت ‏{‏ فأينما تولوا فثم وجه الله‏}‏",
      "text_en": " Ibn 'Umar reported that the Messenger of Allah (may peace be upon him) used to say prayer on his camel while coming from Mecca to Medina, in whatever direction his face had turned; and its was (in this context) that this verse was revealed:                     \" So whether you turn thither is Allah's face\" (ii. 115).",
      "chain": [
        "30024",
        "20031",
        "10945",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "2031",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، وأبو كامل الجحدري جميعا عن خالد، - قال أبو كامل حدثنا خالد بن الحارث، - حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يخطب يوم الجمعة قائما ثم يجلس ثم يقوم ‏.‏ قال كما يفعلون اليوم ‏.‏",
      "text_en": " Ibn 'Umar said that the Messenger of Allah (may peace be upon him) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays.",
      "chain": [
        "30024",
        "30559",
        "20423",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2157",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا بشر بن المفضل، حدثنا الجريري، عن أبي العلاء، حيان بن عمير عن عبد الرحمن بن سمرة، قال بينما أنا أرمي، بأسهمي في حياة رسول الله صلى الله عليه وسلم إذ انكسفت الشمس فنبذتهن وقلت لأنظرن إلى ما يحدث لرسول الله صلى الله عليه وسلم في انكساف الشمس اليوم فانتهيت إليه وهو رافع يديه يدعو ويكبر ويحمد ويهلل حتى جلي عن الشمس فقرأ سورتين وركع ركعتين ‏.‏",
      "text_en": " 'Abd al-Rahman b. Samura said:                      During the lifetime of Allah's Messenger (may peace be upon him) I was shooting my arrows in Medina, when an eclipse of the sun took place. I, therefore, threw them away and said, I must see how the Messenger of Allah (may peace be upon him) acts in a solar eclipse today. When I came to him, he had been supplicating with his hands, raised, pronouncing Allah-o-Akbar, praising Him, acknowledging that He is One God till the eclipse was over, then he recited two surahs and prayed two rak'ahs.",
      "chain": [
        "30024",
        "20212",
        "11286",
        "955"
      ]
    },
    {
      "hadith_no": "2400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، وأبو كامل ومحمد بن عبد الملك الأموي قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن المنذر بن جرير، عن أبيه، قال كنت جالسا عند النبي صلى الله عليه وسلم فأتاه قوم مجتابي النمار وساقوا الحديث بقصته وفيه فصلى الظهر ثم صعد منبرا صغيرا فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد فإن الله أنزل في كتابه ‏{‏ يا أيها الناس اتقوا ربكم‏}‏ الآية ‏\"‏ ‏.‏",
      "text_en": " Mundhir b. Jarir narrated on the authority of his father:                      When we were sitting in the company of the Apostle of Allah (may peace be upon him). There came people dressed in striped woollen clothes, and the rest of the hadith in the same, and there (it is also mentioned):\" He observed the Zuhr prayer and then climbed up a small pulpit, praised Allah, lauded Him, and then said: Verily Allah in His Book has revealed: 'O people, fear your Lord, ' etc.\" (iv. 1).",
      "chain": [
        "30024",
        "20469",
        "11368",
        "10831"
      ]
    },
    {
      "hadith_no": "2405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن زيد، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى فذكر خصالا وقال ‏\"‏ من منح منيحة غدت بصدقة وراحت بصدقة صبوحها وغبوقها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) forbade (to do certain things) and then he made a mention of certain habits and said:                      He who gives a she-camel as a gift, for him is the reward (of the gift) both morn- ing and evening-a reward for drinking milk in the morning and a reward for drinking milk in the evening.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "15",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2510",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبيد الله القواريري، حدثنا محمد بن عبد الله بن الزبير، حدثنا سفيان، عن حبيب بن أبي ثابت، عن الضحاك المشرقي، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم في حديث ذكر فيه قوما يخرجون على فرقة مختلفة يقتلهم أقرب الطائفتين من الحق ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported from the Apostle of Allah (may peace be upon him) that a group (Khwarij) would emerge from the different parties (the party of Hadrat 'Ali and the party of Amir Mu'awiya), the group nearer the truth between the two would kill them.",
      "chain": [
        "30024",
        "20005",
        "11331",
        "11694",
        "38"
      ]
    },
    {
      "hadith_no": "2586",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا فضيل بن سليمان، حدثنا أبو حازم، حدثنا سهل بن سعد، قال لما نزلت هذه الآية ‏{‏ وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ قال كان الرجل يأخذ خيطا أبيض وخيطا أسود فيأكل حتى يستبينهما حتى أنزل الله عز وجل ‏{‏ من الفجر‏}‏ فبين ذلك ‏.‏",
      "text_en": " Sahl b. Sa'd said that when this verse was revealed:                     \" Eat and drink till the white streak is distinct from the dark streak,\" a person would take hold of a white thread and a black thread and keep on eating till he could find them distinct (in the light of the dawn). It was then that Allah, the Majestic and Great, reveiled (the words) min al-fajr (from the dawn), and then it became clear (that the word khait refers to the streak of light in the dawn).",
      "chain": [
        "30024",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2752",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا إسحاق بن منصور، وابن أبي خلف، وعبد بن حميد، جميعا عن زكرياء، بن عدي - قال عبد حدثني زكرياء بن عدي، - أخبرنا عبيد الله بن عمرو، عن زيد، بن أبي أنيسة حدثنا الحكم بن عتيبة، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن أمي ماتت وعليها صوم نذر أفأصوم عنها قال ‏\"‏ أرأيت لو كان على أمك دين فقضيتيه أكان يؤدي ذلك عنها ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ فصومي عن أمك ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      A woman came to the Messenger of Allah (may peace be upon him) and said: Messenger of Allah, my mother has died and there is due from her a fast of vow; should I fast on her behalf? Thereupon he said: You see that if your mother had died in debt, would it not have been paid on her behalf? She said: Yes. He (the Holy Prophet) said: Then observe fast on behalf of your mother.",
      "chain": [
        "30313",
        "30553",
        "30464",
        "30464",
        "30024",
        "11340",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2922",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن عروة، عن عائشة، - رضى الله عنها - قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس فواسق يقتلن في الحرم الفارة والعقرب والغراب والحديا والكلب العقور ‏\"‏ ‏.‏",
      "text_en": " A'isha reported Allah's Mdssenger (may peace be upon him) having said this:                      Five are the vicious and harmful things which should be killed even within the precincts of Haram: rat, scorpion, crow. kite and voracious dog.",
      "chain": [
        "30024",
        "20304",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد، - يعني ابن زيد - عن أيوب، ح وحدثني أبو الربيع، حدثنا حماد، حدثنا أيوب، قال سمعت مجاهدا، يحدث عن عبد الرحمن، بن أبي ليلى عن كعب بن عجرة، - رضى الله عنه - قال أتى على رسول الله صلى الله عليه وسلم زمن الحديبية وأنا أوقد تحت - قال القواريري قدر لي ‏.‏ وقال أبو الربيع برمة لي - والقمل يتناثر على وجهي فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏ ‏.‏ قال قلت نعم ‏.‏ قال ‏\"‏ فاحلق وصم ثلاثة أيام أو أطعم ستة مساكين أو انسك نسيكة ‏\"‏ ‏.‏ قال أيوب فلا أدري بأى ذلك بدأ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) came to me on the occasion of Hudaibiya and I was kindling fire under my cooking pot and lice were creeping on my face. Thereupon he (the Holy Prophet) said: Do the vermins harm your head? I said: Yes. He said: Get your head shaved and (in lieu of it) observe fasts for three days or feed six needy persons, or offer sacrifice (of an animal). Ayyub said: I do not know with what (type of expiation) did he commence (the statement).",
      "chain": [
        "30024",
        "20022",
        "11015",
        "30137",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي سعيد، قال خرجنا مع رسول الله صلى الله عليه وسلم نصرخ بالحج صراخا فلما قدمنا مكة أمرنا أن نجعلها عمرة إلا من ساق الهدى فلما كان يوم التروية ورحنا إلى منى أهللنا بالحج ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      We went out with Allah's messenger (may peace be upon him) pronouncing loudly the Talbiya for Hajj When we came to Mecca, he commanded us that we should change this (Ibrim for Hajj) to that of Umra except one who had brought the sacrificial animal with him. When it was the day of Tarwiya (8th of Dhu'l-Hijja) and we went to Mini, we (again) pronounced Talbiya for Hajj.",
      "chain": [
        "30024",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، ومحمد بن أبي بكر المقدمي، قالا حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن الأعمش، بهذا الإسناد نحو حديث ابن مسهر ووكيع إلا قوله ‏\"‏ من تولى غير مواليه ‏\"‏ وذكر اللعنة له ‏.‏",
      "text_en": " A hadith like this has been narrated with the same chain of transmitters by A'mash with a slight variation of words.",
      "chain": [
        "30024",
        "30161",
        "20033",
        "20012"
      ]
    },
    {
      "hadith_no": "3626",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، وأحمد بن عبدة، قال ابن عبدة أخبرنا وقال، عبيد الله حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن قزعة، عن أبي سعيد، الخدري قال ذكر العزل عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ولم يفعل ذلك أحدكم - ولم يقل فلا يفعل ذلك أحدكم - فإنه ليست نفس مخلوقة إلا الله خالقها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      Mention was made about al-'azl in the presence of Allah's Messenger (may peace be upon him), whereupon he said: Why any one of you practises it? (He did not say: One of you should not do it), for there is no created soul, whose creator is not Allah.",
      "chain": [
        "30024",
        "30423",
        "11201",
        "20005",
        "11254",
        "11028",
        "38"
      ]
    },
    {
      "hadith_no": "3837",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، وأبو كامل فضيل بن حسين الجحدري - واللفظ لأبي كامل - قالا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن وراد، - كاتب المغيرة - عن المغيرة بن شعبة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح عنه ‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ أتعجبون من غيرة سعد فوالله لأنا أغير منه والله أغير مني من أجل غيرة الله حرم الفواحش ما ظهر منها وما بطن ولا شخص أغير من الله ولا شخص أحب إليه العذر من الله من أجل ذلك بعث الله المرسلين مبشرين ومنذرين ولا شخص أحب إليه المدحة من الله من أجل ذلك وعد الله الجنة ‏\"‏ ‏.‏",
      "text_en": " AI-Mughira b. Shu'ba (Allah be pleased with him) reported that Sa'd b. 'Ubada (Allah be pleased with him) said:                      If I were to see a man with my wife, I would have struck him with the sword, and not with the flat part (side) of it. When Allah's Messenger (may peace be upon him) heard of that, he said: Are you surprised at Sa'd's jealousy of his honour? By Allah, I am more jealous of my honour than he, and Allah is more jealous than I. Because of His jealousy Allah has prohibited abomination, both open and secret And no person is more jealous of his honour than Allah, and no persons, is more fond of accepting an excuse than Allah, on account of which He has sent messengers, announcers of glad tidings and warners; and no one is more fond of praise than Allah on account of which Allah has promised Paradise.",
      "chain": [
        "30024",
        "20469",
        "11368",
        "11402",
        "166"
      ]
    },
    {
      "hadith_no": "3994",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، ومحمد بن عبيد الغبري، - واللفظ لعبيد الله - قالا حدثنا حماد بن زيد، حدثنا أيوب، عن أبي الزبير، وسعيد بن ميناء، عن جابر بن، عبد الله قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة والمعاومة والمخابرة - قال أحدهما بيع السنين هي المعاومة - وعن الثنيا ورخص في العرايا ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding Muhaqala and Muzabana and Mu'awama and Mukhabara. (One of the narrators) 'said:                      Sale years ahead is Mu'awama, and making exceptional but he made an exemption of araya.",
      "chain": [
        "30024",
        "30213",
        "20022",
        "11015",
        "11263",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني ابن أبي خلف، وحجاج بن الشاعر، قالا حدثنا زكرياء بن عدي، أخبرنا عبيد الله بن عمرو، عن زيد، عن الحكم، عن نافع، عن ابن عمر، أنه أتى رافعا فذكر هذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi, reported from Ibn Umar (Allah be pleated with them) that he came to Rafi and he narrated this hadith from Allah's Apostle (may peace be upon him).",
      "chain": [
        "38834",
        "30464",
        "30024",
        "15",
        "11069",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4043",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عبد الملك أبي زيد، عن طاوس، عن ابن، عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ من كانت له أرض فإنه أن يمنحها أخاه خير ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:                      He who has land, it is better for him that he should let it out to his brother.",
      "chain": [
        "30025",
        "30346",
        "30024",
        "11340",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4126",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى أبو همام، حدثنا سعيد الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم يخطب بالمدينة قال ‏\"‏ يا أيها الناس إن الله تعالى يعرض بالخمر ولعل الله سينزل فيها أمرا فمن كان عنده منها شىء فليبعه ولينتفع به ‏\"‏ ‏.‏ قال فما لبثنا إلا يسيرا حتى قال النبي صلى الله عليه وسلم ‏\"‏ إن الله تعالى حرم الخمر فمن أدركته هذه الآية وعنده منها شىء فلا يشرب ولا يبع ‏\"‏ ‏.‏ قال فاستقبل الناس بما كان عنده منها في طريق المدينة فسفكوها ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon him) addressing in Medina. He said: O people, Allah is giving an indication (of the prohibition) of wine. and He is probably soon going to give an order about it. So he who has anything of it with him should sell that, and derive benefit out of it. He (the narrator) said: We waited for some time that Allah's Apostle (may peace be upon him) said: Verily Allah, the Exalted, has forbidden wine. So who hears this verse and he has anything of it with him, he should neither drink it nor sell it. He (the narrator) said: The people then brought whatever they had of it with them on the streets of Medina and spilt that.",
      "chain": [
        "30024",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4145",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال كنت بالشام في حلقة فيها مسلم بن يسار فجاء أبو الأشعث قال قالوا أبو الأشعث أبو الأشعث ‏.‏ فجلس فقلت له حدث أخانا حديث عبادة بن الصامت ‏.‏ قال نعم غزونا غزاة وعلى الناس معاوية فغنمنا غنائم كثيرة فكان فيما غنمنا آنية من فضة فأمر معاوية رجلا أن يبيعها في أعطيات الناس فتسارع الناس في ذلك فبلغ عبادة بن الصامت فقام فقال إني سمعت رسول الله صلى الله عليه وسلم ينهى عن بيع الذهب بالذهب والفضة بالفضة والبر بالبر والشعير بالشعير والتمر بالتمر والملح بالملح إلا سواء بسواء عينا بعين فمن زاد أو ازداد فقد أربى ‏.‏ فرد الناس ما أخذوا فبلغ ذلك معاوية فقام خطيبا فقال ألا ما بال رجال يتحدثون عن رسول الله صلى الله عليه وسلم أحاديث قد كنا نشهده ونصحبه فلم نسمعها منه ‏.‏ فقام عبادة بن الصامت فأعاد القصة ثم قال لنحدثن بما سمعنا من رسول الله صلى الله عليه وسلم وإن كره معاوية - أو قال وإن رغم - ما أبالي أن لا أصحبه في جنده ليلة سوداء ‏.‏ قال حماد هذا أو نحوه‏.‏",
      "text_en": " Abil Qiliba reported:                      I was in Syria (having) a circle (of friends). in which was Muslim b. Yasir. There came Abu'l-Ash'ath. He (the narrator) said that they (the friends) called him: Abu'l-Ash'ath, Abu'l-Ash'ath, and he sat down. I said to him: Narrate to our brother the hadith of Ubada b. Samit. He said: Yes. We went out on an expedition, Mu'awiya being the leader of the people, and we gained a lot of spoils of war. And there was one silver utensil in what we took as spoils. Mu'awiya ordered a person to sell it for payment to the people (soldiers). The people made haste in getting that. The news of (this state of affairs) reached 'Ubada b. Samit, and he stood up and said: I heard Allah's Messenger (may peace be upon him) forbidding the sale of gold by gold, and silver by silver, and wheat by wheat, and barley by barley, and dates by dates, and salt by salt, except like for like and equal for equal. So he who made an addition or who accepted an addition (committed the sin of taking) interest. So the people returned what they had got. This reached Mu'awiya. and he stood up to deliver an address. He said: What is the matter with people that they narrate from the Messenger (may peace be upon him) such tradition which we did not hear though we saw him (the Holy Prophet) and lived in his company? Thereupon, Ubida b. Samit stood up and repeated that narration, and then said: We will definitely narrate what we heard from Allah's Messenger (may peace be upon him) though it may be unpleasant to Mu'awiya (or he said: Even if it is against his will). I do not mind if I do not remain in his troop in the dark night. Hammad said this or something like this.",
      "chain": [
        "30024",
        "20022",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "4232",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، قال سمعت محمد بن المنكدر، قال سمعت جابر بن عبد الله، يقول عادني رسول الله صلى الله عليه وسلم وأنا مريض ومعه أبو بكر ماشيين فوجدني قد أغمي على فتوضأ رسول الله صلى الله عليه وسلم ثم صب على من وضوئه فأفقت فإذا رسول الله صلى الله عليه وسلم فقلت يا رسول الله كيف أصنع في مالي فلم يرد على شيئا حتى نزلت آية الميراث ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      While I had been ill Allah's Messenger (may peace be upon him) visited me and Abu akr (Allah be pleased with him) was with him, and they both came walking on foot. He (the Holy Prophet) found me unconscious. Allahs Messenger (may peace be upon him) performed ablution and then sprinkled over me the water of his ablution. I felt relieved regained my consciousness) and found Allah's Messenger (may peace be upon him) there. I said: Allah's Messenger, what should I do with my property? He gave me no reply until the verse (iv. 177) relating to the law of inheritance was revealed.",
      "chain": [
        "30024",
        "20033",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا خالد بن الحارث، حدثنا هشام، عن يحيى بن أبي كثير، حدثني أبو سلمة بن عبد الرحمن، قال سمعت جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى لمن وهبت له ‏\"‏ ‏.‏",
      "text_en": " Jabir (b. 'Abdullah) (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Life grant is for one upon whom it is bestowed.",
      "chain": [
        "30024",
        "20226",
        "20295",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "4435",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد، الله بن سهل انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن وابنا عمه حويصة ومحيصة إلى النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغر منهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر - أو قال - ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏",
      "text_en": " Sahl. b. Abu Hathma and Rafi' b. Khadij reported that Muhayyisa b. Mas'ud and 'Abdullah b. Sahl went towards Khaibar and they separated near the palm-trees. 'Abdullah b. Sahl was killed. They accused the Jews (for this act). And there came to Allah's Apostle (may peace be upon him) his brother (the brother of the slain person) 'Abd al-Rahman and his cousins Huwayyisa and Muhayyisa; and 'Abd al-Rahman talked to him about the matter pertaining to (the murder of) his brother, and he was the youngest among them. Thereupon Allah's Messenger (may peace be upon him) said:                      Show regard for the greatness of the old, or he said: Let the eldest begin speaking. Then they (Huwayyisa and Muhayyisa) spoke about the matter of their companion (murder of their cousin, 'Abdullah b. Sahl). Thereupon Allah's Messenger (may peace be upon him) said: Let fifty (persons) among you take oath for levelling the charge (of murder) against a person amongst them, and he would be surrendered to you. They said: We have not witnessed this matter ourselves. How can we then take oath? He (the Holy Prophet) said: The Jews will exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah, they are non-believing people. Thereupon Allah's Messenger (may peace be upon him) paid the blood wit for him. Sahl said: As one day I entered the fold a she-camel amongst those camels hit me with its leg.",
      "chain": [
        "30024",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986",
        "1920"
      ]
    },
    {
      "hadith_no": "4436",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا القواريري، حدثنا بشر بن المفضل، حدثنا يحيى بن سعيد، عن بشير بن، يسار عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم ‏.‏ نحوه ‏.‏ وقال في حديثه فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏ ولم يقل في حديثه فركضتني ناقة ‏.‏",
      "text_en": " Sahl b. Abu Hathma has narrated this hadith through another chain of transmitters with a slight variation of words, but no mention has been made of the hitting by the she-camel.",
      "chain": [
        "30024",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن سفيان، ح وحدثني محمد، بن حاتم حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله، - يعني ابن عمرو - عن زيد، بن أبي أنيسة ح وحدثني عبد الرحمن بن بشر، حدثنا بهز، حدثنا حماد بن سلمة، كل هؤلاء عن سلمة بن كهيل، بهذا الإسناد ‏.‏ نحو حديث شعبة ‏.‏ وفي حديثهم جميعا ثلاثة أحوال إلا حماد بن سلمة فإن في حديثه عامين أو ثلاثة ‏.‏ وفي حديث سفيان وزيد بن أبي أنيسة وحماد بن سلمة ‏\"‏ فإن جاء أحد يخبرك بعددها ووعائها ووكائها فأعطها إياه ‏\"‏ ‏.‏ وزاد سفيان في رواية وكيع ‏\"‏ وإلا فهي كسبيل مالك ‏\"‏ ‏.‏ وفي رواية ابن نمير ‏\"‏ وإلا فاستمتع بها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Salama b. Kuhail through different chains of transmitters. In their ahadith, it is three years, except in the hadith of Hammid b. Salama it is two years or three years. In the hadith transmitted on the authority of Sufyan and Zaid b. Abu Unaisa and Hammid b. Salama (the words are):                     \" If someone comes and informs you about the number (of articles) of the bag and the straps, then give that to him.\" Sufyan has made this addition in the narration of Waki':\" Otherwise it is like your property.\" And in the narration of Ibn Numair the words are:\" Otherwise make use of that.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "30201",
        "20032",
        "30212",
        "20005",
        "38487",
        "30346",
        "30024",
        "11340",
        "30356",
        "20214"
      ]
    },
    {
      "hadith_no": "4893",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا أيوب، عن غيلان، بن جرير عن زياد بن رياح القيسي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بنحو حديث جرير وقال ‏\"‏ لا يتحاشى من مؤمنها ‏\"‏ ‏.‏",
      "text_en": " The same tradition has been narrated by the same authority through another chain of transmitters with a slight difference in wording.",
      "chain": [
        "30024",
        "20022",
        "11015",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "5218",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عطاء بن أبي رباح، عن جابر بن عبد الله، قال كنا لا نمسك لحوم الأضاحي فوق ثلاث فأمرنا رسول الله صلى الله عليه وسلم أن نتزود منها ونأكل منها ‏.‏ يعني فوق ثلاث ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      We did not eat the flesh of sacrificed animals beyond three (days), but then Allah's Messenger (may peace be upon him) commanded us to make it a provision for journey and cat it (beyond three days).",
      "chain": [
        "30123",
        "30464",
        "30024",
        "11340",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "5334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن أحمد بن أبي خلف، - واللفظ لابن أبي خلف - قالا حدثنا زكرياء بن عدي، حدثنا عبيد الله، - وهو ابن عمرو - عن زيد بن، أبي أنيسة عن سعيد بن أبي بردة، حدثنا أبو بردة، عن أبيه، قال بعثني رسول الله صلى الله عليه وسلم ومعاذا إلى اليمن فقال ‏\"‏ ادعوا الناس وبشرا ولا تنفرا ويسرا ولا تعسرا ‏\"‏ ‏.‏ قال فقلت يا رسول الله أفتنا في شرابين كنا نصنعهما باليمن البتع وهو من العسل ينبذ حتى يشتد والمزر وهو من الذرة والشعير ينبذ حتى يشتد قال وكان رسول الله صلى الله عليه وسلم قد أعطي جوامع الكلم بخواتمه فقال ‏\"‏ أنهى عن كل مسكر أسكر عن الصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      Allah's Messenger (may peace be upon him) sent me and Mu'adh to Yemen saying: Call people (to the path of righteousness) and give good tidings to the (people), and do not repel them, make things easy for them and do not make things difficult. I (Burda) said: Allah's Messenger, give us a religious verdict about two kinds of drinks which we prepare in Yemen. One is Bit' which is prepared from honey; it is a fermented Nabidh and is strong and turns into wine, and (the second is) Mizr which is prepared from millet and barley. Thereupon, Allah's Messenger (may peace be upon him), who had been gifted with the most eloquent and pithy expressions, said: I forbid you from every intoxicant that keeps you away from prayer.",
      "chain": [
        "30123",
        "30464",
        "30024",
        "11340",
        "11345",
        "1820"
      ]
    },
    {
      "hadith_no": "5440",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني عمرو الناقد، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن أنس بن مالك، قال أمر أبو طلحة أم سليم أن تصنع، للنبي صلى الله عليه وسلم طعاما لنفسه خاصة ثم أرسلني إليه ‏.‏ وساق الحديث وقال فيه فوضع النبي صلى الله عليه وسلم يده وسمى عليه ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فدخلوا فقال ‏\"‏ كلوا وسموا الله ‏\"‏ ‏.‏ فأكلوا حتى فعل ذلك بثمانين رجلا ‏.‏ ثم أكل النبي صلى الله عليه وسلم بعد ذلك وأهل البيت وتركوا سؤرا ‏.‏",
      "text_en": " Anas b. Malik reported:                      Abu Talha ordered Umm Sulaim to prepare a meal specially for Allah's Apostle (may peace be upon him). He then sent me to him (to the Holy Prophet) ; the rest of the hadith is the same (but there is a slight variation of wording):\" Allah's Messenger (may peace be upon him) placed his hand and mentioned the name of Allah upon that, and then said: Admit ten men. He (Abu Talha) admitted them and they got in. He (the Holy Prophet) said: Eat while mentioning the name of Allah upon it (the meal). They ate until eighty persons had taken the food. Then Allah's Apostle (may peace be upon him) had his meal and so the members of the household, and still they left some food.\"",
      "chain": [
        "30263",
        "30346",
        "30024",
        "11368",
        "11196",
        "19"
      ]
    },
    {
      "hadith_no": "5538",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، وأبو غسان المسمعي وزهير بن حرب وإسحاق بن إبراهيم ومحمد بن المثنى وابن بشار - قال إسحاق أخبرنا وقال الآخرون، حدثنا - معاذ بن هشام، حدثني أبي، عن قتادة، عن عامر الشعبي، عن سويد بن غفلة، أن عمر، بن الخطاب خطب بالجابية فقال نهى نبي الله صلى الله عليه وسلم عن لبس الحرير إلا موضع إصبعين أو ثلاث أو أربع ‏.‏",
      "text_en": " Suwaid b. Ghafala said:                      'Umar addressed us at a place known as Jabiya (Syria) and he said: Allah's Apostle (may peace be upon him) forbade us the wearing of silk but to the extent of two or three fingers or four fingers.",
      "chain": [
        "30024",
        "30456",
        "30312",
        "20287",
        "20295",
        "11019",
        "11052",
        "11174"
      ]
    },
    {
      "hadith_no": "6218",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي الطفيل، قال رأيت رسول الله صلى الله عليه وسلم وما على وجه الأرض رجل رآه غيري ‏.‏ قال فقلت له فكيف رأيته قال كان أبيض مليحا مقصدا ‏.‏",
      "text_en": " Abu Tufail reported:                      I saw Allah's Messenger (may peace be upon him) and there is one amongst the people of the earth who (are living at the present time and) had seen him except me. I said to him: How did you find him? He said: He had an elegant white color, and he was of an average height.",
      "chain": [
        "30024",
        "20246",
        "11286",
        "3660"
      ]
    },
    {
      "hadith_no": "6508",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، وعمرو الناقد، كلاهما عن سفيان، قال عبيد الله حدثنا سفيان بن عيينة، قال سمعت ابن المنكدر، يقول سمعت جابر بن عبد الله، يقول لما كان يوم أحد جيء بأبي مسجى وقد مثل به - قال - فأردت أن أرفع الثوب فنهاني قومي ثم أردت أن أرفع الثوب فنهاني قومي فرفعه رسول الله صلى الله عليه وسلم أو أمر به فرفع فسمع صوت باكية أو صائحة فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ فقالوا بنت عمرو أو أخت عمرو فقال ‏\"‏ ولم تبكي فما زالت الملائكة تظله بأجنحتها حتى رفع ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      The dead body of my father was brought and he was covered (with cloth) and it had been mutilated. I made an attempt to lift the cloth, but my people prohibited me to do so. I again made an attempt to lift the cloth, but my people prohibited me. Thereupon Allah's Messenger (may peace be upon him) lifted it or he commanded it to be lifted. He heard the noise (of a loud) weeping, or the noise of a woman mourner. He inquired who she was. They said: The daughter of 'Amr or the sister of Amr, whereupon he said: Why does she weep? The Angels provide him shade with the help of their Wings until he would be lifted (to his heavenly abode)",
      "chain": [
        "30024",
        "20005",
        "11201",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6511",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن عبد الكريم، عن محمد بن المنكدر، عن جابر، قال جيء بأبي يوم أحد مجدعا فوضع بين يدى النبي صلى الله عليه وسلم ‏.‏ فذكر نحو حديثهم ‏.‏",
      "text_en": " Jabir reported:                      My father was brought in a state that his ears had been cut off and (his dead body) was placed before Allah's Apostle (may peace be upon him), the rest of the hadith is the same.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "18655",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6586",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، ومحمد بن المثنى، وابن، بشار جميعا عن  ابن مهدي، قال قال ابن المثنى حدثني عبد الرحمن بن مهدي، حدثنا شعبة، عن أبي عمران، الجوني عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ائت قومك فقل إن رسول الله صلى الله عليه وسلم قال أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
      "chain": [
        "30024",
        "30170",
        "20033",
        "20033",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6735",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا يزيد بن زريع، حدثنا الحجاج الصواف، حدثني أبو الزبير، حدثنا جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم دخل على أم السائب أو أم المسيب فقال ‏\"‏ ما لك يا أم السائب أو يا أم المسيب تزفزفين ‏\"‏ ‏.‏ قالت الحمى لا بارك الله فيها ‏.‏ فقال ‏\"‏ لا تسبي الحمى فإنها تذهب خطايا بني آدم كما يذهب الكير خبث الحديد ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) visited Umm Sa'ib or Umm Musayyib and said:                      Umm Sa'ib or Umm Musayyib. why is it that you are shivering? She said:\" It is fever and may it not be blessed by Allah, whereupon he (the Holy Prophet) said: Don't curse fever for it expiates the sir of the posterity of Adam just as furnace removes the alloy of iron.",
      "chain": [
        "30024",
        "20304",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6736",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا يحيى بن سعيد، وبشر بن المفضل، قالا حدثنا عمران أبو بكر، حدثني عطاء بن أبي رباح، قال قال لي ابن عباس ألا أريك امرأة من أهل الجنة قلت بلى ‏.‏ قال هذه المرأة السوداء أتت النبي صلى الله عليه وسلم قالت إني أصرع وإني أتكشف فادع الله لي ‏.‏ قال ‏\"‏ إن شئت صبرت ولك الجنة وإن شئت دعوت الله أن يعافيك ‏.‏ قالت أصبر ‏.‏ قالت فإني أتكشف فادع الله أن لا أتكشف ‏.‏ فدعا لها ‏.‏",
      "text_en": " 'Ata' b. Abi Rabih said:                      Ibn Abbas said to me: May I show you a woman of Paradise? I said: Yes. He said: Here is this dark-complexioned woman. She came to Allah's Apostle (may peace be upon him) and said: I am suffering from falling sickness and I become naked; supplicate Allah for me, whereupon he (the Holy Prophet) said: Show endurance as you can do and there would be Paradise for you and, if you desire, I supplicate Allah that He may cure you. She said: I am prepared to show endurance (but the unbearable trouble is) that I become naked, so supplicate Allah that He should not let me become naked, so he supplicated for her.",
      "chain": [
        "30024",
        "20031",
        "20212",
        "11029"
      ]
    },
    {
      "hadith_no": "6854",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا يزيد بن زريع، عن عمر بن محمد، عن أبيه، قال سمعت ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Messenger (may peace be upon him) as saying:                      Gabriel impressed upon me (the kind treatment) towards the neighbour (so much) that I thought as if he would soon confer upon him the (right) of inheritance.",
      "chain": [
        "30024",
        "20304",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "6978",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، وأبو كامل ومحمد بن عبد الملك الأموي قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن المنذر بن جرير، عن أبيه، عن النبي صلى الله عليه وسلم ح",
      "text_en": " Jarir transmitted this hadith from his father through another chain of narrators.",
      "chain": [
        "30024",
        "20469",
        "11368",
        "10831"
      ]
    },
    {
      "hadith_no": "7263",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، وإسحاق بن إبراهيم، ومحمد بن المثنى، وابن، بشار قال إسحاق أخبرنا وقال الآخرون، حدثنا معاذ بن هشام، حدثنا أبي، عن قتادة، حدثنا أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏\"‏ يقال للكافر يوم القيامة أرأيت لو كان لك ملء الأرض ذهبا أكنت تفتدي به فيقول نعم ‏.‏ فيقال له قد سئلت أيسر من ذلك ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be u n him) said:                      It would be said to the non-believers on the Day of Resurrection: If you were to possess gold, filling the whole earth, would you like to secure your freedom by paying that? He would say: Yes. Thereupon it would be said to him: Something easier (than this) was demanded from you (but you paid no heed to it).",
      "chain": [
        "30024",
        "30123",
        "30170",
        "30160",
        "30312",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7400",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا بديل، عن عبد، الله بن شقيق عن أبي هريرة، قال ‏\"‏ إذا خرجت روح المؤمن تلقاها ملكان يصعدانها ‏\"‏ ‏.‏ قال حماد فذكر من طيب ريحها وذكر المسك ‏.‏ قال ‏\"‏ ويقول أهل السماء روح طيبة جاءت من قبل الأرض صلى الله عليك وعلى جسد كنت تعمرينه ‏.‏ فينطلق به إلى ربه عز وجل ثم يقول انطلقوا به إلى آخر الأجل ‏\"‏ ‏.‏ قال ‏\"‏ وإن الكافر إذا خرجت روحه - قال حماد وذكر من نتنها وذكر لعنا - ويقول أهل السماء روح خبيثة جاءت من قبل الأرض ‏.‏ قال فيقال انطلقوا به إلى آخر الأجل ‏\"‏ ‏.‏ قال أبو هريرة فرد رسول الله صلى الله عليه وسلم ريطة كانت عليه على أنفه هكذا ‏.‏",
      "text_en": " Abu Huraira reported:                      When the soul of a believer would go out (of his body) it would be received bv two angels who would take it to the sky. Hammad (one of the narrators in the chain of transmitters) mentioned the swetness of its odour, (and further said) that the dwellers of the sky say: Here comes the pious soul from the side of the earth Let there be blessings of Allah upon the body in which it resides. And it is carried (by the angels) to its Lord, the Exalted and Glorious. He would say: Take it to its destined end. And if he is a nonbeliever and as it (the soul) leaves the body-Hammad made a mention of its foul smell and of its being cursed-the dwellers of the sky say: There comes a dirty soul from the side of the earth, and it would be said: Take it to its destined end. Abu Huraira reported that Allah's Messenger (may peace be upon him) put a thin cloth which was with him upon his nose while making a mention (of the foul smell) of the soul of a non-believer.",
      "chain": [
        "30024",
        "20022",
        "10694",
        "13"
      ]
    }
  ],
  "total_hadiths": 106
}