{
  "id": "30103",
  "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
  "full_name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "226",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  ت  ق  -  صدوق ]",
      "Recitation/Quran"
    ],
    "tags": [
      "al-Asbahi",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20436",
      "name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20436",
      "name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "12154",
      "name": "Salmah bin Wrdan al-Lythy سلمة بن وردان الليثي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20154",
      "name": "Isma'il bin Ibrahim bin 'Uqba إسماعيل بن إبراهيم بن عقبة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22172",
      "name": "Kathir bin 'Abdullah كثير بن عبد الله بن عمرو بن عوف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "22",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري، رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يدخل أهل الجنة الجنة، وأهل النار النار، ثم يقول الله تعالى أخرجوا من كان في قلبه مثقال حبة من خردل من إيمان‏.‏ فيخرجون منها قد اسودوا فيلقون في نهر الحيا  أو الحياة، شك مالك  فينبتون كما تنبت الحبة في جانب السيل، ألم تر أنها تخرج صفراء ملتوية ‏\"‏‏.‏ قال وهيب حدثنا عمرو ‏\"‏ الحياة ‏\"‏‏.‏ وقال ‏\"‏ خردل من خير ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Said Al-Khudri:                          The Prophet said, \"When the people of Paradise will enter Paradise and     the people of Hell will go to Hell, Allah will order those who have      had faith equal to the weight of a grain of mustard seed to be taken      out from Hell. So they will be taken out but (by then) they will be      blackened (charred). Then they will be put in the river of Haya'      (rain) or Hayat (life) (the Narrator is in doubt as to which is the      right term), and they will revive like a grain that grows near the      bank of a flood channel. Don't you see that it comes out yellow and      twisted\"",
      "chain": [
        "30103",
        "20001",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "37",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said: \"Whoever establishes prayers during the nights      of Ramadan faithfully out of sincere faith and hoping to attain      Allah's rewards (not for showing off), all his past sins will be      forgiven.\"",
      "chain": [
        "30103",
        "20001",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "46",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك بن أنس، عن عمه أبي سهيل بن مالك، عن أبيه، أنه سمع طلحة بن عبيد الله، يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد، ثائر الرأس، يسمع دوي صوته، ولا يفقه ما يقول حتى دنا، فإذا هو يسأل عن الإسلام فقال رسول الله  صلى الله عليه وسلم ‏\"‏ خمس صلوات في اليوم والليلة ‏\"‏‏.‏ فقال هل على غيرها قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وصيام رمضان ‏\"‏‏.‏ قال هل على غيره قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ قال وذكر له رسول الله صلى الله عليه وسلم الزكاة‏.‏ قال هل على غيرها قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ قال فأدبر الرجل وهو يقول والله لا أزيد على هذا ولا أنقص‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏‏.‏",
      "text_en": "      Narrated Talha bin 'Ubaidullah:                          A man from Najd with unkempt hair came to Allah's Apostle and we heard     his loud voice but could not understand what he was saying, till he      came near and then we came to know that he was asking about Islam.      Allah's Apostle said, \"You have to offer prayers perfectly five times      in a day and night (24 hours).\" The man asked, \"Is there any more      (praying)?\" Allah's Apostle replied, \"No, but if you want to offer the     Nawafil prayers (you can).\" Allah's Apostle further said to him: \"You      have to observe fasts during the month of Ramadan.\" The man asked,      \"Is there any more fasting?\" Allah's Apostle replied, \"No, but if you      want to observe the Nawafil fasts (you can.)\" Then Allah's Apostle      further said to him, \"You have to pay the Zakat (obligatory charity).\"     The man asked, \"Is there any thing other than the Zakat for me to      pay?\" Allah's Apostle replied, \"No, unless you want to give alms of      your own.\" And then that man retreated saying, \"By Allah! I will      neither do less nor more than this.\" Allah's Apostle said, \"If what he     said is true, then he will be successful (i.e. he will be granted      Paradise).\"",
      "chain": [
        "30103",
        "20001",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "64",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس، أخبره أن رسول الله صلى الله عليه وسلم بعث بكتابه رجلا، وأمره أن يدفعه إلى عظيم البحرين، فدفعه عظيم البحرين إلى كسرى، فلما قرأه مزقه‏.‏ فحسبت أن ابن المسيب قال فدعا عليهم رسول الله صلى الله عليه وسلم أن يمزقوا كل ممزق‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Once Allah's Apostle gave a letter to a person and ordered him to go and deliver it to the Governor of Bahrain. (He did so) and the Governor of Bahrain sent it to Chousroes, who read that letter and then tore it to pieces. (The sub-narrator (Ibn Shihab) thinks that Ibn Al-Musaiyab said that Allah's Apostle invoked Allah against them (saying), \"May Allah tear them into pieces, and disperse them all totally.)\"",
      "chain": [
        "30103",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "66",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه، إذ أقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، قال فوقفا على رسول الله صلى الله عليه وسلم فأما أحدهما فرأى فرجة في الحلقة فجلس فيها، وأما الآخر فجلس خلفهم، وأما الثالث فأدبر ذاهبا، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     While Allah's Apostle was sitting in the mosque with some people, three men came. Two of them came in front of Allah's Apostle and the third one went away. The two persons kept on standing before Allah's Apostle for a while and then one of them found a place in the circle and sat there while the other sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, so Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, so Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from Allah and went away, so Allah turned His face from him likewise. \"",
      "chain": [
        "30103",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "76",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن عبد الله بن عباس، قال أقبلت راكبا على حمار أتان، وأنا يومئذ قد ناهزت الاحتلام، ورسول الله صلى الله عليه وسلم يصلي بمنى إلى غير جدار، فمررت بين يدى بعض الصف وأرسلت الأتان ترتع، فدخلت في الصف، فلم ينكر ذلك على‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I came riding a she-ass and had (just) attained the age of puberty. Allah's Apostle was offering the prayer at Mina. There was no wall in front of him and I passed in front of some of the row while they were offering their prayers. There I let the she-ass loose to graze and entered the row, and nobody objected to it.",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "83",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عيسى بن طلحة بن عبيد الله، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم وقف في حجة الوداع بمنى للناس يسألونه، فجاءه رجل فقال لم أشعر فحلقت قبل أن أذبح‏.‏ فقال ‏\"‏ اذبح ولا حرج ‏\"‏‏.‏ فجاء آخر فقال لم أشعر، فنحرت قبل أن أرمي‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏‏.‏ فما سئل النبي صلى الله عليه وسلم عن شىء قدم ولا أخر إلا قال افعل ولا حرج‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al `Aas:                     Allah's Apostle stopped (for a while near the Jimar) at Mina during his last Hajj for the people and they were asking him questions. A man came and said, \"I forgot and got my head shaved before slaughtering the Hadi (sacrificing animal).\" The Prophet said, \"There is no harm, go and do the slaughtering now.\" Then another person came and said, \"I forgot and slaughtered (the camel) before Rami (throwing of the pebbles) at the Jamra.\" The Prophet said, \"Do the Rami now and there is no harm.\" The narrator added: So on that day, when the Prophet was asked about anything (as regards the ceremonies of Hajj) performed before or after its due time, his reply was: \"Do it (now) and there is no harm.\"",
      "chain": [
        "30103",
        "20001",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "100",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن عبد الله بن عمرو بن العاص، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله لا يقبض العلم انتزاعا، ينتزعه من العباد، ولكن يقبض العلم بقبض العلماء، حتى إذا لم يبق عالما، اتخذ الناس رءوسا جهالا فسئلوا، فأفتوا بغير علم، فضلوا وأضلوا ‏\"‏‏.قال الفربري حدثنا عباس قال حدثنا قتيبة حدثنا جرير عن هشام نحوه‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     I heard Allah's Apostle saying, \"Allah does not take away the knowledge, by taking it away from (the hearts of) the people, but takes it away by the death of the religious learned men till when none of the (religious learned men) remains, people will take as their leaders ignorant persons who when consulted will give their verdict without knowledge. So they will go astray and will lead the people astray.\"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "120",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة، قال حفظت من رسول الله صلى الله عليه وسلم وعاءين، فأما أحدهما فبثثته، وأما الآخر فلو بثثته قطع هذا البلعوم‏.‏",
      "text_en": " Narrated Abu Huraira:                     I have memorized two kinds of knowledge from Allah's Apostle . I have propagated one of them to you and if I propagated the second, then my pharynx (throat) would be cut (i.e. killed).",
      "chain": [
        "30103",
        "20436",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وهي مثل المسلم، حدثوني ما هي ‏\"‏‏.‏ فوقع الناس في شجر البادية، ووقع في نفسي أنها النخلة‏.‏ قال عبد الله فاستحييت‏.‏ فقالوا يا رسول الله، أخبرنا بها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏ قال عبد الله فحدثت أبي بما وقع في نفسي فقال لأن تكون قلتها أحب إلى من أن يكون لي كذا وكذا‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once Allah's Apostle said, \"Amongst the trees there is a tree, the leaves of which do not fall and is like a Muslim, tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas and I thought of the date-palm tree but felt shy (to answer). The others asked, \"O Allah's Apostle! inform us of it.\" He replied, \"it is the date-palm tree.\" I told my father what had come to my mind and on that he said, \"Had you said it I would have preferred it to such and such a thing that I might possess.\"",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "183",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن عبد الله بن عباس، أخبره أنه، بات ليلة عند ميمونة زوج النبي صلى الله عليه وسلم وهي خالته فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل، أو قبله بقليل أو بعده بقليل، استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة، فتوضأ منها فأحسن وضوءه، ثم قام يصلي‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع، ثم ذهبت، فقمت إلى جنبه، فوضع يده اليمنى على رأسي، وأخذ بأذني اليمنى، يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع، حتى أتاه المؤذن، فقام، فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     That he stayed overnight in the house of Maimuna the wife of the Prophet, his aunt. He added : I lay on the bed (cushion transversally) while Allah's Apostle and his wife lay in the lengthwise direction of the cushion. Allah's Apostle slept till the middle of the night, either a bit before or a bit after it and then woke up, rubbing the traces of sleep off his face with his hands. He then, recited the last ten verses of Sura Al-`Imran, got up and went to a hanging water-skin. He then Performed the ablution from it and it was a perfect ablution, and then stood up to offer the prayer. I, too, got up and did as the Prophet had done. Then I went and stood by his side. He placed his right hand on my head and caught my right ear and twisted it. He prayed two rak`at then two rak`at and two rak`at and then two rak`at and then two rak`at and then two rak`at (separately six times), and finally one rak`a (the witr). Then he lay down again in the bed till the Mu'adh-dhin came to him where upon the Prophet got up, offered a two light rak`at prayer and went out and led the Fajr prayer.",
      "chain": [
        "30103",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "184",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن امرأته، فاطمة عن جدتها، أسماء بنت أبي بكر أنها قالت أتيت عائشة زوج النبي صلى الله عليه وسلم حين خسفت الشمس، فإذا الناس قيام يصلون، وإذا هي قائمة تصلي فقلت ما للناس فأشارت بيدها نحو السماء وقالت سبحان الله‏.‏ فقلت آية فأشارت أى نعم‏.‏ فقمت حتى تجلاني الغشى، وجعلت أصب فوق رأسي ماء، فلما انصرف رسول الله صلى الله عليه وسلم حمد الله وأثنى عليه، ثم قال ‏\"‏ ما من شىء كنت لم أره إلا قد رأيته في مقامي هذا حتى الجنة والنار، ولقد أوحي إلى أنكم تفتنون في القبور مثل أو قريبا من فتنة الدجال  لا أدري أى ذلك قالت أسماء  يؤتى أحدكم فيقال ما علمك بهذا الرجل فأما المؤمن  أو الموقن لا أدري أى ذلك قالت أسماء  فيقول هو محمد رسول الله، جاءنا بالبينات والهدى، فأجبنا وآمنا واتبعنا، فيقال نم صالحا، فقد علمنا إن كنت لمؤمنا، وأما المنافق  أو المرتاب لا أدري أى ذلك قالت أسماء  فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     I came to `Aisha the wife of the Prophet during the solar eclipse. The people were standing and offering the prayer and she was also praying. I asked her, \"What is wrong with the people?\" She beckoned with her hand towards the sky and said, \"Subhan Allah.\" I asked her, \"Is there a sign?\" She pointed out, \"Yes.\" So I, too, stood for the prayer till I fell unconscious and later on I poured water on my head. After the prayer, Allah's Apostle praised and glorified Allah and said, \"Just now I have seen something which I never saw before at this place of mine, including Paradise and Hell. I have been inspired (and have understood) that you will be put to trials in your graves and these trials will be like the trials of Ad-Dajjal, or nearly like it (the sub narrator is not sure of what Asma' said). Angels will come to every one of you and ask, 'What do you know about this man?' A believer will reply, 'He is Muhammad, Allah's Apostle , and he came to us with self-evident truth and guidance. So we accepted his teaching, believed and followed him.' Then the angels will say to him to sleep in peace as they have come to know that he was a believer. On the other hand a hypocrite or a doubtful person will reply, 'I do not know but heard the people saying something and so I said the same.' \"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، عن ميمونة، أن رسول الله صلى الله عليه وسلم سئل عن فأرة سقطت في سمن فقال ‏\"‏ ألقوها وما حولها فاطرحوه‏.‏ وكلوا سمنكم ‏\"‏‏.‏",
      "text_en": " Narrated Maimuna:                     Allah's Apostle was asked regarding ghee (cooking butter) in which a mouse had fallen. He said, \"Take out the mouse and throw away the ghee around it and use the rest.\"",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11004",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك بن أنس، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل، وفاطمة ابنته تستره قالت فسلمت عليه فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله، قام فصلى ثماني ركعات، ملتحفا في ثوب واحد، فلما انصرف قلت يا رسول الله، زعم ابن أمي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذاك ضحى‏.‏",
      "text_en": " Narrated Abu Murra:                     (the freed slave of Um Hani) Um Hani, the daughter of Abi Talib said, \"I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath and his daughter Fatima was screening him. I greeted him. He asked, 'Who is she?' I replied, 'I am Um Hani bint Abi Talib.' He said, 'Welcome! O Um Hani.' When he finished his bath he stood up and prayed eight rak`at while wearing a single garment wrapped round his body and when he finished I said, 'O Allah's Apostle ! My brother has told me that he will kill a person whom I gave shelter and that person is so and so the son of Hubaira.' The Prophet said, 'We shelter the person whom you have sheltered.' \" Um Ham added, \"And that was before noon (Duha).",
      "chain": [
        "30103",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته، فإذا سجد غمزني، فقبضت رجلى، فإذا قام بسطتهما‏.‏ قالت والبيوت يومئذ ليس فيها مصابيح‏.‏",
      "text_en": " Narrated Abu Salama:                     `Aisha the wife of the Prophet said, \"I used to sleep in front o Allah's Apostle and my legs were opposite his Qibla and in prostration he pushed my legs and I withdrew then and when he stood, I stretched them.' `Aisha added, \"In those days the houses were without lights.\"",
      "chain": [
        "30103",
        "20001",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "433",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين، فإن لم تكونوا باكين فلا تدخلوا عليهم، لا يصيبكم ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"Do not enter (the places) of these people where Allah's punishment had fallen unless you do so weeping. If you do not weep, do not enter (the places of these people) because Allah's curse and punishment which fell upon them may fall upon you.\"",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "577",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، عن أخيه، عن سليمان، عن أبي حازم، أنه سمع سهل بن سعد، يقول كنت أتسحر في أهلي ثم يكون سرعة بي أن أدرك صلاة الفجر مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I used to take the \"Suhur\" meal with my family and hasten so as to catch the Fajr (morning prayer) with Allah's Apostle.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "667",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع الأنصاري، أن عتبان بن مالك، كان يؤم قومه وهو أعمى، وأنه قال لرسول الله صلى الله عليه وسلم يا رسول الله، إنها تكون الظلمة والسيل وأنا رجل ضرير البصر، فصل يا رسول الله في بيتي مكانا أتخذه مصلى، فجاءه رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي ‏\"‏‏.‏ فأشار إلى مكان من البيت، فصلى فيه رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mahmud bin Rabi` Al-Ansari:                     `Itban bin Malik used to lead his people (tribe) in prayer and was a blind man, he said to Allah's Apostle , \"O Allah's Apostle! At times it is dark and flood water is flowing (in the valley) and I am blind man, so please pray at a place in my house so that I can take it as a Musalla (praying place).\" So Allah's Apostle went to his house and said, \"Where do you like me to pray?\" 'Itban pointed to a place in his house and Allah's Apostle, offered the prayer there.",
      "chain": [
        "30103",
        "20001",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "716",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثنا مالك بن أنس، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين، أن رسول الله صلى الله عليه وسلم قال في مرضه ‏\"‏ مروا أبا بكر يصلي بالناس ‏\"‏‏.‏ قالت عائشة قلت إن أبا بكر إذا قام في مقامك لم يسمع الناس من البكاء، فمر عمر فليصل‏.‏ فقال ‏\"‏ مروا أبا بكر فليصل للناس ‏\"‏‏.‏ قالت عائشة لحفصة قولي له إن أبا بكر إذا قام في مقامك لم يسمع الناس من البكاء، فمر عمر فليصل للناس‏.‏ ففعلت حفصة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ مه، إنكن لأنتن صواحب يوسف، مروا أبا بكر فليصل للناس ‏\"‏‏.‏ قالت حفصة لعائشة ما كنت لأصيب منك خيرا‏.‏",
      "text_en": " Narrated `Aisha:                     the mother of the faithful believers: Allah's Apostle in his last illness said, \"Tell Abu Bakr to lead the people in the prayer.\" I said, \"If Abu Bakr stood in your place, he would not be able to make the people hear him owing to his weeping. So please order `Umar to lead the prayer.\" He said, \"Tell Abu Bakr to lead the people in the prayer.\" I said to Hafsa, \"Say to him, 'Abu Bakr is a softhearted man and if he stood in your place he would not be able to make the people hear him owing to his weeping. So order `Umar to lead the people in the prayer.' \" Hafsa did so but Allah's Apostle said, \"Keep quiet. Verily you are the companions of (Prophet) Joseph. Tell Abu Bakr to lead the people in the prayer.\" Hafsa said to me, \"I never got any good from you.\"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "741",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ هل ترون قبلتي ها هنا والله ما يخفى على ركوعكم ولا خشوعكم، وإني لأراكم وراء ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"You see me facing the Qibla; but, by Allah, nothing is hidden from me regarding your bowing and submissiveness and I see you from behind my back.\"",
      "chain": [
        "30103",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "748",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، رضى الله عنهما قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى، قالوا يا رسول الله، رأيناك تناول شيئا في مقامك، ثم رأيناك تكعكعت‏.‏ قال ‏\"‏ إني أريت الجنة، فتناولت منها عنقودا، ولو أخذته لأكلتم منه ما بقيت الدنيا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Once solar eclipse occurred during the lifetime of Allah's Apostle. He offered the eclipse prayer. His companions asked, \"O Allah's Apostle! We saw you trying to take something while standing at your place and then we saw you retreating.\" The Prophet said, \"I was shown Paradise and wanted to have a bunch of fruit from it. Had I taken it, you would have eaten from it as long as the world remains.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "798",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، قال حدثنا إسماعيل، عن خالد الحذاء، عن أبي قلابة، عن أنس  رضى الله عنه  قال كان القنوت في المغرب والفجر‏.‏",
      "text_en": " Narrated Anas:                     The qunut [supplication before going down for prostration] used to be recited in the Maghrib and the Fajr prayers.",
      "chain": [
        "30145",
        "30103",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "860",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته، فأكل منه فقال ‏\"‏ قوموا فلأصلي بكم ‏\"‏‏.‏ فقمت إلى حصير لنا قد اسود من طول ما لبس، فنضحته بماء فقام رسول الله صلى الله عليه وسلم واليتيم معي، والعجوز من ورائنا، فصلى بنا ركعتين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     My grandmother Mulaika invited Allah's Apostle for a meal which she had prepared specially for him. He ate some of it and said, \"Get up. I shall lead you in the prayer.\" I brought a mat that had become black owing to excessive use and I sprinkled water on it. Allah's Apostle stood on it and prayed two rak`at; and the orphan was with me (in the first row), and the old lady stood behind us.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "890",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا إسماعيل، قال حدثني سليمان بن بلال، قال قال هشام بن عروة أخبرني أبي، عن عائشة  رضى الله عنها  قالت دخل عبد الرحمن بن أبي بكر، ومعه سواك يستن به، فنظر إليه رسول الله صلى الله عليه وسلم فقلت له أعطني هذا السواك يا عبد الرحمن‏.‏ فأعطانيه فقصمته ثم مضغته، فأعطيته رسول الله صلى الله عليه وسلم فاستن به وهو مستسند إلى صدري‏.‏",
      "text_en": " Narrated `Aisha:                     `Abdur-Rahman bin Abi Bakr came holding a Siwak with which he was cleaning his teeth. Allah's Apostle looked at him. I requested `Abdur-Rahman to give the Siwak to me and after he gave it to me I divided it, chewed it and gave it to Allah's Apostle. Then he cleaned his teeth with it and (at that time) he was resting against my chest.",
      "chain": [
        "30103",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "999",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، أنه قال كنت أسير مع عبد الله بن عمر بطريق مكة فقال سعيد فلما خشيت الصبح نزلت فأوترت، ثم لحقته فقال عبد الله بن عمر أين كنت فقلت خشيت الصبح، فنزلت فأوترت‏.‏ فقال عبد الله أليس لك في رسول الله صلى الله عليه وسلم أسوة حسنة فقلت بلى والله‏.‏ قال فإن رسول الله صلى الله عليه وسلم كان يوتر على البعير‏.‏",
      "text_en": " Narrated Sa`id bin Yasar:                     I was going to Mecca in the company of `Abdullah bin `Umar and when I apprehended the approaching dawn, I dismounted and offered the witr prayer and then joined him. `Abdullah bin `Umar said, \"Where have you been?\" I replied, \"I apprehended the approaching dawn so I dismounted and prayed the witr prayer.\" `Abdullah said, \"Isn't it sufficient for you to follow the good example of Allah's Apostle?\" I replied, \"Yes, by Allah.\" He said, \"Allah's Apostle used to pray witr on the back of the camel (while on a journey).\"",
      "chain": [
        "30103",
        "20001",
        "20186",
        "11170"
      ]
    },
    {
      "hadith_no": "1017",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن شريك بن عبد الله بن أبي نمر، عن أنس بن مالك، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، هلكت المواشي وانقطعت السبل، فادع الله، فدعا رسول الله صلى الله عليه وسلم فمطروا من جمعة إلى جمعة، فجاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، تهدمت البيوت وتقطعت السبل وهلكت المواشي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم على رءوس الجبال والآكام وبطون الأودية ومنابت الشجر ‏\"‏‏.‏ فانجابت عن المدينة انجياب الثوب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! Livestock are destroyed and the roads are cut off. So please invoke Allah.\" So Allah's Apostle prayed and it rained from that Friday to the next Friday. Then he came to Allah's Apostle I and said, \"O Allah's Apostle! Houses have collapsed, roads are cut off and the livestock are destroyed.\" So Allah's Apostle (p.b.u.h) prayed, \"O Allah! (Let it rain) on the tops of mountains, on the plateaus, in the valleys and over the places where trees grow.\" So the clouds cleared away from Medina as clothes are taken off.",
      "chain": [
        "30103",
        "20001",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن صالح بن كيسان، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن زيد بن خالد الجهني، أنه قال صلى لنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية على إثر سماء كانت من الليلة، فلما انصرف النبي صلى الله عليه وسلم أقبل على الناس فقال ‏\"‏ هل تدرون ماذا قال ربكم ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ أصبح من عبادي مؤمن بي وكافر، فأما من قال مطرنا بفضل الله ورحمته‏.‏ فذلك مؤمن بي كافر بالكوكب، وأما من قال بنوء كذا وكذا‏.‏ فذلك كافر بي مؤمن بالكوكب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     Allah's Apostle led the morning prayer in Al-Hudaibiya and it had rained the previous night. When the Prophet (p.b.u.h) had finished the prayer he faced the people and said, \"Do you know what your Lord has said?\" They replied, \"Allah and His Apostle know better.\" (The Prophet said), \"Allah says, 'In this morning some of My worshipers remained as true believers and some became non-believers; he who said that it had rained with the blessing and mercy of Allah is the one who believes in Me and does not believe in star, but he who said it had rained because of such and such (star) is a disbeliever in Me and is a believer in star.' \"",
      "chain": [
        "30103",
        "20001",
        "11176",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "1056",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها أن يهودية، جاءت تسألها فقالت أعاذك الله من عذاب القبر‏.‏ فسألت عائشة رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فكسفت الشمس فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام فصلى، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد سجودا طويلا ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم قام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد وهو دون السجود الأول، ثم انصرف فقال رسول الله صلى الله عليه وسلم ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     A Jewess came to `Aisha to ask her about something and then she said, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha asked Allah's Apostle, \"Would the people be punished in their graves?\" Allah's Apostle asked Allah's refuge from the punishment of the grave (indicating an affirmative reply). Then one day Allah's Apostle rode (to leave for some place) but the sun eclipsed. He returned on the forenoon and passed through the rear of the dwellings (of his wives) and stood up and started offering the (eclipse) prayer and the people stood behind him. He stood for a long period and then performed a long bowing and then stood straight for a long period which was shorter than that of the first standing, then he performed a prolonged bowing which was shorter than the first bowing, then he raised his head and prostrated for a long time and then stood up (for the second rak`a) for a long while, but the standing was shorter than the standing of the first rak`a. Then he performed a prolonged bowing which was shorter than that of the first one. He then stood up for a long time but shorter than the first, then again performed a long bowing which was shorter than the first and then prostrated for a shorter while than that of the first prostration. Then he finished the prayer and delivered the sermon and) said what Allah wished; and ordered the people to seek refuge with Allah from the punishment of the grave.",
      "chain": [
        "30103",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1236",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أنها قالت صلى رسول الله صلى الله عليه وسلم في بيته وهو شاك جالسا، وصلى وراءه قوم قياما فأشار إليهم أن اجلسوا فلما انصرف قال ‏\"‏ إنما جعل الإمام ليؤتم به، فإذا ركع فاركعوا وإذا رفع فارفعوا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha the wife of the Prophet:                     Allah's Apostle during his illness prayed in his house sitting, whereas some people followed him standing, but the Prophet beckoned them to sit down. On completion of the prayer he said, \"The Imam is to be followed. So, bow when he bows, and raise your head when he raises his head.\" (See Hadith No. 657 Vol 1 for taking the verdict).",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1245",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نعى النجاشي في اليوم الذي مات فيه، خرج إلى المصلى، فصف بهم وكبر أربعا‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle informed (the people) about the death of An-Najashi on the very day he died. He went towards the Musalla (praying place) and the people stood behind him in rows. He said four Takbirs (i.e. offered the Funeral prayer).",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1253",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أيوب السختياني، عن محمد بن سيرين، عن أم عطية الأنصارية  رضى الله عنها  قالت دخل علينا رسول الله صلى الله عليه وسلم حين توفيت ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه فأعطانا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ تعني إزاره‏.‏",
      "text_en": " Narrated Um 'Atiyya al-Ansariya:                     Allah's Apostle came to us when his daughter died and said, \"Wash her thrice or five times or more, if you see it necessary, with water and Sidr and then apply camphor or some camphor at the end; and when you finish, notify me.\" So when we finished it, we informed him and he gave us his waist-sheet and told us to shroud the dead body in it.",
      "chain": [
        "30103",
        "20001",
        "11015",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "1273",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم كفن في ثلاثة أثواب بيض سحولية، ليس فيها قميص ولا عمامة‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle was shrouded in three pieces of cloth which were made of white Suhul and neither a shirt nor a turban were used.",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1281",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أخبرته قالت، دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏   ثم دخلت على زينب بنت جحش حين توفي أخوها، فدعت بطيب فمست ثم قالت ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for any dead person for more than three days except for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to Zainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am not in need of scent but I heard Allah's Apostle saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, (for whom she should mourn) for four months and ten days.' \"",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "1341",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت لما اشتكى النبي صلى الله عليه وسلم ذكرت بعض نسائه كنيسة رأينها بأرض الحبشة، يقال لها مارية، وكانت أم سلمة وأم حبيبة  رضى الله عنهما  أتتا أرض الحبشة، فذكرتا من حسنها وتصاوير فيها، فرفع رأسه فقال ‏\"‏ أولئك إذا مات منهم الرجل الصالح بنوا على قبره مسجدا، ثم صوروا فيه تلك الصورة، أولئك شرار الخلق عند الله ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet became ill, some of his wives talked about a church which they had seen in Ethiopia and it was called Mariya. Um Salma and Um Habiba had been to Ethiopia, and both of them narrated its (the Church's) beauty and the pictures it contained. The Prophet raised his head and said, \"Those are the people who, whenever a pious man dies amongst them, make a place of worship at his grave and then they make those pictures in it. Those are the worst creatures in the Sight of Allah.\"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1379",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أحدكم إذا مات عرض عليه مقعده بالغداة والعشي، إن كان من أهل الجنة فمن أهل الجنة، وإن كان من أهل النار فمن أهل النار، فيقال هذا مقعدك حتى يبعثك الله يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"When anyone of you dies, he is shown his place both in the morning and in the evening. If he is one of the people of Paradise; he is shown his place in it, and if he is from the people of the Hell-Fire; he is shown his place there-in. Then it is said to him, 'This is your place till Allah resurrect you on the Day of Resurrection.\"",
      "chain": [
        "30103",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1389",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني سليمان، عن هشام، وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليتعذر في مرضه ‏\"‏ أين أنا اليوم أين أنا غدا ‏\"‏ استبطاء ليوم عائشة، فلما كان يومي قبضه الله بين سحري ونحري، ودفن في بيتي‏.‏",
      "text_en": " Narrated `Aisha:                     During his sickness, Allah's Apostle was asking repeatedly, \"Where am I today? Where will I be tomorrow?\" And I was waiting for the day of my turn (impatiently). Then, when my turn came, Allah took his soul away (in my lap) between my chest and arms and he was buried in my house.",
      "chain": [
        "30103",
        "20160",
        "11065",
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1464",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن معاوية بن أبي مزرد، عن أبي الحباب، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من يوم يصبح العباد فيه إلا ملكان ينزلان فيقول أحدهما اللهم أعط منفقا خلفا، ويقول الآخر اللهم أعط ممسكا تلفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Every day two angels come down from Heaven and one of them says, 'O Allah! Compensate every person who spends in Your Cause,' and the other (angel) says, 'O Allah! Destroy every miser.' \"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11541",
        "13"
      ]
    },
    {
      "hadith_no": "1503",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس المسكين الذي يطوف على الناس ترده اللقمة واللقمتان والتمرة والتمرتان، ولكن المسكين الذي لا يجد غنى يغنيه، ولا يفطن به فيتصدق عليه، ولا يقوم فيسأل الناس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The poor person is not the one who goes round the people and ask them for a mouthful or two (of meals) or a date or two but the poor is that who has not enough (money) to satisfy his needs and whose condition is not known to others, that others may give him something in charity, and who does not beg of people.\"",
      "chain": [
        "30103",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1591",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك،‏.‏ وحدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر، عن حفصة  رضى الله عنهم  زوج النبي صلى الله عليه وسلم أنها قالت يا رسول الله، ما شأن الناس حلوا بعمرة ولم تحلل أنت من عمرتك قال ‏\"‏ إني لبدت رأسي، وقلدت هديي فلا أحل حتى أنحر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Hafsa the wife of the Prophet said, \"O Allah's Apostle! Why have the people finished their Ihram after performing `Umra but you have not finished your Ihram after performing `Umra?\" He replied, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram till I have slaughtered (my Hadi). \"",
      "chain": [
        "30103",
        "30355",
        "20001",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت، وهو يقرأ ‏{‏والطور * وكتاب مسطور‏}‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet was praying beside the Ka`ba and reciting Surat-at-Tur.",
      "chain": [
        "30103",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1779",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن يونس بن يزيد، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر  رضى الله عنهما  كان يرمي الجمرة الدنيا بسبع حصيات، ثم يكبر على إثر كل حصاة، ثم يتقدم فيسهل، فيقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة الوسطى كذلك، فيأخذ ذات الشمال فيسهل، ويقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة ذات العقبة من بطن الوادي، ولا يقف عندها، ويقول هكذا رأيت رسول الله صلى الله عليه وسلم يفعل‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     `Abdullah bin `Umar used to do Rami of the Jamrat-ud-Dunya with seven small pebbles and used to recite Takbir on throwing each stone. He, then, would proceed further till he reached the level ground, where he would stay for a long time, facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Wusta similarly and would go to the left towards the level ground, where he would stand for a long time facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it. Ibn `Umar used to say, \"I saw Allah's Apostle doing like that.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1844",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن نافع، أن عبد الله بن عمر  رضى الله عنهما  قال حين خرج إلى مكة معتمرا في الفتنة إن صددت عن البيت صنعنا كما صنعنا مع رسول الله صلى الله عليه وسلم فأهل بعمرة، من أجل أن النبي صلى الله عليه وسلم كان أهل بعمرة عام الحديبية، ثم إن عبد الله بن عمر نظر في أمره فقال ما أمرهما إلا واحد‏.‏ فالتفت إلى أصحابه فقال ما أمرهما إلا واحد، أشهدكم أني قد أوجبت الحج مع العمرة، ثم طاف لهما طوافا واحدا، ورأى أن ذلك مجزيا عنه، وأهدى‏.‏",
      "text_en": " Narrated Nafi`:                     When `Abdullah bin `Umar set out for Mecca with the intentions performing `Umra in the period of afflictions, he said, \"If I should be prevented from reaching the Ka`ba, then I would do the same as we did while in the company of Allah's Apostle .\" So, he assumed the Ihram for `Umra since the Prophet had assumed the Ihram for `Umra in the year of Al-Hudaibiya. Then `Abdullah bin `Umar thought about it and said, \"The conditions for both Hajj and `Umra are similar.\" He then turned towards his companions and said, \"The conditions of both Hajj and `Umra are similar and I make you witnesses that I have made the performance of Hajj obligatory for myself along with `Umra.\" He then performed one Tawaf (between As-Safa and Al-Marwa) for both of them (i.e. Hajj and (`Umra) and considered that to be sufficient for him and offered a Hadi.",
      "chain": [
        "30103",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1862",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال للوزغ ‏\"‏ فويسق ‏\"‏‏.‏ ولم أسمعه أمر بقتله‏.‏",
      "text_en": " Narrated `Aisha the wife of the Prophet:                     Allah's Apostle called the salamander a bad animal, but I did not hear him ordering it to be killed.\"",
      "chain": [
        "30103",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1902",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن عبيد الله، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ حرم ما بين لابتى المدينة على لساني ‏\"‏‏.‏ قال وأتى النبي صلى الله عليه وسلم بني حارثة فقال ‏\"‏ أراكم يا بني حارثة قد خرجتم من الحرم ‏\"‏‏.‏ ثم التفت، فقال ‏\"‏ بل أنتم فيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet went to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" but looking around, he added, \"No, you are inside the sanctuary.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1913",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن نعيم بن عبد الله المجمر، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم‏.‏ ‏\"‏ على أنقاب المدينة ملائكة، لا يدخلها الطاعون ولا الدجال ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There are angels guarding the entrances (or roads) of Medina, neither plague nor Ad-Dajjal will be able to enter it.\"",
      "chain": [
        "30103",
        "20001",
        "11225",
        "13"
      ]
    },
    {
      "hadith_no": "1931",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن سمى، مولى أبي بكر بن عبد الرحمن بن الحارث بن هشام بن المغيرة أنه سمع أبا بكر بن عبد الرحمن، كنت أنا وأبي،، فذهبت معه، حتى دخلنا على عائشة  رضى الله عنها  قالت أشهد على رسول الله صلى الله عليه وسلم إن كان ليصبح جنبا من جماع غير احتلام، ثم يصومه‏.‏ ثم دخلنا على أم سلمة، فقالت مثل ذلك.",
      "text_en": " Narrated Abu Bakr bin `Abdur-Rahman:                     My father and I went to `Aisha and she said, \"I testify that Allah's Apostle at times used to get up in the morning in a state of Janaba from sexual intercourse, not from a wet dream and then he would fast that day.\" Then he went to Um Salama and she also narrated a similar thing.",
      "chain": [
        "30103",
        "20001"
      ]
    },
    {
      "hadith_no": "2011",
      "source": " Sahih Bukhari ",
      "chapter": "Praying at Night in Ramadaan (Taraweeh) - كتاب صلاة التراويح",
      "chapter_no": "31",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، رضى الله عنها زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم صلى وذلك في رمضان‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Allah's Apostle used to pray (at night) in Ramadan.",
      "chain": [
        "30103",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2013",
      "source": " Sahih Bukhari ",
      "chapter": "Praying at Night in Ramadaan (Taraweeh) - كتاب صلاة التراويح",
      "chapter_no": "31",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن سعيد المقبري، عن أبي سلمة بن عبد الرحمن، أنه سأل عائشة  رضى الله عنها  كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان فقالت ما كان يزيد في رمضان، ولا في غيرها على إحدى عشرة ركعة، يصلي أربعا فلا تسل عن حسنهن وطولهن، ثم يصلي أربعا فلا تسل عن حسنهن وطولهن، ثم يصلي ثلاثا‏.‏ فقلت يا رسول الله، أتنام قبل أن توتر قال ‏\"‏ يا عائشة إن عينى تنامان ولا ينام قلبي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama bin `Abdur Rahman:                     that he asked `Aisha \"How was the prayer of Allah's Apostle in Ramadan?\" She replied, \"He did not pray more than eleven rak`at in Ramadan or in any other month. He used to pray four rak`at ---- let alone their beauty and length----and then he would pray four ----let alone their beauty and length ---- and then he would pray three rak`at (witr).\" She added, \"I asked, 'O Allah's Apostle! Do you sleep before praying the witr?' He replied, 'O `Aisha! My eyes sleep but my heart does not sleep.\"",
      "chain": [
        "30103",
        "20001",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2025",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني ابن وهب، عن يونس، أن نافعا، أخبره عن عبد الله بن عمر  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يعتكف العشر الأواخر من رمضان‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle used to practice I`tikaf in the last ten days of the month of Ramadan.",
      "chain": [
        "30103",
        "20029",
        "20475",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2027",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يعتكف في العشر الأوسط من رمضان، فاعتكف عاما حتى إذا كان ليلة إحدى وعشرين، وهي الليلة التي يخرج من صبيحتها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر، وقد أريت هذه الليلة ثم أنسيتها، وقد رأيتني أسجد في ماء وطين من صبيحتها، فالتمسوها في العشر الأواخر، والتمسوها في كل وتر ‏\"‏‏.‏ فمطرت السماء تلك الليلة، وكان المسجد على عريش فوكف المسجد، فبصرت عيناى رسول الله صلى الله عليه وسلم على جبهته أثر الماء والطين، من صبح إحدى وعشرين‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in I`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his I`tikaf. The Prophet said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in the last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque dribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and water on the forehead of the Prophet (i.e. in the morning of the twenty-first).",
      "chain": [
        "30103",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    }
  ],
  "total_hadiths": 237
}