{
  "id": "30109",
  "name": "Muhammad bin Gharir محمد بن غرير",
  "full_name": "Muhammad bin Gharir محمد بن غرير",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Samarqand",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      " Samarqand"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "B.Zuhrah",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30111",
      "name": "Matraf bin 'Abdullah مطرف بن عبد الله بن مطرف",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "74",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن غرير الزهري، قال حدثنا يعقوب بن إبراهيم، قال حدثني أبي، عن صالح، عن ابن شهاب، حدث أن عبيد الله بن عبد الله أخبره عن ابن عباس، أنه تمارى هو والحر بن قيس بن حصن الفزاري في صاحب موسى قال ابن عباس هو خضر‏.‏ فمر بهما أبى بن كعب، فدعاه ابن عباس فقال إني تماريت أنا وصاحبي، هذا في صاحب موسى الذي سأل موسى السبيل إلى لقيه، هل سمعت النبي صلى الله عليه وسلم يذكر شأنه قال نعم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بينما موسى في ملإ من بني إسرائيل، جاءه رجل فقال هل تعلم أحدا أعلم منك قال موسى لا‏.‏ فأوحى الله إلى موسى بلى، عبدنا خضر، فسأل موسى السبيل إليه، فجعل الله له الحوت آية، وقيل له إذا فقدت الحوت فارجع، فإنك ستلقاه، وكان يتبع أثر الحوت في البحر، فقال لموسى فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره‏.‏ قال ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، فوجدا خضرا‏.‏ فكان من شأنهما الذي قص الله  عز وجل  في كتابه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of (the Prophet) Moses. Ibn `Abbas said that he was Al Khadir. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him, saying \"My friend (Hur) and I have differed regarding Moses' companion, whom Moses asked the way to meet. Have you heard the Prophet mentioning something about him? He said, \"Yes. I heard Allah's Apostle saying, \"While Moses was sitting in the company of some Israelites, a man came and asked him. \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: 'Yes, Our slave Khadir (is more learned than you.)' Moses asked (Allah) how to meet him (Khadir). So Allah made the fish as a sign for him and he was told that when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said to him: Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said: 'That is what we have been seeking? (18.64) So they went back retracing their footsteps, and found Khadir. (And) what happened further to them is narrated in the Holy Qur'an by Allah. (18.54 up to 18.82)",
      "chain": [
        "30109",
        "20184",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1502",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن غرير الزهري، حدثنا يعقوب بن إبراهيم، عن أبيه، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني عامر بن سعد، عن أبيه، قال أعطى رسول الله صلى الله عليه وسلم رهطا وأنا جالس فيهم قال فترك رسول الله صلى الله عليه وسلم منهم رجلا لم يعطه، وهو أعجبهم إلى، فقمت إلى رسول الله صلى الله عليه وسلم فساررته فقلت ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله‏.‏ ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏‏.‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما  يعني فقال  إني لأعطي الرجل وغيره أحب إلى منه، خشية أن يكب في النار على وجهه ‏\"‏‏.‏ وعن أبيه عن صالح عن إسماعيل بن محمد أنه قال سمعت أبي يحدث هذا فقال في حديثه فضرب رسول الله صلى الله عليه وسلم بيده فجمع بين عنقي وكتفي ثم قال ‏\"‏ أقبل أى سعد إني لأعطي الرجل ‏\"‏‏.‏ قال أبو عبد الله ‏{‏فكبكبوا‏}‏ قلبوا ‏{‏مكبا‏}‏ أكب الرجل إذا كان فعله غير واقع على أحد، فإذا وقع الفعل قلت كبه الله لوجهه، وكببته أنا‏.‏",
      "text_en": " Narrated Sa`d (bin Abi Waqqas):                     Allah's Apostle distributed something (from the resources of Zakat) amongst a group of people while I was sitting amongst them, but he left a man whom I considered the best of the lot. So, I went up to Allah's Apostle and asked him secretly, \"Why have you left that person? By Allah! I consider him a believer.\" The Prophet said, \"Or merely a Muslim (Who surrender to Allah).\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Apostle! Why have you left that person? By Allah! I consider him a believer. \" The Prophet said, \"Or merely a Muslim.\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Apostle! Why have you left that person? By Allah! I consider him a believer.\" The Prophet said, \"Or merely a Muslim.\" Then Allah's Apostle (p.b.u.h) said, \"I give to a person while another is dearer to me, for fear that he may be thrown in the Hell-fire on his face (by reneging from Islam).\"",
      "chain": [
        "30109",
        "20184",
        "20150",
        "11176",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3553",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن غرير الزهري، حدثنا يعقوب بن إبراهيم، عن أبيه، عن صالح، حدثنا نافع، أن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم قال على المنبر ‏\"‏ غفار غفر الله لها، وأسلم سالمها الله، وعصية عصت الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While Allah's Apostle was on the pulpit, he said, \"May Allah give the tribe of Ghifar! And may Allah save the tribe of Aslam! The tribe of 'Usaiya have disobeyed Allah and His Apostle.\"",
      "chain": [
        "30109",
        "20184",
        "20150",
        "11176",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 3
}