{
  "id": "30105",
  "name": "'Abdul 'Aziz bin 'Abdullah al-Uvaisi عبد العزيز بن عبد الله بن يحيى الأويسي",
  "full_name": "'Abdul 'Aziz bin 'Abdullah al-Uvaisi عبد العزيز بن عبد الله بن يحيى  الأويسي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  كن  ق  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "B.'Amir",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20507",
      "name": "'Abdullah bin 'Umar bin Hafs bin 'Asim عبد الله بن عمر بن حفص بن عاصم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20441",
      "name": "'Abdur Rahman bin Abi al-Mawal عبد الرحمن بن أبي الموال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20435",
      "name": "'Abdullah bin Yahya bin Abi Kathir عبد الله بن يحيى بن أبي كثير اليمامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "31075",
      "name": "'Abdullah bin Abi Ziyad عبد الله بن أبي زياد",
      "grade": "3rd Century AH"
    },
    {
      "id": "38556",
      "name": "Muhammad bin 'Ali in Maymun محمد بن علي بن ميمون",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30498",
      "name": "Ibrahim bin Sa'id al-Juhari إبراهيم بن سعيد الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36024",
      "name": "al-Rabi' bin Sulaiman bin Da'ud الربيع بن سليمان بن داود",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "99",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان، عن عمرو بن أبي عمرو، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، أنه قال قيل يا رسول الله، من أسعد الناس بشفاعتك يوم القيامة قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد ظننت يا أبا هريرة أن لا يسألني عن هذا الحديث أحد أول منك، لما رأيت من حرصك على الحديث، أسعد الناس بشفاعتي يوم القيامة من قال لا إله إلا الله، خالصا من قلبه أو نفسه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I said: \"O Allah's Apostle! Who will be the luckiest person, who will gain your intercession on the Day of Resurrection?\" Allah's Apostle said: O Abu Huraira! \"I have thought that none will ask me about it before you as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said sincerely from the bottom of his heart \"None has the right to be worshipped but Allah.\"",
      "chain": [
        "30105",
        "20160",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك، عن ابن شهاب، عن الأعرج، عن أبي هريرة، قال إن الناس يقولون أكثر أبو هريرة، ولولا آيتان في كتاب الله ما حدثت حديثا، ثم يتلو ‏{‏إن الذين يكتمون ما أنزلنا من البينات‏}‏ إلى قوله ‏{‏الرحيم‏}‏ إن إخواننا من المهاجرين كان يشغلهم الصفق بالأسواق، وإن إخواننا من الأنصار كان يشغلهم العمل في أموالهم، وإن أبا هريرة كان يلزم رسول الله صلى الله عليه وسلم بشبع بطنه ويحضر ما لا يحضرون، ويحفظ ما لا يحفظون‏.‏",
      "text_en": " Narrated Abu Huraira:                     People say that I have narrated many Hadiths (The Prophet's narration). Had it not been for two verses in the Qur'an, I would not have narrated a single Hadith, and the verses are: \"Verily those who conceal the clear sign and the guidance which We have sent down . . . (up to) Most Merciful.\" (2:159-160). And no doubt our Muhajir (emigrant) brothers used to be busy in the market with their business (bargains) and our Ansari brothers used to be busy with their property (agriculture). But I (Abu Huraira) used to stick to Allah's Apostle contented with what will fill my stomach and I used to attend that which they used not to attend and I used to memorize that which they used not to memorize.",
      "chain": [
        "30105",
        "20001",
        "11013",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "159",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، قال حدثني إبراهيم بن سعد، عن ابن شهاب، أن عطاء بن يزيد، أخبره أن حمران مولى عثمان أخبره أنه، رأى عثمان بن عفان دعا بإناء، فأفرغ على كفيه ثلاث مرار فغسلهما، ثم أدخل يمينه في الإناء فمضمض، واستنشق، ثم غسل وجهه ثلاثا، ويديه إلى المرفقين ثلاث مرار، ثم مسح برأسه، ثم غسل رجليه ثلاث مرار إلى الكعبين، ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا، ثم صلى ركعتين، لا يحدث فيهما نفسه، غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Humran:                          (the slave of 'Uthman) I saw 'Uthman bin 'Affan asking for a tumbler      of water (and when it was brought) he poured water over his hands and      washed them thrice and then put his right hand in the water container      and rinsed his mouth, washed his nose by putting water in it and then      blowing it out. then he washed his face and forearms up to the      elbows thrice, passed his wet hands over his head and washed his feet      up to the ankles thrice. Then he said, \"Allah's Apostle said 'If      anyone performs ablution like that of mine and offers a two-rak'at      prayer during which he does not think of anything else (not related to     the present prayer) then his past sins will be forgiven.' \"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11206",
        "11421"
      ]
    },
    {
      "hadith_no": "370",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني ابن أبي الموالي، عن محمد بن المنكدر، قال دخلت على جابر بن عبد الله وهو يصلي في ثوب ملتحفا به ورداؤه موضوع، فلما انصرف قلنا يا أبا عبد الله تصلي ورداؤك موضوع قال نعم، أحببت أن يراني الجهال مثلكم، رأيت النبي صلى الله عليه وسلم يصلي هكذا‏.‏",
      "text_en": " Narrated Muhammad bin Al-Munkadir:                     I went to Jabir bin `Abdullah and he was praying wrapped in a garment and his Rida was Lying beside him. When he finished the prayers, I said \"O `Abdullah! You pray (in a single garment) while your Rida' is lying beside you.\" He replied, \"Yes, I did it intentionally so that the ignorant ones like you might see me. I saw the Prophet praying like this. \"",
      "chain": [
        "30105",
        "20441",
        "11048"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، قالت لقد رأيت رسول الله صلى الله عليه وسلم يوما على باب حجرتي، والحبشة يلعبون في المسجد ورسول الله صلى الله عليه وسلم يسترني بردائه، أنظر إلى لعبهم‏.‏ زاد إبراهيم بن المنذر حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، عن عائشة، قالت رأيت النبي صلى الله عليه وسلم والحبشة يلعبون بحرابهم‏.‏",
      "text_en": " Narrated `Aisha:                     Once I saw Allah's Apostle at the door of my house while some Ethiopians were playing in the mosque (displaying their skill with spears). Allah's Apostle was screening me with his Rida' so as to enable me to see their display. (`Urwa said that `Aisha said, \"I saw the Prophet and the Ethiopians were playing with their spears.\")",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أنه أخبره أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما بقاؤكم فيما سلف قبلكم من الأمم كما بين صلاة العصر إلى غروب الشمس، أوتي أهل التوراة التوراة فعملوا حتى إذا انتصف النهار عجزوا، فأعطوا قيراطا قيراطا، ثم أوتي أهل الإنجيل الإنجيل فعملوا إلى صلاة العصر، ثم عجزوا، فأعطوا قيراطا قيراطا، ثم أوتينا القرآن فعملنا إلى غروب الشمس، فأعطينا قيراطين قيراطين، فقال أهل الكتابين أى ربنا أعطيت هؤلاء قيراطين قيراطين، وأعطيتنا قيراطا قيراطا، ونحن كنا أكثر عملا، قال قال الله عز وجل هل ظلمتكم من أجركم من شىء قالوا لا، قال فهو فضلي أوتيه من أشاء ‏\"‏‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     My father said, \"I heard Allah's Apostle saying, 'The period of your stay as compared to the previous nations is like the period equal to the time between the `Asr prayer and sunset. The people of the Torah were given the Torah and they acted (upon it) till midday then they were exhausted and were given one Qirat (of gold) each. And then the people of the Gospel were given the Gospel and they acted (upon it) till the `Asr prayer then they were exhausted and were! given one Qirat each. And then we were given the Qur'an and we acted (upon it) till sunset and we were given two Qirats each. On that the people of both the scriptures said, 'O our Lord! You have given them two Qirats and given us one Qirat, though we have worked more than they.' Allah said, 'Have I usurped some of your right?' They said, 'No.' Allah said: \"That is my blessing I bestow upon whomsoever I wish.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "586",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عطاء بن يزيد الجندعي، أنه سمع أبا سعيد الخدري، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا صلاة بعد الصبح حتى ترتفع الشمس، ولا صلاة بعد العصر حتى تغيب الشمس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"There is no prayer after the morning prayer till the sun rises, and there is no prayer after the `Asr prayer till the sun sets.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "639",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خرج وقد أقيمت الصلاة وعدلت الصفوف، حتى إذا قام في مصلاه انتظرنا أن يكبر انصرف قال ‏\"‏ على مكانكم ‏\"‏‏.‏ فمكثنا على هيئتنا حتى خرج إلينا ينطف رأسه ماء وقد اغتسل‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle went out (of the mosque) when the Iqama had been pronounced and the rows straightened. The Prophet stood at his Musalla (praying place) and we waited for the Prophet to begin the prayer with Takbir. He left and asked us to remain in our places. We kept on standing till the Prophet returned and the water was trickling from his head for he had taken a bath (of Janaba).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "663",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي صلى الله عليه وسلم برجل‏.‏ قال وحدثني عبد الرحمن، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني سعد بن إبراهيم، قال سمعت حفص بن عاصم، قال سمعت رجلا، من الأزد يقال له مالك ابن بحينة أن رسول الله صلى الله عليه وسلم رأى رجلا وقد أقيمت الصلاة يصلي ركعتين، فلما انصرف رسول الله صلى الله عليه وسلم لاث به الناس، وقال له رسول الله صلى الله عليه وسلم ‏\"‏ الصبح أربعا، الصبح أربعا ‏\"‏‏.‏ تابعه غندر ومعاذ عن شعبة في مالك‏.‏ وقال ابن إسحاق عن سعد عن حفص عن عبد الله ابن بحينة‏.‏ وقال حماد أخبرنا سعد عن حفص عن مالك‏.‏",
      "text_en": " Narrated Malik Ibn Buhaina:                     Allah's Apostle passed by a man praying two rak`at after the Iqama (had been pronounced). When Allah's Apostle completed the prayer, the people gathered around him (the Prophet) or that man and Allah's Apostle said to him (protesting), Are there four rak`at in Fajr prayer? Are there four rak`at in Fajr prayer?\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "hadith_no": "675",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم، عن صالح، عن ابن شهاب، قال أخبرني جعفر بن عمرو بن أمية، أن أباه، قال رأيت رسول الله صلى الله عليه وسلم يأكل ذراعا يحتز منها، فدعي إلى الصلاة فقام فطرح السكين، فصلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya:                     My father said, \"I saw Allah's Apostle eating a piece of meat from the shoulder of a sheep and he was called for the prayer. He stood up, put down the knife and prayed but did not perform ablution.''",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11501"
      ]
    },
    {
      "hadith_no": "1030",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "وقال الأويسي حدثني محمد بن جعفر، عن يحيى بن سعيد، وشريك، سمعا أنسا، عن النبي صلى الله عليه وسلم أنه رفع يديه حتى رأيت بياض إبطيه‏.‏",
      "text_en": " The narrator Anas added that the Prophet () raised his hands (during the invocation) to such an extent that the whiteness of his armpits was visible.",
      "chain": [
        "30105",
        "20173",
        "11062",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1141",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن حميد، أنه سمع أنسا  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم يفطر من الشهر حتى نظن أن لا يصوم منه، ويصوم حتى نظن أن لا يفطر منه شيئا، وكان لا تشاء أن تراه من الليل مصليا إلا رأيته ولا نائما إلا رأيته‏.‏ تابعه سليمان وأبو خالد الأحمر عن حميد‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Sometimes Allah's Apostle would not fast (for so many days) that we thought that he would not fast that month and he sometimes used to fast (for so many days) that we thought he would not leave fasting throughout that month and (as regards his prayer and sleep at night), if you wanted to see him praying at night, you could see him praying and if you wanted to see him sleeping, you could see him sleeping.",
      "chain": [
        "30105",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1314",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد المقبري، عن أبيه، أنه سمع أبا سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وضعت الجنازة واحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني‏.‏ وإن كانت غير صالحة قالت يا ويلها أين يذهبون بها يسمع صوتها كل شىء إلا الإنسان، ولو سمعه صعق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, When the funeral is ready and the men carry it on their shoulders, if the deceased was righteous it will say, 'Present me (hurriedly),' and if he was not righteous, it will say, 'Woe to it (me)! Where are they taking it (me)?' Its voice is heard by everything except man and if he heard it he would fall unconscious.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "38"
      ]
    },
    {
      "hadith_no": "1544",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  قال سئل النبي صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ إيمان بالله ورسوله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ جهاد في سبيل الله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet was asked, \"Which is the best deed?\" He said, \"To believe in Allah and His Apostle.\" He was then asked, \"Which is the next (in goodness)?\" He said, \"To participate in Jihad in Allah's Cause.\" He was then asked, \"Which is the next?\" He said, \"To perform Hajj-Mabrur. \"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1912",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح الدجال، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate guarding them.\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "3229"
      ]
    },
    {
      "hadith_no": "1911",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن حميد، عن أنس  رضى الله عنه  قال آلى رسول الله صلى الله عليه وسلم من نسائه، وكانت انفكت رجله، فأقام في مشربة تسعا وعشرين ليلة، ثم نزل فقالوا يا رسول الله آليت شهرا‏.‏ فقال ‏\"‏ إن الشهر يكون تسعا وعشرين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle vowed to keep aloof from his wives for one month, and he had dislocation of his leg. So, he stayed in a Mashruba for 29 nights and then came down. Some people said, \"O Allah's Apostle! You vowed to stay aloof for one month,\" He replied, \"The month is of 29 days.\"",
      "chain": [
        "30105",
        "20160",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1972",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن حميد، أنه سمع أنسا  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم يفطر من الشهر، حتى نظن أن لا يصوم منه، ويصوم حتى نظن أن لا يفطر منه شيئا، وكان لا تشاء تراه من الليل مصليا إلا رأيته، ولا نائما إلا رأيته‏.‏ وقال سليمان عن حميد أنه سأل أنسا في الصوم‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle used to leave fasting in a certain month till we thought that he would not fast in that month, and he used to fast in another month till we thought he would not stop fasting at all in that month. And if one wanted to see him praying at night, one could see him (in that condition), and if one wanted to see him sleeping at night, one could see him (in that condition) too.",
      "chain": [
        "30105",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2048",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف  رضى الله عنه  لما قدمنا المدينة آخى رسول الله صلى الله عليه وسلم بيني وبين سعد بن الربيع فقال سعد بن الربيع إني أكثر الأنصار مالا، فأقسم لك نصف مالي، وانظر أى زوجتى هويت نزلت لك عنها، فإذا حلت تزوجتها‏.‏ قال فقال عبد الرحمن لا حاجة لي في ذلك، هل من سوق فيه تجارة قال سوق قينقاع‏.‏ قال فغدا إليه عبد الرحمن، فأتى بأقط وسمن  قال  ثم تابع الغدو، فما لبث أن جاء عبد الرحمن عليه أثر صفرة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ تزوجت ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ومن ‏\"‏‏.‏ قال امرأة من الأنصار‏.‏ قال ‏\"‏ كم سقت ‏\"‏‏.‏ قال زنة نواة من ذهب أو نواة من ذهب‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim bin Sa`d from his father from his grandfather:                     `Abdur Rahman bin `Auf said, \"When we came to Medina as emigrants, Allah's Apostle established a bond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` said (to me), 'I am the richest among the Ansar, so I will give you half of my wealth and you may look at my two wives and whichever of the two you may choose I will divorce her, and when she has completed the prescribed period (before marriage) you may marry her.' `Abdur-Rahman replied, \"I am not in need of all that. Is there any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- Rahman went to that market the following day and brought some dried buttermilk (yogurt) and butter, and then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of yellow (scent) on his body. Allah's Apostle asked him whether he had got married. He replied in the affirmative. The Prophet said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then the Prophet asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh to a date stone (or a date stone of gold)! The Prophet said, 'Give a Walima (wedding banquet) even if with one sheep .' \"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "8"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال أخبرني الليث، عن سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا زنت أمة أحدكم، فتبين زناها فليجلدها الحد، ولا يثرب عليها، ثم إن زنت فليجلدها الحد ولا يثرب، ثم إن زنت الثالثة فتبين زناها فليبعها ولو بحبل من شعر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"If a slave-girl of yours commits illegal sexual intercourse and her illegal sexual intercourse is proved, she should be lashed, and after that nobody should blame her, and if she commits illegal sexual intercourse the second time, she should be lashed and nobody should blame her after that, and if she does the offense for the third time and her illegal sexual intercourse is proved, she should be sold even for a hair rope.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2301",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن بن عوف  رضى الله عنه  قال كاتبت أمية بن خلف كتابا بأن يحفظني في صاغيتي بمكة، وأحفظه في صاغيته بالمدينة، فلما ذكرت الرحمن قال لا أعرف الرحمن، كاتبني باسمك الذي كان في الجاهلية‏.‏ فكاتبته عبد عمرو فلما كان في يوم بدر خرجت إلى جبل لأحرزه حين نام الناس فأبصره بلال فخرج حتى وقف على مجلس من الأنصار فقال أمية بن خلف، لا نجوت إن نجا أمية‏.‏ فخرج معه فريق من الأنصار في آثارنا، فلما خشيت أن يلحقونا خلفت لهم ابنه، لأشغلهم فقتلوه ثم أبوا حتى يتبعونا، وكان رجلا ثقيلا، فلما أدركونا قلت له ابرك‏.‏ فبرك، فألقيت عليه نفسي لأمنعه، فتخللوه بالسيوف من تحتي، حتى قتلوه، وأصاب أحدهم رجلي بسيفه، وكان عبد الرحمن بن عوف يرينا ذلك الأثر في ظهر قدمه‏.‏ قال أبو عبد الله سمع يوسف صالحا وإبراهيم أباه",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     I got an agreement written between me and Umaiya bin Khalaf that Umaiya would look after my property (or family) in Mecca and I would look after his in Medina. When I mentioned the word 'Ar64 Rahman' in the documents, Umaiya said, \"I do not know 'Ar-Rahman.' Write down to me your name, (with which you called yourself) in the Pre-Islamic Period of Ignorance.\" So, I wrote my name ' `Abdu `Amr'. On the day (of the battle) of Badr, when all the people went to sleep, I went up the hill to protect him. Bilal(1) saw him (i.e. Umaiya) and went to a gathering of Ansar and said, \"(Here is) Umaiya bin Khalaf! Woe to me if he escapes!\" So, a group of Ansar went out with Bilal to follow us (`Abdur-Rahman and Umaiya). Being afraid that they would catch us, I left Umaiya's son for them to keep them busy but the Ansar killed the son and insisted on following us. Umaiya was a fat man, and when they approached us, I told him to kneel down, and he knelt, and I laid myself on him to protect him, but the Ansar killed him by passing their swords underneath me, and one of them injured my foot with his sword. (The sub narrator said, \" `Abdur-Rahman used to show us the trace of the wound on the back of his foot.\")",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "2387",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أخذ أموال الناس يريد أداءها أدى الله عنه، ومن أخذ يريد إتلافها أتلفه الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever takes the money of the people with the intention of repaying it, Allah will repay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2458",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب بنت أم سلمة، أخبرته أن أمها أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته، فخرج إليهم، فقال ‏\"‏ إنما أنا بشر وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صدق، فأقضي له بذلك، فمن قضيت له بحق مسلم فإنما هي قطعة من النار، فليأخذها أو فليتركها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle heard some people quarreling at the door of his dwelling. He came out and said, \"I am only a human being, and opponents come to me (to settle their problems); maybe someone amongst you can present his case more eloquently than the other, whereby I may consider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by mistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day of Resurrection).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "2567",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أنها قالت لعروة ابن أختي، إن كنا لننظر إلى الهلال ثم الهلال، ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت يا خالة ما كان يعيشكم قالت الأسودان التمر والماء، إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كانت لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من ألبانهم، فيسقينا‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the crescent in this way we saw three crescents in two months and no fire (for cooking) used to be made in the houses of Allah's Apostle. I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The two black things: dates and water, our neighbors from Ansar had some Manarh and they used to present Allah's Apostle some of their milk and he used to make us drink.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2570",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن أبي حازم، عن عبد الله بن أبي قتادة السلمي، عن أبيه  رضى الله عنه  قال كنت يوما جالسا مع رجال من أصحاب النبي صلى الله عليه وسلم في منزل في طريق مكة ورسول الله صلى الله عليه وسلم نازل أمامنا والقوم محرمون، وأنا غير محرم، فأبصروا حمارا وحشيا، وأنا مشغول أخصف نعلي، فلم يؤذنوني به، وأحبوا لو أني أبصرته، والتفت فأبصرته، فقمت إلى الفرس فأسرجته ثم ركبت ونسيت السوط والرمح فقلت لهم ناولوني السوط والرمح‏.‏ فقالوا لا والله، لا نعينك عليه بشىء‏.‏ فغضبت فنزلت فأخذتهما، ثم ركبت، فشددت على الحمار فعقرته، ثم جئت به وقد مات، فوقعوا فيه يأكلونه، ثم إنهم شكوا في أكلهم إياه، وهم حرم، فرحنا وخبأت العضد معي، فأدركنا رسول الله صلى الله عليه وسلم فسألناه عن ذلك فقال ‏\"‏ معكم منه شىء ‏\"‏‏.‏ فقلت نعم‏.‏ فناولته العضد فأكلها، حتى نفدها وهو محرم‏.‏ فحدثني به زيد بن أسلم عن عطاء بن يسار عن أبي قتادة ‏عن النبي صلى الله عليه وسلم.‏",
      "text_en": " Narrated `Abdullah bin Abu Qatada Al-Aslami:                     That his father said, \"One day I was sitting with some of the Prophet's companions on the way to Mecca. Allah's Apostle was ahead of us. All of my companions were in the state of Ihram while I was a non-Muhrim. They saw an onager while I was busy repairing my shoes, so they did not tell me about it but they wished I had seen it. By chance I looked up and saw it. So, I turned to the horse, saddled it and rode on it, forgetting to take the spear and the whip. I asked them if they could hand over to me the whip and the spear but they said, 'No, by Allah, we shall not help you in that in any way.' I became angry and got down from the horse, picked up both the things and rode the horse again. I attacked the onager and slaughtered it, and brought it (after it had been dead). They took it (cooked some of it) and started eating it, but they doubted whether it was allowed for them to eat it or not, as they were in the state of Ihram. So, we proceeded and I hid with me one of its fore-legs. When we met Allah's Apostle and asked him about the case, he asked, 'Do you have a portion of it with you?' I replied in the affirmative and gave him that fleshy foreleg which he ate completely while he was in the state of Ihram .",
      "chain": [
        "30105",
        "20173",
        "11349"
      ]
    },
    {
      "hadith_no": "2692",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، أن حميد بن عبد الرحمن، أخبره أن أمه أم كلثوم بنت عقبة أخبرته أنها، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس الكذاب الذي يصلح بين الناس، فينمي خيرا، أو يقول خيرا ‏\"‏‏.‏",
      "text_en": " Narrated Um Kulthum bint `Uqba:                     That she heard Allah's Apostle saying, \"He who makes peace between the people by inventing good information or saying good things, is not a liar.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10561"
      ]
    },
    {
      "hadith_no": "2693",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا عبد العزيز بن عبد الله الأويسي، وإسحاق بن محمد الفروي، قالا حدثنا محمد بن جعفر، عن أبي حازم، عن سهل بن سعد  رضى الله عنه أن أهل، قباء اقتتلوا حتى تراموا بالحجارة، فأخبر رسول الله صلى الله عليه وسلم بذلك فقال ‏\"‏ اذهبوا بنا نصلح بينهم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Once the people of Quba fought with each other till they threw stones on each other. When Allah's Apostle was informed about it, he said, \"Let us go to bring about a reconciliation between them.\"",
      "chain": [
        "30561",
        "30105",
        "20173",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2766",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور بن زيد المدني، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏‏.‏ قالوا يا رسول الله، وما هن قال ‏\"‏ الشرك بالله، والسحر، وقتل النفس التي حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات المؤمنات الغافلات ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Apostle! What are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the life which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba (usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the time of fighting, and to accuse, chaste women, who never even think of anything touching chastity and are good believers.",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2832",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد الزهري، قال حدثني صالح بن كيسان، عن ابن شهاب، عن سهل بن سعد الساعدي، أنه قال رأيت مروان بن الحكم جالسا في المسجد، فأقبلت حتى جلست إلى جنبه، فأخبرنا أن زيد بن ثابت أخبره أن رسول الله صلى الله عليه وسلم أملى عليه لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله قال فجاءه ابن أم مكتوم وهو يملها على، فقال يا رسول الله، لو أستطيع الجهاد لجاهدت‏.‏ وكان رجلا أعمى، فأنزل الله تبارك وتعالى على رسوله صلى الله عليه وسلم وفخذه على فخذي، فثقلت على حتى خفت أن ترض فخذي، ثم سري عنه، فأنزل الله عز وجل ‏{‏غير أولي الضرر‏}‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     I saw Marwan bin Al-Hakam sitting in the Mosque. So I came forward and sat by his side. He told us that Zaid bin Thabit had told him that Allah's Apostle had dictated to him the Divine Verse: \"Not equal are those believers who sit (at home) and those who strive hard and fight in the Cause of Allah with their wealth and lives.' (4.95) Zaid said, \"Ibn-Maktum came to the Prophet while he was dictating to me that very Verse. On that Ibn Um Maktum said, \"O Allah's Apostle! If I had power, I would surely take part in Jihad.\" He was a blind man. So Allah sent down revelation to His Apostle while his thigh was on mine and it became so heavy for me that I feared that my thigh would be broken. Then that state of the Prophet was over after Allah revealed \"...except those who are disabled (by injury or are blind or lame etc.) (4.95)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "399",
        "49"
      ]
    },
    {
      "hadith_no": "2889",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا محمد بن جعفر، عن عمرو بن أبي عمرو، مولى المطلب بن حنطب، أنه سمع أنس بن مالك  رضى الله عنه  يقول خرجت مع رسول الله صلى الله عليه وسلم إلى خيبر أخدمه، فلما قدم النبي صلى الله عليه وسلم راجعا، وبدا له أحد قال ‏\"‏ هذا جبل يحبنا ونحبه ‏\"‏‏.‏ ثم أشار بيده إلى المدينة قال اللهم إني أحرم ما بين لابتيها كتحريم إبراهيم مكة ‏\"‏ اللهم بارك لنا في صاعنا ومدنا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I went along with the Prophet to Khaibar so as to serve him. (Later on) when the Prophet returned he, on seeing the Uhud mountain, said, \"This is a mountain that loves us andis loved by us.\" Then he pointed to Medina with his hand saying, \"O Allah! I make the area which is in between Medina's two mountains a sanctuary, as Abraham made Mecca a sanctuary. O Allah! Bless us in our Sa and Mudd (i.e. units of measuring).",
      "chain": [
        "30105",
        "20173",
        "19"
      ]
    },
    {
      "hadith_no": "2923",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن ابن شهاب، عن جعفر بن عمرو بن أمية، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يأكل من كتف يحتز منها، ثم دعي إلى الصلاة فصلى ولم يتوضأ‏.‏ حدثنا أبو اليمان أخبرنا شعيب عن الزهري وزاد فألقى السكين‏.‏",
      "text_en": " Narrated Umaiya Ad-Damri:                     I saw the Prophet eating of a shoulder (of a sheep) by cutting from it and then he was called to prayer and he prayed without repeating his ablution.Narrated Az-Zuhri:as above (Hadith No. 173...) and added that the Prophet put the knife down.",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11501"
      ]
    },
    {
      "hadith_no": "3092",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة أم المؤمنين  رضى الله عنها  أخبرته أن فاطمة  عليها السلام  ابنة رسول الله صلى الله عليه وسلم سألت أبا بكر الصديق بعد وفاة رسول الله صلى الله عليه وسلم أن يقسم لها ميراثها، ما ترك رسول الله صلى الله عليه وسلم مما أفاء الله عليه‏.‏ فقال لها أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ فغضبت فاطمة بنت رسول الله صلى الله عليه وسلم فهجرت أبا بكر، فلم تزل مهاجرته حتى توفيت وعاشت بعد رسول الله صلى الله عليه وسلم ستة أشهر‏.‏ قالت وكانت فاطمة تسأل أبا بكر نصيبها مما ترك رسول الله صلى الله عليه وسلم من خيبر وفدك وصدقته بالمدينة، فأبى أبو بكر عليها ذلك، وقال لست تاركا شيئا كان رسول الله صلى الله عليه وسلم يعمل به إلا عملت به، فإني أخشى إن تركت شيئا من أمره أن أزيغ‏.‏ فأما صدقته بالمدينة فدفعها عمر إلى علي وعباس، فأما خيبر وفدك فأمسكها عمر وقال هما صدقة رسول الله صلى الله عليه وسلم كانتا لحقوقه التي تعروه ونوائبه، وأمرهما إلى من ولي الأمر‏.‏ قال فهما على ذلك إلى اليوم‏.‏ قال أبو عبد الله اعتراك افتعلت من عروته فأصبته ومنه يعروه واعتراني",
      "text_en": " Narrated `Aisha:                     (mother of the believers) After the death of Allah 's Apostle Fatima the daughter of Allah's Apostle asked Abu Bakr As-Siddiq to give her, her share of inheritance from what Allah's Apostle had left of the Fai (i.e. booty gained without fighting) which Allah had given him. Abu Bakr said to her, \"Allah's Apostle said, 'Our property will not be inherited, whatever we (i.e. prophets) leave is Sadaqa (to be used for charity).\" Fatima, the daughter of Allah's Apostle got angry and stopped speaking to Abu Bakr, and continued assuming that attitude till she died. Fatima remained alive for six months after the death of Allah's Apostle. She used to ask Abu Bakr for her share from the property of Allah's Apostle which he left at Khaibar, and Fadak, and his property at Medina (devoted for charity). Abu Bakr refused to give her that property and said, \"I will not leave anything Allah's Apostle used to do, because I am afraid that if I left something from the Prophet's tradition, then I would go astray.\" (Later on) `Umar gave the Prophet's property (of Sadaqa) at Medina to `Ali and `Abbas, but he withheld the properties of Khaibar and Fadak in his custody and said, \"These two properties are the Sadaqa which Allah's Apostle used to use for his expenditures and urgent needs. Now their management is to be entrusted to the ruler.\" (Az-Zuhrl said, \"They have been managed in this way till today.\")",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3148",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عمر بن محمد بن جبير بن مطعم، أن محمد بن جبير، قال أخبرني جبير بن مطعم، أنه بينا هو مع رسول الله صلى الله عليه وسلم ومعه الناس مقبلا من حنين علقت رسول الله صلى الله عليه وسلم الأعراب يسألونه حتى اضطروه إلى سمرة، فخطفت رداءه، فوقف رسول الله صلى الله عليه وسلم فقال ‏\"‏ أعطوني ردائي، فلو كان عدد هذه العضاه نعما لقسمته بينكم، ثم لا تجدوني بخيلا ولا كذوبا ولا جبانا ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     That while he was with Allah's Apostle who was accompanied by the people on their way back from Hunain, the bedouins started begging things of Allah's Apostle so much so that they forced him to go under a Samura tree where his loose outer garment was snatched away. On that, Allah's Apostle stood up and said to them, \"Return my garment to me. If I had as many camels as these trees, I would have distributed them amongst you; and you will not find me a miser or a liar or a coward.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11712",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "3256",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك بن أنس، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة يتراءيون أهل الغرف من فوقهم كما يتراءيون الكوكب الدري الغابر في الأفق من المشرق أو المغرب، لتفاضل ما بينهم ‏\"‏‏.‏ قالوا يا رسول الله، تلك منازل الأنبياء لا يبلغها غيرهم قال ‏\"‏ بلى والذي نفسي بيده، رجال آمنوا بالله وصدقوا المرسلين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The people of Paradise will look at the dwellers of the lofty mansions (i.e. a superior place in Paradise) in the same way as one looks at a brilliant star far away in the East or in the West on the horizon; all that is because of their superiority over one another (in rewards).\" On that the people said, \"O Allah's Apostle! Are these lofty mansions for the prophets which nobody else can reach? The Prophet replied,\" No! \"By Allah in whose Hands my life is, these are for the men who believed in Allah and also believed in the Apostles.\"",
      "chain": [
        "30105",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3409",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن حميد بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احتج آدم وموسى فقال له موسى أنت آدم الذي أخرجتك خطيئتك من الجنة‏.‏ فقال له آدم أنت موسى الذي اصطفاك الله برسالاته وبكلامه، ثم تلومني على أمر قدر على قبل أن أخلق ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فحج آدم موسى ‏\"‏ مرتين‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Adam and Moses argued with each other. Moses said to Adam. 'You are Adam whose mistake expelled you from Paradise.' Adam said to him, 'You are Moses whom Allah selected as His Messenger and as the one to whom He spoke directly; yet you blame me for a thing which had already been written in my fate before my creation?\"' Allah's Apostle said twice, \"So, Adam overpowered Moses.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "3462",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال قال أبو سلمة بن عبد الرحمن إن أبا هريرة  رضى الله عنه  قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن اليهود والنصارى لا يصبغون، فخالفوهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Jews and the Christians do not dye (their grey hair), so you shall do the opposite of what they do (i.e. dye your grey hair and beards).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3469",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنه قد كان فيما مضى قبلكم من الأمم محدثون، وإنه إن كان في أمتي هذه منهم، فإنه عمر بن الخطاب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Amongst the people preceding you there used to be 'Muhaddithun' (i.e. persons who can guess things that come true later on, as if those persons have been inspired by a divine power), and if there are any such persons amongst my followers, it is `Umar bin Al-Khattab.\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3473",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك، عن محمد بن المنكدر، وعن أبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، أنه سمعه يسأل، أسامة بن زيد ماذا سمعت من، رسول الله صلى الله عليه وسلم في الطاعون فقال أسامة قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون رجس أرسل على طائفة من بني إسرائيل أو على من كان قبلكم، فإذا سمعتم به بأرض فلا تقدموا عليه، وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏‏.‏ قال أبو النضر ‏\"‏ لا يخرجكم إلا فرارا منه ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle said, \"Plague was a means of torture sent on a group of Israelis (or on some people before you). So if you hear of its spread in a land, don't approach it, and if a plague should appear in a land where you are present, then don't leave that land in order to run away from it (i.e. plague).",
      "chain": [
        "30105",
        "20001",
        "11048",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3480",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كان الرجل يداين الناس، فكان يقول لفتاه إذا أتيت معسرا فتجاوز عنه، لعل الله أن يتجاوز عنا‏.‏ قال فلقي الله فتجاوز عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A man used to give loans to the people and used to say to his servant, 'If the debtor is poor, forgive him, so that Allah may forgive us.' So when he met Allah (after his death), Allah forgave him.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "3546",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن أنس، أن عثمان، دعا زيد بن ثابت وعبد الله بن الزبير وسعيد بن العاص وعبد الرحمن بن الحارث بن هشام فنسخوها في المصاحف، وقال عثمان للرهط القرشيين الثلاثة إذا اختلفتم أنتم وزيد بن ثابت في شىء من القرآن، فاكتبوه بلسان قريش، فإنما نزل بلسانهم‏.‏ ففعلوا ذلك‏.‏",
      "text_en": " Narrated Anas:                     `Uthman called Zaid bin Thabit, `Abdullah bin Az-Zubair, Sa`id bin Al-`As and `AbdurRahman bin Al-Harith bin Hisham, and then they wrote the manuscripts of the Holy Qur'an in the form of book in several copies. `Uthman said to the three Quraishi persons. \" If you differ with Zaid bin Thabit on any point of the Qur'an, then write it in the language of Quraish, as the Qur'an was revealed in their language.\" So they acted accordingly. (Sa`id bin Thabit was an Ansari and not from Quraish ).",
      "chain": [
        "30105",
        "20150",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3557",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى يخرج رجل من قحطان يسوق الناس بعصاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Hurairah (ra):                      The Prophet () said, \"The hour will not be established unless a man from the tribe of Qahtan appears, driving the people with his stick (ruling them with violence and oppression).\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "3644",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد العزيز الأويسي، حدثنا إبراهيم، عن صالح بن كيسان، عن ابن شهاب، عن ابن المسيب، وأبي، سلمة بن عبد الرحمن أن أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستكون فتن، القاعد فيها خير من القائم، والقائم فيها خير من الماشي، والماشي فيها خير من الساعي، ومن يشرف لها تستشرفه، ومن وجد ملجأ أو معاذا فليعذ به ‏\"‏‏.‏   وعن ابن شهاب، حدثني أبو بكر بن عبد الرحمن بن الحارث، عن عبد الرحمن بن مطيع بن الأسود، عن نوفل بن معاوية،، مثل حديث أبي هريرة هذا، إلا أن أبا بكر، يزيد ‏\"‏ من الصلاة صلاة من فاتته فكأنما وتر أهله وماله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There will be afflictions (and at the time) the sitting person will be better than the standing one, and the standing one will be better than the walking, and the walking will be better than the running. And whoever will look towards those afflictions, they will overtake him, and whoever will find a refuge or a shelter, should take refuge in it.\" The same narration is reported by Abu Bakr, with the addition, \"(The Prophet said), 'Among the prayers there is a prayer the missing of which will be to one like losing one's family and property.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3698",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن يحيى بن سعيد، عن نافع، عن ابن عمر  رضى الله عنهما  قال كنا نخير بين الناس في زمن النبي صلى الله عليه وسلم فنخير أبا بكر، ثم عمر بن الخطاب، ثم عثمان بن عفان رضى الله عنهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We used to compare the people as to who was better during the lifetime of Allah's Apostle . We used to regard Abu Bakr as the best, then `Umar, and then `Uthman .",
      "chain": [
        "30105",
        "20160",
        "11062",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3816",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني محمد بن جعفر، عن عبد الله بن عبد الرحمن، أنه سمع أنس بن مالك  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فضل عائشة على النساء كفضل الثريد على الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"The superiority of `Aisha over other women is like the superiority of Tharid to other meals.\"",
      "chain": [
        "30105",
        "20173",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "3930",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم حين أراد حنينا ‏\"‏ منزلنا غدا إن شاء الله بخيف بني كنانة، حيث تقاسموا على الكفر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle, while going out for the battle of Hunain, said, \"Tomorrow Allah willing, we will encamp at Khaif Bani Kinana where the pagans(of Quraish) took the oath of Kufr (against the Prophet i.e. to be loyal to heathenism, by boycotting Banu Hashim, the Prophet's folk, See Hadith No. 659 Vol. 2) .",
      "chain": [
        "30105",
        "20150",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4020",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن، قال كاتبت أمية بن خلف، فلما كان يوم بدر، فذكر قتله وقتل ابنه، فقال بلال لا نجوت إن نجا أمية‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     \"I had an agreement with Umaiya bin Khalaf (that he would look after my relatives and property in Mecca, and I would look after his relatives and property in Medina).\" `Abdur-Rahman then mentioned the killing of Umaiya and his son on the day of Badr, and Bilal said, \"Woe to me if Umaiya remains safe (i.e. alive) . \"",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "20033"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن سعد بن أبي وقاص  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم أحد، ومعه رجلان يقاتلان عنه، عليهما ثياب بيض، كأشد القتال، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I saw Allah's Apostle on the day of the battle of Uhud accompanied by two men fighting on his behalf. They were dressed in white and were fighting as bravely as possible. I had never seen them before, nor did I see them later on.",
      "chain": [
        "30105",
        "20150",
        "11063",
        "9"
      ]
    },
    {
      "hadith_no": "4193",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال حدثني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة بن مسعود، عن عائشة، رضى الله عنها زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، وكلهم حدثني طائفة من حديثها، وبعضهم كان أوعى لحديثها من بعض وأثبت له اقتصاصا، وقد وعيت عن كل رجل منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا، وإن كان بعضهم أوعى له من بعض، قالوا قالت عائشة كان رسول الله صلى الله عليه وسلم إذا أراد سفرا أقرع بين أزواجه، فأيهن خرج سهمها، خرج بها رسول الله صلى الله عليه وسلم معه، قالت عائشة فأقرع بيننا في غزوة غزاها فخرج فيها سهمي، فخرجت مع رسول الله صلى الله عليه وسلم بعد ما أنزل الحجاب، فكنت أحمل في هودجي وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك وقفل، دنونا من المدينة قافلين، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى رحلي، فلمست صدري، فإذا عقد لي من جزع ظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، قالت وأقبل الرهط الذين كانوا يرحلوني فاحتملوا هودجي، فرحلوه على بعيري الذي كنت أركب عليه، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يهبلن ولم يغشهن اللحم، إنما يأكلن العلقة من الطعام، فلم يستنكر القوم خفة الهودج حين رفعوه وحملوه، وكنت جارية حديثة السن، فبعثوا الجمل فساروا، ووجدت عقدي بعد ما استمر الجيش، فجئت منازلهم وليس بها منهم داع ولا مجيب، فتيممت منزلي الذي كنت به، وظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة في منزلي غلبتني عيني فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم، فعرفني حين رآني، وكان رآني قبل الحجاب، فاستيقظت باسترجاعه حين عرفني، فخمرت وجهي بجلبابي، والله ما تكلمنا بكلمة ولا سمعت منه كلمة غير استرجاعه، وهوى حتى أناخ راحلته، فوطئ على يدها، فقمت إليها فركبتها، فانطلق يقود بي الراحلة حتى أتينا الجيش موغرين في نحر الظهيرة، وهم نزول  قالت  فهلك ‏{‏في‏}‏ من هلك، وكان الذي تولى كبر الإفك عبد الله بن أبى ابن سلول‏.‏ قال عروة أخبرت أنه كان يشاع ويتحدث به عنده، فيقره ويستمعه ويستوشيه‏.‏ وقال عروة أيضا لم يسم من أهل الإفك أيضا إلا حسان بن ثابت، ومسطح بن أثاثة، وحمنة بنت جحش في ناس آخرين، لا علم لي بهم، غير أنهم عصبة  كما قال الله تعالى  وإن كبر ذلك يقال عبد الله بن أبى ابن سلول‏.‏ قال عروة كانت عائشة تكره أن يسب عندها حسان، وتقول إنه الذي قال فإن أبي ووالده وعرضي لعرض محمد منكم وقاء قالت عائشة فقدمنا المدينة فاشتكيت حين قدمت شهرا، والناس يفيضون في قول أصحاب الإفك، لا أشعر بشىء من ذلك، وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي، إنما يدخل على رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏ ثم ينصرف، فذلك يريبني ولا أشعر بالشر، حتى خرجت حين نقهت، فخرجت مع أم مسطح قبل المناصع، وكان متبرزنا، وكنا لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا‏.‏ قالت وأمرنا أمر العرب الأول في البرية قبل الغائط، وكنا نتأذى بالكنف أن نتخذها عند بيوتنا، قالت فانطلقت أنا وأم مسطح وهى ابنة أبي رهم بن المطلب بن عبد مناف، وأمها بنت صخر بن عامر خالة أبي بكر الصديق، وابنها مسطح بن أثاثة بن عباد بن المطلب، فأقبلت أنا وأم مسطح قبل بيتي، حين فرغنا من شأننا، فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت أى هنتاه ولم تسمعي ما قال قالت وقلت ما قال فأخبرتني بقول أهل الإفك  قالت  فازددت مرضا على مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم ثم قال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت له أتأذن لي أن آتي أبوى قالت وأريد أن أستيقن الخبر من قبلهما، قالت فأذن لي رسول الله صلى الله عليه وسلم، فقلت لأمي يا أمتاه ماذا يتحدث الناس قالت يا بنية هوني عليك، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها لها ضرائر إلا كثرن عليها‏.‏ قالت فقلت سبحان الله أولقد تحدث الناس بهذا قالت فبكيت تلك الليلة، حتى أصبحت لا يرقأ لي دمع، ولا أكتحل بنوم، ثم أصبحت أبكي  قالت  ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يسألهما ويستشيرهما في فراق أهله  قالت  فأما أسامة فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله، وبالذي يعلم لهم في نفسه، فقال أسامة أهلك ولا نعلم إلا خيرا‏.‏ وأما علي فقال يا رسول الله لم يضيق الله عليك، والنساء سواها كثير، وسل الجارية تصدقك‏.‏ قالت فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة هل رأيت من شىء يريبك ‏\"‏‏.‏ قالت له بريرة والذي بعثك بالحق ما رأيت عليها أمرا قط أغمصه، غير أنها جارية حديثة السن تنام عن عجين أهلها، فتأتي الداجن فتأكله  قالت  فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى وهو على المنبر فقال ‏\"‏ يا معشر المسلمين من يعذرني من رجل قد بلغني عنه أذاه في أهلي، والله ما علمت على أهلي إلا خيرا، ولقد ذكروا رجلا ما علمت عليه إلا خيرا، وما يدخل على أهلي إلا معي ‏\"‏‏.‏ قالت فقام سعد بن معاذ أخو بني عبد الأشهل فقال أنا يا رسول الله أعذرك، فإن كان من الأوس ضربت عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا أمرك‏.‏ قالت فقام رجل من الخزرج، وكانت أم حسان بنت عمه من فخذه، وهو سعد بن عبادة، وهو سيد الخزرج  قالت  وكان قبل ذلك رجلا صالحا، ولكن احتملته الحمية فقال لسعد كذبت لعمر الله لا تقتله، ولا تقدر على قتله، ولو كان من رهطك ما أحببت أن يقتل‏.‏ فقام أسيد بن حضير  وهو ابن عم سعد  فقال لسعد بن عبادة كذبت لعمر الله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ قالت فثار الحيان الأوس والخزرج حتى هموا أن يقتتلوا، ورسول الله صلى الله عليه وسلم قائم على المنبر  قالت  فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت  قالت  فبكيت يومي ذلك كله، لا يرقأ لي دمع، ولا أكتحل بنوم  قالت  وأصبح أبواى عندي، وقد بكيت ليلتين ويوما، لا يرقأ لي دمع، ولا أكتحل بنوم، حتى إني لأظن أن البكاء فالق كبدي، فبينا أبواى جالسان عندي وأنا أبكي فاستأذنت على امرأة من الأنصار، فأذنت لها، فجلست تبكي معي  قالت  فبينا نحن على ذلك دخل رسول الله صلى الله عليه وسلم علينا، فسلم ثم جلس  قالت  ولم يجلس عندي منذ قيل ما قيل قبلها، وقد لبث شهرا لا يوحى إليه في شأني بشىء  قالت  فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد، يا عائشة إنه بلغني عنك كذا وكذا، فإن كنت بريئة، فسيبرئك الله، وإن كنت ألممت بذنب، فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف ثم تاب تاب الله عليه ‏\"‏‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة، فقلت لأبي أجب رسول الله صلى الله عليه وسلم عني فيما قال‏.‏ فقال أبي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت أمي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت وأنا جارية حديثة السن لا أقرأ من القرآن كثيرا إني والله لقد علمت لقد سمعتم هذا الحديث حتى استقر في أنفسكم وصدقتم به، فلئن قلت لكم إني بريئة لا تصدقوني، ولئن اعترفت لكم بأمر، والله يعلم أني منه بريئة لتصدقني، فوالله لا أجد لي ولكم مثلا إلا أبا يوسف حين قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت واضطجعت على فراشي، والله يعلم أني حينئذ بريئة، وأن الله مبرئي ببراءتي ولكن والله ما كنت أظن أن الله منزل في شأني وحيا يتلى، لشأني في نفسي كان أحقر من أن يتكلم الله في بأمر، ولكن كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها، فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه، ولا خرج أحد من أهل البيت، حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه من العرق مثل الجمان وهو في يوم شات، من ثقل القول الذي أنزل عليه  قالت  فسري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكانت أول كلمة تكلم بها أن قال ‏\"‏ يا عائشة أما الله فقد برأك ‏\"‏‏.‏ قالت فقالت لي أمي قومي إليه‏.‏ فقلت والله لا أقوم إليه، فإني لا أحمد إلا الله عز وجل  قالت  وأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات، ثم أنزل الله هذا في براءتي‏.‏ قال أبو بكر الصديق  وكان ينفق على مسطح بن أثاثة لقرابته منه وفقره  والله لا أنفق على مسطح شيئا أبدا بعد الذي قال لعائشة ما قال‏.‏ فأنزل الله ‏{‏ ولا يأتل أولو الفضل منكم‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ قال أبو بكر الصديق بلى والله إني لأحب أن يغفر الله لي",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle intended to go on a journey, he used to draw lots amongst his wives, and Allah's Apostle used to take with him the one on whom lot fell. He drew lots amongst us during one of the Ghazwat which he fought. The lot fell on me and so I proceeded with Allah's Apostle after Allah's order of veiling (the women) had been revealed. I was carried (on the back of a camel) in my howdah and carried down while still in it (when we came to a halt). So we went on till Allah's Apostle had finished from that Ghazwa of his and returned. When we approached the city of Medina he announced at night that it was time for departure. So when they announced the news of departure, I got up and went away from the army camps, and after finishing from the call of nature, I came back to my riding animal. I touched my chest to find that my necklace which was made of Zifar beads (i.e. Yemenite beads partly black and partly white) was missing. So I returned to look for my necklace and my search for it detained me. (In the meanwhile) the people who used to carry me on my camel, came and took my howdah and put it on the back of my camel on which I used to ride, as they considered that I was in it. In those days women were light in weight for they did not get fat, and flesh did not cover their bodies in abundance as they used to eat only a little food. Those people therefore, disregarded the lightness of the howdah while lifting and carrying it; and at that time I was still a young girl. They made the camel rise and all of them left (along with it). I found my necklace after the army had gone. Then I came to their camping place to find no call maker of them, nor one who would respond to the call. So I intended to go to the place where I used to stay, thinking that they would miss me and come back to me (in my search). While I was sitting in my resting place, I was overwhelmed by sleep and slept. Safwan bin Al-Muattal As-Sulami Adh-Dhakwani was behind the army. When he reached my place in the morning, he saw the figure of a sleeping person and he recognized me on seeing me as he had seen me before the order of compulsory veiling (was prescribed). So I woke up when he recited Istirja' (i.e. \"Inna li l-lahi wa inna llaihi raji'un\") as soon as he recognized me. I veiled my face with my head cover at once, and by Allah, we did not speak a single word, and I did not hear him saying any word besides his Istirja'. He dismounted from his camel and made it kneel down, putting his leg on its front legs and then I got up and rode on it. Then he set out leading the camel that was carrying me till we overtook the army in the extreme heat of midday while they were at a halt (taking a rest). (Because of the event) some people brought destruction upon themselves and the one who spread the Ifk (i.e. slander) more, was `Abdullah bin Ubai Ibn Salul.\" (Urwa said, \"The people propagated the slander and talked about it in his (i.e. `Abdullah's) presence and he confirmed it and listened to it and asked about it to let it prevail.\" `Urwa also added, \"None was mentioned as members of the slanderous group besides (`Abdullah) except Hassan bin Thabit and Mistah bin Uthatha and Hamna bint Jahsh along with others about whom I have no knowledge, but they were a group as Allah said. It is said that the one who carried most of the slander was `Abdullah bin Ubai bin Salul.\" `Urwa added, \"`Aisha disliked to have Hassan abused in her presence and she used to say, 'It was he who said: My father and his (i.e. my father's) father and my honor are all for the protection of Muhammad's honor from you.\"). `Aisha added, \"After we returned to Medina, I became ill for a month. The people were propagating the forged statements of the slanderers while I was unaware of anything of all that, but I felt that in my present ailment, I was not receiving the same kindness from Allah's Apostle as I used to receive when I got sick. (But now) Allah's Apostle would only come, greet me and say,' How is that (lady)?' and leave. That roused my doubts, but I did not discover the evil (i.e. slander) till I went out after my convalescence, I went out with Um Mistah to Al-Manasi' where we used to answer the call of nature and we used not to go out (to answer the call of nature) except at night, and that was before we had latrines near our houses. And this habit of our concerning evacuating the bowels, was similar to the habits of the old 'Arabs living in the deserts, for it would be troublesome for us to take latrines near our houses. So I and Um Mistah who was the daughter of Abu Ruhm bin Al-Muttalib bin `Abd Manaf, whose mother was the daughter of Sakhr bin 'Amir and the aunt of Abu Bakr As-Siddiq and whose son was Mistah bin Uthatha bin `Abbas bin Al-Muttalib, went out. I and Um Mistah returned to my house after we finished answering the call of nature. Um Mistah stumbled by getting her foot entangled in her covering sheet and on that she said, 'Let Mistah be ruined!' I said, 'What a hard word you have said. Do you abuse a man who took part in the battle of Badr?' On that she said, 'O you Hantah! Didn't you hear what he (i.e. Mistah) said? 'I said, 'What did he say?' Then she told me the slander of the people of Ifk. So my ailment was aggravated, and when I reached my home, Allah's Apostle came to me, and after greeting me, said, 'How is that (lady)?' I said, 'Will you allow me to go to my parents?' as I wanted to be sure about the news through them. Allah's Apostle allowed me (and I went to my parents) and asked my mother, 'O mother! What are the people talking about?' She said, 'O my daughter! Don't worry, for scarcely is there a charming woman who is loved by her husband and whose husband has other wives besides herself that they (i.e. women) would find faults with her.' I said, 'Subhan-Allah! (I testify the uniqueness of Allah). Are the people really talking in this way?' I kept on weeping that night till dawn I could neither stop weeping nor sleep then in the morning again, I kept on weeping. When the Divine Inspiration was delayed. Allah's Apostle called `Ali bin Abi Talib and Usama bin Zaid to ask and consult them about divorcing me. Usama bin Zaid said what he knew of my innocence, and the respect he preserved in himself for me. Usama said, '(O Allah's Apostle!) She is your wife and we do not know anything except good about her.' `Ali bin Abi Talib said, 'O Allah's Apostle! Allah does not put you in difficulty and there are plenty of women other than she, yet, ask the maid-servant who will tell you the truth.' On that Allah's Apostle called Barira (i.e. the maid-servant) and said, 'O Barira! Did you ever see anything which aroused your suspicion?' Barira said to him, 'By Him Who has sent you with the Truth. I have never seen anything in her (i.e. Aisha) which I would conceal, except that she is a young girl who sleeps leaving the dough of her family exposed so that the domestic goats come and eat it.' So, on that day, Allah's Apostle got up on the pulpit and complained about `Abdullah bin Ubai (bin Salul) before his companions, saying, 'O you Muslims! Who will relieve me from that man who has hurt me with his evil statement about my family? By Allah, I know nothing except good about my family and they have blamed a man about whom I know nothing except good and he used never to enter my home except with me.' Sa`d bin Mu`adh the brother of Banu `Abd Al-Ashhal got up and said, 'O Allah's Apostle! I will relieve you from him; if he is from the tribe of Al-Aus, then I will chop his head off, and if he is from our brothers, i.e. Al-Khazraj, then order us, and we will fulfill your order.' On that, a man from Al-Khazraj got up. Um Hassan, his cousin, was from his branch tribe, and he was Sa`d bin Ubada, chief of Al-Khazraj. Before this incident, he was a pious man, but his love for his tribe goaded him into saying to Sa`d (bin Mu`adh). 'By Allah, you have told a lie; you shall not and cannot kill him. If he belonged to your people, you would not wish him to be killed.' On that, Usaid bin Hudair who was the cousin of Sa`d (bin Mu`adh) got up and said to Sa`d bin 'Ubada, 'By Allah! You are a liar! We will surely kill him, and you are a hypocrite arguing on the behalf of hypocrites.' On this, the two tribes of Al-Aus and Al Khazraj got so much excited that they were about to fight while Allah's Apostle was standing on the pulpit. Allah's Apostle kept on quietening them till they became silent and so did he. All that day I kept on weeping with my tears never ceasing, and I could never sleep. In the morning my parents were with me and I wept for two nights and a day with my tears never ceasing and I could never sleep till I thought that my liver would burst from weeping. So, while my parents were sitting with me and I was weeping, an Ansari woman asked me to grant her admittance. I allowed her to come in, and when she came in, she sat down and started weeping with me. While we were in this state, Allah's Apostle came, greeted us and sat down. He had never sat with me since that day of the slander. A month had elapsed and no Divine Inspiration came to him about my case. Allah's Apostle then recited Tashah-hud and then said, 'Amma Badu, O `Aisha! I have been informed so-andso about you; if you are innocent, then soon Allah will reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him for forgiveness for when a slave confesses his sins and asks Allah for forgiveness, Allah accepts his repentance.' (continued...) (continuing... 1): -5.462:... ... When Allah's Apostle finished his speech, my tears ceased flowing completely that I no longer felt a single drop of tear flowing. I said to my father, 'Reply to Allah's Apostle on my behalf concerning what he has said.' My father said, 'By Allah, I do not know what to say to Allah's Apostle .' Then I said to my mother, 'Reply to Allah's Apostle on my behalf concerning what he has said.' She said, 'By Allah, I do not know what to say to Allah's Apostle.' In spite of the fact that I was a young girl and had a little knowledge of Qur'an, I said, 'By Allah, no doubt I know that you heard this (slanderous) speech so that it has been planted in your hearts (i.e. minds) and you have taken it as a truth. Now if I tell you that I am innocent, you will not believe me, and if confess to you about it, and Allah knows that I am innocent, you will surely believe me. By Allah, I find no similitude for me and you except that of Joseph's father when he said, '(For me) patience in the most fitting against that which you assert; it is Allah (Alone) Whose Help can be sought.' Then I turned to the other side and lay on my bed; and Allah knew then that I was innocent and hoped that Allah would reveal my innocence. But, by Allah, I never thought that Allah would reveal about my case, Divine Inspiration, that would be recited (forever) as I considered myself too unworthy to be talked of by Allah with something of my concern, but I hoped that Allah's Apostle might have a dream in which Allah would prove my innocence. But, by Allah, before Allah's Apostle left his seat and before any of the household left, the Divine inspiration came to Allah's Apostle. So there overtook him the same hard condition which used to overtake him, (when he used to be inspired Divinely). The sweat was dropping from his body like pearls though it was a wintry day and that was because of the weighty statement which was being revealed to him. When that state of Allah's Apostle was over, he got up smiling, and the first word he said was, 'O `Aisha! Allah has declared your innocence!' Then my Mother said to me, 'Get up and go to him (i.e. Allah's Apostle). I replied, 'By Allah, I will not go to him, and I praise none but Allah. So Allah revealed the ten Verses:- - \"Verily! They who spread the slander Are a gang, among you.............\" (24.11-20) Allah revealed those Qur'anic Verses to declare my innocence. Abu Bakr As-Siddiq who used to disburse money for Mistah bin Uthatha because of his relationship to him and his poverty, said, 'By Allah, I will never give to Mistah bin Uthatha anything after what he has said about Aisha.' Then Allah revealed:-- \"And let not those among you who are good and wealthy swear not to give (any sort of help) to their kinsmen, those in need, and those who have left their homes for Allah's cause, let them pardon and forgive. Do you not love that Allah should forgive you? And Allah is oft-Forgiving Most Merciful.\" (24.22) Abu Bakr As-Siddiq said, 'Yes, by Allah, I would like that Allah forgive me.' and went on giving Mistah the money he used to give him before. He also added, 'By Allah, I will never deprive him of it at all.' Aisha further said:.\" Allah's Apostle also asked Zainab bint Jahsh (i.e. his wife) about my case. He said to Zainab, 'What do you know and what did you see?\" She replied, \"O Allah's Apostle! I refrain from claiming falsely that I have heard or seen anything. By Allah, I know nothing except good (about `Aisha).' From amongst the wives of the Prophet Zainab was my peer (in beauty and in the love she received from the Prophet) but Allah saved her from that evil because of her piety. Her sister Hamna, started struggling on her behalf and she was destroyed along with those who were destroyed. The man who was blamed said, 'Subhan-Allah! By Him in Whose Hand my soul is, I have never uncovered the cover (i.e. veil) of any female.' Later on the man was martyred in Allah's Cause.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "4617",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني عروة بن الزبير، أنه سأل عائشة عن قول الله، تعالى ‏{‏وإن خفتم أن لا تقسطوا في اليتامى‏}‏‏.‏ فقالت يا ابن أختي، هذه اليتيمة تكون في حجر وليها، تشركه في ماله ويعجبه مالها وجمالها، فيريد وليها أن يتزوجها، بغير أن يقسط في صداقها، فيعطيها مثل ما يعطيها غيره، فنهوا عن أن ينكحوهن، إلا أن يقسطوا لهن، ويبلغوا لهن أعلى سنتهن في الصداق، فأمروا أن ينكحوا ما طاب لهم من النساء سواهن‏.‏ قال عروة قالت عائشة وإن الناس استفتوا رسول الله صلى الله عليه وسلم بعد هذه الآية فأنزل الله ‏{‏ويستفتونك في النساء‏}‏ قالت عائشة وقول الله تعالى في آية أخرى ‏{‏وترغبون أن تنكحوهن‏}‏ رغبة أحدكم عن يتيمته حين تكون قليلة المال والجمال قالت فنهوا أن ينكحوا عن من رغبوا في ماله وجماله في يتامى النساء، إلا بالقسط، من أجل رغبتهم عنهن إذا كن قليلات المال والجمال‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     That he asked `Aisha regarding the Statement of Allah: \"If you fear that you shall not be able to deal justly with the orphan girls...\" (4.3) She said, \"O son of my sister! An Orphan girl used to be under the care of a guardian with whom she shared property. Her guardian, being attracted by her wealth and beauty, would intend to marry her without giving her a just Mahr, i.e. the same Mahr as any other person might give her (in case he married her). So such guardians were forbidden to do that unless they did justice to their female wards and gave them the highest Mahr their peers might get. They were ordered (by Allah, to marry women of their choice other than those orphan girls.\" `Aisha added,\" The people asked Allah's Apostle his instructions after the revelation of this Divine Verse whereupon Allah revealed: \"They ask your instruction regarding women \" (4.127) `Aisha further said, \"And the Statement of Allah: \"And yet whom you desire to marry.\" (4.127) as anyone of you refrains from marrying an orphan girl (under his guardianship) when she is lacking in property and beauty.\" `Aisha added, \"So they were forbidden to marry those orphan girls for whose wealth and beauty they had a desire unless with justice, and that was because they would refrain from marrying them if they were lacking in property and beauty.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4671",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مفاتح الغيب خمس إن الله عنده علم الساعة، وينزل الغيث، ويعلم ما في الأرحام، وما تدري نفس ماذا تكسب غدا، وما تدري نفس بأى أرض تموت، إن الله عليم خبير ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"The key of the Unseen are five: Verily with Allah (Alone) is the knowledge of the Hour He sends down the rain and knows what is in the wombs. No soul knows what it will earn tomorrow, and no soul knows in what land it will die. Verily, Allah is All-Knower, All-Aware.\" (31.34)",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4736",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب،‏.‏ قال وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله، كل حدثني طائفة من الحديث قال النبي صلى الله عليه وسلم ‏\"‏ إن كنت بريئة فسيبرئك الله، وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه ‏\"‏‏.‏ قلت إني والله لا أجد مثلا إلا أبا يوسف ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ وأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated Az-Zuhri:                     `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Al-Qama bin Waqqas and 'Ubaidullah bin `Abdullah related the narration of `Aisha, the wife the Prophet, when the slanderers had said about her what they had said and Allah later declared her innocence. Each of them related a part of the narration (wherein) the Prophet said (to `Aisha). \"If you are innocent, then Allah will declare your innocence: but if you have committed a sin, then ask for Allah's Forgiveness and repent to him.\" `Aisha said, \"By Allah, I find no example for my case except that of Joseph's father (when he said), 'So (for me) patience is most fitting.' \" Then Allah revealed the ten Verses:-- \"Verily those who spread the slander are a gang amongst you..\" (24.11)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "4741",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، عن عائشة  رضى الله عنها  قالت له وهو يسألها عن قول الله تعالى ‏{‏حتى إذا استيأس الرسل‏}‏ قال قلت أكذبوا أم كذبوا قالت عائشة كذبوا‏.‏ قلت فقد استيقنوا أن قومهم كذبوهم فما هو بالظن قالت أجل لعمري لقد استيقنوا بذلك‏.‏ فقلت لها وظنوا أنهم قد كذبوا قالت معاذ الله لم تكن الرسل تظن ذلك بربها‏.‏ قلت فما هذه الآية‏.‏ قالت هم أتباع الرسل الذين آمنوا بربهم وصدقوهم، فطال عليهم البلاء، واستأخر عنهم النصر حتى استيأس الرسل ممن كذبهم من قومهم وظنت الرسل أن أتباعهم قد كذبوهم جاءهم نصر الله عند ذلك‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     That when he asked `Aisha about the statement of Allah \"Until when the Apostles gave up hope (of their people).\" (12.110) she told him (its meaning), `Urwa added, \"I said, 'Did they (Apostles) suspect that they were betrayed (by Allah) or that they were treated as liars by (their people)?' `Aisha said, '(They suspected) that they were treated as liars by (their people),' I said, 'But they were sure that their people treated them as liars and it was not a matter of suspicion.' She said, 'Yes, upon my life they were sure about it.' I said to her. 'So they (Apostles) suspected that they were betrayed (by Allah).' She said, \"Allah forbid! The Apostles never suspected their Lord of such a thing.' I said, 'What about this Verse then?' She said, 'It is about the Apostles' followers who believed in their Lord and trusted their Apostles, but the period of trials was prolonged and victory was delayed till the Apostles gave up all hope of converting those of the people who disbelieved them and the Apostles thought that their followers treated them as liars; thereupon Allah's help came to them.",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4946",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور، عن أبي الغيث، عن أبي هريرة، رضى الله عنه قال كنا جلوسا عند النبي صلى الله عليه وسلم فأنزلت عليه سورة الجمعة ‏{‏وآخرين منهم لما يلحقوا بهم‏}‏ قال قلت من هم يا رسول الله فلم يراجعه حتى سأل ثلاثا، وفينا سلمان الفارسي، وضع رسول الله صلى الله عليه وسلم يده على سلمان ثم قال ‏\"‏ لو كان الإيمان عند الثريا لناله رجال  أو رجل  من هؤلاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While we were sitting with the Prophet Surat Al-Jumu'a was revealed to him, and when the Verse, \"And He (Allah) has sent him (Muhammad) also to other (Muslims).....' (62.3) was recited by the Prophet, I said, \"Who are they, O Allah's Apostle?\" The Prophet did not reply till I repeated my question thrice. At that time, Salman Al-Farisi was with us. So Allah's Apostle put his hand on Salman, saying, \"If Faith were at (the place of) Ath-Thuraiya (pleiades, the highest star), even then (some men or man from these people (i.e. Salman's folk) would attain it.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "4962",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن يحيى، عن عبيد بن حنين، أنه سمع ابن عباس  رضى الله عنهما  يحدث أنه قال مكثت سنة أريد أن أسأل عمر بن الخطاب عن آية، فما أستطيع أن أسأله هيبة له، حتى خرج حاجا فخرجت معه فلما رجعت وكنا ببعض الطريق عدل إلى الأراك لحاجة له  قال  فوقفت له حتى فرغ سرت معه فقلت يا أمير المؤمنين من اللتان تظاهرتا على النبي صلى الله عليه وسلم من أزواجه فقال تلك حفصة وعائشة‏.‏ قال فقلت والله إن كنت لأريد أن أسألك عن هذا منذ سنة، فما أستطيع هيبة لك‏.‏ قال فلا تفعل ما ظننت أن عندي من علم فاسألني، فإن كان لي علم خبرتك به  قال  ثم قال عمر والله إن كنا في الجاهلية ما نعد للنساء أمرا، حتى أنزل الله فيهن ما أنزل وقسم لهن ما قسم  قال  فبينا أنا في أمر أتأمره إذ قالت امرأتي لو صنعت كذا وكذا  قال  فقلت لها مالك ولما ها هنا فيما تكلفك في أمر أريده‏.‏ فقالت لي عجبا لك يا ابن الخطاب ما تريد أن تراجع أنت، وإن ابنتك لتراجع رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان‏.‏ فقام عمر فأخذ رداءه مكانه حتى دخل على حفصة فقال لها يا بنية إنك لتراجعين رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان‏.‏ فقالت حفصة والله إنا لنراجعه‏.‏ فقلت‏.‏ تعلمين أني أحذرك عقوبة الله وغضب رسوله صلى الله عليه وسلم يا بنية لا يغرنك هذه التي أعجبها حسنها حب رسول الله صلى الله عليه وسلم إياها  يريد عائشة  قال ثم خرجت حتى دخلت على أم سلمة لقرابتي منها فكلمتها‏.‏ فقالت أم سلمة عجبا لك يا ابن الخطاب دخلت في كل شىء، حتى تبتغي أن تدخل بين رسول الله صلى الله عليه وسلم وأزواجه‏.‏ فأخذتني والله أخذا كسرتني عن بعض ما كنت أجد، فخرجت من عندها، وكان لي صاحب من الأنصار إذا غبت أتاني بالخبر، وإذا غاب كنت أنا آتيه بالخبر، ونحن نتخوف ملكا من ملوك غسان، ذكر لنا أنه يريد أن يسير إلينا، فقد امتلأت صدورنا منه، فإذا صاحبي الأنصاري يدق الباب فقال افتح افتح‏.‏ فقلت جاء الغساني فقال بل أشد من ذلك‏.‏ اعتزل رسول الله صلى الله عليه وسلم أزواجه‏.‏ فقلت رغم أنف حفصة وعائشة‏.‏ فأخذت ثوبي فأخرج حتى جئت فإذا رسول الله صلى الله عليه وسلم في مشربة له يرقى عليها بعجلة، وغلام لرسول الله صلى الله عليه وسلم أسود على رأس الدرجة فقلت له قل هذا عمر بن الخطاب‏.‏ فأذن لي  قال عمر  فقصصت على رسول الله صلى الله عليه وسلم هذا الحديث، فلما بلغت حديث أم سلمة تبسم رسول الله صلى الله عليه وسلم وإنه لعلى حصير ما بينه وبينه شىء، وتحت رأسه وسادة من أدم حشوها ليف، وإن عند رجليه قرظا مصبوبا، وعند رأسه أهب معلقة فرأيت أثر الحصير في جنبه فبكيت فقال ‏\"‏ ما يبكيك ‏\"‏‏.‏ فقلت يا رسول الله إن كسرى وقيصر فيما هما فيه وأنت رسول الله‏.‏ فقال ‏\"‏ أما ترضى أن تكون لهم الدنيا ولنا الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     For the whole year I had the desire to ask `Umar bin Al-Khattab regarding the explanation of a Verse (in Surat Al-Tahrim) but I could not ask him because I respected him very much. When he went to perform the Hajj, I too went along with him. On our return, while we were still on the way home. `Umar went aside to answer the call of nature by the Arak trees. I waited till he finished and then I proceeded with him and asked him. \"O chief of the Believers! Who were the two wives of the Prophet who aided one another against him?\" He said, \"They were Hafsa and `Aisha.\" Then I said to him, \"By Allah, I wanted to ask you about this a year ago, but I could not do so owing to my respect for you.\" `Umar said, \"Do not refrain from asking me. If you think that I have knowledge (about a certain matter), ask me; and if I know (something about it), I will tell you.\" Then `Umar added, \"By Allah, in the Pre-lslamic Period of Ignorance we did not pay attention to women until Allah revealed regarding them what He revealed regarding them and assigned for them what He has assigned. Once while I was thinking over a certain matter, my wife said, \"I recommend that you do so-and-so.\" I said to her, \"What have you got to do with the is matter? Why do you poke your nose in a matter which I want to see fulfilled.?\" She said, How strange you are, O son of Al-Khattab! You don't want to be argued with whereas your daughter, Hafsa surely, argues with Allah's Apostle so much that he remains angry for a full day!\" `Umar then reported; how he at once put on his outer garment and went to Hafsa and said to her, \"O my daughter! Do you argue with Allah's Apostle so that he remains angry the whole day?\" H. afsa said, \"By Allah, we argue with him.\" `Umar said, \"Know that I warn you of Allah's punishment and the anger of Allah's Apostle . . . O my daughter! Don't be betrayed by the one who is proud of her beauty because of the love of Allah's Apostle for her (i.e. `Aisha).\" `Umar addled, \"Then I went out to Um Salama's house who was one of my relatives, and I talked to her. She said, O son of Al-Khattab! It is rather astonishing that you interfere in everything; you even want to interfere between Allah's Apostle and his wives!' By Allah, by her talk she influenced me so much that I lost some of my anger. I left her (and went home). At that time I had a friend from the Ansar who used to bring news (from the Prophet) in case of my absence, and I used to bring him the news if he was absent. In those days we were afraid of one of the kings of Ghassan tribe. We heard that he intended to move and attack us, so fear filled our hearts because of that. (One day) my Ansari friend unexpectedly knocked at my door, and said, \"Open Open!' I said, 'Has the king of Ghassan come?' He said, 'No, but something worse; Allah's Apostle has isolated himself from his wives.' I said, 'Let the nose of `Aisha and Hafsa be stuck to dust (i.e. humiliated)!' Then I put on my clothes and went to Allah's Apostle's residence, and behold, he was staying in an upper room of his to which he ascended by a ladder, and a black slave of Allah's Apostle was (sitting) on the first step. I said to him, 'Say (to the Prophet ) `Umar bin Al-Khattab is here.' Then the Prophet admitted me and I narrated the story to Allah's Apostle. When I reached the story of Um Salama, Allah's Apostle smiled while he was lying on a mat made of palm tree leaves with nothing between him and the mat. Underneath his head there was a leather pillow stuffed with palm fibres, and leaves of a saut tree were piled at his feet, and above his head hung a few water skins. On seeing the marks of the mat imprinted on his side, I wept. He said.' 'Why are you weeping?' I replied, \"O Allah's Apostle! Caesar and Khosrau are leading the life (i.e. Luxurious life) while you, Allah's Apostle though you are, is living in destitute\". The Prophet then replied. 'Won't you be satisfied that they enjoy this world and we the Hereafter?' \"",
      "chain": [
        "30105",
        "20160",
        "20031",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "5177",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني سالم بن عبد الله، أنه سمع عبد الله بن عمر  رضى الله عنهما  يحدث أن عمر بن الخطاب حين تأيمت حفصة بنت عمر من خنيس بن حذافة السهمي  وكان من أصحاب رسول الله صلى الله عليه وسلم فتوفي بالمدينة  فقال عمر بن الخطاب أتيت عثمان بن عفان فعرضت عليه حفصة فقال سأنظر في أمري‏.‏ فلبثت ليالي ثم لقيني فقال قد بدا لي أن لا أتزوج يومي هذا‏.‏ قال عمر فلقيت أبا بكر الصديق فقلت إن شئت زوجتك حفصة بنت عمر‏.‏ فصمت أبو بكر فلم يرجع إلى شيئا، وكنت أوجد عليه مني على عثمان، فلبثت ليالي ثم خطبها رسول الله صلى الله عليه وسلم فأنكحتها إياه، فلقيني أبو بكر فقال لعلك وجدت على حين عرضت على حفصة فلم أرجع إليك شيئا‏.‏ قال عمر قلت نعم‏.‏ قال أبو بكر فإنه لم يمنعني أن أرجع إليك فيما عرضت على إلا أني كنت علمت أن رسول الله صلى الله عليه وسلم قد ذكرها، فلم أكن لأفشي سر رسول الله صلى الله عليه وسلم ولو تركها رسول الله صلى الله عليه وسلم قبلتها‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar bin Al-Khattab said, \"When Hafsa bint `Umar became a widow after the death of (her husband) Khunais bin Hudhafa As-Sahmi who had been one of the companions of the Prophet, and he died at Medina. I went to `Uthman bin `Affan and presented Hafsa (for marriage) to him. He said, \"I will think it over.' I waited for a few days, then he met me and said, 'It seems that it is not possible for me to marry at present.' \" `Umar further said, \"I met Abu Bakr Al-Siddique and said to him, 'If you wish, I will marry my daughter Hafsa to you.\" Abu Bakr kept quiet and did not say anything to me in reply. I became more angry with him than with `Uthman. I waited for a few days and then Allah's Apostle asked for her hand, and I gave her in marriage to him. Afterwards I met Abu Bakr who said, 'Perhaps you became angry with me when you presented Hafsa to me and I did not give you a reply?' I said, 'Yes.' Abu Bakr said, 'Nothing stopped me to respond to your offer except that I knew that Allah's Apostle had mentioned her, and I never wanted to let out the secret of Allah's Apostle. And if Allah's Apostle had refused her, I would have accepted her.' \"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5239",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ المرأة كالضلع، إن أقمتها كسرتها، وإن استمتعت بها استمتعت بها وفيها عوج ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The woman is like a rib; if you try to straighten her, she will break. So if you want to get benefit from her, do so while she still has some crookedness.\"",
      "chain": [
        "30105",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5273",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن يحيى، عن عبيد بن حنين، سمع ابن عباس، عن عمر  رضى الله عنهم  دخل على حفصة فقال يا بنية لا يغرنك هذه التي أعجبها حسنها حب رسول الله صلى الله عليه وسلم إياها  يريد عائشة  فقصصت على رسول الله صلى الله عليه وسلم فتبسم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     that `Umar entered upon Hafsa and said, \"O my daughter! Do not be misled by the manners of her who is proud of her beauty because of the love of Allah's Apostle for her.\" By 'her' he meant `Aisha. `Umar added, \"Then I told that to Allah's Apostle and he smiled (on hearing that).",
      "chain": [
        "30105",
        "20160",
        "20031",
        "11202",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "5352",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وقال الأويسي حدثنا إبراهيم بن سعد، عن شعبة بن الحجاج، عن هشام بن زيد، عن أنس بن مالك، قال عدا يهودي في عهد رسول الله صلى الله عليه وسلم على جارية، فأخذ أوضاحا كانت عليها ورضخ رأسها، فأتى بها أهلها رسول الله صلى الله عليه وسلم وهى في آخر رمق، وقد أصمتت، فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ من قتلك فلان ‏\"‏‏.‏ لغير الذي قتلها، فأشارت برأسها أن لا، قال فقال لرجل آخر غير الذي قتلها، فأشارت أن لا، فقال ‏\"‏ ففلان ‏\"‏‏.‏ لقاتلها فأشارت أن نعم، فأمر به رسول الله صلى الله عليه وسلم فرضخ رأسه بين حجرين‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          During the lifetime of Allah's Apostle a Jew attacked a girl and took      some silver ornaments she was wearing and crushed her head. Her      relative brought her to the Prophet while she was in her last breaths,     and she was unable to speak. Allah's Apostle asked her, \"Who has hit      you? So-and so?\", mentioning somebody other than her murderer. She      moved her head, indicating denial. The Prophet mentioned another      person other than the murderer, and she again moved her head      indicating denial. Then he asked, \"Was it so-and-so?\", mentioning the      name of her killer. She nodded, agreeing. Then Allah's Apostle;      ordered that the head of that Jew be crushed between two stones.",
      "chain": [
        "30105",
        "20150",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "5431",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن محمد بن عمرو بن حلحلة الديلي، عن وهب بن كيسان أبي نعيم، عن عمر بن أبي سلمة  وهو ابن أم سلمة  زوج النبي صلى الله عليه وسلم قال أكلت يوما مع رسول الله صلى الله عليه وسلم طعاما فجعلت آكل من نواحي الصحفة فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ كل مما يليك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al Salama:                     Who was the son of Um Salama, the wife of the Prophet: Once I ate a meal with Allah's Apostle and I was eating from all sides of the dish. So Allah's Apostle said to me, \"Eat of the dish what is nearer to you.\"",
      "chain": [
        "30105",
        "20173",
        "11220",
        "11231"
      ]
    },
    {
      "hadith_no": "5462",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا محمد بن جعفر، عن أبي حازم، عن عبد الله بن أبي قتادة السلمي، عن أبيه، أنه قال كنت يوما جالسا مع رجال من أصحاب النبي صلى الله عليه وسلم في منزل في طريق مكة، ورسول الله صلى الله عليه وسلم نازل أمامنا، والقوم محرمون وأنا غير محرم، فأبصروا حمارا وحشيا وأنا مشغول أخصف نعلي، فلم يؤذنوني له، وأحبوا لو أني أبصرته، فالتفت فأبصرته فقمت إلى الفرس فأسرجته‏.‏ ثم ركبت ونسيت السوط والرمح فقلت لهم ناولوني السوط والرمح‏.‏ فقالوا لا والله لا نعينك عليه بشىء‏.‏ فغضبت فنزلت فأخذتهما، ثم ركبت فشددت على الحمار فعقرته، ثم جئت به وقد مات فوقعوا فيه يأكلونه، ثم إنهم شكوا في أكلهم إياه وهم حرم، فرحنا وخبأت العضد معي، فأدركنا رسول الله صلى الله عليه وسلم فسألناه عن ذلك فقال ‏\"‏ معكم منه شىء ‏\"‏‏.‏ فناولته العضد فأكلها حتى تعرقها، وهو محرم‏.‏ قال ابن جعفر وحدثني زيد بن أسلم عن عطاء بن يسار عن أبي قتادة مثله‏.‏",
      "text_en": " Narrated Abu Qatada:                     Once, while I was sitting with the companions of the Prophet at a station on the road to Mecca and Allah's Apostle was stationing ahead of us and all the people were assuming Ihram while I was not. My companion, saw an onager while I was busy Mending my shoes. They did not Inform me of the onager but they wished that I would see it Suddenly I looked and saw the onager Then I headed towards my horse, saddled it and rode, but I forgot to take the lash and the spear. So I said to them my companions), \"Give me the lash and the spear.\" But they said, \"No, by Allah we will not help you in any way to hunt it ' I got angry, dismounted, took it the spear and the lash), rode (the horse chased the onager and wounded it Then I brought it when it had dyed. My companions started eating of its (cooked) meat, but they suspected that it might be unlawful to eat of its meat while they were in a state of Ihram Then I proceeded further and I kept one of its forelegs with me. When we met Allah's Apostle we asked him about that. He said, \"Have you some of its meat with you?\" I gave him that foreleg and he ate the meat till he stripped the bone of its flesh although he was in a state of Ihram.",
      "chain": [
        "30105",
        "20173",
        "11349"
      ]
    },
    {
      "hadith_no": "5495",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر بن أبي طالب  رضى الله عنهما  قال رأيت النبي صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far bin Abi Talib:                     I saw Allah's Apostle eating fresh dates with snake cucumber.",
      "chain": [
        "30105",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "hadith_no": "5598",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، عن ميمونة  رضى الله عنهم  قالت سئل النبي صلى الله عليه وسلم عن فأرة سقطت في سمن فقال ‏\"‏ ألقوها وما حولها وكلوه ‏\"‏‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet was asked about a mouse that had fallen into butter-fat (and died). He said, \"Throw away the mouse and the portion of butter-fat around it, and eat the rest.\"",
      "chain": [
        "30105",
        "20001",
        "11013",
        "11004",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "5777",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني أبو سلمة بن عبد الرحمن، وغيره، أن أبا هريرة  رضى الله عنه  قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا عدوى ولا صفر ولا هامة ‏\"‏‏.‏ فقال أعرابي يا رسول الله فما بال إبلي تكون في الرمل كأنها الظباء فيأتي البعير الأجرب فيدخل بينها فيجربها‏.‏ فقال ‏\"‏ فمن أعدى الأول ‏\"‏‏.‏ رواه الزهري عن أبي سلمة وسنان بن أبي سنان‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, 'There is no 'Adha (no disease is conveyed from the sick to the healthy without Allah's permission), nor Safar, nor Hama.\" A bedouin stood up and said, \"Then what about my camels? They are like deer on the sand, but when a mangy camel comes and mixes with them, they all get infected with mangy.\" The Prophet said, \"Then who conveyed the (mange) disease to the first one?\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5807",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا سليمان، عن يونس، عن ابن شهاب، عن عروة بن الزبير، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا أوى إلى فراشه نفث في كفيه بقل هو الله أحد وبالمعوذتين جميعا، ثم يمسح بهما وجهه، وما بلغت يداه من جسده‏.‏ قالت عائشة فلما اشتكى كان يأمرني أن أفعل ذلك به‏.‏ قال يونس كنت أرى ابن شهاب يصنع ذلك إذا أتى إلى فراشه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle went to bed, he used to recite Surat-al-Ikhlas, Surat-al-Falaq and Surat-an- Nas and then blow on his palms and pass them over his face and those parts of his body that his hands could reach. And when he fell ill, he used to order me to do like that for him.",
      "chain": [
        "30105",
        "20160",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5823",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا الموبقات الشرك بالله، والسحر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Avoid the Mubiqat, i.e., shirk and witchcraft.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6093",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، عن عروة بن الزبير، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت دخل رهط من اليهود على رسول الله صلى الله عليه وسلم فقالوا السام عليكم‏.‏ قالت عائشة ففهمتها فقلت وعليكم السام واللعنة‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ مهلا يا عائشة، إن الله يحب الرفق في الأمر كله ‏\"‏‏.‏ فقلت يا رسول الله ولم تسمع ما قالوا قال رسول الله صلى الله عليه وسلم ‏\"‏ قد قلت وعليكم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) A group of Jews entered upon the Prophet and said, \"As-Samu-Alaikum.\" (i.e. death be upon you). I understood it and said, \"Wa-Alaikum As-Samu wal-la'n. (death and the curse of Allah be Upon you).\" Allah's Apostle said \"Be calm, O `Aisha! Allah loves that on, should be kind and lenient in all matters.\" I said, \"O Allah's Apostle! Haven't you heard what they (the Jews) have said?\" Allah's Apostle said \"I have (already) said (to them) \"And upon you ! \"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6138",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن أخي ابن شهاب، عن ابن شهاب، عن سالم بن عبد الله، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل أمتي معافى إلا المجاهرين، وإن من المجانة أن يعمل الرجل بالليل عملا، ثم يصبح وقد ستره الله، فيقول يا فلان عملت البارحة كذا وكذا، وقد بات يستره ربه ويصبح يكشف ستر الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying. \"All the sins of my followers will be forgiven except those of the Mujahirin (those who commit a sin openly or disclose their sins to the people). An example of such disclosure is that a person commits a sin at night and though Allah screens it from the public, then he comes in the morning, and says, 'O so-and-so, I did such-and-such (evil) deed yesterday,' though he spent his night screened by his Lord (none knowing about his sin) and in the morning he removes Allah's screen from himself.\"",
      "chain": [
        "30105",
        "20150",
        "20176",
        "11013",
        "11011",
        "13"
      ]
    },
    {
      "hadith_no": "6155",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت أمشي مع رسول الله صلى الله عليه وسلم وعليه برد نجراني غليظ الحاشية، فأدركه أعرابي فجبذ بردائه جبذة شديدة  قال أنس فنظرت إلى صفحة عاتق النبي صلى الله عليه وسلم وقد أثرت بها حاشية الرداء من شدة جبذته  ثم قال يا محمد مر لي من مال الله الذي عندك‏.‏ فالتفت إليه فضحك، ثم أمر له بعطاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While I was going along with Allah's Apostle who was wearing a Najrani Burd (sheet) with a thick border, a bedouin overtook the Prophet and pulled his Rida' (sheet) forcibly. I looked at the side of the shoulder of the Prophet and noticed that the edge of the Rida' had left a mark on it because of the violence of his pull. The bedouin said, \"O Muhammad! Order for me some of Allah's property which you have.\" The Prophet turned towards him, (smiled) and ordered that he be given something.",
      "chain": [
        "30105",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6394",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا مالك، عن ابن شهاب، عن أبي عبد الله الأغر، وأبي، سلمة بن عبد الرحمن عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يتنزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر يقول من يدعوني فأستجيب له، من يسألني فأعطيه، ومن يستغفرني فأغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When it is the last third of the night, our Lord, the Blessed, the Superior, descends every night to the heaven of the world and says, 'Is there anyone who invokes Me (demand anything from Me), that I may respond to his invocation; Is there anyone who asks Me for something that I may give (it to) him; Is there anyone who asks My forgiveness that I may forgive him?' \"",
      "chain": [
        "30105",
        "20001",
        "11013",
        "11171",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6415",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "قال أبو عبد الله وقال الأويسي حدثني محمد بن جعفر، عن يحيى بن سعيد، وشريك، سمعا أنسا، عن النبي صلى الله عليه وسلم رفع يديه حتى رأيت بياض إبطيه‏.‏",
      "text_en": "",
      "chain": [
        "30184",
        "30105",
        "20173",
        "11062",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "6428",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني محمود بن الربيع، وهو الذي مج رسول الله صلى الله عليه وسلم في وجهه وهو غلام من بئرهم‏.‏",
      "text_en": " Narrated Mahmud bin Ar-Rabi:                     On whose face Allah's Apostle had thrown water from his mouth, the water having been taken from their well while he was still a young boy (who has not yet attained the age of puberty).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "6515",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو أن لابن آدم واديا من ذهب أحب أن يكون له واديان، ولن يملأ فاه إلا التراب، ويتوب الله على من تاب ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"If Adam's son had a valley full of gold, he would like to have two valleys, for nothing fills his mouth except dust. And Allah forgives him who repents to Him.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "6536",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثني ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة، أنها قالت لعروة ابن أختي إن كنا لننظر إلى الهلال ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت ما كان يعيشكم قالت الأسودان التمر والماء إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كان لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من أبياتهم، فيسقيناه‏.‏",
      "text_en": " Narrated `Aisha:                     that she said to `Urwa, \"O, the son of my sister! We used to see three crescents in two months, and no fire used to be made in the houses of Allah's Apostle (i.e. nothing used to be cooked).\" `Urwa said, \"What used to sustain you?\" `Aisha said, \"The two black things i.e. dates and water, except that Allah's Apostle had neighbors from the Ansar who had some milch she-camels, and they used to give the Prophet some milk from their house, and he used to make us drink it.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6541",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن موسى بن عقبة، عن أبي سلمة بن عبد الرحمن، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سددوا وقاربوا، واعلموا أن لن يدخل أحدكم عمله الجنة، وأن أحب الأعمال أدومها إلى الله، وإن قل ‏\"‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"Do good deeds properly, sincerely and moderately and know that your deeds will not make you enter Paradise, and that the most beloved deed to Allah's is the most regular and constant even though it were little.\"",
      "chain": [
        "30105",
        "20160",
        "11106",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "6553",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان يؤمن بالله واليوم الآخر فليقل خيرا، أو ليصمت، ومن كان يؤمن بالله واليوم الآخر فلا يؤذ جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever believes in Allah and the Last Day should talk what is good or keep quiet, and whoever believes in Allah and the Last Day should not hurt (or insult) his neighbor; and whoever believes in Allah and the Last Day, should entertain his guest generously.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6596",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، والأعرج، أنهما حدثاه أن أبا هريرة قال استب رجلان، رجل من المسلمين ورجل من اليهود فقال المسلم والذي اصطفى محمدا على العالمين‏.‏ فقال اليهودي والذي اصطفى موسى على العالمين، قال فغضب المسلم عند ذلك، فلطم وجه اليهودي، فذهب اليهودي إلى رسول الله صلى الله عليه وسلم فأخبره بما كان من أمره وأمر المسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تخيروني على موسى، فإن الناس يصعقون يوم القيامة، فأكون في أول من يفيق، فإذا موسى باطش بجانب العرش، فلا أدري أكان موسى فيمن صعق فأفاق قبلي، أو كان ممن استثنى الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Two men, a Muslim and a Jew, abused each other. The Muslim said, \"By Him Who gave superiority to Muhammad over all the people.\" On that, the Jew said, \"By Him Who gave superiority to Moses over all the people.\" The Muslim became furious at that and slapped the Jew in the face. The Jew went to Allah's Apostle and informed him of what had happened between him and the Muslim. Allah's Apostle said, \"Don't give me superiority over Moses, for the people will fall unconscious on the Day of Resurrection and I will be the first to gain consciousness, and behold ! Moses will be there holding the side of Allah's Throne. I will not know whether Moses has been among those people who have become unconscious and then has regained consciousness before me, or has been among those exempted by Allah from falling unconscious.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6611",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يعرق الناس يوم القيامة حتى يذهب عرقهم في الأرض سبعين ذراعا، ويلجمهم حتى يبلغ آذانهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The people will sweat so profusely on the Day of Resurrection that their sweat will sink seventy cubits deep into the earth, and it will rise up till it reaches the people's mouths and ears.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6743",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا الأويسي، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا حجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله، وكل حدثني طائفة من الحديث  فقام النبي صلى الله عليه وسلم فاستعذر من عبد الله بن أبى، فقام أسيد بن حضير فقال لسعد بن عبادة لعمر الله لنقتلنه‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah narrating from `Aisha, the wife of the Prophet, the story about the liars who said what they said about her and how Allah revealed her innocence afterwards. Each one of the above four narrators narrated to me a portion of her narration. (It was said in it), \"The Prophet stood up, saying, 'Is there anyone who can relieve me from `Abdullah bin Ubai?' On that, Usaid bin Hudair got up and said to Sa`d bin 'Ubada, La`Amrullahi (By the Eternity of Allah), we will kill him!' \"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6765",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن حميد، عن أنس، قال آلى رسول الله صلى الله عليه وسلم من نسائه، وكانت انفكت رجله، فأقام في مشربة تسعا وعشرين ليلة، ثم نزل فقالوا يا رسول الله آليت شهرا‏.‏ فقال ‏{‏إن الشهر يكون تسعا وعشرين‏}‏",
      "text_en": " Narrated Anas:                     Allah's Apostle took an oath for abstention from h is wives (for one month), and during those days he had a sprain in his foot. He stayed in a Mashrubah (an upper room) for twenty-nine nights and then came down. Then the people said, \"O Allah's Apostle! You took an oath for abstention (from your wives) for one month.\" On that he said, \"A month can be of twenty-nine days.\"",
      "chain": [
        "30105",
        "20160",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "6918",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس، قال كنت أقرئ رجالا من المهاجرين منهم عبد الرحمن بن عوف، فبينما أنا في منزله بمنى، وهو عند عمر بن الخطاب في آخر حجة حجها، إذ رجع إلى عبد الرحمن فقال لو رأيت رجلا أتى أمير المؤمنين اليوم فقال يا أمير المؤمنين هل لك في فلان يقول لو قد مات عمر لقد بايعت فلانا، فوالله ما كانت بيعة أبي بكر إلا فلتة، فتمت‏.‏ فغضب عمر ثم قال إني إن شاء الله لقائم العشية في الناس، فمحذرهم هؤلاء الذين يريدون أن يغصبوهم أمورهم‏.‏ قال عبد الرحمن فقلت يا أمير المؤمنين لا تفعل فإن الموسم يجمع رعاع الناس وغوغاءهم، فإنهم هم الذين يغلبون على قربك حين تقوم في الناس، وأنا أخشى أن تقوم فتقول مقالة يطيرها عنك كل مطير، وأن لا يعوها، وأن لا يضعوها على مواضعها، فأمهل حتى تقدم المدينة فإنها دار الهجرة والسنة، فتخلص بأهل الفقه وأشراف الناس، فتقول ما قلت متمكنا، فيعي أهل العلم مقالتك، ويضعونها على مواضعها‏.‏ فقال عمر أما والله إن شاء الله لأقومن بذلك أول مقام أقومه بالمدينة‏.‏ قال ابن عباس فقدمنا المدينة في عقب ذي الحجة، فلما كان يوم الجمعة عجلنا الرواح حين زاغت الشمس، حتى أجد سعيد بن زيد بن عمرو بن نفيل جالسا إلى ركن المنبر، فجلست حوله تمس ركبتي ركبته، فلم أنشب أن خرج عمر بن الخطاب، فلما رأيته مقبلا قلت لسعيد بن زيد بن عمرو بن نفيل، ليقولن العشية مقالة لم يقلها منذ استخلف، فأنكر على وقال ما عسيت أن يقول ما لم يقل‏.‏ قبله فجلس عمر على المنبر، فلما سكت المؤذنون قام فأثنى على الله بما هو أهله قال أما بعد فإني قائل لكم مقالة قد قدر لي أن أقولها، لا أدري لعلها بين يدى أجلي، فمن عقلها ووعاها فليحدث بها حيث انتهت به راحلته، ومن خشي أن لا يعقلها فلا أحل لأحد أن يكذب على، إن الله بعث محمدا صلى الله عليه وسلم بالحق وأنزل عليه الكتاب فكان مما أنزل الله آية الرجم، فقرأناها وعقلناها ووعيناها، رجم رسول الله صلى الله عليه وسلم ورجمنا بعده، فأخشى إن طال بالناس زمان أن يقول قائل والله ما نجد آية الرجم في كتاب الله، فيضلوا بترك فريضة أنزلها الله، والرجم في كتاب الله حق على من زنى إذا أحصن من الرجال والنساء، إذا قامت البينة أو كان الحبل أو الاعتراف، ثم إنا كنا نقرأ فيما نقرأ من كتاب الله أن لا ترغبوا عن آبائكم، فإنه كفر بكم أن ترغبوا عن آبائكم، أو إن كفرا بكم أن ترغبوا عن آبائكم، ألا ثم إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تطروني كما أطري عيسى ابن مريم وقولوا عبد الله ورسوله ‏\"‏‏.‏ ثم إنه بلغني أن قائلا منكم يقول والله لو مات عمر بايعت فلانا‏.‏ فلا يغترن امرؤ أن يقول إنما كانت بيعة أبي بكر فلتة وتمت ألا وإنها قد كانت كذلك ولكن الله وقى شرها، وليس منكم من تقطع الأعناق إليه مثل أبي بكر، من بايع رجلا عن غير مشورة من المسلمين فلا يبايع هو ولا الذي بايعه تغرة أن يقتلا، وإنه قد كان من خبرنا حين توفى الله نبيه صلى الله عليه وسلم إلا أن الأنصار خالفونا واجتمعوا بأسرهم في سقيفة بني ساعدة، وخالف عنا علي والزبير ومن معهما، واجتمع المهاجرون إلى أبي بكر فقلت لأبي بكر يا أبا بكر انطلق بنا إلى إخواننا هؤلاء من الأنصار‏.‏ فانطلقنا نريدهم فلما دنونا منهم لقينا منهم رجلان صالحان، فذكرا ما تمالى عليه القوم فقالا أين تريدون يا معشر المهاجرين فقلنا نريد إخواننا هؤلاء من الأنصار‏.‏ فقالا لا عليكم أن لا تقربوهم اقضوا أمركم‏.‏ فقلت والله لنأتينهم‏.‏ فانطلقنا حتى أتيناهم في سقيفة بني ساعدة، فإذا رجل مزمل بين ظهرانيهم فقلت من هذا فقالوا هذا سعد بن عبادة‏.‏ فقلت ما له قالوا يوعك‏.‏ فلما جلسنا قليلا تشهد خطيبهم، فأثنى على الله بما هو أهله ثم قال أما بعد فنحن أنصار الله وكتيبة الإسلام، وأنتم معشر المهاجرين رهط، وقد دفت دافة من قومكم، فإذا هم يريدون أن يختزلونا من أصلنا وأن يحضنونا من الأمر‏.‏ فلما سكت أردت أن أتكلم وكنت زورت مقالة أعجبتني أريد أن أقدمها بين يدى أبي بكر، وكنت أداري منه بعض الحد، فلما أردت أن أتكلم قال أبو بكر على رسلك‏.‏ فكرهت أن أغضبه، فتكلم أبو بكر فكان هو أحلم مني وأوقر، والله ما ترك من كلمة أعجبتني في تزويري إلا قال في بديهته مثلها أو أفضل منها حتى سكت فقال ما ذكرتم فيكم من خير فأنتم له أهل، ولن يعرف هذا الأمر إلا لهذا الحى من قريش، هم أوسط العرب نسبا ودارا، وقد رضيت لكم أحد هذين الرجلين، فبايعوا أيهما شئتم‏.‏ فأخذ بيدي وبيد أبي عبيدة بن الجراح وهو جالس بيننا، فلم أكره مما قال غيرها، كان والله أن أقدم فتضرب عنقي لا يقربني ذلك من إثم، أحب إلى من أن أتأمر على قوم فيهم أبو بكر، اللهم إلا أن تسول إلى نفسي عند الموت شيئا لا أجده الآن‏.‏ فقال قائل من الأنصار أنا جذيلها المحكك، وعذيقها المرجب، منا أمير، ومنكم أمير، يا معشر قريش‏.‏ فكثر اللغط، وارتفعت الأصوات حتى فرقت من الاختلاف‏.‏ فقلت ابسط يدك يا أبا بكر‏.‏ فبسط يده فبايعته، وبايعه المهاجرون، ثم بايعته الأنصار، ونزونا على سعد بن عبادة فقال قائل منهم قتلتم سعد بن عبادة‏.‏ فقلت قتل الله سعد بن عبادة‏.‏ قال عمر وإنا والله ما وجدنا فيما حضرنا من أمر أقوى من مبايعة أبي بكر خشينا إن فارقنا القوم ولم تكن بيعة أن يبايعوا رجلا منهم بعدنا، فإما بايعناهم على ما لا نرضى، وإما نخالفهم فيكون فساد، فمن بايع رجلا على غير مشورة من المسلمين فلا يتابع هو ولا الذي بايعه تغرة أن يقتلا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I used to teach (the Qur'an to) some people of the Muhajirln (emigrants), among whom there was `Abdur Rahman bin `Auf. While I was in his house at Mina, and he was with `Umar bin Al-Khattab during `Umar's last Hajj, `Abdur-Rahman came to me and said, \"Would that you had seen the man who came today to the Chief of the Believers (`Umar), saying, 'O Chief of the Believers! What do you think about so-and-so who says, 'If `Umar should die, I will give the pledge of allegiance to such-andsuch person, as by Allah, the pledge of allegiance to Abu Bakr was nothing but a prompt sudden action which got established afterwards.' `Umar became angry and then said, 'Allah willing, I will stand before the people tonight and warn them against those people who want to deprive the others of their rights (the question of rulership). `Abdur-Rahman said, \"I said, 'O Chief of the believers! Do not do that, for the season of Hajj gathers the riff-raff and the rubble, and it will be they who will gather around you when you stand to address the people. And I am afraid that you will get up and say something, and some people will spread your statement and may not say what you have actually said and may not understand its meaning, and may interpret it incorrectly, so you should wait till you reach Medina, as it is the place of emigration and the place of Prophet's Traditions, and there you can come in touch with the learned and noble people, and tell them your ideas with confidence; and the learned people will understand your statement and put it in its proper place.' On that, `Umar said, 'By Allah! Allah willing, I will do this in the first speech I will deliver before the people in Medina.\" Ibn `Abbas added: We reached Medina by the end of the month of Dhul-Hijja, and when it was Friday, we went quickly (to the mosque) as soon as the sun had declined, and I saw Sa`id bin Zaid bin `Amr bin Nufail sitting at the corner of the pulpit, and I too sat close to him so that my knee was touching his knee, and after a short while `Umar bin Al-Khattab came out, and when I saw him coming towards us, I said to Sa`id bin Zaid bin `Amr bin Nufail \"Today `Umar will say such a thing as he has never said since he was chosen as Caliph.\" Sa`id denied my statement with astonishment and said, \"What thing do you expect `Umar to say the like of which he has never said before?\" In the meantime, `Umar sat on the pulpit and when the callmakers for the prayer had finished their call, `Umar stood up, and having glorified and praised Allah as He deserved, he said, \"Now then, I am going to tell you something which (Allah) has written for me to say. I do not know; perhaps it portends my death, so whoever understands and remembers it, must narrate it to the others wherever his mount takes him, but if somebody is afraid that he does not understand it, then it is unlawful for him to tell lies about me. Allah sent Muhammad with the Truth and revealed the Holy Book to him, and among what Allah revealed, was the Verse of the Rajam (the stoning of married person (male & female) who commits illegal sexual intercourse, and we did recite this Verse and understood and memorized it. Allah's Apostle did carry out the punishment of stoning and so did we after him. I am afraid that after a long time has passed, somebody will say, 'By Allah, we do not find the Verse of the Rajam in Allah's Book,' and thus they will go astray by leaving an obligation which Allah has revealed. And the punishment of the Rajam is to be inflicted to any married person (male & female), who commits illegal sexual intercourse, if the required evidence is available or there is conception or confession. And then we used to recite among the Verses in Allah's Book: 'O people! Do not claim to be the offspring of other than your fathers, as it is disbelief (unthankfulness) on your part that you claim to be the offspring of other than your real father.' Then Allah's Apostle said, 'Do not praise me excessively as Jesus, son of Marry was praised, but call me Allah's Slave and His Apostles.' (O people!) I have been informed that a speaker amongst you says, 'By Allah, if `Umar should die, I will give the pledge of allegiance to such-and-such person.' One should not deceive oneself by saying that the pledge of allegiance given to Abu Bakr was given suddenly and it was successful. No doubt, it was like that, but Allah saved (the people) from its evil, and there is none among you who has the qualities of Abu Bakr. Remember that whoever gives the pledge of allegiance to anybody among you without consulting the other Muslims, neither that person, nor the person to whom the pledge of allegiance was given, are to be supported, lest they both should be killed. And no doubt after the death of the Prophet we were informed that the Ansar disagreed with us and gathered in the shed of Bani Sa`da. `Ali and Zubair and whoever was with them, opposed us, while the emigrants gathered with Abu Bakr. I said to Abu Bakr, 'Let's go to these Ansari brothers of ours.' So we set out seeking them, and when we approached them, two pious men of theirs met us and informed us of the final decision of the Ansar, and said, 'O group of Muhajirin (emigrants) ! Where are you going?' We replied, 'We are going to these Ansari brothers of ours.' They said to us, 'You shouldn't go near them. Carry out whatever we have already decided.' I said, 'By Allah, we will go to them.' And so we proceeded until we reached them at the shed of Bani Sa`da. Behold! There was a man sitting amongst them and wrapped in something. I asked, 'Who is that man?' They said, 'He is Sa`d bin 'Ubada.' I asked, 'What is wrong with him?' They said, 'He is sick.' After we sat for a while, the Ansar's speaker said, 'None has the right to be worshipped but Allah,' and praising Allah as He deserved, he added, 'To proceed, we are Allah's Ansar (helpers) and the majority of the Muslim army, while you, the emigrants, are a small group and some people among you came with the intention of preventing us from practicing this matter (of caliphate) and depriving us of it.' When the speaker had finished, I intended to speak as I had prepared a speech which I liked and which I wanted to deliver in the presence of Abu Bakr, and I used to avoid provoking him. So, when I wanted to speak, Abu Bakr said, 'Wait a while.' I disliked to make him angry. So Abu Bakr himself gave a speech, and he was wiser and more patient than I. By Allah, he never missed a sentence that I liked in my own prepared speech, but he said the like of it or better than it spontaneously. After a pause he said, 'O Ansar! You deserve all (the qualities that you have attributed to yourselves, but this question (of Caliphate) is only for the Quraish as they are the best of the Arabs as regards descent and home, and I am pleased to suggest that you choose either of these two men, so take the oath of allegiance to either of them as you wish. And then Abu Bakr held my hand and Abu Ubada bin `Abdullah's hand who was sitting amongst us. I hated nothing of what he had said except that proposal, for by Allah, I would rather have my neck chopped off as expiator for a sin than become the ruler of a nation, one of whose members is Abu Bakr, unless at the time of my death my own-self suggests something I don't feel at present.' And then one of the Ansar said, 'I am the pillar on which the camel with a skin disease (eczema) rubs itself to satisfy the itching (i.e., I am a noble), and I am as a high class palm tree! O Quraish. There should be one ruler from us and one from you.' Then there was a hue and cry among the gathering and their voices rose so that I was afraid there might be great disagreement, so I said, 'O Abu Bakr! Hold your hand out.' He held his hand out and I pledged allegiance to him, and then all the emigrants gave the Pledge of allegiance and so did the Ansar afterwards. And so we became victorious over Sa`d bin Ubada (whom Al-Ansar wanted to make a ruler). One of the Ansar said, 'You have killed Sa`d bin Ubada.' I replied, 'Allah has killed Sa`d bin Ubada.' `Umar added, \"By Allah, apart from the great tragedy that had happened to us (i.e. the death of the Prophet), there was no greater problem than the allegiance pledged to Abu Bakr because we were afraid that if we left the people, they might give the Pledge of allegiance after us to one of their men, in which case we would have given them our consent for something against our real wish, or would have opposed them and caused great trouble. So if any person gives the Pledge of allegiance to somebody (to become a Caliph) without consulting the other Muslims, then the one he has selected should not be granted allegiance, lest both of them should be killed.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "6942",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏‏.‏ قالوا يا رسول الله وما هن قال ‏\"‏ الشرك بالله، والسحر، وقتل النفس التي حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات المؤمنات الغافلات ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Avoid the seven great destructive sins.\" They (the people!) asked, \"O Allah's Apostle! What are they?\" He said, \"To join partners in worship with Allah; to practice sorcery; to kill the life which Allah has forbidden except for a just cause (according to Islamic law); to eat up usury (Riba), to eat up the property of an orphan; to give one's back to the enemy and fleeing from the battle-field at the time of fighting and to accuse chaste women who never even think of anything touching chastity and are good believers.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7030",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  قال بينما نحن في المسجد إذ خرج علينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ انطلقوا إلى يهود ‏\"‏‏.‏ فخرجنا معه حتى جئنا بيت المدراس فقام النبي صلى الله عليه وسلم فناداهم ‏\"‏ يا معشر يهود أسلموا تسلموا ‏\"‏‏.‏ فقالوا قد بلغت يا أبا القاسم‏.‏ فقال ‏\"‏ ذلك أريد ‏\"‏، ثم قالها الثانية‏.‏ فقالوا قد بلغت يا أبا القاسم‏.‏ ثم قال الثالثة فقال ‏\"‏ اعلموا أن الأرض لله ورسوله، وإني أريد أن أجليكم، فمن وجد منكم بماله شيئا فليبعه، وإلا فاعلموا أنما الأرض لله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While we were in the mosque, Allah's Apostle came out to us and said, \"Let us proceed to the Jews.\" So we went along with him till we reached Bait-al-Midras (a place where the Torah used to be recited and all the Jews of the town used to gather). The Prophet stood up and addressed them, \"O Assembly of Jews! Embrace Islam and you will be safe!\" The Jews replied, \"O Aba-l-Qasim! You have conveyed Allah's message to us.\" The Prophet said, \"That is what I want (from you).\" He repeated his first statement for the second time, and they said, \"You have conveyed Allah's message, O Aba-l- Qasim.\" Then he said it for the third time and added, \"You should Know that the earth belongs to Allah and His Apostle, and I want to exile you fro,,, this land, so whoever among you owns some property, can sell it, otherwise you should know that the Earth belongs to Allah and His Apostle.\" (See Hadith No. 392, Vol. 4)",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7202",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني سليمان، عن ثور، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى يخرج رجل من قحطان يسوق الناس بعصاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established till a man from Qahtan appears, driving the people with his stick.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7211",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح الدجال، ولها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate (guarding them).",
      "chain": [
        "30105",
        "20150",
        "11063",
        "3229"
      ]
    },
    {
      "hadith_no": "7214",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم، عن صالح، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر  رضى الله عنهما  قال قام رسول الله صلى الله عليه وسلم في الناس فأثنى على الله بما هو أهله ثم ذكر الدجال فقال ‏\"‏ إني لأنذركموه، وما من نبي إلا وقد أنذره قومه، ولكني سأقول لكم فيه قولا لم يقله نبي لقومه، إنه أعور وإن الله ليس بأعور ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle stood up amongst the people and then praised and glorified Allah as He deserved and then he mentioned Ad-Dajjal, saying, \"I warn you of him, and there was no prophet but warned his followers of him; but I will tell you something about him which no prophet has told his followers: Ad- Dajjal is one-eyed whereas Allah is not.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7216",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، عن عروة، أن عائشة  رضى الله عنها  قالت سمعت رسول الله صلى الله عليه وسلم يستعيذ في صلاته من فتنة الدجال‏.‏",
      "text_en": " Narrated `Aisha:                     I heard Allah's Apostle in his prayer, seeking refuge with Allah from the afflictions of Ad-Dajjal.",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7259",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم، عن ابن شهاب، عن علي بن حسين، أن النبي صلى الله عليه وسلم أتته صفية بنت حيى فلما رجعت انطلق معها، فمر به رجلان من الأنصار فدعاهما فقال ‏\"‏ إنما هي صفية ‏\"‏‏.‏ قالا سبحان الله‏.‏ قال ‏\"‏ إن الشيطان يجري من ابن آدم مجرى الدم ‏\"‏‏.‏ رواه شعيب وابن مسافر وابن أبي عتيق وإسحاق بن يحيى عن الزهري عن علي  يعني ابن حسين  عن صفية عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Ali bin Husain:                     Safiya bint (daughter of) Huyai came to the Prophet (in the mosque), and when she returned (home), the Prophet accompanied her. It happened that two men from the Ansar passed by them and the Prophet called them saying, \"She is Safiya!\" those two men said, \"Subhan Allah!\" The Prophet said, \"Satan circulates in the human body as blood does.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "7268",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب ابنة أبي سلمة، أخبرته أن أم سلمة زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته فخرج إليهم فقال ‏\"‏ إنما أنا بشر، وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صادق فأقضي له بذلك، فمن قضيت له بحق مسلم، فإنما هي قطعة من النار، فليأخذها أو ليتركها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle heard some people quarreling at the door of his dwelling, so he went out to them and said, \"I am only a human being, and litigants with cases of dispute come to me, and someone of you may happen to be more eloquent (in presenting his case) than the other, whereby I may consider that he is truthful and pass a judgment in his favor. If ever I pass a judgment in favor of somebody whereby he takes a Muslim's right unjustly, then whatever he takes is nothing but a piece of Fire, and it is up to him to take or leave.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "7306",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت النبي صلى الله عليه وسلم امرأة فكلمته في شىء فأمرها أن ترجع إليه، قالت يا رسول الله أرأيت إن جئت ولم أجدك، كأنها تريد الموت، قال ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet and spoke to him about something and he told her to return to him. She said, \"O Allah's Apostle! If I come and do not find you?\" (As if she meant, \"...if you die?\") The Prophet said, \"If you should not find me, then go to Abu Bakr.\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "7349",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن يحيى، عن عبيد بن حنين، سمع ابن عباس، عن عمر  رضى الله عنهم  قال جئت فإذا رسول الله صلى الله عليه وسلم في مشربة له، وغلام لرسول الله صلى الله عليه وسلم أسود على رأس الدرجة فقلت قل هذا عمر بن الخطاب فأذن لي‏.‏",
      "text_en": " Narrated `Umar:                     I came and behold, Allah's Apostle was staying on a Mashroba (attic room) and a black slave of Allah's Apostle was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- Khattab (asking for permission to enter).\" Then he admitted me.",
      "chain": [
        "30105",
        "20160",
        "20031",
        "11202",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "7359",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بعثت بجوامع الكلم، ونصرت بالرعب، وبينا أنا نائم رأيتني أتيت بمفاتيح خزائن الأرض، فوضعت في يدي ‏\"‏‏.‏ قال أبو هريرة فقد ذهب رسول الله صلى الله عليه وسلم وأنتم تلغثونها أو ترغثونها، أو كلمة تشبهها‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     Abu Huraira said that Allah's Apostle said, \"I have been sent with 'Jawami-al-Kalim ' (the shortest expression with the widest meaning) and have been made victorious with awe (cast in my enemy's hearts), and while I was sleeping, I saw that the keys of the treasures of the world were placed in my hand.\" Abu Huraira added: Allah's Apostle has gone, and you people are utilizing those treasures, or digging those treasures out.\" or said a similar sentence.",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "7360",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من الأنبياء نبي إلا أعطي من الآيات ما مثله أومن  أو آمن  عليه البشر، وإنما كان الذي أوتيت وحيا أوحاه الله إلى، فأرجو أني أكثرهم تابعا يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There was no prophet among the prophets but was given miracles because of which people had security or had belief, but what I was given was the Divine Inspiration which Allah revealed to me. So I hope that my followers will be more than those of any other prophet on the Day of Resurrection.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7457",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا الأويسي، حدثنا إبراهيم، عن صالح، عن ابن شهاب، حدثني عروة، وابن المسيب، وعلقمة بن وقاص، وعبيد الله، عن عائشة  رضى الله عنها  حين قال لها أهل الإفك قالت ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يسألهما، وهو يستشيرهما في فراق أهله، فأما أسامة فأشار بالذي يعلم من براءة أهله، وأما علي فقال لم يضيق الله عليك، والنساء سواها كثير، وسل الجارية تصدقك‏.‏ فقال ‏\"‏ هل رأيت من شىء يريبك ‏\"‏‏.‏ قالت ما رأيت أمرا أكثر من أنها جارية حديثة السن تنام عن عجين أهلها فتأتي الداجن فتأكله‏.‏ فقام على المنبر فقال ‏\"‏ يا معشر المسلمين من يعذرني من رجل بلغني أذاه في أهلي، والله ما علمت على أهلي إلا خيرا ‏\"‏‏.‏ فذكر براءة عائشة‏.‏ وقال أبو أسامة عن هشام‏.‏",
      "text_en": " Narrated `Aisha:                     After the slanderers had given a forged statement against her, Allah's Apostle called `Ali bin Abi Talib and Usama bin Zaid when the Divine Inspiration was delayed. He wanted to ask them and consult them about the question of divorcing me. Usama gave his evidence that was based on what he knew about my innocence, but `Ali said, \"Allah has not put restrictions on you and there are many women other than her. Furthermore you may ask the slave girl who will tell you the truth.\" So the Prophet asked Barira (my salve girl), \"Have you seen anything that may arouse your suspicion?\" She replied, \"I have not seen anything more than that she is a little girl who sleeps, leaving the dough of her family (unguarded) that the domestic goats come and eat it.\" Then the Prophet stood on the pulpit and said, \"O Muslims! Who will help me against the man who has harmed me by slandering my wife? By Allah, I know nothing about my family except good.\" The narrator added: Then the Prophet mentioned the innocence of `Aisha. (See Hadith No. 274, Vol. 6)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "11002",
        "11042",
        "11201",
        "53"
      ]
    },
    {
      "hadith_no": "7482",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني مالك، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا جاء أحدكم فراشه فلينفضه بصنفة ثوبه ثلاث مرات، وليقل باسمك رب وضعت جنبي وبك أرفعه، إن أمسكت نفسي فاغفر لها، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين ‏\"‏‏.‏ تابعه يحيى وبشر بن المفضل عن عبيد الله عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏ وزاد زهير وأبو ضمرة وإسماعيل بن زكرياء عن عبيد الله عن سعيد عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏ ورواه ابن عجلان عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When anyone of you goes to bed, he should dust it off thrice with the edge of his garment, and say: Bismika Rabbi Wada`tu janbi, wa bika arfa'hu. In amsakta nafsi faghfir laha, wa in arsaltaha fahfazha bima tahfaz bihi 'ibadaka-s-salihin.\"",
      "chain": [
        "30105",
        "20001",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "7527",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن أبي هريرة، أن الناس، قالوا يا رسول الله هل نرى ربنا يوم القيامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل تضارون في القمر ليلة البدر ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ قال ‏\"‏ فهل تضارون في الشمس ليس دونها سحاب ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ قال ‏\"‏ فإنكم ترونه كذلك، يجمع الله الناس يوم القيامة فيقول من كان يعبد شيئا فليتبعه‏.‏ فيتبع من كان يعبد الشمس الشمس، ويتبع من كان يعبد القمر القمر، ويتبع من كان يعبد الطواغيت الطواغيت، وتبقى هذه الأمة فيها شافعوها  أو منافقوها شك إبراهيم  فيأتيهم الله فيقول أنا ربكم‏.‏ فيقولون هذا مكاننا حتى يأتينا ربنا فإذا جاءنا ربنا عرفناه فيأتيهم الله في صورته التي يعرفون فيقول أنا ربكم‏.‏ فيقولون أنت ربنا‏.‏ فيتبعونه ويضرب الصراط بين ظهرى جهنم، فأكون أنا وأمتي أول من يجيزها، ولا يتكلم يومئذ إلا الرسل، ودعوى الرسل يومئذ اللهم سلم سلم‏.‏ وفي جهنم كلاليب مثل شوك السعدان، هل رأيتم السعدان ‏\"‏‏.‏ قالوا نعم يا رسول الله‏.‏ قال ‏\"‏ فإنها مثل شوك السعدان، غير أنه لا يعلم ما قدر عظمها إلا الله، تخطف الناس بأعمالهم، فمنهم الموبق بقي بعمله، أو الموثق بعمله، ومنهم المخردل أو المجازى أو نحوه، ثم يتجلى حتى إذا فرغ الله من القضاء بين العباد وأراد أن يخرج برحمته من أراد من أهل النار أمر الملائكة أن يخرجوا من النار من كان لا يشرك بالله شيئا، ممن أراد الله أن يرحمه ممن يشهد أن لا إله إلا الله، فيعرفونهم في النار بأثر السجود، تأكل النار ابن آدم إلا أثر السجود، حرم الله على النار أن تأكل أثر السجود، فيخرجون من النار قد امتحشوا، فيصب عليهم ماء الحياة فينبتون تحته كما تنبت الحبة في حميل السيل، ثم يفرغ الله من القضاء بين العباد، ويبقى رجل مقبل بوجهه على النار هو آخر أهل النار دخولا الجنة فيقول أى رب اصرف وجهي عن النار، فإنه قد قشبني ريحها وأحرقني ذكاؤها‏.‏ فيدعو الله بما شاء أن يدعوه ثم يقول الله هل عسيت إن أعطيت ذلك أن تسألني غيره‏.‏ فيقول لا وعزتك لا أسألك غيره، ويعطي ربه من عهود ومواثيق ما شاء، فيصرف الله وجهه عن النار، فإذا أقبل على الجنة ورآها سكت ما شاء الله أن يسكت ثم يقول أى رب قدمني إلى باب الجنة‏.‏ فيقول الله له ألست قد أعطيت عهودك ومواثيقك أن لا تسألني غير الذي أعطيت أبدا، ويلك يا ابن آدم ما أغدرك‏.‏ فيقول أى رب‏.‏ ويدعو الله حتى يقول هل عسيت إن أعطيت ذلك أن تسأل غيره‏.‏ فيقول لا وعزتك لا أسألك غيره، ويعطي ما شاء من عهود ومواثيق، فيقدمه إلى باب الجنة، فإذا قام إلى باب الجنة انفهقت له الجنة فرأى ما فيها من الحبرة والسرور، فيسكت ما شاء الله أن يسكت ثم يقول أى رب أدخلني الجنة‏.‏ فيقول الله ألست قد أعطيت عهودك ومواثيقك أن لا تسأل غير ما أعطيت  فيقول  ويلك يا ابن آدم ما أغدرك‏.‏ فيقول أى رب لا أكونن أشقى خلقك فلا يزال يدعو حتى يضحك الله منه فإذا ضحك منه قال له ادخل الجنة‏.‏ فإذا دخلها قال الله له تمنه‏.‏ فسأل ربه وتمنى حتى إن الله ليذكره يقول كذا وكذا، حتى انقطعت به الأماني قال الله ذلك لك ومثله معه ‏\"‏‏.‏ قال عطاء بن يزيد وأبو سعيد الخدري مع أبي هريرة لا يرد عليه من حديثه شيئا حتى إذا حدث أبو هريرة أن الله تبارك وتعالى قال ‏\"‏ ذلك لك ومثله معه ‏\"‏‏.‏ قال أبو سعيد الخدري ‏\"‏ وعشرة أمثاله معه ‏\"‏‏.‏ يا أبا هريرة‏.‏ قال أبو هريرة ما حفظت إلا قوله ‏\"‏ ذلك لك ومثله معه ‏\"‏‏.‏ قال أبو سعيد الخدري أشهد أني حفظت من رسول الله صلى الله عليه وسلم قوله ‏\"‏ ذلك لك وعشرة أمثاله ‏\"‏‏.‏ قال أبو هريرة فذلك الرجل آخر أهل الجنة دخولا الجنة‏.‏",
      "text_en": "      Narrated 'Ata' bin Yazid Al-Laithi:                          On the authority of Abu Huraira: The people said, \"O Allah's Apostle!      Shall we see our Lord on the Day of Resurrection?\" The Prophet said,      \"Do you have any difficulty in seeing the moon on a full moon night?\"      They said, \"No, O Allah's Apostle.\" He said, \"Do you have any      difficulty in seeing the sun when there are no clouds?\" They said,      \"No, O Allah's Apostle.\" He said, \"So you will see Him, like that.      Allah will gather all the people on the Day of Resurrection, and say,      'Whoever worshipped something (in the world) should follow (that      thing),' so, whoever worshipped the sun will follow the sun, and      whoever worshiped the moon will follow the moon, and whoever used to      worship certain (other false) deities, he will follow those deities.      And there will remain only this nation with its good people (or its      hypocrites). (The sub-narrator, Ibrahim is in doubt.) Allah will come      to them and say, 'I am your Lord.' They will (deny Him and) say, 'We      will stay here till our Lord comes, for when our Lord comes, we will      recognize Him.' So Allah will come to them in His appearance which      they know, and will say, 'I am your Lord.' They will say, 'You are our     Lord,' so they will follow Him.      Then a bridge will be laid across Hell (Fire)' I and my followers will     be the first ones to go across it and none will speak on that Day      except the Apostles. And the invocation of the Apostles on that Day      will be, 'O Allah, save! Save!' In Hell (or over The Bridge) there      will be hooks like the thorns of As-Sa'dan (thorny plant). Have you      seen As-Sa'dan? \" They replied, \"Yes, O Allah's Apostle!\" He said, \"So     those hooks look like the thorns of As-Sa'dan, but none knows how big      they are except Allah. Those hooks will snap the people away according     to their deeds. Some of the people will stay in Hell (be destroyed)      because of their (evil) deeds, and some will be cut or torn by the      hooks (and fall into Hell) and some will be punished and then      relieved. When Allah has finished His Judgments among the people, He      will take whomever He will out of Hell through His Mercy. He will then     order the angels to take out of the Fire all those who used to worship     none but Allah from among those whom Allah wanted to be merciful to      and those who testified (in the world) that none has the right to be      worshipped but Allah. The angels will recognize them in the Fire by      the marks of prostration (on their foreheads), for the Fire will eat      up all the human body except the mark caused by prostration as Allah      has forbidden the Fire to eat the mark of prostration. They will come      out of the (Hell) Fire, completely burnt and then the water of life      will be poured over them and they will grow under it as does a seed      that comes in the mud of the torrent.      Then Allah will finish the judgments among the people, and there will      remain one man facing the (Hell) Fire and he will be the last person      among the people of Hell to enter Paradise. He will say, 'O my Lord!      Please turn my face away from the fire because its air has hurt me and     its severe heat has burnt me.' So he will invoke Allah in the way      Allah will wish him to invoke, and then Allah will say to him, 'If I      grant you that, will you then ask for anything else?' He will reply,      'No, by Your Power, (Honor) I will not ask You for anything else.' He      will give his Lord whatever promises and covenants Allah will demand.      So Allah will turn his face away from Hell (Fire). When he will face      Paradise and will see it, he will remain quiet for as long as Allah      will wish him to remain quiet, then he will say, 'O my Lord! Bring me      near to the gate of Paradise.' Allah will say to him, 'Didn't you give     your promises and covenants that you would never ask for anything more     than what you had been given? Woe on you, O Adam's son! How      treacherous you are!' He will say, 'O my lord,' and will keep on      invoking Allah till He says to him, 'If I give what you are asking,      will you then ask for anything else?' He will reply, 'No, by Your      (Honor) Power, I will not ask for anything else.'     Then he will give covenants and promises to Allah and then Allah will      bring him near to the gate of Paradise. When he stands at the gate of      Paradise, Paradise will be opened and spread before him, and he will      see its splendor and pleasures whereupon he will remain quiet as long      as Allah will wish him to remain quiet, and then he will say, O my      Lord! Admit me into Paradise.' Allah will say, 'Didn't you give your      covenants and promises that you would not ask for anything more than      what you had been given?' Allah will say, 'Woe on you, O Adam's son!      How treacherous you are! '      The man will say, 'O my Lord! Do not make me the most miserable of      Your creation,' and he will keep on invoking Allah till Allah will      laugh because of his sayings, and when Allah will laugh because of      him, He will say to him, 'Enter Paradise,' and when he will enter it,      Allah will say to him, 'Wish for anything.' So he will ask his Lord,      and he will wish for a great number of things, for Allah Himself will      remind him to wish for certain things by saying, '(Wish for)      so-and-so.' When there is nothing more to wish for, Allah will say,      'This is for you, and its equal (is for you) as well.\"     'Ata' bin Yazid added: Abu Sa'id Al-Khudri who was present with Abu      Huraira, did not deny whatever the latter said, but when Abu Huraira      said that Allah had said, \"That is for you and its equal as well,\" Abu     Sa'id Al-Khudri said, \"And ten times as much, O Abu Huraira!\" Abu      Huraira said, \"I do not remember, except his saying, 'That is for you      and its equal as well.'\" Abu Sa'id Al-Khudri then said, \"I testify      that I remember the Prophet saying, 'That is for you, and ten times as     much.' ' Abu Huraira then added, \"That man will be the last person of      the people of Paradise to enter Paradise.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11206",
        "13"
      ]
    },
    {
      "hadith_no": "7611",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني سليمان، عن شريك بن عبد الله، أنه قال سمعت ابن مالك، يقول ليلة أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام، فقال أولهم أيهم هو فقال أوسطهم هو خيرهم‏.‏ فقال آخرهم خذوا خيرهم‏.‏ فكانت تلك الليلة، فلم يرهم حتى أتوه ليلة أخرى فيما يرى قلبه، وتنام عينه ولا ينام قلبه وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم، فلم يكلموه حتى احتملوه فوضعوه عند بئر زمزم فتولاه منهم جبريل فشق جبريل ما بين نحره إلى لبته حتى فرغ من صدره وجوفه، فغسله من ماء زمزم بيده، حتى أنقى جوفه، ثم أتي بطست من ذهب فيه تور من ذهب محشوا إيمانا وحكمة، فحشا به صدره ولغاديده  يعني عروق حلقه  ثم أطبقه ثم عرج به إلى السماء الدنيا فضرب بابا من أبوابها فناداه أهل السماء من هذا فقال جبريل‏.‏ قالوا ومن معك قال معي محمد‏.‏ قال وقد بعث قال نعم‏.‏ قالوا فمرحبا به وأهلا‏.‏ فيستبشر به أهل السماء، لا يعلم أهل السماء بما يريد الله به في الأرض حتى يعلمهم، فوجد في السماء الدنيا آدم فقال له جبريل هذا أبوك فسلم عليه‏.‏ فسلم عليه ورد عليه آدم وقال مرحبا وأهلا بابني، نعم الابن أنت‏.‏ فإذا هو في السماء الدنيا بنهرين يطردان فقال ما هذان النهران يا جبريل قال هذا النيل والفرات عنصرهما‏.‏ ثم مضى به في السماء فإذا هو بنهر آخر عليه قصر من لؤلؤ وزبرجد فضرب يده فإذا هو مسك قال ما هذا يا جبريل قال هذا الكوثر الذي خبأ لك ربك‏.‏ ثم عرج إلى السماء الثانية فقالت الملائكة له مثل ما قالت له الأولى من هذا قال جبريل‏.‏ قالوا ومن معك قال محمد صلى الله عليه وسلم‏.‏ قالوا وقد بعث إليه قال نعم‏.‏ قالوا مرحبا به وأهلا‏.‏ ثم عرج به إلى السماء الثالثة وقالوا له مثل ما قالت الأولى والثانية، ثم عرج به إلى الرابعة فقالوا له مثل ذلك، ثم عرج به إلى السماء الخامسة فقالوا مثل ذلك، ثم عرج به إلى السماء السادسة فقالوا له مثل ذلك، ثم عرج به إلى السماء السابعة فقالوا له مثل ذلك، كل سماء فيها أنبياء قد سماهم فأوعيت منهم إدريس في الثانية، وهارون في الرابعة، وآخر في الخامسة لم أحفظ اسمه، وإبراهيم في السادسة، وموسى في السابعة بتفضيل كلام الله، فقال موسى رب لم أظن أن يرفع على أحد‏.‏ ثم علا به فوق ذلك بما لا يعلمه إلا الله، حتى جاء سدرة المنتهى ودنا الجبار رب العزة فتدلى حتى كان منه قاب قوسين أو أدنى فأوحى الله فيما أوحى إليه خمسين صلاة على أمتك كل يوم وليلة‏.‏ ثم هبط حتى بلغ موسى فاحتبسه موسى فقال يا محمد ماذا عهد إليك ربك قال عهد إلى خمسين صلاة كل يوم وليلة‏.‏ قال إن أمتك لا تستطيع ذلك فارجع فليخفف عنك ربك وعنهم‏.‏ فالتفت النبي صلى الله عليه وسلم إلى جبريل كأنه يستشيره في ذلك، فأشار إليه جبريل أن نعم إن شئت‏.‏ فعلا به إلى الجبار فقال وهو مكانه يا رب خفف عنا، فإن أمتي لا تستطيع هذا‏.‏ فوضع عنه عشر صلوات ثم رجع إلى موسى فاحتبسه، فلم يزل يردده موسى إلى ربه حتى صارت إلى خمس صلوات، ثم احتبسه موسى عند الخمس فقال يا محمد والله لقد راودت بني إسرائيل قومي على أدنى من هذا فضعفوا فتركوه فأمتك أضعف أجسادا وقلوبا وأبدانا وأبصارا وأسماعا، فارجع فليخفف عنك ربك، كل ذلك يلتفت النبي صلى الله عليه وسلم إلى جبريل ليشير عليه ولا يكره ذلك جبريل، فرفعه عند الخامسة فقال يا رب إن أمتي ضعفاء أجسادهم وقلوبهم وأسماعهم وأبدانهم فخفف عنا فقال الجبار يا محمد‏.‏ قال لبيك وسعديك‏.‏ قال إنه لا يبدل القول لدى، كما فرضت عليك في أم الكتاب  قال  فكل حسنة بعشر أمثالها، فهى خمسون في أم الكتاب وهى خمس عليك‏.‏ فرجع إلى موسى فقال كيف فعلت فقال خفف عنا أعطانا بكل حسنة عشر أمثالها‏.‏ قال موسى قد والله راودت بني إسرائيل على أدنى من ذلك فتركوه، ارجع إلى ربك فليخفف عنك أيضا‏.‏ قال رسول الله صلى الله عليه وسلم يا موسى قد والله استحييت من ربي مما اختلفت إليه‏.‏ قال فاهبط باسم الله‏.‏ قال واستيقظ وهو في مسجد الحرام‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The night Allah's Apostle was taken for a journey from the sacred mosque (of Mecca) Al-Ka`ba: Three persons came to him (in a dreamy while he was sleeping in the Sacred Mosque before the Divine Inspiration was revealed to Him. One of them said, \"Which of them is he?\" The middle (second) angel said, \"He is the best of them.\" The last (third) angle said, \"Take the best of them.\" Only that much happened on that night and he did not see them till they came on another night, i.e. after The Divine Inspiration was revealed to him. (Fath-ul-Bari Page 258, Vol. 17) and he saw them, his eyes were asleep but his heart was not----and so is the case with the prophets: their eyes sleep while their hearts do not sleep. So those angels did not talk to him till they carried him and placed him beside the well of Zamzam. From among them Gabriel took charge of him. Gabriel cut open (the part of his body) between his throat and the middle of his chest (heart) and took all the material out of his chest and `Abdomen and then washed it with Zamzam water with his own hands till he cleansed the inside of his body, and then a gold tray containing a gold bowl full of belief and wisdom was brought and then Gabriel stuffed his chest and throat blood vessels with it and then closed it (the chest). He then ascended with him to the heaven of the world and knocked on one of its doors. The dwellers of the Heaven asked, 'Who is it?' He said, \"Gabriel.\" They said, \"Who is accompanying you?\" He said, \"Muhammad.\" They said, \"Has he been called?\" He said, \"Yes\" They said, \"He is welcomed.\" So the dwellers of the Heaven became pleased with his arrival, and they did not know what Allah would do to the Prophet on earth unless Allah informed them. The Prophet met Adam over the nearest Heaven. Gabriel said to the Prophet, \"He is your father; greet him.\" The Prophet greeted him and Adam returned his greeting and said, \"Welcome, O my Son! O what a good son you are!\" Behold, he saw two flowing rivers, while he was in the nearest sky. He asked, \"What are these two rivers, O Gabriel?\" Gabriel said, \"These are the sources of the Nile and the Euphrates.\" Then Gabriel took him around that Heaven and behold, he saw another river at the bank of which there was a palace built of pearls and emerald. He put his hand into the river and found its mud like musk Adhfar. He asked, \"What is this, O Gabriel?\" Gabriel said, \"This is the Kauthar which your Lord has kept for you.\" Then Gabriel ascended (with him) to the second Heaven and the angels asked the same questions as those on the first Heaven, i.e., \"Who is it?\" Gabriel replied, \"Gabriel\". They asked, \"Who is accompanying you?\" He said, \"Muhammad.\" They asked, \"Has he been sent for?\" He said, \"Yes.\" Then they said, \"He is welcomed.'' Then he (Gabriel) ascended with the Prophet to the third Heaven, and the angels said the same as the angels of the first and the second Heavens had said. Then he ascended with him to the fourth Heaven and they said the same; and then he ascended with him to the fifth Heaven and they said the same; and then he ascended with him to the sixth Heaven and they said the same; then he ascended with him to the seventh Heaven and they said the same. On each Heaven there were prophets whose names he had mentioned and of whom I remember Idris on the second Heaven, Aaron on the fourth Heavens another prophet whose name I don't remember, on the fifth Heaven, Abraham on the sixth Heaven, and Moses on the seventh Heaven because of his privilege of talking to Allah directly. Moses said (to Allah), \"O Lord! I thought that none would be raised up above me.\" But Gabriel ascended with him (the Prophet) for a distance above that, the distance of which only Allah knows, till he reached the Lote Tree (beyond which none may pass) and then the Irresistible, the Lord of Honor and Majesty approached and came closer till he (Gabriel) was about two bow lengths or (even) nearer. (It is said that it was Gabriel who approached and came closer to the Prophet. (Fate Al-Bari Page 263, 264, Vol. 17). Among the things which Allah revealed to him then, was: \"Fifty prayers were enjoined on his followers in a day and a night.\" Then the Prophet descended till he met Moses, and then Moses stopped him and asked, \"O Muhammad ! What did your Lord en join upon you?\" The Prophet replied,\" He enjoined upon me to perform fifty prayers in a day and a night.\" Moses said, \"Your followers cannot do that; Go back so that your Lord may reduce it for you and for them.\" So the Prophet turned to Gabriel as if he wanted to consult him about that issue. Gabriel told him of his opinion, saying, \"Yes, if you wish.\" So Gabriel ascended with him to the Irresistible and said while he was in his place, \"O Lord, please lighten our burden as my followers cannot do that.\" So Allah deducted for him ten prayers where upon he returned to Moses who stopped him again and kept on sending him back to his Lord till the enjoined prayers were reduced to only five prayers. Then Moses stopped him when the prayers had been reduced to five and said, \"O Muhammad! By Allah, I tried to persuade my nation, Bani Israel to do less than this, but they could not do it and gave it up. However, your followers are weaker in body, heart, sight and hearing, so return to your Lord so that He may lighten your burden.\" The Prophet turned towards Gabriel for advice and Gabriel did not disapprove of that. So he ascended with him for the fifth time. The Prophet said, \"O Lord, my followers are weak in their bodies, hearts, hearing and constitution, so lighten our burden.\" On that the Irresistible said, \"O Muhammad!\" the Prophet replied, \"Labbaik and Sa`daik.\" Allah said, \"The Word that comes from Me does not change, so it will be as I enjoined on you in the Mother of the Book.\" Allah added, \"Every good deed will be rewarded as ten times so it is fifty (prayers) in the Mother of the Book (in reward) but you are to perform only five (in practice).\" The Prophet returned to Moses who asked, \"What have you done?\" He said, \"He has lightened our burden: He has given us for every good deed a tenfold reward.\" Moses said, \"By Allah! I tried to make Bani Israel observe less than that, but they gave it up. So go back to your Lord that He may lighten your burden further.\" Allah's Apostle said, \"O Moses! By Allah, I feel shy of returning too many times to my Lord.\" On that Gabriel said, \"Descend in Allah's Name.\" The Prophet then woke while he was in the Sacred Mosque (at Mecca).",
      "chain": [
        "30105",
        "20160",
        "20587"
      ]
    },
    {
      "hadith_no": "4180",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا سليمان بن بلال، عن ثور بن زيد، عن الحسن بن أبي الحسن، عن عمار بن ياسر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا تقربهم الملائكة جيفة الكافر والمتضمخ بالخلوق والجنب إلا أن يتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Ammar ibn Yasir:                     The Prophet (ﷺ) said: The angels do not come near three: the dead body of the unbeliever, one who smears himself with khaluq, and the one who is sexually defiled except that he performs ablution.",
      "chain": [
        "30524",
        "30105",
        "20160",
        "11155",
        "11016",
        "25"
      ]
    },
    {
      "hadith_no": "935",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن ابن جريج، عن مزاحم بن أبي مزاحم، عن عبد العزيز بن عبد الله، عن محرش الكعبي، أن رسول الله صلى الله عليه وسلم خرج من الجعرانة ليلا معتمرا فدخل مكة ليلا فقضى عمرته ثم خرج من ليلته فأصبح بالجعرانة كبائت فلما زالت الشمس من الغد خرج من بطن سرف حتى جاء مع الطريق طريق جمع ببطن سرف فمن أجل ذلك خفيت عمرته على الناس ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ولا نعرف لمحرش الكعبي عن النبي صلى الله عليه وسلم غير هذا الحديث ‏.‏",
      "text_en": " Muharrish Al-Kabi narrated:                     \"The Messenger of Allah left Al-Ji'irranah during the night for Umrah, then he entered Makkah during he night and performed his Umrah. Then he left there during the night, then he was in Al-Ji'irranah by the morning, as if he had spent the night. When the sun passed the zenith in the morning he left from the midst of Sarif until he came on a road from amidst Sarif. It is because of this that his Umrah was concealed from the people.\"",
      "chain": [
        "30160",
        "20031",
        "11070",
        "13116",
        "30105",
        "5277"
      ]
    },
    {
      "hadith_no": "3500",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا عبد العزيز بن عبد الله الأويسي، عن سليمان بن بلال، عن يحيى بن سعيد، عن أنس بن مالك، أن هذه الآية  ‏:‏ ‏(‏ تتجافى، جنوبهم عن المضاجع، ‏)‏ نزلت في انتظار هذه الصلاة التي تدعى العتمة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik said about this Ayah:                      Their sides forsake their beds (32:16) - \"It was revealed about waiting for [this] Salat which you call Al-'Atamah.\"",
      "chain": [
        "30105",
        "20160",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "2863",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني عمران بن يزيد، عن شعيب، قال حدثنا ابن جريج، قال أخبرني مزاحم بن أبي مزاحم، عن عبد العزيز بن عبد الله، عن محرش الكعبي، أن النبي صلى الله عليه وسلم خرج ليلا من الجعرانة حين مشى معتمرا فأصبح بالجعرانة كبائت حتى إذا زالت الشمس خرج عن الجعرانة في بطن سرف حتى جامع الطريق طريق المدينة من سرف ‏.‏",
      "text_en": " It was narrated from Muhaarish Al-Kabi, that:                     the Prophet went out a night from Al-Jirranah when he set out for Umrah, and came back to Al-Jirranah when he set out for Umrah, and came back to Al-Jirranah in the morning, as if he had stayed there. Then, when the sun had passed its zenith he went out from Al-Jirranah in the valley of Sarif until the road joined the road to Al-Madinah from Sarif.",
      "chain": [
        "20428",
        "11070",
        "13116",
        "30105",
        "5277"
      ]
    },
    {
      "hadith_no": "2110",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد العزيز بن عبد الله، حدثنا ابن أبي الزناد، عن هشام بن عروة، عن أبيه، قال دخلت على مروان فقلت له امرأة من أهلك طلقت فمررت عليها وهي تنتقل فقالت أمرتنا فاطمة بنت قيس وأخبرتنا أن رسول الله  صلى الله عليه وسلم  أمرها أن تنتقل ‏.‏ فقال مروان هي أمرتهم بذلك ‏.‏ قال عروة فقلت أما والله لقد عابت ذلك عائشة وقالت إن فاطمة كانت في مسكن وحش فخيف عليها فلذلك أرخص لها رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated from Hisham bin 'Urwah that his father said:                     \"I entered upon Marwan and said to him: 'A women from your family has been divorced. I passed by her and she was moving. She said: 'Fatimah bint Qais told us to do that, and she told us that the Messenger of Allah (ﷺ) told her to move.' Marwan said: 'She told them to do that.\"' 'Urwah said: \"l said: 'By Allah, 'Aishah did not like that, and said: 'Fatimah was living in a deserted house and it was feared for her (safety and well being), so the Messenger of Allah (ﷺ) granted a concession to her.'\"",
      "chain": [
        "11222",
        "30105",
        "20509",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2849",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن يحيى بن سعيد، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ كفر بامرئ ادعاء نسب لا يعرفه أو جحده وإن دق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Prophet (ﷺ) said:                      “It is disbelief for amanto attribute himself to someone other than his father knowingly,or todeny his connection to his father, even subtly.”*",
      "chain": [
        "11222",
        "30105",
        "20160",
        "11062",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 101
}