{
  "id": "30105",
  "name": "'Abdul 'Aziz bin 'Abdullah al-Uvaisi عبد العزيز بن عبد الله بن يحيى الأويسي",
  "full_name": "'Abdul 'Aziz bin 'Abdullah al-Uvaisi عبد العزيز بن عبد الله بن يحيى  الأويسي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  كن  ق  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "B.'Amir",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20507",
      "name": "'Abdullah bin 'Umar bin Hafs bin 'Asim عبد الله بن عمر بن حفص بن عاصم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20441",
      "name": "'Abdur Rahman bin Abi al-Mawal عبد الرحمن بن أبي الموال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20435",
      "name": "'Abdullah bin Yahya bin Abi Kathir عبد الله بن يحيى بن أبي كثير اليمامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "31075",
      "name": "'Abdullah bin Abi Ziyad عبد الله بن أبي زياد",
      "grade": "3rd Century AH"
    },
    {
      "id": "38556",
      "name": "Muhammad bin 'Ali in Maymun محمد بن علي بن ميمون",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30498",
      "name": "Ibrahim bin Sa'id al-Juhari إبراهيم بن سعيد الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36024",
      "name": "al-Rabi' bin Sulaiman bin Da'ud الربيع بن سليمان بن داود",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "99",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان، عن عمرو بن أبي عمرو، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، أنه قال قيل يا رسول الله، من أسعد الناس بشفاعتك يوم القيامة قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد ظننت يا أبا هريرة أن لا يسألني عن هذا الحديث أحد أول منك، لما رأيت من حرصك على الحديث، أسعد الناس بشفاعتي يوم القيامة من قال لا إله إلا الله، خالصا من قلبه أو نفسه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I said: \"O Allah's Apostle! Who will be the luckiest person, who will gain your intercession on the Day of Resurrection?\" Allah's Apostle said: O Abu Huraira! \"I have thought that none will ask me about it before you as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said sincerely from the bottom of his heart \"None has the right to be worshipped but Allah.\"",
      "chain": [
        "30105",
        "20160",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك، عن ابن شهاب، عن الأعرج، عن أبي هريرة، قال إن الناس يقولون أكثر أبو هريرة، ولولا آيتان في كتاب الله ما حدثت حديثا، ثم يتلو ‏{‏إن الذين يكتمون ما أنزلنا من البينات‏}‏ إلى قوله ‏{‏الرحيم‏}‏ إن إخواننا من المهاجرين كان يشغلهم الصفق بالأسواق، وإن إخواننا من الأنصار كان يشغلهم العمل في أموالهم، وإن أبا هريرة كان يلزم رسول الله صلى الله عليه وسلم بشبع بطنه ويحضر ما لا يحضرون، ويحفظ ما لا يحفظون‏.‏",
      "text_en": " Narrated Abu Huraira:                     People say that I have narrated many Hadiths (The Prophet's narration). Had it not been for two verses in the Qur'an, I would not have narrated a single Hadith, and the verses are: \"Verily those who conceal the clear sign and the guidance which We have sent down . . . (up to) Most Merciful.\" (2:159-160). And no doubt our Muhajir (emigrant) brothers used to be busy in the market with their business (bargains) and our Ansari brothers used to be busy with their property (agriculture). But I (Abu Huraira) used to stick to Allah's Apostle contented with what will fill my stomach and I used to attend that which they used not to attend and I used to memorize that which they used not to memorize.",
      "chain": [
        "30105",
        "20001",
        "11013",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "159",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، قال حدثني إبراهيم بن سعد، عن ابن شهاب، أن عطاء بن يزيد، أخبره أن حمران مولى عثمان أخبره أنه، رأى عثمان بن عفان دعا بإناء، فأفرغ على كفيه ثلاث مرار فغسلهما، ثم أدخل يمينه في الإناء فمضمض، واستنشق، ثم غسل وجهه ثلاثا، ويديه إلى المرفقين ثلاث مرار، ثم مسح برأسه، ثم غسل رجليه ثلاث مرار إلى الكعبين، ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا، ثم صلى ركعتين، لا يحدث فيهما نفسه، غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Humran:                          (the slave of 'Uthman) I saw 'Uthman bin 'Affan asking for a tumbler      of water (and when it was brought) he poured water over his hands and      washed them thrice and then put his right hand in the water container      and rinsed his mouth, washed his nose by putting water in it and then      blowing it out. then he washed his face and forearms up to the      elbows thrice, passed his wet hands over his head and washed his feet      up to the ankles thrice. Then he said, \"Allah's Apostle said 'If      anyone performs ablution like that of mine and offers a two-rak'at      prayer during which he does not think of anything else (not related to     the present prayer) then his past sins will be forgiven.' \"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11206",
        "11421"
      ]
    },
    {
      "hadith_no": "370",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني ابن أبي الموالي، عن محمد بن المنكدر، قال دخلت على جابر بن عبد الله وهو يصلي في ثوب ملتحفا به ورداؤه موضوع، فلما انصرف قلنا يا أبا عبد الله تصلي ورداؤك موضوع قال نعم، أحببت أن يراني الجهال مثلكم، رأيت النبي صلى الله عليه وسلم يصلي هكذا‏.‏",
      "text_en": " Narrated Muhammad bin Al-Munkadir:                     I went to Jabir bin `Abdullah and he was praying wrapped in a garment and his Rida was Lying beside him. When he finished the prayers, I said \"O `Abdullah! You pray (in a single garment) while your Rida' is lying beside you.\" He replied, \"Yes, I did it intentionally so that the ignorant ones like you might see me. I saw the Prophet praying like this. \"",
      "chain": [
        "30105",
        "20441",
        "11048"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، قالت لقد رأيت رسول الله صلى الله عليه وسلم يوما على باب حجرتي، والحبشة يلعبون في المسجد ورسول الله صلى الله عليه وسلم يسترني بردائه، أنظر إلى لعبهم‏.‏ زاد إبراهيم بن المنذر حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، عن عائشة، قالت رأيت النبي صلى الله عليه وسلم والحبشة يلعبون بحرابهم‏.‏",
      "text_en": " Narrated `Aisha:                     Once I saw Allah's Apostle at the door of my house while some Ethiopians were playing in the mosque (displaying their skill with spears). Allah's Apostle was screening me with his Rida' so as to enable me to see their display. (`Urwa said that `Aisha said, \"I saw the Prophet and the Ethiopians were playing with their spears.\")",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أنه أخبره أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما بقاؤكم فيما سلف قبلكم من الأمم كما بين صلاة العصر إلى غروب الشمس، أوتي أهل التوراة التوراة فعملوا حتى إذا انتصف النهار عجزوا، فأعطوا قيراطا قيراطا، ثم أوتي أهل الإنجيل الإنجيل فعملوا إلى صلاة العصر، ثم عجزوا، فأعطوا قيراطا قيراطا، ثم أوتينا القرآن فعملنا إلى غروب الشمس، فأعطينا قيراطين قيراطين، فقال أهل الكتابين أى ربنا أعطيت هؤلاء قيراطين قيراطين، وأعطيتنا قيراطا قيراطا، ونحن كنا أكثر عملا، قال قال الله عز وجل هل ظلمتكم من أجركم من شىء قالوا لا، قال فهو فضلي أوتيه من أشاء ‏\"‏‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     My father said, \"I heard Allah's Apostle saying, 'The period of your stay as compared to the previous nations is like the period equal to the time between the `Asr prayer and sunset. The people of the Torah were given the Torah and they acted (upon it) till midday then they were exhausted and were given one Qirat (of gold) each. And then the people of the Gospel were given the Gospel and they acted (upon it) till the `Asr prayer then they were exhausted and were! given one Qirat each. And then we were given the Qur'an and we acted (upon it) till sunset and we were given two Qirats each. On that the people of both the scriptures said, 'O our Lord! You have given them two Qirats and given us one Qirat, though we have worked more than they.' Allah said, 'Have I usurped some of your right?' They said, 'No.' Allah said: \"That is my blessing I bestow upon whomsoever I wish.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "586",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عطاء بن يزيد الجندعي، أنه سمع أبا سعيد الخدري، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا صلاة بعد الصبح حتى ترتفع الشمس، ولا صلاة بعد العصر حتى تغيب الشمس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"There is no prayer after the morning prayer till the sun rises, and there is no prayer after the `Asr prayer till the sun sets.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "639",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خرج وقد أقيمت الصلاة وعدلت الصفوف، حتى إذا قام في مصلاه انتظرنا أن يكبر انصرف قال ‏\"‏ على مكانكم ‏\"‏‏.‏ فمكثنا على هيئتنا حتى خرج إلينا ينطف رأسه ماء وقد اغتسل‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle went out (of the mosque) when the Iqama had been pronounced and the rows straightened. The Prophet stood at his Musalla (praying place) and we waited for the Prophet to begin the prayer with Takbir. He left and asked us to remain in our places. We kept on standing till the Prophet returned and the water was trickling from his head for he had taken a bath (of Janaba).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "663",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي صلى الله عليه وسلم برجل‏.‏ قال وحدثني عبد الرحمن، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني سعد بن إبراهيم، قال سمعت حفص بن عاصم، قال سمعت رجلا، من الأزد يقال له مالك ابن بحينة أن رسول الله صلى الله عليه وسلم رأى رجلا وقد أقيمت الصلاة يصلي ركعتين، فلما انصرف رسول الله صلى الله عليه وسلم لاث به الناس، وقال له رسول الله صلى الله عليه وسلم ‏\"‏ الصبح أربعا، الصبح أربعا ‏\"‏‏.‏ تابعه غندر ومعاذ عن شعبة في مالك‏.‏ وقال ابن إسحاق عن سعد عن حفص عن عبد الله ابن بحينة‏.‏ وقال حماد أخبرنا سعد عن حفص عن مالك‏.‏",
      "text_en": " Narrated Malik Ibn Buhaina:                     Allah's Apostle passed by a man praying two rak`at after the Iqama (had been pronounced). When Allah's Apostle completed the prayer, the people gathered around him (the Prophet) or that man and Allah's Apostle said to him (protesting), Are there four rak`at in Fajr prayer? Are there four rak`at in Fajr prayer?\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "hadith_no": "675",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم، عن صالح، عن ابن شهاب، قال أخبرني جعفر بن عمرو بن أمية، أن أباه، قال رأيت رسول الله صلى الله عليه وسلم يأكل ذراعا يحتز منها، فدعي إلى الصلاة فقام فطرح السكين، فصلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya:                     My father said, \"I saw Allah's Apostle eating a piece of meat from the shoulder of a sheep and he was called for the prayer. He stood up, put down the knife and prayed but did not perform ablution.''",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11501"
      ]
    },
    {
      "hadith_no": "1030",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "وقال الأويسي حدثني محمد بن جعفر، عن يحيى بن سعيد، وشريك، سمعا أنسا، عن النبي صلى الله عليه وسلم أنه رفع يديه حتى رأيت بياض إبطيه‏.‏",
      "text_en": " The narrator Anas added that the Prophet () raised his hands (during the invocation) to such an extent that the whiteness of his armpits was visible.",
      "chain": [
        "30105",
        "20173",
        "11062",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1141",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن حميد، أنه سمع أنسا  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم يفطر من الشهر حتى نظن أن لا يصوم منه، ويصوم حتى نظن أن لا يفطر منه شيئا، وكان لا تشاء أن تراه من الليل مصليا إلا رأيته ولا نائما إلا رأيته‏.‏ تابعه سليمان وأبو خالد الأحمر عن حميد‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Sometimes Allah's Apostle would not fast (for so many days) that we thought that he would not fast that month and he sometimes used to fast (for so many days) that we thought he would not leave fasting throughout that month and (as regards his prayer and sleep at night), if you wanted to see him praying at night, you could see him praying and if you wanted to see him sleeping, you could see him sleeping.",
      "chain": [
        "30105",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1314",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد المقبري، عن أبيه، أنه سمع أبا سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وضعت الجنازة واحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني‏.‏ وإن كانت غير صالحة قالت يا ويلها أين يذهبون بها يسمع صوتها كل شىء إلا الإنسان، ولو سمعه صعق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, When the funeral is ready and the men carry it on their shoulders, if the deceased was righteous it will say, 'Present me (hurriedly),' and if he was not righteous, it will say, 'Woe to it (me)! Where are they taking it (me)?' Its voice is heard by everything except man and if he heard it he would fall unconscious.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "38"
      ]
    },
    {
      "hadith_no": "1544",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  قال سئل النبي صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ إيمان بالله ورسوله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ جهاد في سبيل الله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet was asked, \"Which is the best deed?\" He said, \"To believe in Allah and His Apostle.\" He was then asked, \"Which is the next (in goodness)?\" He said, \"To participate in Jihad in Allah's Cause.\" He was then asked, \"Which is the next?\" He said, \"To perform Hajj-Mabrur. \"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1912",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح الدجال، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate guarding them.\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "3229"
      ]
    },
    {
      "hadith_no": "1911",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن حميد، عن أنس  رضى الله عنه  قال آلى رسول الله صلى الله عليه وسلم من نسائه، وكانت انفكت رجله، فأقام في مشربة تسعا وعشرين ليلة، ثم نزل فقالوا يا رسول الله آليت شهرا‏.‏ فقال ‏\"‏ إن الشهر يكون تسعا وعشرين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle vowed to keep aloof from his wives for one month, and he had dislocation of his leg. So, he stayed in a Mashruba for 29 nights and then came down. Some people said, \"O Allah's Apostle! You vowed to stay aloof for one month,\" He replied, \"The month is of 29 days.\"",
      "chain": [
        "30105",
        "20160",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1972",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن حميد، أنه سمع أنسا  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم يفطر من الشهر، حتى نظن أن لا يصوم منه، ويصوم حتى نظن أن لا يفطر منه شيئا، وكان لا تشاء تراه من الليل مصليا إلا رأيته، ولا نائما إلا رأيته‏.‏ وقال سليمان عن حميد أنه سأل أنسا في الصوم‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle used to leave fasting in a certain month till we thought that he would not fast in that month, and he used to fast in another month till we thought he would not stop fasting at all in that month. And if one wanted to see him praying at night, one could see him (in that condition), and if one wanted to see him sleeping at night, one could see him (in that condition) too.",
      "chain": [
        "30105",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2048",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف  رضى الله عنه  لما قدمنا المدينة آخى رسول الله صلى الله عليه وسلم بيني وبين سعد بن الربيع فقال سعد بن الربيع إني أكثر الأنصار مالا، فأقسم لك نصف مالي، وانظر أى زوجتى هويت نزلت لك عنها، فإذا حلت تزوجتها‏.‏ قال فقال عبد الرحمن لا حاجة لي في ذلك، هل من سوق فيه تجارة قال سوق قينقاع‏.‏ قال فغدا إليه عبد الرحمن، فأتى بأقط وسمن  قال  ثم تابع الغدو، فما لبث أن جاء عبد الرحمن عليه أثر صفرة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ تزوجت ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ومن ‏\"‏‏.‏ قال امرأة من الأنصار‏.‏ قال ‏\"‏ كم سقت ‏\"‏‏.‏ قال زنة نواة من ذهب أو نواة من ذهب‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim bin Sa`d from his father from his grandfather:                     `Abdur Rahman bin `Auf said, \"When we came to Medina as emigrants, Allah's Apostle established a bond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` said (to me), 'I am the richest among the Ansar, so I will give you half of my wealth and you may look at my two wives and whichever of the two you may choose I will divorce her, and when she has completed the prescribed period (before marriage) you may marry her.' `Abdur-Rahman replied, \"I am not in need of all that. Is there any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- Rahman went to that market the following day and brought some dried buttermilk (yogurt) and butter, and then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of yellow (scent) on his body. Allah's Apostle asked him whether he had got married. He replied in the affirmative. The Prophet said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then the Prophet asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh to a date stone (or a date stone of gold)! The Prophet said, 'Give a Walima (wedding banquet) even if with one sheep .' \"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "8"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال أخبرني الليث، عن سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا زنت أمة أحدكم، فتبين زناها فليجلدها الحد، ولا يثرب عليها، ثم إن زنت فليجلدها الحد ولا يثرب، ثم إن زنت الثالثة فتبين زناها فليبعها ولو بحبل من شعر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"If a slave-girl of yours commits illegal sexual intercourse and her illegal sexual intercourse is proved, she should be lashed, and after that nobody should blame her, and if she commits illegal sexual intercourse the second time, she should be lashed and nobody should blame her after that, and if she does the offense for the third time and her illegal sexual intercourse is proved, she should be sold even for a hair rope.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2301",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن بن عوف  رضى الله عنه  قال كاتبت أمية بن خلف كتابا بأن يحفظني في صاغيتي بمكة، وأحفظه في صاغيته بالمدينة، فلما ذكرت الرحمن قال لا أعرف الرحمن، كاتبني باسمك الذي كان في الجاهلية‏.‏ فكاتبته عبد عمرو فلما كان في يوم بدر خرجت إلى جبل لأحرزه حين نام الناس فأبصره بلال فخرج حتى وقف على مجلس من الأنصار فقال أمية بن خلف، لا نجوت إن نجا أمية‏.‏ فخرج معه فريق من الأنصار في آثارنا، فلما خشيت أن يلحقونا خلفت لهم ابنه، لأشغلهم فقتلوه ثم أبوا حتى يتبعونا، وكان رجلا ثقيلا، فلما أدركونا قلت له ابرك‏.‏ فبرك، فألقيت عليه نفسي لأمنعه، فتخللوه بالسيوف من تحتي، حتى قتلوه، وأصاب أحدهم رجلي بسيفه، وكان عبد الرحمن بن عوف يرينا ذلك الأثر في ظهر قدمه‏.‏ قال أبو عبد الله سمع يوسف صالحا وإبراهيم أباه",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     I got an agreement written between me and Umaiya bin Khalaf that Umaiya would look after my property (or family) in Mecca and I would look after his in Medina. When I mentioned the word 'Ar64 Rahman' in the documents, Umaiya said, \"I do not know 'Ar-Rahman.' Write down to me your name, (with which you called yourself) in the Pre-Islamic Period of Ignorance.\" So, I wrote my name ' `Abdu `Amr'. On the day (of the battle) of Badr, when all the people went to sleep, I went up the hill to protect him. Bilal(1) saw him (i.e. Umaiya) and went to a gathering of Ansar and said, \"(Here is) Umaiya bin Khalaf! Woe to me if he escapes!\" So, a group of Ansar went out with Bilal to follow us (`Abdur-Rahman and Umaiya). Being afraid that they would catch us, I left Umaiya's son for them to keep them busy but the Ansar killed the son and insisted on following us. Umaiya was a fat man, and when they approached us, I told him to kneel down, and he knelt, and I laid myself on him to protect him, but the Ansar killed him by passing their swords underneath me, and one of them injured my foot with his sword. (The sub narrator said, \" `Abdur-Rahman used to show us the trace of the wound on the back of his foot.\")",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "2387",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أخذ أموال الناس يريد أداءها أدى الله عنه، ومن أخذ يريد إتلافها أتلفه الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever takes the money of the people with the intention of repaying it, Allah will repay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2458",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب بنت أم سلمة، أخبرته أن أمها أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته، فخرج إليهم، فقال ‏\"‏ إنما أنا بشر وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صدق، فأقضي له بذلك، فمن قضيت له بحق مسلم فإنما هي قطعة من النار، فليأخذها أو فليتركها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle heard some people quarreling at the door of his dwelling. He came out and said, \"I am only a human being, and opponents come to me (to settle their problems); maybe someone amongst you can present his case more eloquently than the other, whereby I may consider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by mistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day of Resurrection).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "2567",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أنها قالت لعروة ابن أختي، إن كنا لننظر إلى الهلال ثم الهلال، ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت يا خالة ما كان يعيشكم قالت الأسودان التمر والماء، إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كانت لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من ألبانهم، فيسقينا‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the crescent in this way we saw three crescents in two months and no fire (for cooking) used to be made in the houses of Allah's Apostle. I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The two black things: dates and water, our neighbors from Ansar had some Manarh and they used to present Allah's Apostle some of their milk and he used to make us drink.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2570",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن أبي حازم، عن عبد الله بن أبي قتادة السلمي، عن أبيه  رضى الله عنه  قال كنت يوما جالسا مع رجال من أصحاب النبي صلى الله عليه وسلم في منزل في طريق مكة ورسول الله صلى الله عليه وسلم نازل أمامنا والقوم محرمون، وأنا غير محرم، فأبصروا حمارا وحشيا، وأنا مشغول أخصف نعلي، فلم يؤذنوني به، وأحبوا لو أني أبصرته، والتفت فأبصرته، فقمت إلى الفرس فأسرجته ثم ركبت ونسيت السوط والرمح فقلت لهم ناولوني السوط والرمح‏.‏ فقالوا لا والله، لا نعينك عليه بشىء‏.‏ فغضبت فنزلت فأخذتهما، ثم ركبت، فشددت على الحمار فعقرته، ثم جئت به وقد مات، فوقعوا فيه يأكلونه، ثم إنهم شكوا في أكلهم إياه، وهم حرم، فرحنا وخبأت العضد معي، فأدركنا رسول الله صلى الله عليه وسلم فسألناه عن ذلك فقال ‏\"‏ معكم منه شىء ‏\"‏‏.‏ فقلت نعم‏.‏ فناولته العضد فأكلها، حتى نفدها وهو محرم‏.‏ فحدثني به زيد بن أسلم عن عطاء بن يسار عن أبي قتادة ‏عن النبي صلى الله عليه وسلم.‏",
      "text_en": " Narrated `Abdullah bin Abu Qatada Al-Aslami:                     That his father said, \"One day I was sitting with some of the Prophet's companions on the way to Mecca. Allah's Apostle was ahead of us. All of my companions were in the state of Ihram while I was a non-Muhrim. They saw an onager while I was busy repairing my shoes, so they did not tell me about it but they wished I had seen it. By chance I looked up and saw it. So, I turned to the horse, saddled it and rode on it, forgetting to take the spear and the whip. I asked them if they could hand over to me the whip and the spear but they said, 'No, by Allah, we shall not help you in that in any way.' I became angry and got down from the horse, picked up both the things and rode the horse again. I attacked the onager and slaughtered it, and brought it (after it had been dead). They took it (cooked some of it) and started eating it, but they doubted whether it was allowed for them to eat it or not, as they were in the state of Ihram. So, we proceeded and I hid with me one of its fore-legs. When we met Allah's Apostle and asked him about the case, he asked, 'Do you have a portion of it with you?' I replied in the affirmative and gave him that fleshy foreleg which he ate completely while he was in the state of Ihram .",
      "chain": [
        "30105",
        "20173",
        "11349"
      ]
    },
    {
      "hadith_no": "2692",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، أن حميد بن عبد الرحمن، أخبره أن أمه أم كلثوم بنت عقبة أخبرته أنها، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس الكذاب الذي يصلح بين الناس، فينمي خيرا، أو يقول خيرا ‏\"‏‏.‏",
      "text_en": " Narrated Um Kulthum bint `Uqba:                     That she heard Allah's Apostle saying, \"He who makes peace between the people by inventing good information or saying good things, is not a liar.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10561"
      ]
    },
    {
      "hadith_no": "2693",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا عبد العزيز بن عبد الله الأويسي، وإسحاق بن محمد الفروي، قالا حدثنا محمد بن جعفر، عن أبي حازم، عن سهل بن سعد  رضى الله عنه أن أهل، قباء اقتتلوا حتى تراموا بالحجارة، فأخبر رسول الله صلى الله عليه وسلم بذلك فقال ‏\"‏ اذهبوا بنا نصلح بينهم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Once the people of Quba fought with each other till they threw stones on each other. When Allah's Apostle was informed about it, he said, \"Let us go to bring about a reconciliation between them.\"",
      "chain": [
        "30561",
        "30105",
        "20173",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2766",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور بن زيد المدني، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏‏.‏ قالوا يا رسول الله، وما هن قال ‏\"‏ الشرك بالله، والسحر، وقتل النفس التي حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات المؤمنات الغافلات ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Apostle! What are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the life which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba (usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the time of fighting, and to accuse, chaste women, who never even think of anything touching chastity and are good believers.",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2832",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد الزهري، قال حدثني صالح بن كيسان، عن ابن شهاب، عن سهل بن سعد الساعدي، أنه قال رأيت مروان بن الحكم جالسا في المسجد، فأقبلت حتى جلست إلى جنبه، فأخبرنا أن زيد بن ثابت أخبره أن رسول الله صلى الله عليه وسلم أملى عليه لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله قال فجاءه ابن أم مكتوم وهو يملها على، فقال يا رسول الله، لو أستطيع الجهاد لجاهدت‏.‏ وكان رجلا أعمى، فأنزل الله تبارك وتعالى على رسوله صلى الله عليه وسلم وفخذه على فخذي، فثقلت على حتى خفت أن ترض فخذي، ثم سري عنه، فأنزل الله عز وجل ‏{‏غير أولي الضرر‏}‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     I saw Marwan bin Al-Hakam sitting in the Mosque. So I came forward and sat by his side. He told us that Zaid bin Thabit had told him that Allah's Apostle had dictated to him the Divine Verse: \"Not equal are those believers who sit (at home) and those who strive hard and fight in the Cause of Allah with their wealth and lives.' (4.95) Zaid said, \"Ibn-Maktum came to the Prophet while he was dictating to me that very Verse. On that Ibn Um Maktum said, \"O Allah's Apostle! If I had power, I would surely take part in Jihad.\" He was a blind man. So Allah sent down revelation to His Apostle while his thigh was on mine and it became so heavy for me that I feared that my thigh would be broken. Then that state of the Prophet was over after Allah revealed \"...except those who are disabled (by injury or are blind or lame etc.) (4.95)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "399",
        "49"
      ]
    },
    {
      "hadith_no": "2889",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا محمد بن جعفر، عن عمرو بن أبي عمرو، مولى المطلب بن حنطب، أنه سمع أنس بن مالك  رضى الله عنه  يقول خرجت مع رسول الله صلى الله عليه وسلم إلى خيبر أخدمه، فلما قدم النبي صلى الله عليه وسلم راجعا، وبدا له أحد قال ‏\"‏ هذا جبل يحبنا ونحبه ‏\"‏‏.‏ ثم أشار بيده إلى المدينة قال اللهم إني أحرم ما بين لابتيها كتحريم إبراهيم مكة ‏\"‏ اللهم بارك لنا في صاعنا ومدنا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I went along with the Prophet to Khaibar so as to serve him. (Later on) when the Prophet returned he, on seeing the Uhud mountain, said, \"This is a mountain that loves us andis loved by us.\" Then he pointed to Medina with his hand saying, \"O Allah! I make the area which is in between Medina's two mountains a sanctuary, as Abraham made Mecca a sanctuary. O Allah! Bless us in our Sa and Mudd (i.e. units of measuring).",
      "chain": [
        "30105",
        "20173",
        "19"
      ]
    },
    {
      "hadith_no": "2923",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن ابن شهاب، عن جعفر بن عمرو بن أمية، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يأكل من كتف يحتز منها، ثم دعي إلى الصلاة فصلى ولم يتوضأ‏.‏ حدثنا أبو اليمان أخبرنا شعيب عن الزهري وزاد فألقى السكين‏.‏",
      "text_en": " Narrated Umaiya Ad-Damri:                     I saw the Prophet eating of a shoulder (of a sheep) by cutting from it and then he was called to prayer and he prayed without repeating his ablution.Narrated Az-Zuhri:as above (Hadith No. 173...) and added that the Prophet put the knife down.",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11501"
      ]
    },
    {
      "hadith_no": "3092",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة أم المؤمنين  رضى الله عنها  أخبرته أن فاطمة  عليها السلام  ابنة رسول الله صلى الله عليه وسلم سألت أبا بكر الصديق بعد وفاة رسول الله صلى الله عليه وسلم أن يقسم لها ميراثها، ما ترك رسول الله صلى الله عليه وسلم مما أفاء الله عليه‏.‏ فقال لها أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ فغضبت فاطمة بنت رسول الله صلى الله عليه وسلم فهجرت أبا بكر، فلم تزل مهاجرته حتى توفيت وعاشت بعد رسول الله صلى الله عليه وسلم ستة أشهر‏.‏ قالت وكانت فاطمة تسأل أبا بكر نصيبها مما ترك رسول الله صلى الله عليه وسلم من خيبر وفدك وصدقته بالمدينة، فأبى أبو بكر عليها ذلك، وقال لست تاركا شيئا كان رسول الله صلى الله عليه وسلم يعمل به إلا عملت به، فإني أخشى إن تركت شيئا من أمره أن أزيغ‏.‏ فأما صدقته بالمدينة فدفعها عمر إلى علي وعباس، فأما خيبر وفدك فأمسكها عمر وقال هما صدقة رسول الله صلى الله عليه وسلم كانتا لحقوقه التي تعروه ونوائبه، وأمرهما إلى من ولي الأمر‏.‏ قال فهما على ذلك إلى اليوم‏.‏ قال أبو عبد الله اعتراك افتعلت من عروته فأصبته ومنه يعروه واعتراني",
      "text_en": " Narrated `Aisha:                     (mother of the believers) After the death of Allah 's Apostle Fatima the daughter of Allah's Apostle asked Abu Bakr As-Siddiq to give her, her share of inheritance from what Allah's Apostle had left of the Fai (i.e. booty gained without fighting) which Allah had given him. Abu Bakr said to her, \"Allah's Apostle said, 'Our property will not be inherited, whatever we (i.e. prophets) leave is Sadaqa (to be used for charity).\" Fatima, the daughter of Allah's Apostle got angry and stopped speaking to Abu Bakr, and continued assuming that attitude till she died. Fatima remained alive for six months after the death of Allah's Apostle. She used to ask Abu Bakr for her share from the property of Allah's Apostle which he left at Khaibar, and Fadak, and his property at Medina (devoted for charity). Abu Bakr refused to give her that property and said, \"I will not leave anything Allah's Apostle used to do, because I am afraid that if I left something from the Prophet's tradition, then I would go astray.\" (Later on) `Umar gave the Prophet's property (of Sadaqa) at Medina to `Ali and `Abbas, but he withheld the properties of Khaibar and Fadak in his custody and said, \"These two properties are the Sadaqa which Allah's Apostle used to use for his expenditures and urgent needs. Now their management is to be entrusted to the ruler.\" (Az-Zuhrl said, \"They have been managed in this way till today.\")",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3148",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عمر بن محمد بن جبير بن مطعم، أن محمد بن جبير، قال أخبرني جبير بن مطعم، أنه بينا هو مع رسول الله صلى الله عليه وسلم ومعه الناس مقبلا من حنين علقت رسول الله صلى الله عليه وسلم الأعراب يسألونه حتى اضطروه إلى سمرة، فخطفت رداءه، فوقف رسول الله صلى الله عليه وسلم فقال ‏\"‏ أعطوني ردائي، فلو كان عدد هذه العضاه نعما لقسمته بينكم، ثم لا تجدوني بخيلا ولا كذوبا ولا جبانا ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     That while he was with Allah's Apostle who was accompanied by the people on their way back from Hunain, the bedouins started begging things of Allah's Apostle so much so that they forced him to go under a Samura tree where his loose outer garment was snatched away. On that, Allah's Apostle stood up and said to them, \"Return my garment to me. If I had as many camels as these trees, I would have distributed them amongst you; and you will not find me a miser or a liar or a coward.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11712",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "3256",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك بن أنس، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة يتراءيون أهل الغرف من فوقهم كما يتراءيون الكوكب الدري الغابر في الأفق من المشرق أو المغرب، لتفاضل ما بينهم ‏\"‏‏.‏ قالوا يا رسول الله، تلك منازل الأنبياء لا يبلغها غيرهم قال ‏\"‏ بلى والذي نفسي بيده، رجال آمنوا بالله وصدقوا المرسلين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The people of Paradise will look at the dwellers of the lofty mansions (i.e. a superior place in Paradise) in the same way as one looks at a brilliant star far away in the East or in the West on the horizon; all that is because of their superiority over one another (in rewards).\" On that the people said, \"O Allah's Apostle! Are these lofty mansions for the prophets which nobody else can reach? The Prophet replied,\" No! \"By Allah in whose Hands my life is, these are for the men who believed in Allah and also believed in the Apostles.\"",
      "chain": [
        "30105",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3409",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن حميد بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احتج آدم وموسى فقال له موسى أنت آدم الذي أخرجتك خطيئتك من الجنة‏.‏ فقال له آدم أنت موسى الذي اصطفاك الله برسالاته وبكلامه، ثم تلومني على أمر قدر على قبل أن أخلق ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فحج آدم موسى ‏\"‏ مرتين‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Adam and Moses argued with each other. Moses said to Adam. 'You are Adam whose mistake expelled you from Paradise.' Adam said to him, 'You are Moses whom Allah selected as His Messenger and as the one to whom He spoke directly; yet you blame me for a thing which had already been written in my fate before my creation?\"' Allah's Apostle said twice, \"So, Adam overpowered Moses.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "3462",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال قال أبو سلمة بن عبد الرحمن إن أبا هريرة  رضى الله عنه  قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن اليهود والنصارى لا يصبغون، فخالفوهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Jews and the Christians do not dye (their grey hair), so you shall do the opposite of what they do (i.e. dye your grey hair and beards).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3469",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنه قد كان فيما مضى قبلكم من الأمم محدثون، وإنه إن كان في أمتي هذه منهم، فإنه عمر بن الخطاب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Amongst the people preceding you there used to be 'Muhaddithun' (i.e. persons who can guess things that come true later on, as if those persons have been inspired by a divine power), and if there are any such persons amongst my followers, it is `Umar bin Al-Khattab.\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3473",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك، عن محمد بن المنكدر، وعن أبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، أنه سمعه يسأل، أسامة بن زيد ماذا سمعت من، رسول الله صلى الله عليه وسلم في الطاعون فقال أسامة قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون رجس أرسل على طائفة من بني إسرائيل أو على من كان قبلكم، فإذا سمعتم به بأرض فلا تقدموا عليه، وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏‏.‏ قال أبو النضر ‏\"‏ لا يخرجكم إلا فرارا منه ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle said, \"Plague was a means of torture sent on a group of Israelis (or on some people before you). So if you hear of its spread in a land, don't approach it, and if a plague should appear in a land where you are present, then don't leave that land in order to run away from it (i.e. plague).",
      "chain": [
        "30105",
        "20001",
        "11048",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3480",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كان الرجل يداين الناس، فكان يقول لفتاه إذا أتيت معسرا فتجاوز عنه، لعل الله أن يتجاوز عنا‏.‏ قال فلقي الله فتجاوز عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A man used to give loans to the people and used to say to his servant, 'If the debtor is poor, forgive him, so that Allah may forgive us.' So when he met Allah (after his death), Allah forgave him.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "3546",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن أنس، أن عثمان، دعا زيد بن ثابت وعبد الله بن الزبير وسعيد بن العاص وعبد الرحمن بن الحارث بن هشام فنسخوها في المصاحف، وقال عثمان للرهط القرشيين الثلاثة إذا اختلفتم أنتم وزيد بن ثابت في شىء من القرآن، فاكتبوه بلسان قريش، فإنما نزل بلسانهم‏.‏ ففعلوا ذلك‏.‏",
      "text_en": " Narrated Anas:                     `Uthman called Zaid bin Thabit, `Abdullah bin Az-Zubair, Sa`id bin Al-`As and `AbdurRahman bin Al-Harith bin Hisham, and then they wrote the manuscripts of the Holy Qur'an in the form of book in several copies. `Uthman said to the three Quraishi persons. \" If you differ with Zaid bin Thabit on any point of the Qur'an, then write it in the language of Quraish, as the Qur'an was revealed in their language.\" So they acted accordingly. (Sa`id bin Thabit was an Ansari and not from Quraish ).",
      "chain": [
        "30105",
        "20150",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3557",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى يخرج رجل من قحطان يسوق الناس بعصاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Hurairah (ra):                      The Prophet () said, \"The hour will not be established unless a man from the tribe of Qahtan appears, driving the people with his stick (ruling them with violence and oppression).\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "3644",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد العزيز الأويسي، حدثنا إبراهيم، عن صالح بن كيسان، عن ابن شهاب، عن ابن المسيب، وأبي، سلمة بن عبد الرحمن أن أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستكون فتن، القاعد فيها خير من القائم، والقائم فيها خير من الماشي، والماشي فيها خير من الساعي، ومن يشرف لها تستشرفه، ومن وجد ملجأ أو معاذا فليعذ به ‏\"‏‏.‏   وعن ابن شهاب، حدثني أبو بكر بن عبد الرحمن بن الحارث، عن عبد الرحمن بن مطيع بن الأسود، عن نوفل بن معاوية،، مثل حديث أبي هريرة هذا، إلا أن أبا بكر، يزيد ‏\"‏ من الصلاة صلاة من فاتته فكأنما وتر أهله وماله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There will be afflictions (and at the time) the sitting person will be better than the standing one, and the standing one will be better than the walking, and the walking will be better than the running. And whoever will look towards those afflictions, they will overtake him, and whoever will find a refuge or a shelter, should take refuge in it.\" The same narration is reported by Abu Bakr, with the addition, \"(The Prophet said), 'Among the prayers there is a prayer the missing of which will be to one like losing one's family and property.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3698",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن يحيى بن سعيد، عن نافع، عن ابن عمر  رضى الله عنهما  قال كنا نخير بين الناس في زمن النبي صلى الله عليه وسلم فنخير أبا بكر، ثم عمر بن الخطاب، ثم عثمان بن عفان رضى الله عنهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We used to compare the people as to who was better during the lifetime of Allah's Apostle . We used to regard Abu Bakr as the best, then `Umar, and then `Uthman .",
      "chain": [
        "30105",
        "20160",
        "11062",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3816",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني محمد بن جعفر، عن عبد الله بن عبد الرحمن، أنه سمع أنس بن مالك  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فضل عائشة على النساء كفضل الثريد على الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"The superiority of `Aisha over other women is like the superiority of Tharid to other meals.\"",
      "chain": [
        "30105",
        "20173",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "3930",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم حين أراد حنينا ‏\"‏ منزلنا غدا إن شاء الله بخيف بني كنانة، حيث تقاسموا على الكفر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle, while going out for the battle of Hunain, said, \"Tomorrow Allah willing, we will encamp at Khaif Bani Kinana where the pagans(of Quraish) took the oath of Kufr (against the Prophet i.e. to be loyal to heathenism, by boycotting Banu Hashim, the Prophet's folk, See Hadith No. 659 Vol. 2) .",
      "chain": [
        "30105",
        "20150",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4020",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن، قال كاتبت أمية بن خلف، فلما كان يوم بدر، فذكر قتله وقتل ابنه، فقال بلال لا نجوت إن نجا أمية‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     \"I had an agreement with Umaiya bin Khalaf (that he would look after my relatives and property in Mecca, and I would look after his relatives and property in Medina).\" `Abdur-Rahman then mentioned the killing of Umaiya and his son on the day of Badr, and Bilal said, \"Woe to me if Umaiya remains safe (i.e. alive) . \"",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "20033"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن سعد بن أبي وقاص  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم أحد، ومعه رجلان يقاتلان عنه، عليهما ثياب بيض، كأشد القتال، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I saw Allah's Apostle on the day of the battle of Uhud accompanied by two men fighting on his behalf. They were dressed in white and were fighting as bravely as possible. I had never seen them before, nor did I see them later on.",
      "chain": [
        "30105",
        "20150",
        "11063",
        "9"
      ]
    },
    {
      "hadith_no": "4193",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال حدثني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة بن مسعود، عن عائشة، رضى الله عنها زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، وكلهم حدثني طائفة من حديثها، وبعضهم كان أوعى لحديثها من بعض وأثبت له اقتصاصا، وقد وعيت عن كل رجل منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا، وإن كان بعضهم أوعى له من بعض، قالوا قالت عائشة كان رسول الله صلى الله عليه وسلم إذا أراد سفرا أقرع بين أزواجه، فأيهن خرج سهمها، خرج بها رسول الله صلى الله عليه وسلم معه، قالت عائشة فأقرع بيننا في غزوة غزاها فخرج فيها سهمي، فخرجت مع رسول الله صلى الله عليه وسلم بعد ما أنزل الحجاب، فكنت أحمل في هودجي وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك وقفل، دنونا من المدينة قافلين، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى رحلي، فلمست صدري، فإذا عقد لي من جزع ظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، قالت وأقبل الرهط الذين كانوا يرحلوني فاحتملوا هودجي، فرحلوه على بعيري الذي كنت أركب عليه، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يهبلن ولم يغشهن اللحم، إنما يأكلن العلقة من الطعام، فلم يستنكر القوم خفة الهودج حين رفعوه وحملوه، وكنت جارية حديثة السن، فبعثوا الجمل فساروا، ووجدت عقدي بعد ما استمر الجيش، فجئت منازلهم وليس بها منهم داع ولا مجيب، فتيممت منزلي الذي كنت به، وظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة في منزلي غلبتني عيني فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم، فعرفني حين رآني، وكان رآني قبل الحجاب، فاستيقظت باسترجاعه حين عرفني، فخمرت وجهي بجلبابي، والله ما تكلمنا بكلمة ولا سمعت منه كلمة غير استرجاعه، وهوى حتى أناخ راحلته، فوطئ على يدها، فقمت إليها فركبتها، فانطلق يقود بي الراحلة حتى أتينا الجيش موغرين في نحر الظهيرة، وهم نزول  قالت  فهلك ‏{‏في‏}‏ من هلك، وكان الذي تولى كبر الإفك عبد الله بن أبى ابن سلول‏.‏ قال عروة أخبرت أنه كان يشاع ويتحدث به عنده، فيقره ويستمعه ويستوشيه‏.‏ وقال عروة أيضا لم يسم من أهل الإفك أيضا إلا حسان بن ثابت، ومسطح بن أثاثة، وحمنة بنت جحش في ناس آخرين، لا علم لي بهم، غير أنهم عصبة  كما قال الله تعالى  وإن كبر ذلك يقال عبد الله بن أبى ابن سلول‏.‏ قال عروة كانت عائشة تكره أن يسب عندها حسان، وتقول إنه الذي قال فإن أبي ووالده وعرضي لعرض محمد منكم وقاء قالت عائشة فقدمنا المدينة فاشتكيت حين قدمت شهرا، والناس يفيضون في قول أصحاب الإفك، لا أشعر بشىء من ذلك، وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي، إنما يدخل على رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏ ثم ينصرف، فذلك يريبني ولا أشعر بالشر، حتى خرجت حين نقهت، فخرجت مع أم مسطح قبل المناصع، وكان متبرزنا، وكنا لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا‏.‏ قالت وأمرنا أمر العرب الأول في البرية قبل الغائط، وكنا نتأذى بالكنف أن نتخذها عند بيوتنا، قالت فانطلقت أنا وأم مسطح وهى ابنة أبي رهم بن المطلب بن عبد مناف، وأمها بنت صخر بن عامر خالة أبي بكر الصديق، وابنها مسطح بن أثاثة بن عباد بن المطلب، فأقبلت أنا وأم مسطح قبل بيتي، حين فرغنا من شأننا، فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت أى هنتاه ولم تسمعي ما قال قالت وقلت ما قال فأخبرتني بقول أهل الإفك  قالت  فازددت مرضا على مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم ثم قال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت له أتأذن لي أن آتي أبوى قالت وأريد أن أستيقن الخبر من قبلهما، قالت فأذن لي رسول الله صلى الله عليه وسلم، فقلت لأمي يا أمتاه ماذا يتحدث الناس قالت يا بنية هوني عليك، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها لها ضرائر إلا كثرن عليها‏.‏ قالت فقلت سبحان الله أولقد تحدث الناس بهذا قالت فبكيت تلك الليلة، حتى أصبحت لا يرقأ لي دمع، ولا أكتحل بنوم، ثم أصبحت أبكي  قالت  ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يسألهما ويستشيرهما في فراق أهله  قالت  فأما أسامة فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله، وبالذي يعلم لهم في نفسه، فقال أسامة أهلك ولا نعلم إلا خيرا‏.‏ وأما علي فقال يا رسول الله لم يضيق الله عليك، والنساء سواها كثير، وسل الجارية تصدقك‏.‏ قالت فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة هل رأيت من شىء يريبك ‏\"‏‏.‏ قالت له بريرة والذي بعثك بالحق ما رأيت عليها أمرا قط أغمصه، غير أنها جارية حديثة السن تنام عن عجين أهلها، فتأتي الداجن فتأكله  قالت  فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى وهو على المنبر فقال ‏\"‏ يا معشر المسلمين من يعذرني من رجل قد بلغني عنه أذاه في أهلي، والله ما علمت على أهلي إلا خيرا، ولقد ذكروا رجلا ما علمت عليه إلا خيرا، وما يدخل على أهلي إلا معي ‏\"‏‏.‏ قالت فقام سعد بن معاذ أخو بني عبد الأشهل فقال أنا يا رسول الله أعذرك، فإن كان من الأوس ضربت عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا أمرك‏.‏ قالت فقام رجل من الخزرج، وكانت أم حسان بنت عمه من فخذه، وهو سعد بن عبادة، وهو سيد الخزرج  قالت  وكان قبل ذلك رجلا صالحا، ولكن احتملته الحمية فقال لسعد كذبت لعمر الله لا تقتله، ولا تقدر على قتله، ولو كان من رهطك ما أحببت أن يقتل‏.‏ فقام أسيد بن حضير  وهو ابن عم سعد  فقال لسعد بن عبادة كذبت لعمر الله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ قالت فثار الحيان الأوس والخزرج حتى هموا أن يقتتلوا، ورسول الله صلى الله عليه وسلم قائم على المنبر  قالت  فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت  قالت  فبكيت يومي ذلك كله، لا يرقأ لي دمع، ولا أكتحل بنوم  قالت  وأصبح أبواى عندي، وقد بكيت ليلتين ويوما، لا يرقأ لي دمع، ولا أكتحل بنوم، حتى إني لأظن أن البكاء فالق كبدي، فبينا أبواى جالسان عندي وأنا أبكي فاستأذنت على امرأة من الأنصار، فأذنت لها، فجلست تبكي معي  قالت  فبينا نحن على ذلك دخل رسول الله صلى الله عليه وسلم علينا، فسلم ثم جلس  قالت  ولم يجلس عندي منذ قيل ما قيل قبلها، وقد لبث شهرا لا يوحى إليه في شأني بشىء  قالت  فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد، يا عائشة إنه بلغني عنك كذا وكذا، فإن كنت بريئة، فسيبرئك الله، وإن كنت ألممت بذنب، فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف ثم تاب تاب الله عليه ‏\"‏‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة، فقلت لأبي أجب رسول الله صلى الله عليه وسلم عني فيما قال‏.‏ فقال أبي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت أمي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت وأنا جارية حديثة السن لا أقرأ من القرآن كثيرا إني والله لقد علمت لقد سمعتم هذا الحديث حتى استقر في أنفسكم وصدقتم به، فلئن قلت لكم إني بريئة لا تصدقوني، ولئن اعترفت لكم بأمر، والله يعلم أني منه بريئة لتصدقني، فوالله لا أجد لي ولكم مثلا إلا أبا يوسف حين قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت واضطجعت على فراشي، والله يعلم أني حينئذ بريئة، وأن الله مبرئي ببراءتي ولكن والله ما كنت أظن أن الله منزل في شأني وحيا يتلى، لشأني في نفسي كان أحقر من أن يتكلم الله في بأمر، ولكن كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها، فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه، ولا خرج أحد من أهل البيت، حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه من العرق مثل الجمان وهو في يوم شات، من ثقل القول الذي أنزل عليه  قالت  فسري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكانت أول كلمة تكلم بها أن قال ‏\"‏ يا عائشة أما الله فقد برأك ‏\"‏‏.‏ قالت فقالت لي أمي قومي إليه‏.‏ فقلت والله لا أقوم إليه، فإني لا أحمد إلا الله عز وجل  قالت  وأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات، ثم أنزل الله هذا في براءتي‏.‏ قال أبو بكر الصديق  وكان ينفق على مسطح بن أثاثة لقرابته منه وفقره  والله لا أنفق على مسطح شيئا أبدا بعد الذي قال لعائشة ما قال‏.‏ فأنزل الله ‏{‏ ولا يأتل أولو الفضل منكم‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ قال أبو بكر الصديق بلى والله إني لأحب أن يغفر الله لي",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle intended to go on a journey, he used to draw lots amongst his wives, and Allah's Apostle used to take with him the one on whom lot fell. He drew lots amongst us during one of the Ghazwat which he fought. The lot fell on me and so I proceeded with Allah's Apostle after Allah's order of veiling (the women) had been revealed. I was carried (on the back of a camel) in my howdah and carried down while still in it (when we came to a halt). So we went on till Allah's Apostle had finished from that Ghazwa of his and returned. When we approached the city of Medina he announced at night that it was time for departure. So when they announced the news of departure, I got up and went away from the army camps, and after finishing from the call of nature, I came back to my riding animal. I touched my chest to find that my necklace which was made of Zifar beads (i.e. Yemenite beads partly black and partly white) was missing. So I returned to look for my necklace and my search for it detained me. (In the meanwhile) the people who used to carry me on my camel, came and took my howdah and put it on the back of my camel on which I used to ride, as they considered that I was in it. In those days women were light in weight for they did not get fat, and flesh did not cover their bodies in abundance as they used to eat only a little food. Those people therefore, disregarded the lightness of the howdah while lifting and carrying it; and at that time I was still a young girl. They made the camel rise and all of them left (along with it). I found my necklace after the army had gone. Then I came to their camping place to find no call maker of them, nor one who would respond to the call. So I intended to go to the place where I used to stay, thinking that they would miss me and come back to me (in my search). While I was sitting in my resting place, I was overwhelmed by sleep and slept. Safwan bin Al-Muattal As-Sulami Adh-Dhakwani was behind the army. When he reached my place in the morning, he saw the figure of a sleeping person and he recognized me on seeing me as he had seen me before the order of compulsory veiling (was prescribed). So I woke up when he recited Istirja' (i.e. \"Inna li l-lahi wa inna llaihi raji'un\") as soon as he recognized me. I veiled my face with my head cover at once, and by Allah, we did not speak a single word, and I did not hear him saying any word besides his Istirja'. He dismounted from his camel and made it kneel down, putting his leg on its front legs and then I got up and rode on it. Then he set out leading the camel that was carrying me till we overtook the army in the extreme heat of midday while they were at a halt (taking a rest). (Because of the event) some people brought destruction upon themselves and the one who spread the Ifk (i.e. slander) more, was `Abdullah bin Ubai Ibn Salul.\" (Urwa said, \"The people propagated the slander and talked about it in his (i.e. `Abdullah's) presence and he confirmed it and listened to it and asked about it to let it prevail.\" `Urwa also added, \"None was mentioned as members of the slanderous group besides (`Abdullah) except Hassan bin Thabit and Mistah bin Uthatha and Hamna bint Jahsh along with others about whom I have no knowledge, but they were a group as Allah said. It is said that the one who carried most of the slander was `Abdullah bin Ubai bin Salul.\" `Urwa added, \"`Aisha disliked to have Hassan abused in her presence and she used to say, 'It was he who said: My father and his (i.e. my father's) father and my honor are all for the protection of Muhammad's honor from you.\"). `Aisha added, \"After we returned to Medina, I became ill for a month. The people were propagating the forged statements of the slanderers while I was unaware of anything of all that, but I felt that in my present ailment, I was not receiving the same kindness from Allah's Apostle as I used to receive when I got sick. (But now) Allah's Apostle would only come, greet me and say,' How is that (lady)?' and leave. That roused my doubts, but I did not discover the evil (i.e. slander) till I went out after my convalescence, I went out with Um Mistah to Al-Manasi' where we used to answer the call of nature and we used not to go out (to answer the call of nature) except at night, and that was before we had latrines near our houses. And this habit of our concerning evacuating the bowels, was similar to the habits of the old 'Arabs living in the deserts, for it would be troublesome for us to take latrines near our houses. So I and Um Mistah who was the daughter of Abu Ruhm bin Al-Muttalib bin `Abd Manaf, whose mother was the daughter of Sakhr bin 'Amir and the aunt of Abu Bakr As-Siddiq and whose son was Mistah bin Uthatha bin `Abbas bin Al-Muttalib, went out. I and Um Mistah returned to my house after we finished answering the call of nature. Um Mistah stumbled by getting her foot entangled in her covering sheet and on that she said, 'Let Mistah be ruined!' I said, 'What a hard word you have said. Do you abuse a man who took part in the battle of Badr?' On that she said, 'O you Hantah! Didn't you hear what he (i.e. Mistah) said? 'I said, 'What did he say?' Then she told me the slander of the people of Ifk. So my ailment was aggravated, and when I reached my home, Allah's Apostle came to me, and after greeting me, said, 'How is that (lady)?' I said, 'Will you allow me to go to my parents?' as I wanted to be sure about the news through them. Allah's Apostle allowed me (and I went to my parents) and asked my mother, 'O mother! What are the people talking about?' She said, 'O my daughter! Don't worry, for scarcely is there a charming woman who is loved by her husband and whose husband has other wives besides herself that they (i.e. women) would find faults with her.' I said, 'Subhan-Allah! (I testify the uniqueness of Allah). Are the people really talking in this way?' I kept on weeping that night till dawn I could neither stop weeping nor sleep then in the morning again, I kept on weeping. When the Divine Inspiration was delayed. Allah's Apostle called `Ali bin Abi Talib and Usama bin Zaid to ask and consult them about divorcing me. Usama bin Zaid said what he knew of my innocence, and the respect he preserved in himself for me. Usama said, '(O Allah's Apostle!) She is your wife and we do not know anything except good about her.' `Ali bin Abi Talib said, 'O Allah's Apostle! Allah does not put you in difficulty and there are plenty of women other than she, yet, ask the maid-servant who will tell you the truth.' On that Allah's Apostle called Barira (i.e. the maid-servant) and said, 'O Barira! Did you ever see anything which aroused your suspicion?' Barira said to him, 'By Him Who has sent you with the Truth. I have never seen anything in her (i.e. Aisha) which I would conceal, except that she is a young girl who sleeps leaving the dough of her family exposed so that the domestic goats come and eat it.' So, on that day, Allah's Apostle got up on the pulpit and complained about `Abdullah bin Ubai (bin Salul) before his companions, saying, 'O you Muslims! Who will relieve me from that man who has hurt me with his evil statement about my family? By Allah, I know nothing except good about my family and they have blamed a man about whom I know nothing except good and he used never to enter my home except with me.' Sa`d bin Mu`adh the brother of Banu `Abd Al-Ashhal got up and said, 'O Allah's Apostle! I will relieve you from him; if he is from the tribe of Al-Aus, then I will chop his head off, and if he is from our brothers, i.e. Al-Khazraj, then order us, and we will fulfill your order.' On that, a man from Al-Khazraj got up. Um Hassan, his cousin, was from his branch tribe, and he was Sa`d bin Ubada, chief of Al-Khazraj. Before this incident, he was a pious man, but his love for his tribe goaded him into saying to Sa`d (bin Mu`adh). 'By Allah, you have told a lie; you shall not and cannot kill him. If he belonged to your people, you would not wish him to be killed.' On that, Usaid bin Hudair who was the cousin of Sa`d (bin Mu`adh) got up and said to Sa`d bin 'Ubada, 'By Allah! You are a liar! We will surely kill him, and you are a hypocrite arguing on the behalf of hypocrites.' On this, the two tribes of Al-Aus and Al Khazraj got so much excited that they were about to fight while Allah's Apostle was standing on the pulpit. Allah's Apostle kept on quietening them till they became silent and so did he. All that day I kept on weeping with my tears never ceasing, and I could never sleep. In the morning my parents were with me and I wept for two nights and a day with my tears never ceasing and I could never sleep till I thought that my liver would burst from weeping. So, while my parents were sitting with me and I was weeping, an Ansari woman asked me to grant her admittance. I allowed her to come in, and when she came in, she sat down and started weeping with me. While we were in this state, Allah's Apostle came, greeted us and sat down. He had never sat with me since that day of the slander. A month had elapsed and no Divine Inspiration came to him about my case. Allah's Apostle then recited Tashah-hud and then said, 'Amma Badu, O `Aisha! I have been informed so-andso about you; if you are innocent, then soon Allah will reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him for forgiveness for when a slave confesses his sins and asks Allah for forgiveness, Allah accepts his repentance.' (continued...) (continuing... 1): -5.462:... ... When Allah's Apostle finished his speech, my tears ceased flowing completely that I no longer felt a single drop of tear flowing. I said to my father, 'Reply to Allah's Apostle on my behalf concerning what he has said.' My father said, 'By Allah, I do not know what to say to Allah's Apostle .' Then I said to my mother, 'Reply to Allah's Apostle on my behalf concerning what he has said.' She said, 'By Allah, I do not know what to say to Allah's Apostle.' In spite of the fact that I was a young girl and had a little knowledge of Qur'an, I said, 'By Allah, no doubt I know that you heard this (slanderous) speech so that it has been planted in your hearts (i.e. minds) and you have taken it as a truth. Now if I tell you that I am innocent, you will not believe me, and if confess to you about it, and Allah knows that I am innocent, you will surely believe me. By Allah, I find no similitude for me and you except that of Joseph's father when he said, '(For me) patience in the most fitting against that which you assert; it is Allah (Alone) Whose Help can be sought.' Then I turned to the other side and lay on my bed; and Allah knew then that I was innocent and hoped that Allah would reveal my innocence. But, by Allah, I never thought that Allah would reveal about my case, Divine Inspiration, that would be recited (forever) as I considered myself too unworthy to be talked of by Allah with something of my concern, but I hoped that Allah's Apostle might have a dream in which Allah would prove my innocence. But, by Allah, before Allah's Apostle left his seat and before any of the household left, the Divine inspiration came to Allah's Apostle. So there overtook him the same hard condition which used to overtake him, (when he used to be inspired Divinely). The sweat was dropping from his body like pearls though it was a wintry day and that was because of the weighty statement which was being revealed to him. When that state of Allah's Apostle was over, he got up smiling, and the first word he said was, 'O `Aisha! Allah has declared your innocence!' Then my Mother said to me, 'Get up and go to him (i.e. Allah's Apostle). I replied, 'By Allah, I will not go to him, and I praise none but Allah. So Allah revealed the ten Verses:- - \"Verily! They who spread the slander Are a gang, among you.............\" (24.11-20) Allah revealed those Qur'anic Verses to declare my innocence. Abu Bakr As-Siddiq who used to disburse money for Mistah bin Uthatha because of his relationship to him and his poverty, said, 'By Allah, I will never give to Mistah bin Uthatha anything after what he has said about Aisha.' Then Allah revealed:-- \"And let not those among you who are good and wealthy swear not to give (any sort of help) to their kinsmen, those in need, and those who have left their homes for Allah's cause, let them pardon and forgive. Do you not love that Allah should forgive you? And Allah is oft-Forgiving Most Merciful.\" (24.22) Abu Bakr As-Siddiq said, 'Yes, by Allah, I would like that Allah forgive me.' and went on giving Mistah the money he used to give him before. He also added, 'By Allah, I will never deprive him of it at all.' Aisha further said:.\" Allah's Apostle also asked Zainab bint Jahsh (i.e. his wife) about my case. He said to Zainab, 'What do you know and what did you see?\" She replied, \"O Allah's Apostle! I refrain from claiming falsely that I have heard or seen anything. By Allah, I know nothing except good (about `Aisha).' From amongst the wives of the Prophet Zainab was my peer (in beauty and in the love she received from the Prophet) but Allah saved her from that evil because of her piety. Her sister Hamna, started struggling on her behalf and she was destroyed along with those who were destroyed. The man who was blamed said, 'Subhan-Allah! By Him in Whose Hand my soul is, I have never uncovered the cover (i.e. veil) of any female.' Later on the man was martyred in Allah's Cause.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "4617",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني عروة بن الزبير، أنه سأل عائشة عن قول الله، تعالى ‏{‏وإن خفتم أن لا تقسطوا في اليتامى‏}‏‏.‏ فقالت يا ابن أختي، هذه اليتيمة تكون في حجر وليها، تشركه في ماله ويعجبه مالها وجمالها، فيريد وليها أن يتزوجها، بغير أن يقسط في صداقها، فيعطيها مثل ما يعطيها غيره، فنهوا عن أن ينكحوهن، إلا أن يقسطوا لهن، ويبلغوا لهن أعلى سنتهن في الصداق، فأمروا أن ينكحوا ما طاب لهم من النساء سواهن‏.‏ قال عروة قالت عائشة وإن الناس استفتوا رسول الله صلى الله عليه وسلم بعد هذه الآية فأنزل الله ‏{‏ويستفتونك في النساء‏}‏ قالت عائشة وقول الله تعالى في آية أخرى ‏{‏وترغبون أن تنكحوهن‏}‏ رغبة أحدكم عن يتيمته حين تكون قليلة المال والجمال قالت فنهوا أن ينكحوا عن من رغبوا في ماله وجماله في يتامى النساء، إلا بالقسط، من أجل رغبتهم عنهن إذا كن قليلات المال والجمال‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     That he asked `Aisha regarding the Statement of Allah: \"If you fear that you shall not be able to deal justly with the orphan girls...\" (4.3) She said, \"O son of my sister! An Orphan girl used to be under the care of a guardian with whom she shared property. Her guardian, being attracted by her wealth and beauty, would intend to marry her without giving her a just Mahr, i.e. the same Mahr as any other person might give her (in case he married her). So such guardians were forbidden to do that unless they did justice to their female wards and gave them the highest Mahr their peers might get. They were ordered (by Allah, to marry women of their choice other than those orphan girls.\" `Aisha added,\" The people asked Allah's Apostle his instructions after the revelation of this Divine Verse whereupon Allah revealed: \"They ask your instruction regarding women \" (4.127) `Aisha further said, \"And the Statement of Allah: \"And yet whom you desire to marry.\" (4.127) as anyone of you refrains from marrying an orphan girl (under his guardianship) when she is lacking in property and beauty.\" `Aisha added, \"So they were forbidden to marry those orphan girls for whose wealth and beauty they had a desire unless with justice, and that was because they would refrain from marrying them if they were lacking in property and beauty.\"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4671",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مفاتح الغيب خمس إن الله عنده علم الساعة، وينزل الغيث، ويعلم ما في الأرحام، وما تدري نفس ماذا تكسب غدا، وما تدري نفس بأى أرض تموت، إن الله عليم خبير ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"The key of the Unseen are five: Verily with Allah (Alone) is the knowledge of the Hour He sends down the rain and knows what is in the wombs. No soul knows what it will earn tomorrow, and no soul knows in what land it will die. Verily, Allah is All-Knower, All-Aware.\" (31.34)",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4736",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب،‏.‏ قال وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله، كل حدثني طائفة من الحديث قال النبي صلى الله عليه وسلم ‏\"‏ إن كنت بريئة فسيبرئك الله، وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه ‏\"‏‏.‏ قلت إني والله لا أجد مثلا إلا أبا يوسف ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ وأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated Az-Zuhri:                     `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Al-Qama bin Waqqas and 'Ubaidullah bin `Abdullah related the narration of `Aisha, the wife the Prophet, when the slanderers had said about her what they had said and Allah later declared her innocence. Each of them related a part of the narration (wherein) the Prophet said (to `Aisha). \"If you are innocent, then Allah will declare your innocence: but if you have committed a sin, then ask for Allah's Forgiveness and repent to him.\" `Aisha said, \"By Allah, I find no example for my case except that of Joseph's father (when he said), 'So (for me) patience is most fitting.' \" Then Allah revealed the ten Verses:-- \"Verily those who spread the slander are a gang amongst you..\" (24.11)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    }
  ],
  "total_hadiths": 101
}