{
  "id": "30101",
  "name": "Ibrahim bin Hamza bin Muhammad إبراهيم بن حمزة بن محمد",
  "full_name": "Ibrahim bin Hamza bin Muhammad إبراهيم بن حمزة بن محمد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "230",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ خ  د  س  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ خ  د  س  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ خ  د  س  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-51",
      "hadith_no": "51",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، عن عبيد الله بن عبد الله، أن عبد الله بن عباس، أخبره قال أخبرني أبو سفيان، أن هرقل، قال له سألتك هل يزيدون أم ينقصون، فزعمت أنهم يزيدون، وكذلك الإيمان حتى يتم‏.‏ وسألتك هل يرتد أحد سخطة لدينه بعد أن يدخل فيه، فزعمت أن لا، وكذلك الإيمان حين تخالط بشاشته القلوب، لا يسخطه أحد‏.‏",
      "text_en": "      Narrated 'Abdullah bin 'Abbas:                          I was informed by Abu Sufyan that Heraclius said to him, \"I asked you      whether they (followers of Muhammad) were increasing or decreasing.      You replied that they were increasing. And in fact, this is the way of     true Faith till it is complete in all respects. I further asked you      whether there was anybody, who, after embracing his (the Prophets)      religion (Islam) became displeased and discarded it. You replied in      the negative, and in fact, this is (a sign of) true faith. When its      delight enters the heart and mixes with them completely, nobody can be     displeased with it.\"",
      "usc_msa_ref": "48",
      "chain": [
        "30101",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-528",
      "hadith_no": "528",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم، يغتسل فيه كل يوم خمسا، ما تقول ذلك يبقي من درنه ‏\"‏‏.‏ قالوا لا يبقي من درنه شيئا‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس، يمحو الله بها الخطايا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds.\"",
      "usc_msa_ref": "506",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1967",
      "hadith_no": "1967",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تواصلوا، فأيكم أراد أن يواصل فليواصل حتى السحر ‏\"‏‏.‏ قالوا فإنك تواصل، يا رسول الله‏.‏ قال ‏\"‏ لست كهيئتكم، إني أبيت لي مطعم يطعمني وساق يسقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"Do not fast continuously day and night (practice Al-Wisal) and if anyone of you intends to fast continuously day and night, he should continue till the Suhur time.\" They said, \"But you practice Al-Wisal, O Allah's Apostle!\" The Prophet said, \"I am not similar to you;. during my sleep I have One Who makes me eat and drink.\"",
      "usc_msa_ref": "",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11182",
        "38"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2018",
      "hadith_no": "2018",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري  رضى الله عنه ‏.‏ كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر، فإذا كان حين يمسي من عشرين ليلة تمضي، ويستقبل إحدى وعشرين، رجع إلى مسكنه ورجع من كان يجاور معه‏.‏ وأنه أقام في شهر جاور فيه الليلة التي كان يرجع فيها، فخطب الناس، فأمرهم ما شاء الله، ثم قال ‏\"‏ كنت أجاور هذه العشر، ثم قد بدا لي أن أجاور هذه العشر الأواخر، فمن كان اعتكف معي فليثبت في معتكفه، وقد أريت هذه الليلة ثم أنسيتها فابتغوها في العشر الأواخر وابتغوها في كل وتر، وقد رأيتني أسجد في ماء وطين ‏\"‏‏.‏ فاستهلت السماء في تلك الليلة، فأمطرت، فوكف المسجد في مصلى النبي صلى الله عليه وسلم ليلة إحدى وعشرين، فبصرت عيني رسول الله صلى الله عليه وسلم ونظرت إليه انصرف من الصبح، ووجهه ممتلئ طينا وماء‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf (in the mosque) in the middle third of Ramadan and after passing the twenty nights he used to go back to his house on the 21st, and the people who were in I`tikaf with him also used to go back to their houses. Once in Ramadan, in which he practiced I`tikaf, he established the night prayers at the night in which he used to return home, and then he addressed the people and ordered them whatever Allah wished him to order and said, \"I used to practice I`tikaf for these ten days (i.e. the middle third but now I intend to stay in I`tikaf for the last ten days (of the month); so whoever was in I`tikaf with me should stay at his place of seclusion. I have verily been shown (the date of) this Night (of Qadr) but I have forgotten it. So search for it in the odd nights of the last ten days (of this month). I also saw myself (in the dream) prostrating in mud and water.\" On the night of the 21st, the sky was covered with clouds and it rained, and the rainwater started leaking through the roof of the mosque at the praying place of the Prophet . I saw with my own eyes the Prophet at the completion of the morning prayer leaving with his face covered with mud and water.",
      "usc_msa_ref": "",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "38"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2681",
      "hadith_no": "2681",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، عن عبيد الله بن عبد الله، أن عبد الله بن عباس  رضى الله عنهما  أخبره قال أخبرني أبو سفيان، أن هرقل، قال له سألتك ماذا يأمركم فزعمت أنه أمركم بالصلاة والصدق والعفاف والوفاء بالعهد وأداء الأمانة‏.‏ قال وهذه صفة نبي‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Abu Sufyan told me that Heraclius said to him, \"When I inquired you what he (i.e. Muhammad) ordered you, you replied that he ordered you to establish the prayer, to speak the truth, to be chaste, to keep promises and to pay back trusts.\" Then Heraclius added, \"These are really the qualities of a prophet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30101",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2940",
      "hadith_no": "2940",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن عبد الله بن عباس  رضى الله عنهما  أنه أخبره أن رسول الله صلى الله عليه وسلم كتب إلى قيصر يدعوه إلى الإسلام، وبعث بكتابه إليه مع دحية الكلبي، وأمره رسول الله صلى الله عليه وسلم أن يدفعه إلى عظيم بصرى ليدفعه إلى قيصر، وكان قيصر لما كشف الله عنه جنود فارس مشى من حمص إلى إيلياء، شكرا لما أبلاه الله، فلما جاء قيصر كتاب رسول الله صلى الله عليه وسلم قال حين قرأه التمسوا لي ها هنا أحدا من قومه لأسألهم عن رسول الله صلى الله عليه وسلم‏.‏   قال ابن عباس فأخبرني أبو سفيان، أنه كان بالشأم في رجال من قريش، قدموا تجارا في المدة التي كانت بين رسول الله صلى الله عليه وسلم وبين كفار قريش، قال أبو سفيان فوجدنا رسول قيصر ببعض الشأم فانطلق بي وبأصحابي حتى قدمنا إيلياء، فأدخلنا عليه، فإذا هو جالس في مجلس ملكه وعليه التاج، وإذا حوله عظماء الروم فقال لترجمانه سلهم أيهم أقرب نسبا إلى هذا الرجل الذي يزعم أنه نبي قال أبو سفيان فقلت أنا أقربهم نسبا‏.‏ قال ما قرابة ما بينك وبينه فقلت هو ابن عمي، وليس في الركب يومئذ أحد من بني عبد مناف غيري‏.‏ فقال قيصر أدنوه‏.‏ وأمر بأصحابي فجعلوا خلف ظهري عند كتفي، ثم قال لترجمانه قل لأصحابه إني سائل هذا الرجل عن الذي يزعم أنه نبي، فإن كذب فكذبوه‏.‏ قال أبو سفيان والله لولا الحياء يومئذ من أن يأثر أصحابي عني الكذب لكذبته حين سألني عنه، ولكني استحييت أن يأثروا الكذب عني فصدقته، ثم قال لترجمانه قل له كيف نسب هذا الرجل فيكم قلت هو فينا ذو نسب‏.‏ قال فهل قال هذا القول أحد منكم قبله قلت لا‏.‏ فقال كنتم تتهمونه على الكذب قبل أن يقول ما قال قلت لا‏.‏ قال فهل كان من آبائه من ملك قلت لا‏.‏ قال فأشراف الناس يتبعونه أم ضعفاؤهم قلت بل ضعفاؤهم‏.‏ قال فيزيدون أو ينقصون قلت بل يزيدون‏.‏ قال فهل يرتد أحد سخطة لدينه بعد أن يدخل فيه قلت لا‏.‏ قال فهل يغدر قلت لا، ونحن الآن منه في مدة، نحن نخاف أن يغدر‏.‏ قال أبو سفيان ولم يمكني كلمة أدخل فيها شيئا أنتقصه به لا أخاف أن تؤثر عني غيرها‏.‏ قال فهل قاتلتموه أو قاتلكم قلت نعم‏.‏ قال فكيف كانت حربه وحربكم قلت كانت دولا وسجالا، يدال علينا المرة وندال عليه الأخرى‏.‏ قال فماذا يأمركم قال يأمرنا أن نعبد الله وحده لا نشرك به شيئا، وينهانا عما كان يعبد آباؤنا، ويأمرنا بالصلاة والصدقة والعفاف والوفاء بالعهد وأداء الأمانة‏.‏ فقال لترجمانه حين قلت ذلك له قل له إني سألتك عن نسبه فيكم، فزعمت أنه ذو نسب، وكذلك الرسل تبعث في نسب قومها، وسألتك هل قال أحد منكم هذا القول قبله فزعمت أن لا، فقلت لو كان أحد منكم قال هذا القول قبله قلت رجل يأتم بقول قد قيل قبله‏.‏ وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فزعمت أن لا، فعرفت أنه لم يكن ليدع الكذب على الناس ويكذب على الله، وسألتك هل كان من آبائه من ملك فزعمت أن لا، فقلت لو كان من آبائه ملك قلت يطلب ملك آبائه‏.‏ وسألتك أشراف الناس يتبعونه أم ضعفاؤهم فزعمت أن ضعفاءهم اتبعوه، وهم أتباع الرسل، وسألتك هل يزيدون أو ينقصون فزعمت أنهم يزيدون، وكذلك الإيمان حتى يتم، وسألتك هل يرتد أحد سخطة لدينه بعد أن يدخل فيه فزعمت أن لا، فكذلك الإيمان حين تخلط بشاشته القلوب لا يسخطه أحد، وسألتك هل يغدر فزعمت أن لا، وكذلك الرسل لا يغدرون‏.‏ وسألتك هل قاتلتموه وقاتلكم فزعمت أن قد فعل، وأن حربكم وحربه تكون دولا، ويدال عليكم المرة وتدالون عليه الأخرى، وكذلك الرسل تبتلى، وتكون لها العاقبة، وسألتك بماذا يأمركم فزعمت أنه يأمركم أن تعبدوا الله ولا تشركوا به شيئا، وينهاكم عما كان يعبد آباؤكم، ويأمركم بالصلاة والصدق والعفاف والوفاء بالعهد، وأداء الأمانة، قال وهذه صفة النبي، قد كنت أعلم أنه خارج، ولكن لم أظن أنه منكم، وإن يك ما قلت حقا، فيوشك أن يملك موضع قدمى هاتين، ولو أرجو أن أخلص إليه لتجشمت لقيه، ولو كنت عنده لغسلت قدميه‏.‏ قال أبو سفيان ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرئ فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم من محمد عبد الله ورسوله، إلى هرقل عظيم الروم، سلام على من اتبع الهدى، أما بعد فإني أدعوك بدعاية الإسلام، أسلم تسلم، وأسلم يؤتك الله أجرك مرتين، فإن توليت فعليك إثم الأريسيين و‏{‏يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون‏}‏‏\"‏‏.‏ قال أبو سفيان فلما أن قضى مقالته، علت أصوات الذين حوله من عظماء الروم، وكثر لغطهم، فلا أدري ماذا قالوا، وأمر بنا فأخرجنا، فلما أن خرجت مع أصحابي وخلوت بهم قلت لهم لقد أمر أمر ابن أبي كبشة، هذا ملك بني الأصفر يخافه، قال أبو سفيان والله ما زلت ذليلا مستيقنا بأن أمره سيظهر، حتى أدخل الله قلبي الإسلام وأنا كاره‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle wrote to Caesar and invited him to Islam and sent him his letter with Dihya Al-Kalbi whom Allah's Apostle ordered to hand it over to the Governor of Busra who would forward it to Caesar. Caesar as a sign of gratitude to Allah, had walked from Hims to Ilya (i.e. Jerusalem) when Allah had granted Him victory over the Persian forces. So, when the letter of Allah's Apostle reached Caesar, he said after reading it, 'Seek for me any one of his people! (Arabs of Quraish tribe) if present here, in order to ask him about Allah's Apostle. At that time Abu Sufyan bin Harb was in Sham with some men frown Quraish who had come (to Sham) as merchants during the truce that had been concluded between Allah's Apostle; and the infidels of Quraish. Abu Sufyan said, Caesar's messenger found us somewhere in Sham so he took me and my companions to Ilya and we were admitted into Ceasar's court to find him sitting in his royal court wearing a crown and surrounded by the senior dignitaries of the Byzantine. He said to his translator. 'Ask them who amongst them is a close relation to the man who claims to be a prophet.\" Abu Sufyan added, \"I replied, 'I am the nearest relative to him.' He asked, 'What degree of relationship do you have with him?' I replied, 'He is my cousin,' and there was none of Bani Abu Manaf in the caravan except myself. Caesar said, 'Let him come nearer.' He then ordered that my companions stand behind me near my shoulder and said to his translator, 'Tell his companions that I am going to ask this man about the man who claims to be a prophet. If he tells a lie, they should contradict him immediately.\" Abu Sufyan added, \"By Allah! Had it not been shameful that my companions label me a liar, I would not have spoken the truth about him when he asked me. But I considered it shameful to be called a liar by my companions. So I told the truth. He then said to his translator, 'Ask him what kind of family does he belong to.' I replied, 'He belongs to a noble family amongst us.' He said, 'Have anybody else amongst you ever claimed the same before him? 'I replied, 'No.' He said, 'Had you ever blamed him for telling lies before he claimed what he claimed? ' I replied, 'No.' He said, 'Was anybody amongst his ancestors a king?' I replied, 'No.' He said, \"Do the noble or the poor follow him?' I replied, 'It is the poor who follow him.' He said, 'Are they increasing or decreasing (day by day)?' I replied,' They are increasing.' He said, 'Does anybody amongst those who embrace his (the Prophet's) Religion become displeased and then discard his Religion?'. I replied, 'No. ' He said, 'Does he break his promises? I replied, 'No, but we are now at truce with him and we are afraid that he may betray us.\" Abu Sufyan added, \"Other than the last sentence, I could not say anything against him. Caesar then asked, 'Have you ever had a war with him?' I replied, 'Yes.' He said, 'What was the outcome of your battles with him?' I replied, 'The result was unstable; sometimes he was victorious and sometimes we.' He said, 'What does he order you to do?' I said, 'He tells us to worship Allah alone, and not to worship others along with Him, and to leave all that our fore-fathers used to worship. He orders us to pray, give in charity, be chaste, keep promises and return what is entrusted to us.' When I had said that, Caesar said to his translator, 'Say to him: I ask you about his lineage and your reply was that he belonged to a noble family. In fact, all the apostles came from the noblest lineage of their nations. Then I questioned you whether anybody else amongst you had claimed such a thing, and your reply was in the negative. If the answer had been in the affirmative, I would have thought that this man was following a claim that had been said before him. When I asked you whether he was ever blamed for telling lies, your reply was in the negative, so I took it for granted that a person who did not tell a lie about (others) the people could never tell a lie about Allah. Then I asked you whether any of his ancestors was a king. Your reply was in the negative, and if it had been in the affirmative, I would have thought that this man wanted to take back his ancestral kingdom. When I asked you whether the rich or the poor people followed him, you replied that it was the poor who followed him. In fact, such are the followers of the apostles. Then I asked you whether his followers were increasing or decreasing. You replied that they were increasing. In fact, this is the result of true faith till it is complete (in all respects). I asked you whether there was anybody who, after embracing his religion, became displeased and discarded his religion; your reply was in the negative. In fact, this is the sign of true faith, for when its cheerfulness enters and mixes in the hearts completely, nobody will be displeased with it. I asked you whether he had ever broken his promise. You replied in the negative. And such are the apostles; they never break their promises. When I asked you whether you fought with him and he fought with you, you replied that he did, and that sometimes he was victorious and sometimes you. Indeed, such are the apostles; they are put to trials and the final victory is always theirs. Then I asked you what he ordered you. You replied that he ordered you to worship Allah alone and not to worship others along with Him, to leave all that your fore-fathers used to worship, to offer prayers, to speak the truth, to be chaste, to keep promises, and to return what is entrusted to you. These are really the qualities of a prophet who, I knew (from the previous Scriptures) would appear, but I did not know that he would be from amongst you. If what you say should be true, he will very soon occupy the earth under my feet, and if I knew that I would reach him definitely, I would go immediately to meet Him; and were I with him, then I would certainly wash his feet.' \" Abu Sufyan added, \"Caesar then asked for the letter of Allah's Apostle and it was read. Its contents were: \"In the name of Allah, the most Beneficent, the most Merciful (This letter is) from Muhammad, the slave of Allah, and His Apostle, to Heraculius, the Ruler of the Byzantine. Peace be upon the followers of guidance. Now then, I invite you to Islam (i.e. surrender to Allah), embrace Islam and you will be safe; embrace Islam and Allah will bestow on you a double reward. But if you reject this invitation of Islam, you shall be responsible for misguiding the peasants (i.e. your nation). O people of the Scriptures! Come to a word common to you and us and you, that we worship. None but Allah, and that we associate nothing in worship with Him; and that none of us shall take others as Lords besides Allah. Then if they turn away, say: Bear witness that we are (they who have surrendered (unto Him)..(3.64) Abu Sufyan added, \"When Heraclius had finished his speech, there was a great hue and cry caused by the Byzantine Royalties surrounding him, and there was so much noise that I did not understand what they said. So, we were turned out of the court. When I went out with my companions and we were alone, I said to them, 'Verily, Ibn Abi Kabsha's (i.e. the Prophet's) affair has gained power. This is the King of Bani Al-Asfar fearing him.\" Abu Sufyan added, \"By Allah, I remained low and was sure that his religion would be victorious till Allah converted me to Islam, though I disliked it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30101",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3295",
      "hadith_no": "3295",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني إبراهيم بن حمزة، قال حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ  أراه  أحدكم من منامه فتوضأ فليستنثر ثلاثا، فإن الشيطان يبيت على خيشومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If anyone of you rouses from sleep and performs the ablution, he should wash his nose by putting water in it and then blowing it out thrice, because Satan has stayed in the upper part of his nose all the night.\"",
      "usc_msa_ref": "516",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3981",
      "hadith_no": "3981",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثنا حاتم، عن عبد الرحمن بن حميد الزهري، قال سمعت عمر بن عبد العزيز، يسأل السائب ابن أخت النمر ما سمعت في، سكنى مكة قال سمعت العلاء بن الحضرمي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث للمهاجر بعد الصدر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Humaid Az-Zuhri:                     I heard `Umar bin `Abdul-Aziz asking As-Sa'ib, the nephew of An-Nimr. \"What have you heard about residing in Mecca?\" The other said, \"I heard Al-Ala bin Al-Hadrami saying, Allah's Apostle said: An Emigrant is allowed to stay in Mecca for three days after departing from Mina (i.e. after performing all the ceremonies of Hajj)\"",
      "usc_msa_ref": "270",
      "chain": [
        "30101",
        "20159",
        "586"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4846",
      "hadith_no": "4846",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، وقال، ‏\"‏ كما صليت على إبراهيم، وبارك على محمد وآل محمد كما باركت على إبراهيم وآل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Hazim and Ad-Darawardi:                     Yazid said, \"Kama sallaita ala Ibrahima wa barik 'ala Muhammad in wa all Muhammadin kama barakta 'ala Abrahima wa all Ibrahim.\"",
      "usc_msa_ref": "322",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4880",
      "hadith_no": "4880",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا حاتم، عن معاوية، قال حدثني عمي أبو الحباب، سعيد بن يسار عن أبي هريرة، بهذا، ثم قال رسول الله صلى الله عليه وسلم اقرءوا إن شئتم ‏{‏فهل عسيتم‏}‏",
      "text_en": " Narrated Abu Huraira:                     (As above, No. 354, but added) Then Allah's Apostle said, \"Recite if you wish: \"Would you then.\" ..(47.22)",
      "usc_msa_ref": "355",
      "chain": [
        "30101",
        "20159",
        "27"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5147",
      "hadith_no": "5147",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، عن أبيه، عن سهل، قال مر رجل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما تقولون في هذا ‏\"‏‏.‏ قالوا حري إن خطب أن ينكح، وإن شفع أن يشفع، وإن قال أن يستمع‏.‏ قال ثم سكت فمر رجل من فقراء المسلمين فقال ‏\"‏ ما تقولون في هذا ‏\"‏‏.‏ قالوا حري إن خطب أن لا ينكح وإن شفع أن لا يشفع، وإن قال أن لا يستمع‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا خير من ملء الأرض مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     A man passed by Allah's Apostle and Allah s Apostle asked (his companions) \"What do you say about this (man)?\" They replied \"If he asks for a lady's hand, he ought to be given her in marriage; and if he intercedes (for someone) his intercessor should be accepted; and if he speaks, he should be listened to.\" Allah's Apostle kept silent, and then a man from among the poor Muslims passed by, an Allah's Apostle asked (them) \"What do you say about this man?\" They replied, \"If he asks for a lady's hand in marriage he does not deserve to be married, and he intercedes (for someone), his intercession should not be accepted; And if he speaks, he should not be listened to.' Allah's Apostle said, \"This poor man is better than so many of the first as filling the earth.'",
      "usc_msa_ref": "28",
      "chain": [
        "30101",
        "20165",
        "11172",
        "399"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5732",
      "hadith_no": "5732",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا حاتم  هو ابن إسماعيل  عن الجعيد، قال سمعت السائب، يقول ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع فمسح رأسي ودعا لي بالبركة، ثم توضأ فشربت من وضوئه وقمت خلف ظهره فنظرت إلى خاتم النبوة بين كتفيه مثل زر الحجلة‏.‏",
      "text_en": " Narrated As-Sa'ib:                     My aunt took me to Allah's Apostle and said, \"O Allah's Apostle! My nephew is- ill.\" The Prophet touched my head with his hand and invoked Allah to bless me. He then performed ablution and I drank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- Nubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.",
      "usc_msa_ref": "",
      "chain": [
        "30101",
        "20159",
        "11679",
        "3048"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6432",
      "hadith_no": "6432",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله هذا السلام عليك، فكيف نصلي قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك، كما صليت على إبراهيم، وبارك على محمد وعلى آل محمد، كما باركت على إبراهيم وآل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We said, \"O Allah's Apostle This is (i.e. we know) the greeting to you; will you tell us how to send Salat on you?\" He said, \"Say: 'Allahumma Salli 'ala Muhammadin `Abdika wa rasulika kama sal-laita 'ala Ibrahima wa barik 'ala Muhammadin wa all Muhammadin kama barakta 'ala Ibrahima wa `Ali Ibrahim.\"",
      "usc_msa_ref": "369",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6555",
      "hadith_no": "6555",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة التيمي، عن أبي هريرة، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين فيها، يزل بها في النار أبعد مما بين المشرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That he heard Allah's Apostle saying, \"A slave of Allah may utter a word without thinking whether it is right or wrong, he may slip down in the Fire as far away a distance equal to that between the east.\"",
      "usc_msa_ref": "484",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6644",
      "hadith_no": "6644",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم وذكر عنده عمه أبو طالب فقال ‏\"‏ لعله تنفعه شفاعتي يوم القيامة فيجعل في ضحضاح من النار، يبلغ كعبيه، يغلي منه أم دماغه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostles when his uncle, Abu Talib had been mentioned in his presence, saying, \"May be my intercession will help him (Abu Talib) on the Day of Resurrection so that he may be put in a shallow place in the Fire, with fire reaching his ankles and causing his brain to boil.\"",
      "usc_msa_ref": "569",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7075",
      "hadith_no": "7075",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ الرؤيا الصالحة جزء من ستة وأربعين جزءا من النبوة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"A good dream is a part of the forty six parts of prophetism.\"",
      "usc_msa_ref": "118",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7132",
      "hadith_no": "7132",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا رأى أحدكم الرؤيا يحبها، فإنها من الله، فليحمد الله عليها، وليحدث بها، وإذا رأى غير ذلك مما يكره، فإنما هي من الشيطان، فليستعذ من شرها، ولا يذكرها لأحد، فإنها لن تضره ‏\"‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"If anyone of you saw a dream which he liked, then that was from Allah, and he should thank Allah for it and tell it to others; but if he saw something else, i.e, a dream which he did not like, then that is from Satan and he should seek refuge with Allah from it and should not tell it to anybody for it will not harm him.\"",
      "usc_msa_ref": "169",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7639",
      "hadith_no": "7639",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت بالقرآن يجهر به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet saying, \"Allah does not listen to anything as He listens to the recitation of the Qur'an by a Prophet who recites it in attractive audible sweet sounding voice.\"",
      "usc_msa_ref": "634",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-abi-daud-1491",
      "hadith_no": "1491",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا إبراهيم بن حمزة، حدثنا عبد العزيز بن محمد، عن العباس بن عبد الله بن معبد بن عباس، عن أخيه، إبراهيم بن عبد الله عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال فذكر نحوه ‏.‏",
      "text_en": " The above mentioned tradition has also been transmitted in a similar manner by Ibn 'Abbas from the Messenger of Allah (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30101",
        "20167",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2701",
      "hadith_no": "2701",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن حمزة الزبيري، قال حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن ابن عمر، أن جيشا، غنموا في زمان رسول الله صلى الله عليه وسلم طعاما وعسلا فلم يؤخذ منهم الخمس ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     In the time of the Messenger of Allah (ﷺ) an army got food and honey and a fifth was not taken from them.",
      "usc_msa_ref": "",
      "chain": [
        "30101",
        "20157",
        "11201",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2977",
      "hadith_no": "2977",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا إبراهيم بن حمزة، حدثنا حاتم بن إسماعيل، عن أسامة بن زيد، عن ابن شهاب، بإسناده نحوه قلت ألا تتقين الله ألم تسمعن رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا نورث ما تركنا فهو صدقة وإنما هذا المال لآل محمد لنائبتهم ولضيفهم فإذا مت فهو إلى من ولي الأمر من بعدي ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has been narrated by Ibn Shihab through a different chain of narrators. This version says:                      I said: Do you not fear Allah ? Did you not hear the Messenger of Allah (ﷺ) say: We are not inherited. Whatever we leave is sadaqah (alms). This property belongs to the family of Muhammad for their emergent needs and their guest. When I die, it will go to him who becomes ruler after me.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30101",
        "20159",
        "50"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3266",
      "hadith_no": "3266",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا الحسن بن علي، حدثنا إبراهيم بن حمزة، حدثنا عبد الملك بن عياش السمعي الأنصاري، عن دلهم بن الأسود بن عبد الله بن حاجب بن عامر بن المنتفق العقيلي، عن أبيه، عن عمه، لقيط بن عامر قال دلهم وحدثنيه أيضا الأسود بن عبد الله، عن عاصم بن لقيط، ‏:‏ أن لقيط بن عامر، خرج وافدا إلى النبي صلى الله عليه وسلم قال لقيط ‏:‏ فقدمنا على رسول الله صلى الله عليه وسلم فذكر حديثا فيه ‏:‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ لعمر إلهك ‏\"‏ ‏.‏",
      "text_en": " Narrated Laqit ibn Amir:                     We came to the Messenger of Allah (ﷺ) in a delegation. The Prophet (ﷺ) then said: By the age of thy god.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30101",
        "18476"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3576",
      "hadith_no": "3576",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن حمزة بن أبي يحيى الرملي، حدثنا زيد بن أبي الزرقاء، حدثنا ابن أبي الزناد، عن أبيه، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، قال ‏{‏ ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ‏}‏ إلى قوله ‏{‏ الفاسقون ‏}‏ هؤلاء الآيات الثلاث نزلت في اليهود خاصة في قريظة والنضير ‏.‏",
      "text_en": " Ibn 'Abbas said:                      \"If any do fail to judge (by the light of) what Allah has revealed, they are (no better than) unbelievers\" up to \"wrongdoers.\" These three verses were revealed about the Jews, particularly about Quraizah and al-Nadir.",
      "usc_msa_ref": "",
      "chain": [
        "30101",
        "28194",
        "20509",
        "11061",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 23,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}