{
  "id": "30112",
  "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
  "full_name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "198",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Ashja'i",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20152",
      "name": "Ubayy bin al-'Abbas bin Sahl أبي بن العباس بن سهل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "12033",
      "name": "Thabit bin Qays al-Ghiffari ثابت بن قيس الغفاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22047",
      "name": "Kharjh bin 'Abdullah خارجة بن عبد الله بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20511",
      "name": "'Abdul 'Aziz bin al-Mtlb عبد العزيز بن المطلب بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20674",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم بن سوسن الطائفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20441",
      "name": "'Abdur Rahman bin Abi al-Mawal عبد الرحمن بن أبي الموال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20706",
      "name": "Musa bin Y'aqub bin 'Abdullah bin Wahb موسى بن يعقوب بن عبد الله بن وهب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30421",
      "name": "Muhammad bin Yahya bin Abi 'Umar محمد بن يحيى بن أبي عمر العدني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30410",
      "name": "Ishaq bin Musa bin 'Abdullah bin Musa إسحاق بن موسى بن عبد الله بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36613",
      "name": "al-Fadl bin al-Sbah al-Bghdady الفضل بن الصباح البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30560",
      "name": "Muhammad bin Ahmed bin Abi Khalaf محمد بن أحمد بن أبي خلف",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30395",
      "name": "Nasr bin 'Ali bin Nasr bin 'Ali نصر بن علي بن نصر بن علي الجهضمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30548",
      "name": "Salah bin Msmar al-Slmy صالح بن مسمار السلمي أبو الفضل ويقال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30493",
      "name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "236",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس، عن ميمونة، أن النبي صلى الله عليه وسلم سئل عن فأرة سقطت في سمن فقال ‏\"‏ خذوها وما حولها فاطرحوه ‏\"‏‏.‏ قال معن حدثنا مالك ما لا أحصيه يقول عن ابن عباس عن ميمونة‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet was asked regarding ghee in which a mouse had fallen. He said, \"Take out the mouse and throw away the ghee around it (and use the rest.)\"",
      "chain": [
        "30026",
        "30112",
        "20001",
        "11013",
        "11004",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا معن، قال حدثني ابن أبي ذئب، عن ابن شهاب، عن عروة، وعن عمرة، عن عائشة، زوج النبي صلى الله عليه وسلم أن أم حبيبة استحيضت سبع سنين، فسألت رسول الله صلى الله عليه وسلم عن ذلك، فأمرها أن تغتسل فقال ‏\"‏ هذا عرق ‏\"‏‏.‏ فكانت تغتسل لكل صلاة‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Um Habiba got bleeding in between the periods for seven years. She asked Allah's Apostle about it. He ordered her to take a bath (after the termination of actual periods) and added that it was (from) a blood vessel. So she used to take a bath for every prayer.",
      "chain": [
        "30308",
        "30112",
        "20177",
        "11013",
        "10511",
        "11455"
      ]
    },
    {
      "hadith_no": "1600",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني معن، قال حدثني مالك، عن نافع، عن ابن عمر  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يدخل من الثنية العليا، ويخرج من الثنية السفلى‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle used to enter Mecca from the high Thaniya and used to leave Mecca from the low Thaniya.",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1897",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني معن، قال حدثني مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله نودي من أبواب الجنة يا عبد الله، هذا خير‏.‏ فمن كان من أهل الصلاة دعي من باب الصلاة، ومن كان من أهل الجهاد دعي من باب الجهاد، ومن كان من أهل الصيام دعي من باب الريان، ومن كان من أهل الصدقة دعي من باب الصدقة ‏\"‏‏.‏ فقال أبو بكر  رضى الله عنه  بأبي أنت وأمي يا رسول الله، ما على من دعي من تلك الأبواب من ضرورة، فهل يدعى أحد من تلك الأبواب كلها قال ‏\"‏ نعم‏.‏ وأرجو أن تكون منهم ‏\"‏‏.‏",
      "text_en": " 'Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever gives two kinds (of things or property) in charity for Allah's Cause, will be called from the gates of Paradise and will be addressed, 'O slaves of Allah! Here is prosperity.' So, whoever was amongst the people who used to offer their prayers, will be called from the gate of the prayer; and whoever was amongst the people who used to participate in Jihad, will be called from the gate of Jihad; and whoever was amongst those who used to observe fasts, will be called from the gate of Ar-Raiyan; whoever was amongst those who used to give in charity, will be called from the gate of charity.\" Abu Bakr said, \"Let my parents be sacrificed for you, O Allah's Apostle! No distress or need will befall him who will be called from those gates. Will there be any one who will be called from all these gates?\" The Prophet replied, \"Yes, and I hope you will be one of them.\"",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2576",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم ‏\"‏إذا أتي بطعام سأل عنه أهدية أم صدقة فإن قيل صدقة‏.‏ قال لأصحابه كلوا‏.‏ ولم يأكل، وإن قيل هدية‏.‏ ضرب بيده صلى الله عليه وسلم فأكل معهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Whenever a meal was brought to Allah's Apostle, he would ask whether it was a gift or Sadaqa (something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, but if it was a gift, he would hurry to share it with them.",
      "chain": [
        "30308",
        "30112",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2855",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله بن جعفر، حدثنا معن بن عيسى، حدثنا أبى بن عباس بن سهل، عن أبيه، عن جده، قال كان للنبي صلى الله عليه وسلم في حائطنا فرس يقال له اللحيف‏.‏   قال أبو عبد الله وقال بعضهم اللخيف",
      "text_en": " Narrated Sahl:                     In our garden there was a horse belonging to the Prophet called Al-Luhaif or Al-Lakhif.",
      "chain": [
        "30026",
        "30112"
      ]
    },
    {
      "hadith_no": "3572",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إبراهيم بن المنذر، قال حدثني معن، عن مالك، عن ابن شهاب، عن محمد بن جبير بن مطعم، عن أبيه  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لي خمسة أسماء أنا محمد، وأحمد، وأنا الماحي الذي يمحو الله بي الكفر، وأنا الحاشر الذي يحشر الناس على قدمي، وأنا العاقب ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     Allah's Apostle said, \"I have five names: I am Muhammad and Ahmad; I am Al-Mahi through whom Allah will eliminate infidelity; I am Al-Hashir who will be the first to be resurrected, the people being resurrected there after; and I am also Al-`Aqib (i.e. There will be no prophet after me).",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11013",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "4614",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا معن بن عيسى، حدثنا مالك، عن مخرمة بن سليمان، عن كريب، مولى عبد الله بن عباس أن عبد الله بن عباس، أخبره أنه، بات عند ميمونة زوج النبي صلى الله عليه وسلم وهى خالته قال فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى انتصف الليل، أو قبله بقليل، أو بعده بقليل، ثم استيقظ رسول الله صلى الله عليه وسلم فجعل يمسح النوم عن وجهه بيديه، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها، فأحسن وضوءه، ثم قام يصلي، فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي، وأخذ بأذني بيده اليمنى يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع حتى جاءه المؤذن، فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     That once he stayed overnight (in the house) of his aunt Maimuna. the wife of the Prophet. He added: I lay on the cushion transversely and Allah's Apostle lay along with his wife in the lengthwise direction of the pillow. Allah's Apostle slept till the middle of the night, either a bit before or a bit after it, and then woke up rubbing the traces of sleep off his face with his hands and then he recited the last ten Verses of Surat-al-`Imran, got up and went to a hanging water skin. He then performed the ablution from it, and it was perfect ablution, and then stood up to offer the prayer. I too did the same as he had done, and then went to stand beside him. Allah's Apostle put his right hand on my head and held and twisted my right ear. He then offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at. then two rak`at, and finally one rak`a, the witr. Then he lay down again till the Muadhdhin (i.e. the call-maker) came to him, whereupon he got up and offered a light two-rak`at prayer, and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
      "chain": [
        "30026",
        "30112",
        "20001",
        "11223",
        "17"
      ]
    },
    {
      "hadith_no": "4743",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا معن، قال حدثني مالك، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مفاتيح الغيب خمس لا يعلمها إلا الله لا يعلم ما في غد إلا الله، ولا يعلم ما تغيض الأرحام إلا الله ولا يعلم متى يأتي المطر أحد إلا الله، ولا تدري نفس بأى أرض تموت، ولا يعلم متى تقوم الساعة إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"The keys of Unseen are five which none knows but Allah: None knows what will happen tomorrow but Allah; none knows what is in the wombs (a male child or a female) but Allah; none knows when it will rain but Allah; none knows at what place one will die; none knows when the Hour will be established but Allah.\" (See The Qur'an 31:34.\")",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4749",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال لأصحاب الحجر ‏\"‏ لا تدخلوا على هؤلاء القوم إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     (While we were going for the Battle of Tabuk and when we reached the places of the dwellers of Al- Hijr), Allah's Apostle said about the dwellers of Al-Hijr (to us). \"Do not enter (the dwelling places) of these people unless you enter weeping, but if you weep not, then do not enter upon them, lest you be afflicted with what they were afflicted with.\"",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4988",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني مالك، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ ‏{‏يوم يقوم الناس لرب العالمين‏}‏ حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"On the Day when all mankind will stand before the Lord of the Worlds, some of them will be enveloped in their sweat up to the middle of their ears.\"",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7326",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "وقال إبراهيم بن المنذر حدثنا معن، حدثني محمد بن مسلم، عن عمرو، عن عطاء، عن ابن عباس، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "30308",
        "30112",
        "167",
        "11439",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "7479",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا معن بن عيسى، حدثني عبد الرحمن بن أبي الموالي، قال سمعت محمد بن المنكدر، يحدث عبد الله بن الحسن يقول أخبرني جابر بن عبد الله السلمي، قال كان رسول الله صلى الله عليه وسلم يعلم أصحابه الاستخارة في الأمور كلها، كما يعلم السورة من القرآن يقول ‏\"‏ إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب، اللهم فإن كنت تعلم هذا الأمر  ثم تسميه بعينه  خيرا لي في عاجل أمري وآجله  قال أو في ديني ومعاشي وعاقبة أمري  فاقدره لي، ويسره لي، ثم بارك لي فيه، اللهم وإن كنت تعلم أنه شر لي في ديني ومعاشي وعاقبة أمري  أو قال في عاجل أمري وآجله  فاصرفني عنه، واقدر لي الخير حيث كان، ثم رضني به ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     As-Salami: Allah's Apostle used to teach his companions to perform the prayer of Istikhara for each and every matter just as he used to teach them the Suras from the Qur'an He used to say, \"If anyone of you intends to do some thing, he should offer a two rak`at prayer other than the compulsory prayers, and after finishing it, he should say: O Allah! I consult You, for You have all knowledge, and appeal to You to support me with Your Power and ask for Your Bounty, for You are able to do things while I am not, and You know while I do not; and You are the Knower of the Unseen. O Allah If You know It this matter (name your matter) is good for me both at present and in the future, (or in my religion), in my this life and in the Hereafter, then fulfill it for me and make it easy for me, and then bestow Your Blessings on me in that matter. O Allah! If You know that this matter is not good for me in my religion, in my this life and in my coming Hereafter (or at present or in the future), then divert me from it and choose for me what is good wherever it may be, and make me be pleased with it.\" (See Hadith No. 391, Vol. 8)",
      "chain": [
        "30308",
        "30112",
        "20441",
        "11048",
        "19809",
        "34"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن عمرو بن يحيى، بهذا الإسناد وقال مضمض واستنثر ثلاثا ‏.‏ ولم يقل من كف واحدة ‏.‏ وزاد بعد قوله فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه وغسل رجليه ‏.‏",
      "text_en": " Malik b. Anas narrated it from 'Amr b. Yahya with the same chain of transmitters, transmitters and mentioned the rinsing (of mouth) and snuffing (of water into the nostrils) three times, but he did not mention\" from one palm,\" and made this addition:                      He moved them (his hands) for wiping to the front of his head and then the nape of his neck, then bringing them back till he reached the place from which he had begun, after which he washed his feet.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11210"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي ح وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، جميعا عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خرج إلى المقبرة فقال ‏\"‏ السلام عليكم دار قوم مؤمنين وإنا إن شاء الله بكم لاحقون ‏\"‏ ‏.‏ بمثل حديث إسماعيل بن جعفر غير أن حديث مالك ‏\"‏ فليذادن رجال عن حوضي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace The upon him) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il b. Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.",
      "chain": [
        "30367",
        "20167",
        "30410",
        "30112",
        "20001",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، جميعا عن العلاء بن عبد الرحمن، بهذا الإسناد وليس في حديث شعبة ذكر الرباط وفي حديث مالك ثنتين ‏\"‏ فذلكم الرباط فذلكم الرباط ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ali' b. 'Abd al-Rahman with the same chain of transmitters and there is no mention of the word of al-Ribat in the hadith transmitted by Shu'ba and in the badith narrated by Malik\" Ribat\" has been mentioned twice. This is the\" Ribat\" for you, this is the\" Ribat\" for you.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "30170",
        "20173",
        "20020",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "411",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا معن بن عيسى، عن مالك بن أنس، عن الزهري، عن أنس، أن رسول الله صلى الله عليه وسلم ركب فرسا فصرع عنه فجحش شقه الأيمن ‏.‏ بنحو حديثهم وفيه ‏\"‏ إذا صلى قائما فصلوا قياما ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) rode a horse and fell down from it and his right side was grazed, and the rest of the hadith is the same, and (these words) are found in it:\" When he (the Imam) says prayer in an erect posture, you should also say it in an erect posture.\"",
      "chain": [
        "30421",
        "30112",
        "20001",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن محمد الجرمي، وعبيد الله بن سعيد، قالا حدثنا أبو أسامة، عن مسعر، عن معن، قال سمعت أبي قال، سألت مسروقا من آذن النبي صلى الله عليه وسلم بالجن ليلة استمعوا القرآن فقال حدثني أبوك - يعني ابن مسعود - أنه آذنته بهم شجرة ‏.‏",
      "text_en": " Ma'n reported.. I heard it from my father who said:                      I asked Masruq who informed the Messenger of Allah (may peace be upon him) about the night when they heard the Qur'an. He said: Your father, Ibn Mas'ud, narrated it to me that a tree informed him about that.",
      "chain": [
        "30195",
        "30359",
        "20318",
        "20359",
        "30112"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، ومحمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان الحر فأبردوا عن الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏ وذكر ‏\"‏ أن النار اشتكت إلى ربها فأذن لها في كل عام بنفسين نفس في الشتاء ونفس في الصيف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When it is hot, make delay (in the noon prayer) till it cools down, for the intensity of beat is from the Exhalation of Hell; and lie also mentioned that the Hellfire complained to the Lord (about the congested atmosphere) and so it was permitted to take two exhalation during the whole year, one exhalation during the winter and one exhalation during the summer.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11189",
        "10567",
        "11218",
        "13"
      ]
    },
    {
      "hadith_no": "1491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وإسحاق بن موسى الأنصاري، قالا حدثنا معن، عن مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء متلفعات بمروطهن ما يعرفن من الغلس ‏.‏ وقال الأنصاري في روايته متلففات ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to observe the morning prayer, and the women would go back wrapped in their mantles being unrecognisable because of the darkness before dawn. (Ishaq b. Musa) al-Ansari (one of the transmitters in this chain of narration) narrated\" wrapped\" (only) in his narration. (No mention was made of mantles.)",
      "chain": [
        "30395",
        "30410",
        "30112",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3344",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - عن أيوب، ح وحدثنا ابن أبي عمر، حدثنا معن، عن مالك، ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثله إلا حديث أيوب فإن فيه التكبير مرتين ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Umar through another chain of transmitters (but with one alteration) that here Allah-o-Akbar is mentioned twice.",
      "chain": [
        "30022",
        "20208",
        "11015",
        "30421",
        "30112",
        "20001",
        "20172",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5095",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا معن بن عيسى، حدثني معاوية، عن  عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم في الذي يدرك صيده بعد ثلاث ‏\"‏ فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba reported Allah's Apostle (may peace be upon him) as saying about one who comes three days later on the game he has shot:                      Eat it, provided it has not gone rotten.",
      "chain": [
        "30560",
        "30112",
        "27",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "5223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثني زهير بن حرب، حدثنا معن بن عيسى، حدثنا معاوية بن صالح، عن أبي، الزاهرية عن جبير بن نفير، عن ثوبان، قال ذبح رسول الله صلى الله عليه وسلم ضحيته ثم قال ‏\"‏ يا ثوبان أصلح لحم هذه ‏\"‏ ‏.‏ فلم أزل أطعمه منها حتى قدم المدينة ‏.‏",
      "text_en": " Thauban reported that Allah's Messenger (way peace be upon him) slaughtered his sacrificial animal and then said:                      Thauban, make his meat usable (for journey), and I continuously served him that until he arrived in Medina.",
      "chain": [
        "30022",
        "30112",
        "20675",
        "10901",
        "4097",
        "130"
      ]
    },
    {
      "hadith_no": "5338",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا صالح بن مسمار السلمي، حدثنا معن، حدثنا عبد العزيز بن المطلب، عن  موسى بن عقبة، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Musa b. Uqba with the same chain of transmitters.",
      "chain": [
        "30548",
        "30112",
        "20511"
      ]
    },
    {
      "hadith_no": "5991",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه هارون بن عبد الله، وعبد الله بن جعفر، عن معن بن عيسى، عن مالك، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بذلك ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar also.",
      "chain": [
        "30524",
        "108",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6081",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثني أبو الطاهر أخبرنا ابن وهب، عن مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن  أنس بن مالك، أنه قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر فالتمس الناس الوضوء فلم يجدوه فأتي رسول الله صلى الله عليه وسلم بوضوء فوضع رسول الله صلى الله عليه وسلم في ذلك الإناء يده وأمر الناس أن يتوضئوا منه - قال - فرأيت الماء ينبع من تحت أصابعه فتوضأ الناس حتى توضئوا من عند آخرهم ‏.‏",
      "text_en": " Anas b. Malik reported:                      I saw Allah's Messenger (may peace be upon him) during the time of the afternoon prayer and the people asking for water for performing ablution which they did not find. (A small quantity) of water was brought to Allah's Messenger (may peace be upon him) and he placed his hand in that vessel and commanded people to perform ablution. I saw water spouting from his fingers and the people performing ablution until the last amongst them performed it.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "20029",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6320",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن جعفر بن يحيى بن خالد، حدثنا معن، حدثنا مالك، عن أبي، النضر عن عبيد بن حنين، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم جلس على المنبر فقال ‏\"‏ عبد خيره الله بين أن يؤتيه زهرة الدنيا وبين ما عنده فاختار ما عنده ‏\"‏ ‏.‏ فبكى أبو بكر وبكى فقال فديناك بآبائنا وأمهاتنا ‏.‏ قال فكان رسول الله صلى الله عليه وسلم هو المخير وكان أبو بكر أعلمنا به ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أمن الناس على في ماله وصحبته أبو بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن أخوة الإسلام لا تبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) sat on the pulpit and said:                      Allah gave a choice to His servant that he may opt the beauties of the world or that which is with Him and the servant chose that which was with Him. Thereupon Abu Bakr wept and he wept bitterly and said: Let our fathers and our mothers be taken as ransom for you. It was Allah's Messenger (may peace be upon him) who had been given the choice and Abu Bakr knew it better than us, and Allah's Messenger (may peace be upon him) is reported to have said: Behold, of all people the most generous toward me in regard to his companionship and his property was Abu Bakr and were I to choose anyone as my bosom friend, I would have chosen Abu Bakr as my dear friend, but (for him) I cherish Islamic brotherliness and love. There shall be left open no window in the mosque except Abu Bakr's window.",
      "chain": [
        "30112",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "6553",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عبد الله بن جعفر بن يحيى بن خالد، أخبرنا معن، أخبرنا مالك، ح وحدثنا  عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، عن الأعرج، عن أبي، هريرة بهذا الحديث غير أن مالكا، انتهى حديثه عند انقضاء قول أبي هريرة ولم يذكر في حديثه الرواية عن النبي صلى الله عليه وسلم ‏\"‏ من يبسط ثوبه ‏\"‏ ‏.‏ إلى آخره ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira but with the variation that the hadith transmitted on the authority of Malik conclude with the words of Abu Huraira and there is no mention of a transmission of these from Allah's Apostle (may peace be upon him):                     \" who spreads his cloth,\" to the end.",
      "chain": [
        "30112",
        "20001",
        "30553",
        "20121",
        "11013",
        "11197"
      ]
    },
    {
      "hadith_no": "6842",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني هارون بن عبد الله، وعبد الله بن جعفر بن يحيى بن خالد، جميعا عن  معن بن عيسى، عن مالك بن أنس، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث جويرية ‏.‏",
      "text_en": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7322",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني عبد الله بن جعفر بن يحيى بن خالد، حدثنا معن، حدثنا مالك، ح وحدثني  هارون بن سعيد الأيلي، - واللفظ له - حدثنا عبد الله بن وهب، أخبرني مالك بن أنس، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة ليتراءون أهل الغرف من فوقهم كما تتراءون الكوكب الدري الغابر من الأفق من المشرق أو المغرب لتفاضل ما بينهم ‏\"‏ ‏.‏ قالوا يا رسول الله تلك منازل الأنبياء لا يبلغها غيرهم ‏.‏ قال ‏\"‏ بلى والذي نفسي بيده رجال آمنوا بالله وصدقوا المرسلين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      The inmates of Paradise would see the inmates of the apartment over them just as you see the shining planets which remain in the eastern and the western horizon because of the superiority some have over others. They said: Allah's Messenger, would in these abodes of Apostles others besides them not be able to reach? He said: Yes, they will, by Him, in Whose hand is my life, those who believe in God and acknowledge the Truth, will reach them.",
      "chain": [
        "30112",
        "20001",
        "20029",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "7383",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس يعني ابن عياض، ح وحدثني  سويد بن سعيد، حدثنا حفص بن ميسرة، كلاهما عن موسى بن عقبة، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو خالد الأحمر، وعيسى بن يونس، عن ابن عون، ح وحدثني عبد، الله بن جعفر بن يحيى حدثنا معن، حدثنا مالك، ح وحدثني أبو نصر التمار، حدثنا حماد، بن سلمة عن أيوب، ح وحدثنا الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث عبيد الله عن نافع ‏.‏ غير أن في حديث موسى بن عقبة وصالح ‏\"‏ حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar but with a slight variation of wording (and the words are):                     \" One of them would be completely submerged in perspiration up to half of his ears.\"",
      "chain": [
        "30413",
        "20157",
        "30547",
        "20421",
        "11106",
        "30201",
        "20326",
        "20347",
        "11071",
        "30112",
        "20001"
      ]
    },
    {
      "hadith_no": "577",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا معن بن عيسى، عن سعيد بن السائب، عن نوح بن صعصعة، عن يزيد بن عامر، قال جئت والنبي صلى الله عليه وسلم في الصلاة فجلست ولم أدخل معهم في الصلاة - قال - فانصرف علينا رسول الله صلى الله عليه وسلم فرأى يزيد جالسا فقال ‏\"‏ ألم تسلم يا يزيد ‏\"‏ ‏.‏ قال بلى يا رسول الله قد أسلمت ‏.‏ قال ‏\"‏ فما منعك أن تدخل مع الناس في صلاتهم ‏\"‏ ‏.‏ قال إني كنت قد صليت في منزلي وأنا أحسب أن قد صليتم ‏.‏ فقال ‏\"‏ إذا جئت إلى الصلاة فوجدت الناس فصل معهم وإن كنت قد صليت تكن لك نافلة وهذه مكتوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated Yazid ibn Amir:                     I came while the Prophet (ﷺ) was saying the prayer. I sat down and did not pray along with them. The Messenger of Allah (ﷺ) turned towards us and saw that Yazid was sitting there. He said: Did you not embrace Islam, Yazid? He replied: Why not, Messenger of Allah; I have embraced Islam. He said: What prevented you from saying prayer along with the people? He replied: I have already prayed in my house, and I thought that you had prayed (in congregation). He said: When you come to pray (in the mosque) and find the people praying, then you should pray along with them, though you have already prayed. This will be a supererogatory prayer for you and that will be counted as obligatory.",
      "chain": [
        "30367",
        "30112",
        "28202",
        "13129"
      ]
    },
    {
      "hadith_no": "1866",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن جعفر البرمكي، حدثنا معن، عن مالك، ح وحدثنا مسدد، وابن، حنبل عن يحيى، ح وحدثنا عثمان بن أبي شيبة، حدثنا أبو أسامة، جميعا عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يدخل مكة من الثنية العليا - قالا عن يحيى إن النبي صلى الله عليه وسلم كان يدخل مكة من كداء من ثنية البطحاء - ويخرج من الثنية السفلى ‏.‏ زاد البرمكي يعني ثنيتى مكة وحديث مسدد أتم ‏.‏",
      "text_en": " Ibn ‘Umar said The Prophet (ﷺ) used to enter Makkah from the upper hillock. The version of Yahya goes:                      The Prophet (ﷺ) used to enter Makkah from Kuda’ from the hillock of Batha’. He would come out from the lower hillock.Al Barmaki added “that is the two hillocks of Makkah”. The version of Musaddad is more complete.",
      "chain": [
        "30507",
        "30112",
        "20001",
        "30175",
        "20031",
        "30203",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3133",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا معن بن عيسى، ح وحدثنا عبيد الله بن عمر الجشمي، حدثنا عبد الرحمن بن مهدي، عن إبراهيم بن طهمان، عن أبي الزبير، عن جابر، قال رمي رجل بسهم في صدره أو في حلقه فمات فأدرج في ثيابه كما هو - قال - ونحن مع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     A man had a shot of arrow in his chest or throat (the narrator is doubtful). So he died. He was shrouded in his clothes as he was. The narrator said: We were with the Messenger of Allah (ﷺ).",
      "chain": [
        "30367",
        "30112",
        "20033",
        "20187",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى القزاز، حدثنا مالك بن أنس، ح وحدثنا قتيبة، عن مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا توضأ العبد المسلم أو المؤمن فغسل وجهه خرجت من وجهه كل خطيئة نظر إليها بعينيه مع الماء أو مع آخر قطر الماء أو نحو هذا وإذا غسل يديه خرجت من يديه كل خطيئة بطشتها يداه مع الماء أو مع آخر قطر الماء حتى يخرج نقيا من الذنوب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو حديث مالك عن سهيل عن أبيه عن أبي هريرة ‏.‏ وأبو صالح والد سهيل هو أبو صالح السمان واسمه ذكوان ‏.‏ وأبو هريرة اختلف في اسمه فقالوا عبد شمس وقالوا عبد الله بن عمرو وهكذا قال محمد بن إسماعيل وهو الأصح ‏.‏ قال أبو عيسى وفي الباب عن عثمان بن عفان وثوبان والصنابحي وعمرو بن عبسة وسلمان وعبد الله بن عمرو ‏.‏ والصنابحي الذي روى عن أبي بكر الصديق ليس له سماع من رسول الله صلى الله عليه وسلم واسمه عبد الرحمن بن عسيلة ويكنى أبا عبد الله رحل إلى النبي صلى الله عليه وسلم فقبض النبي صلى الله عليه وسلم وهو في الطريق وقد روى عن النبي صلى الله عليه وسلم أحاديث ‏.‏ والصنابح بن الأعسر الأحمسي صاحب النبي صلى الله عليه وسلم يقال له الصنابحي أيضا وإنما حديثه قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إني مكاثر بكم الأمم فلا تقتتلن بعدي ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"When a Muslim, or believer, performs Wudu', washing his face, every evil that he looked at with his eyes leaves with the water - or with the last drop of water, or an expression similar to that - and when he washes his hands, every evil he did with his hands leaves with the water - or with the last drop of water - until he becomes free of sin.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "30367",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى القزاز، حدثنا مالك بن أنس، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أن رسول الله صلى الله عليه وسلم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏ قال أبو عيسى وفي الباب عن معاوية والمقدام بن معديكرب وعائشة ‏.‏ قال أبو عيسى حديث عبد الله بن زيد أصح شيء في هذا الباب وأحسن وبه يقول الشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abdullah bin Zaid narrated that:                     \"Allah's Messenger wiped over his head with his hands, going over the front with them and the rear. He began with the front of his head until they went to the nape of his neck. Then he brought them back again to the place where he began. Then he washed his feet.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "69",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، عن مالك، ح وحدثنا الأنصاري، إسحاق بن موسى حدثنا معن، حدثنا مالك، عن صفوان بن سليم، عن سعيد بن سلمة، من آل ابن الأزرق أن المغيرة بن أبي بردة، وهو من بني عبد الدار أخبره أنه، سمع أبا هريرة، يقول سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏ قال وفي الباب عن جابر والفراسي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول أكثر الفقهاء من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وابن عباس لم يروا بأسا بماء البحر ‏.‏ وقد كره بعض أصحاب النبي صلى الله عليه وسلم الوضوء بماء البحر منهم ابن عمر وعبد الله بن عمرو ‏.‏ وقال عبد الله بن عمرو هو نار ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"A man asked Allah's Messenger 'O Messenger of Allah! We sail the seas, and we only carry a little water with us. If we use it for Wudu then we will go thirsty. So shall we perform Wudu from the (water of the) sea?' Allah's Messenger said: 'Its water is pure, and its dead are lawful.'\"",
      "chain": [
        "30367",
        "20001",
        "30112",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "hadith_no": "92",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب بن مالك، وكانت، عند ابن أبي قتادة أن أبا قتادة، دخل عليها ‏.‏ قالت فسكبت له وضوءا قالت فجاءت هرة تشرب فأصغى لها الإناء حتى شربت قالت كبشة فرآني أنظر إليه فقال أتعجبين يا بنت أخي فقلت نعم ‏.‏ قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ليست بنجس إنما هي من الطوافين عليكم أو الطوافات ‏\"‏ ‏.‏ وهو قول أكثر العلماء من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم مثل الشافعي وأحمد وإسحاق لم يروا بسؤر الهرة بأسا ‏.‏ وهذا أحسن شيء روي في هذا الباب ‏.‏ وقد جود مالك هذا الحديث عن إسحاق بن عبد الله بن أبي طلحة ولم يأت به أحد أتم من مالك ‏.‏",
      "text_en": " Humaidah bint Ubaid bin Rifa'ah narrated:                     \"Kabshah bint Ka'b bin Malik - she was (married) with Ibn Abi Qatadah - narrated \"That Abu Qatadah visited her, [so she said:] 'So I poured water for him to use for Wudu.' She said: 'A cat came to drink, so he lowered he container until it drank.' Kabshah said: 'So he saw me looking at it and said, \"O my niece! Are you surprised at that?\" So I said yes. He said: \"Indeed Allah's  Messenger said 'It is not impure, it is only one of those roam around among you.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11151",
        "19957",
        "1155"
      ]
    },
    {
      "hadith_no": "153",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، قال وحدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء قال الأنصاري فيمر النساء متلففات بمروطهن ما يعرفن من الغلس ‏.‏ وقال قتيبة متلفعات ‏.‏ قال وفي الباب عن ابن عمر وأنس وقيلة بنت مخرمة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وقد رواه الزهري عن عروة عن عائشة نحوه ‏.‏ وهو الذي اختاره غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر ومن بعدهم من التابعين وبه يقول الشافعي وأحمد وإسحاق يستحبون التغليس بصلاة الفجر ‏.‏",
      "text_en": " Aishah narrated:                     \"Allah's Messenger would pray Subh (at such time that) the women would leave (after the prayer)\" - AI-AnsarI (one of the narrators) said - the women would pass by wrapped in their Mirts and they would not be recognizable due to the darkness.\" And Qutaibah said: \"covered.\" (instead of \"wrapped.\")",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "186",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏.‏ وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وبه يقول أصحابنا والشافعي وأحمد وإسحاق ‏.‏ ومعنى هذا الحديث عندهم لصاحب العذر مثل الرجل ينام عن الصلاة أو ينساها فيستيقظ ويذكر عند طلوع الشمس وعند غروبها ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Whoever catches a Rak'ah of Subh before the sun has risen, then he has caught Subh. Whoever catches a Rak'ah of Asr before the sun has set, then he has caught Asr.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "208",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ‏.‏ قال وحدثنا قتيبة، عن مالك، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سمعتم النداء فقولوا مثل ما يقول المؤذن ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي رافع وأبي هريرة وأم حبيبة وعبد الله بن عمرو وعبد الله بن ربيعة وعائشة ومعاذ بن أنس ومعاوية ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح ‏.‏ وهكذا روى معمر وغير واحد عن الزهري مثل حديث مالك ‏.‏ وروى عبد الرحمن بن إسحاق عن الزهري هذا الحديث عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ ورواية مالك أصح ‏.‏",
      "text_en": " Abu Sa'eed narrated that :                     Allah's Messenger said: \"Whenyou hear the call (to prayer) then say the similar to what the Mu'adh-dhin says\"",
      "chain": [
        "30410",
        "30112",
        "30367",
        "20001",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "216",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن صلاة الرجل في الجماعة تزيد على صلاته وحده بخمسة وعشرين جزءا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Indeed a man's Salat in the congregation is increased by twenty five rewards over his Salat alone.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته فأكل منه ثم قال ‏\"‏ قوموا فلنصل بكم ‏\"‏ ‏.‏ قال أنس فقمت إلى حصير لنا قد اسود من طول ما لبس فنضحته بالماء فقام عليه رسول الله صلى الله عليه وسلم وصففت عليه أنا واليتيم وراءه والعجوز من ورائنا فصلى بنا ركعتين ثم انصرف ‏\"‏ ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم قالوا إذا كان مع الإمام رجل وامرأة قام الرجل عن يمين الإمام والمرأة خلفهما ‏.‏ وقد احتج بعض الناس بهذا الحديث في إجازة الصلاة إذا كان الرجل خلف الصف وحده وقالوا إن الصبي لم تكن له صلاة وكأن أنسا كان خلف النبي صلى الله عليه وسلم وحده في الصف ‏.‏ وليس الأمر على ما ذهبوا إليه لأن النبي صلى الله عليه وسلم أقامه مع اليتيم خلفه فلولا أن النبي صلى الله عليه وسلم جعل لليتيم صلاة لما أقام اليتيم معه ولأقامه عن يمينه ‏.‏ وقد روي عن موسى بن أنس عن أنس أنه صلى مع النبي صلى الله عليه وسلم فأقامه عن يمينه ‏.‏ وفي هذا الحديث دلالة أنه إنما صلى تطوعا أراد إدخال البركة عليهم ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"My grandmother Mutalikah invited Allah's Messenger to a meal that she prepared. He ate from it, then said: 'Stand so tht we may lead you in prayer.'\" He said: \"I got a Hasir of our which had become dark because of prolonged use, so I washed it with water. Allah's Messenger stood on it, and the orphan and I aligned behind him and the only lady stood behind us. He (Allah's Messenger) led us in two Rak'ah of prayer and then left.\"",
      "chain": [
        "30112",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "264",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، ح وحدثنا قتيبة، عن مالك، عن نافع، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم نهى عن لبس القسي والمعصفر وعن تختم الذهب وعن قراءة القرآن في الركوع ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ وهو قول أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم كرهوا القراءة في الركوع والسجود ‏.‏",
      "text_en": " Ali bin Abi Talib narrated:                     \"The Prophet prohibited wearing Qassi, and that which is dyed with safflower, and from the gold ring, and from reciting the Quran while bowing.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "30367",
        "20001",
        "11014",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده ‏.‏ فقولوا ربنا ولك الحمد فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم أن يقول الإمام سمع الله لمن حمده ربنا ولك الحمد ‏.‏ ويقول من خلف الإمام ربنا ولك الحمد ‏.‏ وبه يقول أحمد ‏.‏ وقال ابن سيرين وغيره يقول من خلف الإمام سمع الله لمن حمده ربنا ولك الحمد ‏.‏ مثل ما يقول الإمام ‏.‏ وبه يقول الشافعي وإسحاق ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"When the Imam says:  (Sami Allahu liman hamidah) 'Allah listens to those who praise Him. Then (all of you) say: (Rabbana wa lakal-hamd) 'O our Lord! And to You is the praise for whoever's saying concurs with the saying of the angels, then his past sins will be forgiven.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "312",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن ابن أكيمة الليثي، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم انصرف من صلاة جهر فيها بالقراءة فقال ‏\"‏ هل قرأ معي أحد منكم آنفا ‏\"‏ ‏.‏ فقال رجل نعم يا رسول الله ‏.‏ قال ‏\"‏ إني أقول ما لي أنازع القرآن ‏\"‏ ‏.‏ قال فانتهى الناس عن القراءة مع رسول الله صلى الله عليه وسلم فيما جهر فيه رسول الله صلى الله عليه وسلم من الصلوات بالقراءة حين سمعوا ذلك من رسول الله صلى الله عليه وسلم ‏.‏ قال وفي الباب عن ابن مسعود وعمران بن حصين وجابر بن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وابن أكيمة الليثي اسمه عمارة ‏.‏ ويقال عمرو بن أكيمة ‏.‏ وروى بعض أصحاب الزهري هذا الحديث وذكروا هذا الحرف قال قال الزهري فانتهى الناس عن القراءة حين سمعوا ذلك من رسول الله صلى الله عليه وسلم ‏.‏ وليس في هذا الحديث ما يدخل على من رأى القراءة خلف الإمام لأن أبا هريرة هو الذي روى عن النبي صلى الله عليه وسلم هذا الحديث وروى أبو هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج فهي خداج غير تمام ‏\"‏ ‏.‏ فقال له حامل الحديث إني أكون أحيانا وراء الإمام قال اقرأ بها في نفسك ‏.‏ وروى أبو عثمان النهدي عن أبي هريرة قال أمرني النبي صلى الله عليه وسلم أن أنادي أن لا صلاة إلا بقراءة فاتحة الكتاب ‏.‏ واختار أكثر أصحاب الحديث أن لا يقرأ الرجل إذا جهر الإمام بالقراءة وقالوا يتتبع سكتات الإمام ‏.‏ وقد اختلف أهل العلم في القراءة خلف الإمام فرأى أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم القراءة خلف الإمام وبه يقول مالك بن أنس وعبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏ وروي عن عبد الله بن المبارك أنه قال أنا أقرأ خلف الإمام والناس يقرءون إلا قوما من الكوفيين وأرى أن من لم يقرأ صلاته جائزة ‏.‏ وشدد قوم من أهل العلم في ترك قراءة فاتحة الكتاب وإن كان خلف الإمام فقالوا لا تجزئ صلاة إلا بقراءة فاتحة الكتاب وحده كان أو خلف الإمام ‏.‏ وذهبوا إلى ما روى عبادة بن الصامت عن النبي صلى الله عليه وسلم ‏.‏ وقرأ عبادة بن الصامت بعد النبي صلى الله عليه وسلم خلف الإمام وتأول قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة إلا بقراءة فاتحة الكتاب ‏\"‏ ‏.‏ وبه يقول الشافعي وإسحاق وغيرهما ‏.‏ وأما أحمد بن حنبل فقال معنى قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ إذا كان وحده ‏.‏ واحتج بحديث جابر بن عبد الله حيث قال من صلى ركعة لم يقرأ فيها بأم القرآن فلم يصل إلا أن يكون وراء الإمام ‏.‏ قال أحمد بن حنبل فهذا رجل من أصحاب النبي صلى الله عليه وسلم تأول قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ أن هذا إذا كان وحده ‏.‏ واختار أحمد مع هذا القراءة خلف الإمام وأن لا يترك الرجل فاتحة الكتاب وإن كان خلف الإمام ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger turned (after praying) from a Salat in which he recited aloud and said: 'Has any one of you recite along with me just now?' A man said: 'Yes, O Messenger of Allah.' He said: 'Indeed I said to myself: Why was I being contended with for the Quran?'\" He (Az-Zuhri one of the narrators) said: \"So when they heard that from Allah's Messenger, the people stopped reciting with Allah's Messenger in the prayers that Allah's Messenger recited aloud.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن أبي نعيم، وهب بن كيسان أنه سمع جابر بن عبد الله، يقول من صلى ركعة لم يقرأ فيها بأم القرآن فلم يصل إلا أن يكون وراء الإمام ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Nu'aim Wahb bin Kaisan narated that he heard Jabir bin  'Abdullah saying:                      \"Whoever prayed a Rak'ah in which he did not recite Umm Al-Qur'an, then he did not pray except if he was behind an Imam.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "20348",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن زيد بن رباح، وعبيد الله بن أبي عبد الله الأغر، عن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة في مسجدي هذا خير من ألف صلاة فيما سواه إلا المسجد الحرام ‏\"‏ ‏.‏ قال أبو عيسى ولم يذكر قتيبة في حديثه عن عبيد الله إنما ذكر عن زيد بن رباح عن أبي عبد الله الأغر عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو عبد الله الأغر اسمه سلمان ‏.‏ وقد روي عن أبي هريرة من غير وجه عن النبي صلى الله عليه وسلم ‏.‏ قال وفي الباب عن علي وميمونة وأبي سعيد وجبير بن مطعم وابن عمر وعبد الله بن الزبير وأبي ذر ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Salat is this Masjid of mine is better than a thousand Salat in another, except for Masjid Al-Haram.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11508",
        "11707",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة قال أبو عيسى وفي الباب عن أبي سعيد الخدري وأبي هريرة وابن عمر وعبد الله بن عمرو ‏.‏ قال أبو عيسى وحديث أبي جهيم حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لأن يقف أحدكم مائة عام خير له من أن يمر بين يدى أخيه وهو يصلي ‏\"‏ ‏.‏ والعمل عليه عند أهل العلم كرهوا المرور بين يدى المصلي ولم يروا أن ذلك يقطع صلاة الرجل ‏.‏ واسم أبي النضر سالم مولى عمر بن عبيد الله المديني ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhni sent a message to Abu Juhaim asking him what he had heard from Allah's Messenger about passing in front of a person who was performing Salat. Abu Juhaim said :                     that Allah's Messenger said: \"If the one who passed in front of the person performing Salat knew what he was doing, then for him to stop (and wait for forty) would be better for him than to pass in front of him.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "373",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة السهمي، عن حفصة، زوج النبي صلى الله عليه وسلم أنها قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا حتى كان قبل وفاته صلى الله عليه وسلم بعام فإنه كان يصلي في سبحته قاعدا ويقرأ بالسورة ويرتلها حتى تكون أطول من أطول منها ‏.‏ وفي الباب عن أم سلمة وأنس بن مالك ‏.‏ قال أبو عيسى حديث حفصة حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يصلي من الليل جالسا فإذا بقي من قراءته قدر ثلاثين أو أربعين آية قام فقرأ ثم ركع ثم صنع في الركعة الثانية مثل ذلك ‏.‏ وروي عنه أنه كان يصلي قاعدا فإذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ وهو قاعد ركع وسجد وهو قاعد ‏.‏ قال أحمد وإسحاق والعمل على كلا الحديثين ‏.‏ كأنهما رأيا كلا الحديثين صحيحا معمولا بهما ‏.‏",
      "text_en": " Hafsah, the wife of the Prophet (S), narrated:                     \"I did not see Allah's Messenger (S) praying voluntary prayers sitting until the year before he died. Then he would perform Salat for the voluntary prayers sitting, and he would recite a Surah and prolong it such that it would be longer than the longest of them.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11013",
        "3048",
        "5295"
      ]
    }
  ],
  "total_hadiths": 151
}