{
  "id": "30114",
  "name": "Hassan bin Hassan حسان بن حسان",
  "full_name": "Hassan bin Hassan حسان بن حسان",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "213",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Basri",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24229",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1806",
      "hadith_no": "1806",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا حسان بن حسان، حدثنا همام، عن قتادة، سألت أنسا  رضى الله عنه  كم اعتمر النبي صلى الله عليه وسلم قال أربع عمرة الحديبية في ذي القعدة، حيث صده المشركون، وعمرة من العام المقبل في ذي القعدة، حيث صالحهم، وعمرة الجعرانة إذ قسم غنيمة أراه حنين‏.‏ قلت كم حج قال واحدة‏.‏",
      "text_en": " Narrated Qatada:                     I asked Anas how many times the Prophet had performed `Umra. He replied, \"Four times. 1. `Umra of Hudaibiya in Dhi-l-Qa'da when the pagans hindered him; 2. `Umra in the following year in Dhi-l- Qa'da after the peace treaty with them (the pagans); 3. `Umra from Al-Ja'rana where he distributed the war booty.\" I think he meant the booty (of the battle) of Hunain. I asked, \"How many times did he perform Hajj?\" He (Anas) replied, \"Once. \"",
      "usc_msa_ref": "",
      "chain": [
        "30114",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4098",
      "hadith_no": "4098",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "أخبرنا حسان بن حسان، حدثنا محمد بن طلحة، حدثنا حميد، عن أنس  رضى الله عنه  أن عمه، غاب عن بدر فقال غبت عن أول قتال النبي صلى الله عليه وسلم، لئن أشهدني الله مع النبي صلى الله عليه وسلم ليرين الله ما أجد‏.‏ فلقي يوم أحد، فهزم الناس فقال اللهم إني أعتذر إليك مما صنع هؤلاء  يعني المسلمين  وأبرأ إليك مما جاء به المشركون‏.‏ فتقدم بسيفه فلقي سعد بن معاذ فقال أين يا سعد إني أجد ريح الجنة دون أحد‏.‏ فمضى فقتل، فما عرف حتى عرفته أخته بشامة أو ببنانه، وبه بضع وثمانون من طعنة وضربة ورمية بسهم‏.‏",
      "text_en": "      Narrated Anas:                          His uncle (Anas bin An-Nadr) was absent from the battle     of Badr and he said, \"I was absent from the first battle of the      Prophet (i.e. Badr battle), and if Allah should let me participate in      (a battle) with the Prophet, Allah will see how strongly I will      fight.\" So he encountered the day of Uhud battle. The Muslims fled and     he said, \"O Allah ! I appeal to You to excuse me for what these people     (i.e. the Muslims) have done, and I am clear from what the pagans have     done.\" Then he went forward with his sword and met Sad bin Mu'adh      (fleeing), and asked him, \"Where are you going, O Sad? I detect a      smell of Paradise before Uhud.\" Then he proceeded on and was martyred.     No-body was able to recognize him till his sister recognized him by a      mole on his body or by the tips of his fingers. He had over 80 wounds      caused by stabbing, striking or shooting with arrows.",
      "usc_msa_ref": "378",
      "chain": [
        "30114",
        "20604",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5012",
      "hadith_no": "5012",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حسان بن حسان، حدثنا همام، عن قتادة، عن أنس  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لأبى ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏‏.‏ قال أبى آلله سماني لك قال ‏\"‏ الله سماك لي ‏\"‏‏.‏ فجعل أبى يبكي‏.‏ قال قتادة فأنبئت أنه قرأ عليه ‏{‏لم يكن الذين كفروا من أهل الكتاب‏}‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said to Ubai, \"Allah has ordered me recite Qur'an to you.\" Ubai asked, \"Did Allah mention me by name to you?\" The Prophet said, \"Allah has mentioned your name to me.\" On that Ubai started weeping. (The sub-narrator) Qatada added: I have been informed that the Prophet recited: 'Those who disbelieve among the people of the Scripture,\" ...to Ubai.",
      "usc_msa_ref": "484",
      "chain": [
        "30114",
        "20297",
        "11019",
        "19"
      ]
    }
  ],
  "total_hadiths": 3
}