{
  "id": "30116",
  "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
  "full_name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "227",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Khurasni",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20533",
      "name": "al-Harith bin 'Ubaid al-Ayadi الحارث بن عبيد الإيادي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20192",
      "name": "Da'ud bin 'Abdur Rahman al-'Atar داود بن عبد الرحمن العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20437",
      "name": "'Abd Rabah bin Nafi',Abu Shahab al-Hanat عبد ربه بن نافع أبو شهاب الحناط",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38556",
      "name": "Muhammad bin 'Ali in Maymun محمد بن علي بن ميمون",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "39078",
      "name": "Ahmed bin Khlyd bin Yazid أحمد بن خليد",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-872",
      "hadith_no": "872",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن منصور، حدثنا فليح، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يصلي الصبح بغلس فينصرفن نساء المؤمنين، لا يعرفن من الغلس، أو لا يعرف بعضهن بعضا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
      "usc_msa_ref": "831",
      "chain": [
        "30221",
        "30116",
        "20169",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-346",
      "hadith_no": "346",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، ومحمد بن عبيد الغبري، - واللفظ لسعيد - قالوا حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله تجاوز لأمتي ما حدثت به أنفسها ما لم يتكلموا أو يعملوا به ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Verily Allah forgave my people the evil promptings which arise within their hearts as long as they did not speak about them or did not act upon them.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "30213",
        "20469",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-500",
      "hadith_no": "500",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الربيع العتكي، حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، ح وحدثناه سعيد بن منصور، - واللفظ له - حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، قال انطلقنا إلى أنس بن مالك وتشفعنا بثابت فانتهينا إليه وهو يصلي الضحى فاستأذن لنا ثابت فدخلنا عليه وأجلس ثابتا معه على سريره فقال له يا أبا حمزة إن إخوانك من أهل البصرة يسألونك أن تحدثهم حديث الشفاعة ‏.‏ قال حدثنا محمد صلى الله عليه وسلم قال ‏\"‏ إذا كان يوم القيامة ماج الناس بعضهم إلى بعض فيأتون آدم فيقولون له اشفع لذريتك ‏.‏ فيقول لست لها ولكن عليكم بإبراهيم - عليه السلام - فإنه خليل الله ‏.‏ فيأتون إبراهيم فيقول لست لها ولكن عليكم بموسى - عليه السلام - فإنه كليم الله ‏.‏ فيؤتى موسى فيقول لست لها ولكن عليكم بعيسى - عليه السلام - فإنه روح الله وكلمته ‏.‏ فيؤتى عيسى فيقول لست لها ولكن عليكم بمحمد صلى الله عليه وسلم فأوتى فأقول أنا لها ‏.‏ فأنطلق فأستأذن على ربي فيؤذن لي فأقوم بين يديه فأحمده بمحامد لا أقدر عليه الآن يلهمنيه الله ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع فأقول رب أمتي أمتي ‏.‏ فيقال انطلق فمن كان في قلبه مثقال حبة من برة أو شعيرة من إيمان فأخرجه منها ‏.‏ فأنطلق فأفعل ثم أرجع إلى ربي فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع ‏.‏ فأقول أمتي أمتي ‏.‏ فيقال لي انطلق فمن كان في قلبه مثقال حبة من خردل من إيمان فأخرجه منها ‏.‏ فأنطلق فأفعل ثم أعود إلى ربي فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع فأقول يا رب أمتي أمتي ‏.‏ فيقال لي انطلق فمن كان في قلبه أدنى أدنى أدنى من مثقال حبة من خردل من إيمان فأخرجه من النار فأنطلق فأفعل ‏\"‏ ‏.‏ هذا حديث أنس الذي أنبأنا به فخرجنا من عنده فلما كنا بظهر الجبان قلنا لو ملنا إلى الحسن فسلمنا عليه وهو مستخف في دار أبي خليفة - قال - فدخلنا عليه فسلمنا عليه فقلنا يا أبا سعيد جئنا من عند أخيك أبي حمزة فلم نسمع مثل حديث حدثناه في الشفاعة قال هيه ‏.‏ فحدثناه الحديث ‏.‏ فقال هيه ‏.‏ قلنا ما زادنا ‏.‏ قال قد حدثنا به منذ عشرين سنة وهو يومئذ جميع ولقد ترك شيئا ما أدري أنسي الشيخ أو كره أن يحدثكم فتتكلوا ‏.‏ قلنا له حدثنا ‏.‏ فضحك وقال خلق الإنسان من عجل ما ذكرت لكم هذا إلا وأنا أريد أن أحدثكموه ‏\"‏ ثم أرجع إلى ربي في الرابعة فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعط واشفع تشفع ‏.‏ فأقول يا رب ائذن لي فيمن قال لا إله إلا الله ‏.‏ قال ليس ذاك لك - أو قال ليس ذاك إليك - ولكن وعزتي وكبريائي وعظمتي وجبريائي لأخرجن من قال لا إله إلا الله ‏\"‏ ‏.‏ قال فأشهد على الحسن أنه حدثنا به أنه سمع أنس بن مالك أراه قال قبل عشرين سنة وهو يومئذ جميع ‏.‏",
      "text_en": " Ma'bad b. Hilal al 'Anazi reported:                      We went to Anas b. Malik through Thabit and reached there (his house) while he was offering the forenoon prayer. Thabit sought permission for us and we entered, and he seated Thabit with him on his bedstead. He (Thabit) said to him (Anas b. Malik): O Abu Hamza (kunya of Anas b. Malik), your brothers from among the inhabitants of Basra ask you to narrate to them the hadith of intercession. He said: Muhammad (may peace be upon him) narrated to us: When it would be the Day of Resurrection, some of the people would rush to one another in bewilderment. They would come to Adam and say: Intercede (with your Lord) for your progeny. He would say: I am not fit to do this, but go to Ibrabim (peace be upon him) for he is the Friend of Allah. They would come to Ibrahim, but he would say: I am not fit to do this, but go to Moses, for he is Allah's Interlocutor. They would come to Moses, but he would say: I am not fit to do this, but you should go to Jesus, for he is the Spirit of Allah and His word. They would come to Jesus, and he would say, I am not fit to do this; you better go to Muhammad (may peace be upon him). They would come to me, and I would say: I am in a position to do that, I would go and ask the permission of my Lord and it would be granted to me. I would then stand before Him and would extol Him with praises which I am not able to do now, but with which Allah would inspire me, then I would fall in prostration and it would be said to me: O Muhammad, raise thy head, and say and it would be listened to; ask and it would be granted, intercede and it would be accepted. I shall say: My Lord, my people, my people It would be said: Go, and bring forth from it (Hell) him who has in his heart faith equal to the weight of a wheat grain or a barley seed. I would go and do that; then I would return to my Lord and extol Him with those praises (taught to me by Allah), then I would fall in prostration. It would be said to me: O Muhammad, raise your head, and say and it would be heard; ask and it would be granted; intercede and intercession would be accepted. So I would say: My people. my people. It would be said to me: Go and take out from it (Hell) him who has in his heart faith equal to the weight of a mustard seed. I would go and do that. I would again return to my Lord and extol Him with those praises. I would then fall in prostration. It would be said to me: O Muhammad, raisevour head: say, and you would be listened to; ask and it would be granted; intercede and intercession would be accepted. I would say: My Lord, my people, my people. It would be said to me: Go, and bring out of the Fire him who has in his heart as much faith as the smallest, smallest, smallest grain of mustard seed. I would go and do that. This is the hadith which Anas narrated to us. We went out of his (house) and when we reached the upper part of Jabban (graveyard) we said: Would that we meet Hasan and salute him and he was hiding in the house of Abu Khalifa. He (Ma'bad b. Hilal, the narrator) said: We went to him and greeted him and we said: O Abu Sa'id, we come from your brother Abu Hamza (kunya of Anas), and we have never heard a hadith like this relating to intercession, which he has narrated to us. He said: Narrate it, we narrated the hadith. He said: Narrate it (still further). We said: He did not (narrate it) before us more than this. He said: He (Anas) had narrated it to us twenty years back, when he was strong and healthy. He has in fact missed something. I cannot make out whether the old man has forgotten or he has (intentionally) avoided to narrate it to you lest you should rely (absolutely) upon it (and abandon doing good deeds). We said to him: Relate that to us, and he laughed and said: There is haste in the nature of man. I did not make mention of it to you but for the fact that I wanted to narrate that to you (and added that the Holy Prophet said): I would then return to my Lord for the fourth time and extol Him with these praises. I would then fall in prostration. It would be said to me: O Muhammad, raise your head: say and it will be listened to; ask and it will be granted; intercede and intercession would be accepted. I would say: O my Lord, permit me regarding him who professed: There is no god but Allah. He (the Lord) would say: That is not for thee or that is not what lies with thee, but by My Honour, Glory, Greatness and Might, I would certainly take him out who professed it: There is no god but Allah. He (the narrator, Ma'bad) said: I hear testimony to the fact that the hadith transmitted to us-by Hasan was heard by him from Anas b. Malik and I can see that he reported it twenty years back, when he was hale and hearty.",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "11612",
        "30116",
        "20022",
        "11612"
      ]
    },
    {
      "id": "sahih-muslim-549",
      "hadith_no": "549",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، أخبرنا حصين بن عبد الرحمن، قال كنت عند سعيد بن جبير فقال أيكم رأى الكوكب الذي انقض البارحة قلت أنا ‏.‏ ثم قلت أما إني لم أكن في صلاة ولكني لدغت ‏.‏ قال فماذا صنعت قلت استرقيت ‏.‏ قال فما حملك على ذلك قلت حديث حدثناه الشعبي ‏.‏ فقال وما حدثكم الشعبي قلت حدثنا عن بريدة بن حصيب الأسلمي أنه قال لا رقية إلا من عين أو حمة ‏.‏ فقال قد أحسن من انتهى إلى ما سمع ولكن حدثنا ابن عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ عرضت على الأمم فرأيت النبي ومعه الرهيط والنبي ومعه الرجل والرجلان والنبي ليس معه أحد إذ رفع لي سواد عظيم فظننت أنهم أمتي فقيل لي هذا موسى صلى الله عليه وسلم وقومه ولكن انظر إلى الأفق ‏.‏ فنظرت فإذا سواد عظيم فقيل لي انظر إلى الأفق الآخر ‏.‏ فإذا سواد عظيم فقيل لي هذه أمتك ومعهم سبعون ألفا يدخلون الجنة بغير حساب ولا عذاب ‏\"‏ ‏.‏ ثم نهض فدخل منزله فخاض الناس في أولئك الذين يدخلون الجنة بغير حساب ولا عذاب فقال بعضهم فلعلهم الذين صحبوا رسول الله صلى الله عليه وسلم ‏.‏ وقال بعضهم فلعلهم الذين ولدوا في الإسلام ولم يشركوا بالله ‏.‏ وذكروا أشياء فخرج عليهم رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما الذي تخوضون فيه ‏\"‏ ‏.‏ فأخبروه فقال ‏\"‏ هم الذين لا يرقون ولا يسترقون ولا يتطيرون وعلى ربهم يتوكلون ‏\"‏ ‏.‏ فقام عكاشة بن محصن فقال ادع الله أن يجعلني منهم ‏.‏ فقال ‏\"‏ أنت منهم ‏\"‏ ثم قام رجل آخر فقال ادع الله أن يجعلني منهم ‏.‏ فقال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
      "text_en": " Husain b. 'Abd al-Rahman reported:                      I was with Sa'id b. Jubair when he said: Who amongst you saw a star shooting last night? I said: It was I; then I said: I was in fact not (busy) in prayer, but was stung by a scorpion (and that is the reason why I was awake and had a glimpse of the shooting star). He said: Then what did you do? I said: I practised charm. He said: What urged you to do this? I said: (I did this according to the implied suggestion) of the hadith which al-Shu'ba narrated. He said: What did al-Shu'ba narrate to you? I said: Buraida b. Husaib al-Aslami narrated to us. The charm is of no avail except in case of the (evil influence) of an eye or the sting of a scorpion. He said: He who acted according to what he had heard (from the Holy Prophet) acted rightly, but Ibn 'Abbas narrated to us from the Apostle of Allah (may peace be upon him) that he said: There were brought before me the peoples and I saw an apostle and a small group (of his followers) along with him, another (apostle) and one or two persons (along with him) and (still another) apostle having no one with him. When a very large group was brought to me I conceived as if it were my Ummah. Then it was said to me: It is Moses and his people. You should look at the horizon, and I saw a very huge group. It was again said to me: See the other side of the horizon, and there was (also) a very huge group. It was said to me: This is your Ummah, and amongst them there were seventy thousand persons who would be made to enter Paradise without rendering any account and without (suffering) any torment. He then stood up and went to his house. Then the people began to talk about the people who would be admitted to Paradise without rendering any account and without (suffering) any torment. Some of them said: They may be those who (have had the good fortune of living) in the company of the Messenger of Allah (may peace be upon him) and some of them said: They be those who were born in Islam and did not associate anything with Allah. Some people mentioned other things. Thereupon came forth the Messenger of Allah (may peace be upon him) before them and he said: What was that which you were talking about? They informed him. He said: They are those persons who neither practise charm, nor ask others to practise it, nor do they take omens, and repose their trust in their Lord. Upon this 'Ukkasha b. Mihsan stood up and said: Supplicate for me that He should make me one among them. Upon this he (Messenger of Allah) said: Thou are one among them. Then another man stood up and said: Supplicate before Allah that He should make me one among them. Upon this he said: 'Ukkisha has preceded you.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20468",
        "15097",
        "11052"
      ]
    },
    {
      "id": "sahih-muslim-224-2",
      "hadith_no": "224",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، وأبو كامل الجحدري - واللفظ لسعيد - قالوا حدثنا أبو عوانة، عن سماك بن حرب، عن مصعب بن سعد، قال دخل عبد الله بن عمر على ابن عامر يعوده وهو مريض فقال ألا تدعو الله لي يا ابن عمر ‏.‏ قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏ وكنت على البصرة ‏.‏",
      "text_en": " It was narrated from Simak bin Harb, that Mus'ab bin Sa'd said:                      '\" 'Abdullah bin 'Umar came to visit Ibn 'Amir when he was sick and he said: 'Won't you supplicate to Allah for me, O Ibn 'Umar ?' He said: 'I heard the Messenger of Allah () say: \"No Salat is accepted without Wudu' (purification), and no charity (is accepted) that comes from Ghulul [1] \" and you were the governor of Al-Basrah.' \"[1] Goods pilfered from the spoils of war prior to their authorized distribution.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "30559",
        "20469",
        "10770",
        "10556",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-237-5",
      "hadith_no": "237",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا حسان بن إبراهيم، حدثنا يونس بن يزيد، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني أبو إدريس الخولاني، أنه سمع أبا هريرة، وأبا، سعيد الخدري يقولان قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " It has been transmitted by Abu Huraira and Abu Sa'id al-Khudri (both of them the reputed Companions of the Holy Prophet) that the Messenger of Allah (may peace be upon him) said like that.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20417",
        "20475",
        "30487",
        "20029",
        "20475",
        "11013",
        "11027",
        "13",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-390-2",
      "hadith_no": "390",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وسعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب وابن نمير كلهم عن سفيان بن عيينة، - واللفظ ليحيى قال أخبرنا سفيان بن عيينة، - عن الزهري، عن سالم، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم إذا افتتح الصلاة رفع يديه حتى يحاذي منكبيه وقبل أن يركع وإذا رفع من الركوع ولا يرفعهما بين السجدتين ‏.‏",
      "text_en": " Salim narrated it on the authority of his father who reported:                      I saw the Messenger of Allah (may peace be upon him) raising his hands apposite the shoulders at the time of beginning the prayer and before bowing down and after coming back to the position after bowing. but he did not raise them between two prostrations.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "20005",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-398-2",
      "hadith_no": "398",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، كلاهما عن أبي عوانة، قال سعيد حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن عمران بن حصين، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة الظهر - أو العصر - فقال ‏\"‏ أيكم قرأ خلفي بسبح اسم ربك الأعلى ‏\"‏ ‏.‏ فقال رجل أنا ولم أرد بها إلا الخير ‏.‏ قال ‏\"‏ قد علمت أن بعضكم خالجنيها ‏\"‏ ‏.‏",
      "text_en": " lmrin b. Husain reported:                      The Messenger of Allah (may peace beupon him) led us In Zuhr or 'Asr prayer (noon or the afternoon prayer). (On concluding it) he said: Who recited behind me (the verses): Sabbih Isma Rabbik al-a'la (Glorify the name of thy Lord, the Most High)? There upon a person said: It was I, but I in- tended nothing but goodness. I felt that some one of you was disputing with me in it (or he was taking out from my tongue what I was reciting), said the Holy Prophet (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20469",
        "11168",
        "20469",
        "11019",
        "11284",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-404-2",
      "hadith_no": "404",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، وأبو كامل الجحدري ومحمد بن عبد الملك الأموي - واللفظ لأبي كامل - قالوا حدثنا أبو عوانة عن قتادة عن يونس بن جبير عن حطان بن عبد الله الرقاشي قال صليت مع أبي موسى الأشعري صلاة فلما كان عند القعدة قال رجل من القوم أقرت الصلاة بالبر والزكاة - قال - فلما قضى أبو موسى الصلاة وسلم انصرف فقال أيكم القائل كلمة كذا وكذا قال فأرم القوم ثم قال أيكم القائل كلمة كذا وكذا فأرم القوم فقال لعلك يا حطان قلتها قال ما قلتها ولقد رهبت أن تبكعني بها ‏.‏ فقال رجل من القوم أنا قلتها ولم أرد بها إلا الخير ‏.‏ فقال أبو موسى أما تعلمون كيف تقولون في صلاتكم إن رسول الله صلى الله عليه وسلم خطبنا فبين لنا سنتنا وعلمنا صلاتنا فقال ‏\"‏ إذا صليتم فأقيموا صفوفكم ثم ليؤمكم أحدكم فإذا كبر فكبروا وإذا قال غير المغضوب عليهم ولا الضالين فقولوا آمين ‏.‏ يجبكم الله فإذا كبر وركع فكبروا واركعوا فإن الإمام يركع قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك وإذا قال سمع الله لمن حمده ‏.‏ فقولوا اللهم ربنا لك الحمد ‏.‏ يسمع الله لكم فإن الله تبارك وتعالى قال على لسان نبيه صلى الله عليه وسلم سمع الله لمن حمده ‏.‏ وإذا كبر وسجد فكبروا واسجدوا فإن الإمام يسجد قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك ‏.‏ وإذا كان عند القعدة فليكن من أول قول أحدكم التحيات الطيبات الصلوات لله السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Hattan b. 'Abdullah al-Raqiishi reported:                      I observed prayer with Abu Musu al-Ash'ari and when he was in the qa'dah, one among the people said: The prayer has been made obligatory along with piety and Zakat. He (the narrator) said: When Abu Musa had finished the prayer after salutation he tuined (towards the people) and said: Who amongst you said such and such a thing? A hush fell on the people. He again said.. Who amongst you has said such and such a thing? A hush fell on the people. He (Abu Musa) said: Hattan, It is perhaps you that have uttered it. He (Hattan) said No. I have not uttered it. I was afraid that you might be annoyed with me on account of this. A person amongst the people said: It was I who said it, and In this I intended nothing but good. Abu Musa said: Don't you know what you have to recite in your prayers? Verily the Messenger of Allah (may peace be upon him) addressed us and explained to us all Its aspects and taught us how to observe prayer (properly). He (the Holy Prophet) said: When you pray make your rows straight and let anyone amongst you act as your Imim. Recite the takbir when he recites it and when be recites: Not of those with whom Thou art angry. nor of those who go astray, say: Amin. Allah would respond you. And when he (the Imim) recites the takbir, you may also recite the takbir, for the Imam bows before you and raises himself before you. Then the Messenger of Allah (may peace be upon him) said: The one is equivalent to the other. And when he says: Allah listens to him who praises Him, you should say: 0 Allah, our. Lord, to Thee be the praise, for Allah, the Exalted and Glorious, has vouchsafed (us) through the tongue of His Apostle (may peace be upon him) that Allah listens to him who praises Him. And when he (the Imim) recites the takbir and prostrates, you should also recite the takbir and prostrate, for the Imim prostrates before you and raises himself before you. The Messenger' of Allah (may peace be upon him) said: The one is equi- valent to the other. And when he (the Imim) sits for Qa'da (for tashahhud) the first words of every one amongst you should be: All services rendered by words, acts of worship and all good things are due to Allah. Peace be upon you,0 Apostle, and Allah's mercy and blessings. Peace be upon us and upon the upright servants of Allah. I testify that there is no god but Allah, and I testify that Mubammad is His servant and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "30559",
        "20469",
        "11019",
        "11320",
        "10676"
      ]
    },
    {
      "id": "sahih-muslim-479-2",
      "hadith_no": "479",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان بن عيينة، أخبرني سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد، عن أبيه، عن ابن عباس، قال كشف رسول الله صلى الله عليه وسلم الستارة والناس صفوف خلف أبي بكر فقال ‏\"‏ أيها الناس إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها المسلم أو ترى له ألا وإني نهيت أن أقرأ القرآن راكعا أو ساجدا فأما الركوع فعظموا فيه الرب عز وجل وأما السجود فاجتهدوا في الدعاء فقمن أن يستجاب لكم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) drew aside the curtain (of his apartment) and (he saw) people in rows (saying prayer) behind Aba Bakr. And he said: Nothing remains of the glad tidings of apostlehood, except good visions which a Muslim sees or someone is made to see for him. And see that I have been forbidden to recite the Qur'an in the state of bowing and prostration. So far as Ruk'u is concerned, extol in it the Great and Glorious Lord, and while prostrating yourselves be earnest in supplication, for it is fitting that your supplications should be answered.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11855",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1599",
      "hadith_no": "1599",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه يحيى بن يحيى، وسعيد بن منصور، وقتيبة بن سعيد، جميعا عن أبي عوانة، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم ولم يذكر ‏\"‏ لا كفارة لها إلا ذلك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Qatada, but here no mention has been made of\" There is no explation for it except this.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "30367",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1607",
      "hadith_no": "1607",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وقتيبة بن سعيد، قال يحيى أخبرنا وقال الآخرون، حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Allah has prescribed the prayer through the word of your Prophet (may peace be upon him) as four rak'ahs when resident, two when travelling, and one when danger is present.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30367",
        "20031",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1614",
      "hadith_no": "1614",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان، حدثنا محمد بن المنكدر، وإبراهيم بن ميسرة، سمعا أنس بن مالك، يقول صليت مع رسول الله صلى الله عليه وسلم الظهر بالمدينة أربعا وصليت معه العصر بذي الحليفة ركعتين ‏.‏",
      "text_en": " Anas b. Malik is reported to have said:                      I observed four rak'ahs in the noon prayer with the Messenger of Allah (may peace be upon him) at Medina, and said two rak'ahs in the afternoon prayer at Dhu'l-Hulaifa.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11048",
        "11240",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1777",
      "hadith_no": "1777",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، جميعا عن أبي عوانة، قال سعيد حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا فاتته الصلاة من الليل من وجع أو غيره صلى من النهار ثنتى عشرة ركعة ‏.‏",
      "text_en": " 'A'isha reported that when the Messenger of Allah (may peace be upon him) decided upon doing any act, he continued to do it, and when he slept at night or fell sick he observed twelve rak'ahs during the daytime. I am not aware of Allah's Messenger (may peace be upon him) observing prayer during the whole of the night till morning, or observing fast for a whole month continuously except that of Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20469",
        "11168",
        "20469",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2459",
      "hadith_no": "2459",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني يحيى بن يحيى، وسعيد بن منصور، وقتيبة بن سعيد، كلهم عن أبي عوانة، - قال يحيى أخبرنا أبو عوانة، - عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يهرم ابن آدم وتشب منه اثنتان الحرص على المال والحرص على العمر ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      The son of Adam grows old, but two (desires) in him remain young: desire for wealth and desire for life.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "30367",
        "20469",
        "11449",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2462",
      "hadith_no": "2462",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وقتيبة بن سعيد، قال يحيى أخبرنا وقال الآخران، حدثنا أبو عوانة، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان لابن آدم واديان من مال لابتغى واديا ثالثا ولا يملأ جوف ابن آدم إلا التراب ويتوب الله على من تاب ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      If the son of Adam were to possess two valleys of riches. he would long for the third one. And the stomach of the son of Adam is not filled but with dust. And Allah returns to him who repents.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "30367",
        "20031",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2889",
      "hadith_no": "2889",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وخلف بن هشام، وقتيبة، بن سعيد قال يحيى أخبرنا وقال الآخرون، حدثنا حماد بن زيد، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت كأني أنظر إلى وبيص الطيب في مفرق رسول الله صلى الله عليه وسلم وهو محرم ‏.‏ ولم يقل خلف وهو محرم ‏.‏ ولكنه قال وذاك طيب إحرامه ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I still seem to see the glisten- ing of the perfume where the hair parted on Allah's Messenger's (may peace be upon him) head as he was in the state of Ihram, and Khalaf (one of the narrators) did not say: As he was in the state of Ihram, but said: That was the perfume of Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30503",
        "30367",
        "20031",
        "20022",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2899",
      "hadith_no": "2899",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وأبو كامل جميعا عن أبي عوانة، - قال سعيد حدثنا أبو عوانة، - عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت عبد الله بن عمر - رضى الله عنهما - عن الرجل، يتطيب ثم يصبح محرما فقال ما أحب أن أصبح محرما أنضخ طيبا لأن أطلي بقطران أحب إلى من أن أفعل ذلك ‏.‏ فدخلت على عائشة - رضى الله عنها - فأخبرتها أن ابن عمر قال ما أحب أن أصبح محرما أنضخ طيبا لأن أطلي بقطران أحب إلى من أن أفعل ذلك ‏.‏ فقالت عائشة أنا طيبت رسول الله صلى الله عليه وسلم عند إحرامه ثم طاف في نسائه ثم أصبح محرما ‏.‏",
      "text_en": " Muhammad b. al-Muntashir reported on the authority of his father:                      I asked 'Abdullah b. 'Umar (Allah be pleased with them) about a person who applied perfume and then (on the following) morning entered upon the state of lhram. There- upon he said: I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing this (i. e. the applying of perfume), I went to 'A'isha (Allah be pleased with her) and told her that Ibn 'Umar stated:\" I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing it (the applying of perfume).\" Thereupon 'A'isha said: I applied perfume to the Messenger of Allah (may peace be upon him) at the time of his entering upon the state of Ihram. He then went round his wives and then put on Ihram in the morning.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20469",
        "11168",
        "20469",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3024",
      "hadith_no": "3024",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وأبو كريب قالوا حدثنا أبو معاوية عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، - رضى الله عنه - قال كانت المتعة في الحج لأصحاب محمد صلى الله عليه وسلم خاصة ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said that Tamattu' in Hajj was a special (concession) only for the Companions of Muhammad (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-3028",
      "hadith_no": "3028",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وابن أبي عمر، جميعا عن الفزاري، - قال سعيد حدثنا مروان بن معاوية، - أخبرنا سليمان التيمي، عن غنيم بن قيس، قال سألت سعد بن أبي وقاص - رضى الله عنه - عن المتعة، فقال فعلناها وهذا يومئذ كافر بالعرش ‏.‏ يعني بيوت مكة ‏.‏",
      "text_en": " Ghunaim b. Qais said:                      I asked Sa'd b. Abu Waqqas (Allah be pleased with him) about Mut'a, whereupon he said: We did that, and it was the day when he was an unbeliever living in (one of the) houses of Mecca.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30421",
        "20405",
        "11168",
        "20201",
        "11289",
        "10710",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-3089",
      "hadith_no": "3089",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وعمرو الناقد، وزهير بن حرب، جميعا عن ابن عيينة، - قال سعيد حدثنا سفيان بن عيينة، - حدثني الزهري، عن حنظلة الأسلمي، قال سمعت أبا هريرة، - رضى الله عنه - يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده ليهلن ابن مريم بفج الروحاء حاجا أو معتمرا أو ليثنينهما ‏\"‏ ‏.‏ وحدثناه قتيبة بن سعيد، حدثنا ليث، عن ابن شهاب، بهذا الإسناد ‏.‏ مثله قال ‏\"‏ والذي نفس محمد بيده ‏\"‏ ‏.‏",
      "text_en": " Hanzala al-Aslami reported:                      I heard Abu Huraira (Allah be pleased with him) as narrating from Allah's Apostle (may peace be upon him) who said: By Him in Whose Hand is my life. Ibn Maryam (Jesus Christ) would certainly pronounce Talbiya for Hajj or for Umra or for both (simultaneously as a Qiran) In the valley of Rauha",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30263",
        "30022",
        "20005",
        "11168",
        "20005",
        "11013",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3258",
      "hadith_no": "3258",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، وزهير بن حرب، قالا حدثنا سفيان، عن الزهري، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم ح. وحدثنا سعيد بن منصور، وخلف بن هشام، وقتيبة بن سعيد، قالوا أخبرنا حماد، بن زيد عن هشام بن عروة، عن أبيه، عن عائشة، قالت كأني أنظر إلى أفتل قلائد هدى رسول الله صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " 'A'isha narrated (in another badith narrated through another chain of transmitters) these words:                     \" As if I am seeing myself weaving the garlands for the sacrificial animals of Allah's Messenger (may peace be upon him).\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30022",
        "20005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3260",
      "hadith_no": "3260",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال سمعت عائشة، تقول كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم بيدى هاتين ثم لا يعتزل شيئا ولا يتركه.",
      "text_en": " Abd al-Rahman b. al-Qasim reported on the authority of his father that he heard 'A'isha (Allah be pleased with her) saying:                      I used to weave garlands for the sacrificial animals of Allah's Messenger (may peace be upon him) with these hands of mine, but he (Allah's Apostle) neither avoided anything nor gave up anything (which a Muhrim should avoid or give up).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-muslim-3269",
      "hadith_no": "3269",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الشعبي، عن مسروق، قال سمعت عائشة، وهى من وراء الحجاب تصفق وتقول كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم بيدى ثم يبعث بها وما يمسك عن شىء مما يمسك عنه المحرم حتى ينحر هديه.",
      "text_en": " Masruq reported:                      I heard 'A'isha (Allah be pleased with her) clapping her hands behind the curtain and saying: I used to weave garlands for the sacrificial animals of Allah's Messenger (may peace be upon him) with my own hands, and then he (the Holy Prophet) sent them (to Mecca), and he did not avoid doing anything which a Muhritn avoids until his animal was sacrificed.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20468",
        "11418",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3283",
      "hadith_no": "3283",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وزهير بن حرب، قالا حدثنا سفيان، عن سليمان الأحول، عن طاوس، عن ابن عباس، قال كان الناس ينصرفون في كل وجه فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينفرن أحد حتى يكون آخر عهده بالبيت ‏\"‏ ‏.‏ قال زهير ينصرفون كل وجه ‏.‏ ولم يقل في ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that the people used to return through every path, whereupon Allah's Messenger (way peace be upon him) said:                      None amongst you should depart until he performs the last circumambulation round the House. Zuhair said (the words are): [ARABIC: YANSWARIFUWN KULLA WAJH] and the word [arabic: FIY] was not mentioned.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30022",
        "20005",
        "11247",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3284",
      "hadith_no": "3284",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة - واللفظ لسعيد - قالا حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال أمر الناس أن يكون، آخر عهدهم بالبيت إلا أنه خفف عن المرأة الحائض ‏.‏",
      "text_en": " Ibn Abbas reported:                      The people were commanded (by the Holy Prophet) to perform the last circumambulation round the House, but menstruating women were exempted.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3313",
      "hadith_no": "3313",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو الأحوص، حدثنا أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت فلم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏ ‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذلك قومك ليدخلوا من شاءوا ويمنعوا من شاءوا ولولا أن قومك حديث عهدهم في الجاهلية فأخاف أن تنكر قلوبهم لنظرت أن أدخل الجدر في البيت وأن ألزق بابه بالأرض ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I asked Allah's Messenger (may peace be upon him) about the wall, circumpassing the House (i. e. whether the wall on the side of Hijr was included in the Ka'ba). He said, Yes. I said: Then why did they not include it in the House? He said: 'Your people ran short of the means (to do so). I said: Why is it that the level of its door is raised high? He said: Your people did it so that they should admit one whom they liked, and forbid him whom they disliked, and if your people were not new converts to faith, and I did not apprehend that their hearts would feel agitated at this. I would have definitely included (the area of) this wall-in the House and would have brought the door to the level of the ground.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3356",
      "hadith_no": "3356",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب قالوا حدثنا سفيان بن عيينة، ح وحدثني محمد بن عبد الملك الأموي، حدثنا عبد، العزيز بن المختار عن سهيل، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، ح وحدثنا أبو كريب، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، جميعا عن سفيان، كل هؤلاء عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏بمثل حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "20252",
        "30212",
        "20331",
        "11201",
        "30216",
        "20032",
        "30170"
      ]
    },
    {
      "id": "sahih-muslim-3358",
      "hadith_no": "3358",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، عن أبي عوانة، وأبي الأحوص، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا وكيع، عن مسعر، وسفيان، ح وحدثنا ابن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كل هؤلاء عن منصور، بهذا الإسناد وفي حديثهم جميعا ‏\"‏ من حج فلم يرفث ولم يفسق ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mainsur with the same chain of transmitters (and the words are):                     \" He who performed Pilgrimage but neither spoke indecently nor acted wickedly.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20469",
        "20327",
        "30201",
        "20032",
        "20359",
        "20005",
        "20173"
      ]
    },
    {
      "id": "sahih-muslim-3359",
      "hadith_no": "3359",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، عن سيار، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20468",
        "11429",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3388",
      "hadith_no": "3388",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - عن عمرو بن أبي عمرو، عن أنس بن مالك، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أنه قال ‏\"‏ إني أحرم ما بين لابتيها ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported a hadith like this from Allah's Apostle (may peace be upon him) except with this variation that he said:                     \" I declare sacred the area between its two lava mountains.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20185",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-3541",
      "hadith_no": "3541",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا مالك، ح وحدثنا يحيى، بن يحيى - واللفظ له - قال قلت لمالك حدثك عبد الله بن الفضل، عن نافع بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الأيم أحق بنفسها من وليها والبكر تستأذن في نفسها وإذنها صماتها ‏\"‏ ‏.‏ قال نعم ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A woman without a husband has more right to her person than her guardian, and a virgin's consent must be asked from her, and her silence implies her consent.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20001",
        "30399",
        "11059",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3687",
      "hadith_no": "3687",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد قالوا حدثنا سفيان، بن عيينة ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، بهذا الإسناد نحوه ‏.‏ غير أن معمرا وابن عيينة في حديثهما ‏\"‏ الولد للفراش ‏\"‏ ‏.‏ ولم يذكرا ‏\"‏ وللعاهر الحجر ‏\"‏ ‏.‏",
      "text_en": " A hadith like this is narrated on the authority of Ibn 'Uyaiyna and Ma'mar (and the words are):                      The child is attributed to him on whose bed he is born; but they did not mention this:\" For a fornicator there is stoning.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "30553",
        "20121"
      ]
    },
    {
      "id": "sahih-muslim-3689",
      "hadith_no": "3689",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا سعيد بن منصور، وزهير بن حرب، وعبد الأعلى بن حماد، وعمرو الناقد، قالوا حدثنا سفيان، عن الزهري، أما ابن منصور فقال عن سعيد، عن أبي هريرة، وأما، عبد الأعلى فقال عن أبي سلمة، أو عن سعيد، عن أبي هريرة، وقال، زهير عن سعيد، أو عن أبي سلمة، أحدهما أو كلاهما عن أبي هريرة، وقال، عمرو حدثنا سفيان، مرة عن الزهري، عن سعيد، وأبي، سلمة ومرة عن سعيد، أو أبي سلمة ومرة عن سعيد، عن أبي، هريرة عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث معمر ‏.‏",
      "text_en": " A hadith like this is narrated on the authority of Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30022",
        "30146",
        "30263",
        "20005",
        "11168",
        "13",
        "11168",
        "13",
        "20321"
      ]
    },
    {
      "id": "sahih-muslim-3825",
      "hadith_no": "3825",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا مالك، ح وحدثنا يحيى، بن يحيى - واللفظ له - قال قلت لمالك حدثك نافع، عن ابن عمر، أن رجلا، لاعن امرأته على عهد رسول الله صلى الله عليه وسلم ففرق رسول الله صلى الله عليه وسلم بينهما وألحق الولد بأمه قال نعم ‏.‏",
      "text_en": " Nafi' reported on the authority of Ibn Umar (Allah be pleased with them) that a person invoked curse on the wife during the lifetime of Allah s Messenger (may peace be upon him), so he effected separation between them and traced the lineage of the son to his mother.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20001",
        "30399",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4012",
      "hadith_no": "4012",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو بكر بن شيبة وعمرو الناقد وزهير بن حرب قالوا حدثنا سفيان بن عيينة، عن حميد الأعرج، عن سليمان بن عتيق، عن جابر، قال نهى النبي صلى الله عليه وسلم عن بيع السنين ‏.‏ وفي رواية ابن أبي شيبة عن بيع الثمر سنين ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) forbidding selling of (produce) in advance for two years, and in the narmtion of Ibu Abd Shaiba (the words are):                     \" Selling of the fruits (on the tree) in advance for two years.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11856",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4319",
      "hadith_no": "4319",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة وعمرو الناقد - واللفظ لسعيد - قالوا حدثنا سفيان، عن سليمان الأحول، عن سعيد بن جبير، قال قال ابن عباس يوم الخميس وما يوم الخميس ثم بكى حتى بل دمعه الحصى ‏.‏ فقلت يا ابن عباس وما يوم الخميس قال اشتد برسول الله صلى الله عليه وسلم وجعه ‏.‏ فقال ‏\"‏ ائتوني أكتب لكم كتابا لا تضلوا بعدي ‏\"‏ ‏.‏ فتنازعوا وما ينبغي عند نبي تنازع ‏.‏ وقالوا ما شأنه أهجر استفهموه ‏.‏ قال ‏\"‏ دعوني فالذي أنا فيه خير أوصيكم بثلاث أخرجوا المشركين من جزيرة العرب وأجيزوا الوفد بنحو ما كنت أجيزهم ‏\"‏ ‏.‏ قال وسكت عن الثالثة أو قالها فأنسيتها ‏.‏",
      "text_en": " Sa'id b. Jubair reported that Ibn 'Abbas said:                      Thursday, (and then said): What is this Thursday? He then wept so much that his tears moistened the pebbles. I said: Ibn 'Abbas, what is (significant) about Thursday? He (Ibn 'Abbas) said: The illness of Allah's Messenger (may peace be upon him) took a serious turn (on this day), and he said: Come to me, so that I should write for you a document that you may not go astray after me. They (the Companions around him) disputed, and it is not meet to dispute in the presence of the Apostle. They said: How is lie (Allah's Apostle)? Has he lost his consciousness? Try to learn from him (this point). He (the Holy Prophet) said: Leave me. I am better in the state (than the one in which you are engaged). I make a will about three things: Turn out the polytheists from the territory of Arabia; show hospitality to the (foreign) delegations as I used to show them hospitality. He (the narrator) said: He (Ibn Abbas) kept silent on the third point, or he (the narrator) said: But I forgot that.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20005",
        "11247",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-4641",
      "hadith_no": "4641",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله، عن إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب سريع الحساب اهزم الأحزاب اللهم اهزمهم وزلزلهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abu Aufa that the Messenger of Allah (may peace be upon him) cursed the tribes (who had marched upon Medina with a combined force in 5 H) and said:                      O Allah, Revealer of the Book, swift in (taking) account, put the tribes to rout. O Lord, defeat them and shake them.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20423",
        "11418",
        "5115"
      ]
    },
    {
      "id": "sahih-muslim-4647",
      "hadith_no": "4647",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وعمرو الناقد، جميعا عن ابن عيينة، قال يحيى أخبرنا سفيان بن عيينة، عن الزهري، عن عبيد الله، عن ابن عباس، عن الصعب، بن جثامة قال سئل النبي صلى الله عليه وسلم عن الذراري من المشركين يبيتون فيصيبون من نسائهم وذراريهم ‏.‏ فقال ‏\"‏ هم منهم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Sa'b b. Jaththama that the Prophet of Allah (may peace be upon him), when asked about the women and children of the polytheists being killed during the night raid, said:                      They are from them.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "20005",
        "11449",
        "20005",
        "11013",
        "11201",
        "17",
        "3661"
      ]
    },
    {
      "id": "sahih-muslim-4651",
      "hadith_no": "4651",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن منصور، وهناد بن السري، قالا حدثنا ابن المبارك، عن موسى، بن عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قطع نخل بني النضير وحرق ولها يقول حسان وهان على سراة بني لؤى حريق بالبويرة مستطير وفي ذلك نزلت ‏{‏ ما قطعتم من لينة أو تركتموها قائمة على أصولها‏}‏ الآية ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Umar that the Messenger of Allah (may peace be upon him) caused the date-palms of Banu Nadir to be cut down and burnt. It is in this connection that Hassan (the poet) said:                      It was easy for the nobles of Quraish to burn Buwaira whose sparks were flying in all directions, in the same connection was revealed the Qur'anic verse:\" Whatever trees you have cut down or left standing on their trunks.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30480",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4860",
      "hadith_no": "4860",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، وقتيبة بن سعيد، كلاهما عن يعقوب، قال سعيد حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن أبي صالح السمان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عليك السمع والطاعة في عسرك ويسرك ومنشطك ومكرهك وأثرة عليك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      It is obligatory for you to listen to the ruler and obey him in adversity and prosperity, in pleasure and displeasure, and even when another person is given (rather undue) preference over you.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20184",
        "11168",
        "20185",
        "11172",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4977",
      "hadith_no": "4977",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله الواسطي، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، قال قيل للنبي صلى الله عليه وسلم ما يعدل الجهاد في سبيل الله عز وجل قال ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ قال فأعادوا عليه مرتين أو ثلاثا كل ذلك يقول ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ وقال في الثالثة ‏\"‏ مثل المجاهد في سبيل الله كمثل الصائم القائم القانت بآيات الله لا يفتر من صيام ولا صلاة حتى يرجع المجاهد في سبيل الله تعالى ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira who said:                      The Messenger of Allah (may peace be upon him) was asked: What deed could be an equivalent of Jihad in the way of Allah, the Almighty and Exalted? He answered: You do not have the strength to do that deed. The narrator said: They repeated the question twice or thrice. Every time he answered: You do not have the strength to do it. When the question was asked for the third time, he said: One who goes out for Jibad is like a person who keeps fasts, stands in prayer (constantly), (obeying) Allah's (behests contained in) the verses (of the Qur'an), and does not exhibit any lassitude in fasting and prayer until the Mujihid returns from Jihad in the way of Allah, the Exalted.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20423",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4987",
      "hadith_no": "4987",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، حدثني أبو هانئ الخولاني، عن أبي عبد الرحمن الحبلي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا أبا سعيد من رضي بالله ربا وبالإسلام دينا وبمحمد نبيا وجبت له الجنة ‏\"‏ ‏.‏ فعجب لها أبو سعيد فقال أعدها على يا رسول الله ففعل ثم قال ‏\"‏ وأخرى يرفع بها العبد مائة درجة في الجنة ما بين كل درجتين كما بين السماء والأرض ‏\"‏ ‏.‏ قال وما هي يا رسول الله قال ‏\"‏ الجهاد في سبيل الله الجهاد في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Sa'id Khudri that the Messenger of Allah (may peace be upon him) said (to him):                      Abu Sa'id, whoever cheerfully accepts Allah as his Lord, Islam as his religion and Mubammad as his Apostle is necessarily entitled to enter Paradise. He (Abu Sa'id) wondered at it and said: Messenger of Allah, repeat it for me. He (the Messenger of Allah) did that and said: There is another act which elevates the position of a man in Paradise to a grade one hundred (higher), and the elevation between one grade and the other is equal to the height of the heaven from the earth. He (Abu Sa'id) said: What is that act? He replied: Jihad in the way of Allah! Jihad in the way of Allah!",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "10856",
        "10938",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4990",
      "hadith_no": "4990",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، عن عمرو بن دينار، عن محمد بن قيس، ح قال وحدثنا محمد بن عجلان، عن محمد بن قيس، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم يزيد أحدهما على صاحبه أن رجلا أتى النبي صلى الله عليه وسلم وهو على المنبر فقال أرأيت إن ضربت بسيفي ‏.‏ بمعنى حديث المقبري ‏.‏",
      "text_en": " Another version of the tradition differently transmitted begins with the words:                     \" A man came to the Messenger of Allah (may peace be upon him) and he was sitting on the pulpit.... He said: What do you find if I strike with the sword?\" (The rest of the tradition is the same as the previous one.)",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11081",
        "10616",
        "11804",
        "391"
      ]
    },
    {
      "id": "sahih-muslim-5011",
      "hadith_no": "5011",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو الطاهر، قال أبو الطاهر أخبرنا ابن وهب، وقال، سعيد حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر، بن سعيد عن زيد بن خالد الجهني، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Zaid b. Khalid al-Juhani that the Messenger of Allah (may peace be upon him) said:                      Anybody who equips a warrior (going to fight) in the way of Allah (is like one who actually) fights. And anybody who looks well after his family in his absence (is also like one who actually) fights.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "11168",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-5016",
      "hadith_no": "5016",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، عن يزيد بن أبي سعيد، مولى المهري عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث إلى بني لحيان ‏\"‏ ليخرج من كل رجلين رجل ‏\"‏ ‏.‏ ثم قال للقاعد ‏\"‏ أيكم خلف الخارج في أهله وماله بخير كان له مثل نصف أجر الخارج ‏\"‏ ‏.‏",
      "text_en": " It has been narrated (through a still different chain of transmitters) on the authority of Abu Sa'id Khudrl that the Messenger of Allah (may peace be upon him) despatched a force to Banu Lihyan. (and said:                      ) One man from every two should join the force. Then he said to those who stayed behind: Those of you who will look well after the family and wealth of those who are going on the expedition will be getting half the reward of the warriors.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377",
        "11411",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5019",
      "hadith_no": "5019",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه سعيد بن منصور، حدثنا سفيان، عن قعنب، عن علقمة بن مرثد، بهذا الإسناد ‏\"‏ فقال فخذ من حسناته ما شئت ‏\"‏ ‏.‏ فالتفت إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " A version of the tradition narrated on the authority of 'Alqama b. Murthad has a differently worded end:                      It will be said to the Mujahid: Take from his noble deeds whatever you like. Then the Messenger of Allah (may peace be upon him) turned to us and asked: What do you think (will he leave anything)? - (i. e. he will take away everything).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "10813",
        "11374"
      ]
    },
    {
      "id": "sahih-muslim-5059",
      "hadith_no": "5059",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع العتكي، وقتيبة بن سعيد، قالوا حدثنا حماد، - وهو ابن زيد - عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي ظاهرين على الحق لا يضرهم من خذلهم حتى يأتي أمر الله وهم كذلك ‏\"‏ ‏.‏ وليس في حديث قتيبة ‏\"‏ وهم كذلك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Thauban that the Messenger of Allah (may peace be upon him) said:                      A group of people from my Umma will always remain triumphant on the right path and continue to be triumphant (against their opponents). He who deserts them shall not be able to do them any harm. They will remain in this position until Allah's Command is executed (i.e. Qiyamah is established). In Qutaiba's version of the tradition, we do not have the words:\" They will remain in this position.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "id": "sahih-muslim-5331",
      "hadith_no": "5331",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب كلهم عن ابن عيينة، ح وحدثنا حسن الحلواني، وعبد بن حميد، عن يعقوب، بن إبراهيم بن سعد حدثنا أبي، عن صالح، ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، كلهم عن الزهري، بهذا الإسناد وليس في حديث سفيان وصالح سئل عن البتع وهو في حديث معمر وفي حديث صالح أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل شراب مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of Zuhri with this chain of transmitters but in the hadith transmitted on the authority of Sufyan and Salih (these words are not found)\" she was asked about Bit\". (These words are found in the hadith) transmitted on the authority of Ma'mar and in the hadith transmitted on the authority of Salih (only these words are found) that she (Hadrat 'A'isha) had heard Allah's Messenger (may peace be upon him) say:                      Every intoxicating drink is forbidden.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "20005",
        "130115",
        "30553",
        "20184",
        "20150",
        "11176",
        "30123",
        "30553",
        "20121"
      ]
    },
    {
      "id": "sahih-muslim-6146",
      "hadith_no": "6146",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وسعيد بن منصور، وأبو الربيع العتكي، وأبو كامل - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا - حماد بن زيد، عن ثابت، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس وكان أجود الناس وكان أشجع الناس ولقد فزع أهل المدينة ذات ليلة فانطلق ناس قبل الصوت فتلقاهم رسول الله صلى الله عليه وسلم راجعا وقد سبقهم إلى الصوت وهو على فرس لأبي طلحة عرى في عنقه السيف وهو يقول ‏\"‏ لم تراعوا لم تراعوا ‏\"‏ ‏.‏ قال ‏\"‏ وجدناه بحرا أو إنه لبحر ‏\"‏ ‏.‏ قال وكان فرسا يبطأ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) was the sublimest among people (in character) and the most generous amongst them and he was the bravest of men. One night the people of Medina felt disturbed and set forth in the direction of a sound when Allah's Messenger (may peace be upon him) met them on his way back as he had gone towards that sound ahead of them. He was on the horse of Abu Talha which had no saddle over it, and a sword was slung round his neck, and he was saying:                      There was nothing to be afraid of, and he also said: We found it (this horse) like a torrent of water (indicating its swift-footedness), whereas the horse had been slow before that time.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "20031",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6151",
      "hadith_no": "6151",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع، قالا حدثنا حماد بن زيد، عن ثابت البناني، عن أنس بن مالك، قال خدمت رسول الله صلى الله عليه وسلم عشر سنين والله ما قال لي أفا ‏.‏ قط ولا قال لي لشىء لم فعلت كذا وهلا فعلت كذا زاد أبو الربيع ليس مما يصنعه الخادم ‏.‏ ولم يذكر قوله والله ‏.‏",
      "text_en": " Anas b. Malik reported:                      I served the Messenger of Allah (may peace be upon him) for ten years, and, by Allah, he never said to me any harsh word, and he never said to me about a thing as to why I had done that and as to why I had not done that. Abu Rabi' has made this addition (in this narration):\" The work which a servant should do.\" There is no mention of his words\" By Allah\".",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30137",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6217",
      "hadith_no": "6217",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله، عن الجريري، عن أبي الطفيل، قال قلت له أرأيت رسول الله صلى الله عليه وسلم قال نعم كان أبيض مليح الوجه ‏.‏ قال مسلم بن الحجاج مات أبو الطفيل سنة مائة وكان آخر من مات من أصحاب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Jurairi reported:                      I said to Abu Tufail: Did you see Allah's Messenger (may peace be upon him)? He said: Yes, he had a white handsome face. Muslim b. Hajjaj said: Abu Tufail who died in 100 Hijra was the last of the Companions of Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20423",
        "11286",
        "3660"
      ]
    },
    {
      "id": "sahih-muslim-6228",
      "hadith_no": "6228",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، وخالد بن عبد الله، ح وحدثنا ابن نمير، حدثنا محمد بن بشر، كلهم عن إسماعيل، عن أبي جحيفة، بهذا ولم يقولوا أبيض قد شاب ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Juhaifa with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "20423",
        "30212",
        "20352",
        "11418"
      ]
    },
    {
      "id": "sahih-muslim-6321",
      "hadith_no": "6321",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا فليح بن سليمان، عن سالم أبي النضر، عن عبيد، بن حنين وبسر بن سعيد عن أبي سعيد الخدري، قال خطب رسول الله صلى الله عليه وسلم الناس يوما ‏.‏ بمثل حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20169",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6659",
      "hadith_no": "6659",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا مهدي بن ميمون، عن أبي الوازع، جابر بن عمرو الراسبي سمعت أبا برزة، يقول بعث رسول الله صلى الله عليه وسلم رجلا إلى حى من أحياء العرب فسبوه وضربوه فجاء إلى رسول الله صلى الله عليه وسلم فأخبره فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو أن أهل عمان أتيت ما سبوك ولا ضربوك ‏\"‏ ‏.‏",
      "text_en": " Abu Barza reported that Allah's Messenger (may peace be upon him) sent a person to a tribe amongst the tribes of Arabia. They reviled him and beat him. He came to Allah's Messenger (may peace be upon him) and narrated to him (the story of atrocities perpetrated upon him by the people of the tribe). Thereupon he (the Holy Prophet) said:                      If you were to come to the people of 'Uman, they would have neither reviled you nor beaten you.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "11307",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-6671",
      "hadith_no": "6671",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، أن ناعما، مولى أم سلمة حدثه أن عبد الله بن عمرو بن العاص قال أقبل رجل إلى نبي الله صلى الله عليه وسلم فقال أبايعك على الهجرة والجهاد أبتغي الأجر من الله ‏.‏ قال ‏\"‏ فهل من والديك أحد حى ‏\"‏ ‏.‏ قال نعم بل كلاهما ‏.‏ قال ‏\"‏ فتبتغي الأجر من الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فارجع إلى والديك فأحسن صحبتهما ‏\"‏ ‏.‏",
      "text_en": " Yazid b. Abu Habib reported that Na'im, the freed slave of Umm Salama, reported to him that 'Abdullah b. 'Amr b. 'As said:                      There came to Allah's Apostle (may peace be upon him) a person and said: I owe allegiance to you for migration and Jihad seeking reward only from Allah. He (the Holy Prophet) said: Is one from amongst your parents living? He said: Yes, of course, both are living. He further asked: Do you want to seek reward from Allah? He said: Yes. Thereupon Allah's Messenger (may peace be upon him) said: Go back to your parents and accord them benevolent treatment.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377",
        "11411",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-6716",
      "hadith_no": "6716",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع الزهراني، قالا حدثنا حماد، - يعنيان ابن زيد - عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال أبو الربيع رفعه إلى النبي صلى الله عليه وسلم وفي حديث سعيد قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عائد المريض في مخرفة الجنة حتى يرجع ‏\"‏ ‏.‏",
      "text_en": " Abu Rabi' reported directly from Allah's Apostle (may peace upon him) as saying:                      The one who visits the sick is in fact like one who is in the fruit garden of Paradise so long as he does not return.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30137",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "id": "sahih-muslim-7121",
      "hadith_no": "7121",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان، ومعتمر بن سليمان، عن سليمان التيمي، عن أبي عثمان النهدي، عن أسامة بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تركت بعدي فتنة هي أضر على الرجال من النساء ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid reported Allah's Messenger (may peace be upon him) as saying:                      I have not left after me any (chance) of turmoil more injurious to men than the harm done to the men because of women.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-7229",
      "hadith_no": "7229",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يعقوب، - يعني ابن عبد الرحمن - حدثني أبو حازم عن عبيد الله بن مقسم، أنه نظر إلى عبد الله بن عمر كيف يحكي رسول الله صلى الله عليه وسلم قال ‏\"‏ يأخذ الله عز وجل سمواته وأرضيه بيديه فيقول أنا الله - ويقبض أصابعه ويبسطها - أنا الملك ‏\"‏ حتى نظرت إلى المنبر يتحرك من أسفل شىء منه حتى إني لأقول أساقط هو برسول الله صلى الله عليه وسلم",
      "text_en": " Abdullah b. Miqsam reported that he saw Abdullah b. Umar as he narrated Allah's Messenger (may peace be upon him) as saying:                      Allah, the Exalted and Glorious, would take in His hand His Heavens and His Earth, and would say: I am Allah. And He would clench His fingers and then would open them (and say): I am your Lord. I saw the pulpit in commotion from underneath because of something (vib-ating) there. And (I felt this commotion so much) that I said (to myself): It may not fall with Allah's Massenger (may peace be upon him) upon it.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20185",
        "11172",
        "11521"
      ]
    },
    {
      "id": "sahih-muslim-7230",
      "hadith_no": "7230",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن أبي حازم، حدثني أبي، عن عبيد، الله بن مقسم عن عبد الله بن عمر، قال رأيت رسول الله صلى الله عليه وسلم على المنبر وهو يقول ‏\"‏ يأخذ الجبار عز وجل سمواته وأرضيه بيديه ‏\"‏ ‏.‏ ثم ذكر نحو حديث يعقوب ‏.‏",
      "text_en": " Abdullah b. Miqsam reported that 'Abdullah b. 'Umar reported:                      I saw Allah'h Messenger (may peace be upon him) upon the pulpit and he was saying that the Mighty Lord, the Exalted and Glorious would take hold of the Heavens and earth in His hand. The rest of the hadith is the same,",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20165",
        "11172",
        "11521",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7337",
      "hadith_no": "7337",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا سعيد بن منصور، عن أبي قدامة، - وهو الحارث بن عبيد - عن أبي، عمران الجوني عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن للمؤمن في الجنة لخيمة من لؤلؤة واحدة مجوفة طولها ستون ميلا للمؤمن فيها أهلون يطوف عليهم المؤمن فلا يرى بعضهم بعضا ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (may peace be upon him) said that in Paradise there would be for a believer a tent of a single hollowed pearl the breadth of which would be sixty miles. It would be meant for a believer and the believers would go around it and none would be able to see the others.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20533",
        "11296"
      ]
    },
    {
      "id": "sahih-muslim-7591",
      "hadith_no": "7591",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يعقوب بن عبد الرحمن، وعبد العزيز بن أبي، حازم عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏.‏   وحدثنا قتيبة بن سعيد، - واللفظ له - حدثنا يعقوب، عن أبي حازم، أنه سمع  سهلا، يقول سمعت النبي صلى الله عليه وسلم يشير بإصبعه التي تلي الإبهام والوسطى وهو يقول ‏\"‏ بعثت أنا والساعة هكذا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported by Sahl b. Sa'd that he heard Allah's Messenger (may peace be upon him) as saying:                      I and the Last Hour are (close to each other) like this (and he, in order to explain it) pointed (by joining his) forefinger, (one) next to the thumb and the middle finger (together).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20185",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-muslim-7645",
      "hadith_no": "7645",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا داود بن عبد الرحمن العطار، حدثني منصور، بن عبد الرحمن الحجبي عن أمه، صفية عن عائشة، قالت توفي رسول الله صلى الله عليه وسلم حين شبع الناس من الأسودين التمر والماء ‏.‏",
      "text_en": " 'A'isha reported this hadith through other chains of transmitters also (and the words are) that Allah's Messenger (may peace be upon him) died (in a state) when the people could afford to eat only the dates and water.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20192",
        "11565",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-40",
      "hadith_no": "40",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن مسلم بن قرط، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا ذهب أحدكم إلى الغائط فليذهب معه بثلاثة أحجار يستطيب بهن فإنها تجزئ عنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: When any of you goes to relieve himself, he should take with him three stones to cleans himself, for they will be enough for him.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20185",
        "11172",
        "12506",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-840",
      "hadith_no": "840",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن محمد، حدثني محمد بن عبد الله بن حسن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سجد أحدكم فلا يبرك كما يبرك البعير وليضع يديه قبل ركبتيه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when one of you prostrates himself he must not kneel in the manner of camel, but should put down his hands before his knees.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20167",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1096",
      "hadith_no": "1096",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا شهاب بن خراش، حدثني شعيب بن رزيق الطائفي، قال جلست إلى رجل له صحبة من رسول الله صلى الله عليه وسلم يقال له الحكم بن حزن الكلفي فأنشأ يحدثنا قال وفدت إلى رسول الله صلى الله عليه وسلم سابع سبعة أو تاسع تسعة فدخلنا عليه فقلنا يا رسول الله زرناك فادع الله لنا بخير فأمر بنا أو أمر لنا بشىء من التمر والشأن إذ ذاك دون فأقمنا بها أياما شهدنا فيها الجمعة مع رسول الله صلى الله عليه وسلم فقام متوكئا على عصا أو قوس فحمد الله وأثنى عليه كلمات خفيفات طيبات مباركات ثم قال ‏\"‏ أيها الناس إنكم لن تطيقوا أو لن تفعلوا كل ما أمرتم به ولكن سددوا وأبشروا ‏\"‏ ‏.‏ قال أبو علي سمعت أبا داود قال ثبتني في شىء منه بعض أصحابنا وقد كان انقطع من القرطاس ‏.‏",
      "text_en": " Shu'ayb ibn Zurayq at-Ta'ifi said:                      I sat with a man who had been in the company of the Messenger of Allah (ﷺ). He was called al-Hakam ibn Hazn al-Kulafi. He began to narrate a tradition to us saying: I came to the Messenger of Allah (ﷺ) in a delegation consisting of seven or nine persons. We entered upon him and said: Messenger of Allah, we have visited you, so pray Allah what is good for us. He ordered to give us some dates. The Muslims in those days were weak. We stayed there for several days and offered the Friday prayer along with the Messenger of Allah (ﷺ). He stood leaning on a staff or a bow. He praised Allah and exalted Him in light, pure and blessed words. Then he said: O people, you have no power to obey or you cannot obey what you are ordered. But be straight and give good tidings.Abu 'Ali said: Did you hear Abu Dawud ? He said: Some of my companions reminded me of some words that were omitted from writing on the paper.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "25124"
      ]
    },
    {
      "id": "sunan-abi-daud-1236",
      "hadith_no": "1236",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا جرير بن عبد الحميد، عن منصور، عن مجاهد، عن أبي عياش الزرقي، قال كنا مع رسول الله صلى الله عليه وسلم بعسفان وعلى المشركين خالد بن الوليد فصلينا الظهر فقال المشركون لقد أصبنا غرة لقد أصبنا غفلة لو كنا حملنا عليهم وهم في الصلاة فنزلت آية القصر بين الظهر والعصر فلما حضرت العصر قام رسول الله صلى الله عليه وسلم مستقبل القبلة والمشركون أمامه فصف خلف رسول الله صلى الله عليه وسلم صف وصف بعد ذلك الصف صف آخر فركع رسول الله صلى الله عليه وسلم وركعوا جميعا ثم سجد وسجد الصف الذين يلونه وقام الآخرون يحرسونهم فلما صلى هؤلاء السجدتين وقاموا سجد الآخرون الذين كانوا خلفهم ثم تأخر الصف الذي يليه إلى مقام الآخرين وتقدم الصف الأخير إلى مقام الصف الأول ثم ركع رسول الله صلى الله عليه وسلم وركعوا جميعا ثم سجد وسجد الصف الذي يليه وقام الآخرون يحرسونهم فلما جلس رسول الله صلى الله عليه وسلم والصف الذي يليه سجد الآخرون ثم جلسوا جميعا فسلم عليهم جميعا فصلاها بعسفان وصلاها يوم بني سليم ‏.‏ قال أبو داود روى أيوب وهشام عن أبي الزبير عن جابر هذا المعنى عن النبي صلى الله عليه وسلم وكذلك رواه داود بن حصين عن عكرمة عن ابن عباس وكذلك عبد الملك عن عطاء عن جابر وكذلك قتادة عن الحسن عن حطان عن أبي موسى فعله وكذلك عكرمة بن خالد عن مجاهد عن النبي صلى الله عليه وسلم وكذلك هشام بن عروة عن أبيه عن النبي صلى الله عليه وسلم وهو قول الثوري ‏.‏",
      "text_en": " Narrated AbuAyyash az-Zuraqi:                     We accompanied the Messenger of Allah (ﷺ) at Usfan, and Khalid ibn al-Walid was the chief of unbelievers. We offered the noon prayer.  Thereupon, the unbelievers said: We suffered from negligence; we became careless. We should have attacked them while they were praying. Thereupon the verse was revealed, relating to the shortening of the prayer (in time of danger) between the noon and afternoon (prayer).  When the time of the afternoon prayer came, the Messenger of Allah (ﷺ) stood facing the qiblah, and the unbelievers were standing in front of him. The people stood in a row behind the Messenger of Allah (ﷺ) and there was another row behind this row. The Messenger of Allah (ﷺ) bowed and all of them bowed. He then prostrated and also the row near him prostrated. The other people in the second row remained standing and stood guard over them. When they performed two prostrations and stood up, those who were behind them prostrated. The people in the front row near him then stepped backward taking the place of the people in the second row and the second row took the place of the first row.  The Messenger of Allah (ﷺ) then bowed and all of them bowed together. Then he and the row near him prostrated themselves. The other people in the second row remained standing and stood guard over them. When the Messenger of Allah (ﷺ) and the row near him (i.e. the front row) were seated, the people in the second row behind them prostrated themselves. Then all of them were seated. (He (the Prophet) then uttered the salutation upon all of them. He prayed in his manner at Usfan as well as at the territory of Banu Sulaym.Abu Dawud said: This tradition has been narrated by Ayyub and Hisham from Abu al-Zubair on the authority of Jabir to the same effect from the Prophet (ﷺ). Similarly, this has been transmitted by Dawud b. Husain from 'Ikrimah, on the authority of Ibn 'Abbas. This has also been reported by 'Abd al-Malik, from 'Ata' from Jabir in like manner. This has also been narrated by Qatadah from al-Hasan from Hittan on the authority of Abu Musa in a similar way. Similarly, this has been reported by 'Ikrimah b. Khalid from Mujahid from the Prophet (ﷺ). This has also been reported by Hisham b. 'Urwah from his father from the Prophet (ﷺ). This is the opinion of al-Thawri.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20028",
        "11067",
        "11028",
        "1547"
      ]
    },
    {
      "id": "sunan-abi-daud-1247",
      "hadith_no": "1247",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، وسعيد بن منصور، قالا حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله تعالى الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     Allah, the Exalted, prescribed prayer for you, through the tongue of your Prophet (ﷺ), four rak'ahs while resident, two rak'ahs while travelling and one rak'ah in time of danger.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30116",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1541",
      "hadith_no": "1541",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا يعقوب بن عبد الرحمن، - قال سعيد الزهري - عن عمرو بن أبي عمرو، عن أنس بن مالك، قال كنت أخدم النبي صلى الله عليه وسلم فكنت أسمعه كثيرا يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏ وذكر بعض ما ذكره التيمي ‏.‏",
      "text_en": " Anas b. Malik said:                      I used to serve the Prophet (ﷺ) and often hear him say: \"O Allah, I seek refuge in You from grief and anxiety,  from the hardships of debt, and from being overpowered by men.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20185",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-1624",
      "hadith_no": "1624",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن زكريا، عن الحجاج بن دينار، عن الحكم، عن حجية، عن علي، أن العباس، سأل النبي صلى الله عليه وسلم في تعجيل صدقته قبل أن تحل فرخص له في ذلك ‏.‏ قال مرة فأذن له في ذلك ‏.‏ قال أبو داود وروى هذا الحديث هشيم عن منصور بن زاذان عن الحكم عن الحسن بن مسلم عن النبي صلى الله عليه وسلم وحديث هشيم أصح ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Al-Abbas asked the Prophet (ﷺ) about paying the sadaqah (his zakat) in advance before it became due, and he gave permission to do that.Abu Dawud said: This tradition has also been transmitted by Hushaim through a different chain of narrators. The version of Hushaim is more sound.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20313",
        "11069",
        "5",
        "100"
      ]
    },
    {
      "id": "sunan-abi-daud-2030",
      "hadith_no": "2030",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن السرح، وسعيد بن منصور، ومسدد، قالوا حدثنا سفيان، عن منصور الحجبي، حدثني خالي، عن أمي، صفية بنت شيبة قالت سمعت الأسلمية، تقول قلت لعثمان ما قال لك رسول الله صلى الله عليه وسلم حين دعاك قال ‏\"‏ إني نسيت أن آمرك أن تخمر القرنين فإنه ليس ينبغي أن يكون في البيت شىء يشغل المصلي ‏\"‏ ‏.‏ قال ابن السرح خالي مسافع بن شيبة ‏.‏",
      "text_en": " Al-Aslamiyyah said:                      I said to Uthman ibn Talhah al-Hajabi): What did the Messenger of Allah (ﷺ) say to you when he called you? He said: (The Prophet said:) I forgot to order you to cover the two horns (of the lamb), for it is not advisable that there should be anything in the House (the Ka'bah) which diverts the attention of the man at prayer. Ibn as-Sarh said: The name of my maternal uncle is Musafi' ibn Shaybah.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30116",
        "30175",
        "20005"
      ]
    },
    {
      "id": "sunan-abi-daud-2159",
      "hadith_no": "2159",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو معاوية، عن ابن إسحاق، بهذا الحديث قال ‏\"‏ حتى يستبرئها بحيضة ‏\"‏ ‏.‏ زاد فيه ‏{‏ بحيضة وهو وهم من أبي معاوية، وهو صحيح في حديث أبي سعيد زاد ‏}‏ ‏\"‏ ومن كان يؤمن بالله واليوم الآخر فلا يركب دابة من فىء المسلمين حتى إذا أعجفها ردها فيه ومن كان يؤمن بالله واليوم الآخر فلا يلبس ثوبا من فىء المسلمين حتى إذا أخلقه رده فيه ‏\"‏ ‏.‏ قال أبو داود الحيضة ليست بمحفوظة وهو وهم من أبي معاوية ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Ibn Ishaq through a different chain of narrators. This version has the traditional word “a menstrual course” in the phrase “till she is free from a menstrual course”. This is a misunderstanding on the part of the narrator Abu Mu’awiyah. This is correct in the tradition of Abu Sa’id Al Khudri. This version has the additional words “he who believes in Allaah and the Last Day should not ride on a mount belonging to the spoil of Muslims and when he makes it emaciated returns it; he who believes in Allaah and the Last Day should not put on cloth belonging to the spoils of Muslims and when makes it old (shabby) returns it.Abu Dawud said “The word “menstrual course” is not guarded. This is a misunderstanding on the part of Abu Mu’awiyah”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "11107"
      ]
    },
    {
      "id": "sunan-abi-daud-2273",
      "hadith_no": "2273",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سعيد بن منصور، ومسدد، قالا حدثنا سفيان، عن الزهري، عن عروة، عن عائشة، اختصم سعد بن أبي وقاص وعبد بن زمعة إلى رسول الله صلى الله عليه وسلم في ابن أمة زمعة فقال سعد أوصاني أخي عتبة إذا قدمت مكة أن أنظر إلى ابن أمة زمعة فأقبضه فإنه ابنه ‏.‏ وقال عبد بن زمعة أخي ابن أمة أبي ولد على فراش أبي ‏.‏ فرأى رسول الله صلى الله عليه وسلم شبها بينا بعتبة فقال ‏\"‏ الولد للفراش وللعاهر الحجر واحتجبي عنه يا سودة ‏\"‏ ‏.‏ زاد مسدد في حديثه وقال ‏\"‏ هو أخوك يا عبد ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " A’ishah said “Sa’d bin Abi Waqqas and ‘Abd bin Zamah disputed amongst themselves about the (relationship of the) son of the slave girl of Zam’ah and brought the case to the Apostle of Allaah(ﷺ). Sa’d said “My brother ‘Utbah enjoined me that when I came to Makkah I should see the son of the slave girl of Zam’ah and take his possession for that is his son”. ‘Abd bin Zam’ah said “He is my brother, the son of my father’s slave girl having been born on my father’s bed”. The Apostle of Allaah(ﷺ) saw his clear resemblance to ‘Utbah. So he said “The child is attributed to the one on whose bed it is born and the fornicator is deprived of any right (lit. the fornicator will have the stone). Veil yourself from him, Saudah. Musaddad added in his version “he is your brother ‘Abd”.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30175",
        "20012",
        "11013",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-2489",
      "hadith_no": "2489",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن زكريا، عن مطرف، عن بشر أبي عبد الله، عن بشير بن مسلم، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يركب البحر إلا حاج أو معتمر أو غاز في سبيل الله فإن تحت البحر نارا وتحت النار بحرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: No one should sail on the sea except the one who is going to perform hajj or umrah, or the one who is fighting in Allah's path for under the sea there is a fire, and under the fire there is a sea.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20313",
        "11395",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2496",
      "hadith_no": "2496",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان، عن قعنب، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وما من رجل من القاعدين يخلف رجلا من المجاهدين في أهله إلا نصب له يوم القيامة فقيل له هذا قد خلفك في أهلك فخذ من حسناته ما شئت ‏\"‏ ‏.‏ فالتفت إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما ظنكم ‏\"‏ ‏.‏ قال أبو داود كان قعنب رجلا صالحا وكان ابن أبي ليلى أراد قعنبا على القضاء فأبى عليه وقال أنا أريد الحاجة بدرهم فأستعين عليها برجل ‏.‏ قال وأينا لا يستعين في حاجته قال أخرجوني حتى أنظر فأخرج فتوارى ‏.‏ قال سفيان بينما هو متوار إذ وقع عليه البيت فمات ‏.‏",
      "text_en": " Buraidah reported the Apostle of Allaah(ﷺ) as saying “Respect to be shown by those who stay at home to the women of those who are engaged in jihad is t be like that shown to their mothers. If any man among those who stay at home is entrusted with the oversight of one’s family who is engaged in jihad and betrays him, he will be setup for him on the Day of Resurrection and he (the mujahid) will be told “This (man) was entrusted with the oversight of your family, so take what you want from his good deeds. The Apostle of Allaah(ﷺ) turned towards us and said “So what do you think.”Abu Dawud said “Qa’nab (a narrator of this tradition) was a pious man. Ibn Abi Laila intended to appoint him a judge, but he refused and said “If I intend to fulfill my need of a dirham, I seek the help of a person for it. He said “Which of us does not seek the help in his need? He said “Bring me out so that I may see. So he was brought out, and he concealed himself. Sufyan said “While he was concealing himself.” Sufyan said “While he was concealing himself the house suddenly fell on him and he died.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "10813",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2500",
      "hadith_no": "2500",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، حدثني أبو هانئ، عن عمرو بن مالك، عن فضالة بن عبيد، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ كل الميت يختم على عمله، إلا المرابط فإنه ينمو له عمله إلى يوم القيامة ويؤمن من فتان القبر ‏\"‏ ‏.‏",
      "text_en": " Narrated Fadalah ibn Ubayd:                     The Prophet (ﷺ) said: Everyone who dies will have fully complete his action, except one who is on the frontier (in Allah's path), for his deeds will be made to go on increasing till the Day of Resurrection, and he will be safe from the trial in the grave.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "1935"
      ]
    },
    {
      "id": "sunan-abi-daud-2507",
      "hadith_no": "2507",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن خارجة بن زيد، عن زيد بن ثابت، قال ‏:‏ كنت إلى جنب رسول الله صلى الله عليه وسلم فغشيته السكينة فوقعت فخذ رسول الله صلى الله عليه وسلم على فخذي، فما وجدت ثقل شىء أثقل من فخذ رسول الله صلى الله عليه وسلم ثم سري عنه فقال ‏:‏ ‏\"‏ اكتب ‏\"‏ ‏.‏ فكتبت في كتف ‏:‏ لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله ‏.‏ إلى آخر الآية، فقام ابن أم مكتوم - وكان رجلا أعمى - لما سمع فضيلة المجاهدين فقال ‏:‏ يا رسول الله فكيف بمن لا يستطيع الجهاد من المؤمنين فلما قضى كلامه غشيت رسول الله صلى الله عليه وسلم السكينة فوقعت فخذه على فخذي ووجدت من ثقلها في المرة الثانية كما وجدت في المرة الأولى ثم سري عن رسول الله صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ اقرأ يا زيد ‏\"‏ ‏.‏ فقرأت ‏{‏ لا يستوي القاعدون من المؤمنين ‏}‏ فقال رسول الله صلى الله عليه وسلم ‏{‏ غير أولي الضرر ‏}‏ الآية كلها ‏.‏ قال زيد ‏:‏ فأنزلها الله وحدها فألحقتها، والذي نفسي بيده لكأني أنظر إلى ملحقها عند صدع في كتف ‏.‏",
      "text_en": " Zaid bin Thabit said “I was beside the Apostle of Allaah(ﷺ) when the divinely-inspired calmness overtook him and the thigh of the Apostle of Allaah(ﷺ) fell on my thigh. I did not find any weightier than the thigh of the Apostle of Allaah(ﷺ). He then regained his composure and said “Write down. I wrote on a shoulder. Not equal are thise believers who sit (at home), other than those who have a (disabling) hurt, and those who strive in the way of Allaah. When Ibn Umm Makhtum who was blind heard the excellence of the warriors. He stood up and said “Apostle of Allaah(ﷺ) how is it for those believers who are unable to fight (in the path of Allaah)? When he finished his question his divinely-inspired calmness overtook him, and his thigh fell on my thigh and I found its weight the second time as I found the first time.” When the Apostle of Allaah(ﷺ) regained his composure, he said “Apostle of Allaah(ﷺ) said “Other than those who have a (disabling hurt). Zaid said “Allaah, the exalted, revealed it alone and I appended it.” By Him in Whose hands is my life, I am seeing, as it were the place where I put it (i.e., the verse) at the crack in the shoulder.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20509",
        "11061",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-2510",
      "hadith_no": "2510",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، عن يزيد بن أبي سعيد، مولى المهري عن أبيه، عن أبي سعيد الخدري، ‏:‏ أن رسول الله صلى الله عليه وسلم بعث إلى بني لحيان وقال ‏:‏ ‏\"‏ ليخرج من كل رجلين رجل ‏\"‏ ‏.‏ ثم قال للقاعدين ‏:‏ ‏\"‏ أيكم خلف الخارج في أهله وماله بخير كان له مثل نصف أجر الخارج ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id Al Khudri said “The Apostle of Allaah(ﷺ) sent an expedition towards Banu Lihyan and said “One of the two persons should go forth. He then said to those who sat (at home), If any one of you looks after the family and property of a warrior, he will receive half the reward of the one who goes forth (in jihad).”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377",
        "11411",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-2513",
      "hadith_no": "2513",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن المبارك، حدثني عبد الرحمن بن يزيد بن جابر، حدثني أبو سلام، عن خالد بن زيد، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ إن الله عز وجل يدخل بالسهم الواحد ثلاثة نفر الجنة ‏:‏ صانعه يحتسب في صنعته الخير، والرامي به، ومنبله، وارموا واركبوا، وأن ترموا أحب إلى من أن تركبوا، ليس من اللهو إلا ثلاث ‏:‏ تأديب الرجل فرسه وملاعبته أهله ورميه بقوسه ونبله، ومن ترك الرمى بعد ما علمه رغبة عنه فإنها نعمة تركها ‏\"‏ ‏.‏ أو قال ‏:‏ ‏\"‏ كفرها ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) say: Allah, Most High, will cause three persons to enter Paradise for one arrow: the maker when he has a good motive in making it, the one who shoots it, and the one who hands it; so shoot and ride, but your shooting is dearer to me than your riding. Everything with which a man amuses himself is vain except three (things): a man's training of his horse, his playing with his wife, and his shooting with his bow and arrow. If anyone abandons archery after becoming an adept through distaste for it, it is a blessing he has abandoned; or he said: for which he has been ungrateful.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20025",
        "20395",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2514",
      "hadith_no": "2514",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن أبي علي، ‏:‏ ثمامة بن شفى الهمداني أنه سمع عقبة بن عامر الجهني، يقول سمعت رسول الله صلى الله عليه وسلم وهو على المنبر يقول ‏:‏ ‏\"‏ ‏{‏ وأعدوا لهم ما استطعتم من قوة ‏}‏ ألا إن القوة الرمى، ألا إن القوة الرمى، ألا إن القوة الرمى ‏\"‏ ‏.‏",
      "text_en": " ‘Uqabah bin Amir Al Juhani said “I heard the Apostle of Allaah(ﷺ) recite when he was on the pulpit “Against them make ready your strength to the utmost of your power. Beware, strength is shooting, beware strength is shooting, beware strength is shooting.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2530",
      "hadith_no": "2530",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، أن دراجا أبا السمح، حدثه عن أبي الهيثم، عن أبي سعيد الخدري، ‏:‏ أن رجلا، هاجر إلى رسول الله صلى الله عليه وسلم من اليمن، فقال ‏:‏ ‏\"‏ هل لك أحد باليمن ‏\"‏ ‏.‏ قال ‏:‏ أبواى ‏.‏ قال ‏:‏ ‏\"‏ أذنا لك ‏\"‏ ‏.‏ قال ‏:‏ لا ‏.‏ قال ‏:‏ ‏\"‏ ارجع إليهما فاستأذنهما، فإن أذنا لك فجاهد، وإلا فبرهما ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     A man emigrated to the Messenger of Allah (ﷺ) from the Yemen. He asked (him): Have you anyone (of your relatives) in the Yemen? He replied: My parents. He asked: Did they permit you? He replied: No. He said: Go back to them and ask for their permission. If they permit you, then fight (in the path of Allah), otherwise be devoted to them.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-2532",
      "hadith_no": "2532",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو معاوية، حدثنا جعفر بن برقان، عن يزيد بن أبي نشبة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ ثلاثة من أصل الإيمان ‏:‏ الكف عمن قال لا إله إلا الله ولا تكفره بذنب ولا تخرجه من الإسلام بعمل، والجهاد ماض منذ بعثني الله إلى أن يقاتل آخر أمتي الدجال لا يبطله جور جائر ولا عدل عادل، والإيمان بالأقدار ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: Three things are the roots of faith: to refrain from (killing) a person who utters, \"There is no god but Allah\" and not to declare him unbeliever whatever sin he commits, and not to excommunicate him from Islam for his any action; and jihad will be performed continuously since the day Allah sent me as a prophet until the day the last member of my community will fight with the Dajjal (Antichrist). The tyranny of any tyrant and the justice of any just (ruler) will not invalidate it. One must have faith in Divine decree.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "20646",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2595",
      "hadith_no": "2595",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يزيد بن هارون، عن الحجاج، عن قتادة، عن الحسن، عن سمرة بن جندب، قال كان شعار المهاجرين عبد الله وشعار الأنصار عبد الرحمن ‏.‏",
      "text_en": " Samurah bin Jundub said “The war-cry of the Emigrants was ‘Abd Allah and that of the helpers ‘Abd Al Rahman.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20472",
        "20381",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "id": "sunan-abi-daud-2605",
      "hadith_no": "2605",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن المبارك، عن يونس بن يزيد، عن الزهري، عن عبد الرحمن بن كعب بن مالك، عن كعب بن مالك، قال قلما كان رسول الله صلى الله عليه وسلم يخرج في سفر إلا يوم الخميس ‏.‏",
      "text_en": " Narrated Ka'b ibn Malik:                     It was rarely that the Messenger of Allah (ﷺ)  set out on a journey on any day but on a Thursday.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20025",
        "20475",
        "11013",
        "1134",
        "390"
      ]
    },
    {
      "id": "sunan-abi-daud-2606",
      "hadith_no": "2606",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، حدثنا يعلى بن عطاء، حدثنا عمارة بن حديد، عن صخر الغامدي، عن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لأمتي في بكورها ‏\"‏ ‏.‏ وكان إذا بعث سرية أو جيشا بعثهم في أول النهار ‏.‏ وكان صخر رجلا تاجرا وكان يبعث تجارته من أول النهار فأثرى وكثر ماله ‏.‏ قال أبو داود وهو صخر بن وداعة ‏.‏",
      "text_en": " Narrated Sakhr al-Ghamidi:                     The Prophet (ﷺ) said: \"O Allah, bless my people in their early mornings.\" When he sent out a detachment or an army, he sent them at the beginning of the day. Sakhr was a merchant, and he would send off his merchandise at the beginning of the day; and he became rich and had much wealth.Abu Dawud said: He is Sakhr b. Wada'ah.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20468",
        "10986",
        "19930"
      ]
    },
    {
      "id": "sunan-abi-daud-2629",
      "hadith_no": "2629",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن عياش، عن أسيد بن عبد الرحمن الخثعمي، عن فروة بن مجاهد اللخمي، عن سهل بن معاذ بن أنس الجهني، عن أبيه، قال غزوت مع نبي الله صلى الله عليه وسلم غزوة كذا وكذا فضيق الناس المنازل وقطعوا الطريق فبعث نبي الله صلى الله عليه وسلم مناديا ينادي في الناس أن من ضيق منزلا أو قطع طريقا فلا جهاد له ‏.‏",
      "text_en": " Narrated Mu'adh ibn Anas al-Juhani:                     I fought along with the Prophet (ﷺ) in such and such battles. The people occupied much space and encroached on the road. The Prophet (ﷺ) sent an announcer to announce among the people: Those who occupy much space or encroach on the road will not be credited with jihad.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20736",
        "18053",
        "5225"
      ]
    },
    {
      "id": "sunan-abi-daud-2633",
      "hadith_no": "2633",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن إبراهيم، أخبرنا ابن عون، قال كتبت إلى نافع أسأله عن دعاء المشركين، عند القتال فكتب إلى أن ذلك كان في أول الإسلام وقد أغار نبي الله صلى الله عليه وسلم على بني المصطلق وهم غارون وأنعامهم تسقى على الماء فقتل مقاتلتهم وسبى سبيهم وأصاب يومئذ جويرية بنت الحارث حدثني بذلك عبد الله وكان في ذلك الجيش ‏.‏ قال أبو داود هذا حديث نبيل رواه ابن عون عن نافع ولم يشركه فيه أحد ‏.‏",
      "text_en": " Ibn ‘Awn said “I wrote to Nafi’ asking him about summoning the polytheists (to Islam) at the time of fighting. So, he wrote to me “This was in the early days of Islam. The Prophet of Allaah(ﷺ) attacked Banu Al Mustaliq while they were inattentive and their cattle were drinking water. So their fighters were killed and the survivors (i.e., women and children) were taken prisoners. On that day Juwairiyyah daughter of Al Harith was obtained. ‘Abd Allaah narrated this to me, he was in that army.”Abu Dawud said “This is a good tradition narrtted by Ibn ‘Awn from Nafi’ and no one shared him in narrating it.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20208",
        "11071"
      ]
    },
    {
      "id": "sunan-abi-daud-2635",
      "hadith_no": "2635",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، أخبرنا سفيان، عن عبد الملك بن نوفل بن مساحق، عن ابن عصام المزني، عن أبيه، قال بعثنا رسول الله صلى الله عليه وسلم في سرية فقال ‏\"‏ إذا رأيتم مسجدا أو سمعتم مؤذنا فلا تقتلوا أحدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Isam al-Muzani:                     The Messenger of Allah (ﷺ) sent us in a detachment and said (to us): If you see a mosque or hear a mu'adhdhin (calling to prayer), do not kill anyone.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "12319"
      ]
    },
    {
      "id": "sunan-abi-daud-2636",
      "hadith_no": "2636",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان، عن عمرو، أنه سمع جابرا، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الحرب خدعة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported the Apostle of Allaah(ﷺ) as saying “War is deception.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-2670",
      "hadith_no": "2670",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، حدثنا حجاج، حدثنا قتادة، عن الحسن، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوا شيوخ المشركين واستبقوا شرخهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: Kill the old men who are polytheists, but spare their children.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20468",
        "20219",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "id": "sunan-abi-daud-2673",
      "hadith_no": "2673",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا مغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، حدثني محمد بن حمزة الأسلمي، عن أبيه، أن رسول الله صلى الله عليه وسلم أمره على سرية قال فخرجت فيها وقال ‏\"‏ إن وجدتم فلانا فاحرقوه بالنار ‏\"‏ ‏.‏ فوليت فناداني فرجعت إليه فقال ‏\"‏ إن وجدتم فلانا فاقتلوه ولا تحرقوه فإنه لا يعذب بالنار إلا رب النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Hamzah al-Aslami:                     The Messenger of Allah (ﷺ) appointed him commander over a detachment. He said: I went out along with it. He (the Prophet) said: If you find so-and-so, burn him with the fire. I then turned away, and he called me. So I returned to him, and he said: If you find so-and-so, kill him, and do not burn him, for no one punishes with fire except the Lord of the fire.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20182",
        "11061"
      ]
    },
    {
      "id": "sunan-abi-daud-2687",
      "hadith_no": "2687",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن بكير بن عبد الله بن الأشج، عن ابن تعلى، قال غزونا مع عبد الرحمن بن خالد بن الوليد فأتي بأربعة أعلاج من العدو فأمر بهم فقتلوا صبرا ‏.‏ قال أبو داود قال لنا غير سعيد عن ابن وهب في هذا الحديث قال بالنبل صبرا فبلغ ذلك أبا أيوب الأنصاري فقال سمعت رسول الله صلى الله عليه وسلم ينهى عن قتل الصبر فوالذي نفسي بيده لو كانت دجاجة ما صبرتها ‏.‏ فبلغ ذلك عبد الرحمن بن خالد بن الوليد فأعتق أربع رقاب ‏.‏",
      "text_en": " Narrated Ibn Ti'li:                     We fought along with AbdurRahman ibn Khalid ibn al-Walid. Four infidels from the enemy were brought to him. He commanded about them and they were killed in confinement.Abu Dawud said: The narrators other than Sa'id reported from Ibn Wahb in this tradition: \"(killed him) with arrows in confinement.\" When Abu Ayyub al-Ansari was informed about it, he said: I heard the Messenger of Allah (ﷺ) prohibiting to kill in confinement. By Him in Whose hands my soul is, if there were a hen, I would not kill it in confinement. 'Abd al-Rahman b. Khalid b. al-Walid was informed about it (the Prophet's prohibition). He set four slaves free.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377",
        "11154",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-2706",
      "hadith_no": "2706",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، أن ابن حرشف الأزدي، حدثه عن القاسم، مولى عبد الرحمن عن بعض، أصحاب النبي صلى الله عليه وسلم قال كنا نأكل الجزر في الغزو ولا نقسمه حتى إن كنا لنرجع إلى رحالنا وأخرجتنا منه مملاة ‏.‏",
      "text_en": " Narrated One of the Companion:                     Al-Qasim, the client of AbdurRahman, quoted one of the Companion of the Prophet (ﷺ) as saying: We would eat a camel on an expedition without dividing it, and when we returned to our dwellings our saddle-bags would be full with its flesh.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377"
      ]
    },
    {
      "id": "sunan-abi-daud-2708",
      "hadith_no": "2708",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، وعثمان بن أبي شيبة، - المعنى - قال أبو داود وأنا لحديثه، أتقن - قالا حدثنا أبو معاوية، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن أبي مرزوق، مولى تجيب عن حنش الصنعاني، عن رويفع بن ثابت الأنصاري، أن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله وباليوم الآخر فلا يركب دابة من فىء المسلمين حتى إذا أعجفها ردها فيه ومن كان يؤمن بالله وباليوم الآخر فلا يلبس ثوبا من فىء المسلمين حتى إذا أخلقه رده فيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit al-Ansari:                     The Prophet (ﷺ) said: He who believes in Allah and the Last Day must not ride on packhorse belonging to the booty of the Muslims and put it back when he has emaciated it; and he who believes in Allah and the Last Day must not wear a garment belonging to the booty of the Muslims and put it back when he made it threadbare.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "11107",
        "11411",
        "10905"
      ]
    },
    {
      "id": "sunan-abi-daud-2713",
      "hadith_no": "2713",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا النفيلي، وسعيد بن منصور، قالا حدثنا عبد العزيز بن محمد، - قال النفيلي الأندراوردي - عن صالح بن محمد بن زائدة، - قال أبو داود وصالح هذا أبو واقد - قال دخلت مع مسلمة أرض الروم فأتي برجل قد غل فسأل سالما عنه فقال سمعت أبي يحدث عن عمر بن الخطاب عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وجدتم الرجل قد غل فأحرقوا متاعه واضربوه ‏\"‏ ‏.‏ قال فوجدنا في متاعه مصحفا فسأل سالما عنه فقال بعه وتصدق بثمنه ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Salih ibn Muhammad ibn Za'idah (AbuDawud said: This Salih is AbuWaqid) said: We entered the Byzantine territory with Maslamah. A man who had been dishonest about booty was brought. He (Maslamah) asked Salim about him. He said: I heard my father narrating from Umar ibn al-Khattab from the Prophet (ﷺ). He said: When you find a man who has been dishonest about booty, burn his property, and beat him. He beat him. He said: We found in his property a copy of the Qur'an. He again asked Salim about it. He said: Sell it and give its price in charity.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "30116",
        "20167",
        "19807",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-2721",
      "hadith_no": "2721",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن عياش، عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، وخالد بن الوليد، أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل ولم يخمس السلب ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i ; Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) gave judgement that the killer should have what was taken from the man he killed, and did not make this subject to division into fifths.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20736",
        "10921",
        "10942",
        "3051",
        "22"
      ]
    },
    {
      "id": "sunan-abi-daud-2723",
      "hadith_no": "2723",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، قال حدثنا إسماعيل بن عياش، عن محمد بن الوليد الزبيدي، عن الزهري، أن عنبسة بن سعيد، أخبره أنه، سمع أبا هريرة، يحدث سعيد بن العاص أن رسول الله صلى الله عليه وسلم بعث أبان بن سعيد بن العاص على سرية من المدينة قبل نجد فقدم أبان بن سعيد وأصحابه على رسول الله صلى الله عليه وسلم بخيبر بعد أن فتحها وإن حزم خيلهم ليف فقال أبان اقسم لنا يا رسول الله ‏.‏ قال أبو هريرة فقلت لا تقسم لهم يا رسول الله ‏.‏ فقال أبان أنت بها يا وبر تحدر علينا من رأس ضال ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اجلس يا أبان ‏\"‏ ‏.‏ ولم يقسم لهم رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Sa'id ibn al-'As:                     The Messenger of Allah (ﷺ) sent AbuSa'id ibn al-'As with an expedition from Medina towards Najd. Aban ibn Sa'id and his companions came to the Messenger of Allah (ﷺ) at Khaybar after it had been captured. The girths of their horses were made of palm fibres. Aban said: Give us a share (from the booty), Messenger of Allah. AbuHurayrah said: I said: Do not give them a share, Messenger of Allah. Aban said: Why are you talking so, Wabr. You have come to us from the peak of Dal. The Prophet (ﷺ) said: Sit down, Aban. The Messenger of Allah (ﷺ) did not give any share to them (from the booty).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20736",
        "20459",
        "11013",
        "25221",
        "13",
        "989"
      ]
    },
    {
      "id": "sunan-abi-daud-2731",
      "hadith_no": "2731",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال كنت أميح أصحابي الماء يوم بدر ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I supplied water to my companions on the day of Badr.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-2953",
      "hadith_no": "2953",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن المبارك، ح وحدثنا ابن المصفى، قال حدثنا أبو المغيرة، جميعا عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك، أن رسول الله صلى الله عليه وسلم كان إذا أتاه الفىء قسمه في يومه فأعطى الآهل حظين وأعطى العزب حظا ‏.‏ زاد ابن المصفى فدعينا وكنت أدعى قبل عمار فدعيت فأعطاني حظين وكان لي أهل ثم دعي بعدي عمار بن ياسر فأعطى له حظا واحدا ‏.‏",
      "text_en": " Narrated 'Awf bin Malik:                     When the spoils (fai') came to the Messenger of Allah (ﷺ), he divided it that day ; he gave two portions to a married man and one to a bachelor. The narrator Ibn al-Musaffa added: We were summoned, and I would be summoned before 'Ammar. So I was summoned and he gave me two portions, for I had a family ; then 'Ammar b. Yasir was summoned after me and given one.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20025",
        "20442",
        "10921",
        "10942",
        "10805"
      ]
    },
    {
      "id": "sunan-abi-daud-2995",
      "hadith_no": "2995",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يعقوب بن عبد الرحمن الزهري، عن عمرو بن أبي عمرو، عن أنس بن مالك، قال قدمنا خيبر فلما فتح الله تعالى الحصن ذكر له جمال صفية بنت حيى وقد قتل زوجها وكانت عروسا فاصطفاها رسول الله صلى الله عليه وسلم لنفسه فخرج بها حتى بلغنا سد الصهباء حلت فبنى بها ‏.‏",
      "text_en": " Anas bin Malik said “We came to Khaibar. We bestowed the conquest of fortress (on us), the beauty of Safiyyah daughter of Huyayy was mentioned to him (the Prophet). Her husband was killed (in the battle) and she was a bride. The Apostle of Allaah(ﷺ) chose her for himself. He came out with her till we reached Sadd Al Sahba’ where she was purified. So he cohabited with her.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-3029",
      "hadith_no": "3029",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان بن عيينة، عن سليمان الأحول، عن سعيد بن جبير، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أوصى بثلاثة فقال ‏\"‏ أخرجوا المشركين من جزيرة العرب وأجيزوا الوفد بنحو مما كنت أجيزهم ‏\"‏ ‏.‏ قال ابن عباس وسكت عن الثالثة أو قال فأنسيتها ‏.‏ وقال الحميدي عن سفيان قال سليمان لا أدري أذكر سعيد الثالثة فنسيتها أو سكت عنها",
      "text_en": " Ibn ‘Abbas said that the Prophet (ﷺ) gave three instructions saying “Expel the polytheists from Arabia, reward deputations as I did”. Ibn ‘Abbas said “He either did not mention the third or I have been caused to forget it. Al Humaidi said on the authority of Sufyan that Sulaiman said “I do not know whether Sa’id mentioned the third and I forgot or he himself did not mention it.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11247",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3051",
      "hadith_no": "3051",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، وسعيد بن منصور، قالا حدثنا أبو عوانة، عن منصور، عن هلال، عن رجل، من ثقيف عن رجل، من جهينة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لعلكم تقاتلون قوما فتظهرون عليهم فيتقونكم بأموالهم دون أنفسهم وأبنائهم ‏\"‏ ‏.‏ قال سعيد في حديثه ‏\"‏ فيصالحونكم على صلح ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ فلا تصيبوا منهم شيئا فوق ذلك فإنه لا يصلح لكم ‏\"‏ ‏.‏",
      "text_en": " Narrated A man of Juhaynah:                     The Prophet (ﷺ) said: Probably you will fight with a people, you will dominate them, and they will save themselves and their children by their property. The version of Sa'id has You will then conclude peace with them. The agreed version goes: Then do no take anything from them more than that, for it is not proper for you.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30116",
        "20469",
        "11067",
        "11229"
      ]
    },
    {
      "id": "sunan-abi-daud-3084",
      "hadith_no": "3084",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن محمد، عن عبد الرحمن بن الحارث، عن ابن شهاب، عن عبيد الله بن عبد الله، عن عبد الله بن عباس، عن الصعب بن جثامة، أن النبي صلى الله عليه وسلم حمى النقيع وقال ‏\"‏ لا حمى إلا لله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated As-Sa'b ibn Jaththamah:                     The Prophet (ﷺ) protected Naqi and said: There is no (permission for) protected land except for Allah Most High.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20167",
        "448",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "id": "sunan-abi-daud-3189",
      "hadith_no": "3189",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا فليح بن سليمان، عن صالح بن عجلان، ومحمد بن عبد الله بن عباد، عن عباد بن عبد الله بن الزبير، عن عائشة، قالت والله ما صلى رسول الله صلى الله عليه وسلم على سهيل ابن البيضاء إلا في المسجد ‏.‏",
      "text_en": " Narrated 'Aishah:                     I swear by Allah, the Messenger of Allah (ﷺ) prayed over Suhail b. al-Baida' in the mosque.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20169",
        "23507",
        "15488",
        "11250",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3341",
      "hadith_no": "3341",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن الشعبي، عن سمعان، عن سمرة، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فلم يجبه أحد ثم قال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فلم يجبه أحد ثم قال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فقام رجل فقال أنا يا رسول الله ‏.‏ فقال صلى الله عليه وسلم ‏\"‏ ما منعك أن تجيبني في المرتين الأوليين أما إني لم أنوه بكم إلا خيرا إن صاحبكم مأسور بدينه ‏\"‏ ‏.‏ فلقد رأيته أدى عنه حتى ما بقي أحد يطلبه بشىء ‏.‏ قال أبو داود سمعان بن مشنج ‏.‏",
      "text_en": " Narrated Samurah:                     The Messenger of Allah (ﷺ) addressed us and said: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe? Then a man stood and said: I am (here), Messenger of Allah. He said: What prevented you from replying the first two times? I wish to tell you something good. Your companion has been detained (from entering Paradise) on account of his debt. Then I saw him that he paid off all his debt on his behalf and there remained no one to demand from him anything.Abu Dawud said: The name of the narrator Sam'an is Sam'an b. Mushannaj.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20327",
        "20016",
        "11052",
        "394"
      ]
    },
    {
      "id": "sunan-abi-daud-3661",
      "hadith_no": "3661",
      "source": "Sunan Abi Da'ud",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، - يعني ابن سعد - عن النبي صلى الله عليه وسلم قال ‏\"‏ والله لأن يهدى بهداك رجل واحد خير لك من حمر النعم ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa’d reported the prophet (ﷺ) as saying:                      I swear on Allah, it will be better for you that Allah should give guidance to one man through your agency than that you should acquire the red ones among the camels.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "id": "sunan-abi-daud-3686",
      "hadith_no": "3686",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو شهاب عبد ربه بن نافع، عن الحسن بن عمرو الفقيمي، عن الحكم بن عتيبة، عن شهر بن حوشب، عن أم سلمة، قالت نهى رسول الله صلى الله عليه وسلم عن كل مسكر ومفتر ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) forbade every intoxicant and everything which produces languidness.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20437",
        "11624",
        "11069",
        "11044",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-3735",
      "hadith_no": "3735",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سعيد بن منصور، وعبد الله بن محمد النفيلي، وقتيبة بن سعيد، قالوا حدثنا عبد العزيز بن محمد، عن هشام، عن أبيه، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم كان يستعذب له الماء من بيوت السقيا ‏.‏ قال قتيبة عين بينها وبين المدينة يومان ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The water from as-Suqya' was considered sweetest by the Prophet (ﷺ). Qutaybah said: it was a well on two days' journey from Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30352",
        "30367",
        "20167",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3778",
      "hadith_no": "3778",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو معشر، عن هشام بن عروة، عن أبيه، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقطعوا اللحم بالسكين فإنه من صنيع الأعاجم وانهسوه فإنه أهنأ وأمرأ ‏\"‏ ‏.‏ قال أبو داود وليس هو بالقوي ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: Do not eat meat with a knife, for it is a foreign practice, but bite it, for it is more beneficial and wholesome.Abu Dawud said: This tradition is not strong.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "10765",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3799",
      "hadith_no": "3799",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا إبراهيم بن خالد الكلبي أبو ثور، حدثنا سعيد بن منصور، حدثنا عبد العزيز بن محمد، عن عيسى بن نميلة، عن أبيه، قال كنت عند ابن عمر فسئل عن أكل القنفذ، فتلا ‏{‏ قل لا أجد فيما أوحي إلى محرما ‏}‏ الآية قال قال شيخ عنده سمعت أبا هريرة يقول ذكر عند النبي صلى الله عليه وسلم فقال ‏\"‏ خبيثة من الخبائث ‏\"‏ ‏.‏ فقال ابن عمر إن كان قال رسول الله صلى الله عليه وسلم هذا فهو كما قال ما لم ندر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Numaylah  said: I was with Ibn Umar. He was asked about eating hedgehog. He recited: \"Say: I find not in the message received by me by inspiration any (meat) forbidden.\" An old man who was with him said: I heard AbuHurayrah say: It was mentioned to the Messenger of Allah (ﷺ). Noxious of the noxious. Ibn Umar said: If the Messenger of Allah (ﷺ) had said it, it is as he said that we did not know.",
      "usc_msa_ref": "",
      "chain": [
        "38072",
        "30116",
        "20167",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3975",
      "hadith_no": "3975",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا ابن أبي الزناد، ح وحدثنا محمد بن سليمان الأنباري، حدثنا حجاج بن محمد، عن ابن أبي الزناد، - وهو أشبع - عن أبيه، عن خارجة بن زيد بن ثابت، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ ‏{‏ غير أولي الضرر ‏}‏ ولم يقل سعيد كان يقرأ ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Prophet (ﷺ) used to read: \"Not equal are those believers who sit (at home) and receive no hurt (ghayru ulid-darari) but the narrator Sa'id did not say the words \"used to read\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20509",
        "31160",
        "20381",
        "20509",
        "11061",
        "11006",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-4175",
      "hadith_no": "4175",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا النفيلي، وسعيد بن منصور، قالا حدثنا عبد الله بن محمد أبو علقمة، قال حدثني يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة أصابت بخورا فلا تشهدن معنا العشاء ‏\"‏ ‏.‏ قال ابن نفيل ‏\"‏ عشاء الآخرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If a woman fumigates herself with perfume, she must not attend the night prayer with us. Ibn Nufayl said: Isha' means night prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "30116",
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5155",
      "hadith_no": "5155",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد بن مسرهد، وسعيد بن منصور، أن الحارث بن عبيد، حدثهم عن أبي عمران الجوني، عن طلحة، عن عائشة، رضى الله عنها قالت قلت يا رسول الله إن لي جارين بأيهما أبدأ قال ‏\"‏ بأدناهما بابا ‏\"‏ ‏.‏ قال أبو داود قال شعبة في هذا الحديث طلحة رجل من قريش ‏.‏",
      "text_en": " ‘A’ishah said:                      I asked : apostle of Allah! I have two neighbors. With which of them should I begin? He replied: Begin with the one whose door is nearer to you.Abu Dawud said: Shu’bah said this tradition : Talhah is a man of the Quraish.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30116",
        "20533",
        "11296",
        "11356",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-678",
      "hadith_no": "678",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا سعيد بن منصور، حدثنا إسماعيل بن زكريا، عن الحجاج بن دينار، عن الحكم بن عتيبة، عن حجية بن عدي، عن علي، أن العباس، سأل رسول الله صلى الله عليه وسلم عن تعجيل صدقته قبل أن تحل فرخص له في ذلك ‏.‏",
      "text_en": " Ali narrated:                     \"Al-Abbas asked the Messenger of Allah about paying his charity (Zakat) in advance before its time is due (by being in possession for a whole year), he permitted him to do that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30116",
        "20313",
        "11069",
        "18167",
        "5",
        "100"
      ]
    },
    {
      "id": "sunan-an-nasai-4968",
      "hadith_no": "4968",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن علي بن ميمون، قال حدثنا سعيد بن منصور، قال حدثنا عبد العزيز بن محمد، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن أبي ميمون، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ أبو ميمون لا أعرفه ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"' (Sahih)   Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake, and I do not know who Abu Maimun (one of the narrators) is.",
      "usc_msa_ref": "",
      "chain": [
        "38556",
        "30116",
        "20167",
        "11062",
        "11222",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-261",
      "hadith_no": "261",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "قال أبو الحسن أنبأنا أبو حاتم، حدثنا سعيد بن منصور، حدثنا فليح بن سليمان، فذكر نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "30116",
        "20169"
      ]
    },
    {
      "id": "sunan-ibn-majah-1680",
      "hadith_no": "1680",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، قال حدثنا سعيد بن منصور، حدثنا هشيم، ح وحدثنا شجاع بن مخلد أبو الفضل، قال حدثنا هشيم، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله البجلي، قال كنا نرى الاجتماع إلى أهل الميت وصنعة الطعام من النياحة ‏.‏",
      "text_en": " It wasnarrated that Jarir bin ‘Abdullah Al-Bajali said:                      “We used tothink that gathering with the family of the deceased and preparingfood was a form of wailing.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30116",
        "20468",
        "30506",
        "20468",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-ibn-majah-1867",
      "hadith_no": "1867",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا سعيد بن منصور، حدثنا إسماعيل بن زكريا، عن حجاج بن دينار، عن الحكم، عن حجية بن عدي، عن علي بن أبي طالب، أن العباس، سأل النبي  صلى الله عليه وسلم  في تعجيل صدقته قبل أن تحل فرخص له في ذلك ‏.‏",
      "text_en": " Ali bin Abu Talib narrated that  :                     Abbas asked the Prophet about paying his Sadaqah before it is due, and he granted him permission to do that.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30116",
        "20313",
        "20737",
        "11069",
        "18167",
        "5",
        "100"
      ]
    }
  ],
  "total_hadiths": 118
}