{
  "id": "30116",
  "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
  "full_name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "227",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Khurasni",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20533",
      "name": "al-Harith bin 'Ubaid al-Ayadi الحارث بن عبيد الإيادي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20192",
      "name": "Da'ud bin 'Abdur Rahman al-'Atar داود بن عبد الرحمن العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20437",
      "name": "'Abd Rabah bin Nafi',Abu Shahab al-Hanat عبد ربه بن نافع أبو شهاب الحناط",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38556",
      "name": "Muhammad bin 'Ali in Maymun محمد بن علي بن ميمون",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "39078",
      "name": "Ahmed bin Khlyd bin Yazid أحمد بن خليد",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "872",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن منصور، حدثنا فليح، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يصلي الصبح بغلس فينصرفن نساء المؤمنين، لا يعرفن من الغلس، أو لا يعرف بعضهن بعضا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
      "chain": [
        "30221",
        "30116",
        "20169",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، ومحمد بن عبيد الغبري، - واللفظ لسعيد - قالوا حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله تجاوز لأمتي ما حدثت به أنفسها ما لم يتكلموا أو يعملوا به ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Verily Allah forgave my people the evil promptings which arise within their hearts as long as they did not speak about them or did not act upon them.",
      "chain": [
        "30116",
        "30367",
        "30213",
        "20469",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "hadith_no": "500",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الربيع العتكي، حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، ح وحدثناه سعيد بن منصور، - واللفظ له - حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، قال انطلقنا إلى أنس بن مالك وتشفعنا بثابت فانتهينا إليه وهو يصلي الضحى فاستأذن لنا ثابت فدخلنا عليه وأجلس ثابتا معه على سريره فقال له يا أبا حمزة إن إخوانك من أهل البصرة يسألونك أن تحدثهم حديث الشفاعة ‏.‏ قال حدثنا محمد صلى الله عليه وسلم قال ‏\"‏ إذا كان يوم القيامة ماج الناس بعضهم إلى بعض فيأتون آدم فيقولون له اشفع لذريتك ‏.‏ فيقول لست لها ولكن عليكم بإبراهيم - عليه السلام - فإنه خليل الله ‏.‏ فيأتون إبراهيم فيقول لست لها ولكن عليكم بموسى - عليه السلام - فإنه كليم الله ‏.‏ فيؤتى موسى فيقول لست لها ولكن عليكم بعيسى - عليه السلام - فإنه روح الله وكلمته ‏.‏ فيؤتى عيسى فيقول لست لها ولكن عليكم بمحمد صلى الله عليه وسلم فأوتى فأقول أنا لها ‏.‏ فأنطلق فأستأذن على ربي فيؤذن لي فأقوم بين يديه فأحمده بمحامد لا أقدر عليه الآن يلهمنيه الله ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع فأقول رب أمتي أمتي ‏.‏ فيقال انطلق فمن كان في قلبه مثقال حبة من برة أو شعيرة من إيمان فأخرجه منها ‏.‏ فأنطلق فأفعل ثم أرجع إلى ربي فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع ‏.‏ فأقول أمتي أمتي ‏.‏ فيقال لي انطلق فمن كان في قلبه مثقال حبة من خردل من إيمان فأخرجه منها ‏.‏ فأنطلق فأفعل ثم أعود إلى ربي فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع فأقول يا رب أمتي أمتي ‏.‏ فيقال لي انطلق فمن كان في قلبه أدنى أدنى أدنى من مثقال حبة من خردل من إيمان فأخرجه من النار فأنطلق فأفعل ‏\"‏ ‏.‏ هذا حديث أنس الذي أنبأنا به فخرجنا من عنده فلما كنا بظهر الجبان قلنا لو ملنا إلى الحسن فسلمنا عليه وهو مستخف في دار أبي خليفة - قال - فدخلنا عليه فسلمنا عليه فقلنا يا أبا سعيد جئنا من عند أخيك أبي حمزة فلم نسمع مثل حديث حدثناه في الشفاعة قال هيه ‏.‏ فحدثناه الحديث ‏.‏ فقال هيه ‏.‏ قلنا ما زادنا ‏.‏ قال قد حدثنا به منذ عشرين سنة وهو يومئذ جميع ولقد ترك شيئا ما أدري أنسي الشيخ أو كره أن يحدثكم فتتكلوا ‏.‏ قلنا له حدثنا ‏.‏ فضحك وقال خلق الإنسان من عجل ما ذكرت لكم هذا إلا وأنا أريد أن أحدثكموه ‏\"‏ ثم أرجع إلى ربي في الرابعة فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعط واشفع تشفع ‏.‏ فأقول يا رب ائذن لي فيمن قال لا إله إلا الله ‏.‏ قال ليس ذاك لك - أو قال ليس ذاك إليك - ولكن وعزتي وكبريائي وعظمتي وجبريائي لأخرجن من قال لا إله إلا الله ‏\"‏ ‏.‏ قال فأشهد على الحسن أنه حدثنا به أنه سمع أنس بن مالك أراه قال قبل عشرين سنة وهو يومئذ جميع ‏.‏",
      "text_en": " Ma'bad b. Hilal al 'Anazi reported:                      We went to Anas b. Malik through Thabit and reached there (his house) while he was offering the forenoon prayer. Thabit sought permission for us and we entered, and he seated Thabit with him on his bedstead. He (Thabit) said to him (Anas b. Malik): O Abu Hamza (kunya of Anas b. Malik), your brothers from among the inhabitants of Basra ask you to narrate to them the hadith of intercession. He said: Muhammad (may peace be upon him) narrated to us: When it would be the Day of Resurrection, some of the people would rush to one another in bewilderment. They would come to Adam and say: Intercede (with your Lord) for your progeny. He would say: I am not fit to do this, but go to Ibrabim (peace be upon him) for he is the Friend of Allah. They would come to Ibrahim, but he would say: I am not fit to do this, but go to Moses, for he is Allah's Interlocutor. They would come to Moses, but he would say: I am not fit to do this, but you should go to Jesus, for he is the Spirit of Allah and His word. They would come to Jesus, and he would say, I am not fit to do this; you better go to Muhammad (may peace be upon him). They would come to me, and I would say: I am in a position to do that, I would go and ask the permission of my Lord and it would be granted to me. I would then stand before Him and would extol Him with praises which I am not able to do now, but with which Allah would inspire me, then I would fall in prostration and it would be said to me: O Muhammad, raise thy head, and say and it would be listened to; ask and it would be granted, intercede and it would be accepted. I shall say: My Lord, my people, my people It would be said: Go, and bring forth from it (Hell) him who has in his heart faith equal to the weight of a wheat grain or a barley seed. I would go and do that; then I would return to my Lord and extol Him with those praises (taught to me by Allah), then I would fall in prostration. It would be said to me: O Muhammad, raise your head, and say and it would be heard; ask and it would be granted; intercede and intercession would be accepted. So I would say: My people. my people. It would be said to me: Go and take out from it (Hell) him who has in his heart faith equal to the weight of a mustard seed. I would go and do that. I would again return to my Lord and extol Him with those praises. I would then fall in prostration. It would be said to me: O Muhammad, raisevour head: say, and you would be listened to; ask and it would be granted; intercede and intercession would be accepted. I would say: My Lord, my people, my people. It would be said to me: Go, and bring out of the Fire him who has in his heart as much faith as the smallest, smallest, smallest grain of mustard seed. I would go and do that. This is the hadith which Anas narrated to us. We went out of his (house) and when we reached the upper part of Jabban (graveyard) we said: Would that we meet Hasan and salute him and he was hiding in the house of Abu Khalifa. He (Ma'bad b. Hilal, the narrator) said: We went to him and greeted him and we said: O Abu Sa'id, we come from your brother Abu Hamza (kunya of Anas), and we have never heard a hadith like this relating to intercession, which he has narrated to us. He said: Narrate it, we narrated the hadith. He said: Narrate it (still further). We said: He did not (narrate it) before us more than this. He said: He (Anas) had narrated it to us twenty years back, when he was strong and healthy. He has in fact missed something. I cannot make out whether the old man has forgotten or he has (intentionally) avoided to narrate it to you lest you should rely (absolutely) upon it (and abandon doing good deeds). We said to him: Relate that to us, and he laughed and said: There is haste in the nature of man. I did not make mention of it to you but for the fact that I wanted to narrate that to you (and added that the Holy Prophet said): I would then return to my Lord for the fourth time and extol Him with these praises. I would then fall in prostration. It would be said to me: O Muhammad, raise your head: say and it will be listened to; ask and it will be granted; intercede and intercession would be accepted. I would say: O my Lord, permit me regarding him who professed: There is no god but Allah. He (the Lord) would say: That is not for thee or that is not what lies with thee, but by My Honour, Glory, Greatness and Might, I would certainly take him out who professed it: There is no god but Allah. He (the narrator, Ma'bad) said: I hear testimony to the fact that the hadith transmitted to us-by Hasan was heard by him from Anas b. Malik and I can see that he reported it twenty years back, when he was hale and hearty.",
      "chain": [
        "20022",
        "11612",
        "30116",
        "20022",
        "11612"
      ]
    },
    {
      "hadith_no": "549",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، أخبرنا حصين بن عبد الرحمن، قال كنت عند سعيد بن جبير فقال أيكم رأى الكوكب الذي انقض البارحة قلت أنا ‏.‏ ثم قلت أما إني لم أكن في صلاة ولكني لدغت ‏.‏ قال فماذا صنعت قلت استرقيت ‏.‏ قال فما حملك على ذلك قلت حديث حدثناه الشعبي ‏.‏ فقال وما حدثكم الشعبي قلت حدثنا عن بريدة بن حصيب الأسلمي أنه قال لا رقية إلا من عين أو حمة ‏.‏ فقال قد أحسن من انتهى إلى ما سمع ولكن حدثنا ابن عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ عرضت على الأمم فرأيت النبي ومعه الرهيط والنبي ومعه الرجل والرجلان والنبي ليس معه أحد إذ رفع لي سواد عظيم فظننت أنهم أمتي فقيل لي هذا موسى صلى الله عليه وسلم وقومه ولكن انظر إلى الأفق ‏.‏ فنظرت فإذا سواد عظيم فقيل لي انظر إلى الأفق الآخر ‏.‏ فإذا سواد عظيم فقيل لي هذه أمتك ومعهم سبعون ألفا يدخلون الجنة بغير حساب ولا عذاب ‏\"‏ ‏.‏ ثم نهض فدخل منزله فخاض الناس في أولئك الذين يدخلون الجنة بغير حساب ولا عذاب فقال بعضهم فلعلهم الذين صحبوا رسول الله صلى الله عليه وسلم ‏.‏ وقال بعضهم فلعلهم الذين ولدوا في الإسلام ولم يشركوا بالله ‏.‏ وذكروا أشياء فخرج عليهم رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما الذي تخوضون فيه ‏\"‏ ‏.‏ فأخبروه فقال ‏\"‏ هم الذين لا يرقون ولا يسترقون ولا يتطيرون وعلى ربهم يتوكلون ‏\"‏ ‏.‏ فقام عكاشة بن محصن فقال ادع الله أن يجعلني منهم ‏.‏ فقال ‏\"‏ أنت منهم ‏\"‏ ثم قام رجل آخر فقال ادع الله أن يجعلني منهم ‏.‏ فقال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
      "text_en": " Husain b. 'Abd al-Rahman reported:                      I was with Sa'id b. Jubair when he said: Who amongst you saw a star shooting last night? I said: It was I; then I said: I was in fact not (busy) in prayer, but was stung by a scorpion (and that is the reason why I was awake and had a glimpse of the shooting star). He said: Then what did you do? I said: I practised charm. He said: What urged you to do this? I said: (I did this according to the implied suggestion) of the hadith which al-Shu'ba narrated. He said: What did al-Shu'ba narrate to you? I said: Buraida b. Husaib al-Aslami narrated to us. The charm is of no avail except in case of the (evil influence) of an eye or the sting of a scorpion. He said: He who acted according to what he had heard (from the Holy Prophet) acted rightly, but Ibn 'Abbas narrated to us from the Apostle of Allah (may peace be upon him) that he said: There were brought before me the peoples and I saw an apostle and a small group (of his followers) along with him, another (apostle) and one or two persons (along with him) and (still another) apostle having no one with him. When a very large group was brought to me I conceived as if it were my Ummah. Then it was said to me: It is Moses and his people. You should look at the horizon, and I saw a very huge group. It was again said to me: See the other side of the horizon, and there was (also) a very huge group. It was said to me: This is your Ummah, and amongst them there were seventy thousand persons who would be made to enter Paradise without rendering any account and without (suffering) any torment. He then stood up and went to his house. Then the people began to talk about the people who would be admitted to Paradise without rendering any account and without (suffering) any torment. Some of them said: They may be those who (have had the good fortune of living) in the company of the Messenger of Allah (may peace be upon him) and some of them said: They be those who were born in Islam and did not associate anything with Allah. Some people mentioned other things. Thereupon came forth the Messenger of Allah (may peace be upon him) before them and he said: What was that which you were talking about? They informed him. He said: They are those persons who neither practise charm, nor ask others to practise it, nor do they take omens, and repose their trust in their Lord. Upon this 'Ukkasha b. Mihsan stood up and said: Supplicate for me that He should make me one among them. Upon this he (Messenger of Allah) said: Thou are one among them. Then another man stood up and said: Supplicate before Allah that He should make me one among them. Upon this he said: 'Ukkisha has preceded you.",
      "chain": [
        "30116",
        "20468",
        "15097",
        "11052"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، وأبو كامل الجحدري - واللفظ لسعيد - قالوا حدثنا أبو عوانة، عن سماك بن حرب، عن مصعب بن سعد، قال دخل عبد الله بن عمر على ابن عامر يعوده وهو مريض فقال ألا تدعو الله لي يا ابن عمر ‏.‏ قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏ وكنت على البصرة ‏.‏",
      "text_en": " It was narrated from Simak bin Harb, that Mus'ab bin Sa'd said:                      '\" 'Abdullah bin 'Umar came to visit Ibn 'Amir when he was sick and he said: 'Won't you supplicate to Allah for me, O Ibn 'Umar ?' He said: 'I heard the Messenger of Allah () say: \"No Salat is accepted without Wudu' (purification), and no charity (is accepted) that comes from Ghulul [1] \" and you were the governor of Al-Basrah.' \"[1] Goods pilfered from the spoils of war prior to their authorized distribution.",
      "chain": [
        "30116",
        "30367",
        "30559",
        "20469",
        "10770",
        "10556",
        "18"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا حسان بن إبراهيم، حدثنا يونس بن يزيد، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني أبو إدريس الخولاني، أنه سمع أبا هريرة، وأبا، سعيد الخدري يقولان قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " It has been transmitted by Abu Huraira and Abu Sa'id al-Khudri (both of them the reputed Companions of the Holy Prophet) that the Messenger of Allah (may peace be upon him) said like that.",
      "chain": [
        "30116",
        "20417",
        "20475",
        "30487",
        "20029",
        "20475",
        "11013",
        "11027",
        "13",
        "38"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وسعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب وابن نمير كلهم عن سفيان بن عيينة، - واللفظ ليحيى قال أخبرنا سفيان بن عيينة، - عن الزهري، عن سالم، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم إذا افتتح الصلاة رفع يديه حتى يحاذي منكبيه وقبل أن يركع وإذا رفع من الركوع ولا يرفعهما بين السجدتين ‏.‏",
      "text_en": " Salim narrated it on the authority of his father who reported:                      I saw the Messenger of Allah (may peace be upon him) raising his hands apposite the shoulders at the time of beginning the prayer and before bowing down and after coming back to the position after bowing. but he did not raise them between two prostrations.",
      "chain": [
        "30399",
        "30116",
        "20005",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "398",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، كلاهما عن أبي عوانة، قال سعيد حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن عمران بن حصين، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة الظهر - أو العصر - فقال ‏\"‏ أيكم قرأ خلفي بسبح اسم ربك الأعلى ‏\"‏ ‏.‏ فقال رجل أنا ولم أرد بها إلا الخير ‏.‏ قال ‏\"‏ قد علمت أن بعضكم خالجنيها ‏\"‏ ‏.‏",
      "text_en": " lmrin b. Husain reported:                      The Messenger of Allah (may peace beupon him) led us In Zuhr or 'Asr prayer (noon or the afternoon prayer). (On concluding it) he said: Who recited behind me (the verses): Sabbih Isma Rabbik al-a'la (Glorify the name of thy Lord, the Most High)? There upon a person said: It was I, but I in- tended nothing but goodness. I felt that some one of you was disputing with me in it (or he was taking out from my tongue what I was reciting), said the Holy Prophet (may peace be upon him).",
      "chain": [
        "30116",
        "30367",
        "20469",
        "11168",
        "20469",
        "11019",
        "11284",
        "123"
      ]
    },
    {
      "hadith_no": "404",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، وأبو كامل الجحدري ومحمد بن عبد الملك الأموي - واللفظ لأبي كامل - قالوا حدثنا أبو عوانة عن قتادة عن يونس بن جبير عن حطان بن عبد الله الرقاشي قال صليت مع أبي موسى الأشعري صلاة فلما كان عند القعدة قال رجل من القوم أقرت الصلاة بالبر والزكاة - قال - فلما قضى أبو موسى الصلاة وسلم انصرف فقال أيكم القائل كلمة كذا وكذا قال فأرم القوم ثم قال أيكم القائل كلمة كذا وكذا فأرم القوم فقال لعلك يا حطان قلتها قال ما قلتها ولقد رهبت أن تبكعني بها ‏.‏ فقال رجل من القوم أنا قلتها ولم أرد بها إلا الخير ‏.‏ فقال أبو موسى أما تعلمون كيف تقولون في صلاتكم إن رسول الله صلى الله عليه وسلم خطبنا فبين لنا سنتنا وعلمنا صلاتنا فقال ‏\"‏ إذا صليتم فأقيموا صفوفكم ثم ليؤمكم أحدكم فإذا كبر فكبروا وإذا قال غير المغضوب عليهم ولا الضالين فقولوا آمين ‏.‏ يجبكم الله فإذا كبر وركع فكبروا واركعوا فإن الإمام يركع قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك وإذا قال سمع الله لمن حمده ‏.‏ فقولوا اللهم ربنا لك الحمد ‏.‏ يسمع الله لكم فإن الله تبارك وتعالى قال على لسان نبيه صلى الله عليه وسلم سمع الله لمن حمده ‏.‏ وإذا كبر وسجد فكبروا واسجدوا فإن الإمام يسجد قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك ‏.‏ وإذا كان عند القعدة فليكن من أول قول أحدكم التحيات الطيبات الصلوات لله السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Hattan b. 'Abdullah al-Raqiishi reported:                      I observed prayer with Abu Musu al-Ash'ari and when he was in the qa'dah, one among the people said: The prayer has been made obligatory along with piety and Zakat. He (the narrator) said: When Abu Musa had finished the prayer after salutation he tuined (towards the people) and said: Who amongst you said such and such a thing? A hush fell on the people. He again said.. Who amongst you has said such and such a thing? A hush fell on the people. He (Abu Musa) said: Hattan, It is perhaps you that have uttered it. He (Hattan) said No. I have not uttered it. I was afraid that you might be annoyed with me on account of this. A person amongst the people said: It was I who said it, and In this I intended nothing but good. Abu Musa said: Don't you know what you have to recite in your prayers? Verily the Messenger of Allah (may peace be upon him) addressed us and explained to us all Its aspects and taught us how to observe prayer (properly). He (the Holy Prophet) said: When you pray make your rows straight and let anyone amongst you act as your Imim. Recite the takbir when he recites it and when be recites: Not of those with whom Thou art angry. nor of those who go astray, say: Amin. Allah would respond you. And when he (the Imim) recites the takbir, you may also recite the takbir, for the Imam bows before you and raises himself before you. Then the Messenger of Allah (may peace be upon him) said: The one is equivalent to the other. And when he says: Allah listens to him who praises Him, you should say: 0 Allah, our. Lord, to Thee be the praise, for Allah, the Exalted and Glorious, has vouchsafed (us) through the tongue of His Apostle (may peace be upon him) that Allah listens to him who praises Him. And when he (the Imim) recites the takbir and prostrates, you should also recite the takbir and prostrate, for the Imim prostrates before you and raises himself before you. The Messenger' of Allah (may peace be upon him) said: The one is equi- valent to the other. And when he (the Imim) sits for Qa'da (for tashahhud) the first words of every one amongst you should be: All services rendered by words, acts of worship and all good things are due to Allah. Peace be upon you,0 Apostle, and Allah's mercy and blessings. Peace be upon us and upon the upright servants of Allah. I testify that there is no god but Allah, and I testify that Mubammad is His servant and His Messenger.",
      "chain": [
        "30116",
        "30367",
        "30559",
        "20469",
        "11019",
        "11320",
        "10676"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان بن عيينة، أخبرني سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد، عن أبيه، عن ابن عباس، قال كشف رسول الله صلى الله عليه وسلم الستارة والناس صفوف خلف أبي بكر فقال ‏\"‏ أيها الناس إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها المسلم أو ترى له ألا وإني نهيت أن أقرأ القرآن راكعا أو ساجدا فأما الركوع فعظموا فيه الرب عز وجل وأما السجود فاجتهدوا في الدعاء فقمن أن يستجاب لكم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) drew aside the curtain (of his apartment) and (he saw) people in rows (saying prayer) behind Aba Bakr. And he said: Nothing remains of the glad tidings of apostlehood, except good visions which a Muslim sees or someone is made to see for him. And see that I have been forbidden to recite the Qur'an in the state of bowing and prostration. So far as Ruk'u is concerned, extol in it the Great and Glorious Lord, and while prostrating yourselves be earnest in supplication, for it is fitting that your supplications should be answered.",
      "chain": [
        "30116",
        "20005",
        "11855",
        "17"
      ]
    },
    {
      "hadith_no": "1599",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه يحيى بن يحيى، وسعيد بن منصور، وقتيبة بن سعيد، جميعا عن أبي عوانة، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم ولم يذكر ‏\"‏ لا كفارة لها إلا ذلك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Qatada, but here no mention has been made of\" There is no explation for it except this.\"",
      "chain": [
        "30399",
        "30116",
        "30367",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وقتيبة بن سعيد، قال يحيى أخبرنا وقال الآخرون، حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Allah has prescribed the prayer through the word of your Prophet (may peace be upon him) as four rak'ahs when resident, two when travelling, and one when danger is present.",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30367",
        "20031",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1614",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان، حدثنا محمد بن المنكدر، وإبراهيم بن ميسرة، سمعا أنس بن مالك، يقول صليت مع رسول الله صلى الله عليه وسلم الظهر بالمدينة أربعا وصليت معه العصر بذي الحليفة ركعتين ‏.‏",
      "text_en": " Anas b. Malik is reported to have said:                      I observed four rak'ahs in the noon prayer with the Messenger of Allah (may peace be upon him) at Medina, and said two rak'ahs in the afternoon prayer at Dhu'l-Hulaifa.",
      "chain": [
        "30116",
        "20005",
        "11048",
        "11240",
        "19"
      ]
    },
    {
      "hadith_no": "1777",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، جميعا عن أبي عوانة، قال سعيد حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا فاتته الصلاة من الليل من وجع أو غيره صلى من النهار ثنتى عشرة ركعة ‏.‏",
      "text_en": " 'A'isha reported that when the Messenger of Allah (may peace be upon him) decided upon doing any act, he continued to do it, and when he slept at night or fell sick he observed twelve rak'ahs during the daytime. I am not aware of Allah's Messenger (may peace be upon him) observing prayer during the whole of the night till morning, or observing fast for a whole month continuously except that of Ramadan.",
      "chain": [
        "30116",
        "30367",
        "20469",
        "11168",
        "20469",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "hadith_no": "2459",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني يحيى بن يحيى، وسعيد بن منصور، وقتيبة بن سعيد، كلهم عن أبي عوانة، - قال يحيى أخبرنا أبو عوانة، - عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يهرم ابن آدم وتشب منه اثنتان الحرص على المال والحرص على العمر ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      The son of Adam grows old, but two (desires) in him remain young: desire for wealth and desire for life.",
      "chain": [
        "30399",
        "30116",
        "30367",
        "20469",
        "11449",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2462",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وقتيبة بن سعيد، قال يحيى أخبرنا وقال الآخران، حدثنا أبو عوانة، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان لابن آدم واديان من مال لابتغى واديا ثالثا ولا يملأ جوف ابن آدم إلا التراب ويتوب الله على من تاب ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      If the son of Adam were to possess two valleys of riches. he would long for the third one. And the stomach of the son of Adam is not filled but with dust. And Allah returns to him who repents.",
      "chain": [
        "30399",
        "30116",
        "30367",
        "20031",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2889",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وخلف بن هشام، وقتيبة، بن سعيد قال يحيى أخبرنا وقال الآخرون، حدثنا حماد بن زيد، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت كأني أنظر إلى وبيص الطيب في مفرق رسول الله صلى الله عليه وسلم وهو محرم ‏.‏ ولم يقل خلف وهو محرم ‏.‏ ولكنه قال وذاك طيب إحرامه ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I still seem to see the glisten- ing of the perfume where the hair parted on Allah's Messenger's (may peace be upon him) head as he was in the state of Ihram, and Khalaf (one of the narrators) did not say: As he was in the state of Ihram, but said: That was the perfume of Ihram.",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30503",
        "30367",
        "20031",
        "20022",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2899",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وأبو كامل جميعا عن أبي عوانة، - قال سعيد حدثنا أبو عوانة، - عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت عبد الله بن عمر - رضى الله عنهما - عن الرجل، يتطيب ثم يصبح محرما فقال ما أحب أن أصبح محرما أنضخ طيبا لأن أطلي بقطران أحب إلى من أن أفعل ذلك ‏.‏ فدخلت على عائشة - رضى الله عنها - فأخبرتها أن ابن عمر قال ما أحب أن أصبح محرما أنضخ طيبا لأن أطلي بقطران أحب إلى من أن أفعل ذلك ‏.‏ فقالت عائشة أنا طيبت رسول الله صلى الله عليه وسلم عند إحرامه ثم طاف في نسائه ثم أصبح محرما ‏.‏",
      "text_en": " Muhammad b. al-Muntashir reported on the authority of his father:                      I asked 'Abdullah b. 'Umar (Allah be pleased with them) about a person who applied perfume and then (on the following) morning entered upon the state of lhram. There- upon he said: I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing this (i. e. the applying of perfume), I went to 'A'isha (Allah be pleased with her) and told her that Ibn 'Umar stated:\" I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing it (the applying of perfume).\" Thereupon 'A'isha said: I applied perfume to the Messenger of Allah (may peace be upon him) at the time of his entering upon the state of Ihram. He then went round his wives and then put on Ihram in the morning.",
      "chain": [
        "30116",
        "20469",
        "11168",
        "20469",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "hadith_no": "3024",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وأبو كريب قالوا حدثنا أبو معاوية عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، - رضى الله عنه - قال كانت المتعة في الحج لأصحاب محمد صلى الله عليه وسلم خاصة ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said that Tamattu' in Hajj was a special (concession) only for the Companions of Muhammad (may peace be upon him).",
      "chain": [
        "30116",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "hadith_no": "3028",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وابن أبي عمر، جميعا عن الفزاري، - قال سعيد حدثنا مروان بن معاوية، - أخبرنا سليمان التيمي، عن غنيم بن قيس، قال سألت سعد بن أبي وقاص - رضى الله عنه - عن المتعة، فقال فعلناها وهذا يومئذ كافر بالعرش ‏.‏ يعني بيوت مكة ‏.‏",
      "text_en": " Ghunaim b. Qais said:                      I asked Sa'd b. Abu Waqqas (Allah be pleased with him) about Mut'a, whereupon he said: We did that, and it was the day when he was an unbeliever living in (one of the) houses of Mecca.",
      "chain": [
        "30116",
        "30421",
        "20405",
        "11168",
        "20201",
        "11289",
        "10710",
        "9"
      ]
    },
    {
      "hadith_no": "3089",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وعمرو الناقد، وزهير بن حرب، جميعا عن ابن عيينة، - قال سعيد حدثنا سفيان بن عيينة، - حدثني الزهري، عن حنظلة الأسلمي، قال سمعت أبا هريرة، - رضى الله عنه - يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده ليهلن ابن مريم بفج الروحاء حاجا أو معتمرا أو ليثنينهما ‏\"‏ ‏.‏ وحدثناه قتيبة بن سعيد، حدثنا ليث، عن ابن شهاب، بهذا الإسناد ‏.‏ مثله قال ‏\"‏ والذي نفس محمد بيده ‏\"‏ ‏.‏",
      "text_en": " Hanzala al-Aslami reported:                      I heard Abu Huraira (Allah be pleased with him) as narrating from Allah's Apostle (may peace be upon him) who said: By Him in Whose Hand is my life. Ibn Maryam (Jesus Christ) would certainly pronounce Talbiya for Hajj or for Umra or for both (simultaneously as a Qiran) In the valley of Rauha",
      "chain": [
        "30116",
        "30263",
        "30022",
        "20005",
        "11168",
        "20005",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "3258",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، وزهير بن حرب، قالا حدثنا سفيان، عن الزهري، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم ح. وحدثنا سعيد بن منصور، وخلف بن هشام، وقتيبة بن سعيد، قالوا أخبرنا حماد، بن زيد عن هشام بن عروة، عن أبيه، عن عائشة، قالت كأني أنظر إلى أفتل قلائد هدى رسول الله صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " 'A'isha narrated (in another badith narrated through another chain of transmitters) these words:                     \" As if I am seeing myself weaving the garlands for the sacrificial animals of Allah's Messenger (may peace be upon him).\"",
      "chain": [
        "30116",
        "30022",
        "20005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3260",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال سمعت عائشة، تقول كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم بيدى هاتين ثم لا يعتزل شيئا ولا يتركه.",
      "text_en": " Abd al-Rahman b. al-Qasim reported on the authority of his father that he heard 'A'isha (Allah be pleased with her) saying:                      I used to weave garlands for the sacrificial animals of Allah's Messenger (may peace be upon him) with these hands of mine, but he (Allah's Apostle) neither avoided anything nor gave up anything (which a Muhrim should avoid or give up).",
      "chain": [
        "30116",
        "20005",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الشعبي، عن مسروق، قال سمعت عائشة، وهى من وراء الحجاب تصفق وتقول كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم بيدى ثم يبعث بها وما يمسك عن شىء مما يمسك عنه المحرم حتى ينحر هديه.",
      "text_en": " Masruq reported:                      I heard 'A'isha (Allah be pleased with her) clapping her hands behind the curtain and saying: I used to weave garlands for the sacrificial animals of Allah's Messenger (may peace be upon him) with my own hands, and then he (the Holy Prophet) sent them (to Mecca), and he did not avoid doing anything which a Muhritn avoids until his animal was sacrificed.",
      "chain": [
        "30116",
        "20468",
        "11418",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "3283",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وزهير بن حرب، قالا حدثنا سفيان، عن سليمان الأحول، عن طاوس، عن ابن عباس، قال كان الناس ينصرفون في كل وجه فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينفرن أحد حتى يكون آخر عهده بالبيت ‏\"‏ ‏.‏ قال زهير ينصرفون كل وجه ‏.‏ ولم يقل في ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that the people used to return through every path, whereupon Allah's Messenger (way peace be upon him) said:                      None amongst you should depart until he performs the last circumambulation round the House. Zuhair said (the words are): [ARABIC: YANSWARIFUWN KULLA WAJH] and the word [arabic: FIY] was not mentioned.",
      "chain": [
        "30116",
        "30022",
        "20005",
        "11247",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3284",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة - واللفظ لسعيد - قالا حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال أمر الناس أن يكون، آخر عهدهم بالبيت إلا أنه خفف عن المرأة الحائض ‏.‏",
      "text_en": " Ibn Abbas reported:                      The people were commanded (by the Holy Prophet) to perform the last circumambulation round the House, but menstruating women were exempted.",
      "chain": [
        "30116",
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو الأحوص، حدثنا أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت فلم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏ ‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذلك قومك ليدخلوا من شاءوا ويمنعوا من شاءوا ولولا أن قومك حديث عهدهم في الجاهلية فأخاف أن تنكر قلوبهم لنظرت أن أدخل الجدر في البيت وأن ألزق بابه بالأرض ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I asked Allah's Messenger (may peace be upon him) about the wall, circumpassing the House (i. e. whether the wall on the side of Hijr was included in the Ka'ba). He said, Yes. I said: Then why did they not include it in the House? He said: 'Your people ran short of the means (to do so). I said: Why is it that the level of its door is raised high? He said: Your people did it so that they should admit one whom they liked, and forbid him whom they disliked, and if your people were not new converts to faith, and I did not apprehend that their hearts would feel agitated at this. I would have definitely included (the area of) this wall-in the House and would have brought the door to the level of the ground.",
      "chain": [
        "30116",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3356",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب قالوا حدثنا سفيان بن عيينة، ح وحدثني محمد بن عبد الملك الأموي، حدثنا عبد، العزيز بن المختار عن سهيل، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، ح وحدثنا أبو كريب، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، جميعا عن سفيان، كل هؤلاء عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏بمثل حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30116",
        "20005",
        "20252",
        "30212",
        "20331",
        "11201",
        "30216",
        "20032",
        "30170"
      ]
    },
    {
      "hadith_no": "3358",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، عن أبي عوانة، وأبي الأحوص، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا وكيع، عن مسعر، وسفيان، ح وحدثنا ابن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كل هؤلاء عن منصور، بهذا الإسناد وفي حديثهم جميعا ‏\"‏ من حج فلم يرفث ولم يفسق ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mainsur with the same chain of transmitters (and the words are):                     \" He who performed Pilgrimage but neither spoke indecently nor acted wickedly.\"",
      "chain": [
        "30116",
        "20469",
        "20327",
        "30201",
        "20032",
        "20359",
        "20005",
        "20173"
      ]
    },
    {
      "hadith_no": "3359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، عن سيار، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "chain": [
        "30116",
        "20468",
        "11429",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - عن عمرو بن أبي عمرو، عن أنس بن مالك، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أنه قال ‏\"‏ إني أحرم ما بين لابتيها ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported a hadith like this from Allah's Apostle (may peace be upon him) except with this variation that he said:                     \" I declare sacred the area between its two lava mountains.\"",
      "chain": [
        "30116",
        "30367",
        "20185",
        "11209",
        "19"
      ]
    },
    {
      "hadith_no": "3541",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا مالك، ح وحدثنا يحيى، بن يحيى - واللفظ له - قال قلت لمالك حدثك عبد الله بن الفضل، عن نافع بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الأيم أحق بنفسها من وليها والبكر تستأذن في نفسها وإذنها صماتها ‏\"‏ ‏.‏ قال نعم ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A woman without a husband has more right to her person than her guardian, and a virgin's consent must be asked from her, and her silence implies her consent.",
      "chain": [
        "30116",
        "30367",
        "20001",
        "30399",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "3687",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد قالوا حدثنا سفيان، بن عيينة ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، بهذا الإسناد نحوه ‏.‏ غير أن معمرا وابن عيينة في حديثهما ‏\"‏ الولد للفراش ‏\"‏ ‏.‏ ولم يذكرا ‏\"‏ وللعاهر الحجر ‏\"‏ ‏.‏",
      "text_en": " A hadith like this is narrated on the authority of Ibn 'Uyaiyna and Ma'mar (and the words are):                      The child is attributed to him on whose bed he is born; but they did not mention this:\" For a fornicator there is stoning.\"",
      "chain": [
        "30116",
        "20005",
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "3689",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا سعيد بن منصور، وزهير بن حرب، وعبد الأعلى بن حماد، وعمرو الناقد، قالوا حدثنا سفيان، عن الزهري، أما ابن منصور فقال عن سعيد، عن أبي هريرة، وأما، عبد الأعلى فقال عن أبي سلمة، أو عن سعيد، عن أبي هريرة، وقال، زهير عن سعيد، أو عن أبي سلمة، أحدهما أو كلاهما عن أبي هريرة، وقال، عمرو حدثنا سفيان، مرة عن الزهري، عن سعيد، وأبي، سلمة ومرة عن سعيد، أو أبي سلمة ومرة عن سعيد، عن أبي، هريرة عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث معمر ‏.‏",
      "text_en": " A hadith like this is narrated on the authority of Abu Huraira.",
      "chain": [
        "30116",
        "30022",
        "30146",
        "30263",
        "20005",
        "11168",
        "13",
        "11168",
        "13",
        "20321"
      ]
    },
    {
      "hadith_no": "3825",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا مالك، ح وحدثنا يحيى، بن يحيى - واللفظ له - قال قلت لمالك حدثك نافع، عن ابن عمر، أن رجلا، لاعن امرأته على عهد رسول الله صلى الله عليه وسلم ففرق رسول الله صلى الله عليه وسلم بينهما وألحق الولد بأمه قال نعم ‏.‏",
      "text_en": " Nafi' reported on the authority of Ibn Umar (Allah be pleased with them) that a person invoked curse on the wife during the lifetime of Allah s Messenger (may peace be upon him), so he effected separation between them and traced the lineage of the son to his mother.",
      "chain": [
        "30116",
        "30367",
        "20001",
        "30399",
        "18"
      ]
    },
    {
      "hadith_no": "4012",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو بكر بن شيبة وعمرو الناقد وزهير بن حرب قالوا حدثنا سفيان بن عيينة، عن حميد الأعرج، عن سليمان بن عتيق، عن جابر، قال نهى النبي صلى الله عليه وسلم عن بيع السنين ‏.‏ وفي رواية ابن أبي شيبة عن بيع الثمر سنين ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) forbidding selling of (produce) in advance for two years, and in the narmtion of Ibu Abd Shaiba (the words are):                     \" Selling of the fruits (on the tree) in advance for two years.\"",
      "chain": [
        "30116",
        "20005",
        "11856",
        "34"
      ]
    },
    {
      "hadith_no": "4319",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة وعمرو الناقد - واللفظ لسعيد - قالوا حدثنا سفيان، عن سليمان الأحول، عن سعيد بن جبير، قال قال ابن عباس يوم الخميس وما يوم الخميس ثم بكى حتى بل دمعه الحصى ‏.‏ فقلت يا ابن عباس وما يوم الخميس قال اشتد برسول الله صلى الله عليه وسلم وجعه ‏.‏ فقال ‏\"‏ ائتوني أكتب لكم كتابا لا تضلوا بعدي ‏\"‏ ‏.‏ فتنازعوا وما ينبغي عند نبي تنازع ‏.‏ وقالوا ما شأنه أهجر استفهموه ‏.‏ قال ‏\"‏ دعوني فالذي أنا فيه خير أوصيكم بثلاث أخرجوا المشركين من جزيرة العرب وأجيزوا الوفد بنحو ما كنت أجيزهم ‏\"‏ ‏.‏ قال وسكت عن الثالثة أو قالها فأنسيتها ‏.‏",
      "text_en": " Sa'id b. Jubair reported that Ibn 'Abbas said:                      Thursday, (and then said): What is this Thursday? He then wept so much that his tears moistened the pebbles. I said: Ibn 'Abbas, what is (significant) about Thursday? He (Ibn 'Abbas) said: The illness of Allah's Messenger (may peace be upon him) took a serious turn (on this day), and he said: Come to me, so that I should write for you a document that you may not go astray after me. They (the Companions around him) disputed, and it is not meet to dispute in the presence of the Apostle. They said: How is lie (Allah's Apostle)? Has he lost his consciousness? Try to learn from him (this point). He (the Holy Prophet) said: Leave me. I am better in the state (than the one in which you are engaged). I make a will about three things: Turn out the polytheists from the territory of Arabia; show hospitality to the (foreign) delegations as I used to show them hospitality. He (the narrator) said: He (Ibn Abbas) kept silent on the third point, or he (the narrator) said: But I forgot that.",
      "chain": [
        "30116",
        "30367",
        "20005",
        "11247",
        "11050"
      ]
    },
    {
      "hadith_no": "4641",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله، عن إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب سريع الحساب اهزم الأحزاب اللهم اهزمهم وزلزلهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abu Aufa that the Messenger of Allah (may peace be upon him) cursed the tribes (who had marched upon Medina with a combined force in 5 H) and said:                      O Allah, Revealer of the Book, swift in (taking) account, put the tribes to rout. O Lord, defeat them and shake them.",
      "chain": [
        "30116",
        "20423",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "4647",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وعمرو الناقد، جميعا عن ابن عيينة، قال يحيى أخبرنا سفيان بن عيينة، عن الزهري، عن عبيد الله، عن ابن عباس، عن الصعب، بن جثامة قال سئل النبي صلى الله عليه وسلم عن الذراري من المشركين يبيتون فيصيبون من نسائهم وذراريهم ‏.‏ فقال ‏\"‏ هم منهم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Sa'b b. Jaththama that the Prophet of Allah (may peace be upon him), when asked about the women and children of the polytheists being killed during the night raid, said:                      They are from them.",
      "chain": [
        "30399",
        "30116",
        "20005",
        "11449",
        "20005",
        "11013",
        "11201",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "4651",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن منصور، وهناد بن السري، قالا حدثنا ابن المبارك، عن موسى، بن عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قطع نخل بني النضير وحرق ولها يقول حسان وهان على سراة بني لؤى حريق بالبويرة مستطير وفي ذلك نزلت ‏{‏ ما قطعتم من لينة أو تركتموها قائمة على أصولها‏}‏ الآية ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Umar that the Messenger of Allah (may peace be upon him) caused the date-palms of Banu Nadir to be cut down and burnt. It is in this connection that Hassan (the poet) said:                      It was easy for the nobles of Quraish to burn Buwaira whose sparks were flying in all directions, in the same connection was revealed the Qur'anic verse:\" Whatever trees you have cut down or left standing on their trunks.\"",
      "chain": [
        "30116",
        "30480",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4860",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، وقتيبة بن سعيد، كلاهما عن يعقوب، قال سعيد حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن أبي صالح السمان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عليك السمع والطاعة في عسرك ويسرك ومنشطك ومكرهك وأثرة عليك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      It is obligatory for you to listen to the ruler and obey him in adversity and prosperity, in pleasure and displeasure, and even when another person is given (rather undue) preference over you.",
      "chain": [
        "30116",
        "30367",
        "20184",
        "11168",
        "20185",
        "11172",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4977",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله الواسطي، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، قال قيل للنبي صلى الله عليه وسلم ما يعدل الجهاد في سبيل الله عز وجل قال ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ قال فأعادوا عليه مرتين أو ثلاثا كل ذلك يقول ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ وقال في الثالثة ‏\"‏ مثل المجاهد في سبيل الله كمثل الصائم القائم القانت بآيات الله لا يفتر من صيام ولا صلاة حتى يرجع المجاهد في سبيل الله تعالى ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira who said:                      The Messenger of Allah (may peace be upon him) was asked: What deed could be an equivalent of Jihad in the way of Allah, the Almighty and Exalted? He answered: You do not have the strength to do that deed. The narrator said: They repeated the question twice or thrice. Every time he answered: You do not have the strength to do it. When the question was asked for the third time, he said: One who goes out for Jibad is like a person who keeps fasts, stands in prayer (constantly), (obeying) Allah's (behests contained in) the verses (of the Qur'an), and does not exhibit any lassitude in fasting and prayer until the Mujihid returns from Jihad in the way of Allah, the Exalted.",
      "chain": [
        "30116",
        "20423",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4987",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، حدثني أبو هانئ الخولاني، عن أبي عبد الرحمن الحبلي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا أبا سعيد من رضي بالله ربا وبالإسلام دينا وبمحمد نبيا وجبت له الجنة ‏\"‏ ‏.‏ فعجب لها أبو سعيد فقال أعدها على يا رسول الله ففعل ثم قال ‏\"‏ وأخرى يرفع بها العبد مائة درجة في الجنة ما بين كل درجتين كما بين السماء والأرض ‏\"‏ ‏.‏ قال وما هي يا رسول الله قال ‏\"‏ الجهاد في سبيل الله الجهاد في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Sa'id Khudri that the Messenger of Allah (may peace be upon him) said (to him):                      Abu Sa'id, whoever cheerfully accepts Allah as his Lord, Islam as his religion and Mubammad as his Apostle is necessarily entitled to enter Paradise. He (Abu Sa'id) wondered at it and said: Messenger of Allah, repeat it for me. He (the Messenger of Allah) did that and said: There is another act which elevates the position of a man in Paradise to a grade one hundred (higher), and the elevation between one grade and the other is equal to the height of the heaven from the earth. He (Abu Sa'id) said: What is that act? He replied: Jihad in the way of Allah! Jihad in the way of Allah!",
      "chain": [
        "30116",
        "20029",
        "10856",
        "10938",
        "38"
      ]
    },
    {
      "hadith_no": "4990",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، عن عمرو بن دينار، عن محمد بن قيس، ح قال وحدثنا محمد بن عجلان، عن محمد بن قيس، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم يزيد أحدهما على صاحبه أن رجلا أتى النبي صلى الله عليه وسلم وهو على المنبر فقال أرأيت إن ضربت بسيفي ‏.‏ بمعنى حديث المقبري ‏.‏",
      "text_en": " Another version of the tradition differently transmitted begins with the words:                     \" A man came to the Messenger of Allah (may peace be upon him) and he was sitting on the pulpit.... He said: What do you find if I strike with the sword?\" (The rest of the tradition is the same as the previous one.)",
      "chain": [
        "30116",
        "20005",
        "11081",
        "10616",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5011",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو الطاهر، قال أبو الطاهر أخبرنا ابن وهب، وقال، سعيد حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر، بن سعيد عن زيد بن خالد الجهني، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Zaid b. Khalid al-Juhani that the Messenger of Allah (may peace be upon him) said:                      Anybody who equips a warrior (going to fight) in the way of Allah (is like one who actually) fights. And anybody who looks well after his family in his absence (is also like one who actually) fights.",
      "chain": [
        "30116",
        "20029",
        "11168",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "5016",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، عن يزيد بن أبي سعيد، مولى المهري عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث إلى بني لحيان ‏\"‏ ليخرج من كل رجلين رجل ‏\"‏ ‏.‏ ثم قال للقاعد ‏\"‏ أيكم خلف الخارج في أهله وماله بخير كان له مثل نصف أجر الخارج ‏\"‏ ‏.‏",
      "text_en": " It has been narrated (through a still different chain of transmitters) on the authority of Abu Sa'id Khudrl that the Messenger of Allah (may peace be upon him) despatched a force to Banu Lihyan. (and said:                      ) One man from every two should join the force. Then he said to those who stayed behind: Those of you who will look well after the family and wealth of those who are going on the expedition will be getting half the reward of the warriors.",
      "chain": [
        "30116",
        "20029",
        "20377",
        "11411",
        "38"
      ]
    },
    {
      "hadith_no": "5019",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه سعيد بن منصور، حدثنا سفيان، عن قعنب، عن علقمة بن مرثد، بهذا الإسناد ‏\"‏ فقال فخذ من حسناته ما شئت ‏\"‏ ‏.‏ فالتفت إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " A version of the tradition narrated on the authority of 'Alqama b. Murthad has a differently worded end:                      It will be said to the Mujahid: Take from his noble deeds whatever you like. Then the Messenger of Allah (may peace be upon him) turned to us and asked: What do you think (will he leave anything)? - (i. e. he will take away everything).",
      "chain": [
        "30116",
        "20005",
        "10813",
        "11374"
      ]
    },
    {
      "hadith_no": "5059",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع العتكي، وقتيبة بن سعيد، قالوا حدثنا حماد، - وهو ابن زيد - عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي ظاهرين على الحق لا يضرهم من خذلهم حتى يأتي أمر الله وهم كذلك ‏\"‏ ‏.‏ وليس في حديث قتيبة ‏\"‏ وهم كذلك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Thauban that the Messenger of Allah (may peace be upon him) said:                      A group of people from my Umma will always remain triumphant on the right path and continue to be triumphant (against their opponents). He who deserts them shall not be able to do them any harm. They will remain in this position until Allah's Command is executed (i.e. Qiyamah is established). In Qutaiba's version of the tradition, we do not have the words:\" They will remain in this position.\"",
      "chain": [
        "30116",
        "30367",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "5331",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب كلهم عن ابن عيينة، ح وحدثنا حسن الحلواني، وعبد بن حميد، عن يعقوب، بن إبراهيم بن سعد حدثنا أبي، عن صالح، ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، كلهم عن الزهري، بهذا الإسناد وليس في حديث سفيان وصالح سئل عن البتع وهو في حديث معمر وفي حديث صالح أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل شراب مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of Zuhri with this chain of transmitters but in the hadith transmitted on the authority of Sufyan and Salih (these words are not found)\" she was asked about Bit\". (These words are found in the hadith) transmitted on the authority of Ma'mar and in the hadith transmitted on the authority of Salih (only these words are found) that she (Hadrat 'A'isha) had heard Allah's Messenger (may peace be upon him) say:                      Every intoxicating drink is forbidden.",
      "chain": [
        "30399",
        "30116",
        "20005",
        "130115",
        "30553",
        "20184",
        "20150",
        "11176",
        "30123",
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "6146",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وسعيد بن منصور، وأبو الربيع العتكي، وأبو كامل - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا - حماد بن زيد، عن ثابت، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس وكان أجود الناس وكان أشجع الناس ولقد فزع أهل المدينة ذات ليلة فانطلق ناس قبل الصوت فتلقاهم رسول الله صلى الله عليه وسلم راجعا وقد سبقهم إلى الصوت وهو على فرس لأبي طلحة عرى في عنقه السيف وهو يقول ‏\"‏ لم تراعوا لم تراعوا ‏\"‏ ‏.‏ قال ‏\"‏ وجدناه بحرا أو إنه لبحر ‏\"‏ ‏.‏ قال وكان فرسا يبطأ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) was the sublimest among people (in character) and the most generous amongst them and he was the bravest of men. One night the people of Medina felt disturbed and set forth in the direction of a sound when Allah's Messenger (may peace be upon him) met them on his way back as he had gone towards that sound ahead of them. He was on the horse of Abu Talha which had no saddle over it, and a sword was slung round his neck, and he was saying:                      There was nothing to be afraid of, and he also said: We found it (this horse) like a torrent of water (indicating its swift-footedness), whereas the horse had been slow before that time.",
      "chain": [
        "30399",
        "30116",
        "20031",
        "20022",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 118
}