{
  "id": "30119",
  "name": "Yahya bin Qz'h يحيى بن قزعة",
  "full_name": "Yahya bin Qz'h يحيى بن قزعة",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ خ  -  مقبول ]"
    ],
    "tags": [
      "Quraish",
      "al-Makki"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Maqbool] [ خ  -  مقبول ]",
        "ar": "Narrator[Grade:Maqbool] [ خ  -  مقبول ]",
        "ckb": "Narrator[Grade:Maqbool] [ خ  -  مقبول ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    ],
    "tags_display": [
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "al-Makki",
        "ar": "al-Makki",
        "ckb": "al-Makki"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "22220",
      "name": "Naf' bin 'Abdur Rahman نافع بن عبد الرحمن بن أبي نعيم",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "22113",
      "name": "'Abdul Hameed bin Sulaiman عبد الحميد بن سليمان الخزاعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20702",
      "name": "'Abdur Rahman bin Abi Rajal عبد الرحمن بن أبي الرجال بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30226",
      "name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30308",
      "name": "Ibrahim bin al-Mandhir bin 'Abdullah إبراهيم بن المنذر بن عبد الله",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "38588",
      "name": "Muhammad bin Muslim bin al-Wara محمد بن مسلم بن عثمان - بن وارة",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "39615",
      "name": "'Abdullah bin Ahmed bin Zakaria عبد الله بن أحمد بن زكريا",
      "grade": "3rd Century AH",
      "grade_display": {
        "en": "3rd Century AH",
        "ar": "القرن الثالث الهجري",
        "ckb": "سەدەی سێیەمی كۆچی"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-870",
      "hadith_no": "870",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن قزعة، قال حدثنا إبراهيم بن سعد، عن الزهري، عن هند بنت الحارث، عن أم سلمة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، ويمكث هو في مقامه يسيرا قبل أن يقوم‏.‏ قال نرى  والله أعلم  أن ذلك كان لكى ينصرف النساء قبل أن يدركهن أحد من الرجال‏.‏",
      "text_en": " Narrated Um Salama:                     Whenever Allah's Apostle completed the prayer with Taslim, the women used to get up immediately and Allah's Apostle would remain at his place for someone before getting up. (The sub-narrator (Az- Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before men could get in touch with them).",
      "usc_msa_ref": "",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11734",
        "56"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-875",
      "hadith_no": "875",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن الزهري، عن هند بنت الحارث، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، وهو يمكث في مقامه يسيرا قبل أن يقوم‏.‏ قالت نرى  والله أعلم  أن ذلك كان لكى ينصرف النساء قبل أن يدركهن الرجال‏.‏",
      "text_en": " Narrated Umm Salama:                      Whenever Allah's Messenger () completed the Salat with Taslim, the women used to get up immediately and Allah's Messenger ()  would remain at his place for sometime before getting up. The subnarrator (Az-Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before the men could catch up with them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11734",
        "56"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2053",
      "hadith_no": "2053",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة  رضى الله عنها  قالت كان عتبة بن أبي وقاص عهد إلى أخيه سعد بن أبي وقاص أن ابن وليدة زمعة مني فاقبضه‏.‏ قالت فلما كان عام الفتح أخذه سعد بن أبي وقاص وقال ابن أخي، قد عهد إلى فيه‏.‏ فقام عبد بن زمعة، فقال أخي، وابن وليدة أبي، ولد على فراشه‏.‏ فتساوقا إلى النبي صلى الله عليه وسلم‏.‏ فقال سعد يا رسول الله، ابن أخي، كان قد عهد إلى فيه‏.‏ فقال عبد بن زمعة أخي وابن وليدة أبي، ولد على فراشه‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو لك يا عبد بن زمعة ‏\"‏‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ الولد للفراش، وللعاهر الحجر ‏\"‏‏.‏ ثم قال لسودة بنت زمعة زوج النبي صلى الله عليه وسلم ‏\"‏ احتجبي منه ‏\"‏‏.‏ لما رأى من شبهه بعتبة، فما رآها حتى لقي الله‏.‏",
      "text_en": " Narrated Aisha:                     `Utba bin Abu Waqqas took a firm promise from his brother Sa`d bin Abu Waqqas to take the son of the slave-girl of Zam`a into his custody as he was his (i.e. `Utba's) son. In the year of the Conquest (of Mecca) Sa`d bin Abu Waqqas took him, and said that he was his brother's son, and his brother took a promise from him to that effect. 'Abu bin Zam`a got up and said, \"He is my brother and the son of the slave-girl of my father and was born on my father's bed.\" Then they both went to the Prophet Sa`d said, \"O Allah's Apostle! He is the son of my brother and he has taken a promise from me that I will take him.\" 'Abu bin Zam`a said, \"(He is) my brother and the son of my father's slave-girl and was born on my father's bed.\" Allah's Apostle said, \"The boy is for you. O 'Abu bin Zam`a.\" Then the Prophet said, \"The son is for the bed (i.e. the man on whose bed he was born) and stones (disappointment and deprivation) for the one who has done illegal sexual intercourse.\" The Prophet told his wife Sauda bint Zam`a to screen herself from that boy as he noticed a similarity between the boy and `Utba. So, the boy did not see her till he died.",
      "usc_msa_ref": "269",
      "chain": [
        "30119",
        "20001",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2382",
      "hadith_no": "2382",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا يحيى بن قزعة، أخبرنا مالك، عن داود بن حصين، عن أبي سفيان، مولى أبي أحمد عن أبي هريرة  رضى الله عنه  قال رخص النبي صلى الله عليه وسلم في بيع العرايا بخرصها من التمر فيما دون خمسة أوسق أو في خمسة أوسق، شك داود في ذلك‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet allowed the sale of the dates of the 'Araya for ready dates by estimating the former which should be estimated as less than five Awsuq or five Awsuq. (Dawud, the sub-narrator is not sure as to the right amount.)",
      "usc_msa_ref": "568",
      "chain": [
        "30119",
        "20001",
        "11160",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2411",
      "hadith_no": "2411",
      "source": "Sahih Bukhari",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن أبي سلمة، وعبد الرحمن الأعرج، عن أبي هريرة  رضى الله عنه  قال استب رجلان رجل من المسلمين ورجل من اليهود، قال المسلم والذي اصطفى محمدا على العالمين، فقال اليهودي والذي اصطفى موسى على العالمين‏.‏ فرفع المسلم يده عند ذلك فلطم وجه اليهودي، فذهب اليهودي إلى النبي صلى الله عليه وسلم فأخبره بما كان من أمره وأمر المسلم، فدعا النبي صلى الله عليه وسلم المسلم فسأله عن ذلك، فأخبره فقال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروني على موسى، فإن الناس يصعقون يوم القيامة، فأصعق معهم، فأكون أول من يفيق، فإذا موسى باطش جانب العرش، فلا أدري أكان فيمن صعق فأفاق قبلي، أو كان ممن استثنى الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Two persons, a Muslim and a Jew, quarreled. The Muslim said, \"By Him Who gave Muhammad superiority over all the people! The Jew said, \"By Him Who gave Moses superiority over all the people!\" At that the Muslim raised his hand and slapped the Jew on the face. The Jew went to the Prophet and informed him of what had happened between him and the Muslim. The Prophet sent for the Muslim and asked him about it. The Muslim informed him of the event. The Prophet said, \"Do not give me superiority over Moses, for on the Day of Resurrection all the people will fall unconscious and I will be one of them, but I will. be the first to gain consciousness, and will see Moses standing and holding the side of the Throne (of Allah). I will not know whether (Moses) has also fallen unconscious and got up before me, or Allah has exempted him from that stroke.\"",
      "usc_msa_ref": "",
      "chain": [
        "30119",
        "20150",
        "11013",
        "10567",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2602",
      "hadith_no": "2602",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  أن النبي صلى الله عليه وسلم أتي بشراب فشرب، وعن يمينه غلام وعن يساره الأشياخ فقال للغلام ‏\"‏ إن أذنت لي أعطيت هؤلاء ‏\"‏‏.‏ فقال ما كنت لأوثر بنصيبي منك يا رسول الله أحدا‏.‏ فتله في يده‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A drink (milk mixed with water) was brought to the Prophet who drank some of it while a boy was sitting on his right and old men on his left. The Prophet said to the boy, \"If you permit me, I'll give (the rest of the drink to) these old men first.\" The boy said, \"I will not give preference to any one over me as regards my share from you, O Allah's Apostle!\" The Prophet then put that container in the boy's hand. (See Hadith No. 541).",
      "usc_msa_ref": "774",
      "chain": [
        "30119",
        "20001",
        "11172",
        "399"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2623",
      "hadith_no": "2623",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن زيد بن أسلم، عن أبيه، سمعت عمر بن الخطاب  رضى الله عنه  يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه منه، وظننت أنه بائعه برخص، فسألت عن ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتره، وإن أعطاكه بدرهم واحد، فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to buy it from him, thinking that he would sell it cheap. When I asked the Prophet he said, \"Don't buy it, even if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is like a dog that swallows back its vomit.\"",
      "usc_msa_ref": "792",
      "chain": [
        "30119",
        "20001",
        "11163",
        "11416",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3668",
      "hadith_no": "3668",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيه، فسارها بشىء فبكت، ثم دعاها، فسارها فضحكت، قالت فسألتها عن ذلك‏.‏   فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet in his fatal illness, called his daughter Fatima and told her a secret because of which she started weeping. Then he called her and told her another secret, and she started laughing. When I asked her about that, she replied, The Prophet told me that he would die in his fatal illness, and so I wept, but then he secretly told me that from amongst his family, I would be the first to join him, and so I laughed.\"",
      "usc_msa_ref": "820",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3733",
      "hadith_no": "3733",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد كان فيما قبلكم من الأمم محدثون، فإن يك في أمتي أحد فإنه عمر ‏\"‏‏.‏",
      "text_en": "  Narrated Abu Huraira:                       Allah's Apostle said, \"Among the nations before you there used to be people who were inspired (though they were not prophets). And if there is any of such a persons amongst my followers, it is 'Umar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3762",
      "hadith_no": "3762",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيها، فسارها بشىء فبكت، ثم دعاها فسارها فضحكت، قالت فسألتها عن ذلك‏.‏ فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet called his daughter Fatima during his illness in which he died, and told her a secret whereupon she wept. Then he called her again and told her a secret whereupon she laughed. When I asked her about that, she replied, \"The Prophet spoke to me in secret and informed me that he would die in the course of the illness during which he died, so I wept. He again spoke to me in secret and informed me that I would be the first of his family to follow him (after his death) and on that I laughed.\"",
      "usc_msa_ref": "62",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3777",
      "hadith_no": "3777",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  قالت دخل على قائف والنبي صلى الله عليه وسلم شاهد، وأسامة بن زيد وزيد بن حارثة مضطجعان، فقال إن هذه الأقدام بعضها من بعض‏.‏ قال فسر بذلك النبي صلى الله عليه وسلم وأعجبه، فأخبر به عائشة‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said, \"A Qaif (i.e. one skilled in recognizing the lineage of a person through Physiognomy and through examining the body parts of an infant) came to me while the Prophet was present, and Usama bin Zaid and Zaid bin Haritha were Lying asleep. The Qa'if said. These feet (of Usama and his father) are of persons belonging to the same lineage.' \" The Prophet was pleased with that saying which won his admiration, and he told `Aisha of it.",
      "usc_msa_ref": "78",
      "chain": [
        "30119",
        "20150",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3984",
      "hadith_no": "3984",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم، عن الزهري، عن عامر بن سعد بن مالك، عن أبيه، قال عادني النبي صلى الله عليه وسلم عام حجة الوداع من مرض أشفيت منه على الموت، فقلت يا رسول الله، بلغ بي من الوجع ما ترى، وأنا ذو مال ولا يرثني إلا ابنة لي واحدة، أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قال فأتصدق بشطره قال ‏\"‏ الثلث يا سعد، والثلث كثير، إنك أن تذر ذريتك أغنياء خير من أن تذرهم عالة يتكففون الناس ‏\"‏‏.‏ قال أحمد بن يونس عن إبراهيم ‏\"‏ أن تذر ذريتك، ولست بنافق نفقة تبتغي بها وجه الله إلا آجرك الله بها، حتى اللقمة تجعلها في في امرأتك ‏\"‏‏.‏ قلت يا رسول الله، أخلف بعد أصحابي قال ‏\"‏ إنك لن تخلف فتعمل عملا تبتغي به وجه الله إلا ازددت به درجة ورفعة، ولعلك تخلف حتى ينتفع بك أقوام، ويضر بك آخرون، اللهم أمض لأصحابي هجرتهم، ولا تردهم على أعقابهم، لكن البائس سعد ابن خولة يرثي له رسول الله صلى الله عليه وسلم أن توفي بمكة ‏\"‏‏.‏ وقال أحمد بن يونس وموسى عن إبراهيم ‏\"‏ أن تذر ورثتك ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Malik:                     In the year of Hajjat-ul-Wada` the Prophet visited me when I fell ill and was about to die because of that illness. I said, \"O Allah's Apostle! I am very ill as you see, and I am a rich man and have no heir except my only daughter. Shall I give 2/3 of my property in charity?\" He said, \"No.\" I said, \"Shall I then give one half of it in charity?\" He said, \"O Sa`d! Give 1/3 (in charity) and even 1/3 is too much. No doubt, it is better to leave your children rich than to leave them poor, reduced to begging from others. And Allah will reward you for whatever you spend with the intention of gaining Allah's Pleasure even if it were a mouthful of food you put into your wives mouth.\" I said, \"O Allah's Apostle! Am I to be left behind (in Mecca) after my companions have gone?\" He said, \"If you should be left behind, you will be upgraded and elevated for every deed you will do with a desire to achieve Allah's Pleasure. I hope that you will live long so that some people will benefit by you while others will be harmed. O Allah! Please fulfill the migration of my companions and do not make them turn back on their heels. But (we feel sorry for) the unlucky Sa`d bin Khaulah.\" Allah's Apostle lamented his death in Mecca.",
      "usc_msa_ref": "273",
      "chain": [
        "30119",
        "20150",
        "11013",
        "10554",
        "9"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4265",
      "hadith_no": "4265",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يحيى بن قزعة، حدثنا مالك، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن متعة النساء يوم خيبر، وعن أكل الحمر الإنسية‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     On the day of Khaibar, Allah's Apostle forbade the Mut'a (i.e. temporary marriage) and the eating of donkey-meat.",
      "usc_msa_ref": "527",
      "chain": [
        "30119",
        "20001",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4331",
      "hadith_no": "4331",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن ابن شهاب، عن أنس بن مالك  رضى الله عنه  أن النبي صلى الله عليه وسلم دخل مكة يوم الفتح وعلى رأسه المغفر، فلما نزعه جاء رجل فقال ابن خطل متعلق بأستار الكعبة‏.‏ فقال ‏\"‏ اقتله ‏\"‏ قال مالك ولم يكن النبي صلى الله عليه وسلم فيما نرى والله أعلم يومئذ محرما‏.‏",
      "text_en": " Narrated Anas bin Malik:                     On the day of the Conquest, the Prophet entered Mecca, wearing a helmet on his head. When he took it off, a man came and said, \"Ibn Khatal is clinging to the curtain of the Ka`ba.\" The Prophet said, \"Kill him.\" (Malik a sub-narrator said, \"On that day the Prophet was not in a state of Ihram as it appeared to us, and Allah knows better.\")",
      "usc_msa_ref": "582",
      "chain": [
        "30119",
        "20001",
        "11013",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4456",
      "hadith_no": "4456",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن ابن شهاب،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، حدثني عبيد الله بن عبد الله، أن عبد الله بن عباس  رضى الله عنهما  أخبره أنه، أقبل يسير على حمار، ورسول الله صلى الله عليه وسلم قائم بمنى في حجة الوداع يصلي بالناس، فسار الحمار بين يدى بعض الصف، ثم نزل عنه، فصف مع الناس‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     That he came riding a donkey when Allah 's Apostle was standing at Mina during Hajjat-ul-Wada`, leading the people in prayer. The donkey passed in front of a part of the row (of the people offering the prayer). Then he dismounted from it and took his position in the row with the people.",
      "usc_msa_ref": "696",
      "chain": [
        "30119",
        "20001",
        "11013",
        "20023",
        "20475",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4532",
      "hadith_no": "4532",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، قال بينا الناس بقباء في صلاة الصبح إذ جاءهم آت فقال إن النبي صلى الله عليه وسلم قد أنزل عليه الليلة قرآن، وقد أمر أن يستقبل الكعبة فاستقبلوها‏.‏ وكانت وجوههم إلى الشأم فاستداروا إلى الكعبة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While some people were offering Fajr prayer at Quba' (mosque), some-one came to them and said, \"Tonight some Qur'anic Verses have been revealed to the Prophet and he has been ordered to face the Ka`ba (at Mecca) (during prayers), so you too should turn your faces towards it.\" At that time their faces were towards Sham (Jerusalem) so they turned towards the Ka`ba (at Mecca).",
      "usc_msa_ref": "18",
      "chain": [
        "30119",
        "20001",
        "11183",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5048",
      "hadith_no": "5048",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم أجود الناس بالخير، وأجود ما يكون في شهر رمضان لأن جبريل كان يلقاه في كل ليلة في شهر رمضان حتى ينسلخ يعرض عليه رسول الله صلى الله عليه وسلم القرآن، فإذا لقيه جبريل كان أجود بالخير من الريح المرسلة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was the most generous person, and he used to become more so (generous) particularly in the month of Ramadan because Gabriel used to meet him every night of the month of Ramadan till it elapsed. Allah's Apostle used to recite the Qur'an for him. When Gabriel met him, he used to become more generous than the fast wind in doing good.",
      "usc_msa_ref": "519",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5126",
      "hadith_no": "5126",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم بن الحارث، عن علقمة بن وقاص، عن عمر بن الخطاب  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ العمل بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله صلى الله عليه وسلم ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The rewards (of deeds) are according to the intention, and everybody will get the reward for what he has intended. So whoever emigrated for Allah's and His Apostle's sake, his emigration was for Allah and His Apostle; and whoever emigrated for worldly benefits, or to marry a woman, then his emigration was for the thing for what he emigrated for.\" (1)",
      "usc_msa_ref": "8",
      "chain": [
        "30119",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5362",
      "hadith_no": "5362",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله ولد لي غلام أسود‏.‏ فقال ‏\"‏ هل لك من إبل ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ما ألوانها ‏\"‏‏.‏ قال حمر‏.‏ قال ‏\"‏ هل فيها من أورق ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فأنى ذلك ‏\"‏‏.‏ قال لعله نزعه عرق‏.‏ قال ‏\"‏ فلعل ابنك هذا نزعه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet and said, \"O Allah's Apostle! A black child has been born for me.\" The Prophet asked him, \"Have you got camels?\" The man said, \"Yes.\" The Prophet asked him, \"What color are they?\" The man replied, \"Red.\" The Prophet said, \"Is there a grey one among them?' The man replied, \"Yes.\" The Prophet said, \"Whence comes that?\" He said, \"May be it is because of heredity.\" The Prophet said, \"May be your latest son has this color because of heredity.\"",
      "usc_msa_ref": "225",
      "chain": [
        "30119",
        "20001",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5377",
      "hadith_no": "5377",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن هشام بن عروة، عن أبيه، عن المسور بن مخرمة، أن سبيعة الأسلمية، نفست بعد وفاة زوجها، بليال فجاءت النبي صلى الله عليه وسلم فاستأذنته أن تنكح، فأذن لها، فنكحت‏.‏",
      "text_en": " Narrated Al-Miswer bin Makhrama:                     Subai'a Al-Aslamiya gave birth to a child a few days after the death of her husband. She came to the Prophet and asked permission to remarry, and the Prophet gave her permission, and she got married.",
      "usc_msa_ref": "241",
      "chain": [
        "30119",
        "20001",
        "11065",
        "10511",
        "2201"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5407",
      "hadith_no": "5407",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله، أو القائم الليل الصائم النهار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who fights for Allah's Cause, or like him who performs prayers all the night and fasts all the day.\"",
      "usc_msa_ref": "265",
      "chain": [
        "30119",
        "20001",
        "11155",
        "11165",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6370",
      "hadith_no": "6370",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الفطرة خمس الختان، والاستحداد، ونتف الإبط، وقص الشارب، وتقليم الأظفار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said \"Five things are in accordance with Al Fitra (i.e. the tradition of prophets): to be circumcised, to shave the pelvic region, to pull out the hair of the armpits, to cut short the moustaches, and to clip the nails.'",
      "usc_msa_ref": "312",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6834",
      "hadith_no": "6834",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثني يحيى بن قزعة، حدثنا مالك، عن نافع، عن ابن عمر  رضى الله عنهما أن رجلا، لاعن امرأته في زمن النبي صلى الله عليه وسلم وانتفى من ولدها ففرق النبي صلى الله عليه وسلم بينهما، وألحق الولد بالمرأة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man and his wife had a case of Lian (or Mula'ana) during the lifetime of the Prophet and the man denied the paternity of her child. The Prophet gave his verdict for their separation (divorce) and then the child was regarded as belonging to the wife only.",
      "usc_msa_ref": "740",
      "chain": [
        "30119",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7031",
      "hadith_no": "7031",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد بن جارية الأنصاري عن خنساء بنت خذام الأنصارية، أن أباها، زوجها وهى ثيب، فكرهت ذلك، فأتت النبي صلى الله عليه وسلم فرد نكاحها‏.‏",
      "text_en": " Narrated Khansa' bint Khidam Al-Ansariya:                     That her father gave her in marriage when she was a matron and she disliked that marriage. So she came and (complained) to the Prophets and he declared that marriage invalid. (See Hadith No. 69, Vol. 7)",
      "usc_msa_ref": "78",
      "chain": [
        "30119",
        "20001",
        "10530",
        "10535",
        "10530",
        "1719"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7074",
      "hadith_no": "7074",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رؤيا المؤمن جزء من ستة وأربعين جزءا من النبوة ‏\"‏‏.‏ رواه ثابت وحميد وإسحاق بن عبد الله وشعيب عن أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The (good) dream of a faithful believer is a part of the forty-six parts of prophetism.\"",
      "usc_msa_ref": "117",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7340",
      "hadith_no": "7340",
      "source": "Sahih Bukhari",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثني يحيى بن قزعة، حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كنت أسقي أبا طلحة الأنصاري وأبا عبيدة بن الجراح وأبى بن كعب شرابا من فضيخ وهو تمر فجاءهم آت فقال إن الخمر قد حرمت‏.‏ فقال أبو طلحة يا أنس قم إلى هذه الجرار فاكسرها، قال أنس فقمت إلى مهراس لنا فضربتها بأسفله حتى انكسرت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah and Ubai bin Ka`b. Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" Abii Talha then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar belonging to us, and hit the jars with its lower part till they broke.",
      "usc_msa_ref": "359",
      "chain": [
        "30119",
        "20001",
        "11151",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7562",
      "hadith_no": "7562",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم، عن ابن شهاب، عن أبي سلمة، والأعرج،‏.‏ وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، أن أبا هريرة، قال استب رجل من المسلمين ورجل من اليهود فقال المسلم والذي اصطفى محمدا على العالمين في قسم يقسم به، فقال اليهودي والذي اصطفى موسى على العالمين، فرفع المسلم يده عند ذلك فلطم اليهودي، فذهب اليهودي إلى رسول الله صلى الله عليه وسلم فأخبره بالذي كان من أمره وأمر المسلم، فقال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروني على موسى، فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا موسى باطش بجانب العرش، فلا أدري أكان فيمن صعق فأفاق قبلي أو كان ممن استثنى الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     \"A man from the Muslims and a man from the Jews quarrelled, and the Muslim said, \"By Him Who gave superiority to Muhammad over all the people!\" The Jew said, \"By Him Who gave superiority to Moses over all the people!' On that the Muslim lifted his hand and slapped the Jew. The Jew went to Allah's Apostle and informed him of all that had happened between him and the Muslim. The Prophet said, \"Do not give me superiority over Moses, for the people will fall unconscious on the Day of Resurrection, I will be the first to regain consciousness and behold, Moses will be standing there, holding the side of the Throne. I will not know whether he has been one of those who have fallen unconscious and then regained consciousness before me, or if he has been one of those exempted by Allah (from falling unconscious).\" (See Hadith No. 524, Vol. 8)",
      "usc_msa_ref": "564",
      "chain": [
        "30119",
        "20150",
        "11013",
        "10567",
        "11418",
        "15185",
        "11005",
        "11013",
        "10567",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    }
  ],
  "total_hadiths": 27,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}