{
  "id": "30118",
  "name": "Muhammad bin Maqatil al-Kisa'i محمد بن مقاتل الكسائي رخ",
  "full_name": "Muhammad bin Maqatil al-Kisa'i محمد بن مقاتل الكسائي رخ",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "226",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  -  ثقة ]"
    ],
    "tags": [
      "al-Marwazi",
      "Baghdad",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20014",
      "name": "Muburak bin Sa‘id Ath-Thawri مبارك بن سعيد الثوري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20408",
      "name": "Asbat bin Muhammad أسباط بن محمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-65",
      "hadith_no": "65",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، قال أخبرنا شعبة، عن قتادة، عن أنس بن مالك، قال كتب النبي صلى الله عليه وسلم كتابا  أو أراد أن يكتب  فقيل له إنهم لا يقرءون كتابا إلا مختوما‏.‏ فاتخذ خاتما من فضة نقشه محمد رسول الله‏.‏ كأني أنظر إلى بياضه في يده‏.‏ فقلت لقتادة من قال نقشه محمد رسول الله قال أنس‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the Prophet wrote a letter or had an idea of writing a letter. The Prophet was told that they (rulers) would not read letters unless they were sealed. So the Prophet got a silver ring made with \"Muhammad Allah's Apostle\" engraved on it. As if I were just observing its white glitter in the hand of the Prophet.",
      "usc_msa_ref": "65",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-88",
      "hadith_no": "88",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، قال أخبرنا عبد الله، قال أخبرنا عمر بن سعيد بن أبي حسين، قال حدثني عبد الله بن أبي مليكة، عن عقبة بن الحارث، أنه تزوج ابنة لأبي إهاب بن عزيز، فأتته امرأة فقالت إني قد أرضعت عقبة والتي تزوج بها‏.‏ فقال لها عقبة ما أعلم أنك أرضعتني ولا أخبرتني‏.‏ فركب إلى رسول الله صلى الله عليه وسلم بالمدينة فسأله، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كيف وقد قيل ‏\"‏‏.‏ ففارقها عقبة، ونكحت زوجا غيره‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Mulaika:                     `Uqba bin Al-Harith said that he had married the daughter of Abi Ihab bin `Aziz. Later on a woman came to him and said, \"I have suckled (nursed) `Uqba and the woman whom he married (his wife) at my breast.\" `Uqba said to her, \"Neither I knew that you have suckled (nursed) me nor did you tell me.\" Then he rode over to see Allah's Apostle at Medina, and asked him about it. Allah's Apostle said, \"How can you keep her as a wife when it has been said (that she is your foster-sister)?\" Then `Uqba divorced her, and she married another man.",
      "usc_msa_ref": "88",
      "chain": [
        "30118",
        "20025",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "id": "sahih-bukhari-247",
      "hadith_no": "247",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا سفيان، عن منصور، عن سعد بن عبيدة، عن البراء بن عازب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن، ثم قل اللهم أسلمت وجهي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجا منك إلا إليك، اللهم آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت‏.‏ فإن مت من ليلتك فأنت على الفطرة، واجعلهن آخر ما تتكلم به ‏\"‏‏.‏ قال فرددتها على النبي صلى الله عليه وسلم فلما بلغت ‏\"‏ اللهم آمنت بكتابك الذي أنزلت ‏\"‏‏.‏ قلت ورسولك‏.‏ قال ‏\"‏ لا، ونبيك الذي أرسلت ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara 'bin `Azib:                     The Prophet said to me, \"Whenever you go to bed perform ablution like that for the prayer, lie or your right side and say, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika raghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu bikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (O Allah! I surrender to You and entrust all my affairs to You and depend upon You for Your Blessings both with hope and fear of You. There is no fleeing from You, and there is no place of protection and safety except with You O Allah! I believe in Your Book (the Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You have sent). Then if you die on that very night, you will die with faith (i.e. or the religion of Islam). Let the aforesaid words be your last utterance (before sleep).\" I repeated it before the Prophet and when I reached \"Allahumma amantu bikitabika-l-ladhi anzalta (O Allah I believe in Your Book which You have revealed).\" I said, \"Wa-rasulika (and your Apostle).\" The Prophet said, \"No, (but say): 'Wanabiyika-l-ladhi arsalta (Your Prophet whom You have sent), instead.\"",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "20012",
        "11067",
        "11344",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-542",
      "hadith_no": "542",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد  يعني ابن مقاتل  قال أخبرنا عبد الله، قال أخبرنا خالد بن عبد الرحمن، حدثني غالب القطان، عن بكر بن عبد الله المزني، عن أنس بن مالك، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم بالظهائر فسجدنا على ثيابنا اتقاء الحر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When we offered the Zuhr prayers behind Allah's Apostle we used to prostrate on our clothes to protect ourselves from the heat.",
      "usc_msa_ref": "517",
      "chain": [
        "30118",
        "20025",
        "20227",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-547",
      "hadith_no": "547",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا عوف، عن سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي، فقال له أبي كيف كان رسول الله صلى الله عليه وسلم يصلي المكتوبة فقال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية  ونسيت ما قال في المغرب  وكان يستحب أن يؤخر العشاء التي تدعونها العتمة، وكان يكره النوم قبلها والحديث بعدها، وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه، ويقرأ بالستين إلى المائة‏.‏",
      "text_en": " Narrated Saiyar bin Salama:                     I along with my father went to Abu- Barza Al-Aslami and my father asked him, \"How Allah's Apostle used to offer the five compulsory congregational prayers?\" Abu- Barza said, \"The Prophet used to pray the Zuhr prayer which you (people) call the first one at midday when the sun had just declined The `Asr prayer at a time when after the prayer, a man could go to the house at the farthest place in Medina (and arrive) while the sun was still hot. (I forgot about the Maghrib prayer). The Prophet Loved to delay the `Isha which you call Al- `Atama [??] and he disliked sleeping before it and speaking after it. After the Fajr prayer he used to leave when a man could recognize the one sitting beside him and he used to recite between 60 to 100 Ayat (in the Fajr prayer) .",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11298",
        "11290"
      ]
    },
    {
      "id": "sahih-bukhari-549",
      "hadith_no": "549",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن مقاتل، قال أخبرنا عبد الله، قال أخبرنا أبو بكر بن عثمان بن سهل بن حنيف، قال سمعت أبا أمامة، يقول صلينا مع عمر بن عبد العزيز الظهر، ثم خرجنا حتى دخلنا على أنس بن مالك فوجدناه يصلي العصر فقلت يا عم، ما هذه الصلاة التي صليت قال العصر، وهذه صلاة رسول الله صلى الله عليه وسلم التي كنا نصلي معه‏.‏",
      "text_en": " Narrated Abu Bakr bin `Uthman bin Sahl bin Hunaif:                     that he heard Abu Umama saying: We prayed the Zuhr prayer with `Umar bin `Abdul `Aziz and then went to Anas bin Malik and found him offering the `Asr prayer. I asked him, \"O uncle! Which prayer have you offered?\" He said 'The `Asr and this is (the time of) the prayer of Allah s Apostle which we used to pray with him.\"",
      "usc_msa_ref": "524",
      "chain": [
        "30118",
        "20025",
        "4048"
      ]
    },
    {
      "id": "sahih-bukhari-736",
      "hadith_no": "736",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، أخبرني سالم بن عبد الله، عن عبد الله بن عمر، رضى الله عنهما قال رأيت رسول الله صلى الله عليه وسلم إذا قام في الصلاة رفع يديه حتى يكونا حذو منكبيه، وكان يفعل ذلك حين يكبر للركوع، ويفعل ذلك إذا رفع رأسه من الركوع ويقول ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ ولا يفعل ذلك في السجود‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     I saw that whenever Allah's Apostle stood for the prayer, he used to raise both his hands up to the shoulders, and used to do the same on saying the Takbir for bowing and on raising his head from it and used to say, \"Sami`a l-lahu liman hamidah\". But he did not do that (i.e. raising his hands) in prostrations.",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-914",
      "hadith_no": "914",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن مقاتل، قال أخبرنا عبد الله، قال أخبرنا أبو بكر بن عثمان بن سهل بن حنيف، عن أبي أمامة بن سهل بن حنيف، قال سمعت معاوية بن أبي سفيان،، وهو جالس على المنبر، أذن المؤذن قال الله أكبر الله أكبر‏.‏ قال معاوية الله أكبر الله أكبر‏.‏ قال أشهد أن لا إله إلا الله‏.‏ فقال معاوية وأنا‏.‏ فقال أشهد أن محمدا رسول الله‏.‏ فقال معاوية وأنا‏.‏ فلما أن قضى التأذين قال يا أيها الناس إني سمعت رسول الله صلى الله عليه وسلم على هذا المجلس حين أذن المؤذن يقول ما سمعتم مني من مقالتي‏.‏",
      "text_en": " Narrated Abu Umama bin Sahl bin Hunaif:                     I heard Muawiya bin Abi Sufyan (repeating the statements of the Adhan) while he was sitting on the pulpit. When the Mu'adh-dhin pronounced the Adhan saying, \"Allahu-Akbar, Allahu Akbar\", Muawiya said: \"Allah Akbar, Allahu Akbar.\" And when the Mu'adh-dhin said, \"Ash-hadu an la ilaha illal-lah (I testify that none has the right to be worshipped but Allah)\", Muawiya said, \"And (so do) I\". When he said, \"Ash-hadu anna Muhammadan Rasulullah\" (I testify that Muhammad is Allah's Apostle), Muawiya said, \"And (so do) I\". When the Adhan was finished, Muawiya said, \"O people, when the Mu'adh-dhin pronounced the Adhan I heard Allah's Apostle on this very pulpit saying what you have just heard me saying\".",
      "usc_msa_ref": "37",
      "chain": [
        "30118",
        "20025",
        "405",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-916",
      "hadith_no": "916",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال سمعت السائب بن يزيد، يقول إن الأذان يوم الجمعة كان أوله حين يجلس الإمام يوم الجمعة على المنبر في عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر  رضى الله عنهما  فلما كان في خلافة عثمان  رضى الله عنه  وكثروا، أمر عثمان يوم الجمعة بالأذان الثالث، فأذن به على الزوراء، فثبت الأمر على ذلك‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard As-Saib bin Yazid, saying, \"In the lifetime of Allah's Apostle, and Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be pronounced after the Imam had taken his seat on the pulpit. But when the people increased in number during the caliphate of `Uthman, he introduced a third Adhan (on Friday for the Jumua prayer) and it was pronounced at Az-Zaura' and that new state of affairs remained so in the succeeding years.",
      "usc_msa_ref": "39",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "3048"
      ]
    },
    {
      "id": "sahih-bukhari-1032",
      "hadith_no": "1032",
      "source": "Sahih Bukhari",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد  هو ابن مقاتل أبو الحسن المروزي  قال أخبرنا عبد الله، قال أخبرنا عبيد الله، عن نافع، عن القاسم بن محمد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا رأى المطر قال ‏\"‏ صيبا نافعا ‏\"‏‏.‏ تابعه القاسم بن يحيى عن عبيد الله‏.‏ ورواه الأوزاعي وعقيل عن نافع‏.‏",
      "text_en": " Narrated Aisha:                     Whenever Allah's Apostle saw the rain, he used to say, \"O Allah! Let it be a strong fruitful rain.\"",
      "usc_msa_ref": "142",
      "chain": [
        "30118",
        "20025",
        "11201",
        "11014",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1033",
      "hadith_no": "1033",
      "source": "Sahih Bukhari",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله بن المبارك، قال أخبرنا الأوزاعي، قال حدثنا إسحاق بن عبد الله بن أبي طلحة الأنصاري، قال حدثني أنس بن مالك، قال أصابت الناس سنة على عهد رسول الله صلى الله عليه وسلم فبينا رسول الله صلى الله عليه وسلم يخطب على المنبر يوم الجمعة قام أعرابي فقال يا رسول الله، هلك المال وجاع العيال، فادع الله لنا أن يسقينا‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه، وما في السماء قزعة، قال فثار سحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته، قال فمطرنا يومنا ذلك، وفي الغد ومن بعد الغد والذي يليه إلى الجمعة الأخرى، فقام ذلك الأعرابي أو رجل غيره فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه وقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ قال فما جعل يشير بيده إلى ناحية من السماء إلا تفرجت حتى صارت المدينة في مثل الجوبة، حتى سال الوادي  وادي قناة  شهرا‏.‏ قال فلم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     In the lifetime of Allah's Apostle (p.b.u.h) the people were afflicted with a (famine) year. While the Prophet was delivering the Khutba (sermon) on the pulpit on a Friday, a Bedouin stood up and said, \"O Allah's Apostle! The livestock are dying and the families (offspring) are hungry: please pray to Allah to bless us with rain.\" Allah's Apostle raised both his hands towards the sky and at that time there was not a trace of cloud in they sky. Then the clouds started gathering like mountains. Before he got down from the pulpit I saw rainwater trickling down his beard. It rained that day, the next day, the third day, the fourth day and till the next Friday, when the same Bedouin or some other person stood up (during the Friday Khutba) and said, \"O Allah's Apostle! The houses have collapsed and the livestock are drowned. Please invoke Allah for us.\" So Allah's Apostle raised both his hands and said, \"O Allah! Around us and not on us.\" Whichever side the Prophet directed his hand, the clouds dispersed from there till a hole (in the clouds) was formed over Medina. The valley of Qanat remained flowing (with water) for one month and none, came from outside who didn't talk about the abundant rain.",
      "usc_msa_ref": "143",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1126",
      "hadith_no": "1126",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن هند بنت الحارث، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم استيقظ ليلة فقال ‏\"‏ سبحان الله ماذا أنزل الليلة من الفتنة، ماذا أنزل من الخزائن من يوقظ صواحب الحجرات، يا رب كاسية في الدنيا عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     One night the Prophet got up and said, \"Subhan Allah! How many afflictions Allah has revealed tonight and how many treasures have been sent down (disclosed). Go and wake the sleeping lady occupants of these dwellings up (for prayers), perhaps a well dressed in this world may be naked in the Hereafter.\"",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1152",
      "hadith_no": "1152",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عباس بن الحسين، حدثنا مبشر، عن الأوزاعي،‏.‏ وحدثني محمد بن مقاتل أبو الحسن، قال أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله، لا تكن مثل فلان، كان يقوم الليل فترك قيام الليل ‏\"‏‏.‏ وقال هشام حدثنا ابن أبي العشرين، حدثنا الأوزاعي، قال حدثني يحيى، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة، مثله‏.‏ وتابعه عمرو بن أبي سلمة عن الأوزاعي،‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then stopped the night prayer.\"",
      "usc_msa_ref": "252",
      "chain": [
        "30141",
        "20461",
        "20024",
        "30118",
        "20025",
        "20024",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-1212",
      "hadith_no": "1212",
      "source": "Sahih Bukhari",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، عن عروة، قال قالت عائشة خسفت الشمس، فقام النبي صلى الله عليه وسلم فقرأ سورة طويلة، ثم ركع فأطال، ثم رفع رأسه، ثم استفتح بسورة أخرى، ثم ركع حتى قضاها وسجد، ثم فعل ذلك في الثانية، ثم قال ‏\"‏ إنهما آيتان من آيات الله، فإذا رأيتم ذلك فصلوا حتى يفرج عنكم، لقد رأيت في مقامي هذا كل شىء وعدته، حتى لقد رأيتني أريد أن آخذ قطفا من الجنة حين رأيتموني جعلت أتقدم، ولقد رأيت جهنم يحطم بعضها بعضا حين رأيتموني تأخرت، ورأيت فيها عمرو بن لحى وهو الذي سيب السوائب ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Once the sun eclipsed and Allah's Apostle stood up for the prayer and recited a very long Sura and when bowed for a long while and then raised his head and started reciting another Sura. Then he bowed, and after finishing, he prostrated and did the same in the second rak`a and then said, \"These (lunar and solar eclipses) are two of the signs of Allah and if you see them, pray till the eclipse is over. No doubt, while standing at this place I saw everything promised to me by Allah and I saw (Paradise) and I wanted to pluck a bunch (of grapes) therefrom, at the time when you saw me stepping forward. No doubt, I saw Hell with its different parts destroying each other when you saw me retreating and in it I saw `Amr bin Luhai who started the tradition of freeing animals (set them free) in the name of idols.\"",
      "usc_msa_ref": "303",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "id": "sahih-bukhari-1264",
      "hadith_no": "1264",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم كفن في ثلاثة أثواب يمانية بيض سحولية من كرسف، ليس فيهن قميص ولا عمامة‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle was shrouded in three Yemenite white Suhuliya (pieces of cloth) of cotton, and in them there was neither a shirt nor a turban.\"",
      "usc_msa_ref": "354",
      "chain": [
        "30118",
        "20025",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1275",
      "hadith_no": "1275",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا شعبة، عن سعد بن إبراهيم، عن أبيه، إبراهيم أن عبد الرحمن بن عوف  رضى الله عنه  أتي بطعام وكان صائما فقال قتل مصعب بن عمير وهو خير مني، كفن في بردة، إن غطي رأسه بدت رجلاه، وإن غطي رجلاه بدا رأسه  وأراه قال  وقتل حمزة وهو خير مني، ثم بسط لنا من الدنيا ما بسط  أو قال أعطينا من الدنيا ما أعطينا  وقد خشينا أن تكون حسناتنا عجلت لنا، ثم جعل يبكي حتى ترك الطعام‏.‏",
      "text_en": " Narrated Ibrahim:                     Once a meal was brought to `Abdur-Rahman bin `Auf and he was fasting. He said, \"Mustab bin `Umar was martyred and he was better than I and was shrouded in his Burd and when his head was covered with it, his legs became bare, and when his legs were covered his head got uncovered. Hamza was martyred and was better than I. Now the worldly wealth have been bestowed upon us (or said a similar thing). No doubt, I fear that the rewards of my deeds might have been given earlier in this world.\" Then he started weeping and left his food.",
      "usc_msa_ref": "365",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11063",
        "8"
      ]
    },
    {
      "id": "sahih-bukhari-1347",
      "hadith_no": "1347",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا ليث بن سعد، حدثني ابن شهاب، عن عبد الرحمن بن كعب بن مالك، عن جابر بن عبد الله  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول ‏\"‏ أيهم أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى أحدهما قدمه في اللحد وقال ‏\"‏ أنا شهيد على هؤلاء ‏\"‏‏.‏ وأمر بدفنهم بدمائهم، ولم يصل عليهم ولم يغسلهم‏.‏   وأخبرنا الأوزاعي، عن الزهري، عن جابر بن عبد الله  رضى الله عنهما  كان رسول الله صلى الله عليه وسلم يقول لقتلى أحد ‏\"‏ أى هؤلاء أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى رجل قدمه في اللحد قبل صاحبه‏.‏ وقال جابر فكفن أبي وعمي في نمرة واحدة‏.‏   وقال سليمان بن كثير حدثني الزهري، حدثنا من، سمع جابرا  رضى الله عنه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle shrouded every two martyrs of Uhud in one piece of cloth and then he would ask, \"Which of them knew more Qur'an?\" When one of them was pointed out he would put him first in the grave. He said, \"I am a witness on these.\" Then he ordered them to be buried with blood on their bodies. Neither did he offer their funeral prayer nor did he get them washed. (Jabir bin `Abdullah added): Allah's Apostle used to ask about the martyrs of Uhud as to which of them knew more of the Qur'an.\" And when one of them was pointed out as having more of it he would put him first in the grave and then his companions. (Jabir added): My father and my uncle were shrouded in one sheet.",
      "usc_msa_ref": "431",
      "chain": [
        "30118",
        "20025",
        "20023",
        "11013",
        "1134",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-1390-2",
      "hadith_no": "1390",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا أبو بكر بن عياش، عن سفيان التمار، أنه حدثه أنه، رأى قبر النبي صلى الله عليه وسلم مسنما‏.‏",
      "text_en": " Narrated Abu Bakr bin `Aiyash:                     Sufyan at-Tammar told me that he had seen the grave of the Prophet elevated and convex.",
      "usc_msa_ref": "473",
      "chain": [
        "30118",
        "20025",
        "20373"
      ]
    },
    {
      "id": "sahih-bukhari-1975",
      "hadith_no": "1975",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله ألم أخبر أنك تصوم النهار وتقوم الليل ‏\"‏‏.‏ فقلت بلى يا رسول الله‏.‏ قال ‏\"‏ فلا تفعل، صم وأفطر، وقم ونم، فإن لجسدك عليك حقا، وإن لعينك عليك حقا، وإن لزوجك عليك حقا، وإن لزورك عليك حقا، وإن بحسبك أن تصوم كل شهر ثلاثة أيام، فإن لك بكل حسنة عشر أمثالها، فإن ذلك صيام الدهر كله ‏\"‏‏.‏ فشددت، فشدد على، قلت يا رسول الله، إني أجد قوة‏.‏ قال ‏\"‏ فصم صيام نبي الله داود عليه السلام ولا تزد عليه ‏\"‏‏.‏ قلت وما كان صيام نبي الله داود  عليه السلام  قال ‏\"‏ نصف الدهر ‏\"‏‏.‏ فكان عبد الله يقول بعد ما كبر يا ليتني قبلت رخصة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle said to me, \"O `Abdullah! Have I not been informed that you fast during the day and offer prayers all the night.\" `Abdullah replied, \"Yes, O Allah's Apostle!\" The Prophet said, \"Don't do that; fast for few days and then give it up for few days, offer prayers and also sleep at night, as your body has a right on you, and your wife has a right on you, and your guest has a right on you. And it is sufficient for you to fast three days in a month, as the reward of a good deed is multiplied ten times, so it will be like fasting throughout the year.\" I insisted (on fasting) and so I was given a hard instruction. I said, \"O Allah's Apostle! I have power.\" The Prophet said, \"Fast like the fasting of the Prophet David and do not fast more than that.\" I said, \"How was the fasting of the Prophet of Allah, David?\" He said, \"Half of the year,\" (i.e. he used to fast on every alternate day). Afterwards when `Abdullah became old, he used to say, \"It would have been better for me if I had accepted the permission of the Prophet (which he gave me i.e. to fast only three days a month).",
      "usc_msa_ref": "196",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-2045",
      "hadith_no": "2045",
      "source": "Sahih Bukhari",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن سعيد، قال حدثتني عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم ذكر أن يعتكف العشر الأواخر من رمضان، فاستأذنته عائشة فأذن لها، وسألت حفصة عائشة أن تستأذن لها ففعلت فلما رأت ذلك زينب ابنة جحش أمرت ببناء فبني لها قالت وكان رسول الله صلى الله عليه وسلم إذا صلى انصرف إلى بنائه فبصر بالأبنية فقال ‏\"‏ ما هذا ‏\"‏‏.‏ قالوا بناء عائشة وحفصة وزينب‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آلبر أردن بهذا ما أنا بمعتكف ‏\"‏‏.‏ فرجع، فلما أفطر اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman from `Aisha:                     Allah's Apostle mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked his permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for her, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it was pitched for her. Allah's Apostle used to proceed to his tent after the prayer. So, he saw the tents ans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's Apostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" So he returned home. When the fasting month was over, he performed Itikar for ten days in the month of Shawwal.",
      "usc_msa_ref": "261",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2195",
      "hadith_no": "2195",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا حميد الطويل، عن أنس  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى أن تباع ثمرة النخل حتى تزهو‏.‏ قال أبو عبد الله يعني حتى تحمر‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle forbade the sale of date fruits till they were ripe. Abu `Abdullah (Al-Bukhari) said, \"That means till they were red (can be eaten).",
      "usc_msa_ref": "400",
      "chain": [
        "30118",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-2255",
      "hadith_no": "2255",
      "source": "Sahih Bukhari",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن سليمان الشيباني، عن محمد بن أبي مجالد، قال أرسلني أبو بردة وعبد الله بن شداد إلى عبد الرحمن بن أبزى وعبد الله بن أبي أوفى فسألتهما عن السلف،‏.‏ فقالا كنا نصيب المغانم مع رسول الله صلى الله عليه وسلم فكان يأتينا أنباط من أنباط الشأم فنسلفهم في الحنطة والشعير والزبيب إلى أجل مسمى‏.‏ قال قلت أكان لهم زرع، أو لم يكن لهم زرع قالا ما كنا نسألهم عن ذلك‏.‏",
      "text_en": " Narrated Muhammad bin Abi Al-Mujalid:                     Abu Burda and `Abdullah bin Shaddad sent me to `Abdur Rahman bin Abza and `Abdullah bin Abi `Aufa to ask them about the Salaf (Salam). They said, \"We used to get war booty while we were with Allah's Apostle and when the peasants of Sham came to us we used to pay them in advance for wheat, barley, and oil to be delivered within a fixed period.\" I asked them, \"Did the peasants own standing crops or not?\" They replied, \"We never asked them about it.\"",
      "usc_msa_ref": "456",
      "chain": [
        "30118",
        "20025",
        "20012",
        "11352"
      ]
    },
    {
      "id": "sahih-bukhari-2331",
      "hadith_no": "2331",
      "source": "Sahih Bukhari",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم أعطى خيبر اليهود على أن يعملوها ويزرعوها، ولهم شطر ما خرج منها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle gave the land of Khaibar to the Jew's on the condition that they work on it and cultivate it, and be given half of its yield.",
      "usc_msa_ref": "524",
      "chain": [
        "30118",
        "20025",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2339",
      "hadith_no": "2339",
      "source": "Sahih Bukhari",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا الأوزاعي، عن أبي النجاشي، مولى رافع بن خديج سمعت رافع بن خديج بن رافع، عن عمه، ظهير بن رافع قال ظهير لقد نهانا رسول الله صلى الله عليه وسلم عن أمر كان بنا رافقا‏.‏ قلت ما قال رسول الله صلى الله عليه وسلم فهو حق‏.‏ قال دعاني رسول الله صلى الله عليه وسلم قال ‏\"‏ ما تصنعون بمحاقلكم ‏\"‏‏.‏ قلت نؤاجرها على الربع وعلى الأوسق من التمر والشعير‏.‏ قال ‏\"‏ لا تفعلوا ازرعوها أو أزرعوها أو أمسكوها ‏\"‏‏.‏ قال رافع قلت سمعا وطاعة‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     My uncle Zuhair said, \"Allah's Apostle forbade us to do a thing which was a source of help to us.\" I said, \"Whatever Allah's Apostle said was right.\" He said, \"Allah's Apostle sent for me and asked, 'What are you doing with your farms?' I replied, 'We give our farms on rent on the basis that we get the yield produced at the banks of the water streams (rivers) for the rent, or rent it for some Wasqs of barley and dates.' Allah's Apostle said, 'Do not do so, but cultivate (the land) yourselves or let it be cultivated by others gratis, or keep it uncultivated.' I said, 'We hear and obey.'",
      "usc_msa_ref": "532",
      "chain": [
        "30118",
        "20025",
        "20024",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-2432",
      "hadith_no": "2432",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأنقلب إلى أهلي، فأجد التمرة ساقطة على فراشي فأرفعها لآكلها، ثم أخشى أن تكون صدقة فألفيها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                      The Prophet said, \"Sometimes when I return home and find a date fallen on my bed, I pick it up in order to eat it, but I fear that it might be from a Sadaqa, so I throw it.\"",
      "usc_msa_ref": "612",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2512",
      "hadith_no": "2512",
      "source": "Sahih Bukhari",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا زكرياء، عن الشعبي، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم‏.‏ ‏\"‏ الرهن يركب بنفقته إذا كان مرهونا، ولبن الدر يشرب بنفقته إذا كان مرهونا، وعلى الذي يركب ويشرب النفقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The mortgaged animal can be used for riding as long as it is fed and the milk of the milch animal can be drunk according to what one spend on it. The one who rides the animal or drinks its milk should provide the expenditures.\"",
      "usc_msa_ref": "689",
      "chain": [
        "30118",
        "20025",
        "11338",
        "11052",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2579",
      "hadith_no": "2579",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا خالد بن عبد الله، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية، قالت دخل النبي صلى الله عليه وسلم على عائشة  رضى الله عنها  فقال ‏\"‏ عندكم شىء ‏\"‏‏.‏ قالت لا، إلا شىء بعثت به أم عطية من الشاة التي بعث إليها من الصدقة‏.‏ قال ‏\"‏ إنها قد بلغت محلها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     Once the Prophet went to `Aisha and asked her whether she had something (to eat). She said that she had nothing except the mutton which Um 'Atiyya had sent to (Buraira) in charity. The Prophet said that it had reached its destination (i.e. it is no longer an object of charity.)",
      "usc_msa_ref": "753",
      "chain": [
        "30118",
        "20423",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "id": "sahih-bukhari-2609",
      "hadith_no": "2609",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا شعبة، عن سلمة بن كهيل، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه أخذ سنا فجاء صاحبه يتقاضاه فقال ‏\"‏ إن لصاحب الحق مقالا ‏\"‏‏.‏ ثم قضاه أفضل من سنه وقال ‏\"‏ أفضلكم أحسنكم قضاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet took a camel of special age from somebody on credit. Its owner came and demanded it back (harshly). The Prophet said, \"No doubt, he who has a right, can demand it.\" Then the Prophet gave him an older camel than his camel and said, \"The best amongst you is he who repays his debts in the most handsome way.\"",
      "usc_msa_ref": "780",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11350",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2688",
      "hadith_no": "2688",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني عروة، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا أراد سفرا أقرع بين نسائه، فأيتهن خرج سهمها خرج بها معه، وكان يقسم لكل امرأة منهن يومها وليلتها، غير أن سودة بنت زمعة وهبت يومها وليلتها لعائشة زوج النبي صلى الله عليه وسلم، تبتغي بذلك رضا رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     Whenever Allah's Apostle intended to go on a journey, he used to draw lots among his wives and would take with him the one on whom the lot fell. He also used to fix for everyone of his wives a day and a night, but Sauda bint Zam`a gave her day and night to `Aisha, the wife of the Prophet intending thereby to please Allah's Apostle.",
      "usc_msa_ref": "853",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3220",
      "hadith_no": "3220",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال حدثني عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم أجود الناس، وكان أجود ما يكون في رمضان حين يلقاه جبريل، وكان جبريل يلقاه في كل ليلة من رمضان، فيدارسه القرآن، فلرسول الله صلى الله عليه وسلم حين يلقاه جبريل أجود بالخير من الريح المرسلة‏.‏ وعن عبد الله حدثنا معمر بهذا الإسناد نحوه‏.‏ وروى أبو هريرة وفاطمة  رضى الله عنهما  عن النبي صلى الله عليه وسلم أن جبريل كان يعارضه القرآن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle was the most generous of all the people, and he used to be more generous in the month of Ramadan when Gabriel used to meet him. Gabriel used to meet him every night in Ramadan to study the Holy Qur'an carefully together. Allah's Apostle used to become more generous than the fast wind when he met Gabriel.",
      "usc_msa_ref": "443",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3225",
      "hadith_no": "3225",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن عبيد الله بن عبد الله، أنه سمع ابن عباس  رضى الله عنهما  يقول سمعت أبا طلحة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة تماثيل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Talha:                     I heard Allah's Apostle saying; \"Angels (of Mercy) do not enter a house wherein there is a dog or a picture of a living creature (a human being or an animal).",
      "usc_msa_ref": "448",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3245",
      "hadith_no": "3245",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أول زمرة تلج الجنة صورتهم على صورة القمر ليلة البدر، لا يبصقون فيها ولا يمتخطون ولا يتغوطون، آنيتهم فيها الذهب، أمشاطهم من الذهب والفضة، ومجامرهم الألوة، ورشحهم المسك، ولكل واحد منهم زوجتان، يرى مخ سوقهما من وراء اللحم، من الحسن، لا اختلاف بينهم ولا تباغض، قلوبهم قلب واحد، يسبحون الله بكرة وعشيا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The first group (of people) who will enter Paradise will be (glittering) like the moon when it is full. They will not spit or blow their noses or relieve nature. Their utensils will be of gold and their combs of gold and silver; in their centers the aloe wood will be used, and their sweat will smell like musk. Everyone of them will have two wives; the marrow of the bones of the wives' legs will be seen through the flesh out of excessive beauty. They ( i.e. the people of Paradise) will neither have differences nor hatred amongst themselves; their hearts will be as if one heart and they will be glorifying Allah in the morning and in the evening.\"",
      "usc_msa_ref": "468",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3446",
      "hadith_no": "3446",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا صالح بن حى، أن رجلا، من أهل خراسان قال للشعبي‏.‏ فقال الشعبي أخبرني أبو بردة عن أبي موسى الأشعري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أدب الرجل أمته فأحسن تأديبها، وعلمها فأحسن تعليمها ثم أعتقها فتزوجها، كان له أجران، وإذا آمن بعيسى ثم آمن بي، فله أجران، والعبد إذا اتقى ربه وأطاع مواليه، فله أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     Allah's Apostle said, \"If a person teaches his slave girl good manners properly, educates her properly, and then manumits and marries her, he will get a double reward. And if a man believes in Jesus and then believes in me, he will get a double reward. And if a slave fears his Lord (i.e. Allah) and obeys his masters, he too will get a double reward.\"",
      "usc_msa_ref": "655",
      "chain": [
        "30118",
        "20025",
        "11431",
        "1820",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-3709",
      "hadith_no": "3709",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن سالم بن عبد الله، عن عبد الله بن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جر ثوبه خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏‏.‏ فقال أبو بكر إن أحد شقى ثوبي يسترخي إلا أن أتعاهد ذلك منه‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنك لست تصنع ذلك خيلاء ‏\"‏ قال موسى فقلت لسالم أذكر عبد الله من جر إزاره قال لم أسمعه ذكر إلا ثوبه‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     That Allah's Apostle said, \"Allah will not look on the Day of Judgment at him who drags his robe (behind him) out of pride.\" Abu Bakr said \"One side of my robe slacks down unless I get very cautious about it.\" Allah's Apostle said, \"But you do not do that with a pride.\"",
      "usc_msa_ref": "17",
      "chain": [
        "30118",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4166",
      "hadith_no": "4166",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن سالم، ونافع، عن عبد الله  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان إذا قفل من الغزو، أو الحج، أو العمرة، يبدأ فيكبر ثلاث مرار ثم يقول ‏\"‏ لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شىء قدير، آيبون تائبون عابدون ساجدون، لربنا حامدون، صدق الله وعده، ونصر عبده، وهزم الأحزاب وحده ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Whenever Allah's Apostle returned from a Ghazwa, Hajj or `Umra, he used to start (saying), \"Allahu- Akbar,\" thrice and then he would say, \"None has the right to be worshipped except Allah alone Who has no partners. To Him belongs the Kingdom, all praises are for Him, and He is able to do all things (i.e. Omnipotent). We are returning with repentance (to Allah) worshipping, prostrating, and praising our Lord. Allah has fulfilled His Promise, made His Slave victorious, and He (Alone) defeated the clans (of infidels) .\"",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11106",
        "11011",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4266",
      "hadith_no": "4266",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى يوم خيبر عن لحوم الحمر الأهلية‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the day of Khaibar, Allah's Apostle forbade the eating of donkey meat.",
      "usc_msa_ref": "528",
      "chain": [
        "30118",
        "20025",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4349",
      "hadith_no": "4349",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرني يونس، عن الزهري، قال أخبرني عروة بن الزبير، أن امرأة، سرقت في عهد رسول الله صلى الله عليه وسلم في غزوة الفتح، ففزع قومها إلى أسامة بن زيد يستشفعونه، قال عروة فلما كلمه أسامة فيها تلون وجه رسول الله صلى الله عليه وسلم فقال ‏\"‏ أتكلمني في حد من حدود الله ‏\"‏‏.‏ قال أسامة استغفر لي يا رسول الله‏.‏ فلما كان العشي قام رسول الله صلى الله عليه وسلم خطيبا، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإنما أهلك الناس قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه، وإذا سرق فيهم الضعيف أقاموا عليه الحد، والذي نفس محمد بيده، لو أن فاطمة بنت محمد سرقت لقطعت يدها ‏\"‏‏.‏ ثم أمر رسول الله صلى الله عليه وسلم بتلك المرأة، فقطعت يدها، فحسنت توبتها بعد ذلك وتزوجت‏.‏ قالت عائشة فكانت تأتي بعد ذلك فأرفع حاجتها إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     A lady committed theft during the lifetime of Allah's Apostle in the Ghazwa of Al-Fath, ((i.e. Conquest of Mecca). Her folk went to Usama bin Zaid to intercede for her (with the Prophet). When Usama interceded for her with Allah's Apostle, the color of the face of Allah's Apostle changed and he said, \"Do you intercede with me in a matter involving one of the legal punishments prescribed by Allah?\" Usama said, \"O Allah's Apostle! Ask Allah's Forgiveness for me.\" So in the afternoon, Allah's Apostle got up and addressed the people. He praised Allah as He deserved and then said, \"Amma ba'du ! The nations prior to you were destroyed because if a noble amongst them stole, they used to excuse him, and if a poor person amongst them stole, they would apply (Allah's) Legal Punishment to him. By Him in Whose Hand Muhammad's soul is, if Fatima, the daughter of Muhammad stole, I would cut her hand.\" Then Allah's Apostle gave his order in the case of that woman and her hand was cut off. Afterwards her repentance proved sincere and she got married. `Aisha said, \"That lady used to visit me and I used to convey her demands to Allah's Apostle.\"",
      "usc_msa_ref": "597",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "id": "sahih-bukhari-4611",
      "hadith_no": "4611",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا الحجاج، عن ابن جريج، أخبرني ابن أبي مليكة، عن حميد بن عبد الرحمن بن عوف، أنه أخبره أن مروان بهذا‏.‏",
      "text_en": " Narrated Humaid bin `Abdur-Rahman bin `Auf:                     That Marwan had told him (the above narration No. 91).",
      "usc_msa_ref": "92",
      "chain": [
        "30118",
        "20381",
        "11070",
        "11090",
        "10561"
      ]
    },
    {
      "id": "sahih-bukhari-4622",
      "hadith_no": "4622",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل، حدثنا أسباط بن محمد، حدثنا الشيباني، عن عكرمة، عن ابن عباس،‏.‏ قال الشيباني وذكره أبو الحسن السوائي ولا أظنه ذكره إلا عن ابن عباس، ‏{‏يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن لتذهبوا ببعض ما آتيتموهن‏}‏ قال كانوا إذا مات الرجل كان أولياؤه أحق بامرأته، إن شاء بعضهم تزوجها، وإن شاءوا زوجوها، وإن شاءوا لم يزوجوها، فهم أحق بها من أهلها، فنزلت هذه الآية في ذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     regarding the Divine Verse: \"O you who believe! You are forbidden to inherit women against their will, and you should not treat them with harshness that you may take back part of the (Mahr) dower you have given them.\" (4.19) (Before this revelation) if a man died, his relatives used to have the right to inherit his wife, and one of them could marry her if he would, or they would give her in marriage if they wished, or, if they wished, they would not give her in marriage at all, and they would be more entitled to dispose her, than her own relatives. So the above Verse was revealed in this connection.",
      "usc_msa_ref": "103",
      "chain": [
        "30118",
        "20408",
        "11352",
        "11023"
      ]
    },
    {
      "id": "sahih-bukhari-4642",
      "hadith_no": "4642",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا حجاج، عن ابن جريج، قال أخبرني يعلى، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  ‏{‏إن كان بكم أذى من مطر أو كنتم مرضى‏}‏ قال عبد الرحمن بن عوف كان جريحا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: \"Because of the inconvenience of rain or because you are ill.\" (4.102) (It was revealed in connection with) `Abdur-Rahman bin `Auf who was wounded.",
      "usc_msa_ref": "123",
      "chain": [
        "30118",
        "20219",
        "11070",
        "20372",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4644",
      "hadith_no": "4644",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  ‏{‏وإن امرأة خافت من بعلها نشوزا أو إعراضا‏}‏‏.‏ قالت الرجل تكون عنده المرأة ليس بمستكثر منها يريد أن يفارقها فتقول أجعلك من شأني في حل‏.‏ فنزلت هذه الآية في ذلك‏.‏",
      "text_en": " Narrated `Aisha:                     Regarding the Verse:--\"If a woman fears cruelty or desertion on her husband's part.\" (4.128) It is about a man who has a woman (wife) and he does not like her and wants to divorce her but she says to him, \"I make you free as regards myself.\" So this Verse was revealed in this connection.",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4759",
      "hadith_no": "4759",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا أبو حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة  رضى الله عنه  قال أتي رسول الله صلى الله عليه وسلم بلحم، فرفع إليه الذراع، وكانت تعجبه، فنهس منها نهسة ثم قال ‏\"‏ أنا سيد الناس يوم القيامة، وهل تدرون مم ذلك يجمع الناس الأولين والآخرين في صعيد واحد، يسمعهم الداعي، وينفذهم البصر، وتدنو الشمس، فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون فيقول الناس ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض عليكم بآدم فيأتون آدم عليه السلام فيقولون له أنت أبو البشر خلقك الله بيده‏.‏ ونفخ فيك من روحه، وأمر الملائكة فسجدوا لك، اشفع لنا إلى ربك، ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله، وإنه نهاني عن الشجرة فعصيته، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى نوح، فيأتون نوحا فيقولون يا نوح إنك أنت أول الرسل إلى أهل الأرض، وقد سماك الله عبدا شكورا اشفع لنا إلى ربك، ألا ترى إلى ما نحن فيه فيقول إن ربي عز وجل قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله، وإنه قد كانت لي دعوة دعوتها على قومي نفسي نفسي نفسي اذهبوا إلى غيري، اذهبوا إلى إبراهيم، فيأتون إبراهيم، فيقولون يا إبراهيم، أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله، وإني قد كنت كذبت ثلاث كذبات  فذكرهن أبو حيان في الحديث  نفسي نفسي نفسي، اذهبوا إلى غيري اذهبوا إلى موسى، فيأتون موسى، فيقولون يا موسى أنت رسول الله، فضلك الله برسالته وبكلامه على الناس، اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فيقول إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله، وإني قد قتلت نفسا لم أومر بقتلها، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى عيسى، فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه، وكلمت الناس في المهد صبيا اشفع لنا ألا ترى إلى ما نحن فيه فيقول عيسى إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله  ولم يذكر ذنبا  نفسي نفسي نفسي، اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتون محمدا صلى الله عليه وسلم فيقولون يا محمد أنت رسول الله وخاتم الأنبياء، وقد غفر الله لك ما تقدم من ذنبك وما تأخر، اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فأنطلق فآتي تحت العرش، فأقع ساجدا لربي عز وجل ثم يفتح الله على من محامده وحسن الثناء عليه شيئا لم يفتحه على أحد قبلي ثم يقال يا محمد ارفع رأسك، سل تعطه، واشفع تشفع، فأرفع رأسي، فأقول أمتي يا رب، أمتي يا رب فيقال يا محمد أدخل من أمتك من لا حساب عليهم من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب، ثم قال والذي نفسي بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وحمير، أو كما بين مكة وبصرى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some (cooked) meat was brought to Allah Apostle and the meat of a forearm was presented to him as he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the Day of Resurrection. Do you know the reason for it? Allah will gather all the human being of early generations as well as late generation on one plain so that the announcer will be able to make them all-hear his voice and the watcher will be able to see all of them. The sun will come so close to the people that they will suffer such distress and trouble as they will not be able to bear or stand. Then the people will say, 'Don't you see to what state you have reached? Won't you look for someone who can intercede for you with your Lord' Some people will say to some others, 'Go to Adam.' So they will go to Adam and say to him. 'You are the father of mankind; Allah created you with His Own Hand, and breathed into you of His Spirit (meaning the spirit which he created for you); and ordered the angels to prostrate before you; so (please) intercede for us with your Lord. Don't you see in what state we are? Don't you see what condition we have reached?' Adam will say, 'Today my Lord has become angry as He has never become before, nor will ever become thereafter. He forbade me (to eat of the fruit of) the tree, but I disobeyed Him . Myself! Myself! Myself! (I am preoccuied with my own problems). Go to someone else; go to Noah.' So they will go to Noah and say (to him), 'O Noah! You are the first (of Allah's Messengers) to the people of the earth, and Allah has named you a thankful slave; please intercede for us with your Lord. Don't you see in what state we are?' He will say.' Today my Lord has become angry as He has never become nor will ever become thereafter. I had (in the world) the right to make one definitely accepted invocation, and I made it against my nation. Myself! Myself! Myself! Go to someone else; go to Abraham.' They will go to Abraham and say, 'O Abraham! You are Allah's Apostle and His Khalil from among the people of the earth; so please intercede for us with your Lord. Don't you see in what state we are?' He will say to them, 'My Lord has today become angry as He has never become before, nor will ever become thereafter. I had told three lies (Abu Haiyan (the sub-narrator) mentioned them in the Hadith) Myself! Myself! Myself! Go to someone else; go to Moses.' The people will then go to Moses and say, 'O Moses! You art Allah's Apostle and Allah gave you superiority above the others with this message and with His direct Talk to you; (please) intercede for us with your Lord Don't you see in what state we are?' Moses will say, 'My Lord has today become angry as He has never become before, nor will become thereafter, I killed a person whom I had not been ordered to kill. Myself! Myself! Myself! Go to someone else; go to Jesus.' So they will go to Jesus and say, 'O Jesus! You are Allah's Apostle and His Word which He sent to Mary, and a superior soul created by Him, and you talked to the people while still young in the cradle. Please intercede for us with your Lord. Don't you see in what state we are?' Jesus will say. 'My Lord has today become angry as He has never become before nor will ever become thereafter. Jesus will not mention any sin, but will say, 'Myself! Myself! Myself! Go to someone else; go to Muhammad.' So they will come to me and say, 'O Muhammad ! You are Allah's Apostle and the last of the prophets, and Allah forgave your early and late sins. (Please) intercede for us with your Lord. Don't you see in what state we are?\" The Prophet added, \"Then I will go beneath Allah's Throne and fall in prostration before my Lord. And then Allah will guide me to such praises and glorification to Him as He has never guided anybody else before me. Then it will be said, 'O Muhammad Raise your head. Ask, and it will be granted. Intercede and It (your intercession) will be accepted.' So I will raise my head and Say, 'My followers, O my Lord! My followers, O my Lord'. It will be said, 'O Muhammad! Let those of your followers who have no accounts, enter through such a gate of the gates of Paradise as lies on the right; and they will share the other gates with the people.\" The Prophet further said, \"By Him in Whose Hand my soul is, the distance between every two gate-posts of Paradise is like the distance between Mecca and Busra (in Sham).",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4820",
      "hadith_no": "4820",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا يعلى، حدثنا سفيان العصفري، عن عكرمة، عن ابن عباس، ‏{‏لرادك إلى معاد‏}‏ قال إلى مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Qur'an 28.85'...will bring you home' means to Mecca.",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20372",
        "11023"
      ]
    },
    {
      "id": "sahih-bukhari-5247",
      "hadith_no": "5247",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ لا تصوم المرأة وبعلها شاهد إلا بإذنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A woman should not fast (optional fasts) except with her husband's permission if he is at home (staying with her).",
      "usc_msa_ref": "120",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5254",
      "hadith_no": "5254",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله ألم أخبر أنك تصوم النهار وتقوم الليل ‏\"‏‏.‏ قلت بلى يا رسول الله‏.‏ قال ‏\"‏ فلا تفعل، صم وأفطر، وقم ونم، فإن لجسدك عليك حقا، وإن لعينك عليك حقا، وإن لزوجك عليك حقا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle said, \"O `Abdullah! Have I not been formed that you fast all the day and stand in prayer all night?\" I said, \"Yes, O Allah's Apostle!\" He said, \"Do not do that! Observe the fast sometimes and also leave them (the fast) at other times; stand up for the prayer at night and also sleep at night. Your body has a right over you, your eyes have a right over you and your wife has a right over you.\"",
      "usc_msa_ref": "127",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-5257",
      "hadith_no": "5257",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج،‏.‏ وحدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا ابن جريج، قال أخبرني يحيى بن عبد الله بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة أخبرته أن النبي صلى الله عليه وسلم حلف لا يدخل على بعض أهله شهرا، فلما مضى تسعة وعشرون يوما غدا عليهن أو راح فقيل له يا نبي الله حلفت أن لا تدخل عليهن شهرا قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet took an oath that he would not enter upon some of his wives for one month. But when twenty nine days had elapsed, he went to them in the morning or evening. It was said to him, \"O Allah's Prophet! You had taken an oath that you would not enter upon them for one month.\" He replied, \"The month can be of twenty nine days.\"",
      "usc_msa_ref": "130",
      "chain": [
        "20241",
        "30118",
        "20025",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5299",
      "hadith_no": "5299",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا عاصم بن سليمان، عن الشعبي، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أطال أحدكم الغيبة فلا يطرق أهله ليلا ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"When anyone of you is away from his house for a long time, he should not return to his family at night.\"",
      "usc_msa_ref": "171",
      "chain": [
        "30118",
        "20025",
        "11080",
        "11052",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-5413",
      "hadith_no": "5413",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا يونس، عن ابن شهاب، أخبرني عروة، أن عائشة  رضى الله عنها  قالت جاءت هند بنت عتبة فقالت يا رسول الله إن أبا سفيان رجل مسيك، فهل على حرج أن أطعم من الذي له عيالنا قال ‏\"‏ لا إلا بالمعروف ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Hind bint `Utba came and said, \"O Allah's Apostle! Abu Sufyan is a miser so is it sinful of me to feed our children from his property?\" Allah's Apostle said, \"No except if you take for your needs what is just and reasonable. \"",
      "usc_msa_ref": "272",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5445",
      "hadith_no": "5445",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني أبو أمامة بن سهل بن حنيف الأنصاري، أن ابن عباس، أخبره أن خالد بن الوليد الذي يقال له سيف الله أخبره أنه، دخل مع رسول الله صلى الله عليه وسلم على ميمونة  وهى خالته وخالة ابن عباس  فوجد عندها ضبا محنوذا، قدمت به أختها حفيدة بنت الحارث من نجد، فقدمت الضب لرسول الله صلى الله عليه وسلم وكان قلما يقدم يده لطعام حتى يحدث به ويسمى له، فأهوى رسول الله صلى الله عليه وسلم يده إلى الضب، فقالت امرأة من النسوة الحضور أخبرن رسول الله صلى الله عليه وسلم ما قدمتن له، هو الضب يا رسول الله‏.‏ فرفع رسول الله صلى الله عليه وسلم يده عن الضب، فقال خالد بن الوليد أحرام الضب يا رسول الله قال ‏\"‏ لا ولكن لم يكن بأرض قومي فأجدني أعافه ‏\"‏‏.‏ قال خالد فاجتررته فأكلته ورسول الله صلى الله عليه وسلم ينظر إلى‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     That he went with Allah's Apostle to the house of Maimuna, who was his and Ibn `Abbas' aunt. He found with her a roasted mastigure which her sister Hufaida bint Al-Harith had brought from Najd. Maimuna presented the mastigure before Allah's Apostle who rarely started eating any (unfamiliar) food before it was described and named for him. (But that time) Allah's Apostle stretched his hand towards the (meat of the) mastigure whereupon a lady from among those who were present, said, \"You should inform Allah's Apostle of what you have presented to him. O Allah's Apostle! It is the meat of a mastigure.\" (On learning that) Allah's Apostle withdrew his hand from the meat of the mastigure. Khalid bin Al-Walid said, \"O Allah's Apostle! Is this unlawful to eat?\" Allah's Apostle replied, \"No, but it is not found in the land of my people, so I do not like it.\" Khalid said, \"Then I pulled the mastigure (meat) towards me and ate it while Allah's Apostle was looking at me.",
      "usc_msa_ref": "303",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "17",
        "22"
      ]
    },
    {
      "id": "sahih-bukhari-5477",
      "hadith_no": "5477",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن جعفر بن عمرو بن أمية الضمري، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يحتز من كتف شاة، فأكل منها، فدعي إلى الصلاة، فقام فطرح السكين فصلى، ولم يتوضأ‏.‏",
      "text_en": " Narrated `Amr bin Umaiyay Ad-Damri:                     I saw Allah's Apostle cutting part of the shoulder of mutton with a knife. He ate of it and then was called for prayer whereupon he got up and put down the knife and offered the prayer without performing new ablution.",
      "usc_msa_ref": "333",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11013",
        "11501"
      ]
    },
    {
      "id": "sahih-bukhari-5505",
      "hadith_no": "5505",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر  رضى الله عنهما  قال رأيت رسول الله صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far:                     I saw Allah's Apostle eating fresh dates with snake cucumbers.",
      "usc_msa_ref": "360",
      "chain": [
        "30118",
        "20025",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sahih-bukhari-5686",
      "hadith_no": "5686",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال حدثني عبيد الله بن عبد الله، أنه سمع أبا سعيد الخدري، يقول سمعت رسول الله صلى الله عليه وسلم ينهى عن اختناث الأسقية‏.‏ قال عبد الله قال معمر أو غيره هو الشرب من أفواهها‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle forbidding the drinking of water by bending the mouths of water skins, i.e., drinking from the mouths directly.",
      "usc_msa_ref": "530",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "11004",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-5758",
      "hadith_no": "5758",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا حميد الطويل، عن أنس  رضى الله عنه  أنه سئل عن أجر الحجام، فقال احتجم رسول الله صلى الله عليه وسلم حجمه أبو طيبة، وأعطاه صاعين من طعام، وكلم مواليه فخففوا عنه، وقال ‏\"‏ إن أمثل ما تداويتم به الحجامة والقسط البحري ‏\"‏‏.‏ وقال ‏\"‏ لا تعذبوا صبيانكم بالغمز من العذرة، وعليكم بالقسط ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     that he was asked about the wages of the one who cups others. He said, 'Allah's Apostle was cupped by `Abd Taiba, to whom he gave two Sa of food and interceded for him with his masters who consequently reduced what they used to charge him daily. Then the Prophet s said, \"The best medicines you may treat yourselves with are cupping and sea incense.' He added, \"You should not torture your children by treating tonsillitis by pressing the tonsils or the palate with the finger, but use incense.\"",
      "usc_msa_ref": "599",
      "chain": [
        "30118",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5899",
      "hadith_no": "5899",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن أشعث بن أبي الشعثاء، حدثنا معاوية بن سويد بن مقرن، عن ابن عازب، قال نهانا النبي صلى الله عليه وسلم عن المياثر الحمر والقسي‏.‏",
      "text_en": " Narrated Ibn Azib:                     The Prophet forbade us to use the red Mayathir and to use Al-Qassiy.",
      "usc_msa_ref": "729",
      "chain": [
        "30118",
        "20025",
        "20012",
        "11324",
        "3117"
      ]
    },
    {
      "id": "sahih-bukhari-6000",
      "hadith_no": "6000",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لعن الله الواصلة والمستوصلة، والواشمة والمستوشمة ‏\"‏‏.‏ قال نافع الوشم في اللثة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Allah has cursed such a lady as lengthens (her or someone else's) hair artificially or gets it lengthened, and also a lady who tattoos (herself or someone else) or gets herself tattooed.",
      "usc_msa_ref": "820",
      "chain": [
        "30118",
        "20025",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6006",
      "hadith_no": "6006",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن ابن مسعود  رضى الله عنه  قال لعن الله الواشمات، والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله، ما لي لا ألعن من لعنه رسول الله صلى الله عليه وسلم وهو في كتاب الله‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     Allah has cursed those women who practise tattooing or get it done for themselves, and those who remove hair from their faces, and those who create spaces between their teeth artificially to look beautiful, such ladies as change the features created by Allah. Why then shall I not curse those whom Allah's Apostle has cursed and who are cursed in Allah's Book too?",
      "usc_msa_ref": "826",
      "chain": [
        "30118",
        "20025",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-6234",
      "hadith_no": "6234",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه أن رجلا، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله هلكت‏.‏ قال ‏\"‏ ويحك ‏\"‏‏.‏ قال وقعت على أهلي في رمضان‏.‏ قال ‏\"‏ أعتق رقبة ‏\"‏‏.‏ قال ما أجدها‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏‏.‏ قال لا أستطيع‏.‏ قال ‏\"‏ فأطعم ستين مسكينا ‏\"‏‏.‏ قال ما أجد‏.‏ فأتي بعرق فقال ‏\"‏ خذه فتصدق به ‏\"‏‏.‏ فقال يا رسول الله أعلى غير أهلي فوالذي نفسي بيده ما بين طنبى المدينة أحوج مني‏.‏ فضحك النبي صلى الله عليه وسلم حتى بدت أنيابه قال ‏\"‏ خذه ‏\"‏‏.‏ تابعه يونس عن الزهري‏.‏ وقال عبد الرحمن بن خالد عن الزهري ويلك‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! I am ruined!\" The Prophet said, \"Waihaka (May Allah be merciful to you) !\" The man said, \"I have done sexual intercourse with my wife while fasting in Ramadan.\" The Prophet said, \"Manumit a slave.\" The man said, \" I cannot afford that. \" The Prophet said; \"Then fast for two successive months.\" The man said, \" I have no power to do so.\" The Prophet said, \"Then feed sixty poor persons.\" The man said, \"I have nothing (to feed sixty persons). Later a basket full of dates were brought to the Prophet and he said (to the man), \"Take it and give it in charity.\" The man said, \"O Allah's Apostle! Shall I give it to people other than my family? By Him in Whose Hand my life is, there is nobody poorer than me in the whole city of Medina.\" The Prophet smiled till his premolar teeth became visible, and said, \"Take it.\" Az-Zuhri said (that the Prophet said). \"Wailaka.\"",
      "usc_msa_ref": "185",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6303",
      "hadith_no": "6303",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسلم الصغير على الكبير، والمار على القاعد، والقليل على الكثير ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The young should greet the old, the passer by should greet the sitting one, and the small group of persons should greet the large group of persons. \"",
      "usc_msa_ref": "250",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6319",
      "hadith_no": "6319",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو نعيم، حدثنا عمر بن ذر،‏.‏ وحدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا عمر بن ذر، أخبرنا مجاهد، عن أبي هريرة  رضى الله عنه  قال دخلت مع رسول الله صلى الله عليه وسلم فوجد لبنا في قدح فقال ‏\"‏ أبا هر الحق أهل الصفة فادعهم إلى ‏\"‏‏.‏ قال فأتيتهم فدعوتهم، فأقبلوا فاستأذنوا فأذن لهم، فدخلوا‏.‏",
      "text_en": " Narrated Abu Huraira:                     I entered (the house) along with Allah's Apostle . There he found milk in a basin. He said, \"O Abu Hirr! Go and call the people of Suffa to me.\" I went to them and invited them. They came and asked permission to enter, and when it was given, they entered. (See Hadith No. 459 for details)",
      "usc_msa_ref": "263",
      "chain": [
        "20348",
        "30118",
        "20025",
        "11642",
        "11028",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6322",
      "hadith_no": "6322",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة هذا جبريل يقرأ عليك السلام ‏\"‏‏.‏ قالت قلت وعليه السلام ورحمة الله، ترى ما لا نرى‏.‏ تريد رسول الله صلى الله عليه وسلم‏.‏ تابعه شعيب‏.‏ وقال يونس والنعمان عن الزهري وبركاته‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"O `Aisha! This is Gabriel sending his greetings to you.\" I said, \"Peace, and Allah's Mercy be on him (Gabriel). You see what we do not see.\" (She was addressing Allah's Apostle).",
      "usc_msa_ref": "266",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6333",
      "hadith_no": "6333",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة، أن ابن عباس، أخبره أن أبا سفيان بن حرب أخبره أن هرقل أرسل إليه في نفر من قريش وكانوا تجارا بالشأم، فأتوه فذكر الحديث قال ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرئ فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم، من محمد عبد الله ورسوله إلى هرقل عظيم الروم، السلام على من اتبع الهدى، أما بعد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sufyan bin Harb:                     that Heraclius had sent for him to come along with a group of the Quraish who were trading in Sha'm, and they came to him. Then Abu Sufyan mentioned the whole narration and said, \"Heraclius asked for the letter of Allah's Apostle . When the letter was read, its contents were as follows: 'In the name of Allah, the Beneficent, the Merciful. From Muhammad, Allah's slave and His Apostle to Heraclius, the Chief of Byzantines: Peace be upon him who follows the right path (guidance)! Amma ba'du (to proceed )...' (See Hadith No 6, Vol 1 for details)",
      "usc_msa_ref": "277",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6484",
      "hadith_no": "6484",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا سليمان التيمي، عن أبي عثمان، عن أبي موسى الأشعري، قال أخذ النبي صلى الله عليه وسلم في عقبة  أو قال في ثنية، قال  فلما علا عليها رجل نادى فرفع صوته لا إله إلا الله والله أكبر‏.‏ قال ورسول الله صلى الله عليه وسلم على بغلته قال ‏\"‏ فإنكم لا تدعون أصم ولا غائبا ‏\"‏‏.‏ ثم قال ‏\"‏ يا أبا موسى  أو يا عبد الله ألا أدلك على كلمة من كنز الجنة ‏\"‏‏.‏ قلت بلى‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet started ascending a high place or hill. A man (amongst his companions) ascended it and shouted in a loud voice, \"La ilaha illal-lahu wallahu Akbar.\" (At that time) Allah's Apostle was riding his mule. Allah's Apostle said, \"You are not calling upon a deaf or an absent one.\" and added, \"O Abu Musa (or, O `Abdullah)! Shall I tell you a sentence from the treasure of Paradise?\" I said, \"Yes.\" He said, \"La haul a wala quwwata illa billah,\"",
      "usc_msa_ref": "418",
      "chain": [
        "30118",
        "20025",
        "11289",
        "11113",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-6598",
      "hadith_no": "6598",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، حدثني سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يقبض الله الأرض، ويطوي السماء بيمينه، ثم يقول أنا الملك أين ملوك الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah will take the whole earth (in His Hand) and will roll up the Heaven in His right Hand, and then He will say, \"I am King! Where are the kings of the earth ? \"",
      "usc_msa_ref": "526",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6690",
      "hadith_no": "6690",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثني محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا خالد الحذاء، عن أبي عثمان النهدي، عن أبي موسى، قال كنا مع رسول الله صلى الله عليه وسلم في غزاة فجعلنا لا نصعد شرفا، ولا نعلو شرفا، ولا نهبط في واد، إلا رفعنا أصواتنا بالتكبير  قال  فدنا منا رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا أيها الناس اربعوا على أنفسكم فإنكم لا تدعون أصم ولا غائبا إنما تدعون سميعا بصيرا ‏\"‏‏.‏ ثم قال ‏\"‏ يا عبد الله بن قيس، ألا أعلمك كلمة هي من كنوز الجنة، لا حول ولا قوة إلا بالله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     While we were with Allah's Apostle in a holy battle, we never went up a hill or reached its peak or went down a valley but raised our voices with Takbir. Allah's Apostle came close to us and said, \"O people! Don't exert yourselves, for you do not call a deaf or an absent one, but you call the All- Listener, the All-Seer.\" The Prophet then said, \"O `Abdullah bin Qais! Shall I teach you a sentence which is from the treasures of Paradise? ( It is): 'La haula wala quwata illa billah. (There is neither might nor power except with Allah).",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11282",
        "11113",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-6699",
      "hadith_no": "6699",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن سالم، عن عبد الله، قال كثيرا مما كان النبي صلى الله عليه وسلم يحلف ‏(‏لا ومقلب القلوب‏)‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When taking an oath, the Prophet very often used to say, \"No, by Him Who turns the hearts.\"",
      "usc_msa_ref": "614",
      "chain": [
        "30118",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6703",
      "hadith_no": "6703",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة، أن أبا بكر  رضى الله عنه  لم يكن يحنث في يمين قط، حتى أنزل الله كفارة اليمين وقال لا أحلف على يمين فرأيت غيرها خيرا منها، إلا أتيت الذي هو خير، وكفرت عن يميني‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr As-Siddiq had never broken his oaths till Allah revealed the expiation for the oaths. Then he said, \"If I take an oath to do something and later on I find something else better than the first one, then I do what is better and make expiation for my oath.\"",
      "usc_msa_ref": "618",
      "chain": [
        "30118",
        "20025",
        "11065",
        "10511",
        "53",
        "20436"
      ]
    },
    {
      "id": "sahih-bukhari-6756",
      "hadith_no": "6756",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا النضر، أخبرنا شعبة، حدثنا فراس، قال سمعت الشعبي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر الإشراك بالله، وعقوق الوالدين، وقتل النفس، واليمين الغموس ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"The biggest sins are: To join others in worship with Allah; to be undutiful to one's parents; to kill somebody unlawfully; and to take an oath Al-Ghamus.",
      "usc_msa_ref": "667",
      "chain": [
        "30118",
        "20291",
        "20020",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-6767",
      "hadith_no": "6767",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا إسماعيل بن أبي خالد، عن الشعبي، عن عكرمة، عن ابن عباس  رضى الله عنهما  عن سودة، زوج النبي صلى الله عليه وسلم قالت ماتت لنا شاة فدبغنا مسكها ثم ما زلنا ننبذ فيه حتى صارت شنا‏.‏",
      "text_en": " Narrated Sauda:                     (the wife of the Prophet) One of our sheep died and we tanned its skin and kept on infusing dates in it till it was a worn out water skin.",
      "usc_msa_ref": "677",
      "chain": [
        "30118",
        "20025",
        "11418",
        "11052",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6780",
      "hadith_no": "6780",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن عمر، قال يا رسول الله إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام‏.‏ قال ‏\"‏ أوف بنذرك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar said \"O Allah's Apostle! I vowed to perform I`tikaf for one night in Al-Masjid-al-Haram, during the Pre-Islamic Period of ignorance (before embracing Islam). \"The Prophet said, \"Fulfill your vow.\" Ibn `Umar said to the lady, \"Pray on her behalf.\" Ibn `Abbas said the same.",
      "usc_msa_ref": "688",
      "chain": [
        "30118",
        "20025",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-6881",
      "hadith_no": "6881",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة، قالت لم تكن تقطع يد السارق في أدنى من حجفة أو ترس، كل واحد منهما ذو ثمن‏.‏ رواه وكيع وابن إدريس عن هشام عن أبيه مرسلا‏.‏",
      "text_en": " Narrated `Aisha:                     A thief's hand was not cut off for stealing something cheaper than a Hajafa or a Turs (two kinds of shields), each of which was worth a (respectable) price.",
      "usc_msa_ref": "785",
      "chain": [
        "30118",
        "20025",
        "11065",
        "10511",
        "53",
        "20295"
      ]
    },
    {
      "id": "sahih-bukhari-6903",
      "hadith_no": "6903",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا يونس، عن ابن شهاب، قال حدثني أبو سلمة بن عبد الرحمن، عن جابر بن عبد الله الأنصاري، أن رجلا، من أسلم أتى رسول الله صلى الله عليه وسلم فحدثه أنه قد زنى، فشهد على نفسه أربع شهادات، فأمر به رسول الله صلى الله عليه وسلم فرجم، وكان قد أحصن‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     A man from the tribe of Bani Aslam came to Allah's Apostle and Informed him that he had committed illegal sexual intercourse and bore witness four times against himself. Allah's Apostle ordered him to be stoned to death as he was a married Person.",
      "usc_msa_ref": "805",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-7012",
      "hadith_no": "7012",
      "source": "Sahih Bukhari",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا شعبة، عن هشام بن زيد بن أنس بن مالك، قال سمعت أنس بن مالك، يقول مر يهودي برسول الله صلى الله عليه وسلم فقال السام عليك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وعليك ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتدرون ما يقول قال السام عليك ‏\"‏‏.‏ قالوا يا رسول الله ألا نقتله قال ‏\"‏ لا، إذا سلم عليكم أهل الكتاب فقولوا وعليكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jew passed by Allah's Apostle and said, \"As-Samu 'Alaika.\" Allah's Apostle said in reply, \"We 'Alaika.\" Allah's Apostle then said to his companions, \"Do you know what he (the Jew) has said? He said, 'As-Samu 'Alaika.'\" They said, \"O Allah's Apostle! Shall we kill him?\" The Prophet, said, \"No. When the people of the Book greet you, say: 'Wa 'Alaikum.'\"",
      "usc_msa_ref": "60",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-7247",
      "hadith_no": "7247",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود الأنصاري، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، إني والله لأتأخر عن صلاة الغداة من أجل فلان، مما يطيل بنا فيها‏.‏ قال فما رأيت النبي صلى الله عليه وسلم قط أشد غضبا في موعظة منه يومئذ، ثم قال ‏\"‏ يا أيها الناس، إن منكم منفرين، فأيكم ما صلى بالناس فليوجز، فإن فيهم الكبير والضعيف وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! By Allah, I fail to attend the morning congregational prayer because so-and-so (i.e., Mu`adh bin Jabal) prolongs the prayer when he leads us for it.\" I had never seen the Prophet more furious in giving advice than he was on that day. He then said, \"O people! some of you make others dislike (good deeds, i.e. prayers etc). So whoever among you leads the people in prayer, he should shorten it because among them there are the old, the weak and the busy (needy having some jobs to do). (See Hadith No. 90, Vol. 1)",
      "usc_msa_ref": "273",
      "chain": [
        "30118",
        "20025",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-7388",
      "hadith_no": "7388",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا وكيع، عن نافع بن عمر، عن ابن أبي مليكة، قال كاد الخيران أن يهلكا أبو بكر، وعمر، لما قدم على النبي صلى الله عليه وسلم وفد بني تميم، أشار أحدهما بالأقرع بن حابس الحنظلي أخي بني مجاشع، وأشار الآخر بغيره، فقال أبو بكر لعمر إنما أردت خلافي‏.‏ فقال عمر ما أردت خلافك‏.‏ فارتفعت أصواتهما عند النبي صلى الله عليه وسلم فنزلت ‏{‏يا أيها الذين آمنوا لا ترفعوا أصواتكم‏}‏ إلى قوله ‏{‏عظيم‏}‏‏.‏ قال ابن أبي مليكة قال ابن الزبير فكان عمر بعد  ولم يذكر ذلك عن أبيه يعني أبا بكر  إذا حدث النبي صلى الله عليه وسلم بحديث حدثه كأخي السرار، لم يسمعه حتى يستفهمه‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     Once the two righteous men, i.e., Abu Bakr and `Umar were on the verge of destruction (and that was because): When the delegate of Bani Tamim came to the Prophet, one of them (either Abu Bakr or `Umar) recommended Al-Aqra' bin H`Abis at-Tamimi Al-Hanzali, the brother of Bani Majashi (to be appointed as their chief), while the other recommended somebody else. Abu Bakr said to `Umar, \"You intended only to oppose me.\" `Umar said, \"I did not intend to oppose you!\" Then their voices grew louder in front of the Prophet whereupon there was revealed: 'O you who believe! Do not raise your voices above the voice of the Prophet..a great reward.' (49.2-3) Ibn Az-Zubair said, 'Thence forward when `Umar talked to the Prophet, he would talk like one who whispered a secret and would even fail to make the Prophet hear him, in which case the Prophet would ask him (to repeat his words).",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20032",
        "20203",
        "11090"
      ]
    }
  ],
  "total_hadiths": 74
}