{
  "id": "30128",
  "name": "Hamd bin 'Umar bin Hafs حامد بن عمر بن حفص",
  "full_name": "Hamd bin 'Umar bin Hafs حامد بن عمر بن حفص",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "233",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "Judge",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "24041",
      "name": "Bkar bin 'Abdul 'Aziz بكار بن عبد العزيز بن أبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30327",
      "name": "al-Husain bin Muhammad bin Ziyad الحسين بن محمد بن زياد",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "479",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا حامد بن عمر، عن بشر، حدثنا عاصم، حدثنا واقد، عن أبيه، عن ابن عمر، أو ابن عمرو شبك النبي صلى الله عليه وسلم أصابعه‏.‏",
      "text_en": " Narrated Ibn `Umar or Ibn `Amr:                     The Prophet clasped his hands, by interlacing his fingers.",
      "chain": [
        "30128",
        "20212",
        "11080",
        "19124"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا حامد بن عمر، عن حماد بن زيد، عن أيوب، عن محمد، أن أنس بن مالك، قال إن رسول الله صلى الله عليه وسلم صلى يوم النحر، ثم خطب فأمر من ذبح قبل الصلاة أن يعيد ذبحه فقام رجل من الأنصار فقال يا رسول الله، جيران لي  إما قال بهم خصاصة، وإما قال بهم فقر  وإني ذبحت قبل الصلاة وعندي عناق لي أحب إلى من شاتى لحم‏.‏ فرخص له فيها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle offered the prayer on the day of Nahr and then delivered the Khutba and ordered that whoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter another sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Apostle! because of my neighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a young she-goat which, in my opinion, is better than two sheep.\" The Prophet gave him the permission for slaughtering it as a sacrifice.",
      "chain": [
        "30128",
        "20022",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "1258",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حامد بن عمر، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أم عطية، قالت توفيت إحدى بنات النبي صلى الله عليه وسلم فخرج، فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن بماء وسدر، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا آذناه، فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏   وعن أيوب، عن حفصة، عن أم عطية  رضى الله عنهما  بنحوه وقالت إنه قال ‏\"‏ اغسلنها ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ‏\"‏‏.‏ قالت حفصة قالت أم عطية  رضى الله عنها  وجعلنا رأسها ثلاثة قرون‏.‏",
      "text_en": " Narrated Muhammad:                     Um 'Atiyya said, \"One of the daughters of the Prophet died and he came out and said, 'Wash her three or five times or more, if you think it necessary, with water and Sidr, and last of all put camphor (or some camphor) and when you finish, inform me.' \" Um Atiyya added, \"When we finished we informed him and he gave us his waist-sheet and said, 'Shroud her in it.' \" And Um 'Atiyya (in another narration) added, \"The Prophet said, 'Wash her three, five or seven times or more, if you think it necessary.' \" Hafsa said that Um 'Atiyya had also said, \"We entwined her hair into three braids.\"",
      "chain": [
        "30128",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "2587",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا حامد بن عمر، حدثنا أبو عوانة، عن حصين، عن عامر، قال سمعت النعمان بن بشير  رضى الله عنهما  وهو على المنبر يقول أعطاني أبي عطية، فقالت عمرة بنت رواحة لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم‏.‏ فأتى رسول الله صلى الله عليه وسلم فقال إني أعطيت ابني من عمرة بنت رواحة عطية، فأمرتني أن أشهدك يا رسول الله‏.‏ قال ‏\"‏ أعطيت سائر ولدك مثل هذا ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فاتقوا الله، واعدلوا بين أولادكم ‏\"‏‏.‏ قال فرجع فرد عطيته‏.‏",
      "text_en": " Narrated 'Amir:                     I heard An-Nu`man bin Bashir on the pulpit saying, \"My father gave me a gift but `Amra bint Rawaha (my mother) said that she would not agree to it unless he made Allah's Apostle as a witness to it. So, my father went to Allah's Apostle and said, 'I have given a gift to my son from `Amra bint Rawaha, but she ordered me to make you as a witness to it, O Allah's Apostle!' Allah's Apostle asked, 'Have you given (the like of it) to everyone of your sons?' He replied in the negative. Allah's Apostle said, 'Be afraid of Allah, and be just to your children.' My father then returned and took back his gift.\"",
      "chain": [
        "30128",
        "20469",
        "15097",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3986",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني حامد بن عمر، عن بشر بن المفضل، حدثنا حميد، حدثنا أنس، أن عبد الله بن سلام، بلغه مقدم النبي صلى الله عليه وسلم المدينة، فأتاه يسأله عن أشياء، فقال إني سائلك عن ثلاث لا يعلمهن إلا نبي ما أول أشراط الساعة وما أول طعام يأكله أهل الجنة وما بال الولد ينزع إلى أبيه أو إلى أمه قال ‏\"‏ أخبرني به جبريل آنفا ‏\"‏‏.‏ قال ابن سلام ذاك عدو اليهود من الملائكة‏.‏ قال ‏\"‏ أما أول أشراط الساعة فنار تحشرهم من المشرق إلى المغرب، وأما أول طعام يأكله أهل الجنة، فزيادة كبد الحوت، وأما الولد، فإذا سبق ماء الرجل ماء المرأة نزع الولد، وإذا سبق ماء المرأة ماء الرجل نزعت الولد ‏\"‏‏.‏ قال أشهد أن لا إله إلا الله وأنك رسول الله‏.‏ قال يا رسول الله، إن اليهود قوم بهت، فاسألهم عني قبل أن يعلموا بإسلامي، فجاءت اليهود فقال النبي صلى الله عليه وسلم ‏\"‏ أى رجل عبد الله بن سلام فيكم ‏\"‏‏.‏ قالوا خيرنا وابن خيرنا وأفضلنا وابن أفضلنا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أرأيتم إن أسلم عبد الله بن سلام ‏\"‏‏.‏ قالوا أعاذه الله من ذلك‏.‏ فأعاد عليهم، فقالوا مثل ذلك، فخرج إليهم عبد الله فقال أشهد أن لا إله إلا الله وأن محمدا رسول الله‏.‏ قالوا شرنا وابن شرنا‏.‏ وتنقصوه‏.‏ قال هذا كنت أخاف يا رسول الله‏.‏",
      "text_en": " Narrated Anas:                     When the news of the arrival of the Prophet at Medina reached `Abdullah bin Salam, he went to him to ask him about certain things, He said, \"I am going to ask you about three things which only a Prophet can answer: What is the first sign of The Hour? What is the first food which the people of Paradise will eat? Why does a child attract the similarity to his father or to his mother?\" The Prophet replied, \"Gabriel has just now informed me of that.\" Ibn Salam said, \"He (i.e. Gabriel) is the enemy of the Jews amongst the angels. The Prophet said, \"As for the first sign of The Hour, it will be a fire that will collect the people from the East to the West. As for the first meal which the people of Paradise will eat, it will be the caudate (extra) lobe of the fish-liver. As for the child, if the man's discharge proceeds the woman's discharge, the child attracts the similarity to the man, and if the woman's discharge proceeds the man's, then the child attracts the similarity to the woman.\" On this, `Abdullah bin Salam said, \"I testify that None has the right to be worshipped except Allah, and that you are the Apostle of Allah.\" and added, \"O Allah's Apostle! Jews invent such lies as make one astonished, so please ask them about me before they know about my conversion to I slam . \" The Jews came, and the Prophet said, \"What kind of man is `Abdullah bin Salam among you?\" They replied, \"The best of us and the son of the best of us and the most superior among us, and the son of the most superior among us. \"The Prophet said, \"What would you think if `Abdullah bin Salam should embrace Islam?\" They said, \"May Allah protect him from that.\" The Prophet repeated his question and they gave the same answer. Then `Abdullah came out to them and said, \"I testify that None has the right to be worshipped except Allah and that Muhammad is the Apostle of Allah!\" On this, the Jews said, \"He is the most wicked among us and the son of the most wicked among us.\" So they degraded him. On this, he (i.e. `Abdullah bin Salam) said, \"It is this that I was afraid of, O Allah's Apostle.",
      "chain": [
        "30128",
        "20212",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وحامد بن عمر البكراوي، قالا حدثنا بشر بن المفضل، عن خالد، عن عبد الله بن شقيق، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من نومه فلا يغمس يده في الإناء حتى يغسلها ثلاثا فإنه لا يدري أين باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.",
      "chain": [
        "30395",
        "30128",
        "20212",
        "11282",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، وأبو كامل فضيل بن حسين الجحدري كلاهما عن أبي عوانة، - قال حامد حدثنا أبو عوانة، - عن هلال بن أبي حميد، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، قال رمقت الصلاة مع محمد صلى الله عليه وسلم فوجدت قيامه فركعته فاعتداله بعد ركوعه فسجدته فجلسته بين السجدتين فسجدته فجلسته ما بين التسليم والانصراف قريبا من السواء ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported:                      I noticed the prayer of Muhammad (may peace be upon him) and saw his Qiyam (standing), his bowing, and then going back to the standing posture after bowing, his prostration, his sitting between the two prostrations, and his prostration and sitting between salutation and going away, all these were nearly equal to one another.",
      "chain": [
        "30128",
        "20469",
        "20469",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر، - يعني ابن المفضل ح قال وحدثنا محمد بن المثنى، حدثني أزهر، جميعا عن ابن عون، عن أبي سعيد، عن وراد، كاتب المغيرة بن شعبة قال كتب معاوية إلى المغيرة ‏.‏ بمثل حديث منصور والأعمش ‏.‏",
      "text_en": " Warrad, the scribe of Mughira b. Shu'ba, reported:                      Mu'awiya wrote to Mughira (the contents) of the hadith as transmitted by Mansur and A'mash.",
      "chain": [
        "30128",
        "20212",
        "30170",
        "11071",
        "38",
        "11402"
      ]
    },
    {
      "hadith_no": "1684",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا حماد يعني ابن زيد، ح وحدثني حامد بن عمر البكراوي، حدثنا عبد الواحد يعني ابن زياد، ح وحدثنا ابن نمير، حدثنا أبو معاوية، كلهم عن عاصم، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا مروان بن معاوية الفزاري، عن عاصم الأحول، عن عبد الله بن سرجس، قال دخل رجل المسجد ورسول الله صلى الله عليه وسلم في صلاة الغداة فصلى ركعتين في جانب المسجد ثم دخل مع رسول الله صلى الله عليه وسلم فلما سلم رسول الله صلى الله عليه وسلم قال ‏\"‏ يا فلان بأى الصلاتين اعتددت أبصلاتك وحدك أم بصلاتك معنا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Sarjis reported:                      A person entered the mosque, while the Messenger of Allah (may peace be upon him) was leading the dawn prayer. He observed two rak'ahs in a corner of the mosque, and then joined the Messenger of Allah (may peace be upon him) in prayer. When the Messenger of Allah (may peace be upon him) had pronounced salutations (he had concluded the prayer), he said: O, so and so, which one out of these two prayers did you count (as your Fard prayer), the one that you observed alone or the prayer that you observed with us?",
      "chain": [
        "30559",
        "20022",
        "30128",
        "20256",
        "30212",
        "11080",
        "30022",
        "20201",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر بن المفضل، حدثنا عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد، أو عن أبي أسيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) by Abu Usaid.",
      "chain": [
        "30128",
        "20212",
        "11894",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "2489",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ، وحامد بن عمر، ومحمد بن عبد الأعلى، قال ابن معاذ حدثنا المعتمر بن سليمان، عن أبيه، قال حدثني السميط، عن أنس بن مالك، قال افتتحنا مكة ثم إنا غزونا حنينا فجاء المشركون بأحسن صفوف رأيت - قال - فصفت الخيل ثم صفت المقاتلة ثم صفت النساء من وراء ذلك ثم صفت الغنم ثم صفت النعم - قال - ونحن بشر كثير قد بلغنا ستة آلاف وعلى مجنبة خيلنا خالد بن الوليد - قال - فجعلت خيلنا تلوي خلف ظهورنا فلم نلبث أن انكشفت خيلنا وفرت الأعراب ومن نعلم من الناس - قال - فنادى رسول الله صلى الله عليه وسلم ‏\"‏ يا للمهاجرين يا للمهاجرين ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا للأنصار يا للأنصار ‏\"‏ ‏.‏ قال قال أنس هذا حديث عمية ‏.‏ قال قلنا لبيك يا رسول الله - قال - فتقدم رسول الله صلى الله عليه وسلم - قال - فايم الله ما أتيناهم حتى هزمهم الله - قال - فقبضنا ذلك المال ثم انطلقنا إلى الطائف فحاصرناهم أربعين ليلة ثم رجعنا إلى مكة فنزلنا - قال - فجعل رسول الله صلى الله عليه وسلم يعطي الرجل المائة من الإبل ‏.‏ ثم ذكر باقي الحديث كنحو حديث قتادة وأبي التياح وهشام بن زيد ‏.‏",
      "text_en": " Anas b. Malik reported:                      We conquered Mecca and then we went on an expedition to Hunain. The polytheists came, forming themselves into the best rows that I have seen. They first formed the rows of cavalry, then those of infantry, and then those of women behind them. Then there were formed the rows of sheep and goats and then of other animals. We were also people large in number, and our (number) had reached six thousand. And on one side Khalid b. Walid was in charge of the cavalry. And our horses at once turned back from our rear. And we could hardly hold our own when our horses were exposed, and the bedouins and the peoplewhom we knew took to their heels. (Seeing this) the Messenger of Allah (may peace be upon him) called thus: 0 refugees,0 refugees. He then. said: 0 Ansar,0 Ansar. (Anas said: This hadith is transmitted by a group of eminent persons.) We said: At thy beck and call are we, Messenger of Allah. The Messenger of Allah (may peace be upon him) then advanced and he (Anas) said: By Allah, we had not yet reached them when Allah defeated them. and we took possession of the wealth and we then marched towards Ta'if, and we besieged them for forty nights. and then came back to Mecca and encamped (at a place), and the Messenger of Allah (may peace be upon him) began to bestow a hundred camels upon each individual. The rest of the hadith is the same.",
      "chain": [
        "30150",
        "30128",
        "30449",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3039",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا حامد بن عمر البكراوي، ومحمد بن أبي بكر المقدمي، قالا حدثنا بشر، بن المفضل حدثنا عمران بن مسلم، عن أبي رجاء، قال قال عمران بن حصين نزلت آية المتعة في كتاب الله - يعني متعة الحج - وأمرنا بها رسول الله صلى الله عليه وسلم ثم لم تنزل آية تنسخ آية متعة الحج ولم ينه عنها رسول الله صلى الله عليه وسلم حتى مات ‏.‏ قال رجل برأيه بعد ما شاء ‏.‏",
      "text_en": "  'Imran b. Husain said:                      There was revealed the verse of Tamattu' in Hajj in the Book of Allah and the Messenger of Allah (may peace be upon him) commanded us to perform it. and then no verse was revealed abrogating the Tamattu' (form of Hajj), and the Messenger of Allah (may peace be upon him) did not forbid to do it till he died. So whatever a person said was his personal opinion.",
      "chain": [
        "30128",
        "30161",
        "20212",
        "11562",
        "11440"
      ]
    },
    {
      "hadith_no": "3084",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني حامد بن عمر البكراوي، حدثنا عبد الواحد، عن عاصم، عن أبي نضرة، قال كنت عند جابر بن عبد الله فأتاه آت فقال إن ابن عباس وابن الزبير اختلفا في المتعتين فقال جابر فعلناهما مع رسول الله صلى الله عليه وسلم ثم نهانا عنهما عمر فلم نعد لهما ‏.",
      "text_en": " Abd Nadra reported:                      While I was in the company of Jibir, a person came and said: There is difference of opinion amomg Ibn Abbas and Ibn Zubair about two Mut'as (benefits, Tamattul in Hajj and temporary marriage with women), whereupon jibir said: We have been doing this during the lifetime of Allah's Messenger (way peace be upon him), and then 'Umar forbade us to do so, and we never resorted to them.",
      "chain": [
        "30128",
        "20256",
        "11080",
        "10721"
      ]
    },
    {
      "hadith_no": "3341",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، وزهير بن حرب، جميعا عن أبي معاوية، ح وحدثني حامد بن عمر، حدثنا عبد الواحد، كلاهما عن عاصم، بهذا الإسناد ‏.‏ مثله غير أن في حديث عبد الواحد في المال والأهل ‏.‏ وفي رواية محمد بن خازم قال يبدأ بالأهل إذا رجع ‏.‏ وفي روايتهما جميعا ‏\"‏ اللهم إني أعوذ بك من وعثاء السفر ‏\"‏ ‏.‏",
      "text_en": " A hadlth like this has been narrated on the authority of Asim With the same chain of transmitters except (this difference) that the hadith transmitted by 'Abd al-Wahid (one of the narrators) the (word)\" property\" precedes the family, and in the hadith transmitted by Mahammad b. Khazim (the word)\" family\" precedes (theword\" Property\" ), on returning home, in the narrations of both the narrators (these words are found):                     \" O Allah I seek refuge with Thee from the hardships of the journey.\"",
      "chain": [
        "30399",
        "30022",
        "20354",
        "30128"
      ]
    },
    {
      "hadith_no": "3389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه حامد بن عمر، حدثنا عبد الواحد، حدثنا عاصم، قال قلت لأنس بن مالك أحرم رسول الله صلى الله عليه وسلم المدينة قال نعم ما بين كذا إلى كذا فمن أحدث فيها حدثا - قال - ثم قال لي هذه شديدة ‏\"‏ من أحدث فيها حدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه يوم القيامة صرفا ولا عدلا ‏\"‏ ‏.‏ قال فقال ابن أنس أو آوى محدثا ‏.‏",
      "text_en": " 'Asim reported:                      I asked Anas b. Malik whether Allah's Messenger (may peace be upon him) had declared Medina as sacred. He said: Yes. (the area) between so and so. He who made any innovation in it, and further said to me: It is something serious to make any innovation in it (and he who does it) there is upon him the curse of Allah, and that of the angels and of all the people, Allah will not accept from him on the Day of Resurrection either obligatory acts or the surpererogatory acts. Ibn Anas said: Or he accommodates an innovator.",
      "chain": [
        "30128",
        "20256",
        "11080"
      ]
    },
    {
      "hadith_no": "3483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا حامد بن عمر البكراوي، حدثنا عبد الواحد، - يعني ابن زياد - عن عاصم، عن أبي نضرة، قال كنت عند جابر بن عبد الله فأتاه آت فقال ابن عباس وابن الزبير اختلفا في المتعتين فقال جابر فعلناهما مع رسول الله صلى الله عليه وسلم ثم نهانا عنهما عمر فلم نعد لهما ‏.‏",
      "text_en": " Abu Nadra reported:                      While I was in the company of Jabir b. Abdullah, a person came to him and said that Ibn 'Abbas and Ibn Zubair differed on the two types of Mut'as (Tamattu' of Hajj 1846 and Tamattu' with women), whereupon Jabir said: We used to do these two during the lifetime of Allah's Messenger (may peace be upon him). Umar then forbade us to do them, and so we did not revert to them.",
      "chain": [
        "30128",
        "20256",
        "11080",
        "10721"
      ]
    },
    {
      "hadith_no": "4703",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، القيسي كلهم عن المعتمر، - واللفظ لابن أبي شيبة - حدثنا معتمر بن سليمان التيمي، عن أبيه، عن أنس، أن رجلا، - وقال حامد وابن عبد الأعلى أن الرجل، - كان يجعل للنبي صلى الله عليه وسلم النخلات من أرضه ‏.‏ حتى فتحت عليه قريظة والنضير فجعل بعد ذلك يرد عليه ما كان أعطاه ‏.‏ قال أنس وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله ما كان أهله أعطوه أو بعضه وكان نبي الله صلى الله عليه وسلم قد أعطاه أم أيمن فأتيت النبي صلى الله عليه وسلم فأعطانيهن فجاءت أم أيمن فجعلت الثوب في عنقي وقالت والله لا نعطيكاهن وقد أعطانيهن ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ يا أم أيمن اتركيه ولك كذا وكذا ‏\"‏ ‏.‏ وتقول كلا والذي لا إله إلا هو ‏.‏ فجعل يقول كذا حتى أعطاها عشرة أمثاله أو قريبا من عشرة أمثاله ‏.‏",
      "text_en": " It has been narrated by Anas that (after his migration to Medina) a person placed at the Prophet's (may peace be upon him) disposal some date-palms growing on his land until the lands of Quraiza and Nadir were conquered. Then he began to return to him whatever he had received. (In this connection) my people told me to approach the Messenger of Allah (may peace be upon him) and ask from him what his people had given him or a portion thereof, but the Messenger of Allah (may peace be upon him) had bestowed those trees upon Umm Aiman. So I came to the Prophet (may peace be upon him) and he gave hem (back) to me. Umm Aiman (also) came (at this time). She put the cloth round my neck and said:                      No, by Allah, we will not give to, you what he has granted to me. The Holy Prophet (may peace be upon him) said: Umm Aiman, let him have them and for you are such and such trees instead. But she said: By Allah, there is no god besides Him. No, never! The Holy Prophet (may peace be upon him) continued saying: (You will get) such and such. until he had granted her ten times or nearly ten times more (than the original gift).",
      "chain": [
        "30201",
        "30128",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4764",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا حامد بن عمر البكراوي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يعلم لي ما فعل أبو جهل ‏\"‏ ‏.‏ بمثل حديث ابن علية وقول أبي مجلز كما ذكره إسماعيل ‏.‏",
      "text_en": " A similar tradition has been transmitted by a different chain of narrators, on the same authority with a slight difference In the wording.",
      "chain": [
        "30128",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4926",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه حامد بن عمر، حدثنا أبو عوانة، عن طارق، عن سعيد بن المسيب، قال كان أبي ممن بايع رسول الله صلى الله عليه وسلم عند الشجرة ‏.‏ قال فانطلقنا في قابل حاجين فخفي علينا مكانها فإن كانت تبينت لكم فأنتم أعلم ‏.‏ وحدثنيه محمد بن رافع، حدثنا أبو أحمد، قال وقرأته على نصر بن علي عن أبي أحمد، حدثنا سفيان، عن طارق بن عبد الرحمن، عن سعيد بن المسيب، عن أبيه، أنهم كانوا عند رسول الله صلى الله عليه وسلم عام الشجرة قال فنسوها من العام المقبل.",
      "text_en": " It has been narrated on the authority of Sa'id b. Musayyab who said:                      My father was one of those who swore fealty to the Messenger of Allah (may peace be upon him) near the tree. When we passed that way next year intending to perform the Hajj, the place of the tree was hidden to us. If you could point out clearly, you would (certainly) be knowing better. It has also been narrated on the authority of Sa'id b. Musayyib who learnt from his father that they were with the Messenger of Allah (may peace be upon him) in the year of the Tree (i. e. in the year of the fealty of God's pleasure sworn under the tree at Hudaibiya), but next year they forgot the spot of the tree.",
      "chain": [
        "30128",
        "20469",
        "11355",
        "11002"
      ]
    },
    {
      "hadith_no": "5053",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا حامد بن عمر البكراوي، حدثنا عبد الواحد، - يعني ابن زياد - حدثنا  عاصم، عن حفصة بنت سيرين، قالت قال لي أنس بن مالك بما مات يحيى بن أبي عمرة قالت قلت بالطاعون ‏.‏ قالت فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون شهادة لكل مسلم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Hafsa daughter of Sirin who said:                      Anas b. Malik asked me the cause of death of Yahya b. 'Abu 'Amra. I said: (He died) of plague. He said: The Messenger of Allah (may peace be upon him) said that death by plague is martyrdom for a Muslim.",
      "chain": [
        "30128",
        "20256",
        "11080",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "5485",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد، الأعلى جميعا عن المعتمر بن سليمان، - واللفظ لابن معاذ - حدثنا المعتمر، حدثنا أبي، عن أبي عثمان، - وحدث أيضا، - عن عبد الرحمن بن أبي بكر، قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏ ‏.‏ فإذا مع رجل صاع من طعام أو نحوه فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية - أو قال - أم هبة ‏\"‏ ‏.‏ فقال لا بل بيع ‏.‏ فاشترى منه شاة فصنعت وأمر رسول الله صلى الله عليه وسلم بسواد البطن أن يشوى ‏.‏ قال وايم الله ما من الثلاثين ومائة إلا حز له رسول الله صلى الله عليه وسلم حزة حزة من سواد بطنها إن كان شاهدا أعطاه وإن كان غائبا خبأ له - قال - وجعل قصعتين فأكلنا منهما أجمعون وشبعنا وفضل في القصعتين فحملته على البعير ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abu Bakr reported:                      We were one hundred and thirty (persons) with Allah's Apostle (may peace be upon him). Allah's Apostle (may peace be upon him) said: Does any one of You possess food? There was a person with (us) who had a sa' of flour or something about that, and it was kneaded. Then a tall polytheist with dishevelled hair came driving his flock of sheep. Thereupon Allah's Apostle (may peace be upon him) said: Would you like to sell it (any one of these goats) or offer it as a gift or a present? He said: No, (I am not prepared to offer as a gift), but I would sell it. He (the Holy Prophet) bought a sheep from him, and it was slaughtered and its meat was prepared, and Allah's Messenger (may peace be upon him) commanded that its liver should be roasted. He (the narrator) said: By Allah, none among one hundred and thirty persons was left whom Allah's Messenger (may peace be upon him) had not given a part out of her liver; if anyone was present he gave it to him. but if he was absent it was set aside for him. And he (the Holy Prophet) filled two bowls (one with soup and the other with mutton) and we all ate out of them to our hearts' content, but (still) some part was (left) in (those) two bowls, and I placed it on the camel- (or words to the same effect).",
      "chain": [
        "30150",
        "30128",
        "20288",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "hadith_no": "5486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، القيسي كلهم عن المعتمر، - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، قال قال أبي حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا ناسا فقراء وإن رسول الله صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثلاثة ومن كان عنده طعام أربعة فليذهب بخامس بسادس ‏\"‏ ‏.‏ أو كما قال ‏.‏ وإن أبا بكر جاء بثلاثة وانطلق نبي الله صلى الله عليه وسلم بعشرة وأبو بكر بثلاثة - قال - فهو وأنا وأبي وأمي - ولا أدري هل قال وامرأتي وخادم بين بيتنا وبيت أبي بكر - قال وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ‏.‏ ثم لبث حتى صليت العشاء ثم رجع فلبث حتى نعس رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله قالت له امرأته ما حبسك عن أضيافك - أو قالت - ضيفك قال أوما عشيتهم قالت أبوا حتى تجيء قد عرضوا عليهم فغلبوهم - قال - فذهبت أنا فاختبأت وقال يا غنثر ‏.‏ فجدع وسب وقال كلوا لا هنيئا ‏.‏ وقال والله لا أطعمه أبدا - قال - فايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها - قال - حتى شبعنا وصارت أكثر مما كانت قبل ذلك فنظر إليها أبو بكر فإذا هي كما هي أو أكثر ‏.‏ قال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرار - قال - فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان - يعني يمينه - ثم أكل منها لقمة ثم حملها إلى رسول الله صلى الله عليه وسلم فأصبحت عنده - قال - وكان بيننا وبين قوم عقد فمضى الأجل فعرفنا اثنا عشر رجلا مع كل رجل منهم أناس الله أعلم كم مع كل رجل إلا أنه بعث معهم فأكلوا منها أجمعون ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rabman b. Abu Bakr reported that the people of Suffa were very poor. Once the Messenger of Allah (may peace be upon him) said (to his Companions):                      He who amongst you has food for two persons should take three (guests with him). and he who has with him food for four persons should take five or six (guests with him for entertaining them). It was (in accordance with these instructions of the Holy Prophet) that Abu Bakr brought three persons, and the Apostle of Allah (may peace be upon him) brought ten persons (as guests to their respective houses). Abu Bakr had brought three persons (he himself, and myself), my father and my mother (along with therm). He (the narrator) said: I do not know whether he also said: My wife and one servant who was common between our house and that of Abu Bakr. Abu Bakr had had his evening meal with Allah's Apostle (may peace be upon him). He stayed here until night prayer had been offered. He then came back (to the house of Allah's Apostle) and stayed there until Allah's Messenger (may peace be upon him) felt drowsy and (Abu Bakr) then came (back to his own house) when (a considerable) part of the night had been over, as Allah had desired. His wife said to him: What held you back from your guests? He said: Oh! have you not served them the evening meal (by this time)? She said: It was in fact served to them. but they refused to eat until you came. He ('Abd al-Rahman) said: I slunk away and bid myself. He (Abu Bakr) said: O, you stupid fellow, and he reprimanded me, and said to the guests: Eat, though it may not be pleasant now. He said: By Allah. I will never eat it He ('Abd al-Rahman) said: By Allah. we did not take a morsel when from beneath that (there appeared) more until they had eaten to their fill, and lo! it was more than what it was before. Abu Bakr saw that and found that it was so or more than that. He said to his wife: Sister of Band Firis, what is th-is? She said: By the coolness of my eyes. it is in excess by three times over the previous one. Then Abu Bakr ate saying: That was from the Satan (viz. his vow for not eating the food). He then took a morsel out of that and then took it (the rest) to the Messenger of Allah (may peace be upon him), and it was kept there until morning, and during (those days) there was a covenant between us and some other people, and the period of covenant was over, and we had appointed twelve officials with every person amongst them. It is Allah only Who knows as to how many people were there with each of them. He sent (this food to them) and all of them ate out of it.",
      "chain": [
        "30150",
        "30128",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "6180",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو الربيع العتكي، وحامد بن عمر، وقتيبة بن سعيد، وأبو كامل جميعا عن حماد بن زيد، قال أبو الربيع حدثنا حماد، حدثنا أيوب، عن أبي قلابة، عن أنس، قال كان رسول الله صلى الله عليه وسلم في بعض أسفاره وغلام أسود يقال له أنجشة يحدو فقال له رسول الله صلى الله عليه وسلم ‏\"‏ يا أنجشة رويدك سوقا بالقوارير ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) had in one of his journeys his black slave who was called Anjasha along with him. He goaded by singing the songs of camel-driver. Thereupon Allah's Messenger (may peace be upon him) said:                      Anjasha, drive slowly as you are driving (the mounts who are carrying) glass vessels",
      "chain": [
        "30128",
        "30367",
        "20022",
        "30137",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "6181",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو الربيع العتكي، وحامد بن عمر، وأبو كامل قالوا حدثنا حماد، عن  ثابت، عن أنس، بنحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "30128",
        "20022",
        "11269"
      ]
    },
    {
      "hadith_no": "6234",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو كامل، حدثنا حماد يعني ابن زيد، ح وحدثني سويد بن سعيد، حدثنا  علي بن مسهر، كلاهما عن عاصم الأحول، ح وحدثني حامد بن عمر البكراوي، - واللفظ له - حدثنا عبد الواحد، - يعني ابن زياد - حدثنا عاصم، عن عبد الله بن سرجس، قال رأيت النبي صلى الله عليه وسلم وأكلت معه خبزا ولحما - أو قال ثريدا - قال فقلت له أستغفر لك النبي صلى الله عليه وسلم قال نعم ولك ثم تلا هذه الآية ‏{‏ واستغفر لذنبك وللمؤمنين والمؤمنات‏}‏ قال ثم درت خلفه فنظرت إلى خاتم النبوة بين كتفيه عند ناغض كتفه اليسرى جمعا عليه خيلان كأمثال الثآليل ‏.‏",
      "text_en": " Abdullah b. Sarjis reported:                      I saw Allah's Apostle (may peace be upon him) and ate with him bread and meat, or he said Tharid (bread soaked in soup). I said to him: Did Allah's Apostle (may peace be upon him) seek forgiveness for you? He said: Yes, and for you, and he then recited this verse:\" Ask forgiveness for thy sin and for the believing men and believing women\" (xlvii. 19). I then went after him and saw the Seal of Prophethood between his shoulders on the left side of his shoulder having spots on it like moles.",
      "chain": [
        "20022",
        "30547",
        "11080",
        "30128",
        "20256",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "6395",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، قالوا حدثنا المعتمر، - وهو ابن سليمان - قال سمعت أبي، عن أبي عثمان، قال لم يبق مع رسول الله صلى الله عليه وسلم في بعض تلك الأيام التي قاتل فيهن رسول الله صلى الله عليه وسلم غير طلحة وسعد ‏.‏ عن حديثهما ‏.‏",
      "text_en": " Abu 'Uthman reported on one of the days when Allah's Messenger (may peace be upon him) was fighting and none remained with him save Talha and Sa'd.",
      "chain": [
        "30161",
        "30128",
        "30449",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "6614",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا مسلمة بن علقمة المازني، إمام مسجد داود حدثنا داود، عن الشعبي، عن أبي هريرة، قال ثلاث خصال سمعتهن من، رسول الله صلى الله عليه وسلم في بني تميم لا أزال أحبهم بعد وساق الحديث بهذا المعنى غير أنه قال ‏\"‏ هم أشد الناس قتالا في الملاحم ‏\"‏ ‏.‏ ولم يذكر الدجال ‏.‏",
      "text_en": " Abu Huraira reported:                      There are some distinguishing features of Banu Tamim which I heard from Allah's Messenger (may peace be upon him) and my love for them is never on the decline after that and the words are: They are the bravest amongst people in the battlefield and there is no mention of (the word)\" Dajjal\".",
      "chain": [
        "30128",
        "20568",
        "11052",
        "13"
      ]
    },
    {
      "hadith_no": "6992",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني حامد بن عمر، حدثنا عبد الواحد، حدثنا عاصم، عن النضر بن أنس، وأنس، يومئذ حى قال أنس لولا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يتمنين أحدكم الموت ‏\"‏ ‏.‏ لتمنيته ‏.‏",
      "text_en": " Nadr b. Anas reported, as when Anas was alive, that he said:                      Had Allah's Messenger (may peace be upon him) not stated this..\" None should make a request for death,\" I would have definitely done that.",
      "chain": [
        "30128",
        "20256",
        "11080",
        "11310"
      ]
    }
  ],
  "total_hadiths": 28
}