{
  "id": "30129",
  "name": "Harmy bin Hafs bin 'Umar حرمي بن حفص",
  "full_name": "Harmy bin Hafs bin 'Umar حرمي بن حفص",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "226",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri",
      "al-'Atki",
      "al-Qasmali"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20253",
      "name": "'Abdul 'Aziz bin Muslim al-Qasimali عبد العزيز بن مسلم القسملي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10797",
      "name": "'Ubaid bin Mahran al-Maktab عبيد بن مهران المكتب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28523",
      "name": "Muhammad bin 'Abdullah bin 'Alatha محمد بن عبد الله بن علاثة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "36",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حرمي بن حفص، قال حدثنا عبد الواحد، قال حدثنا عمارة، قال حدثنا أبو زرعة بن عمرو بن جرير، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ انتدب الله لمن خرج في سبيله لا يخرجه إلا إيمان بي وتصديق برسلي أن أرجعه بما نال من أجر أو غنيمة، أو أدخله الجنة، ولولا أن أشق على أمتي ما قعدت خلف سرية، ولوددت أني أقتل في سبيل الله ثم أحيا، ثم أقتل ثم أحيا، ثم أقتل ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The person who participates in (Holy battles) in      Allah's cause and nothing compels him to do so except belief in Allah      and His Apostles, will be recompensed by Allah either with a reward,      or booty (if he survives) or will be admitted to Paradise (if he is      killed in the battle as a martyr). Had I not found it difficult for my     followers, then I would not remain behind any sariya going for Jihad      and I would have loved to be martyred in Allah's cause and then made      alive, and then martyred and then made alive, and then again martyred      in His cause.\"",
      "chain": [
        "30129",
        "20256",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "4435",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبدة بن عبد الله، ومحمد بن داود بن صبيح، قال عبدة أخبرنا حرمي بن حفص، قال حدثنا محمد بن عبد الله بن علاثة، حدثنا عبد العزيز بن عمر بن عبد العزيز، أن خالد بن اللجلاج، حدثه أن اللجلاج أباه أخبره أنه، كان قاعدا يعتمل في السوق فمرت امرأة تحمل صبيا فثار الناس معها وثرت فيمن ثار فانتهيت إلى النبي صلى الله عليه وسلم وهو يقول ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ فسكتت فقال شاب حذوها أنا أبوه يا رسول الله ‏.‏ فأقبل عليها فقال ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ قال الفتى أنا أبوه يا رسول الله ‏.‏ فنظر رسول الله صلى الله عليه وسلم إلى بعض من حوله يسألهم عنه فقالوا ما علمنا إلا خيرا ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أحصنت ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمر به فرجم ‏.‏ قال فخرجنا به فحفرنا له حتى أمكنا ثم رميناه بالحجارة حتى هدأ فجاء رجل يسأل عن المرجوم فانطلقنا به إلى النبي صلى الله عليه وسلم فقلنا هذا جاء يسأل عن الخبيث ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لهو أطيب عند الله من ريح المسك ‏\"‏ ‏.‏ فإذا هو أبوه فأعناه على غسله وتكفينه ودفنه وما أدري قال والصلاة عليه أم لا ‏.‏ وهذا حديث عبدة وهو أتم ‏.‏",
      "text_en": " Narrated Al-Lajlaj al-Amiri:                     I was working in the market. A woman passed carrying a child. The people rushed towards her, and I also rushed along with them.  I then went to the Prophet (ﷺ) while he was asking: Who is the father of this (child) who is with you? She remained silent.  A young man by her side said: I am his father, Messenger of Allah!  He then turned towards her and asked: Who is the father of this child with you?  The young man said: I am his father, Messenger of Allah! The Messenger of Allah (ﷺ) then looked at some of those who were around him and asked them about him. They said: We only know good (about him).  The Prophet (ﷺ) said to him: Are you married?  He said: Yes. So he gave orders regarding him and he was stoned to death.  He (the narrator) said: We took him out, dug a pit for him and put him in it. We then threw stones at him until he died. A man then came asking about the man who was stoned.  We brought him to the Prophet (ﷺ) and said: This man has come asking about the wicked man.  The Messenger of Allah (ﷺ) said: He is more agreeable than the fragrance of musk in the eyes of Allah. The man was his father. We then helped him in washing, shrouding and burying him. (The narrator said:) I do not know whether he said or did not say \"in praying over him.\" This is the tradition of Abdah, and it is more accurate.",
      "chain": [
        "30149",
        "20337",
        "30129",
        "28523",
        "20166",
        "18248"
      ]
    }
  ],
  "total_hadiths": 2
}