{
  "id": "30126",
  "name": "Bashr bin Khalid al-'Askary بشر بن خالد العسكري",
  "full_name": "Bashr bin Khalid al-'Askary بشر بن خالد العسكري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "255",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-345",
      "hadith_no": "345",
      "source": "Sahih Bukhari",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا بشر بن خالد، قال حدثنا محمد  هو غندر  عن شعبة، عن سليمان، عن أبي وائل، قال قال أبو موسى لعبد الله بن مسعود إذا لم يجد الماء لا يصلي‏.‏ قال عبد الله لو رخصت لهم في هذا، كان إذا وجد أحدهم البرد قال هكذا  يعني تيمم وصلى  قال قلت فأين قول عمار لعمر قال إني لم أر عمر قنع بقول عمار‏.‏",
      "text_en": " Narrated Abu Wail:                     Abu Musa said to `Abdullah bin Mas`ud, \"If one does not find water (for ablution) can he give up the prayer?\" `Abdullah replied, \"If you give the permission to perform Tayammum they will perform Tayammum even if water was available if one of them found it cold.\" Abu Musa said, \"What about the statement of `Ammar to `Umar?\" `Abdullah replied, \"`Umar was not satisfied by his statement.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-868",
      "hadith_no": "868",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن مسكين، قال حدثنا بشر، أخبرنا الأوزاعي، حدثني يحيى بن أبي كثير، عن عبد الله بن أبي قتادة الأنصاري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأقوم إلى الصلاة وأنا أريد أن أطول فيها، فأسمع بكاء الصبي، فأتجوز في صلاتي كراهية أن أشق على أمه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada Al-Ansari:                     My father said, \"Allah's Apostle said, \"Whenever I stand for prayer, I want to prolong it but on hearing the cries of a child, I would shorten it as I dislike to put its mother in trouble.\"",
      "usc_msa_ref": "827",
      "chain": [
        "30275",
        "30126",
        "20024",
        "11449"
      ]
    },
    {
      "id": "sahih-bukhari-2459",
      "hadith_no": "2459",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد، عن شعبة، عن سليمان، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ أربع من كن فيه كان منافقا، أو كانت فيه خصلة من أربعة كانت فيه خصلة من النفاق، حتى يدعها إذا حدث كذب، وإذا وعد أخلف، وإذا عاهد غدر، وإذا خاصم فجر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Whoever has (the following) four characters will be a hypocrite, and whoever has one of the following four characteristics will have one characteristic of hypocrisy until he gives it up. These are: (1 ) Whenever he talks, he tells a lie; (2) whenever he makes a promise, he breaks it; (3) whenever he makes a covenant he proves treacherous; (4) and whenever he quarrels, he behaves impudently in an evil insulting manner.\" (See Hadith No. 33 Vol. 1)",
      "usc_msa_ref": "639",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11362",
        "11018",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-2676",
      "hadith_no": "2676",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي وائل، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين كاذبا ليقتطع مال رجل  أو قال أخيه  لقي الله وهو عليه غضبان ‏\"‏‏.‏ وأنزل الله تصديق ذلك في القرآن ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ الآية‏.‏   فلقيني الأشعث فقال ما حدثكم عبد الله اليوم، قلت كذا وكذا‏.‏ قال في أنزلت‏.‏",
      "text_en": " Narrated Abu Wail from `Abdullah:                     The Prophet said, \"Whoever takes a false oath in order to grab another man's (or his brother's) property, then Allah will be angry with him when he will meet him.\" Then Allah confirmed this by revealing the Divine Verse: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant and their oaths . . . Will get painful punishment.\" (3.77) Al-Ash'ath met me and asked, \"What did `Abdullah tell you today?\" I said, \"So and so.\" He said, \"The Verse was revealed regarding my case.\"",
      "usc_msa_ref": "842",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-3628",
      "hadith_no": "3628",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة،‏.‏ حدثني بشر بن خالد، حدثنا محمد، عن شعبة، عن سليمان، سمعت أبا وائل، يحدث عن حذيفة، أن عمر بن الخطاب  رضى الله عنه  قال أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتنة فقال حذيفة أنا أحفظ كما قال‏.‏ قال هات إنك لجريء‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فتنة الرجل في أهله وماله وجاره تكفرها الصلاة والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليست هذه، ولكن التي تموج كموج البحر‏.‏ قال يا أمير المؤمنين لا بأس عليك منها، إن بينك وبينها بابا مغلقا‏.‏ قال يفتح الباب أو يكسر قال لا بل يكسر‏.‏ قال ذاك أحرى أن لا يغلق‏.‏ قلنا علم الباب قال نعم، كما أن دون غد الليلة، إني حدثته حديثا ليس بالأغاليط‏.‏ فهبنا أن نسأله، وأمرنا مسروقا، فسأله فقال من الباب قال عمر‏.‏",
      "text_en": " Narrated Hudhaifa:                     Once `Umar bin Al-Khattab said, said, \"Who amongst you remembers the statement of Allah's Apostle regarding the afflictions?\" Hudhaifa replied, \"I remember what he said exactly.\" `Umar said. \"Tell (us), you are really a daring man!'' Hudhaifa said, \"Allah's Apostle said, 'A man's afflictions (i.e. wrong deeds) concerning his relation to his family, his property and his neighbors are expiated by his prayers, giving in charity and enjoining what is good and forbidding what is evil.' \" `Umar said, \"I don't mean these afflictions but the afflictions that will be heaving up and down like waves of the sea.\" Hudhaifa replied, \"O chief of the believers! You need not fear those (afflictions) as there is a closed door between you and them.\" `Umar asked, \"Will that door be opened or broken?\" Hudhaifa replied, \"No, it will be broken.\" `Umar said, \"Then it is very likely that the door will not be closed again.\" Later on the people asked Hudhaifa, \"Did `Umar know what that door meant?\" He said. \"Yes, `Umar knew it as everyone knows that there will be night before the tomorrow morning. I narrated to `Umar an authentic narration, not lies.\" We dared not ask Hudhaifa; therefore we requested Masruq who asked him, \"What does the door stand for?\" He said, \"`Umar.\"",
      "usc_msa_ref": "786",
      "chain": [
        "30160",
        "20276",
        "30126",
        "20278",
        "20020",
        "11005",
        "11353",
        "145",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-4199",
      "hadith_no": "4199",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي الضحى، عن مسروق، قال دخلنا على عائشة  رضى الله عنها  وعندها حسان بن ثابت ينشدها شعرا، يشبب بأبيات له وقال حصان رزان ما تزن بريبة وتصبح غرثى من لحوم الغوافل فقالت له عائشة لكنك لست كذلك‏.‏ قال مسروق فقلت لها لم تأذنين له أن يدخل عليك‏.‏ وقد قال الله تعالى ‏{‏والذي تولى كبره منهم له عذاب عظيم‏}‏‏.‏ فقالت وأى عذاب أشد من العمى‏.‏ قالت له إنه كان ينافح  أو يهاجي  عن رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Masruq:                     We went to `Aisha while Hassan bin Thabit was with her reciting poetry to her from some of his poetic verses, saying \"A chaste wise lady about whom nobody can have suspicion. She gets up with an empty stomach because she never eats the flesh of indiscreet (ladies).\" `Aisha said to him, \"But you are not like that.\" I said to her, \"Why do you grant him admittance, though Allah said:-- \"and as for him among them, who had the greater share therein, his will be a severe torment.\" (24.11) On that, `Aisha said, \"And what punishment is more than blinding?\" She, added, \"Hassan used to defend or say poetry on behalf of Allah's Apostle (against the infidels).",
      "usc_msa_ref": "467",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "id": "sahih-bukhari-4583",
      "hadith_no": "4583",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، سمعت أبا الضحى، يحدث عن مسروق، عن عائشة، أنها قالت لما أنزلت الآيات الأواخر من سورة البقرة خرج رسول الله صلى الله عليه وسلم فتلاهن في المسجد، فحرم التجارة في الخمر‏.‏",
      "text_en": " Narrated `Aisha:                     When the last Verses of Surat-al-Baqara were revealed. Allah's Apostle went out and recited them in the Mosque and prohibited the trade of alcoholic liquors.",
      "usc_msa_ref": "65",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4714",
      "hadith_no": "4714",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني بشر بن خالد أبو محمد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال لما أمرنا بالصدقة كنا نتحامل فجاء أبو عقيل بنصف صاع، وجاء إنسان بأكثر منه، فقال المنافقون إن الله لغني عن صدقة هذا، وما فعل هذا الآخر إلا رئاء‏.‏ فنزلت ‏{‏الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Musud:                     When we were ordered to give alms, we began to work as porters (to earn something we could give in charity). Abu Uqail came with one half of a Sa (special measure for food grains) and another person brought more than he did. So the hypocrites said, \"Allah is not in need of the alms of this (i.e. 'Uqail); and this other person did not give alms but for showing off.\" Then Allah revealed:-- 'Those who criticize such of the Believers who give charity voluntarily and those who could not find to give in charity except what is available to them.' (9.79)",
      "usc_msa_ref": "190",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11353",
        "402",
        "30343"
      ]
    },
    {
      "id": "sahih-bukhari-4762",
      "hadith_no": "4762",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن أبي معمر، عن عبد الله  رضى الله عنه  في هذه الآية ‏{‏الذين يدعون يبتغون إلى ربهم الوسيلة‏}‏ قال ناس من الجن ‏{‏كانوا‏}‏ يعبدون فأسلموا‏.‏",
      "text_en": " Narrated `Abdullah:                     Regarding the Verse: 'Those whom they call upon (worship) (like Jesus the Son of Mary or angels etc.) desire (for themselves) means of access, to their Lord....' (17.57) (It was revealed regarding) some Jinns who used to be worshipped (by human beings). They later embraced Islam (while those people kept on worshipping them).",
      "usc_msa_ref": "239",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4781",
      "hadith_no": "4781",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، سمعت أبا الضحى، يحدث عن مسروق، عن خباب، قال كنت قينا في الجاهلية، وكان لي دين على العاصي بن وائل قال فأتاه يتقاضاه، فقال لا أعطيك حتى تكفر بمحمد فقال والله لا أكفر حتى يميتك الله ثم تبعث‏.‏ قال فذرني حتى أموت ثم أبعث، فسوف أوتى مالا وولدا، فأقضيك فنزلت هذه الآية ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏",
      "text_en": " Narrated Masruq:                     Khabbab said, \"During the pre-lslamic period, I was a blacksmith and Al-Asi bin Wail owed me a debt.\" So Khabbab went to him to demand the debt. He said, \"I will not give you (your due) till you disbelieve in Muhammad.\" Khabbab said, \"By Allah, I shall not disbelieve in Muhammad till Allah makes you die and then resurrects you.\" Al-Asi said, \"So leave me till I die and then be resurrected, for I will be given wealth and children whereupon I will pay you your debt.\" So this Verse was revealed:-- 'Have you seen him who disbelieved in Our Signs and, (yet) says: I shall certainly be given wealth and children.' (19.77)",
      "usc_msa_ref": "258",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4873",
      "hadith_no": "4873",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد، عن شعبة، عن سليمان، ومنصور، عن أبي الضحى، عن مسروق، قال قال عبد الله إن الله بعث محمدا صلى الله عليه وسلم وقال ‏{‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏}‏ فإن رسول الله صلى الله عليه وسلم لما رأى قريشا استعصوا عليه فقال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف ‏\"‏‏.‏ فأخذتهم السنة حتى حصت كل شىء حتى أكلوا العظام والجلود  فقال أحدهم حتى أكلوا الجلود والميتة  وجعل يخرج من الأرض كهيئة الدخان فأتاه أبو سفيان فقال أى محمد إن قومك قد هلكوا فادع الله أن يكشف عنهم فدعا ثم قال ‏\"‏ تعودوا بعد هذا ‏\"‏‏.‏ في حديث منصور ثم قرأ ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ إلى ‏{‏عائدون‏}‏ أيكشف عذاب الآخرة فقد مضى الدخان والبطشة واللزام وقال أحدهم القمر وقال الآخر الروم‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah sent (the Prophet) Muhammad and said:-- 'Say, No wage do I ask of you for this (Qur'an) nor am I one of the pretenders (i.e. a person who pretends things which do not exist). (38.68) When Allah's Apostle saw Quraish standing against him, he said, \"O Allah! Help me against them by afflicting them with seven years of famine similar to the seven years (of famine) of Joseph. So they were afflicted with a year of drought that destroyed everything, and they ate bones and hides. (One of them said), \"And they ate hides and dead animals, and (it seemed to them that) something like smoke was coming out of the earth. So Abu Sufyan came to the Prophet and said, \"O Muhammad! Your people are on the verge of destruction! Please invoke Allah to relieve them.\" So the Prophet invoked Allah for them (and the famine disappeared). He said to them. \"You will revert (to heathenism) after that.\" `Abdullah then recited: 'Then watch you for the Day that the sky will bring forth a kind of smoke plainly visible.......but truly you will revert (to disbelief).' He added, \"Will the punishment be removed from them in the Hereafter? The smoke and the grasp and the Al-Lizam have all passed.\" One of the sub-narrater said, \"The splitting of the moon.\" And another said, \"The defeat of the Romans (has passed).",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11067",
        "11392",
        "11018",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4997",
      "hadith_no": "4997",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد بن جعفر، حدثنا شعبة، عن سليمان، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏ أنه كان في جنازة فأخذ عودا ينكت في الأرض فقال ‏\"‏ ما منكم من أحد إلا وقد كتب مقعده من النار أو من الجنة ‏\"‏‏.‏ قالوا يا رسول الله أفلا نتكل قال ‏\"‏ اعملوا فكل ميسر ‏{‏فأما من أعطى واتقى * وصدق بالحسنى‏}‏ الآية‏.‏ قال شعبة وحدثني به منصور فلم أنكره من حديث سليمان‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     While the Prophet was in a funeral procession, he took a small stick and started scraping the earth with it and said, \"There is none among you but has his place written for him, either in the Hell Fire or in Paradise.\" They (the people) said, \"Allah's Apostle! Shall we depend on this (and leave work)?\" He replied. \"Carry on doing (good deeds), for everybody will find easy (to do) such deeds as will lead him to his destined place.\" The Prophet then recited:-- 'As for him who gives (in charity) and keeps his duty to Allah, and believes in the Best Reward.'.....(92.5-10)",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-6238",
      "hadith_no": "6238",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ المرء مع من أحب ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Everyone will be with those whom he loves.\"",
      "usc_msa_ref": "189",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-6827",
      "hadith_no": "6827",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن الأسود، قال قضى فينا معاذ بن جبل على عهد رسول الله صلى الله عليه وسلم النصف للابنة والنصف للأخت‏.‏ ثم قال سليمان قضى فينا‏.‏ ولم يذكر على عهد رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-Aswad:                     Mu`adh bin Jabal gave this verdict for us in the lifetime of Allah's Apostle. One-half of the inheritance is to be given to the daughter and the other half to the sister. Sulaiman said: Mu`adh gave a verdict for us, but he did not mention that it was so in the lifetime of Allah's Apostle.",
      "usc_msa_ref": "733",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "id": "sahih-bukhari-7187",
      "hadith_no": "7187",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثني بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، سمعت أبا وائل، قال قيل لأسامة ألا تكلم هذا‏.‏ قال قد كلمته ما دون أن أفتح بابا، أكون أول من يفتحه، وما أنا بالذي أقول لرجل بعد أن يكون أميرا على رجلين أنت خير‏.‏ بعد ما سمعت من رسول الله صلى الله عليه وسلم يقول ‏\"‏ يجاء برجل فيطرح في النار، فيطحن فيها كطحن الحمار برحاه، فيطيف به أهل النار فيقولون أى فلان ألست كنت تأمر بالمعروف، وتنهى عن المنكر فيقول إني كنت آمر بالمعروف ولا أفعله، وأنهى عن المنكر وأفعله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Wail:                     Someone said to Usama, \"Will you not talk to this (Uthman)?\" Usama said, \"I talked to him (secretly) without being the first man to open an evil door. I will never tell a ruler who rules over two men or more that he is good after I heard Allah's Apostle saying, 'A man will be brought and put in Hell (Fire) and he will circumambulate (go around and round) in Hell (Fire) like a donkey of a (flour) grinding mill, and all the people of Hell (Fire) will gather around him and will say to him, O so-and-so! Didn't you use to order others for good and forbid them from evil?' That man will say, 'I used to order others to do good but I myself never used to do it, and I used to forbid others from evil while I myself used to do evil.' \"",
      "usc_msa_ref": "218",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11353"
      ]
    },
    {
      "id": "sahih-muslim-201",
      "hadith_no": "201",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، ح وحدثني بشر بن خالد، حدثنا محمد، - يعني ابن جعفر - قالا حدثنا شعبة، عن الأعمش، بهذا الإسناد ‏.‏ مثل حديث جرير وزاد ‏\"‏ والفخر والخيلاء في أصحاب الإبل والسكينة والوقار في أصحاب الشاء ‏\"‏ ‏.‏",
      "text_en": " Shu'ba narrated the hadith as reported by Jarir with the same chain of narrators with this addition:                      Pride and conceitedness is among the owners of the camels and tranquillity and sobriety is found amongst the owners of sheep.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "30126",
        "20173",
        "20020"
      ]
    },
    {
      "id": "sahih-muslim-4476",
      "hadith_no": "4476",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثني يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - ح وحدثني بشر بن خالد، حدثنا محمد بن جعفر، ح وحدثنا ابن، المثنى وابن بشار قالا حدثنا ابن أبي عدي، كلهم عن شعبة، عن الأعمش، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أن بعضهم قال عن شعبة ‏\"‏ يقضى ‏\"‏ ‏.‏ وبعضهم قال ‏\"‏ يحكم بين الناس ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20226",
        "30126",
        "20173",
        "20276",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-4631",
      "hadith_no": "4631",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثني بشر، بن خالد أخبرنا محمد، - يعني ابن جعفر - كلاهما عن شعبة، عن سليمان، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل غادر لواء يوم القيامة يقال هذه غدرة فلان ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah reported Allah's Prophet (may peace be upon him) as saying:                      There will be a flag for every perfidious person on the Day of Judgment, and it would be said: Here is the perfidy of so and so.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20276",
        "30126",
        "20173",
        "20020",
        "11005",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-5006",
      "hadith_no": "5006",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن زائدة، ح وحدثني بشر بن، خالد حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، كلاهما عن الأعمش، بهذا الإسناد ‏.‏",
      "text_en": " A similar tradition has been narrated on the authority of al-A'mash.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20320",
        "30126",
        "20173"
      ]
    },
    {
      "id": "sahih-muslim-5008",
      "hadith_no": "5008",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثني بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا  سفيان، كلهم عن الأعمش، بهذا الإسناد ‏.‏",
      "text_en": " The above tradition has been handed down through a different chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20347",
        "30126",
        "20173",
        "20020",
        "30375",
        "20121"
      ]
    },
    {
      "id": "sahih-muslim-5286",
      "hadith_no": "5286",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثني زهير بن حرب، حدثنا  جرير، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، كلهم عن  الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي، قال نهى رسول الله صلى الله عليه وسلم أن ينتبذ في الدباء والمزفت ‏.‏ هذا حديث جرير ‏.‏ وفي حديث عبثر وشعبة أن النبي صلى الله عليه وسلم نهى عن الدباء والمزفت ‏.‏",
      "text_en": " 'Ali reported that Allah's Messenger (may peace be upon him) forbade to prepare Nabidh in gourd and varnished jar. This hadith has been narrated through another chain of transmitters with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "30022",
        "20028",
        "30126",
        "20173",
        "11060",
        "11322",
        "11330",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-5716",
      "hadith_no": "5716",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، كلاهما عن محمد بن جعفر، عن  شعبة، عن منصور، ح وحدثني محمد بن عمرو بن جبلة، حدثنا محمد يعني ابن جعفر، ح وحدثنا ابن المثنى، حدثنا ابن أبي عدي، كلاهما عن شعبة، عن حصين، ح وحدثني بشر، بن خالد أخبرنا محمد، - يعني ابن جعفر - حدثنا شعبة، عن سليمان، كلهم عن سالم، بن أبي الجعد عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم ح  وحدثنا إسحاق بن إبراهيم الحنظلي، وإسحاق بن منصور، قالا أخبرنا النضر، بن شميل حدثنا شعبة، عن قتادة، ومنصور، وسليمان، وحصين بن عبد الرحمن، قالوا سمعنا  سالم بن أبي الجعد، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم ‏.‏ بنحو حديث من ذكرنا حديثهم من قبل ‏.‏ وفي حديث النضر عن شعبة قال وزاد فيه حصين وسليمان قال حصين قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما بعثت قاسما أقسم بينكم ‏\"‏ ‏.‏ وقال سليمان ‏\"‏ فإنما أنا قاسم أقسم بينكم ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through different chains of transmitters on the authority of Shu'ba with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "20173",
        "20020",
        "11067",
        "38562",
        "20173",
        "20276",
        "20020",
        "15097",
        "30126",
        "20173"
      ]
    },
    {
      "id": "sahih-muslim-5837",
      "hadith_no": "5837",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، ح حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح حدثني بشر بن خالد، حدثنا محمد بن جعفر، ح وحدثنا ابن، بشار حدثنا ابن أبي عدي، كلاهما عن شعبة، ح وحدثنا أبو بكر بن أبي شيبة، وأبو بكر بن خلاد قالا حدثنا يحيى، - وهو القطان - عن سفيان، كل هؤلاء عن الأعمش، بإسناد جرير ‏.‏ في حديث هشيم وشعبة مسحه بيده ‏.‏ قال وفي حديث الثوري مسحه بيمينه ‏.‏ وقال في عقب حديث يحيى عن سفيان عن الأعمش قال فحدثت به منصورا فحدثني عن إبراهيم عن مسروق عن عائشة بنحوه ‏.‏",
      "text_en": " This. hadith has been reported on the authority of Shu'ba through another chain of transmitters (and the words are):                     \" He rubbed him with his hand\" and (in) the hadith transmitted on the authority of Thauri (the words are).\" He used to rub with his right hand.\" This hadith has been reported through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "30201",
        "30216",
        "20354",
        "30126",
        "20173",
        "30160",
        "20276",
        "20020",
        "30201",
        "30357"
      ]
    },
    {
      "id": "sahih-muslim-5877",
      "hadith_no": "5877",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني بشر بن خالد، حدثنا محمد، - يعني ابن جعفر - عن شعبة، قال سمعت  سليمان، قال سمعت أبا سفيان، قال سمعت جابر بن عبد الله، قال رمي أبى يوم الأحزاب على أكحله فكواه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Jabir b. 'Abdillah reported that on the day of Ahzab Ubayy received the wound of an arrow in his medial arm vein. Allah's Messenger (may peace be upon him) cauterised it.",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6491",
      "hadith_no": "6491",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثني بشر بن، خالد أخبرنا محمد، - يعني ابن جعفر - كلاهما عن شعبة، عن الأعمش، بإسنادهم واختلفا عن شعبة، في تنسيق الأربعة ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Bakr b. Abu Shaiba and Abu Kuraib, and both of them said:                      Abu Mu'awiya narrated to us from A'mash on the authority of Jarir and Waki', and in a narration of Abu Bakr transmitted on the authority of Abu Mu'awiya the mention of Mu'adh has preceded Ubayy's, and in the narration transmitted on the authority of Abu Kuraib, the name of Ubayy preceded Mu'ddh's. This tradition has been transmitted on the authority of Shulba through A'mash, but there is a difference of order of the four.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "30126",
        "20173",
        "20020"
      ]
    },
    {
      "id": "sahih-muslim-6546",
      "hadith_no": "6546",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، عن سليمان، عن أبي الضحى، عن مسروق، قال دخلت على عائشة وعندها حسان بن ثابت ينشدها شعرا يشبب بأبيات له فقال حصان رزان ما تزن بريبة وتصبح غرثى من لحوم الغوافل فقالت له عائشة لكنك لست كذلك ‏.‏ قال مسروق فقلت لها لم تأذنين له يدخل عليك وقد قال الله ‏{‏ والذي تولى كبره منهم له عذاب عظيم‏}‏ فقالت فأى عذاب أشد من العمى إنه كان ينافح أو يهاجي عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Masruq reported:                      I visited 'A'isha when Hassin was sitting there and reciting verses from his compilation: She is chaste and prudent. There is no calumny against her and she rises up early in the morning without eating the meat of the un- mindful. 'A'isha said: But you are not so. Masruq said: I said to her: Why do you permit him to visit you, whereas Allah has said:\" And as for him among them who took upon himself the main part thereof, he shall have a grievous punishment\" (XXIV. ll)? Thereupon she said: What tornient can be more severe than this that he has become blind? He used to write satire as a rebuttal on behalf of Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "id": "sahih-muslim-6723",
      "hadith_no": "6723",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ، أخبرني أبي ح، وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - كلهم عن شعبة، عن الأعمش، ح وحدثني أبو بكر بن نافع، حدثنا عبد الرحمن، ح وحدثنا ابن، نمير حدثنا مصعب بن المقدام، كلاهما عن سفيان، عن الأعمش، بإسناد جرير مثل حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'mash through other chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20276",
        "30126",
        "20173",
        "20020",
        "11060",
        "20523",
        "10530",
        "30212",
        "20608",
        "20012"
      ]
    },
    {
      "id": "sunan-abi-daud-4770",
      "hadith_no": "4770",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا بشر بن خالد، حدثنا شبابة بن سوار، عن نعيم بن حكيم، عن أبي مريم، قال ‏:‏ إن كان ذلك المخدج لمعنا يومئذ في المسجد نجالسه بالليل والنهار، وكان فقيرا ورأيته مع المساكين يشهد طعام علي عليه السلام مع الناس وقد كسوته برنسا لي ‏.‏ قال أبو مريم ‏:‏ وكان المخدج يسمى نافعا ذا الثدية، وكان في يده مثل ثدى المرأة على رأسه حلمة مثل حلمة الثدى عليه شعيرات مثل سبالة السنور ‏.‏ قال أبو داود ‏:‏ وهو عند الناس اسمه حرقوس ‏.‏",
      "text_en": " ABU MARYAM SAID:                      THIS MAN WITH THE CRIPPLED HAND WAS ON THAT DAY WITH US IN THE MOSQUE. WE WOULD SIT WITH HIM BY DAY AND BY NIGHT, AND HE WAS A POOR MAN. I SAW HIM ATTENDING THE MEALS OF ‘ALI(ALLAH BE PLEASED WITH HIM) WHICH HE TOOK WITH THE PEOPLE, AND I CLOTHED HIM WITH A CLOAK OF MINE.Abu Maryam said: The man with the crippled hand was called Nafi' Dhu al-Thadyah (Nafi', man of nipple). He had in his hand something like a female breast with a nipple at it ends like the nipple of the female breast. If had some hair on it like the whiskers of cat.Abu Dawud said: Hw was known among the people by the name of Harqus.",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20426"
      ]
    },
    {
      "id": "sunan-abi-daud-4933",
      "hadith_no": "4933",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا بشر بن خالد، حدثنا أبو أسامة، قالا حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت إن رسول الله صلى الله عليه وسلم تزوجني وأنا بنت سبع سنين فلما قدمنا المدينة أتين نسوة - وقال بشر فأتتني أم رومان - وأنا على أرجوحة فذهبن بي وهيأنني وصنعنني فأتي بي رسول الله صلى الله عليه وسلم فبنى بي وأنا ابنة تسع فوقفت بي على الباب فقلت هيه هيه - قال أبو داود أى تنفست - فأدخلت بيتا فإذا فيه نسوة من الأنصار فقلن على الخير والبركة ‏.‏ دخل حديث أحدهما في الآخر ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) married me when I was seven or six. When we came to Medina, some women came. according to Bishr's version: Umm Ruman came to me when I was swinging. They took me, made me prepared and decorated me. I was then brought to the Messenger of Allah (ﷺ), and he took up cohabitation with me when I was nine. She halted me at the door, and I burst into laughter.Abu Dawud said: That is to say: I menstruated, and I was brought in a house, and there were some women of the Ansari in it. They said: With good luck and blessing. The tradition of one of them has been included in the other.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "30126",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4936",
      "hadith_no": "4936",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا أبو أسامة، حدثنا هشام بن عروة، بإسناده في هذا الحديث قالت وأنا على الأرجوحة، ومعي، صواحباتي فأدخلنني بيتا فإذا نسوة من الأنصار فقلن على الخير والبركة ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Hisham b. 'Urwah through different chain of narrators. This version adds:                      I was swinging and I had my friends. They brought me to a house ; there were some women of the Ansar (Helpers). They said: With good luck and blessing.",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20318",
        "11065"
      ]
    },
    {
      "id": "sunan-an-nasai-812",
      "hadith_no": "812",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا غندر، عن شعبة، عن سليمان، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح عواتقنا ويقول ‏\"‏ استووا ولا تختلفوا فتختلف قلوبكم وليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ad Al-Ansari said:                      \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he would say: 'Keep (the rows) straight; do not differ from one another lest your hearts should suffer from discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-1170",
      "hadith_no": "1170",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا غندر، قال حدثنا شعبة، عن سليمان، ومنصور، وحماد، ومغيرة، وأبي، هاشم عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم قال في التشهد ‏\"‏ التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو هاشم غريب ‏.‏",
      "text_en": " It was narrated from 'Abdullah that :                     The Prophet (ﷺ) said in the tashahhud: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11067",
        "20022",
        "11072",
        "11454",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1335",
      "hadith_no": "1335",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا يحيى بن آدم، عن سفيان بن عيينة، عن عمرو بن دينار، عن أبي معبد، عن ابن عباس، قال إنما كنت أعلم انقضاء صلاة رسول الله صلى الله عليه وسلم بالتكبير ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I used to know that the prayer of the Messenger of Allah (ﷺ) ended by the takbir.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20364",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1743",
      "hadith_no": "1743",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا شبابة، عن شعبة، عن قتادة، عن زرارة بن أوفى، عن عمران بن حصين، أن النبي صلى الله عليه وسلم أوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا تابع شبابة على هذا الحديث ‏.‏ خالفه يحيى بن سعيد ‏.‏",
      "text_en": " (With that chain) from Imran bin Husain that:                     The Prophet (ﷺ) recited in Witr: Glorify the Name of your Lord, the Most High.",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20426",
        "20020",
        "11019",
        "11284",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-2240",
      "hadith_no": "2240",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، أن ابن مسعود، لقي عثمان بعرفات فخلا به فحدثه وأن، عثمان قال لابن مسعود هل لك في فتاة أزوجكها فدعا عبد الله علقمة فحدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فليصم فإن الصوم له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Alqamah that:                     Ibn Masud met 'Uthman at 'Arafat and spoke to him in private. Uthman said to Ibn Masud: \"Are you interested in a girl so that I marry her to you?\" 'Abdullah called 'Alqamah and he told him that the Prophet said: 'Whoever among you can afford to get married, let him do so. Whoever cannot afford it, let him fast, for fasting will be a restraint (Wija) for him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11017",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-2530",
      "hadith_no": "2530",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال لما أمرنا رسول الله صلى الله عليه وسلم بالصدقة فتصدق أبو عقيل بنصف صاع وجاء إنسان بشىء أكثر منه فقال المنافقون إن الله عز وجل لغني عن صدقة هذا وما فعل هذا الآخر إلا رياء فنزلت ‏{‏ الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم ‏}‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas 'ud said:                     \"When the Messenger of Allah commanded us to give in charity, Abu 'Aqil give half a Sa', and another man brought much more than that. The hypocrites said: 'Allah has no need of the charity of the former, and the latter only did it to show off. Then the following was revealed: 'Those who defame such of the believers who give charity voluntarily, and such who could not find to give charity except what is available to them.\"'[1]",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-2564",
      "hadith_no": "2564",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، قال سمعت سليمان، - وهو الأعمش - عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم المنان بما أعطى والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: \"There are three to whom of Allah will not speak on the Day of Resurrection or look at them or purify them, and theirs will be a painful torment: the one who reminds people of what he has given them, the one who lets his garment hang beneath his ankles, and a vendor who tries to sell his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "5077",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2583",
      "hadith_no": "2583",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، عن سليمان، عن أبي وائل، عن عمرو بن الحارث، عن زينب، امرأة عبد الله قالت قال رسول الله صلى الله عليه وسلم للنساء ‏\"‏ تصدقن ولو من حليكن ‏\"‏ ‏.‏ قالت وكان عبد الله خفيف ذات اليد فقالت له أيسعني أن أضع صدقتي فيك وفي بني أخ لي يتامى فقال عبد الله سلي عن ذلك رسول الله صلى الله عليه وسلم ‏.‏ قالت فأتيت النبي صلى الله عليه وسلم فإذا على بابه امرأة من الأنصار يقال لها زينب تسأل عما أسأل عنه فخرج إلينا بلال فقلنا له انطلق إلى رسول الله صلى الله عليه وسلم فسله عن ذلك ولا تخبره من نحن ‏.‏ فانطلق إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ من هما ‏\"‏ ‏.‏ قال زينب ‏.‏ قال ‏\"‏ أى الزيانب ‏\"‏ ‏.‏ قال زينب امرأة عبد الله وزينب الأنصارية قال ‏\"‏ نعم لهما أجران أجر القرابة وأجر الصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab, the wife of 'Abdullah, said:                     \"The Messenger of Allah said to women: 'Give charity, even from women: 'Give charity, even from your jewelry. 'Abdullah was not a wealthy man and she said to him: 'Can I spend my charity on you and on my brother's children who are orphans? 'Abdullah said: 'Ask the Messenger of Allah about that.' She said: So I went to the Messenger of Allah, and at his door I found a woman from among the Ansar who was also called Zainab, and she was asking about the same matter as I was. Bilal came out to us and we said to him: Go to the Messenger of Allah and ask him about that, but do not tell him who we are. He went to the Messenger of Allah and he said:' Who are they?' He said: Zainab.' He said: 'Which Zainab?\" He said: 'Zainab Al-Ansariyyah.' Abdullah and Zainab Al-Ansariyyah.' He said: 'Yes, they will have two rewards, the reward for upholding the ties of kinship and the reward dfor giving charity.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11353",
        "20377"
      ]
    },
    {
      "id": "sunan-an-nasai-2698",
      "hadith_no": "2698",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال أنبأنا محمد، - وهو ابن جعفر غندر - عن شعبة، عن سليمان، عن إبراهيم، عن الأسود، عن عائشة، قالت لقد رأيت وبيص الطيب في رأس رسول الله صلى الله عليه وسلم وهو محرم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I saw the glistening of the perfume on the head of the Messenger of Allah while he was initiating Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2811",
      "hadith_no": "2811",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا بشر بن خالد، قال أنبأنا غندر، عن شعبة، عن سليمان، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال كانت المتعة رخصة لنا ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     Tamattu was just for us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2877",
      "hadith_no": "2877",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا بشر، أخبرني أبي، عن الزهري، أخبرني سحيم، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يغزو هذا البيت جيش فيخسف بهم بالبيداء ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: This Hosue will be attacked by an army, and they will be swallowed up by the earth in Al-Baida'.\"",
      "usc_msa_ref": "",
      "chain": [
        "38437",
        "30126",
        "11013",
        "12121",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3187",
      "hadith_no": "3187",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سليمان، قال سمعت أبا عمرو الشيباني، عن أبي مسعود، أن رجلا، تصدق بناقة مخطومة في سبيل الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليأتين يوم القيامة بسبعمائة ناقة مخطومة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that a man gave a bridled camel in charity in the cause of Allah. The Messenger of Allah (ﷺ) said:                      \"On the Day of Resurrection seven hundred bridled camels will come to you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "15580",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-3202",
      "hadith_no": "3202",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا غندر، قال حدثنا شعبة، عن سليمان، قال سمعت أبا الضحى، عن مسروق، عن عائشة، رضى الله عنها قالت قد خير رسول الله صلى الله عليه وسلم نساءه أوكان طلاقا ‏.‏",
      "text_en": " Narrated 'Aishah:                     It was narrated that 'Aishah, may Allah be pleased with her, said: \"The Messenger of Allah gave his wives the choice (of staying with him) was it divorce?\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3207",
      "hadith_no": "3207",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، أن عثمان، قال لابن مسعود هل لك في فتاة أزوجكها ‏.‏ فدعا عبد الله علقمة فحدث أن النبي صلى الله عليه وسلم قال ‏\"‏ من استطاع الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فليصم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Alqamah:                     It was narrated from 'Alqamah, that 'Uthman said to Ibn Mas'ud: \"Shall I arrange for you to marry a young girl?\" 'Abdullah called 'Alqamah and he told the people that the Prophet said: \"Whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding chastity. And whoever cannot afford it, then let him fast, for it will be a restraint for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11017",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-3556",
      "hadith_no": "3556",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "حدثنا بشر بن خالد، قال حدثنا يحيى بن آدم، عن ابن إدريس، عن محمد بن إسحاق، ويحيى بن سعيد، وعبيد الله بن عمر، عن نافع، عن ابن عمر، ح وأخبرنا زهير، عن موسى بن عقبة، عن نافع، عن ابن عمر، قالوا إن ابن عمر طلق امرأته وهي حائض فذكر عمر رضى الله عنه للنبي صلى الله عليه وسلم فقال ‏\"‏ مره فليراجعها حتى تحيض حيضة أخرى فإذا طهرت فإن شاء طلقها وإن شاء أمسكها فإنه الطلاق الذي أمر الله عز وجل به ‏\"‏ ‏.‏ قال تعالى ‏{‏ فطلقوهن لعدتهن ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he divorced his wife when she was menstruating. 'Umar, may Allah be pleased with him, mentioned that to the Prophet and he said:                      \"Tell him to take her back until she menstruates again, then when she becomes pure, if he wants he may divorce her and if he wants he may keep her. This is the divorce that Allah has enjoined. Allah, the Mighty and Sublime, says: 'The divorce is twice, after that, either you retain her on reasonable terms or release her with kindness.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20364",
        "20102",
        "11107",
        "11062",
        "11201",
        "11014",
        "18",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3816",
      "hadith_no": "3816",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا محمد بن جعفر، عن شعبة، قال سمعت سليمان، يحدث عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، قال ركبت امرأة البحر فنذرت أن تصوم شهرا فماتت قبل أن تصوم فأتت أختها النبي صلى الله عليه وسلم وذكرت ذلك له فأمرها أن تصوم عنها ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"A woman traveled by sea and vowed to fast for a month, but she died before she could fast. Her sister came to the Prophet and told him about that, and he told her to fast on her behalf.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4175",
      "hadith_no": "4175",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، عن سليمان، عن أبي وائل، عن جرير، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم وعلى فراق المشرك ‏.‏",
      "text_en": " It was narrated that Jarir said:                     I pledged to the Messenger of Allah (ﷺ) to perform Salah, pay the Zakah, be sincere toward every Muslim and forsake the idolaters.",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11353",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-4721",
      "hadith_no": "4721",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، عن شعبة، عن سليمان، قال سمعت عبد الله بن مرة، عن مسروق، عن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث النفس بالنفس والثيب الزاني والتارك دينه المفارق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that the Messenger of Allah said:                     \"It is not permissible to shed the blood of a Muslim except in one of three cases: A soul for a soul, a adulterer who has been married, and one who separates leaving his religion.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5020",
      "hadith_no": "5020",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا بشر بن خالد قال حدثنا محمد بن جعفر عن شعبة عن سليمان عن عبد الله بن مرة عن مسروق عن عبد الله بن عمرو  عن النبي صلى الله عليه وسلم قال أربعة من كن فيه كان منافقا أو كانت فيه خصلة من الأربع كانت فيه خصلة من النفاق حتى يدعها إذا حدث كذب وإذا وعد أخلف وإذا عاهد غدر وإذا خاصم فجر",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that:                     The Prophet [SAW] said: \"There are four (traits), whoever has them is a hypocrite and whoever has one of them, then has one of the traits of hypocrisy, until he gives it up: When he speaks, he lies; when he makes a promise, he breaks it; when he makes a covenant, he betrays it; and when he argues, he resorts to foul language.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11362",
        "11018",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-5057",
      "hadith_no": "5057",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بشر، عن يونس، عن الحسن، ومحمد، قالا الترجل غب ‏.‏",
      "text_en": " It was narrated that Al-Hasan and Muhammad said:                     \"Combing one's hair (should be done) every other day.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30126",
        "20475",
        "11016",
        "11035"
      ]
    },
    {
      "id": "sunan-an-nasai-5333",
      "hadith_no": "5333",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، قال سمعت سليمان بن مهران الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا يزكيهم ولهم عذاب أليم المنان بما أعطى والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah [SAW] said: 'There are three to whom Allah (the Mighty and Sublime) will not speak on the Day of Resurrection, nor will He sanctify them, and theirs will be a painful torment: The one who reminds others of what he has given them (Al-Mannan), the one who lets his Izar come below his ankles, and the one who sells his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "5077",
        "4026",
        "23"
      ]
    }
  ],
  "total_hadiths": 51
}