{
  "id": "30132",
  "name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
  "full_name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-'Asfari",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11417",
      "name": "Isma'il bin Umayya bin 'Amr إسماعيل بن أمية بن عمرو",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1338",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا سعيد، قال وقال لي خليفة حدثنا ابن زريع، حدثنا سعيد، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ العبد إذا وضع في قبره، وتولي وذهب أصحابه حتى إنه ليسمع قرع نعالهم، أتاه ملكان فأقعداه فيقولان له ما كنت تقول في هذا الرجل محمد صلى الله عليه وسلم فيقول أشهد أنه عبد الله ورسوله‏.‏ فيقال انظر إلى مقعدك من النار، أبدلك الله به مقعدا من الجنة  قال النبي صلى الله عليه وسلم فيراهما جميعا  وأما الكافر  أو المنافق  فيقول لا أدري، كنت أقول ما يقول الناس‏.‏ فيقال لا دريت ولا تليت‏.‏ ثم يضرب بمطرقة من حديد ضربة بين أذنيه، فيصيح صيحة يسمعها من يليه إلا الثقلين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"When a human being is laid in his grave and his companions return and he even hears their foot steps, two angels come to him and make him sit and ask him: What did you use to say about this man, Muhammad ? He will say: I testify that he is Allah's slave and His Apostle. Then it will be said to him, 'Look at your place in the Hell-Fire. Allah has given you a place in Paradise instead of it.' \" The Prophet added, \"The dead person will see both his places. But a non-believer or a hypocrite will say to the angels, 'I do not know, but I used to say what the people used to say! It will be said to him, 'Neither did you know nor did you take the guidance (by reciting the Qur'an).' Then he will be hit with an iron hammer between his two ears, and he will cry and that cry will be heard by whatever approaches him except human beings and jinns.\"",
      "chain": [
        "30157",
        "20246",
        "11168",
        "30132",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب،‏.‏ قال وقال لي خليفة حدثنا عبد الوهاب، حدثنا حبيب المعلم، عن عطاء، عن جابر بن عبد الله  رضى الله عنهما  قال أهل النبي صلى الله عليه وسلم هو وأصحابه بالحج، وليس مع أحد منهم هدى، غير النبي صلى الله عليه وسلم وطلحة، وقدم علي من اليمن، ومعه هدى فقال أهللت بما أهل به النبي صلى الله عليه وسلم‏.‏ فأمر النبي صلى الله عليه وسلم أصحابه أن يجعلوها عمرة، ويطوفوا، ثم يقصروا ويحلوا، إلا من كان معه الهدى، فقالوا ننطلق إلى منى، وذكر أحدنا يقطر، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ وحاضت عائشة  رضى الله عنها  فنسكت المناسك كلها، غير أنها لم تطف بالبيت، فلما طهرت طافت بالبيت‏.‏ قالت يا رسول الله تنطلقون بحجة وعمرة، وأنطلق بحج فأمر عبد الرحمن بن أبي بكر أن يخرج معها إلى التنعيم، فاعتمرت بعد الحج‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and his companions assumed Ihram for Hajj and none except the Prophet (p.b.u.h) and Talha had the Hadi (sacrifice) with them. `Ali arrived from Yemen and had a Hadi with him. `Ali said, \"I have assumed Ihram for what the Prophet has done.\" The Prophet ordered his companions to perform the `Umra with the lhram which they had assumed, and after finishing Tawaf (of Ka`ba, Safa and Marwa) to cut short their hair, and to finish their lhram except those who had Hadi with them. They (the people) said, \"How can we proceed to Mina (for Hajj) after having sexual relations with our wives?\" When that news reached the Prophet he said, \"If I had formerly known what I came to know lately, I would not have brought the Hadi with me. Had there been no Hadi with me, I would have finished the state of lhram.\" `Aisha got her menses, so she performed all the ceremonies of Hajj except Tawaf of the Ka`ba, and when she got clean (from her menses), she performed Tawaf of the Ka`ba. She said, \"O Allah's Apostle! (All of you) are returning with the Hajj and `Umra, but I am returning after performing Hajj only.\" So the Prophet ordered `Abdur-Rahman bin Abu Bakr to accompany her to Tan`im and thus she performed the `Umra after the Hajj.",
      "chain": [
        "30170",
        "30132",
        "20259",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3207",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا هدبة بن خالد، حدثنا همام، عن قتادة،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، وهشام، قالا حدثنا قتادة، حدثنا أنس بن مالك، عن مالك بن صعصعة  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ بينا أنا عند البيت بين النائم واليقظان  وذكر بين الرجلين  فأتيت بطست من ذهب ملئ حكمة وإيمانا، فشق من النحر إلى مراق البطن، ثم غسل البطن بماء زمزم، ثم ملئ حكمة وإيمانا، وأتيت بدابة أبيض دون البغل وفوق الحمار البراق، فانطلقت مع جبريل حتى أتينا السماء الدنيا قيل من هذا قال جبريل‏.‏ قيل من معك قيل محمد‏.‏ قيل وقد أرسل إليه قال نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على آدم، فسلمت عليه، فقال مرحبا بك من ابن ونبي‏.‏ فأتينا السماء الثانية، قيل من هذا قال جبريل‏.‏ قيل من معك قال محمد صلى الله عليه وسلم‏.‏ قيل أرسل إليه قال نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على عيسى ويحيى فقالا مرحبا بك من أخ ونبي‏.‏ فأتينا السماء الثالثة، قيل من هذا قيل جبريل‏.‏ قيل من معك قيل محمد‏.‏ قيل وقد أرسل إليه قال نعم‏.‏ قيل مرحبا به ولنعم المجيء جاء‏.‏ فأتيت يوسف فسلمت عليه، قال مرحبا بك من أخ ونبي فأتينا السماء الرابعة، قيل من هذا قيل جبريل‏.‏ قيل من معك قيل محمد صلى الله عليه وسلم‏.‏ قيل وقد أرسل إليه قيل نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على إدريس فسلمت عليه، فقال مرحبا من أخ ونبي‏.‏ فأتينا السماء الخامسة، قيل من هذا قال جبريل‏.‏ قيل ومن معك قيل محمد‏.‏ قيل وقد أرسل إليه قال نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتينا على هارون، فسلمت عليه فقال مرحبا بك من أخ ونبي‏.‏ فأتينا على السماء السادسة، قيل من هذا قيل جبريل‏.‏ قيل من معك قال محمد صلى الله عليه وسلم‏.‏ قيل وقد أرسل إليه مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على موسى، فسلمت ‏{‏عليه‏}‏ فقال مرحبا بك من أخ ونبي‏.‏ فلما جاوزت بكى‏.‏ فقيل ما أبكاك قال يا رب، هذا الغلام الذي بعث بعدي يدخل الجنة من أمته أفضل مما يدخل من أمتي‏.‏ فأتينا السماء السابعة، قيل من هذا قيل جبريل‏.‏ قيل من معك قيل محمد‏.‏ قيل وقد أرسل إليه مرحبا به، ونعم المجيء جاء‏.‏ فأتيت على إبراهيم، فسلمت عليه فقال مرحبا بك من ابن ونبي، فرفع لي البيت المعمور، فسألت جبريل فقال هذا البيت المعمور يصلي فيه كل يوم سبعون ألف ملك، إذا خرجوا لم يعودوا إليه آخر ما عليهم، ورفعت لي سدرة المنتهى فإذا نبقها كأنه قلال هجر، وورقها كأنه آذان الفيول، في أصلها أربعة أنهار نهران باطنان ونهران ظاهران، فسألت جبريل فقال أما الباطنان ففي الجنة، وأما الظاهران النيل والفرات، ثم فرضت على خمسون صلاة، فأقبلت حتى جئت موسى، فقال ما صنعت قلت فرضت على خمسون صلاة‏.‏ قال أنا أعلم بالناس منك، عالجت بني إسرائيل أشد المعالجة، وإن أمتك لا تطيق، فارجع إلى ربك فسله‏.‏ فرجعت فسألته، فجعلها أربعين، ثم مثله ثم ثلاثين، ثم مثله فجعل عشرين، ثم مثله فجعل عشرا، فأتيت موسى فقال مثله، فجعلها خمسا، فأتيت موسى فقال ما صنعت قلت جعلها خمسا، فقال مثله، قلت سلمت بخير، فنودي إني قد أمضيت فريضتي وخففت عن عبادي، وأجزي الحسنة عشرا ‏\"‏‏.‏ وقال همام عن قتادة عن الحسن عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ في البيت المعمور ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Sasaa:                     The Prophet said, \"While I was at the House in a state midway between sleep and wakefulness, (an angel recognized me) as the man lying between two men. A golden tray full of wisdom and belief was brought to me and my body was cut open from the throat to the lower part of the `Abdomen and then my `Abdomen was washed with Zamzam water and (my heart was) filled with wisdom and belief. Al- Buraq, a white animal, smaller than a mule and bigger than a donkey was brought to me and I set out with Gabriel. When I reached the nearest heaven. Gabriel said to the heaven gate-keeper, 'Open the gate.' The gatekeeper asked, 'Who is it?' He said, 'Gabriel.' The gate-keeper,' Who is accompanying you?' Gabriel said, 'Muhammad.' The gate-keeper said, 'Has he been called?' Gabriel said, 'Yes.' Then it was said, 'He is welcomed. What a wonderful visit his is!' Then I met Adam and greeted him and he said, 'You are welcomed O son and a Prophet.' Then we ascended to the second heaven. It was asked, 'Who is it?' Gabriel said, 'Gabriel.' It was said, 'Who is with you?' He said, 'Muhammad' It was asked, 'Has he been sent for?' He said, 'Yes.' It was said, 'He is welcomed. What a wonderful visit his is!\" Then I met Jesus and Yahya (John) who said, 'You are welcomed, O brother and a Prophet.' Then we ascended to the third heaven. It was asked, 'Who is it?' Gabriel said, 'Gabriel.' It was asked, 'Who is with you? Gabriel said, 'Muhammad.' It was asked, 'Has he been sent for?' 'Yes,' said Gabriel. 'He is welcomed. What a wonderful visit his is!' (The Prophet added:). There I met Joseph and greeted him, and he replied, 'You are welcomed, O brother and a Prophet!' Then we ascended to the 4th heaven and again the same questions and answers were exchanged as in the previous heavens. There I met Idris and greeted him. He said, 'You are welcomed O brother and Prophet.' Then we ascended to the 5th heaven and again the same questions and answers were exchanged as in previous heavens. there I met and greeted Aaron who said, 'You are welcomed O brother and a Prophet\". Then we ascended to the 6th heaven and again the same questions and answers were exchanged as in the previous heavens. There I met and greeted Moses who said, 'You are welcomed O brother and. a Prophet.' When I proceeded on, he started weeping and on being asked why he was weeping, he said, 'O Lord! Followers of this youth who was sent after me will enter Paradise in greater number than my followers.' Then we ascended to the seventh heaven and again the same questions and answers were exchanged as in the previous heavens. There I met and greeted Abraham who said, 'You are welcomed o son and a Prophet.' Then I was shown Al-Bait-al-Ma'mur (i.e. Allah's House). I asked Gabriel about it and he said, This is Al Bait-ul-Ma'mur where 70,000 angels perform prayers daily and when they leave they never return to it (but always a fresh batch comes into it daily).' Then I was shown Sidrat-ul-Muntaha (i.e. a tree in the seventh heaven) and I saw its Nabk fruits which resembled the clay jugs of Hajr (i.e. a town in Arabia), and its leaves were like the ears of elephants, and four rivers originated at its root, two of them were apparent and two were hidden. I asked Gabriel about those rivers and he said, 'The two hidden rivers are in Paradise, and the apparent ones are the Nile and the Euphrates.' Then fifty prayers were enjoined on me. I descended till I met Moses who asked me, 'What have you done?' I said, 'Fifty prayers have been enjoined on me.' He said, 'I know the people better than you, because I had the hardest experience to bring Bani Israel to obedience. Your followers cannot put up with such obligation. So, return to your Lord and request Him (to reduce the number of prayers.' I returned and requested Allah (for reduction) and He made it forty. I returned and (met Moses) and had a similar discussion, and then returned again to Allah for reduction and He made it thirty, then twenty, then ten, and then I came to Moses who repeated the same advice. Ultimately Allah reduced it to five. When I came to Moses again, he said, 'What have you done?' I said, 'Allah has made it five only.' He repeated the same advice but I said that I surrendered (to Allah's Final Order)'\" Allah's Apostle was addressed by Allah, \"I have decreed My Obligation and have reduced the burden on My slaves, and I shall reward a single good deed as if it were ten good deeds.\"",
      "chain": [
        "20294",
        "20297",
        "30132",
        "20304",
        "11168",
        "11065",
        "11019",
        "19",
        "1335"
      ]
    },
    {
      "hadith_no": "3239",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أبي العالية، حدثنا ابن عم، نبيكم يعني ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت ليلة أسري بي موسى رجلا آدم طوالا جعدا، كأنه من رجال شنوءة، ورأيت عيسى رجلا مربوعا مربوع الخلق إلى الحمرة والبياض، سبط الرأس، ورأيت مالكا خازن النار ‏\"‏‏.‏ والدجال في آيات أراهن الله إياه، فلا تكن في مرية من لقائه‏.‏ قال أنس وأبو بكرة عن النبي صلى الله عليه وسلم ‏\"‏ تحرس الملائكة المدينة من الدجال ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"On the night of my Ascent to the Heaven, I saw Moses who was a tall brown curlyhaired man as if he was one of the men of Shan'awa tribe, and I saw Jesus, a man of medium height and moderate complexion inclined to the red and white colors and of lank hair. I also saw Malik, the gate-keeper of the (Hell) Fire and Ad-Dajjal amongst the signs which Allah showed me.\" (The Prophet then recited the Holy Verse): \"So be not you in doubt of meeting him' when you met Moses during the night of Mi'raj over the heavens\" (32.23) Narrated Anas and Abu Bakra: \"The Prophet said, \"The angels will guard Medina from Ad-Dajjal (who will not be able to enter the city of Medina).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "30132",
        "20304",
        "11168",
        "11019",
        "11618"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا يونس، حدثنا شيبان، عن قتادة، عن أنس بن مالك،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  أنه حدثهم أن أهل مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية، فأراهم انشقاق القمر‏.‏",
      "text_en": " Narrated Anas:                     That the Meccan people requested Allah's Apostle to show them a miracle, and so he showed them the splitting of the moon.",
      "chain": [
        "30351",
        "20475",
        "20240",
        "11019",
        "30132",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3730",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا سعيد، وقال، لي خليفة حدثنا محمد بن سواء، وكهمس بن المنهال، قالا حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  قال صعد النبي صلى الله عليه وسلم إلى أحد ومعه أبو بكر وعمر وعثمان فرجف بهم، فضربه برجله، قال ‏\"‏ اثبت أحد فما عليك إلا نبي أو صديق أو شهيدان ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet ascended the mountain of Uhud and he was accompanied by Abu Bakr, `Umar and `Uthman. The mountain shook beneath them. The Prophet hit it with his foot and said, \"O Uhud ! Be firm, for on you there is none but a Prophet, a Siddiq and a martyr (i.e. and two martyrs).",
      "chain": [
        "30175",
        "20304",
        "11168",
        "30132",
        "20565",
        "20275",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4046",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني خليفة، حدثنا محمد بن عبد الله الأنصاري، حدثنا سعيد، عن قتادة، عن أنس  رضى الله عنه  قال مات أبو زيد ولم يترك عقبا، وكان بدريا‏.‏",
      "text_en": " Narrated Anas:                     Abu Zaid died and did not leave any offspring, and he was one of the Badr warriors.",
      "chain": [
        "30132",
        "20280",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4117",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس، عن أبي طلحة  رضى الله عنهما  قال كنت فيمن تغشاه النعاس يوم أحد، حتى سقط سيفي من يدي مرارا، يسقط وآخذه، ويسقط فآخذه‏.‏",
      "text_en": "",
      "chain": [
        "30132",
        "20304",
        "11168",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "4170",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا ابن أبي الأسود، حدثنا معتمر، وحدثني خليفة، حدثنا معتمر، قال سمعت أبي، عن أنس  رضى الله عنه  قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله الذين كانوا أعطوه أو بعضه‏.‏ وكان النبي صلى الله عليه وسلم قد أعطاه أم أيمن، فجاءت أم أيمن فجعلت الثوب في عنقي تقول كلا والذي لا إله إلا هو لا يعطيكهم وقد أعطانيها، أو كما قالت، والنبي صلى الله عليه وسلم يقول ‏\"‏ لك كذا ‏\"‏‏.‏ وتقول كلا والله‏.‏ حتى أعطاها، حسبت أنه قال ‏\"‏ عشرة أمثاله ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Anas:                     Some (of the Ansar) used to present date palm trees to the Prophet till Banu Quraiza and Banu An- Nadir were conquered (then he returned to the people their date palms). My people ordered me to ask the Prophet to return some or all the date palms they had given to him, but the Prophet had given those trees to Um Aiman. On that, Um Aiman came and put the garment around my neck and said, \"No, by Him except Whom none has the right to be worshipped, he will not return those trees to you as he (i.e. the Prophet ) has given them to me.\" The Prophet go said (to her), \"Return those trees and I will give you so much (instead of them).\" But she kept on refusing, saying, \"No, by Allah,\" till he gave her ten times the number of her date palms.",
      "chain": [
        "30145",
        "20288",
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "5124",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، أن أنسا، حدثهم عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "30132",
        "20304",
        "11168",
        "11019"
      ]
    },
    {
      "hadith_no": "5652",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "وقال خليفة حدثنا يحيى بن سعيد، حدثنا سفيان، عن منصور، عن سالم بن أبي الجعد، بهذا‏.‏",
      "text_en": "",
      "chain": [
        "30132",
        "20031",
        "20012",
        "11067"
      ]
    },
    {
      "hadith_no": "6160",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا أبو عوانة، عن قتادة، عن أنس،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس  رضى الله عنه أن رجلا، جاء إلى النبي صلى الله عليه وسلم يوم الجمعة وهو يخطب بالمدينة فقال قحط المطر فاستسق ربك، فنظر إلى السماء وما نرى من سحاب، فاستسقى فنشأ السحاب بعضه إلى بعض، ثم مطروا حتى سالت مثاعب المدينة، فما زالت إلى الجمعة المقبلة ما تقلع، ثم قام ذلك الرجل أو غيره والنبي صلى الله عليه وسلم يخطب فقال غرقنا فادع ربك يحبسها عنا‏.‏ فضحك ثم قال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏ فجعل السحاب يتصدع عن المدينة يمينا وشمالا، يمطر ما حوالينا، ولا يمطر منها شىء، يريهم الله كرامة نبيه صلى الله عليه وسلم وإجابة دعوته‏.‏",
      "text_en": " Narrated Anas:                     A man came to the Prophet on a Friday while he (the Prophet) was delivering a sermon at Medina, and said, \"There is lack of rain, so please invoke your Lord to bless us with the rain.\" The Prophet looked at the sky when no cloud could be detected. Then he invoked Allah for rain. Clouds started gathering together and it rained till the Medina valleys started flowing with water. It continued raining till the next Friday. Then that man (or some other man) stood up while the Prophet was delivering the Friday sermon, and said, \"We are drowned; Please invoke your Lord to withhold it (rain) from us\" The Prophet smiled and said twice or thrice, \"O Allah! Please let it rain round about us and not upon us.\" The clouds started dispersing over Medina to the right and to the left, and it rained round about Medina and not upon Medina. Allah showed them (the people) the miracle of His Prophet and His response to his invocation.",
      "chain": [
        "30171",
        "20469",
        "11019",
        "30132",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6378",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "وقال لي خليفة قال معتمر سمعت أبي، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل نبي سأل سؤلا  أو قال لكل نبي دعوة قد دعا بها  فاستجيب، فجعلت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          that the Prophet said, \"For every prophet there is an invocation that      surely will be responded by Allah,\" (or said), \"For every prophet      there was an invocation with which he appealed to Allah, and his      invocation was accepted (in his lifetime), but I kept my (this      special) invocation to intercede for my followers on the Day of      Resurrection.\"",
      "chain": [
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "6895",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا عمر بن علي‏.‏ وحدثني خليفة، حدثنا عمر بن علي، حدثنا أبو حازم، عن سهل بن سعد الساعدي، قال النبي صلى الله عليه وسلم ‏\"‏ من توكل لي ما بين رجليه وما بين لحييه، توكلت له بالجنة ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Whoever guarantees me (the chastity of) what is between his legs (i.e. his private parts), and what is between his jaws (i.e., his tongue), I guarantee him Paradise.\"",
      "chain": [
        "30161",
        "30132",
        "20265",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "7100",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أزهر، عن ابن عون، ح وحدثني خليفة، حدثنا معاذ، حدثنا ابن عون، عن محمد، حدثنا قيس بن عباد، عن عبد الله بن سلام، قال رأيت كأني في روضة، وسط الروضة عمود في أعلى العمود عروة، فقيل لي ارقه‏.‏ قلت لا أستطيع‏.‏ فأتاني وصيف فرفع ثيابي فرقيت، فاستمسكت بالعروة، فانتبهت وأنا مستمسك بها، فقصصتها على النبي صلى الله عليه وسلم فقال ‏\"‏ تلك الروضة روضة الإسلام، وذلك العمود عمود الإسلام، وتلك العروة عروة الوثقى، لا تزال مستمسكا بالإسلام حتى تموت ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Salam:                     (In a dream) I saw myself in a garden, and there was a pillar in the middle of the garden, and there was a handhold at the top of the pillar. I was asked to climb it. I said, \"I cannot.\" Then a servant came and lifted up my clothes and I climbed (the pillar), and then got hold of the handhold, and I woke up while still holding it. I narrated that to the Prophet who said, \"The garden symbolizes the garden of Islam, and the handhold is the firm Islamic handhold which indicates that you will be adhering firmly to Islam until you die.\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "30132",
        "32",
        "11071",
        "11035",
        "11609",
        "103"
      ]
    },
    {
      "hadith_no": "7180",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، ومعتمر، عن أبيه، عن قتادة، أن أنسا، حدثهم عن النبي صلى الله عليه وسلم بهذا وقال عائذا بالله من شر الفتن‏.‏",
      "text_en": "",
      "chain": [
        "30132",
        "20304",
        "11168",
        "20288",
        "11289",
        "11019"
      ]
    },
    {
      "hadith_no": "7601",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا موسى، حدثنا معتمر، وقال، لم يبتئر‏.‏ وقال خليفة حدثنا معتمر، وقال، لم يبتئز‏.‏ فسره قتادة لم يدخر‏.‏",
      "text_en": "",
      "chain": [
        "20040",
        "20288",
        "30132",
        "20288"
      ]
    },
    {
      "hadith_no": "7634",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن أبي العالية، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم فيما يرويه عن ربه قال ‏\"‏ لا ينبغي لعبد أن يقول إنه خير من يونس بن متى ‏\"‏‏.‏ ونسبه إلى أبيه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said that his Lord said: \"It does not befit a slave that he should say that he is better than Jonah (Yunus) bin Matta.",
      "chain": [
        "30329",
        "20020",
        "30132",
        "20304",
        "11168",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "7648",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وقال لي خليفة بن خياط حدثنا معتمر، سمعت أبي، عن قتادة، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لما قضى الله الخلق كتب كتابا عنده غلبت  أو قال سبقت  رحمتي غضبي‏.‏ فهو عنده فوق العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"Before Allah created the creations, He wrote a Book (wherein He has written): My Mercy has preceded my Anger.\" and that (Book) is written with Him over the Throne.\"",
      "chain": [
        "30132",
        "20288",
        "11289",
        "11019",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "5305",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمود بن غيلان، قال أنبأنا النضر بن شميل، قال أنبأنا شعبة، قال حدثنا خليفة، قال سمعت عبد الله بن الزبير، قال لا تلبسوا نساءكم الحرير فإني سمعت عمر بن الخطاب يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من لبسه في الدنيا لم يلبسه في الآخرة ‏\"‏ ‏.‏",
      "text_en": " Khalifah said:                     \"I heard 'Abdullah bin Az-Zubair say: 'Do not let your womenfolk wear silk, for I heard 'Umar bin Al-Khattab say: The Messenger of Allah [SAW] said: Whoever wears it in this world will not wear it in the Hereafter.'\"",
      "chain": [
        "30277",
        "20291",
        "20020",
        "30132",
        "106",
        "3"
      ]
    }
  ],
  "total_hadiths": 20
}