{
  "id": "30137",
  "name": "Sulaiman bin Da'ud al-'Atki al-Zahrani سليمان بن داود أبو الربيع الزهراني",
  "full_name": "Sulaiman bin Da'ud al-'Atki al-Zahrani سليمان بن داود أبو الربيع الزهراني",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": [
        "140 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "234",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]",
      "Hadith"
    ],
    "tags": [
      "al-Zahrani",
      "al-'Atki",
      "al-Basri",
      "Baghdad",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20313",
      "name": "Isma'il bin Zakaria bin Mrh إسماعيل بن زكريا بن مرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20745",
      "name": "Y'aqub bin 'Abdullah يعقوب بن عبد الله بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "15551",
      "name": "Mnswr bin Abi al-Aswad منصور بن أبي الأسود الليثي الكوفي يقال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "33",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان أبو الربيع، قال حدثنا إسماعيل بن جعفر، قال حدثنا نافع بن مالك بن أبي عامر أبو سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The signs of a hypocrite are three:     1. Whenever he speaks, he tells a lie.     2. Whenever he promises, he always breaks it (his promise ).     3. If you trust him, he proves to be dishonest. (If you keep something     as a trust with him, he will not return it.)\"",
      "chain": [
        "30137",
        "20155",
        "11445",
        "11443",
        "13"
      ]
    },
    {
      "hadith_no": "2661",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود وأفهمني بعضه أحمد حدثنا فليح بن سليمان، عن ابن شهاب الزهري، عن عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص الليثي، وعبيد الله بن عبد الله بن عتبة، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله منه، قال الزهري، وكلهم حدثني طائفة من حديثها وبعضهم أوعى من بعض، وأثبت له اقتصاصا، وقد وعيت عن كل واحد منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا‏.‏ زعموا أن عائشة قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج سفرا أقرع بين أزواجه، فأيتهن خرج سهمها خرج بها معه، فأقرع بيننا في غزاة غزاها فخرج سهمي، فخرجت معه بعد ما أنزل الحجاب، فأنا أحمل في هودج وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك، وقفل ودنونا من المدينة، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل، فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى الرحل، فلمست صدري، فإذا عقد لي من جزع أظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، فأقبل الذين يرحلون لي، فاحتملوا هودجي فرحلوه على بعيري الذي كنت أركب، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يثقلن ولم يغشهن اللحم، وإنما يأكلن العلقة من الطعام، فلم يستنكر القوم حين رفعوه ثقل الهودج فاحتملوه وكنت جارية حديثة السن، فبعثوا الجمل وساروا، فوجدت عقدي بعد ما استمر الجيش، فجئت منزلهم وليس فيه أحد، فأممت منزلي الذي كنت به فظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة غلبتني عيناى فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني، وكان يراني قبل الحجاب فاستيقظت باسترجاعه حين أناخ راحلته، فوطئ يدها فركبتها فانطلق يقود بي الراحلة، حتى أتينا الجيش بعد ما نزلوا معرسين في نحر الظهيرة، فهلك من هلك، وكان الذي تولى الإفك عبد الله بن أبى ابن سلول، فقدمنا المدينة فاشتكيت بها شهرا، يفيضون من قول أصحاب الإفك، ويريبني في وجعي أني لا أرى من النبي صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أمرض، إنما يدخل فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏‏.‏ لا أشعر بشىء من ذلك حتى نقهت، فخرجت أنا وأم مسطح قبل المناصع متبرزنا، لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا، وأمرنا أمر العرب الأول في البرية أو في التنزه، فأقبلت أنا وأم مسطح بنت أبي رهم نمشي، فعثرت في مرطها فقالت تعس مسطح، فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت يا هنتاه ألم تسمعي ما قالوا فأخبرتني بقول أهل الإفك، فازددت مرضا إلى مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم فقال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت ائذن لي إلى أبوى‏.‏ قالت وأنا حينئذ أريد أن أستيقن الخبر من قبلهما، فأذن لي رسول الله صلى الله عليه وسلم فأتيت أبوى فقلت لأمي ما يتحدث به الناس فقالت يا بنية هوني على نفسك الشأن، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا أكثرن عليها‏.‏ فقلت سبحان الله ولقد يتحدث الناس بهذا قالت فبت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم، ثم أصبحت فدعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى، يستشيرهما في فراق أهله، فأما أسامة فأشار عليه بالذي يعلم في نفسه من الود لهم، فقال أسامة أهلك يا رسول الله ولا نعلم والله إلا خيرا، وأما علي بن أبي طالب فقال يا رسول الله لم يضيق الله عليك والنساء سواها كثير، وسل الجارية تصدقك‏.‏ فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ يا بريرة هل رأيت فيها شيئا يريبك ‏\"‏‏.‏ فقالت بريرة لا والذي بعثك بالحق، إن رأيت منها أمرا أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن العجين فتأتي الداجن فتأكله‏.‏ فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى ابن سلول فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعذرني من رجل بلغني أذاه في أهلي، فوالله ما علمت على أهلي إلا خيرا، وقد ذكروا رجلا ما علمت عليه إلا خيرا، وما كان يدخل على أهلي إلا معي ‏\"‏‏.‏ فقام سعد بن معاذ فقال يا رسول الله أنا والله أعذرك منه، إن كان من الأوس ضربنا عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا فيه أمرك‏.‏ فقام سعد بن عبادة وهو سيد الخزرج، وكان قبل ذلك رجلا صالحا ولكن احتملته الحمية فقال كذبت لعمر الله، لا تقتله ولا تقدر على ذلك، فقام أسيد بن الحضير فقال كذبت لعمر الله، والله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ فثار الحيان الأوس والخزرج حتى هموا، ورسول الله صلى الله عليه وسلم على المنبر فنزل فخفضهم حتى سكتوا وسكت، وبكيت يومي لا يرقأ لي دمع ولا أكتحل بنوم، فأصبح عندي أبواى، قد بكيت ليلتين ويوما حتى أظن أن البكاء فالق كبدي  قالت  فبينا هما جالسان عندي وأنا أبكي إذ استأذنت امرأة من الأنصار فأذنت لها، فجلست تبكي معي، فبينا نحن كذلك إذ دخل رسول الله صلى الله عليه وسلم فجلس، ولم يجلس عندي من يوم قيل في ما قيل قبلها، وقد مكث شهرا لا يوحى إليه في شأني شىء  قالت  فتشهد ثم قال ‏\"‏ يا عائشة فإنه بلغني عنك كذا وكذا، فإن كنت بريئة فسيبرئك الله، وإن كنت ألممت فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف بذنبه ثم تاب تاب الله عليه ‏\"‏‏.‏ فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة وقلت لأبي أجب عني رسول الله صلى الله عليه وسلم‏.‏ قال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي عني رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ قالت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن فقلت إني والله لقد علمت أنكم سمعتم ما يتحدث به الناس، ووقر في أنفسكم وصدقتم به، ولئن قلت لكم إني بريئة‏.‏ والله يعلم إني لبريئة لا تصدقوني بذلك، ولئن اعترفت لكم بأمر، والله يعلم أني بريئة لتصدقني والله ما أجد لي ولكم مثلا إلا أبا يوسف إذ قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت على فراشي، وأنا أرجو أن يبرئني الله، ولكن والله ما ظننت أن ينزل في شأني وحيا، ولأنا أحقر في نفسي من أن يتكلم بالقرآن في أمري، ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله، فوالله ما رام مجلسه ولا خرج أحد من أهل البيت حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه مثل الجمان من العرق في يوم شات، فلما سري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكان أول كلمة تكلم بها أن قال لي ‏\"‏ يا عائشة، احمدي الله فقد برأك الله ‏\"‏‏.‏ فقالت لي أمي قومي إلى رسول الله صلى الله عليه وسلم‏.‏ فقلت لا والله، لا أقوم إليه، ولا أحمد إلا الله فأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك عصبة منكم‏}‏ الآيات، فلما أنزل الله هذا في براءتي قال أبو بكر الصديق  رضى الله عنه  وكان ينفق على مسطح بن أثاثة لقرابته منه والله لا أنفق على مسطح شيئا أبدا بعد ما قال لعائشة‏.‏ فأنزل الله تعالى ‏{‏ولا يأتل أولو الفضل منكم والسعة‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ فقال أبو بكر بلى، والله إني لأحب أن يغفر الله لي، فرجع إلى مسطح الذي كان يجري عليه‏.‏ وكان رسول الله صلى الله عليه وسلم يسأل زينب بنت جحش عن أمري، فقال ‏\"‏ يا زينب، ما علمت ما رأيت ‏\"‏‏.‏ فقالت يا رسول الله، أحمي سمعي وبصري، والله ما علمت عليها إلا خيرا، قالت وهى التي كانت تساميني، فعصمها الله بالورع‏.‏   قال وحدثنا فليح، عن هشام بن عروة، عن عروة، عن عائشة، وعبد الله بن الزبير، مثله‏.‏ قال وحدثنا فليح، عن ربيعة بن أبي عبد الرحمن، ويحيى بن سعيد، عن القاسم بن محمد بن أبي بكر، مثله‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) \"Whenever Allah's Apostle intended to go on a journey, he would draw lots amongst his wives and would take with him the one upon whom the lot fell. During a Ghazwa of his, he drew lots amongst us and the lot fell upon me, and I proceeded with him after Allah had decreed the use of the veil by women. I was carried in a Howdah (on the camel) and dismounted while still in it. When Allah's Apostle was through with his Ghazwa and returned home, and we approached the city of Medina, Allah's Apostle ordered us to proceed at night. When the order of setting off was given, I walked till I was past the army to answer the call of nature. After finishing I returned (to the camp) to depart (with the others) and suddenly realized that my necklace over my chest was missing. So, I returned to look for it and was delayed because of that. The people who used to carry me on the camel, came to my Howdah and put it on the back of the camel, thinking that I was in it, as, at that time, women were light in weight, and thin and lean, and did not use to eat much. So, those people did not feel the difference in the heaviness of the Howdah while lifting it, and they put it over the camel. At that time I was a young lady. They set the camel moving and proceeded on. I found my necklace after the army had gone, and came to their camp to find nobody. So, I went to the place where I used to stay, thinking that they would discover my absence and come back in my search. While in that state, I felt sleepy and slept. Safwan bin Mu'attal As-Sulami Adh-Dhakwani was behind the army and reached my abode in the morning. When he saw a sleeping person, he came to me, and he used to see me before veiling. So, I got up when I heard him saying, \"Inna lil-lah-wa inn a ilaihi rajiun (We are for Allah, and we will return to Him).\" He made his camel knell down. He got down from his camel, and put his leg on the front legs of the camel and then I rode and sat over it. Safwan set out walking, leading the camel by the rope till we reached the army who had halted to take rest at midday. Then whoever was meant for destruction, fell into destruction, (some people accused me falsely) and the leader of the false accusers was `Abdullah bin Ubai bin Salul. After that we returned to Medina, and I became ill for one month while the people were spreading the forged statements of the false accusers. I was feeling during my ailment as if I were not receiving the usual kindness from the Prophet which I used to receive from him when I got sick. But he would come, greet and say, 'How is that (girl)?' I did not know anything of what was going on till I recovered from my ailment and went out with Um Mistah to the Manasi where we used to answer the call of nature, and we used not to go to answer the call of nature except from night to night and that was before we had lavatories near to our houses. And this habit of ours was similar to the habit of the old 'Arabs in the open country (or away from houses). So. I and Um Mistah bint Ruhm went out walking. Um Mistah stumbled because of her long dress and on that she said, 'Let Mistah be ruined.' I said, 'You are saying a bad word. Why are you abusing a man who took part in (the battle of) Badr?' She said, 'O Hanata (you there) didn't you hear what they said?' Then she told me the rumors of the false accusers. My sickness was aggravated, and when I returned home, Allah's Apostle came to me, and after greeting he said, 'How is that (girl)?' I requested him to allow me to go to my parents. I wanted then to be sure of the news through them I Allah's Apostle allowed me, and I went to my parents and asked my mother, 'What are the people talking about?' She said, 'O my daughter! Don't worry much about this matter. By Allah, never is there a charming woman loved by her husband who has other wives, but the women would forge false news about her.' I said, 'Glorified be Allah! Are the people really taking of this matter?' That night I kept on weeping and could not sleep till morning. In the morning Allah's Apostle called `Ali bin Abu Talib and Usama bin Zaid when he saw the Divine Inspiration delayed, to consul them about divorcing his wife (i.e. `Aisha). Usama bin Zaid said what he knew of the good reputation of his wives and added, 'O Allah's Apostle! Keep you wife, for, by Allah, we know nothing about her but good.' `Ali bin Abu Talib said, 'O Allah's Apostle! Allah has no imposed restrictions on you, and there are many women other than she, yet you may ask the woman-servant who will tell you the truth.' On that Allah's Apostle called Buraira and said, 'O Burair. Did you ever see anything which roused your suspicions about her?' Buraira said, 'No, by Allah Who has sent you with the Truth, I have never seen in her anything faulty except that she is a girl of immature age, who sometimes sleeps and leaves the dough for the goats to eat.' On that day Allah's Apostle ascended the pulpit and requested that somebody support him in punishing `Abdullah bin Ubai bin Salul. Allah's Apostle said, 'Who will support me to punish that person (`Abdullah bin Ubai bin Salul) who has hurt me by slandering the reputation of my family? By Allah, I know nothing about my family but good, and they have accused a person about whom I know nothing except good, and he never entered my house except in my company.' Sa`d bin Mu`adh got up and said, 'O Allah's Apostle! by Allah, I will relieve you from him. If that man is from the tribe of the Aus, then we will chop his head off, and if he is from our brothers, the Khazraj, then order us, and we will fulfill your order.' On that Sa`d bin 'Ubada, the chief of the Khazraj and before this incident, he had been a pious man, got up, motivated by his zeal for his tribe and said, 'By Allah, you have told a lie; you cannot kill him, and you will never be able to kill him.' On that Usaid bin Al-Hadir got up and said (to Sa`d bin 'Ubada), 'By Allah! you are a liar. By Allah, we will kill him; and you are a hypocrite, defending the hypocrites.' On this the two tribes of Aus and Khazraj got excited and were about to fight each other, while Allah's Apostle was standing on the pulpit. He got down and quieted them till they became silent and he kept quiet. On that day I kept on weeping so much so that neither did my tears stop, nor could I sleep. In the morning my parents were with me and I had wept for two nights and a day, till I thought my liver would burst from weeping. While they were sitting with me and I was weeping, an Ansari woman asked my permission to enter, and I allowed her to come in. She sat down and started weeping with me. While we were in this state, Allah's Apostle came and sat down and he had never sat with me since the day they forged the accusation. No revelation regarding my case came to him for a month. He recited Tashah-hud (i.e. None has the right to be worshipped but Allah and Muhammad is His Apostle) and then said, 'O `Aisha! I have been informed such-and-such about you; if you are innocent, then Allah will soon reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him to forgive you, for when a person confesses his sin and asks Allah for forgiveness, Allah accepts his repentance.' When Allah's Apostle finished his speech my tears ceased completely and there remained not even a single drop of it. I requested my father to reply to Allah's Apostle on my behalf. My father said, By Allah, I do not know what to say to Allah's Apostle.' I said to my mother, 'Talk to Allah's Apostle on my behalf.' She said, 'By Allah, I do not know what to say to Allah's Apostle. I was a young girl and did not have much knowledge of the Qur'an. I said. 'I know, by Allah, that you have listened to what people are saying and that has been planted in your minds and you have taken it as a truth. Now, if I told you that I am innocent and Allah knows that I am innocent, you would not believe me and if I confessed to you falsely that I am guilty, and Allah knows that I am innocent you would believe me. By Allah, I don't compare my situation with you except to the situation of Joseph's father (i.e. Jacob) who said, 'So (for me) patience is most fitting against that which you assert and it is Allah (Alone) whose help can be sought.' Then I turned to the other side of my bed hoping that Allah would prove my innocence. By Allah I never thought that Allah would reveal Divine Inspiration in my case, as I considered myself too inferior to be talked of in the Holy Qur'an. I had hoped that Allah's Apostle might have a dream in which Allah would prove my innocence. By Allah, Allah's Apostle had not got up and nobody had left the house before the Divine Inspiration came to Allah's Apostle. So, there overtook him the same state which used to overtake him, (when he used to have, on being inspired divinely). He was sweating so much so that the drops of the sweat were dropping like pearls though it was a (cold) wintry day. When that state of Allah's Apostle was over, he was smiling and the first word he said, `Aisha! Thank Allah, for Allah has declared your innocence.' My mother told me to go to Allah's Apostle . I replied, 'By Allah I will not go to him and will not thank but Allah.' So Allah revealed: \"Verily! They who spread the slander are a gang among you . . .\" (24.11) When Allah gave the declaration of my Innocence, Abu Bakr, who used to provide for Mistah bin Uthatha for he was his relative, said, 'By Allah, I will never provide Mistah with anything because of what he said about Aisha.' But Allah later revealed: -- \"And let not those who are good and wealthy among you swear not to help their kinsmen, those in need and those who left their homes in Allah's Cause. Let them forgive and overlook. Do you not wish that Allah should forgive you? Verily! Allah is Oft-forgiving, Most Merciful.\" (24.22) After that Abu Bakr said, 'Yes ! By Allah! I like that Allah should forgive me,' and resumed helping Mistah whom he used to help before. Allah's Apostle also asked Zainab bint Jahsh (i.e. the Prophet's wife about me saying, 'What do you know and what did you see?' She replied, 'O Allah's Apostle! I refrain to claim hearing or seeing what I have not heard or seen. By Allah, I know nothing except goodness about Aisha.\" Aisha further added \"Zainab was competing with me (in her beauty and the Prophet's love), yet Allah protected her (from being malicious), for she had piety.\"",
      "chain": [
        "30137",
        "20169",
        "10511",
        "11002",
        "11042",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "3925",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو الربيع، حدثنا ابن عيينة، عن ابن جريج، عن عطاء، عن جابر  رضى الله عنه  قال النبي صلى الله عليه وسلم حين مات النجاشي ‏\"‏ مات اليوم رجل صالح، فقوموا فصلوا على أخيكم أصحمة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     When Negus died, the Prophet said, \"Today a pious man has died. So get up and offer the funeral prayer for your brother Ashama.\"",
      "chain": [
        "30137",
        "20005",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "191",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الربيع الزهراني، أنبأنا حماد، حدثنا أيوب، حدثنا محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ جاء أهل اليمن هم أرق أفئدة الإيمان يمان والفقه يمان والحكمة يمانية ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah observed:                      There have come the people of Yemen; they are tender of hearts, the belief is that of the Yemenites, the understanding (of the faith) is that of the Yemenites and sagacity is that of the Yemenites.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "260",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو الربيع الزهراني، حدثنا حماد بن زيد، حدثنا هشام بن عروة، ح وحدثنا خلف بن هشام، - واللفظ له - حدثنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن أبي مراوح الليثي، عن أبي ذر، قال قلت يا رسول الله أى الأعمال أفضل قال ‏\"‏ الإيمان بالله والجهاد في سبيله ‏\"‏ ‏.‏ قال قلت أى الرقاب أفضل قال ‏\"‏ أنفسها عند أهلها وأكثرها ثمنا ‏\"‏ ‏.‏ قال قلت فإن لم أفعل قال ‏\"‏ تعين صانعا أو تصنع لأخرق ‏\"‏ ‏.‏ قال قلت يا رسول الله أرأيت إن ضعفت عن بعض العمل قال ‏\"‏ تكف شرك عن الناس فإنها صدقة منك على نفسك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I said: Messenger of Allah, which of the deeds is the best? He (the Holy Prophet) replied: Belief in Allah and Jihad in His cause. I again asked: Who is the slave whose emancipation is the best? He (the Holy Prophet) replied: One who is valuable for his master and whose price is high. I said: If I can't afford to do it? He (the Holy Prophet) replied: Help an artisan or make anything for the unskilled (labourer). I (Abu Dharr) said: Messenger of Allah, you see that I am helpless in doing some of these deeds. He (the Holy Prophet) replied: Desist from doing mischief to the people. That is the charity of your person on your behalf.",
      "chain": [
        "30137",
        "20022",
        "11065",
        "30503",
        "20022",
        "11065",
        "10511",
        "23"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا عباد، - وهو ابن العوام - حدثنا الشيباني، قال سألت زر بن حبيش عن قول الله، عز وجل ‏{‏ فكان قاب قوسين أو أدنى‏}‏ قال أخبرني ابن مسعود أن النبي صلى الله عليه وسلم رأى جبريل له ستمائة جناح ‏.‏",
      "text_en": " Al-Shaibini reported to us:                      I asked Zirr b. Hubaish about the words of Allah (the Mighty and Great):\" So he was (at a distance) of two bows or nearer\" (al-Qur'an, Iiii 8). He said: Ibn Mas'ud informed me that, verily, the Apostle of Allah (may peace be upon him) saw Gabriel and he had six hundred wings.",
      "chain": [
        "30137",
        "20431",
        "11352",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الربيع، حدثنا حماد بن زيد، قال قلت لعمرو بن دينار أسمعت جابر بن عبد الله يحدث عن رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يخرج قوما من النار بالشفاعة ‏\"‏ ‏.‏ قال نعم ‏.‏",
      "text_en": " Hammad b. Zaid, reported:                      I said to 'Amr b. Dinar: Did you hear Jabir b. 'Abdullah narrating from the Messenger of Allah (may peace be upon him) that Allah would bring out people from the Fire through intercession. He said: Yes.",
      "chain": [
        "30137",
        "20022"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا حماد، عن أيوب، عن أبي قلابة، عن معاذة، ح وحدثنا حماد، عن يزيد الرشك، عن معاذة، أن امرأة، سألت عائشة فقالت أتقضي إحدانا الصلاة أيام محيضها فقالت عائشة أحرورية أنت قد كانت إحدانا تحيض على عهد رسول الله صلى الله عليه وسلم ثم لا تؤمر بقضاء ‏.‏",
      "text_en": " Mu'adha reported:                      A woman asked 'A'isha: Should one amongst us complete prayers abandoned during the period of menses? 'A'isha said: Are you a Haruriya? When any one of us during the time of the Messenger of Allah (may peace be upon him) was in her menses (and abandoned prayer) she was not required to complete them.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11047",
        "11456",
        "20022",
        "11319",
        "11456"
      ]
    },
    {
      "hadith_no": "346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا حماد، حدثنا هشام بن عروة، ح وحدثنا أبو كريب، محمد بن العلاء - واللفظ له - حدثنا أبو معاوية، حدثنا هشام، عن أبيه، عن أبي أيوب، عن أبى بن كعب، قال سألت رسول الله صلى الله عليه وسلم عن الرجل يصيب من المرأة ثم يكسل فقال ‏\"‏ يغسل ما أصابه من المرأة ثم يتوضأ ويصلي ‏\"‏ ‏.‏",
      "text_en": " Ubayy Ibn Ka'b reported:                      I arked the Messenger of Allah (may peace be upon him) about a man who has sexual intercourse with his wife, but leaves her before orgasm. Upon this he (the Holy Prophet) said: He should wash the secretion of his wife, and then perform ablution and ofier prayer.",
      "chain": [
        "30137",
        "20022",
        "11065",
        "20354",
        "11065",
        "10511",
        "33",
        "39"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو الربيع الزهراني، قال يحيى أخبرنا حماد بن زيد، وقال أبو الربيع، حدثنا حماد، عن عمرو بن دينار، عن سعيد بن الحويرث، عن ابن عباس، أن النبي صلى الله عليه وسلم خرج من الخلاء فأتي بطعام فذكروا له الوضوء فقال ‏\"‏ أريد أن أصلي فأتوضأ ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Apostle of Allah (may peace be upon him) came out of the privy, and he was presented with some food, and the people reminded him about ablution, but he said: Am I to say prayer that I should perform ablution?",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "30137",
        "20022",
        "11081",
        "10640",
        "17"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا حماد يعني ابن زيد، ح وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن نمير، ح وحدثنا ابن نمير، قال حدثنا أبي جميعا، عن هشام بن عروة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith is narrated with the same chain of transmitters by Hisham b. 'Urwa.",
      "chain": [
        "30137",
        "20022",
        "30201",
        "30216",
        "30212",
        "30212",
        "11065"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع الزهراني، وقتيبة بن سعيد، كلهم عن حماد، - قال خلف حدثنا حماد بن زيد، - عن محمد بن زياد، حدثنا أبو هريرة، قال قال محمد صلى الله عليه وسلم ‏\"‏ أما يخشى الذي يرفع رأسه قبل الإمام أن يحول الله رأسه رأس حمار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Does the man who lifts his head ahead of the Imam (from prostration) not fear that Allah may change his head into the head of an ass?",
      "chain": [
        "30503",
        "30137",
        "30367",
        "20022",
        "20022",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو الربيع الزهراني، قال أبو الربيع حدثنا حماد، حدثنا أيوب، عن عمرو بن دينار، عن جابر بن عبد الله، قال كان معاذ يصلي مع رسول الله صلى الله عليه وسلم العشاء ثم يأتي مسجد قومه فيصلي بهم ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      Mu'adh said the night prayer with the Messenger of Allah (may peace be upon him). He then came to the mosque of his people and led them in prayer.",
      "chain": [
        "30367",
        "30137",
        "30137",
        "20022",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "469",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا خلف بن هشام، وأبو الربيع الزهراني، قالا حدثنا حماد بن زيد، عن عبد العزيز بن صهيب، عن أنس، أن النبي صلى الله عليه وسلم كان يوجز في الصلاة ويتم ‏.‏",
      "text_en": " Anas reported:                      The Apostle of Allah (may peace be upon him) used to be brief and perfect in prayer.",
      "chain": [
        "30503",
        "30137",
        "20022",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا يحيى بن يحيى، وأبو الربيع الزهراني، قال يحيى أخبرنا وقال أبو الربيع، حدثنا حماد بن زيد، عن عمرو بن دينار، عن طاوس، عن ابن عباس، قال أمر النبي صلى الله عليه وسلم أن يسجد على سبعة ونهي أن يكف شعره وثيابه ‏.‏ هذا حديث يحيى ‏.‏ وقال أبو الربيع على سبعة أعظم ونهي أن يكف شعره وثيابه الكفين والركبتين والقدمين والجبهة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Apostle of Allah (may peace be upon him) had been commanded that he should prostrate on the seven (bones) and he was forbidden to fold back the hair and clothing. And in the narration transmitted by Abu Rabi' (the words are):\" on the seven bones and I was forbidden to fold back the hair and clothing\". According to Abu'l-Rabi' (the seven bones are): The hands, the knees, and the (extremities) of the feet and the forehead.",
      "chain": [
        "30399",
        "30137",
        "20031",
        "30137",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا عباد بن العوام، حدثنا سعيد بن يزيد أبو مسلمة، قال سألت أنسا ‏.‏ بمثله ‏.‏",
      "text_en": " Sa'd b. Yazid Abu Mas'ama reported:                      I said to Anas like (that mentioned above).",
      "chain": [
        "30137",
        "20431"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا حماد، حدثنا يحيى بن سعيد، عن عبد الرحمن الأعرج، عن عبد الله بن مالك ابن بحينة الأزدي، أن رسول الله صلى الله عليه وسلم قام في الشفع الذي يريد أن يجلس في صلاته فمضى في صلاته فلما كان في آخر الصلاة سجد قبل أن يسلم ثم سلم ‏.‏",
      "text_en": " 'Abdullah b. Malik ibn Buhaina al-Asadi reported:                      The Messenger of Allah (may peace be upon him) stood up (at the end of two rak'ahs) when he had to sit and proceeded on with the prayer. But when he was at the end of the prayer, he performed a prostration before the salutation and then pronounced the salutation.",
      "chain": [
        "30137",
        "20022",
        "20031",
        "11197"
      ]
    },
    {
      "hadith_no": "1317",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن محمد، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم إحدى صلاتى العشي ‏.‏ بمعنى حديث سفيان ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) led us in one of the evening prayers. And this hadith was narrated like one transmitted by Sufyan.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، ح قال وحدثني أبو الربيع الزهراني، وأبو كامل الجحدري قالا حدثنا حماد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله ‏\"‏ كيف أنت إذا كانت عليك أمراء يؤخرون الصلاة عن وقتها أو يميتون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قلت فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصل فإنها لك نافلة ‏\"‏ ‏.‏ ولم يذكر خلف عن وقتها ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: How would you act when you are under the rulers who would delay the prayer beyond its prescribed time, or they would make prayer a dead thing as far as its proper time is concerned? I said: What do you command? He (the Holy Prophet) said: Observe the prayer at Its proper time, and if you can say it along with them do so, for it would be a superetogatory prayer for you. Khalaf (one of the narrators in the above hadith) has not mentioned\" beyond their (prescribed) time\".",
      "chain": [
        "30503",
        "20022",
        "30137",
        "30559",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "1568",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو الربيع الزهراني، وخلف بن هشام، قالا حدثنا حماد، عن أيوب، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted by Ayyub with the same chain of narrator.",
      "chain": [
        "30137",
        "30503",
        "20022"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وقتيبة بن سعيد، قال يحيى أخبرنا وقال الآخرون، حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Allah has prescribed the prayer through the word of your Prophet (may peace be upon him) as four rak'ahs when resident, two when travelling, and one when danger is present.",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30367",
        "20031",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1613",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع الزهراني، وقتيبة بن سعيد، قالوا حدثنا حماد، وهو ابن زيد ح وحدثني زهير بن حرب، ويعقوب بن إبراهيم، قالا حدثنا إسماعيل، كلاهما عن أيوب، عن أبي قلابة، عن أنس، أن رسول الله صلى الله عليه وسلم صلى الظهر بالمدينة أربعا وصلى العصر بذي الحليفة ركعتين ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) said four rak'ahs in the noon prayer while at Medina, but he offered two rak'ahs in the afternoon prayer at Dhu'l-Hulaifa.",
      "chain": [
        "30503",
        "30137",
        "30367",
        "20022",
        "30022",
        "20184",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1669",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر والمغرب والعشاء ‏.‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) observed in Medina seven (rak'ahs) and eight (rak'ahs), i. e. (be combined) the noon and afternoon prayers (eight rak'ahs) and the sunset and 'Isha' prayers (seven rak'ahs).",
      "chain": [
        "30137",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1670",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، عن الزبير بن الخريت، عن عبد الله بن شقيق، قال خطبنا ابن عباس يوما بعد العصر حتى غربت الشمس وبدت النجوم وجعل الناس يقولون الصلاة الصلاة - قال - فجاءه رجل من بني تميم لا يفتر ولا ينثني الصلاة الصلاة ‏.‏ فقال ابن عباس أتعلمني بالسنة لا أم لك ‏.‏ ثم قال رأيت رسول الله صلى الله عليه وسلم جمع بين الظهر والعصر والمغرب والعشاء ‏.‏ قال عبد الله بن شقيق فحاك في صدري من ذلك شىء فأتيت أبا هريرة فسألته فصدق مقالته ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      Ibn 'Abbas one day addressed us in the afternoon (after the afternoon prayer) till the sun disappeared and the stars appeared, and the people began to say: Prayer, prayer. A person from Banu Tamim came there. He neither slackened nor turned away, but (continued crying): Prayer, prayer. Ibn 'Abbas said: May you be deprived of your mother, do you teach me Sunnah? And then he said: I saw the Messenger of Allah (may peace be upon him) combining the noon and afternoon prayers and the sunset and 'Isha' prayers. 'Abdullah b. Shaqiq said: Some doubt was created in my mind about it. So I came to Abu Huraira and asked him (about it) and he testified his assertion.",
      "chain": [
        "30137",
        "20022",
        "11587",
        "10694"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الربيع الزهراني، أخبرنا حماد يعني ابن زيد، ح قال وحدثنا حسن بن الربيع، حدثنا مهدي بن ميمون، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا ابن نمير، جميعا عن هشام بن عروة، ح وحدثني زهير بن حرب، - واللفظ له - قال حدثنا يحيى بن سعيد، عن هشام بن عروة، قال أخبرني أبي، عن عائشة، قالت ما رأيت رسول الله صلى الله عليه وسلم يقرأ في شىء من صلاة الليل جالسا حتى إذا كبر قرأ جالسا حتى إذا بقي عليه من السورة ثلاثون أو أربعون آية قام فقرأهن ثم ركع ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to pray while sitting (when he grew old) and he recited in this position and when the recitation equal to thirty or forty verses was left, he would then stand up and recite (for this duration) in a standing position and then bowed himself and then prostrated himself and did the same in the second rak'ah.",
      "chain": [
        "30137",
        "20022",
        "11307",
        "30201",
        "20032",
        "30216",
        "11065",
        "30022",
        "20031",
        "11065"
      ]
    },
    {
      "hadith_no": "1786",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، وبديل، عن عبد الله بن شقيق، عن عبد الله بن عمر، أن رجلا، سأل النبي صلى الله عليه وسلم وأنا بينه وبين السائل فقال يا رسول الله كيف صلاة الليل قال ‏\"‏ مثنى مثنى فإذا خشيت الصبح فصل ركعة واجعل آخر صلاتك وترا ‏\"‏ ‏.‏ ثم سأله رجل على رأس الحول وأنا بذلك المكان من رسول الله صلى الله عليه وسلم فلا أدري هو ذلك الرجل أو رجل آخر فقال له مثل ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30137",
        "20022",
        "11015",
        "10694",
        "18"
      ]
    },
    {
      "hadith_no": "2055",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، قالا حدثنا حماد، - و هو ابن زيد - عن عمرو بن دينار، عن جابر بن عبد الله، قال بينا النبي صلى الله عليه وسلم يخطب يوم الجمعة إذ جاء رجل فقال له النبي صلى الله عليه وسلم ‏\"‏ أصليت يا فلان \"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ قم فاركع ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that while Allah's Messenger (may peace be upon him) was delivering the sermon on Friday a person came there, and the Apostle of Allah (may peace be upon him) said to him:                      So and so, have you prayed (two rak'ahs)? He said: No. He (the Holy Prophet) said: Then stand and pray.",
      "chain": [
        "30137",
        "30367",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "2091",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "حدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن محمد، عن أم عطية، قالت أمرنا - تعني النبي صلى الله عليه وسلم - أن نخرج في العيدين العواتق وذوات الخدور وأمر الحيض أن يعتزلن مصلى المسلمين ‏.‏",
      "text_en": " Umm 'Atiyya said:                      He (the Apostle of Allah) commanded us that we should take out unmarried women and purdah-observing ladies for 'Id prayers, and he commanded the menstruating women to remain away from the place of worship of the Muslims.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "2196",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا خلف بن هشام، وأبو الربيع الزهراني، جميعا عن حماد، - قال خلف حدثنا حماد بن زيد، - عن هشام بن عروة، عن أبيه، قال ذكر عند عائشة قول ابن عمر الميت يعذب ببكاء أهله عليه ‏.‏ فقالت رحم الله أبا عبد الرحمن سمع شيئا فلم يحفظه إنما مرت على رسول الله صلى الله عليه وسلم جنازة يهودي وهم يبكون عليه فقال ‏\"‏ أنتم تبكون وإنه ليعذب ‏\"‏ ‏.‏",
      "text_en": " Hisham b. 'Urwa narrated on the authority of his father that the saying of Ibn 'Umar, viz.\" The dead would be punished because of the lamentation of his family over him\" was mentioned to 'A'isha. Upon this she said:                      May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (may peace be upon him) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.",
      "chain": [
        "30503",
        "30137",
        "20022",
        "20022",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2206",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن محمد، عن أم عطية، قالت أخذ علينا رسول الله صلى الله عليه وسلم مع البيعة ألا ننوح فما وفت منا امرأة إلا خمس أم سليم وأم العلاء وابنة أبي سبرة امرأة معاذ أو ابنة أبي سبرة وامرأة معاذ .‏",
      "text_en": " Umm 'Atiyya reported:                      The Messenger of Allah (may peace be upon him) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are) Umm Sulaim, and Umm al-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "2213",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، ح وحدثنا أبو الربيع الزهراني، وقتيبة، بن سعيد قالا حدثنا حماد، ح وحدثنا يحيى بن أيوب، حدثنا ابن علية، كلهم عن أيوب، عن محمد، عن أم عطية، قالت توفيت إحدى بنات النبي صلى الله عليه وسلم ‏.‏ وفي حديث ابن علية قالت أتانا رسول الله صلى الله عليه وسلم ونحن نغسل ابنته ‏.‏ وفي حديث مالك قالت دخل علينا رسول الله صلى الله عليه وسلم حين توفيت ابنته ‏.‏ بمثل حديث يزيد بن زريع عن أيوب عن محمد عن أم عطية ‏.‏",
      "text_en": " Umm 'Atiyya reported:                      One of the daughters of the Apostle of Allah (may peace be upon him) died. And in the hadith transmitted by Ibn 'Ulayya (the words are): The Messenger of Allah (may peace be upon him) came to us and we were washing his daughter. And in the hadith transmitted by Malik (the words are): There came in (our apartment) the Messenger of Allah (way peace be upon him) when his daughter died. The rest of the hadith is the same as narrated by Yazid b. Zurai' from Ayyub from Muhammad from Umm 'Atiyya.",
      "chain": [
        "30367",
        "20001",
        "30137",
        "30367",
        "20022",
        "20379",
        "11015",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "2244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد يعني ابن زيد، ح وحدثني يحيى بن، يحيى أخبرنا جعفر بن سليمان، كلاهما عن ثابت، عن أنس، قال مر على النبي صلى الله عليه وسلم بجنازة ‏.‏ فذكر بمعنى حديث عبد العزيز عن أنس غير أن حديث عبد العزيز أتم ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30137",
        "20022",
        "30399",
        "20532",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2259",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني أبو الربيع الزهراني، وأبو كامل فضيل بن حسين الجحدري - واللفظ لأبي كامل - قالا حدثنا حماد، - وهو ابن زيد عن ثابت البناني، عن أبي رافع، عن أبي، هريرة أن امرأة، سوداء كانت تقم المسجد - أو شابا - ففقدها رسول الله صلى الله عليه وسلم فسأل عنها - أو عنه - فقالوا مات ‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني ‏\"‏ ‏.‏ قال فكأنهم صغروا أمرها - أو أمره - فقال ‏\"‏ دلوني على قبره ‏\"‏ ‏.‏ فدلوه فصلى عليها ثم قال ‏\"‏ إن هذه القبور مملوءة ظلمة على أهلها وإن الله عز وجل ينورها لهم بصلاتي عليهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that a dark-complexioned woman (or a youth) used to sweep the mosque. The Messenger of Allah (may peace be upon him) missed her (or him) and inquired about her (or him). The people told him that she (or he) had died. He asked why they did not inform him, and it appears as if they had treated her (or him) or her (or his) affairs as of little account. He (the Holy Prophet) said:                      Lead me to her (or his) gtave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.",
      "chain": [
        "30137",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2357",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، كلاهما عن حماد بن زيد، - قال أبو الربيع حدثنا حماد، - حدثنا أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل دينار ينفقه الرجل دينار ينفقه على عياله ودينار ينفقه الرجل على دابته في سبيل الله ودينار ينفقه على أصحابه في سبيل الله ‏\"‏ ‏.‏ قال أبو قلابة وبدأ بالعيال ثم قال أبو قلابة وأى رجل أعظم أجرا من رجل ينفق على عيال صغار يعفهم أو ينفعهم الله به ويغنيهم ‏.‏",
      "text_en": " Thauban reported Allah's Messenger (may peace be upon him) as saying:                      The most excellent dinar is one that a person spends on his family, and the dinar which he spends on his animal in Allah's path, and the dinar he spends on his companions in Allah's path. Abu Qilaba (one of the narrators) said: He (the narrator) started with family, and then Abu Qilaba said: Who is the person with greater reward than a person who spends on young members of his family (and thus) preserves (saves them from want) (and by virtue of which) Allah brings profit for them and makes them rich.",
      "chain": [
        "30137",
        "30367",
        "20022",
        "30137",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "2508",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، قال قتيبة حدثنا أبو عوانة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تكون في أمتي فرقتان فتخرج من بينهما مارقة يلي قتلهم أولاهم بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      There would be two groups in my Ummah, and there would emerge another group (seceding itself from both of them), and the party nearer to the truth among the two would kill them (the group of the Khwarij).",
      "chain": [
        "30137",
        "30367",
        "30367",
        "20469",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2598",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، - يعني ابن زيد - حدثنا عبد الله، بن سوادة القشيري عن أبيه، عن سمرة بن جندب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يغرنكم من سحوركم أذان بلال ولا بياض الأفق المستطيل هكذا حتى يستطير هكذا ‏\"‏ ‏.‏ وحكاه حماد بيديه قال يعني معترضا ‏.‏",
      "text_en": " Samura b. Jundub (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The Adhan of Bilal may not mislead you with regard to your food at the commencement of the fast, nor the vertical (streaks) of whiteness in the horizon (for it is an indication of false dawn). You should stop eating (food) till (the whiteness) spreads like it. Hammad narrated it and with the gesture of his band he explained, the horizontal position (of the streaks of light).",
      "chain": [
        "30137",
        "20022",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2643",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا أبو عوانة، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم عن جرير، كلاهما عن منصور، عن مسلم، عن شتير بن شكل، عن حفصة، - رضى الله عنها - عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Hafsa (Allah be pleased with her) through another chain of transmitters.",
      "chain": [
        "30137",
        "20469",
        "30201",
        "30123",
        "11067",
        "20285",
        "10773",
        "54"
      ]
    },
    {
      "hadith_no": "2682",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا حماد، - وهو ابن زيد - حدثنا هشام، عن أبيه، عن عائشة، - رضى الله عنها - أن حمزة بن عمرو الأسلمي، سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله إني رجل أسرد الصوم ‏.‏ أفأصوم في السفر قال ‏\"‏ صم إن شئت وأفطر إن شئت ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Hamza b. Amr al-Aslami asked the Messenger of Allah (may peace be upon him) thus:                      Messenger of Allah, I am a person devoted much to fasting. Should I fast during the journey? He (the Holy Prophet) said: Fast if you like and break it if you like.",
      "chain": [
        "30137",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2775",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، عن أيوب، وهشام، عن محمد، عن عبد الله بن شقيق، - قال حماد وأظن أيوب قد سمعه من عبد الله بن شقيق، - قال سألت عائشة - رضى الله عنها - عن صوم النبي صلى الله عليه وسلم فقالت كان يصوم حتى نقول قد صام قد صام ‏.‏ ويفطر حتى نقول قد أفطر قد أفطر - قالت - وما رأيته صام شهرا كاملا منذ قدم المدينة إلا أن يكون رمضان ‏.‏",
      "text_en": " Abdullah b. Shaqiq reported. I asked 'A'isha (Allah be pleased with her) about fasting of the Messenger of Allah (may peace be upon him). She said:                      He used to observe fast (at times) so continuously that we said: He has fasted, he has fasted. And (at times) he did not observe fast (for days) and we began to say: He has abandoned fasting, he has abandoned fasting. She said: I did not see him observing fast throughout the whole of the month since he arrived in Medina, but that of Ramadan.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11065",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "2780",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال ما صام رسول الله صلى الله عليه وسلم شهرا كاملا قط غير رمضان ‏.‏ وكان يصوم إذا صام حتى يقول القائل لا والله لا يفطر ‏.‏ ويفطر إذا أفطر حتى يقول القائل لا والله لا يصوم ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with both of them) reported:                      The Messenger of Allah (may peace be upon him) did not fast throughout any month except during ramadan. And when he observed fast (he fasted so continuously) that one would say that he would not break (them) and when he Abandoned, he abandoned (so continuously) that one would say: By Allah, perhaps he would never fast.",
      "chain": [
        "30137",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو الربيع الزهراني، وقتيبة بن سعيد، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن عمرو، عن جابر بن زيد، عن ابن عباس، - رضى الله عنهما - قال سمعت رسول الله صلى الله عليه وسلم وهو يخطب يقول ‏\"‏ السراويل لمن لم يجد الإزار والخفان لمن لم يجد النعلين ‏\"‏ ‏.‏ يعني المحرم ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with both of them) reported:                      I heard Allah's Messenger (may peace be upon him) say as he was delivering an address: So far as the trousers are concerned, one who does not find lower garment, he may wear them; as also socks, he may wear them who does not find shoes. It concerns the Muhrim.",
      "chain": [
        "30399",
        "30137",
        "30367",
        "20022",
        "11449",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2860",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، وأبو الربيع، وقتيبة، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن عمرو بن دينار، عن طاوس، عن ابن عباس، - رضى الله عنهما - قال وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة ولأهل الشام الجحفة ولأهل نجد قرن المنازل ولأهل اليمن يلملم ‏.‏ قال ‏\"‏ فهن لهن ولمن أتى عليهن من غير أهلهن ممن أراد الحج والعمرة فمن كان دونهن فمن أهله وكذا فكذلك حتى أهل مكة يهلون منها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that the Messenger of Allah (may peace be upon him) specified Dhu'l-Hulaifa, for the people of Medina; Juhfa for the people of Syria; Qarn al-Manazil, for the people of Najd; Yalamlam for the people of Yemen (the Mawaqit) and those (Mawaqit) are also meant for those who live at these (places) and for those too who come from without towards them for the sake of Hajj or 'Umra. And those who live within them (within the bounds of these places) or in the suburbs of Mecca or within Mecca, they should enter upon the state of Ihram at these very places.",
      "chain": [
        "30399",
        "30503",
        "30137",
        "20022",
        "11449",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2889",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وخلف بن هشام، وقتيبة، بن سعيد قال يحيى أخبرنا وقال الآخرون، حدثنا حماد بن زيد، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت كأني أنظر إلى وبيص الطيب في مفرق رسول الله صلى الله عليه وسلم وهو محرم ‏.‏ ولم يقل خلف وهو محرم ‏.‏ ولكنه قال وذاك طيب إحرامه ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I still seem to see the glisten- ing of the perfume where the hair parted on Allah's Messenger's (may peace be upon him) head as he was in the state of Ihram, and Khalaf (one of the narrators) did not say: As he was in the state of Ihram, but said: That was the perfume of Ihram.",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30503",
        "30367",
        "20031",
        "20022",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2920",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا حماد، - وهو ابن زيد - حدثنا هشام بن، عروة عن أبيه، عن عائشة، - رضى الله عنها - قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس فواسق يقتلن في الحرم العقرب والفارة والحديا والغراب والكلب العقور ‏\"‏ ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:                      Five are the vicious beasts which should be killed even in the state of Ihram: scorpion, rat, kite, crow and voracious dog.",
      "chain": [
        "30137",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد، - يعني ابن زيد - عن أيوب، ح وحدثني أبو الربيع، حدثنا حماد، حدثنا أيوب، قال سمعت مجاهدا، يحدث عن عبد الرحمن، بن أبي ليلى عن كعب بن عجرة، - رضى الله عنه - قال أتى على رسول الله صلى الله عليه وسلم زمن الحديبية وأنا أوقد تحت - قال القواريري قدر لي ‏.‏ وقال أبو الربيع برمة لي - والقمل يتناثر على وجهي فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏ ‏.‏ قال قلت نعم ‏.‏ قال ‏\"‏ فاحلق وصم ثلاثة أيام أو أطعم ستة مساكين أو انسك نسيكة ‏\"‏ ‏.‏ قال أيوب فلا أدري بأى ذلك بدأ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) came to me on the occasion of Hudaibiya and I was kindling fire under my cooking pot and lice were creeping on my face. Thereupon he (the Holy Prophet) said: Do the vermins harm your head? I said: Yes. He said: Get your head shaved and (in lieu of it) observe fasts for three days or feed six needy persons, or offer sacrifice (of an animal). Ayyub said: I do not know with what (type of expiation) did he commence (the statement).",
      "chain": [
        "30024",
        "20022",
        "11015",
        "30137",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2949",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا حماد، عن عمرو بن دينار، وأيوب، عن سعيد، بن جبير عن ابن عباس، - رضى الله عنهما - قال بينما رجل واقف مع رسول الله صلى الله عليه وسلم بعرفة إذ وقع من راحلته - قال أيوب فأوقصته أو قال - فأقعصته وقال عمرو فوقصته - فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ اغسلوه بماء وسدر وكفنوه في ثوبين ولا تحنطوه ولا تخمروا رأسه - قال أيوب فإن الله يبعثه يوم القيامة ملبيا وقال عمرو - فإن الله يبعثه يوم القيامة يلبي ‏\"‏ ‏.‏ وحدثنيه عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن أيوب، قال نبئت عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - أن رجلا، كان واقفا مع النبي صلى الله عليه وسلم وهو محرم ‏.‏ فذكر نحو ما ذكر حماد عن أيوب ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      While a person was standing in 'Arafat with the Messenger of Allah (may peace be upon him) he fell down from his camel and broke his neck. This was mentioned to the Apostle of Allah (may peace be upon him), whereupon he said: Bathe him with water mixed with the leaves of the lote tree and shroud him in two (pieces of) cloth and neither perfume him nor cover his head; (Ayyub said) for Allah would raise him on the Day of Resurrection in the state of pronouncing Talbiya. ('Amr. however, said): Verily Allah would raise him on the Day of Resurrection pronouncing Talbiya. Sa'id b. Jubair narrated this hadith on the authority of Ibn 'Abbas (Allah be pleased with them) that a person was standing with the Apostle of Allah (may peace be upon him) as he was in the state of Ihram. The rest of the hadith is the same.",
      "chain": [
        "30137",
        "20022",
        "11081",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3008",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا خلف بن هشام، وأبو الربيع، وقتيبة، جميعا عن حماد، - قال خلف حدثنا حماد بن زيد، - عن أيوب، قال سمعت مجاهدا، يحدث عن جابر بن عبد الله، - رضى الله عنهما - قال قدمنا مع رسول الله صلى الله عليه وسلم ونحن نقول لبيك بالحج ‏.‏ فأمرنا رسول الله صلى الله عليه وسلم أن نجعلها عمرة ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We came with the Messenger of Allah (May peace be upon him) pronouncing Talbiya for Hajj, and the Messenger of Allah (May peace be upon him) commanded us to make (our Ihram) into that of Umra.",
      "chain": [
        "30503",
        "30137",
        "20022",
        "20022",
        "11015",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "3052",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الربيع الزهراني، وأبو كامل قالا حدثنا حماد، ح وحدثني زهير بن، حرب حدثني إسماعيل، كلاهما عن أيوب، عن نافع، عن ابن عمر، ‏.‏ بهذه القصة ‏.‏ ولم يذكر النبي صلى الله عليه وسلم إلا في أول الحديث حين قيل له يصدوك عن البيت ‏.‏ قال إذا أفعل كما فعل رسول الله صلى الله عليه وسلم ‏.‏ ولم يذكر في آخر الحديث هكذا فعل رسول الله صلى الله عليه وسلم ‏.‏ كما ذكره الليث ‏.‏",
      "text_en": " This hadith has been narrated from Ibn Umar through another chain of transmitters except with (this variation) that Allah's Apostle (may peace be upon him) was mentioned in the first part of the hadith,. i. e. when it was said to him:                      They would bar you (from going) to the House. He said: In that, case I would do what Allah's Messenger (may peace be upon him) had done. He did not mention at the end of this hadith (i. e. these words):\" This is how the Messenger of Allah (may peace be upon him) had done,\" as it Is narrated by al-Laith.",
      "chain": [
        "30137",
        "20022",
        "30022",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "3059",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو الربيع الزهراني، عن حماد بن زيد، ح وحدثنا عبد، بن حميد أخبرنا محمد بن بكر، أخبرنا ابن جريج، جميعا عن عمرو بن دينار، عن ابن، عمر - رضى الله عنهما - عن النبي صلى الله عليه وسلم نحو حديث ابن عيينة ‏.‏",
      "text_en": " This hadith is narrated by another chain of transmitters.",
      "chain": [
        "30399",
        "30137",
        "20022",
        "30553",
        "20277",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "3104",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن نافع، أن ابن عمر، كان لا يقدم مكة إلا بات بذي طوى حتى يصبح ويغتسل ثم يدخل مكة نهارا ويذكر عن النبي صلى الله عليه وسلم أنه فعله ‏.‏",
      "text_en": " Nafi' reported that Ibn Umar (Allah be pleased with them) did not enter Mecca without spending the night at Dhi Tawu until it was dawn, when he took a bath, and then entered Mecca in the morning, and made a mention that Allah's Apostle (may peace be upon him) did that.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، - يعني ابن زيد - عن أيوب، عن سعيد بن جبير، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم وأصحابه مكة وقد وهنتهم حمى يثرب ‏.‏ قال المشركون إنه يقدم عليكم غدا قوم قد وهنتهم الحمى ولقوا منها شدة ‏.‏ فجلسوا مما يلي الحجر وأمرهم النبي صلى الله عليه وسلم أن يرملوا ثلاثة أشواط ويمشوا ما بين الركنين ليرى المشركون جلدهم فقال المشركون هؤلاء الذين زعمتم أن الحمى قد وهنتهم هؤلاء أجلد من كذا وكذا ‏.‏ قال ابن عباس ولم يمنعه أن يأمرهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم ‏.‏",
      "text_en": " Ibn 'Abbas (At lab be pleased with them) reported:                      Allah's Messenger (may peace be upon him) and his Companions came to Mecca and the fever in Medina had weakened them. Thereupon the polytheists (of Mecca) said: There would come to you a people whom the fever has made weak and they have suffered severely from it. They sat in Hatim. Thereupon Allah's Apostle (may peace be upon him) commanded them to walk quickly ift three circuits and walk (in four) between the two corners. so that the polytheists should. see their endurance. The polytheists then said (to one anothery You were under the impression that fever had emaciated them. whereas they are stronger than so and so. Ibn Abbas said: He (the Holy Prophet) did not command them (the Muslims) to walk quickly in all the circuits out of kindness to them.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3166",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، جميعا عن حماد بن زيد، - قال أبو الربيع حدثنا حماد، - حدثنا هشام، عن أبيه، قال سئل أسامة وأنا شاهد، أو قال سألت أسامة بن زيد وكان رسول الله صلى الله عليه وسلم أردفه من عرفات قلت كيف كان يسير رسول الله صلى الله عليه وسلم حين أفاض من عرفة قال كان يسير العنق فإذا وجد فجوة نص ‏.‏",
      "text_en": " Hisham (Allah be pleased with him) reported from his father:                      Usama (Allah be pleased with him) was asked in my presence or I asked Usama b. Zaid andhe rode behind Allah's Messenger (may peace be upon him) as he came back from 'Arafat. I said (to him): How did Allah's Messenger (may peace be upon him) journey as he came back from 'Arafat? Thereupon he said: He made it (his riding camel) walk at a slow speed, and when he found an open space, he made it walk briskly.",
      "chain": [
        "30137",
        "30367",
        "20022",
        "30137",
        "20022",
        "11065",
        "10511",
        "50"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، وأبو كامل الجحدري كلهم عن حماد بن زيد، - قال أبو كامل - حدثنا حماد، حدثنا أيوب، عن نافع، عن ابن عمر، قال قدم رسول الله صلى الله عليه وسلم يوم الفتح فنزل بفناء الكعبة وأرسل إلى عثمان بن طلحة فجاء بالمفتح ففتح الباب - قال - ثم دخل النبي صلى الله عليه وسلم وبلال وأسامة بن زيد وعثمان بن طلحة وأمر بالباب فأغلق فلبثوا فيه مليا ثم فتح الباب ‏.‏ فقال عبد الله فبادرت الناس فتلقيت رسول الله صلى الله عليه وسلم خارجا وبلال على إثره فقلت لبلال هل صلى فيه رسول الله صلى الله عليه وسلم قال نعم ‏.‏ قلت أين قال بين العمودين تلقاء وجهه ‏.‏ قال ونسيت أن أسأله كم صلى.",
      "text_en": " Ibn Umar (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) came on the Day of Victory, and got down in the courtyard of the Ka'ba and he sent (a message) for 'Uthman b. Talha (Allah be pleased with them). He came with the key and opened the door. Allah's Apostle (may peace be upon him) then entered therein and Bilal, Usama b. Zaid, and 'Uthman b. Talha (along with him), and then commanded the door to be closed. They stayed there for a considerable time, and then the door was opened, and Abdullah said: I was the first to meet Allah's Messenger. (may peace be upon him). outside (the Ka'ba), and Bilal was close behind him. I said to Bilal: Did Allah's Messenger (may peace be upon him) observe prayer therein? He said: Yes. I said: Where? He said: Between the two pillars in front of his face. He said: I forgot to ask him as to the number of rakahs he prayed.",
      "chain": [
        "30137",
        "30367",
        "30559",
        "20022",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو الربيع الزهراني، حدثنا حماد، عن عمرو، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by 'Amr on the authority of the same chain of transmitters.",
      "chain": [
        "30137",
        "20022"
      ]
    },
    {
      "hadith_no": "3556",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو الربيع، سليمان بن داود العتكي وقتيبة بن سعيد واللفظ ليحيى قال يحيى أخبرنا وقال الآخران، حدثنا حماد بن زيد، عن ثابت، عن أنس بن مالك، أن النبي صلى الله عليه وسلم رأى على عبد الرحمن بن عوف أثر صفرة فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ قال يا رسول الله إني تزوجت امرأة على وزن نواة من ذهب ‏.‏ قال ‏\"‏ فبارك الله لك أولم ولو بشاة ‏\"‏.",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) saw the trace of yellowness on 'Abd al-Rahman b. 'Auf and said:                      What is this? Thereupon he said: Allah's Messenger, I have married a woman for a date-stone's weight of gold. He said: God bless you! Hold a wedding feast, even if only with a sheep.",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3564",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، - يعني ابن زيد - عن ثابت، وعبد، العزيز بن صهيب عن أنس، ح وحدثناه قتيبة بن سعيد، حدثنا حماد، - يعني ابن زيد - عن ثابت، وشعيب، بن حبحاب عن أنس، ح  وحدثنا قتيبة، حدثنا أبو عوانة، عن قتادة، وعبد العزيز، عن أنس، ح  وحدثنا محمد بن عبيد الغبري، حدثنا أبو عوانة، عن أبي عثمان، عن أنس، ح وحدثني زهير بن حرب، حدثنا معاذ بن هشام، حدثني أبي، عن شعيب بن الحبحاب، عن أنس، ح وحدثني محمد بن رافع، حدثنا يحيى بن آدم، وعمر بن سعد، وعبد الرزاق، جميعا عن سفيان، عن يونس بن عبيد، عن شعيب بن الحبحاب، عن أنس، كلهم عن النبي صلى الله عليه وسلم أنه أعتق صفية وجعل عتقها صداقها ‏.‏ وفي حديث معاذ عن أبيه تزوج صفية وأصدقها عتقها.",
      "text_en": " This hadith has been narrated through another chain of transmitters on the authority of Anas that Allah's Apostle (may peace be upon him) emancipated Safiyya, and her emancipation was treated as her wedding gift, and in the hadith transmitted by Mu'adh on the authority of his father (the words are):                     \" He (the Holy Prophet) married Safiyya and bestowed her emancipation as her wedding gift.\"",
      "chain": [
        "30137",
        "20022",
        "11269",
        "11295",
        "19",
        "30367",
        "20022",
        "11269",
        "19",
        "30367",
        "20469",
        "11019",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3576",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو الربيع الزهراني، وأبو كامل فضيل بن حسين وقتيبة بن سعيد قالوا حدثنا حماد، - وهو ابن زيد - عن ثابت، عن أنس، - وفي رواية أبي كامل سمعت أنسا، - قال ما رأيت رسول الله صلى الله عليه وسلم أولم على امرأة - وقال أبو كامل على شىء - من نسائه ما أولم على زينب فإنه ذبح شاة ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported:                      I did not see Allah's Messenger (may peace be upon him) giving a wedding feast (on the marriage) of any one (of his wives) as he did in the case of (his marriage with) Zainab, for then he sacrificed a goat (on this occasion).",
      "chain": [
        "30137",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3585",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، حدثنا أيوب، ح وحدثنا قتيبة، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ائتوا الدعوة إذا دعيتم ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported Allah's Messenger (may be upon him) having said this:                      Accept the feast, when you are invited.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "30367",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3622",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو الربيع الزهراني، وأبو كامل الجحدري - واللفظ لأبي كامل - قالا حدثنا حماد، - وهو ابن زيد - حدثنا أيوب، عن محمد، عن عبد الرحمن بن بشر بن مسعود، رده إلى أبي سعيد الخدري قال سئل النبي صلى الله عليه وسلم عن العزل فقال ‏\"‏ لا عليكم أن لا تفعلوا ذاكم فإنما هو القدر ‏\"‏ ‏.‏ قال محمد وقوله ‏\"‏ لا عليكم ‏\"‏ ‏.‏ أقرب إلى النهى ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Apostle (may peace be upon him) was asked about 'azl, whereupon he said:                      There is no harm if you do not do that, for it (the birth of the child) is something ordained. Muhammad (one of the narrators) said: (The words) La 'alaykum (there is no harm) implies its Prohibition.",
      "chain": [
        "30137",
        "30559",
        "20022",
        "11015",
        "11035"
      ]
    },
    {
      "hadith_no": "3649",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، - يعني ابن زيد - حدثنا هشام، بهذا الإسناد أن أخا أبي القعيس، استأذن عليها ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham with the same chain of transmitters (and the words are):                     \" The brother of Abu'l-Qu'ais sought permission from her ('A'isha) (to enter the house). The rest is the same.",
      "chain": [
        "30137",
        "20022"
      ]
    },
    {
      "hadith_no": "3711",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو الربيع الزهراني، قال يحيى أخبرنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، أن عبد الله، هلك وترك تسع بنات - أو قال سبع - فتزوجت امرأة ثيبا فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا جابر تزوجت ‏\"‏ ‏.‏ قال قلت نعم ‏.‏ قال ‏\"‏ فبكر أم ثيب ‏\"‏ ‏.‏ قال قلت بل ثيب يا رسول الله ‏.‏ قال ‏\"‏ فهلا جارية تلاعبها وتلاعبك ‏\"‏ ‏.‏ أو قال ‏\"‏ تضاحكها وتضاحكك ‏\"‏ ‏.‏ قال قلت له إن عبد الله هلك وترك تسع بنات - أو سبع - وإني كرهت أن آتيهن أو أجيئهن بمثلهن فأحببت أن أجيء بامرأة تقوم عليهن وتصلحهن ‏.‏ قال ‏\"‏ فبارك الله لك ‏\"‏ ‏.‏ أو قال لي خيرا وفي رواية أبي الربيع ‏\"‏ تلاعبها وتلاعبك وتضاحكها وتضاحكك ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      'Abdullah died and he left (behind him) nine or seven daughters. I married a woman who had been previously married. Allah's Messenger (may peace be upon him) said to me: Jabir, have you married? I said: Yes. He (again) said: A virgin or one previously married? I said: Messenger of Allah, with one who was previously married, whereupon he said: Why didn't you marry a young girl so that you could sport with her and she could sport with you, or you could amuse with her and she could amuse with you? I said to him: 'Abdullah died (he fell as martyr in Uhud) and left nine or seven daughters behind him; I, therefore, did not approve of the idea that I should bring a (girl) like them, but I preferred to bring a woman who should look after them and teach them good manners, whereupon he (Allah's Messenger) said: May Allah bless you, or he supplicated (for the) good (to be) conferred on me (by Allah).",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "3735",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه أبو الربيع، وقتيبة، قالا حدثنا حماد، عن أيوب، بهذا الإسناد ‏.‏ نحوه غير أنه قال فسأل عمر النبي صلى الله عليه وسلم فأمره ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Ayyub with a slight variation of words.",
      "chain": [
        "30137",
        "30367",
        "20022"
      ]
    },
    {
      "hadith_no": "3762",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا إسماعيل بن زكرياء، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة، وعن الأعمش، عن مسلم، عن مسروق، عن عائشة، بمثله‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of 'A'isha through another chain of narrators.",
      "chain": [
        "30137",
        "20313",
        "11060",
        "11051",
        "11054",
        "53",
        "11060",
        "20285",
        "11018"
      ]
    },
    {
      "hadith_no": "3811",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو الربيع، حدثنا حماد، عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، جميعا عن نافع، عن صفية بنت أبي عبيد، عن بعض، أزواج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم بمعنى حديثهم ‏.‏",
      "text_en": " Safiyya bint Abu 'Ubaid narrated this tradition of Allah's Prophet (may peace be upon him) on the authority of some wives of Allah's Apostle (may peace be upon him)",
      "chain": [
        "30137",
        "20022",
        "11015",
        "30212",
        "20331",
        "11014",
        "11811"
      ]
    },
    {
      "hadith_no": "3815",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن حفصة، عن أم عطية، قالت كنا ننهى أن نحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ولا نكتحل ولا نتطيب ولا نلبس ثوبا مصبوغا وقد رخص للمرأة في طهرها إذا اغتسلت إحدانا من محيضها في نبذة من قسط وأظفار ‏.‏",
      "text_en": " Umm 'Atiyya ('Allah be pleased with her) said:                      We were forbidden to observe mourning for the dead beyond three days except in the case of husband (where it is permissible) for four months and ten days, and (that during this period) we should neither use collyrium nor touch perfume, nor wear dyed clothes, but concession was given to a woman when one of us was purified of our courses to make use of a little incense or scent.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3822",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عمر، قال فرق رسول الله صلى الله عليه وسلم بين أخوى بني العجلان وقال ‏\"‏ الله يعلم أن أحدكما كاذب فهل منكما تائب ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) said that Allah's Messenger (may peace be upon him) effected separation between the two members of Banu al-'Ajlan, and said:                      Allah knows that one of you is a liar. Is there one to repent among you?",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "3844",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثناه قتيبة بن سعيد، ومحمد بن رمح، جميعا عن الليث بن سعد، ح وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، حدثنا أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، ح وحدثنا محمد بن، المثنى حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، ح وحدثني إسحاق بن منصور، أخبرنا عبد الرزاق، عن ابن جريج، أخبرني إسماعيل بن أمية، ح وحدثنا هارون بن سعيد، الأيلي حدثنا ابن وهب، أخبرني أسامة، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، عن ابن أبي ذئب، كل هؤلاء عن نافع، عن ابن عمر، بمعنى حديث مالك عن نافع.‏",
      "text_en": " This hadith has been reported on the authority of Ibn 'Umar through another chain of transmitters.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20656",
        "11272",
        "30137",
        "20022",
        "11015",
        "30212",
        "20331",
        "11201",
        "30170",
        "20259",
        "11062"
      ]
    },
    {
      "hadith_no": "3967",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثنيه علي بن حجر، حدثنا إسماعيل، كلاهما عن أيوب، عن نافع، بهذا الإسناد أن رسول الله صلى الله عليه وسلم رخص في بيع العرايا بخرصها ‏.‏",
      "text_en": " Nafi, reported this hadith with the same chain of transmitters stating that Allah's Messengtr (may peace be upon him) granted concession in case of 'ariyya transactions (for exchange of the same commodity) with measure.",
      "chain": [
        "30137",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "3979",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثناه أبو الربيع، وأبو كامل قالا حدثنا حماد، حدثنا أيوب، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Ayyub.",
      "chain": [
        "30137",
        "20022"
      ]
    },
    {
      "hadith_no": "3985",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثناه أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثنيه زهير بن حرب، حدثنا إسماعيل، كلاهما عن أيوب، عن نافع، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Nafi, with the same chain of transmitters.",
      "chain": [
        "30137",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "4017",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو الربيع العتكي، قال أبو الربيع حدثنا وقال، يحيى أخبرنا حماد بن زيد، عن عمرو، قال سمعت ابن عمر، يقول كنا لا نرى بالخبر بأسا حتى كان عام أول فزعم رافع أن نبي الله صلى الله عليه وسلم نهى عنه ‏.‏",
      "text_en": " Zaid b. Amr reported:                      I heard Ibn Umar (Allah be pleased with them) say: We did not see any harm in renting of the land, but as the first year was over Rafi' alleged Allah's Apostle (may peace be upon him) having forbidden that.",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "4021",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثني علي بن حجر، حدثنا إسماعيل، كلاهما عن أيوب، بهذا الإسناد ‏.‏ مثله وزاد في حديث ابن علية قال فتركها ابن عمر بعد ذلك فكان لا يكريها ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ayyub and he made an addition in the hadith narrated by Ibn Ulayya in which he said:                      Ibn Umar abandoned it afterwards and he did not rent it (the land).",
      "chain": [
        "30137",
        "20022",
        "20387"
      ]
    },
    {
      "hadith_no": "4036",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو الربيع، حدثنا حماد، ح وحدثنا ابن المثنى، حدثنا يزيد بن هارون، جميعا عن يحيى بن سعيد، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahya b. Sa'id with the same chain of transmitters.",
      "chain": [
        "30137",
        "20022",
        "20472",
        "11062"
      ]
    },
    {
      "hadith_no": "4071",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا قتيبة بن سعيد، ومحمد بن رمح، جميعا عن الليث بن سعد، ح وحدثنا أبو الربيع، ويحيى بن حبيب الحارثي، قالا حدثنا حماد، - يعني ابن زيد - ح وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، ويحيى بن سعيد، وحفص بن غياث، كل هؤلاء عن يحيى بن سعيد، في هذا الإسناد ‏.‏ بمعنى حديث زهير وقال ابن رمح من بينهم في روايته أيما امرئ فلس ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahya b. Sa'id with the same chain of transmitters (but with a slight variation of words and these are)\" Whenever a man becomes poor.\"",
      "chain": [
        "30399",
        "20468",
        "30367",
        "30490",
        "20023",
        "30137",
        "20022",
        "30201",
        "20005",
        "30170",
        "20259"
      ]
    },
    {
      "hadith_no": "4418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا قتيبة بن سعيد، ومحمد بن رمح، عن الليث بن سعد، ح وحدثنا محمد، بن المثنى حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، ح وحدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، وهو ابن زيد ح وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - كلاهما عن أيوب، ح وحدثنا إسحاق بن منصور، أخبرنا عبد الرزاق، عن ابن جريج، أخبرني إسماعيل بن أمية، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، عن ابن أبي ذئب، ح وحدثنا هارون بن سعيد الأيلي، أخبرنا ابن وهب، قال أخبرني أسامة، - يعني ابن زيد - كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بهذا الحديث وليس في حديثهم ‏\"‏ وإن لم يكن له مال فقد عتق منه ما عتق ‏\"‏ ‏.‏ إلا في حديث أيوب ويحيى بن سعيد فإنهما ذكرا هذا الحرف في الحديث وقالا لا ندري أهو شىء في الحديث أو قاله نافع من قبله وليس في رواية أحد منهم سمعت رسول الله صلى الله عليه وسلم ‏.‏ إلا في حديث الليث بن سعد ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters with a slight variation of words.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30170",
        "20259",
        "11062",
        "30137",
        "20022",
        "30022",
        "20208",
        "11015"
      ]
    },
    {
      "hadith_no": "4428",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود العتكي حدثنا حماد، - يعني ابن زيد - عن عمرو بن دينار، عن جابر بن عبد الله، أن رجلا، من الأنصار أعتق غلاما له عن دبر لم يكن له مال غيره فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ من يشتريه مني ‏\"‏ ‏.‏ فاشتراه نعيم بن عبد الله بثمانمائة درهم فدفعها إليه ‏.‏ قال عمرو سمعت جابر بن عبد الله يقول عبدا قبطيا مات عام أول ‏.‏",
      "text_en": " Jabir b. 'Abdullah said that a person among the Ansar declared his slave free after his death, as he had no other property. This news reached the Apostle of Allah (may peace be upon him) and he said:                      Who will buy him from me? And Nu'aim b. al-Nahham bought him for eight hundred dirhams and he handed them over to him, 'Amr (one of the narrators) said: I heard Jabir b. 'Abdullah as saying: He was a Coptic slave, and he died in the first year (of the Caliphate of 'Abdullah b. Zubair).",
      "chain": [
        "30137",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4609",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا قتيبة بن سعيد، ومحمد بن رمح، جميعا عن الليث بن سعد، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا ابن نمير، حدثني أبي كلاهما، عن عبيد الله، ح وحدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - جميعا عن أيوب، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، عن معمر،عن أيوب، وابن، جريج عن موسى، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث مالك غير أن في حديثهم جميعا ‏\"‏ فينتثل ‏\"‏ ‏.‏ إلا الليث بن سعد فإن في حديثه ‏\"‏ فينتقل طعامه ‏\"‏ ‏.‏ كرواية مالك ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters with a slight variation of words.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30201",
        "20345",
        "30212",
        "11201",
        "30137",
        "20022",
        "30022",
        "20208"
      ]
    },
    {
      "hadith_no": "4660",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه أبو الربيع، وأبو كامل قالا حدثنا حماد، عن أيوب، ح وحدثنا ابن المثنى، حدثنا ابن أبي عدي، عن ابن عون، قال كتبت إلى نافع أسأله عن النفل، فكتب إلى أن4661 - وحدثنا ابن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة بن زيد، كلهم عن نافع، بهذا الإسناد نحو حديثهم ‏.‏",
      "text_en": " Ibn Aun said:                      I wrote to Nafi' asking him about Nafl (spoils of war) and be wrote to me that Ibn 'Umar was among that expedition. (The rest of the hadith is the same.)",
      "chain": [
        "30137",
        "20022",
        "11015",
        "20276",
        "11071",
        "20121",
        "11070",
        "20040",
        "30492",
        "20029",
        "50"
      ]
    },
    {
      "hadith_no": "4829",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا ابن المثنى، حدثنا خالد يعني ابن الحارث، ح وحدثنا عبيد الله بن سعيد، حدثنا يحيى، - يعني القطان - كلهم عن عبيد الله بن عمر، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد بن زيد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، جميعا عن أيوب، ح وحدثني محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، كل هؤلاء عن نافع، عن ابن عمر، مثل حديث الليث عن نافع، ‏.‏",
      "text_en": " This tradition has been narrated through more; than one chain of transmitters.",
      "chain": [
        "30201",
        "20352",
        "30212",
        "20331",
        "20226",
        "30359",
        "11201",
        "30137",
        "20022"
      ]
    },
    {
      "hadith_no": "4951",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن يحيى، ومحمد بن رمح، وقتيبة بن سعيد، عن الليث بن سعد، ح وحدثنا خلف بن هشام، وأبو الربيع، وأبو كامل قالوا حدثنا حماد، - وهو ابن زيد - عن أيوب، ح وحدثنا زهير بن حرب، حدثنا إسماعيل، عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح",
      "text_en": " This tradition has been handed down through another chain of transmitters with the addition of the following words from Abdullah b. 'Umar:                     \" I came first in the race and my horse jumped into the mosque with me.\"",
      "chain": [
        "30399",
        "30490",
        "30367",
        "20023",
        "30503",
        "30137",
        "20022",
        "11015",
        "30022",
        "20208",
        "11015",
        "30212",
        "20331"
      ]
    },
    {
      "hadith_no": "5012",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا يزيد، - يعني ابن زريع - حدثنا حسين، المعلم حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن بسر بن سعيد، عن  زيد بن خالد الجهني، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ من جهز غازيا فقد غزا ومن خلف غازيا في أهله فقد غزا ‏\"‏ ‏.‏",
      "text_en": " The above tradition has been narrated on the authority of Khalid al- Juhani who said:                      The Prophet of Allah (may peace be upon him) said: He who equips a warrior in the way of Allah (is like one who dctually fights) aud he who looks after the family of a warrior in the way of Allah in fact participated in the battle.",
      "chain": [
        "30137",
        "20304",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "5143",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثناه أبو الربيع، وقتيبة، قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا  إسماعيل، كلاهما عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك بن مغول، ح وحدثني  هارون بن عبد الله، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثنا هارون بن عبد، الله حدثنا شجاع بن الوليد، قال سمعت موسى بن عقبة، ح وحدثنا هارون بن سعيد، الأيلي حدثنا ابن وهب، أخبرني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم في الضب بمعنى حديث الليث عن نافع غير أن حديث أيوب أتي رسول الله صلى الله عليه وسلم بضب فلم يأكله ولم يحرمه وفي حديث أسامة قال قام رجل في المسجد ورسول الله صلى الله عليه وسلم على المنبر ‏.‏",
      "text_en": " A hadith pertaining to the eating of the lizard is transmitted from the Holy Prophet (may peace be upon him) on the authority of Ibn 'Umar, but in this very hadith narrated through a different chain of transmitters there is a slight variation of wording (and the words are):                     \" A lizard was brought to Allah's Messenger (may peace be upon him) but he neither ate that nor declared it unlawful.\" And in the hadith transmitted through Usama (the words are):\" The man (inquirer) was standing in the mosque and Allah's Messenger (may peace be upon him) was sitting on the pulpit.\"",
      "chain": [
        "30137",
        "30367",
        "20022",
        "30022",
        "11015",
        "30212",
        "20331",
        "20358",
        "30524",
        "20277",
        "11070",
        "30524",
        "20328",
        "11106"
      ]
    },
    {
      "hadith_no": "5246",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود العتكي حدثنا حماد، - يعني ابن زيد - أخبرنا  ثابت، عن أنس بن مالك، قال كنت ساقي القوم يوم حرمت الخمر في بيت أبي طلحة وما شرابهم إلا الفضيخ البسر والتمر ‏.‏ فإذا مناد ينادي فقال اخرج فانظر فخرجت فإذا مناد ينادي ألا إن الخمر قد حرمت - قال - فجرت في سكك المدينة فقال لي أبو طلحة اخرج فاهرقها ‏.‏ فهرقتها فقالوا أو قال بعضهم قتل فلان قتل فلان وهي في بطونهم - قال فلا أدري هو من حديث أنس - فأنزل الله عز وجل ‏{‏ ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا وعملوا الصالحات‏}‏",
      "text_en": " Anas b. Malik reported:                      I was the cup-bearer of some people in the house of Abu Talha on the day when liquor was forbidden. Their liquor had been prepared from dry dates or fresh dates when the announcer made the announcement. He (Abu Talha) said to me: Go out and find out (what the announcement is). I got out (and found) an announcer making this announcement: Behold, liquor has been declared unlawful. He said: The liquor (was spilt and) flawed in the lanes of Medina. Abu Talha said to me: Go out and Spill it, and I spilt it. They said or some of them said: Such and such were killed, such and such were killed for (the wine) had been in their stomachs. He (the narrator) said. I do not know whether it is the narration transmitted by Anas, (or by someone else). Then Allah, the Exalted and Majestic, revealed:\" There shall be no sin (imputed) unto those who have believed and done good works for what they may have eaten as long as they fear (Allah) and believe and do good works\" (v. 93).",
      "chain": [
        "30137",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5305",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، جميعا عن أيوب، ح وحدثنا  ابن نمير، حدثنا أبي، حدثنا عبيد الله، ح وحدثنا ابن المثنى، وابن أبي عمر، عن الثقفي، عن  يحيى بن سعيد، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك يعني، ابن عثمان ح وحدثني هارون الأيلي، أخبرنا ابن وهب، أخبرني أسامة، كل هؤلاء عن  نافع، عن ابن عمر، ‏.‏ بمثل حديث مالك ولم يذكروا في بعض مغازيه ‏.‏ إلا مالك وأسامة ‏.‏",
      "text_en": " This hadith has been reported on the authority of Ibn 'Umar with different chains of transmitters but they have not mentioned:                     \" In one of his expeditions\" except Malik and Usama.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30137",
        "20022",
        "30022",
        "11015",
        "30212",
        "20331",
        "11201",
        "30421",
        "20031"
      ]
    },
    {
      "hadith_no": "5575",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى،- وهو القطان - كلهم عن عبيد الله، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد،ح وحدثني زهير بن حرب، حدثنا إسماعيل، كلاهما عن أيوب، ح وحدثنا قتيبة، وابن، رمحعن الليث بن سعد، ح وحدثنا هارون الأيلي، حدثنا ابن وهب، حدثني أسامة، كل هؤلاءعن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث مالك وزادوا فيه ‏\"‏يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through other chains of transmitters also with the addition of these words:                     \" On the Day of Resurrection.\"",
      "chain": [
        "30201",
        "20331",
        "20318",
        "30212",
        "20331",
        "30170",
        "30359",
        "11201",
        "30137",
        "30022"
      ]
    },
    {
      "hadith_no": "5628",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو الربيع، وقتيبة بن سعيد، قال يحيى أخبرنا حماد،بن زيد وقال الآخران حدثنا حماد، عن عبد العزيز بن صهيب، عن أنس بن مالك، أن النبيصلى الله عليه وسلم نهى عن التزعفر ‏.‏ قال قتيبة قال حماد يعني للرجال ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace he upon him) forbade dyeing (one's cloth or hair) in saffron. Hammad said that it pertains to men only.",
      "chain": [
        "30399",
        "30137",
        "30367",
        "20031",
        "20022",
        "11295",
        "19",
        "30367"
      ]
    },
    {
      "hadith_no": "5658",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - ح وحدثنا ابن أبي عمر، حدثنا الثقفي، كلهم عن أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث عبيد الله عن نافع عنابن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn 'Umar reported a hadith like this through another chain of transmitters.",
      "chain": [
        "30137",
        "20022",
        "30022",
        "20208",
        "30421",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5746",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود العتكي حدثنا عبد الوارث، حدثنا أبو التياح، حدثنا أنس بن مالك، ح  وحدثنا شيبان بن فروخ، - واللفظ له - حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا وكان لي أخ يقال له أبو عمير - قال أحسبه قال - كان فطيما - قال - فكان إذا جاء رسول الله صلى الله عليه وسلم فرآه قال ‏\"‏ أبا عمير ما فعل النغير ‏\"‏ ‏.‏ قال فكان يلعب به ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) had the sublimest character among mankind. I had a brother who was called Abd 'Umair. I think he was weaned. When Allah's Messenger (may peace he upon him) came to our house he saw him, and said:                      Abu 'Umair, what has the sparrow done? He (Anas) said that he had been playing with that.",
      "chain": [
        "30137",
        "20258",
        "11317",
        "19",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "5814",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، حدثنا أيوب، ح وحدثني يحيى، بن حبيب حدثنا روح، ح وحدثني محمد بن رافع، وحدثنا عبد الرزاق، كلاهما عن ابن، جريج ح وحدثني محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث الليث ولم يذكروا في الحديث ‏\"‏ ولكن تفسحوا وتوسعوا ‏\"‏ ‏.‏ وزاد في حديث ابن جريج قلت في يوم الجمعة قال في يوم الجمعة وغيرها ‏.‏",
      "text_en": " This hadith has been reported on the authority of Ibn 'Umar through another chain of transmitters. but with a slight variation of wording.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "20229",
        "30375",
        "11070",
        "30375",
        "20172",
        "20504",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5824",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وابن، نمير ح وحدثنا ابن، نمير حدثنا أبي ح، وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو ابن سعيد - كلهم عن عبيد الله، ح وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا  أبو الربيع، وأبو كامل قالا حدثنا حماد، عن أيوب، ح وحدثنا ابن المثنى، حدثنا محمد، بن جعفر حدثنا شعبة، قال سمعت أيوب بن موسى، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث مالك ‏.‏",
      "text_en": " This hadith has been reported on the authority of lbn 'Umar through two different chains of transmitters.",
      "chain": [
        "30201",
        "20352",
        "30212",
        "30212",
        "20331",
        "30170",
        "30359",
        "20031",
        "11201",
        "30367",
        "30490",
        "20023",
        "30137"
      ]
    },
    {
      "hadith_no": "5854",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود حدثنا محمد بن حرب، حدثني محمد بن الوليد، الزبيدي عن الزهري، عن عروة بن الزبير، عن زينب بنت أم سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال لجارية في بيت أم سلمة زوج النبي صلى الله عليه وسلم رأى بوجهها سفعة فقال ‏\"‏ بها نظرة فاسترقوا لها ‏\"‏ ‏.‏ يعني بوجهها صفرة ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) said to a small girl in the house of Umm Salama that he had been seeing on her face black stains and told her that that was due to the infiluence of an evil eye, and he asked that she should be cured with the help of incantation (hoping) that her face should become spotles.",
      "chain": [
        "30137",
        "30373",
        "20459",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "5907",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو الربيع، سليمان بن داود وقتيبة بن سعيد قالا حدثنا حماد، وهو ابن زيد ح وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، كلاهما عن عمرو بن، دينار بإسناد ابن جريج نحو حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Juraij through another chain of transmitters.",
      "chain": [
        "30137",
        "20022",
        "30201",
        "20005"
      ]
    },
    {
      "hadith_no": "6044",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثني أبو الربيع، حدثنا حماد، - يعني ابن زيد - حدثنا أيوب، وهشام، عن  محمد، عن أبي هريرة، قال إذا اقترب الزمان ‏.‏ وساق الحديث ولم يذكر فيه النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira and the words are:                     \" When the time draws near,\" the rest of the hadith is the same.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "6056",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود العتكي حدثنا حماد، - يعني ابن زيد - حدثنا  أيوب، وهشام، عن محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من رآني في المنام فقد رآني فإن الشيطان لا يتمثل بي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who saw me in a dream in fact saw me, for the satan does not appear in my form.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "6080",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني أبو الربيع، سليمان بن داود العتكي حدثنا حماد، - يعني ابن زيد - حدثنا ثابت، عن أنس، أن النبي صلى الله عليه وسلم دعا بماء فأتي بقدح رحراح فجعل القوم يتوضئون فحزرت ما بين الستين إلى الثمانين - قال - فجعلت أنظر إلى الماء ينبع من بين أصابعه ‏.‏",
      "text_en": " Anas reported that Allah's Apostle (may peace be upon him) called for water and he was given a vessel and the people began to perform ablution in that and I counted (the persons) and they were between fifty and eighty and I saw water which was spouting from his fingers.",
      "chain": [
        "30137",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6124",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو الربيع الزهراني، وأبو كامل الجحدري قالا حدثنا حماد، - وهو ابن زيد - حدثنا أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أمامكم حوضا ما بين ناحيتيه كما بين جربا وأذرح ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      There is before you a Cistern and the distance between its two sides is as it is between Jarba' and Adhruh.",
      "chain": [
        "30137",
        "30559",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6151",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع، قالا حدثنا حماد بن زيد، عن ثابت البناني، عن أنس بن مالك، قال خدمت رسول الله صلى الله عليه وسلم عشر سنين والله ما قال لي أفا ‏.‏ قط ولا قال لي لشىء لم فعلت كذا وهلا فعلت كذا زاد أبو الربيع ليس مما يصنعه الخادم ‏.‏ ولم يذكر قوله والله ‏.‏",
      "text_en": " Anas b. Malik reported:                      I served the Messenger of Allah (may peace be upon him) for ten years, and, by Allah, he never said to me any harsh word, and he never said to me about a thing as to why I had done that and as to why I had not done that. Abu Rabi' has made this addition (in this narration):\" The work which a servant should do.\" There is no mention of his words\" By Allah\".",
      "chain": [
        "30116",
        "30137",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6157",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا شيبان بن فروخ، وأبو الربيع، قالا حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) was the best amongst people in disposition and behaviour.",
      "chain": [
        "20656",
        "30137",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6180",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو الربيع العتكي، وحامد بن عمر، وقتيبة بن سعيد، وأبو كامل جميعا عن حماد بن زيد، قال أبو الربيع حدثنا حماد، حدثنا أيوب، عن أبي قلابة، عن أنس، قال كان رسول الله صلى الله عليه وسلم في بعض أسفاره وغلام أسود يقال له أنجشة يحدو فقال له رسول الله صلى الله عليه وسلم ‏\"‏ يا أنجشة رويدك سوقا بالقوارير ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) had in one of his journeys his black slave who was called Anjasha along with him. He goaded by singing the songs of camel-driver. Thereupon Allah's Messenger (may peace be upon him) said:                      Anjasha, drive slowly as you are driving (the mounts who are carrying) glass vessels",
      "chain": [
        "30128",
        "30367",
        "20022",
        "30137",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "6338",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأبو الربيع العتكي، وأبو كريب محمد بن العلاء - واللفظ لأبي كريب - قال أبو الربيع حدثنا وقال الآخران، أخبرنا ابن المبارك، عن  عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، قال سمعت ابن عباس، يقول وضع عمر بن الخطاب على سريره فتكنفه الناس يدعون ويثنون ويصلون عليه قبل أن يرفع وأنا فيهم - قال - فلم يرعني إلا برجل قد أخذ بمنكبي من ورائي فالتفت إليه فإذا هو علي فترحم على عمر وقال ما خلفت أحدا أحب إلى أن ألقى الله بمثل عمله منك وايم الله إن كنت لأظن أن يجعلك الله مع صاحبيك وذاك أني كنت أكثر أسمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ جئت أنا وأبو بكر وعمر ودخلت أنا وأبو بكر وعمر وخرجت أنا وأبو بكر وعمر ‏\"‏ ‏.‏ فإن كنت لأرجو أو لأظن أن يجعلك الله معهما ‏.‏",
      "text_en": " Ibn Abu Mulaika reported:                      I heard Ibn 'Abbas as saying: Wlien 'Umar b. Khatab was placed in the coffin the people gathered around him. They praised him and supplicated for him before the bier was lifted up, and I was one amongst them. Nothing attracted my attention but a person who gripped my shoulder from behind. I saw towards him and found that he was 'All. He invoked Allah's mercy upon 'Umar and said: You have left none behind you (whose) deeds (are so enviable) that I love to meet Allah with them. By Allah, I hoped that Allah would keep you and your two associates together. I had often heard Allah's Messenger (may peace be upon him) as saying: I came and there came too Abu Bakr and 'Umar; I entered and there entered too Abu Bakr and 'Umar; I went out and there went out too Abu Bakr and 'Umar, and I hope and think that Allah will keep you along with them.",
      "chain": [
        "30465",
        "30137",
        "20025",
        "10652",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "6524",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو الربيع العتكي، وخلف بن هشام، وأبو كامل الجحدري كلهم عن حماد، بن زيد - قال أبو الربيع حدثنا حماد بن زيد، - حدثنا أيوب، عن نافع، عن ابن عمر، قال رأيت في المنام كأن في يدي قطعة إستبرق وليس مكان أريد من الجنة إلا طارت إليه - قال - فقصصته على حفصة فقصته حفصة على النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أرى عبد الله رجلا صالحا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I saw in a state of sleep as if I have in my hand a piece of silk cloth and there is no place in the Paradise where I intend to reach but that piece of cloth does not fly towards it. I made a mention of it to Hafsa (the sister of Ibn 'Umar) and Hafsa made a mention of it to Allah's Apostle (may peace be upon him), whereupon Allah's Apostle (may peace be upon him) said: I find 'Abdullah b 'Umar a pious person.",
      "chain": [
        "30503",
        "30559",
        "20022",
        "30137",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6716",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع الزهراني، قالا حدثنا حماد، - يعنيان ابن زيد - عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال أبو الربيع رفعه إلى النبي صلى الله عليه وسلم وفي حديث سعيد قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عائد المريض في مخرفة الجنة حتى يرجع ‏\"‏ ‏.‏",
      "text_en": " Abu Rabi' reported directly from Allah's Apostle (may peace upon him) as saying:                      The one who visits the sick is in fact like one who is in the fruit garden of Paradise so long as he does not return.",
      "chain": [
        "30116",
        "30137",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "6770",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو الربيع، قالا حدثنا حماد، وهو ابن زيد ح وحدثنا  ابن أبي عمر، حدثنا الثقفي، كلاهما عن أيوب، بإسناد إسماعيل ‏.‏ نحو حديثه إلا أن في حديث حماد قال عمران فكأني أنظر إليها ناقة ورقاء وفي حديث الثقفي فقال ‏\"‏ خذوا ما عليها وأعروها فإنها ملعونة ‏\"‏ ‏.‏",
      "text_en": " 'Imran reported:                      I perceive as if I am looking towards that dromedary, and in the hadith transmitted on the authority of Thaqafi (the words are):\" Unload it and make its back bare for it is accursed.\"",
      "chain": [
        "30367",
        "30137",
        "20022",
        "30421"
      ]
    },
    {
      "hadith_no": "6828",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو الربيع، قال أبو الربيع حدثنا وقال، يحيى - واللفظ له - أخبرنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، أن رجلا، مر بأسهم في المسجد قد أبدى نصولها فأمر أن يأخذ بنصولها كى لا يخدش مسلما ‏.‏",
      "text_en": " Jabir b. Abdullah reported that a person happened to come to the mosque with arrows and their iron-ends were exposed, so he was commanded that he should grasp the pointed heads so that these might not do any harm to a Muslim.",
      "chain": [
        "30399",
        "30137",
        "30137",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "6891",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو الربيع، وأبو كامل فضيل بن حسين - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قيل لرسول الله صلى الله عليه وسلم أرأيت الرجل يعمل العمل من الخير ويحمده الناس عليه قال ‏\"‏ تلك عاجل بشرى المؤمن ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      It was said to Allah's Messenger (may peace be upon him): What is your opinion about the person who has done good deeds and the people praise him? He said: It is glad tidings for a believer (which he has received in this mortal world).",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "7041",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع، قالا حدثنا حماد بن زيد، عن أيوب، عن أبي، عثمان عن أبي موسى، قال كنا مع النبي صلى الله عليه وسلم في سفر ‏.‏ فذكر نحو حديث عاصم ‏.‏",
      "text_en": " Abu Musa reported:                      We were along with Allah's Apostle (may peace be upon him) on a journey; the rest of the hadith is the same as transmitted by A'sim.",
      "chain": [
        "30503",
        "30137",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "7159",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود حدثنا محمد بن حرب، حدثني الزبيدي، قال الزهري حدثني حميد بن عبد الرحمن بن عوف، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسرف عبد على نفسه ‏\"‏ ‏.‏ بنحو حديث معمر إلى قوله ‏\"‏ فغفر الله له ‏\"‏ ‏.‏ ولم يذكر حديث المرأة في قصة الهرة وفي حديث الزبيدي قال ‏\"‏ فقال الله عز وجل لكل شىء أخذ منه شيئا أد ما أخذت منه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying that a servant transgressed the litnit in committing sins. The rest of the hadith is the same but there is no mention of the story of the cat in it and in the hadith transmitted on the authority of Ziibaidl (the words are):                     \" Allah, the Exalted and Glorious, said to everything which had taken a part of lies ashes to return what it had taken.\"",
      "chain": [
        "30137",
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "7547",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، - وهو ابن زيد - عن أيوب، ح وحدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن عقبة، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "30377",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4341",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود العتكي حدثنا ابن المبارك، عن عتبة بن أبي حكيم، قال حدثني عمرو بن جارية اللخمي، حدثني أبو أمية الشعباني، قال سألت أبا ثعلبة الخشني فقلت يا أبا ثعلبة كيف تقول في هذه الآية ‏{‏ عليكم أنفسكم ‏}‏ قال أما والله لقد سألت عنها خبيرا سألت عنها رسول الله صلى الله عليه وسلم فقال ‏\"‏ بل ائتمروا بالمعروف وتناهوا عن المنكر حتى إذا رأيت شحا مطاعا وهوى متبعا ودنيا مؤثرة وإعجاب كل ذي رأى برأيه فعليك - يعني بنفسك - ودع عنك العوام فإن من ورائكم أيام الصبر الصبر فيه مثل قبض على الجمر للعامل فيهم مثل أجر خمسين رجلا يعملون مثل عمله ‏\"‏ ‏.‏ وزادني غيره قال يا رسول الله أجر خمسين منهم قال ‏\"‏ أجر خمسين منكم ‏\"‏ ‏.‏",
      "text_en": " Abu Umayyah ash-Sha'bani said:                      I asked AbuTha'labah al-Khushani: What is your opinion about the verse \"Care for yourselves\".  He said: I swear by Allah, I asked the one who was well informed about it; I asked the Messenger of Allah (ﷺ) about it.  He said: No, enjoin one another to do what is good and forbid one another to do what is evil.  But when you see niggardliness being obeyed, passion being followed, worldly interests being preferred, everyone being charmed with his opinion, then care for yourself, and leave alone what people in general are doing; for ahead of you are days which will require endurance, in which showing endurance will be like grasping live coals. The one who acts rightly during that period will have the reward of fifty men who act as he does.  Another version has: He said (The hearers asked:) Messenger of Allah, the reward of fifty of them?  He replied: The reward of fifty of you.",
      "chain": [
        "30137",
        "20025",
        "19928",
        "27030",
        "17556"
      ]
    },
    {
      "hadith_no": "2147",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن سعيد بن جرير، - نسائي - قال حدثنا أبو الربيع، قال حدثنا منصور بن أبي الأسود، عن عبد الملك بن أبي سليمان، عن عطاء، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تسحروا فإن في السحور بركة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said; 'Take Sahur, for in Sahur there is blessing.\"\"",
      "chain": [
        "38401",
        "30137",
        "15551",
        "10945",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "4180",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا الحسن بن أحمد، قال حدثنا أبو الربيع، قال أنبأنا حماد، قال حدثنا أيوب، عن محمد، عن أم عطية، قالت أخذ علينا رسول الله صلى الله عليه وسلم البيعة على أن لا ننوح ‏.‏",
      "text_en": " It was narrated that Umm 'Atiyyah said:                     \"The Messenger of Allah accepted our pledge that we would not wail (for the dead).\"",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "5412",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الحسن بن أحمد الكرماني، قال حدثنا أبو الربيع، قال حدثنا حماد، قال حدثنا يحيى، عن أبي أمامة بن سهل بن حنيف، أن النبي صلى الله عليه وسلم أتي بامرأة قد زنت فقال ‏\"‏ ممن ‏\"‏ ‏.‏ قالت من المقعد الذي في حائط سعد ‏.‏ فأرسل إليه فأتي به محمولا فوضع بين يديه فاعترف فدعا رسول الله صلى الله عليه وسلم بإثكال فضربه ورحمه لزمانته وخفف عنه ‏.‏",
      "text_en": " It was narrated from Abu Umamah bin Sahl bin Hunaif that:                     A woman who had committed Zina was brought to the Prophet [SAW]. He said: \"With whom?\" She said: \"With the paralyzed man who lives in the garden of Sa'd.\" He was brought and placed before (the Prophet [SAW]) and he confessed. The Messenger of Allah [SAW] called for a bunch of palm leaves and hit him. He took pity on him because of his disability and was lenient with him.",
      "chain": [
        "30137",
        "20022",
        "20031",
        "405"
      ]
    }
  ],
  "total_hadiths": 112
}