{
  "id": "30138",
  "name": "Sahl bin Bkar bin Bashr سهل بن بكار بن بشر",
  "full_name": "Sahl bin Bkar bin Bashr سهل بن بكار بن بشر",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "228",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-1505",
      "hadith_no": "1505",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن عمرو بن يحيى، عن عباس الساعدي، عن أبي حميد الساعدي، قال غزونا مع النبي صلى الله عليه وسلم غزوة تبوك فلما جاء وادي القرى إذا امرأة في حديقة لها فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ اخرصوا ‏\"‏‏.‏ وخرص رسول الله صلى الله عليه وسلم عشرة أوسق فقال لها ‏\"‏ أحصي ما يخرج منها ‏\"‏‏.‏ فلما أتينا تبوك قال ‏\"‏ أما إنها ستهب الليلة ريح شديدة فلا يقومن أحد، ومن كان معه بعير فليعقله ‏\"‏‏.‏ فعقلناها وهبت ريح شديدة فقام رجل فألقته بجبل طيئ  وأهدى ملك أيلة للنبي صلى الله عليه وسلم بغلة بيضاء، وكساه بردا وكتب له ببحرهم  فلما أتى وادي القرى قال للمرأة ‏\"‏ كم جاء حديقتك ‏\"‏‏.‏ قالت عشرة أوسق خرص رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إني متعجل إلى المدينة، فمن أراد منكم أن يتعجل معي فليتعجل ‏\"‏‏.‏ فلما  قال ابن بكار كلمة معناها  أشرف على المدينة قال ‏\"‏ هذه طابة ‏\"‏‏.‏ فلما رأى أحدا قال ‏\"‏ هذا جبيل يحبنا ونحبه، ألا أخبركم بخير دور الأنصار ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ دور بني النجار، ثم دور بني عبد الأشهل، ثم دور بني ساعدة، أو دور بني الحارث بن الخزرج، وفي كل دور الأنصار  يعني  خيرا ‏\"‏‏.‏ وقال سليمان بن بلال حدثني عمرو، ‏\"‏ ثم دار بني الحارث، ثم بني ساعدة ‏\"‏‏.‏ وقال سليمان عن سعد بن سعيد، عن عمارة بن غزية، عن عباس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحد جبل يحبنا ونحبه ‏\"‏‏.‏ قال أبو عبد الله كل بستان عليه حائط فهو حديقة، وما لم يكن عليه حائط لم يقل حديقة‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     We took part in the holy battle of Tabuk in the company of the Prophet and when we arrived at the Wadi-al-Qura, there was a woman in her garden. The Prophet asked his companions to estimate the amount of the fruits in the garden, and Allah's Apostle estimated it at ten Awsuq (One Wasaq = 60 Sa's) and 1 Sa'= 3 kg. approximately). The Prophet said to that lady, \"Check what your garden will yield.\" When we reached Tabuk, the Prophet said, \"There will be a strong wind tonight and so no one should stand and whoever has a camel, should fasten it.\" So we fastened our camels. A strong wind blew at night and a man stood up and he was blown away to a mountain called Taiy, The King of Aila sent a white mule and a sheet for wearing to the Prophet as a present, and wrote to the Prophet that his people would stay in their place (and will pay Jizya taxation.) (1) When the Prophet reached Wadi-al- Qura he asked that woman how much her garden had yielded. She said, \"Ten Awsuq,\" and that was what Allah's Apostle had estimated. Then the Prophet said, \"I want to reach Medina quickly, and whoever among you wants to accompany me, should hurry up.\" The sub-narrator Ibn Bakkar said something which meant: When the Prophet (p.b.u.h) saw Medina he said, \"This is Taba.\" And when he saw the mountain of Uhud, he said, \"This mountain loves us and we love it. Shall I tell you of the best amongst the Ansar?\" They replied in the affirmative. He said, \"The family of Bani-n-Najjar, and then the family of Bani Sa`ida or Bani Al-Harith bin Al-Khazraj. (The above-mentioned are the best) but there is goodness in all the families of Ansar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-1737",
      "hadith_no": "1737",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس  وذكر الحديث  قال ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏ مختصرا‏.‏",
      "text_en": " Narrated Sahl bin Bakkar:                     The narration of Anas abridged, saying, \"The Prophet slaughtered seven Budn (camels) while standing, with his own hands. On the day of `Id-ul-Adha he slaughtered (sacrificed) two horned rams, black and white in color.",
      "usc_msa_ref": "770",
      "chain": [
        "30138",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "id": "sahih-bukhari-1739",
      "hadith_no": "1739",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم الظهر بالمدينة أربعا، والعصر بذي الحليفة ركعتين، فبات بها، فلما أصبح ركب راحلته، فجعل يهلل ويسبح، فلما علا على البيداء لبى بهما جميعا، فلما دخل مكة أمرهم أن يحلوا‏.‏ ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered four rak`at of Zuhr prayer at Medina; and two rak`at of `Asr prayer at Dhil- Hulaifa and spent the night there and when (the day) dawned, he mounted his Mount and started saying, \"None has the right to be worshipped but Allah, and Glorified be Allah.\" When he reached Al- Baida' he recited Talbiya for both Hajj and `Umra. And when he arrived at Mecca, he ordered them (his companions) to finish their Ihram. The Prophet slaughtered seven Budn (camel) with his own hands while the camels were standing He also sacrificed two horned rams (black and white in color) at Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3161",
      "hadith_no": "3161",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن عمرو بن يحيى، عن عباس الساعدي، عن أبي حميد الساعدي، قال غزونا مع النبي صلى الله عليه وسلم تبوك، وأهدى ملك أيلة للنبي صلى الله عليه وسلم بغلة بيضاء، وكساه بردا، وكتب له ببحرهم‏.‏",
      "text_en": " Narrated Abu Humaid As-Saidi:                     We accompanied the Prophet in the Ghazwa of Tabuk and the king of 'Aila presented a white mule and a cloak as a gift to the Prophet. And the Prophet wrote to him a peace treaty allowing him to keep authority over his country.",
      "usc_msa_ref": "387",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-3079",
      "hadith_no": "3079",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب بن خالد، عن عمرو بن يحيى، عن العباس الساعدي، - يعني ابن سهل بن سعد - عن أبي حميد الساعدي، قال غزوت مع رسول الله صلى الله عليه وسلم تبوك فلما أتى وادي القرى إذا امرأة في حديقة لها فقال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ اخرصوا ‏\"‏ ‏.‏ فخرص رسول الله صلى الله عليه وسلم عشرة أوسق فقال للمرأة ‏\"‏ أحصي ما يخرج منها ‏\"‏ ‏.‏ فأتينا تبوك فأهدى ملك أيلة إلى رسول الله صلى الله عليه وسلم بغلة بيضاء وكساه بردة وكتب له - يعني - ببحره ‏.‏ قال فلما أتينا وادي القرى قال للمرأة ‏\"‏ كم كان في حديقتك ‏\"‏ ‏.‏ قالت عشرة أوسق خرص رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني متعجل إلى المدينة فمن أراد منكم أن يتعجل معي فليتعجل ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid Al Sa’idi said “I went to Tabuk on an expedition along with the Apostle of Allaah(ﷺ). When he reached Wadi Al Qura, he found a woman in her garden. The Apostle of Allaah(ﷺ) said to his Companions “Assess (the quantity o fruits). The Apostle of Allaah(ﷺ) assessed ten wasqs.” He said to the woman “Count the produce of it. We then came to Tabuk.” The monarch of Ailah presented a white mule as a gift to the Apostle of Allaah(ﷺ). He presented a cloak as a gift o him and wrote a document for his land at sea coast. When we came to Wadi Al Qura he said to the woman “How much is the produce of your garden?” She replied “Ten wasqs which the Apostle of Allaah(ﷺ) had assessed.” The Apostle of Allaah(ﷺ) said “I am going quickly to Madeenah if any of you intend to go quickly with me , he should make haste.”",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-3092",
      "hadith_no": "3092",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سهل بن بكار، عن أبي عوانة، عن عبد الملك بن عمير، عن أم العلاء، قالت عادني رسول الله صلى الله عليه وسلم وأنا مريضة فقال ‏\"‏ أبشري يا أم العلاء فإن مرض المسلم يذهب الله به خطاياه كما تذهب النار خبث الذهب والفضة ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm al-Ala:                     The Messenger of Allah (ﷺ) visited me while I was sick. He said: Be glad, Umm al-Ala' for Allah removes the sins of a Muslim for his illness as fire removes the dross of gold and silver.",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20469",
        "11368"
      ]
    },
    {
      "id": "sunan-abi-daud-3230",
      "hadith_no": "3230",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سهل بن بكار، حدثنا الأسود بن شيبان، عن خالد بن سمير السدوسي، عن بشير بن نهيك، عن بشير، مولى رسول الله صلى الله عليه وسلم وكان اسمه في الجاهلية زحم بن معبد فهاجر إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما اسمك ‏\"‏ ‏.‏ قال زحم ‏.‏ قال ‏\"‏ بل أنت بشير ‏\"‏ ‏.‏ قال بينما أنا أماشي رسول الله صلى الله عليه وسلم مر بقبور المشركين فقال ‏\"‏ لقد سبق هؤلاء خيرا كثيرا ‏\"‏ ‏.‏ ثلاثا ثم مر بقبور المسلمين فقال ‏\"‏ لقد أدرك هؤلاء خيرا كثيرا ‏\"‏ ‏.‏ وحانت من رسول الله صلى الله عليه وسلم نظرة فإذا رجل يمشي في القبور عليه نعلان فقال ‏\"‏ يا صاحب السبتيتين ويحك ألق سبتيتيك ‏\"‏ ‏.‏ فنظر الرجل فلما عرف رسول الله صلى الله عليه وسلم خلعهما فرمى بهما ‏.‏",
      "text_en": " Narrated Bashir, the Client of the Messenger of Allah:                     Bashir's name in pre-Islamic days was Zahm ibn Ma'bad. When he migrated to the Messenger of Allah (ﷺ).  He asked: What is your name?  He replied: Zahm. He said: No, you are Bashir.  He (Bashir) said: When I was walking with the Messenger of Allah (ﷺ) he passed by the graves of the polytheists.  He said: They lived before (a period of) abundant good. He said this three times. He then passed by the graves of Muslims. He said: They received abundant good. The Messenger of Allah (ﷺ) suddenly saw a man walking in shoes between the graves. He said: O man, wearing the shoes! Woe to thee! Take off thy shoes. So the man looked (round), When he recognized the Messenger of Allah (ﷺ), he took them off and threw them away.",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "10669",
        "11266"
      ]
    },
    {
      "id": "sunan-abi-daud-3811",
      "hadith_no": "3811",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن ابن طاوس، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله صلى الله عليه وسلم يوم خيبر عن لحوم الحمر الأهلية وعن الجلالة عن ركوبها وأكل لحمها ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     On the day of Khaybar the Messenger of Allah (may pease be upon him) forbade (eating) the flesh of domestic asses, and the animal which feeds on filth: riding it and eating its flesh.",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20299",
        "11433",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-5109",
      "hadith_no": "5109",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وسهل بن بكار، قالا حدثنا أبو عوانة، ح وحدثنا عثمان بن أبي شيبة، حدثنا جرير، - المعنى - عن الأعمش، عن مجاهد، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من استعاذكم بالله فأعيذوه ومن سألكم بالله فأعطوه ‏\"‏ ‏.‏ وقال سهل وعثمان ‏\"‏ ومن دعاكم فأجيبوه ‏\"‏ ‏.‏ ثم اتفقوا ‏\"‏ ومن آتى إليكم معروفا فكافئوه ‏\"‏ ‏.‏ قال مسدد وعثمان ‏\"‏ فإن لم تجدوا فادعوا الله له حتى تعلموا أن قد كافأتموه ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Messenger of Allah (May peace be upon him) as saying:                      If anyone asks you refuge for Allah’s sake give him refuge; and if anyone asks you (for something) for Allah’s sake, give him. Sahl and Sulaiman said: if anyone calls you, respond to him. The Agreed version goes; if you do not afford to compensate him, pray Allah for him until you know that you have compensated him.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30138",
        "20469",
        "30203",
        "11060",
        "11028",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2281",
      "hadith_no": "2281",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن عبد الكريم، قال حدثنا سهل بن بكار، قال حدثنا أبو عوانة، عن أبي بشر، عن هانئ بن عبد الله بن الشخير، عن أبيه، قال كنت مسافرا فأتيت النبي صلى الله عليه وسلم وهو يأكل وأنا صائم فقال ‏\"‏ هلم ‏\"‏ ‏.‏ قلت إني صائم ‏.‏ قال ‏\"‏ أتدري ما وضع الله عن المسافر ‏\"‏ ‏.‏ قلت وما وضع الله عن المسافر قال ‏\"‏ الصوم وشطر الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hani bin 'Abdullah bin Shikhkhir that his father said:                     \"I was traveling and I came to the Prophet when he was eating and I was fasting. He said: 'Come and eat.' I said: 'I am fasting.' He said: 'Do you know what Allah has waived for the traveler?' he said: 'Do you know what Allah has waived for the traveler?' I said: 'What has Allah waived for the traveler?' He said: 'Fasting and half of the prayer.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20469",
        "11419"
      ]
    },
    {
      "id": "sunan-an-nasai-4447",
      "hadith_no": "4447",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني عثمان بن عبد الله، قال حدثني سهل بن بكار، قال حدثنا وهيب بن خالد، عن ابن طاوس، عن عمرو بن شعيب، عن أبيه، محمد بن عبد الله بن عمرو قال مرة عن أبيه، وقال، مرة عن جده، أن رسول الله صلى الله عليه وسلم نهى يوم خيبر عن لحوم الحمر الأهلية وعن الجلالة وعن ركوبها وعن أكل لحمها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his father Muhammad bin 'Abdullah bin 'Amr - or on one occasion he said:                     from his father, form his grandfather - the on the Day of Kahaibar, the Messenger of Allah forbade the flesh of domesticated donkeys and of al-Jallalah (animals that eat dung), and (he forbade) riding them and eating their mat.\"",
      "usc_msa_ref": "",
      "chain": [
        "11524",
        "30138",
        "20299",
        "11433",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 11
}