{
  "id": "30136",
  "name": "Zayd bin Akhzm زيد بن أخزم",
  "full_name": "Zayd bin Akhzm زيد بن أخزم",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  4  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Tai'i",
      "al-Tai'i",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20233",
      "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3562",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا زيد  هو ابن أخزم  قال أبو قتيبة سلم بن قتيبة حدثني مثنى بن سعيد القصير، قال حدثني أبو جمرة، قال لنا ابن عباس ألا أخبركم بإسلام أبي ذر، قال قلنا بلى‏.‏ قال قال أبو ذر كنت رجلا من غفار، فبلغنا أن رجلا قد خرج بمكة، يزعم أنه نبي، فقلت لأخي انطلق إلى هذا الرجل كلمه وأتني بخبره‏.‏ فانطلق فلقيه، ثم رجع فقلت ما عندك فقال والله لقد رأيت رجلا يأمر بالخير وينهى عن الشر‏.‏ فقلت له لم تشفني من الخبر‏.‏ فأخذت جرابا وعصا، ثم أقبلت إلى مكة فجعلت لا أعرفه، وأكره أن أسأل عنه، وأشرب من ماء زمزم وأكون في المسجد‏.‏ قال فمر بي علي فقال كأن الرجل غريب‏.‏ قال قلت نعم‏.‏ قال فانطلق إلى المنزل‏.‏ قال فانطلقت معه لا يسألني عن شىء، ولا أخبره، فلما أصبحت غدوت إلى المسجد لأسأل عنه، وليس أحد يخبرني عنه بشىء‏.‏ قال فمر بي علي فقال أما نال للرجل يعرف منزله بعد قال قلت لا‏.‏ قال انطلق معي‏.‏ قال فقال ما أمرك وما أقدمك هذه البلدة قال قلت له إن كتمت على أخبرتك‏.‏ قال فإني أفعل‏.‏ قال قلت له بلغنا أنه قد خرج ها هنا رجل يزعم أنه نبي، فأرسلت أخي ليكلمه فرجع ولم يشفني من الخبر، فأردت أن ألقاه‏.‏ فقال له أما إنك قد رشدت، هذا وجهي إليه، فاتبعني، ادخل حيث أدخل، فإني إن رأيت أحدا أخافه عليك، قمت إلى الحائط، كأني أصلح نعلي، وامض أنت، فمضى ومضيت معه، حتى دخل ودخلت معه على النبي صلى الله عليه وسلم فقلت له اعرض على الإسلام‏.‏ فعرضه فأسلمت مكاني، فقال لي ‏\"‏ يا أبا ذر اكتم هذا الأمر، وارجع إلى بلدك، فإذا بلغك ظهورنا فأقبل ‏\"‏‏.‏ فقلت والذي بعثك بالحق لأصرخن بها بين أظهرهم‏.‏ فجاء إلى المسجد، وقريش فيه فقال يا معشر قريش، إني أشهد أن لا إله إلا الله، وأشهد أن محمدا عبده ورسوله‏.‏ فقالوا قوموا إلى هذا الصابئ‏.‏ فقاموا فضربت لأموت فأدركني العباس، فأكب على ثم أقبل عليهم، فقال ويلكم تقتلون رجلا من غفار، ومتجركم وممركم على غفار‏.‏ فأقلعوا عني، فلما أن أصبحت الغد رجعت فقلت مثل ما قلت بالأمس، فقالوا قوموا إلى هذا الصابئ‏.‏ فصنع ‏{‏بي‏}‏ مثل ما صنع بالأمس وأدركني العباس فأكب على، وقال مثل مقالته بالأمس‏.‏ قال فكان هذا أول إسلام أبي ذر رحمه الله‏.‏",
      "text_en": " Narrated Abu Jamra:                     Ibn `Abbas said to us, \"Shall I tell you the story of Abu Dhar's conversion to Islam?\" We said, \"Yes.\" He said, \"Abu Dhar said: I was a man from the tribe of Ghifar. We heard that a man had appeared in Mecca, claiming to be a Prophet. ! said to my brother, 'Go to that man and talk to him and bring me his news.' He set out, met him and returned. I asked him, 'What is the news with you?' He said, 'By Allah, I saw a man enjoining what is good and forbidding what is evil.' I said to him, 'You have not satisfied me with this little information.' So, I took a waterskin and a stick and proceeded towards Mecca. Neither did I know him (i.e. the Prophet ), nor did I like to ask anyone about him. I Kept on drinking Zam zam water and staying in the Mosque. Then `Ali passed by me and said, 'It seems you are a stranger?' I said, 'Yes.' He proceeded to his house and I accompanied him. Neither did he ask me anything, nor did I tell him anything. Next morning I went to the Mosque to ask about the Prophet but no-one told me anything about him. `Ali passed by me again and asked, 'Hasn't the man recognized his dwelling place yet' I said, 'No.' He said, 'Come along with me.' He asked me, 'What is your business? What has brought you to this town?' I said to him, 'If you keep my secret, I will tell you.' He said, 'I will do,' I said to him, 'We have heard that a person has appeared here, claiming to be a Prophet. I sent my brother to speak to him and when he returned, he did not bring a satisfactory report; so I thought of meeting him personally.' `Ali said (to Abu Dhar), 'You have reached your goal; I am going to him just now, so follow me, and wherever I enter, enter after me. If I should see someone who may cause you trouble, I will stand near a wall pretending to mend my shoes (as a warning), and you should go away then.' `Ali proceeded and I accompanied him till he entered a place, and I entered with him to the Prophet to whom I said, 'Present (the principles of) Islam to me.' When he did, I embraced Islam 'immediately. He said to me, 'O Abu Dhar! Keep your conversion as a secret and return to your town; and when you hear of our victory, return to us. ' I said, 'By H him Who has sent you with the Truth, I will announce my conversion to Islam publicly amongst them (i.e. the infidels),' Abu Dhar went to the Mosque, where some people from Quraish were present, and said, 'O folk of Quraish ! I testify that None has the right to be worshipped except Allah, and I (also) testify that Muhammad is Allah's Slave and His Apostle.' (Hearing that) the Quraishi men said, 'Get at this Sabi (i.e. Muslim) !' They got up and beat me nearly to death. Al `Abbas saw me and threw himself over me to protect me. He then faced them and said, 'Woe to you! You want to kill a man from the tribe of Ghifar, although your trade and your communications are through the territory of Ghifar?' They therefore left me. The next morning I returned (to the Mosque) and said the same as I have said on the previous day. They again said, 'Get at this Sabi!' I was treated in the same way as on the previous day, and again Al-Abbas found me and threw himself over me to protect me and told them the same as he had said the day before.' So, that was the conversion of Abu Dhar (may Allah be Merciful to him) to Islam.\"",
      "chain": [
        "30136",
        "20233",
        "11309"
      ]
    },
    {
      "hadith_no": "637",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زيد بن أخزم، حدثنا أبو داود، عن أبي عوانة، عن عاصم، عن أبي عثمان، عن ابن مسعود، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أسبل إزاره في صلاته خيلاء فليس من الله في حل ولا حرام ‏\"‏ ‏.‏ قال أبو داود روى هذا جماعة عن عاصم موقوفا على ابن مسعود منهم حماد بن سلمة وحماد بن زيد وأبو الأحوص وأبو معاوية ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     I heard the Messenger of Allah (ﷺ) say: He who lets his garment trail during prayer out of pride, Allah, the Almighty, has nothing to do with pardoning him and protecting him from Hell.",
      "chain": [
        "30136",
        "30002",
        "20469",
        "11080",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "2943",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا زيد بن أخزم أبو طالب، حدثنا أبو عاصم، عن عبد الوارث بن سعيد، عن حسين المعلم، عن عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من استعملناه على عمل فرزقناه رزقا فما أخذ بعد ذلك فهو غلول ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: When we appoint someone to an administrative post and provide him with an allowance, anything he takes beyond that is unfaithful dealing.",
      "chain": [
        "30136",
        "20241",
        "20258",
        "11278",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3999",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا زيد بن أخزم، حدثنا بشر، - يعني ابن عمر - حدثنا محمد بن خازم، قال ذكر كيف قراءة جبرائل وميكائل عند الأعمش فحدثنا الأعمش عن سعد الطائي عن عطية العوفي عن أبي سعيد الخدري قال ذكر رسول الله صلى الله عليه وسلم صاحب الصور فقال ‏\"‏ عن يمينه جبرائل وعن يساره ميكائل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) mentioned the name of the one who will sound the trumpet (sahib as-sur) and said: On his right will be Jibra'il and on his left will be Mika'il.",
      "chain": [
        "30136",
        "20211",
        "20354",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "4908",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا أبان، ح وحدثنا زيد بن أخزم الطائي، حدثنا بشر بن عمر، حدثنا أبان بن يزيد العطار، حدثنا قتادة، عن أبي العالية، - قال زيد - عن ابن عباس، أن رجلا، لعن الريح - وقال مسلم إن رجلا نازعته الريح رداءه على عهد النبي صلى الله عليه وسلم فلعنها - فقال النبي صلى الله عليه وسلم ‏\"‏ لا تلعنها فإنها مأمورة وإنه من لعن شيئا ليس له بأهل رجعت اللعنة عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man cursed the wind. The narrator Muslim's version has: The wind snatched away a man's cloak during the time of the Prophet (ﷺ) and he cursed it. The Prophet (ﷺ) said: Do not curse it, for it is under command, and if anyone curses a thing undeservedly, the curse returns upon him.",
      "chain": [
        "20285",
        "20205",
        "30136",
        "20211",
        "20205",
        "11019",
        "11618",
        "15",
        "17",
        "20285"
      ]
    },
    {
      "hadith_no": "5183",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا زيد بن أخزم، حدثنا عبد القاهر بن شعيب، حدثنا هشام، عن حميد بن هلال، عن أبي بردة بن أبي موسى، عن أبيه، بهذه القصة قال فقال عمر لأبي موسى إني لم أتهمك ولكن الحديث عن رسول الله صلى الله عليه وسلم شديد ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Musa in a similar way through a different chain of narrators. This version has:                      ‘Umar said to Abu Musa : I do not blame you, but the matter of transmitting a tradition from the Messenger of Allah (May peace be upon him) is serious.",
      "chain": [
        "30136",
        "24272",
        "20295",
        "11281",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1047",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا زيد بن أخزم الطائي البصري، حدثنا عثمان بن فرقد، قال سمعت جعفر بن محمد، عن أبيه، قال الذي ألحد قبر رسول الله صلى الله عليه وسلم أبو طلحة والذي ألقى القطيفة تحته شقران مولى رسول الله صلى الله عليه وسلم ‏.‏ قال جعفر وأخبرني عبيد الله بن أبي رافع قال سمعت شقران يقول أنا والله طرحت القطيفة تحت رسول الله صلى الله عليه وسلم في القبر ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث شقران حديث حسن غريب ‏.‏ وروى علي بن المديني عن عثمان بن فرقد هذا الحديث ‏.‏",
      "text_en": " Ja'far bin Muhammad narrated that:                     His father said: \"The one who made the Lahd in the grave of the Messenger of Allah was Abu Talhah. And the one who placed the velvet cloth under him was Shuqran a freed slave of Messenger of Allah.\"",
      "chain": [
        "30136",
        "20263",
        "10898",
        "11442"
      ]
    },
    {
      "hadith_no": "1082",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو هشام الرفاعي، وزيد بن أخزم الطائي، وإسحاق بن إبراهيم البصري، قالوا حدثنا معاذ بن هشام، عن أبيه، عن قتادة، عن الحسن، عن سمرة، أن النبي صلى الله عليه وسلم نهى عن التبتل ‏.‏ قال أبو عيسى وزاد زيد بن أخزم في حديثه وقرأ قتادة ‏:‏ ‏(‏ولقد أرسلنا رسلا من قبلك وجعلنا لهم أزواجا وذرية ‏)‏ ‏.‏ قال وفي الباب عن سعد وأنس بن مالك وعائشة وابن عباس ‏.‏ قال أبو عيسى حديث سمرة حديث حسن غريب ‏.‏ وروى الأشعث بن عبد الملك هذا الحديث عن الحسن عن سعد بن هشام عن عائشة عن النبي صلى الله عليه وسلم نحوه ‏.‏ ويقال كلا الحديثين صحيح ‏.‏",
      "text_en": " Qatadah narrated from Al-Hasan, from Samurah that:                     The Prophet prohibited celibacy.",
      "chain": [
        "30478",
        "30136",
        "30123",
        "20287",
        "20295",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "1560",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا أبو قتيبة، سلم بن قتيبة حدثنا شعبة، عن أيوب، عن أبي قلابة، عن أبي ثعلبة الخشني، قال سئل رسول الله صلى الله عليه وسلم عن قدور المجوس فقال ‏\"‏ أنقوها غسلا واطبخوا فيها ‏\"‏ ‏.‏ ونهى عن كل سبع وذي ناب ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن أبي ثعلبة رواه أبو إدريس الخولاني عن أبي ثعلبة ‏.‏ وأبو قلابة لم يسمع من أبي ثعلبة إنما رواه عن أبي أسماء عن أبي ثعلبة ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.",
      "chain": [
        "30136",
        "20233",
        "20020",
        "11015",
        "11047",
        "4056"
      ]
    },
    {
      "hadith_no": "1796",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا سلم بن قتيبة، حدثنا شعبة، عن أيوب، عن أبي قلابة، عن أبي ثعلبة، قال سئل رسول الله صلى الله عليه وسلم عن قدور المجوس فقال ‏\"‏ أنقوها غسلا واطبخوا فيها ‏\"‏ ‏.‏ ونهى عن كل سبع ذي ناب ‏.‏ قال أبو عيسى هذا حديث مشهور من حديث أبي ثعلبة وروي عنه من غير هذا الوجه ‏.‏ وأبو ثعلبة اسمه جرثوم ويقال جرهم ويقال ناشب ‏.‏ وقد ذكر هذا الحديث عن أبي قلابة عن أبي أسماء الرحبي عن أبي ثعلبة ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) was asked about the pots of Zorastrians. He said: 'Clean them by washing them, and then cook in them.\" And he prohibited every predator possessing canines.\"This is a well known Hadith of Abu Tha'labah, and it has been reported from him through routes other than this. And Abu Tha'labah's name is Jurthum, and they say: Jurhum, and they say: Nashib. This Hadith has also been mentioned by Abu Qilabah from Abu 'Asma Ar-Rahbi, from Abu Tha'labah.",
      "chain": [
        "30136",
        "20020",
        "11015",
        "11047",
        "4056"
      ]
    },
    {
      "hadith_no": "1826",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا أبو قتيبة، عن أبي العوام، عن قتادة، عن زهدم الجرمي، قال دخلت على أبي موسى وهو يأكل دجاجا فقال ادن فكل فإني رأيت رسول الله صلى الله عليه وسلم يأكله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث من غير وجه عن زهدم ولا نعرفه إلا من حديث زهدم ‏.‏ وأبو العوام هو عمران القطان ‏.‏",
      "text_en": " Narrated Zahdam Al-Jarmi:                     \"I entered upon Abu Musa while he was eating chicken, and he said: 'Sit and eat, for indeed I saw the Messenger of Allah (ﷺ) eating it.'\"[Abu 'Eisa said:] This Hadith is Hasan. This Hadith has been reported through other routes from Zahdam, and we do not know of it except as the narration of Zahdam. (One of the narrators) Abu Al-'Awwam is 'Imran Al-Qattan.",
      "chain": [
        "30136",
        "20233",
        "11019",
        "11589"
      ]
    },
    {
      "hadith_no": "2106",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا زيد بن أخزم الطائي البصري، حدثنا بشر بن عمر، حدثنا أبان بن يزيد، عن قتادة، عن أبي العالية، عن ابن عباس، أن رجلا، لعن الريح عند النبي صلى الله عليه وسلم فقال ‏\"‏ لا تلعن الريح فإنها مأمورة وإنه من لعن شيئا ليس له بأهل رجعت اللعنة عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعلم أحدا أسنده غير بشر بن عمر ‏.‏",
      "text_en": " 'Ibn 'Abbas narrated that a man cursed the wind in the presence of the Prophet, so he said:                     \"Do not curse the wind, for it is merely doing as ordered , and whoever curses something undeservingly, then the curse returns upon him.\"",
      "chain": [
        "30136",
        "20211",
        "20205",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "2710",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا زيد بن أخزم الطائي البصري، حدثنا إبراهيم بن أبي الوزير، حدثنا عبد الله بن جعفر المخرمي، عن محمد بن عبد الرحمن بن نبيه، عن محمد بن المنكدر، عن جابر، قال ذكر رجل عند النبي صلى الله عليه وسلم بعبادة واجتهاد وذكر عنده آخر برعة فقال النبي صلى الله عليه وسلم ‏\"‏ لا تعدل بالرعة ‏\"‏ ‏.‏ وعبد الله بن جعفر هو من ولد المسور بن مخرمة وهو مدني ثقة عند أهل الحديث ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Muhammad bin Al-Munkadir narrated from Jabir, that a man was mentioned in the presence of the Prophet (s.a.w) for his worship and striving in it, and another man was mentioned for his cautious piety. So the Prophet (s.a.w) said:                     \"Nothing is equal to cautious piety.\"",
      "chain": [
        "30136",
        "31010",
        "20505",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3977",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا زيد بن أخزم الطائي البصري، حدثنا أبو قتيبة، سلم بن قتيبة حدثني أبو مودود المدني، حدثنا عثمان بن الضحاك، عن محمد بن يوسف بن عبد الله بن سلام، عن أبيه، عن جده، قال مكتوب في التوراة صفة محمد وعيسى ابن مريم يدفن معه ‏.‏ قال فقال أبو مودود وقد بقي في البيت موضع قبر ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ هكذا قال عثمان بن الضحاك والمعروف الضحاك بن عثمان المدني ‏.‏",
      "text_en": " Narrated 'Abdullah bin Salam:                     \"The description of Muhammad is written in the Tawrah, [and the description that] 'Eisa will be buried next to him.\" (One of the narrators) Abu Mawdud said: \"[And] there is a place for a grave left in the house.\"",
      "chain": [
        "30136",
        "20233",
        "21357",
        "22145",
        "12492"
      ]
    },
    {
      "hadith_no": "4201",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا أبو داود، عن شعبة، عن جابر، عن أبي نصر، عن أنس، رضى الله عنه قال كناني رسول الله صلى الله عليه وسلم ببقلة كنت أجتنيها ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث جابر الجعفي عن أبي نصر ‏.‏ وأبو نصر هو خيثمة البصري روى عن أنس أحاديث ‏.‏",
      "text_en": " Narrated Anas [may Allah be pleased with him]:                     \"The Messenger of Allah (ﷺ) gave me my Kunyah because of a plant that I used to care for.\"",
      "chain": [
        "30136",
        "20547",
        "20020",
        "34",
        "19"
      ]
    },
    {
      "hadith_no": "4323",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا عبد القاهر بن شعيب، حدثنا هشام، عن الحسن، عن عمران بن حصين، قال مات النبي صلى الله عليه وسلم وهو يكره ثلاثة أحياء ثقيفا وبني حنيفة وبني أمية ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     \"The Prophet (ﷺ) died while he was having trouble with three tribes: Thaqif, Banu Hanifah, and Banu Umayyah.\"",
      "chain": [
        "30136",
        "20295",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا زيد بن أخزم، عن ابن داود، - يعني عبد الله بن داود الخريبي - عن علي بن صالح، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال كأني أنظر إلى بياض خده عن يمينه ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ وعن يساره ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Prophet (ﷺ) said: \"It is as if I can see the whiteness of his cheek, saying to his right: As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah) and to his left: As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah).\" (Sahih",
      "chain": [
        "30136",
        "20593",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "3724",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا زيد بن أخزم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا عمرو بن دينار، عن طاوس، عن الحجوري، عن عبد الله بن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ العمرى جائزة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that the Prophet said:                      \"'Umra is permissible.\"",
      "chain": [
        "30136",
        "20287",
        "20295",
        "11019",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "269",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا زيد بن أخزم، وأبو بدر عباد بن الوليد قالا حدثنا محمد بن عباد الهنائي، حدثنا علي بن المبارك الهنائي، عن أيوب السختياني، عن خالد بن دريك، عن ابن عمر، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من طلب العلم لغير الله أو أراد به غير الله فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Prophet said: \"Whoever seeks knowledge for a reason other than the sake of Allah, or intends it for a purpose other than for the sake of Allah, let him take his place in hell.\"",
      "chain": [
        "30136",
        "36577",
        "24402",
        "20449",
        "11015",
        "19906",
        "18"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا زيد بن أخزم أبو طالب، حدثنا معاذ بن هشام، حدثنا أبي، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ يقطع الصلاة المرأة والكلب والحمار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Theprayeris severed by a woman, a dog and a donkey.”",
      "chain": [
        "30136",
        "20287",
        "20295",
        "11019",
        "11284",
        "11166",
        "13"
      ]
    },
    {
      "hadith_no": "1055",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا زيد بن أخزم أبو طالب، حدثنا أبو داود، وأبو قتيبة قالا حدثنا هارون بن مسلم، عن قتادة، عن معاوية بن قرة، عن أبيه، قال كنا ننهى أن نصف، بين السواري على عهد رسول الله  صلى الله عليه وسلم  ونطرد عنها طردا ‏.‏",
      "text_en": " It wasnarrated from Mu’awiyah bin Qurrah that his father said:                      “Wewereforbidden to form a row between two pillars at the time of theMessenger of Allah (ﷺ), and we would be repelled from themforcefully.”",
      "chain": [
        "30136",
        "20547",
        "20233",
        "11019",
        "11306",
        "5238"
      ]
    },
    {
      "hadith_no": "1077",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا زيد بن أخزم، وعبدة بن عبد الله، قالا حدثنا عبد الصمد، حدثنا حماد بن سلمة، عن ثابت، عن أنس بن مالك، أن رسول الله  صلى الله عليه وسلم  بزق في ثوبه وهو في الصلاة ثم دلكه ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)spaton his garment while he was performing prayer, then he rubbed it.",
      "chain": [
        "30136",
        "30149",
        "20250",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1213",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، وزيد بن أخزم، ومحمد بن معمر، قالوا حدثنا موسى بن داود الكوفي، حدثنا قيس بن الربيع، عن شعبة، عن خالد الحذاء، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا فاتته الأربع قبل الظهر صلاها بعد الركعتين بعد الظهر ‏.‏ قال أبو عبد الله لم يحدث به إلا قيس عن شعبة ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “If the Messenger of Allah (ﷺ)missed the four Rak’ah before the Zuhr, he would perform them afterthe two Rak’ah which come after the Zuhr.”",
      "chain": [
        "11222",
        "30136",
        "30172",
        "20636",
        "25246",
        "20020",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1440",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا زيد بن أخزم، وعبد الرحمن بن عمر، قالا حدثنا يحيى بن سعيد، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تتخذوا بيوتكم قبورا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)said:‘Do not make your houses into graves.’”",
      "chain": [
        "30136",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1922",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا بشر بن آدم، وزيد بن أخزم، قالا حدثنا معاذ بن هشام، حدثنا أبي، عن قتادة، عن الحسن، عن سمرة، ‏.‏ أن رسول الله  صلى الله عليه وسلم  نهى عن التبتل ‏.‏ زاد زيد بن أخزم وقرأ قتادة ‏{ولقد أرسلنا رسلا من قبلك وجعلنا لهم أزواجا وذرية}‏ ‏.‏",
      "text_en": " It was narrated from Samurah that:                     the Messenger of Allah(ﷺ) forbade celibacy. Zaid bin Akhzam added: “And Qatadah recited: 'And indeed We sent Messengers before you (O Muhammad (ﷺ)), and made for them wives and offspring.'”",
      "chain": [
        "30125",
        "30136",
        "20287",
        "20295",
        "11019",
        "11016"
      ]
    },
    {
      "hadith_no": "2326",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن يحيى، وزيد بن أخزم، قالا حدثنا الضحاك بن مخلد، حدثنا الحسن بن يزيد بن فروخ، - قال محمد بن يحيى وهو أبو يونس القوي - قال سمعت أبا سلمة، يقول سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحلف عند هذا المنبر عبد ولا أمة على يمين آثمة ولو على سواك رطب إلا وجبت له النار ‏\"‏ ‏.‏",
      "text_en": " Muhammad bin Yahya, who is Abu Yunus Al-Qawi, said:                     I heard Abu Salamah say: I heard Abu Hurairah say: “The Messenger of Allah (ﷺ) said: 'No man or woman swears a false oath beside this pulpit, even if it is for a fresh twig, but he will be doomed to Hell.”",
      "chain": [
        "11222",
        "30136",
        "11222",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3031",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا زيد بن أخزم، حدثنا مؤمل بن إسماعيل، حدثنا سفيان، عن جعفر بن محمد، عن أبيه، عن جابر، قال كانت تلبية رسول الله  صلى الله عليه وسلم  ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Talbiyah of the Messenger ofAllah(ﷺ) was: ‘Labbaika Allahumma labbaik, (labbaika) la sharikalakalabbaik. Innal-hamd wan-ni’mata laka, wal-mulk. La sharika laka(Here I am, O Allah, here I am. Here I am, You have no partner, hereIam. Verily all praise and blessings are Yours, and all sovereignty,You have no partner).’”",
      "chain": [
        "30136",
        "23066",
        "20012",
        "10898",
        "11442",
        "34"
      ]
    }
  ],
  "total_hadiths": 27
}