{
  "id": "30144",
  "name": "'Abdullah bin Muhammad bin Asma' عبد الله بن محمد بن أسماء",
  "full_name": "'Abdullah bin Muhammad bin Asma' عبد الله بن محمد بن أسماء",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "231",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  س  -  أوثق الناس ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20216",
      "name": "Jawayriyya bin Asma' bin 'Ubaid جويرية بن أسماء بن عبيد الضبعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38479",
      "name": "Muhammad bin Isma'il محمد بن إسماعيل",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30437",
      "name": "'Abbas bin 'Abdul 'Azeem al-'Anbari عباس بن عبد العظيم العنبري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38144",
      "name": "al-Hasan bin Ahmed bin Habib الحسن بن أحمد بن حبيب",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "36001",
      "name": "Ahmed bin Sa'd bin al-Hakam أحمد بن سعد بن الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34093",
      "name": "Swar bin Sahl سوار بن سهل",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-878",
      "hadith_no": "878",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، قال أخبرنا جويرية، عن مالك، عن الزهري، عن سالم بن عبد الله بن عمر، عن ابن عمر  رضى الله عنهما  أن عمر بن الخطاب، بينما هو قائم في الخطبة يوم الجمعة إذ دخل رجل من المهاجرين الأولين من أصحاب النبي صلى الله عليه وسلم فناداه عمر أية ساعة هذه قال إني شغلت فلم أنقلب إلى أهلي حتى سمعت التأذين، فلم أزد أن توضأت‏.‏ فقال والوضوء أيضا وقد علمت أن رسول الله صلى الله عليه وسلم كان يأمر بالغسل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While `Umar bin Al-Khattab was standing and delivering the sermon on a Friday, one of the companions of the Prophet, who was one of the foremost Muhajirs (emigrants) came. `Umar said to him, \"What is the time now?\" He replied, \"I was busy and could not go back to my house till I heard the Adhan. I did not perform more than the ablution.\" Thereupon `Umar said to him, \"Did you perform only the ablution although you know that Allah's Apostle (p.b.u.h) used to order us to take a bath (on Fridays)?\"",
      "usc_msa_ref": "3",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-946",
      "hadith_no": "946",
      "source": "Sahih Bukhari",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن نافع، عن ابن عمر، قال قال النبي صلى الله عليه وسلم لنا لما رجع من الأحزاب ‏\"‏ لا يصلين أحد العصر إلا في بني قريظة ‏\"‏‏.‏ فأدرك بعضهم العصر في الطريق فقال بعضهم لا نصلي حتى نأتيها، وقال بعضهم بل نصلي لم يرد منا ذلك‏.‏ فذكر للنبي صلى الله عليه وسلم فلم يعنف واحدا منهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When the Prophet () returned from the battle of Al-Ahzab (The confederates), he said to us, \"None should offer the 'Asr prayer but at Bani Quraiza.\" The 'Asr prayer became due for some of them on the way. Some of them decided not to offer the Salat but at Bani Quraiza while others decided to offer the Salat on the spot and said that the intention of the Prophet () was not what the former party had understood. And when that was told to the Prophet () he did not blame anyone of them.",
      "usc_msa_ref": "",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1756",
      "hadith_no": "1756",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية بن أسماء، عن نافع، أن عبد الله، قال حلق النبي صلى الله عليه وسلم وطائفة من أصحابه، وقصر بعضهم‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet and some of his companions got their heads shaved and some others got their hair cut short.",
      "usc_msa_ref": "",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1836",
      "hadith_no": "1836",
      "source": "Sahih Bukhari",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن نافع، أن عبيد الله بن عبد الله، وسالم بن عبد الله، أخبراه أنهما، كلما عبد الله بن عمر  رضى الله عنهما  ليالي نزل الجيش بابن الزبير فقالا لا يضرك أن لا تحج العام، وإنا نخاف أن يحال بينك وبين البيت‏.‏ فقال خرجنا مع رسول الله صلى الله عليه وسلم فحال كفار قريش دون البيت، فنحر النبي صلى الله عليه وسلم هديه، وحلق رأسه، وأشهدكم أني قد أوجبت العمرة، إن شاء الله أنطلق، فإن خلي بيني وبين البيت طفت، وإن حيل بيني وبينه فعلت كما فعل النبي صلى الله عليه وسلم وأنا معه‏.‏ فأهل بالعمرة من ذي الحليفة، ثم سار ساعة، ثم قال ‏\"‏ إنما شأنهما واحد، أشهدكم أني قد أوجبت حجة مع عمرتي ‏\"‏‏.‏ فلم يحل منهما حتى حل يوم النحر، وأهدى، وكان يقول لا يحل حتى يطوف طوافا واحدا يوم يدخل مكة‏.‏",
      "text_en": " Narrated Nafi`:                     That Ubaidullah bin `Abdullah and Salim bin `Abdullah informed him that they told Ibn `Umar when Ibn Az-Zubair was attacked by the army, saying \"There is no harm for you if you did not perform Hajj this year. We are afraid that you may be prevented from reaching the Ka`ba.\" Ibn `Umar said \"We set out with Allah's Apostle and the non-believers of Quraish prevented us from reaching the Ka`ba, and so the Prophet slaughtered his Hadi and got his head shaved.\" Ibn `Umar added, \"I make you witnesses that I have made `Umra obligatory for me. And, Allah willing, I will go and then if the way to Ka`ba is clear, I will perform the Tawaf, but if I am prevented from going to the Ka`ba then I will do the same as the Prophet did while I was in his company.\" Ibn `Umar then assumed Ihram for Umra from Dhul-Hulaifa and proceeded for a while and said, \"The conditions of `Umra and Hajj are similar and I make you witnesses that I have made `Umra and Hajj obligatory for myself.\" So, he did not finish the Ihram till the day of Nahr (slaughtering) came, and he slaughtered his Hadi. He used to say, \"I will not finish the Ihram till I perform the Tawaf, one Tawaf on the day of entering Mecca (i.e. of Safa and Marwa for both `Umra and Hajj).",
      "usc_msa_ref": "34",
      "chain": [
        "30144",
        "20216",
        "11014",
        "11004"
      ]
    },
    {
      "id": "sahih-bukhari-3387",
      "hadith_no": "3387",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء ابن أخي جويرية حدثنا جويرية بن أسماء، عن مالك، عن الزهري، أن سعيد بن المسيب، وأبا، عبيد أخبراه عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحم الله لوطا، لقد كان يأوي إلى ركن شديد، ولو لبثت في السجن ما لبث يوسف ثم أتاني الداعي لأجبته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"May Allah bestow His Mercy on Lot. He wanted to have a powerful support. If I were to stay in prison (for a period equal to) the stay of Joseph (prison) and then the offer of freedom came to me, then I would have accepted it.\" (See Hadith No. 591)",
      "usc_msa_ref": "601",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3482",
      "hadith_no": "3482",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عذبت امرأة في هرة سجنتها حتى ماتت، فدخلت فيها النار، لا هي أطعمتها ولا سقتها إذ حبستها، ولا هي تركتها تأكل من خشاش الأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"A lady was punished because of a cat which she had imprisoned till it died. She entered the (Hell) Fire because of it, for she neither gave it food nor water as she had imprisoned it, nor set it free to eat from the vermin of the earth.\"",
      "usc_msa_ref": "689",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4062",
      "hadith_no": "4062",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن سالم بن عبد الله، أخبره قال أخبر رافع بن خديج عبد الله بن عمر، أن عميه، وكانا، شهدا بدرا أخبراه أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏ قلت لسالم فتكريها أنت قال نعم، إن رافعا أكثر على نفسه‏.‏",
      "text_en": " Narrated Az-Zuhri:                     Salim bin `Abdullah told me that Rafi` bin Khadij told `Abdullah bin `Umar that his two paternal uncles who had fought in the battle of Badr informed him that Allah's Apostle forbade the renting of fields. I said to Salim, \"Do you rent your land?\" He said, \"Yes, for Rafi` is mistaken.\"",
      "usc_msa_ref": "349",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11011",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-4169",
      "hadith_no": "4169",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية بن أسماء، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم الأحزاب ‏\"‏ لا يصلين أحد العصر إلا في بني قريظة ‏\"‏‏.‏ فأدرك بعضهم العصر في الطريق، فقال بعضهم لا نصلي حتى نأتيها‏.‏ وقال بعضهم بل نصلي، لم يرد منا ذلك، فذكر ذلك للنبي صلى الله عليه وسلم فلم يعنف واحدا منهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the day of Al-Ahzab (i.e. Clans) the Prophet said, \"None of you Muslims) should offer the `Asr prayer but at Banu Quraiza's place.\" The `Asr prayer became due for some of them on the way. Some of those said, \"We will not offer it till we reach it, the place of Banu Quraiza,\" while some others said, \"No, we will pray at this spot, for the Prophet did not mean that for us.\" Later on It was mentioned to the Prophet and he did not berate any of the two groups.",
      "usc_msa_ref": "445",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4234",
      "hadith_no": "4234",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن نافع، أن عبيد الله بن عبد الله، وسالم بن عبد الله، أخبراه أنهما، كلما عبد الله بن عمر‏.‏ وحدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، أن بعض بني عبد الله، قال له لو أقمت العام، فإني أخاف أن لا تصل إلى البيت‏.‏ قال خرجنا مع النبي صلى الله عليه وسلم فحال كفار قريش دون البيت، فنحر النبي صلى الله عليه وسلم هداياه، وحلق وقصر أصحابه، وقال ‏\"‏ أشهدكم أني أوجبت عمرة ‏\"‏‏.‏ فإن خلي بيني وبين البيت طفت، وإن حيل بيني وبين البيت صنعت كما صنع رسول الله صلى الله عليه وسلم فسار ساعة ثم قال ما أرى شأنهما إلا واحدا، أشهدكم أني قد أوجبت حجة مع عمرتي‏.‏ فطاف طوافا واحدا وسعيا واحدا، حتى حل منهما جميعا‏.‏",
      "text_en": " Narrated Nafi`:                     One of `Abdullah's sons said to `Abdullah (bin `Umar) \"I wish you would stay this year (and not perform Hajj) as I am afraid that you will not be able to reach the Ka`ba.\" On that he (i.e. `Abdullah bin `Umar) said, \"We went out with the Prophet (for `Umra), and when the Quraish infidel intervened between us and the Ka`ba, the Prophet slaughtered his Hadi and shaved (his head), and his companions cut short their hair.\" Then `Abdullah bin `Umar said, \"I make you witness that I have intended to perform `Umra and if I am allowed to reach the Ka`ba, I will perform the Tawaf, and if something (i.e. obstacles) intervene between me and the Ka`ba, then I will do what Allah's Apostle did.\" Then after going for a while, he said, \"I consider the ceremonies (of both `Umra and Hajj as one and the same, so I would like you to witness that I have intended to perform Hajj along with my `Umra.\" So he performed only one Tawaf and one Sai (between Safa and Marwa) and finished the Ihram of both Umra and Hajj).",
      "usc_msa_ref": "499",
      "chain": [
        "30144",
        "20216",
        "11014",
        "11004",
        "20040",
        "20216",
        "11014"
      ]
    },
    {
      "id": "sahih-bukhari-5265",
      "hadith_no": "5265",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك بن أنس، عن الزهري، عن ابن محيريز، عن أبي سعيد الخدري، قال أصبنا سبيا فكنا نعزل فسألنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أوإنكم لتفعلون قالها ثلاثا ما من نسمة كائنة إلى يوم القيامة إلا هي كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We got female captives in the war booty and we used to do coitus interruptus with them. So we asked Allah's Apostle about it and he said, \"Do you really do that?\" repeating the question thrice, \"There is no soul that is destined to exist but will come into existence, till the Day of Resurrection.\"",
      "usc_msa_ref": "137",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-7293",
      "hadith_no": "7293",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن حميد بن عبد الرحمن، أخبره أن المسور بن مخرمة أخبره‏.‏ أن الرهط الذين ولاهم عمر اجتمعوا فتشاوروا، قال لهم عبد الرحمن لست بالذي أنافسكم على هذا الأمر، ولكنكم إن شئتم اخترت لكم منكم‏.‏ فجعلوا ذلك إلى عبد الرحمن، فلما ولوا عبد الرحمن أمرهم فمال الناس على عبد الرحمن، حتى ما أرى أحدا من الناس يتبع أولئك الرهط ولا يطأ عقبه، ومال الناس على عبد الرحمن يشاورونه تلك الليالي حتى إذا كانت الليلة التي أصبحنا منها، فبايعنا عثمان قال المسور طرقني عبد الرحمن بعد هجع من الليل فضرب الباب حتى استيقظت فقال أراك نائما، فوالله ما اكتحلت هذه الليلة بكبير نوم، انطلق فادع الزبير وسعدا، فدعوتهما له فشاورهما ثم دعاني فقال ادع لي عليا‏.‏ فدعوته فناجاه حتى ابهار الليل، ثم قام علي من عنده، وهو على طمع، وقد كان عبد الرحمن يخشى من علي شيئا، ثم قال ادع لي عثمان، فدعوته فناجاه حتى فرق بينهما المؤذن بالصبح، فلما صلى للناس الصبح واجتمع أولئك الرهط عند المنبر، فأرسل إلى من كان حاضرا من المهاجرين والأنصار، وأرسل إلى أمراء الأجناد وكانوا وافوا تلك الحجة مع عمر، فلما اجتمعوا تشهد عبد الرحمن ثم قال أما بعد يا علي، إني قد نظرت في أمر الناس فلم أرهم يعدلون بعثمان، فلا تجعلن على نفسك سبيلا‏.‏ فقال أبايعك على سنة الله ورسوله والخليفتين من بعده‏.‏ فبايعه عبد الرحمن، وبايعه الناس المهاجرون والأنصار وأمراء الأجناد والمسلمون‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     The group of people whom `Umar had selected as candidates for the Caliphate gathered and consulted each other. `Abdur-Rahman said to them, \"I am not going to compete with you in this matter, but if you wish, I would select for you a caliph from among you.\" So all of them agreed to let `Abdur-Rahman decide the case. So when the candidates placed the case in the hands of `Abdur-Rahman, the people went towards him and nobody followed the rest of the group nor obeyed any after him. So the people followed `Abdur-Rahman and consulted him all those nights till there came the night we gave the oath of allegiance to `Uthman. Al-Miswar (bin Makhrama) added: `Abdur-Rahman called on me after a portion of the night had passed and knocked on my door till I got up, and he said to me, \"I see you have been sleeping! By Allah, during the last three nights I have not slept enough. Go and call Az-Zubair and Sa`d.' So I called them for him and he consulted them and then called me saying, 'Call `Ali for me.\" I called `Ali and he held a private talk with him till very late at night, and then 'Al, got up to leave having had much hope (to be chosen as a Caliph) but `Abdur-Rahman was afraid of something concerning `Ali. `Abdur-Rahman then said to me, \"Call `Uthman for me.\" I called him and he kept on speaking to him privately till the Mu'adh-dhin put an end to their talk by announcing the Adhan for the Fajr prayer. When the people finished their morning prayer and that (six men) group gathered near the pulpit, `Abdur-Rahman sent for all the Muhajirin (emigrants) and the Ansar present there and sent for the army chief who had performed the Hajj with `Umar that year. When all of them had gathered, `Abdur- Rahman said, \"None has the right to be worshipped but Allah,\" and added, \"Now then, O `Ali, I have looked at the people's tendencies and noticed that they do not consider anybody equal to `Uthman, so you should not incur blame (by disagreeing).\" Then `Abdur-Rahman said (to `Uthman), \"I gave the oath of allegiance to you on condition that you will follow Allah's Laws and the traditions of Allah's Apostle and the traditions of the two Caliphs after him.\" So `Abdur-Rahman gave the oath of allegiance to him, and so did the people including the Muhajirin (emigrants) and the Ansar and the chiefs of the army staff and all the Muslims.",
      "usc_msa_ref": "",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "10561",
        "2201"
      ]
    },
    {
      "id": "sunan-abi-daud-3945",
      "hadith_no": "3945",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى مالك ولم يذكر ‏\"‏ وإلا فقد عتق منه ما عتق ‏\"‏ ‏.‏ انتهى حديثه إلى ‏\"‏ وأعتق عليه العبد ‏\"‏ ‏.‏ على معناه ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Ibn 'Umar through a different chain of transmitters to the same effect as mentioned by Malik. In this version there is no mention of the words \"otherwise he will be emancipated to the extent of the first man's share.\" His version ends \"and the slave be thus emancipated,\" to the same effect as he (Malik) mentioned.",
      "usc_msa_ref": "",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-317",
      "hadith_no": "317",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا العباس بن عبد العظيم العنبري، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، أنه أخبره عن أبيه، عن عمار بن ياسر، قال تيممنا مع رسول الله صلى الله عليه وسلم بالتراب فمسحنا بوجوهنا وأيدينا إلى المناكب ‏.‏",
      "text_en": " It was narrated that 'Ammar bin Yasir said:                      \"We did Tayammum with the Messenger of Allah (ﷺ) using dust, and we wiped our faces and our arms up to the shoulders.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30144",
        "20216",
        "20001",
        "11013",
        "11004",
        "4145",
        "25"
      ]
    },
    {
      "id": "sunan-an-nasai-1598",
      "hadith_no": "1598",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية بن أسماء، عن الوليد بن أبي هشام، عن نافع، أن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلوا في بيوتكم ولا تتخذوها قبورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nafi' that Abdullah bin Umar said:                     \"Pray in your houses and do not make them like graves.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30144",
        "20216",
        "10622",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1603",
      "hadith_no": "1603",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل أبو بكر، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، قال قال الزهري أخبرني أبو سلمة بن عبد الرحمن، وحميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"Whoever prays Qiyam during Ramadan out of faith and in the hope of reward, he will be forgiven his previous sins.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "30144",
        "20216",
        "20001",
        "11013",
        "10567",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2201",
      "hadith_no": "2201",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمد بن إسماعيل، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، قال الزهري أخبرني أبو سلمة بن عبد الرحمن، وحميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever spends the night of Ramadan in prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "30144",
        "20216",
        "20001",
        "11013",
        "10567",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3903",
      "hadith_no": "3903",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا عبد الله بن محمد بن أسماء، عن جويرية، عن مالك، عن الزهري، أن سالم بن عبد الله، وذكر، نحوه‏.‏‏ تابعه عقيل بن خالد‏.‏‏",
      "text_en": " It was narrated from Az-Zuhri that Salim bin 'Abdullah narrated something similar.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30144",
        "20216",
        "20001",
        "11013",
        "11011"
      ]
    },
    {
      "id": "sunan-an-nasai-5026",
      "hadith_no": "5026",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن إسمعيل قال حدثنا عبد الله بن محمد بن أسماء قال حدثنا جويرية عن مالك عن الزهري أخبرني أبو سلمة بن عبد الرحمن وحميد بن عبد الرحمن عن أبي هريرة  أن النبي صلى الله عليه وسلم قال من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in the hope of reward, his previous sins will be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5096",
      "hadith_no": "5096",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية بن أسماء، عن الوليد بن أبي هشام، عن نافع، أنه بلغه أن رسول الله صلى الله عليه وسلم لعن الواصلة والمستوصلة والواشمة والمستوشمة ‏.‏",
      "text_en": " It was narrated from Nafi' that he heard that:                     The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the woman who has that done, the woman who does tattoos and the woman who has that done.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30144",
        "20216",
        "10622",
        "11014"
      ]
    }
  ],
  "total_hadiths": 19
}