{
  "id": "30140",
  "name": "al-Salt bin Muhammad bin 'Abdur Rahman الصلت بن محمد",
  "full_name": "al-Salt bin Muhammad bin 'Abdur Rahman الصلت بن محمد",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "210",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  -  صدوق ]"
    ],
    "tags": [
      "al-Basri",
      "al-Kharki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20568",
      "name": "Muslimh bin 'Alqama al-Mazny مسلمة بن علقمة المازني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20182",
      "name": "al-Mughira bin 'Abdur Rahman - Qusayy المغيرة بن عبد الرحمن بن عبد الله - قصي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25232",
      "name": "Ghsan bin al-Aghr bin Husayn غسان بن الأغر بن حصين",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "389",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "أخبرنا الصلت بن محمد، أخبرنا مهدي، عن واصل، عن أبي وائل، عن حذيفة، رأى رجلا لا يتم ركوعه ولا سجوده، فلما قضى صلاته قال له حذيفة ما صليت  قال وأحسبه قال  لو مت مت على غير سنة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa that he saw a person bowing and prostrating imperfectly. When he finished his Salat, Hudhaifa told him that he had not offered Salat. The subnarrator added, \"I think that Hudhaifa also said:                      Were you to die you would die on a \"Sunna\" (legal way) other than that of Muhammad ().\"",
      "chain": [
        "30140",
        "11307",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "808",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا الصلت بن محمد، قال حدثنا مهدي، عن واصل، عن أبي وائل، عن حذيفة، رأى رجلا لا يتم ركوعه ولا سجوده، فلما قضى صلاته قال له حذيفة ما صليت  قال وأحسبه قال  ولو مت مت على غير سنة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Wail:                     Hudhaifa said, \"I saw a person not performing his bowing and prostrations perfectly. When he completed the prayer, I told him that he had not prayed.\" I think that Hudhaifa added (i.e. said to the man), \"Had you died, you would have died on a tradition other than that of the Prophet Muhammad.\"",
      "chain": [
        "30140",
        "11307",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "1983",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا مهدي، عن غيلان،‏.‏ وحدثنا أبو النعمان، حدثنا مهدي بن ميمون، حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ أنه سأله  أو سأل رجلا وعمران يسمع  فقال ‏\"‏ يا أبا فلان أما صمت سرر هذا الشهر ‏\"‏‏.‏ قال أظنه قال يعني رمضان‏.‏ قال الرجل لا يا رسول الله‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏‏.‏ لم يقل الصلت أظنه يعني رمضان‏.‏ قال أبو عبد الله وقال ثابث عن مطرف عن عمران عن النبي صلى الله عليه وسلم ‏\"‏ من سرر شعبان ‏\"‏‏.‏",
      "text_en": " Narrated Mutarrif from `Imran Ibn Husain:                     That the Prophet asked him (Imran) or asked a man and `Imran was listening, \"O Abu so-and-so! Have you fasted the last days of this month?\" (The narrator thought that he said, \"the month of Ramadan\"). The man replied, \"No, O Allah's Apostle!\" The Prophet said to him, \"When you finish your fasting (of Ramadan) fast two days (in Shawwal).\" Through another series of narrators `Imran said, \"The Prophet said, '(Have you fasted) the last days of Sha'ban?\"",
      "chain": [
        "30140",
        "11307",
        "20283",
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "2158",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا عبد الواحد، حدثنا معمر، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تلقوا الركبان ولا يبيع حاضر لباد ‏\"‏‏.‏ قال فقلت لابن عباس ما قوله لا يبيع حاضر لباد قال لا يكون له سمسارا‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"Allah's Apostle said, 'Do not go to meet the caravans on the way (for buying their goods without letting them know the market price); a town dweller should not sell the goods of a desert dweller on behalf of the latter.' I asked Ibn `Abbas, 'What does he mean by not selling the goods of a desert dweller by a town dweller?' He said, 'He should not become his broker.' \"",
      "chain": [
        "30140",
        "20256",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2292",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا أبو أسامة، عن إدريس، عن طلحة بن مصرف، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما – ‏{‏ولكل جعلنا موالي‏}‏ قال ورثة ‏{‏والذين عقدت أيمانكم‏}‏ قال كان المهاجرون لما قدموا المدينة يرث المهاجر الأنصاري دون ذوي رحمه للأخوة التي آخى النبي صلى الله عليه وسلم بينهم، فلما نزلت ‏{‏ولكل جعلنا موالي‏}‏ نسخت، ثم قال ‏{‏والذين عقدت أيمانكم ‏}‏ إلا النصر والرفادة والنصيحة، وقد ذهب الميراث ويوصي له‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said, \"In the verse: To every one We have appointed ' (Muwaliya Muwaliya means one's) heirs (4.33).' (And regarding the verse) 'And those with whom your right hands have made a pledge.' Ibn `Abbas said, \"When the emigrants came to the Prophet in Medina, the emigrant would inherit the Ansari while the latter's relatives would not inherit him because of the bond of brotherhood which the Prophet established between them (i.e. the emigrants and the Ansar). When the verse: 'And to everyone We have appointed heirs' (4.33) was revealed, it canceled (the bond (the pledge) of brotherhood regarding inheritance).\" Then he said, \"The verse: To those also to whom your right hands have pledged, remained valid regarding cooperation and mutual advice, while the matter of inheritance was excluded and it became permissible to assign something in one's testament to the person who had the right of inheriting before.",
      "chain": [
        "30140",
        "20318",
        "20407",
        "11356",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3737",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن ابن أبي مليكة، عن المسور بن مخرمة، قال لما طعن عمر جعل يألم، فقال له ابن عباس  وكأنه يجزعه  يا أمير المؤمنين، ولئن كان ذاك لقد صحبت رسول الله صلى الله عليه وسلم فأحسنت صحبته، ثم فارقته وهو عنك راض، ثم صحبت أبا بكر فأحسنت صحبته، ثم فارقته وهو عنك راض، ثم صحبت صحبتهم فأحسنت صحبتهم، ولئن فارقتهم لتفارقنهم وهم عنك راضون‏.‏ قال أما ما ذكرت من صحبة رسول الله صلى الله عليه وسلم ورضاه، فإنما ذاك من من الله تعالى من به على، وأما ما ذكرت من صحبة أبي بكر ورضاه، فإنما ذاك من من الله جل ذكره من به على، وأما ما ترى من جزعي، فهو من أجلك وأجل أصحابك، والله لو أن لي طلاع الأرض ذهبا لافتديت به من عذاب الله عز وجل قبل أن أراه‏.‏ قال حماد بن زيد حدثنا أيوب، عن ابن أبي مليكة، عن ابن عباس، دخلت على عمر بهذا‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     When `Umar was stabbed, he showed signs of agony. Ibn `Abbas, as if intending to encourage `Umar, said to him, \"O Chief of the believers! Never mind what has happened to you, for you have been in the company of Allah's Apostle and you kept good relations with him and you parted with him while he was pleased with you. Then you were in the company of Abu Bakr and kept good relations with him and you parted with him (i.e. he died) while he was pleased with you. Then you were in the company of the Muslims, and you kept good relations with them, and if you leave them, you will leave them while they are pleased with you.\" `Umar said, (to Ibn \"Abbas), \"As for what you have said about the company of Allah's Apostle and his being pleased with me, it is a favor, Allah did to me; and as for what you have said about the company of Abu Bakr and his being pleased with me, it is a favor Allah did to me; and concerning my impatience which you see, is because of you and your companions. By Allah! If (at all) I had gold equal to the earth, I would have ransomed myself with it from the Punishment of Allah before I meet Him.\"",
      "chain": [
        "30140",
        "20208",
        "11015",
        "11090",
        "2201"
      ]
    },
    {
      "hadith_no": "3828",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الصلت بن محمد أبو همام، قال سمعت المغيرة بن عبد الرحمن، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قالت الأنصار اقسم بيننا وبينهم النخل‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال يكفونا المئونة وتشركونا في التمر‏.‏ قالوا سمعنا وأطعنا‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Ansar said (to the Prophet ), \"Please divide the date-palm trees between us and them (i.e. emigrants).\" The Prophet said, \"No.\" The Ansar said, \"Let them (i.e. the emigrants) do the labor for us in the gardens and share the date-fruits with us.\" The emigrants said, \"We accepted this.\"",
      "chain": [
        "30140",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4206",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا يزيد بن زريع، عن سعيد، عن قتادة، قلت لسعيد بن المسيب بلغني أن جابر بن عبد الله، كان يقول كانوا أربع عشرة مائة‏.‏ فقال لي سعيد حدثني جابر كانوا خمس عشرة مائة الذين بايعوا النبي صلى الله عليه وسلم يوم الحديبية‏.‏ قال أبو داود حدثنا قرة عن قتادة‏.‏",
      "text_en": " Narrated Qatada:                     I said to Sa`id bin Al-Musaiyab, \"I have been informed that Jabir bin `Abdullah said that the number (of Al-Hudaibiya Muslim warriors) was 1400.\" Sa`id said to me, \"Jabir narrated to me that they were 1500 who gave the Pledge of allegiance to the Prophet on the day of Al-Hudaibiya.'",
      "chain": [
        "30140",
        "20304",
        "11168",
        "11019",
        "34",
        "11168"
      ]
    },
    {
      "hadith_no": "4420",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الصلت بن محمد، قال سمعت مهدي بن ميمون، قال سمعت أبا رجاء العطاردي، يقول كنا نعبد الحجر، فإذا وجدنا حجرا هو أخير منه ألقيناه وأخذنا الآخر، فإذا لم نجد حجرا جمعنا جثوة من تراب، ثم جئنا بالشاة فحلبناه عليه، ثم طفنا به، فإذا دخل شهر رجب قلنا منصل الأسنة‏.‏ فلا ندع رمحا فيه حديدة ولا سهما فيه حديدة إلا نزعناه وألقيناه شهر رجب‏.‏وسمعت أبا رجاء، يقول كنت يوم بعث النبي صلى الله عليه وسلم غلاما أرعى الإبل على أهلي، فلما سمعنا بخروجه فررنا إلى النار إلى مسيلمة الكذاب‏.‏",
      "text_en": " Narrated Abu Raja Al-Utaridi:                     We used to worship stones, and when we found a better stone than the first one, we would throw the first one and take the latter, but if we could not get a stone then we would collect some earth (i.e. soil) and then bring a sheep and milk that sheep over it, and perform the Tawaf around it. When the month of Rajab came, we used (to stop the military actions), calling this month the iron remover, for we used to remove and throw away the iron parts of every spear and arrow in the month of Rajab. Abu Raja' added: When the Prophet sent with (Allah's) Message, I was a boy working as a shepherd of my family camels. When we heard the news about the appearance of the Prophet, we ran to the fire, i.e. to Musailima al-Kadhdhab.",
      "chain": [
        "30140",
        "11307",
        "11440"
      ]
    },
    {
      "hadith_no": "4485",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا أبو عوانة، عن هلال الوزان، عن عروة بن الزبير، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم في مرضه الذي لم يقم منه ‏\"‏ لعن الله اليهود، اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ قالت عائشة لولا ذلك لأبرز قبره‏.‏ خشي أن يتخذ مسجدا‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     `Aisha said, \"The Prophet said during his fatal illness, \"Allah cursed the Jews for they took the graves of their prophets as places for worship.\" `Aisha added, \"Had it not been for that (statement of the Prophet ) his grave would have been made conspicuous. But he was afraid that it might be taken as a place for worship.\"",
      "chain": [
        "30140",
        "20469",
        "22977",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4623",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني الصلت بن محمد، حدثنا أبو أسامة، عن إدريس، عن طلحة بن مصرف، عن سعيد بن جبير، عن ابن عباس   رضى الله عنهما  ‏{‏ولكل جعلنا موالي‏}‏ قال ورثة‏.‏ ‏{‏والذين عاقدت أيمانكم‏}‏ كان المهاجرون لما قدموا المدينة يرث المهاجر الأنصاري دون ذوي رحمه للأخوة التي آخى النبي صلى الله عليه وسلم بينهم فلما نزلت ‏{‏ولكل جعلنا موالي‏}‏ نسخت، ثم قال ‏{‏والذين عاقدت أيمانكم ‏}‏ من النصر، والرفادة والنصيحة، وقد ذهب الميراث ويوصي له‏.‏ سمع أبو أسامة إدريس، وسمع إدريس طلحة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: \"To everyone, We have appointed heirs.\" (4.33) 'Mawali' means heirs. And regarding:-- \"And those to whom your right hands have pledged.\" When the Emigrants came to Medina, an Emigrant used to be the heir of an Ansari with the exclusion of the latter's relatives, and that was because of the bond of brotherhood which the Prophet had established between them (i.e. the Emigrants and the Ansar). So when the Verses:-- \"To everyone We have appointed heirs.\" was revealed, (the inheritance through bond of brotherhood) was cancelled. Ibn `Abbas then said: \"And those to whom your right hands have pledged.\" is concerned with the covenant of helping and advising each other. So allies are no longer to be the heir of each other, but they can bequeath each other some of their property by means of a will.",
      "chain": [
        "30140",
        "20318",
        "20407",
        "11356",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4783",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا مهدي بن ميمون، حدثنا محمد بن سيرين، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ التقى آدم وموسى، فقال موسى لآدم أنت الذي أشقيت الناس وأخرجتهم من الجنة قال له آدم أنت الذي اصطفاك الله برسالته، واصطفاك لنفسه وأنزل عليك التوراة قال نعم‏.‏ قال فوجدتها كتب على قبل أن يخلقني قال نعم‏.‏ فحج آدم موسى ‏\"‏‏.‏ اليم البحر‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Adam and Moses met, and Moses said to Adam \"You are the one who made people miserable and turned them out of Paradise.\" Adam said to him, \"You are the one whom Allah selected for His message and whom He selected for Himself and upon whom He revealed the Torah.\" Moses said, 'Yes.' Adam said, \"Did you find that written in my fate before my creation?' Moses said, 'Yes.' So Adam overcame Moses with this argument.\"",
      "chain": [
        "30140",
        "11307",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4864",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا يزيد بن زريع، عن روح بن القاسم، عن منصور، عن مجاهد، عن أبي معمر، عن ابن مسعود، ‏{‏وما كنتم تستترون أن يشهد، عليكم سمعكم‏}‏ الآية كان رجلان من قريش وختن لهما من ثقيف، أو رجلان من ثقيف وختن لهما من قريش في بيت فقال بعضهم لبعض أترون أن الله يسمع حديثنا قال بعضهم يسمع بعضه‏.‏ وقال بعضهم لئن كان يسمع بعضه لقد يسمع كله‏.‏ فأنزلت ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم‏}‏ الآية ‏{‏وذلكم ظنكم‏}‏ الآية‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     (regarding) the Verse: 'And you have not been screening against yourself lest your ears, and your eyes and your skins should testify against you..' (41.22) While two persons from Quraish and their brotherin- law from Thaqif (or two persons from Thaqif and their brother-in-law from Quraish) were in a house, they said to each other, \"Do you think that Allah hears our talks?\" Some said, \"He hears a portion thereof\" Others said, \"If He can hear a portion of it, He can hear all of it.\" Then the following Verse was revealed: 'And you have not been screening against yourself lest your ears, and your eyes and your skins should testify against you...' (41.22)",
      "chain": [
        "30140",
        "20304",
        "11586",
        "11067",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "5506",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا حماد بن زيد، عن الجعد أبي عثمان، عن أنس،‏.‏ وعن هشام، عن محمد، عن أنس،‏.‏ وعن سنان أبي ربيعة، عن أنس، أن أم سليم، أمه عمدت إلى مد من شعير، جشته وجعلت منه خطيفة، وعصرت عكة عندها، ثم بعثتني إلى النبي صلى الله عليه وسلم فأتيته وهو في أصحابه فدعوته قال ‏\"‏ ومن معي ‏\"‏‏.‏ فجئت فقلت إنه يقول، ومن معي، فخرج إليه أبو طلحة قال يا رسول الله إنما هو شىء صنعته أم سليم، فدخل فجيء به وقال ‏\"‏ أدخل على عشرة ‏\"‏‏.‏ فدخلوا فأكلوا حتى شبعوا، ثم قال ‏\"‏ أدخل على عشرة ‏\"‏‏.‏ فدخلوا فأكلوا حتى شبعوا، ثم قال ‏\"‏ أدخل على عشرة ‏\"‏‏.‏ حتى عد أربعين، ثم أكل النبي صلى الله عليه وسلم ثم قام، فجعلت أنظر هل نقص منها شىء‏.‏",
      "text_en": " Narrated Anas:                     My mother, Um Sulaim, took a Mudd of barley grain, ground it and made porridge from it, and pressed (over it), a butter skin she had with her. Then she sent me to the Prophet, and I reached him while he was sitting with his companions. I invited him, whereupon he said, \"And those who are with me?' I returned and said, \"He says, 'And those who are with me?\" Abu Talha went out to him and said, \"O Allah's Apostle! It is just a meal prepared by Um Sulaim.\" The Prophet entered and the food was brought to him. He said, \"Let ten persons enter upon me.\" Those ten entered and ate their fill. Again he said, 'Let ten (more) enter upon me.\" Those ten entered and ate their fill. Then he said, \"Let ten (more) enter upon me.\" He called forty persons in all Then Allah's Apostle ate and got up. I started looking (at the food) to see if it decreased or not.",
      "chain": [
        "30140",
        "20022",
        "11580",
        "11065",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "6614",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني الصلت بن محمد، حدثنا يزيد بن زريع، ‏{‏ونزعنا ما في صدورهم من غل‏}‏ قال حدثنا سعيد عن قتادة عن أبي المتوكل الناجي أن أبا سعيد الخدري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يخلص المؤمنون من النار، فيحبسون على قنطرة بين الجنة والنار، فيقص لبعضهم من بعض، مظالم كانت بينهم في الدنيا، حتى إذا هذبوا ونقوا أذن لهم في دخول الجنة، فوالذي نفس محمد بيده لأحدهم أهدى بمنزله في الجنة منه بمنزله كان في الدنيا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"The believers, after being saved from the (Hell) Fire, will be stopped at a bridge between Paradise and Hell and mutual retaliation will be established among them regarding wrongs they have committed in the world against one another. After they are cleansed and purified (through the retaliation), they will be admitted into Paradise; and by Him in Whose Hand Muhammad's soul is, everyone of them will know his dwelling in Paradise better than he knew his dwelling in this world.\"",
      "chain": [
        "30140",
        "20304",
        "11168",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5065",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إبراهيم بن المستمر العروقي، قال حدثنا الصلت بن محمد، قال حدثنا غسان بن الأغر بن حصين النهشلي، قال حدثني عمي، زياد بن الحصين عن أبيه، قال لما قدم على النبي صلى الله عليه وسلم بالمدينة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ادن مني ‏\"‏ ‏.‏ فدنا منه فوضع يده على ذؤابته ثم أجرى يده وسمت عليه ودعا له ‏.‏",
      "text_en": " Ziyad bin Al-Husain narrated that his father said:                     \"When he came to the Prophet [SAW] in Al-Madinah, the Messenger of Allah [SAW] said to him: 'Come closer to me.' So he came closer to him, and he put his hand on his braid and wiped his head and prayed for him.\"",
      "chain": [
        "34023",
        "30140",
        "25232"
      ]
    }
  ],
  "total_hadiths": 16
}