{
  "id": "30146",
  "name": "'Abdul A'ala bin Hamad bin Nasr al-Bahli عبد الأعلى بن حماد بن نصر الباهلي النرسي",
  "full_name": "'Abdul A'ala bin Hamad bin Nasr al-Bahli عبد الأعلى بن حماد بن نصر الباهلي النرسي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "237",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  س  -  لا بأس به ]"
    ],
    "tags": [
      "al-Bahli",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20192",
      "name": "Da'ud bin 'Abdur Rahman al-'Atar داود بن عبد الرحمن العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "23034",
      "name": "'Abdul Jabbar bin al-Ward عبد الجبار بن الورد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30297",
      "name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "284",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا يزيد بن زريع، قال حدثنا سعيد، عن قتادة، أن أنس بن مالك، حدثهم أن نبي الله صلى الله عليه وسلم كان يطوف على نسائه في الليلة الواحدة، وله يومئذ تسع نسوة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to visit all his wives in one night and he had nine wives at that time.",
      "chain": [
        "30146",
        "20304",
        "11288",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم اتخذ حجرة  قال حسبت أنه قال  من حصير في رمضان فصلى فيها ليالي، فصلى بصلاته ناس من أصحابه، فلما علم بهم جعل يقعد، فخرج إليهم فقال ‏\"‏ قد عرفت الذي رأيت من صنيعكم، فصلوا أيها الناس في بيوتكم، فإن أفضل الصلاة صلاة المرء في بيته إلا المكتوبة ‏\"‏‏.‏ قال عفان حدثنا وهيب، حدثنا موسى، سمعت أبا النضر، عن بسر، عن زيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room in the month of Ramadan (Sa`id said, \"I think that Zaid bin Thabit said that it was made of a mat\") and he prayed there for a few nights, and so some of his companions prayed behind him. When he came to know about it, he kept on sitting. In the morning, he went out to them and said, \"I have seen and understood what you did. You should pray in your houses, for the best prayer of a person is that which he prays in his house except the compulsory prayers.\"",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "1095",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن نافع، قال وكان ابن عمر  رضى الله عنهما  يصلي على راحلته ويوتر عليها، ويخبر أن النبي صلى الله عليه وسلم كان يفعله‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said that the Prophet used to do so.",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1187",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا وهيب، عن أيوب، وعبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوا فى بيوتكم من صلاتكم ولا تتخذوها قبورا ‏\"‏‏.‏ تابعه عبد الوهاب عن أيوب‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Offer some of your prayers in your houses and do not make them graves.\"",
      "chain": [
        "30146",
        "20299",
        "11015",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2867",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه أن أهل، المدينة فزعوا مرة، فركب النبي صلى الله عليه وسلم فرسا لأبي طلحة كان يقطف  أو كان فيه قطاف  فلما رجع قال ‏\"‏ وجدنا فرسكم هذا بحرا ‏\"‏‏.‏ فكان بعد ذلك لا يجارى‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the people of Medina were frightened, so the Prophet rode a horse belonging to Abu Talha and it ran slowly, or was of narrow paces. When he returned, he said, \"I found your (i.e. Abu Talha's) horse very fast. After that the horse could not be surpassed in running..'",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3606",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، أن أنسا  رضى الله عنه  حدثهم أن رسول الله صلى الله عليه وسلم كان لا يرفع يديه في شىء من دعائه، إلا في الاستسقاء، فإنه كان يرفع يديه حتى يرى بياض إبطيه‏.‏   وقال أبو موسى دعا النبي صلى الله عليه وسلم ورفع يديه ورأيت بياض إبطيه",
      "text_en": " Narrated Anas:                     Allah's Apostle did not use to raise his hands in his invocations except in the Istisqa (i.e. invoking Allah for the rain) in which he used to raise his hands so high that one could see the whiteness of his armpits. (Note: It may be that Anas did not see the prophet (as) raising his hands but it has been narrated that the Prophet (as) used to raise his hands for invocations other than Istisqa. See Hadith No. 612 Vol. 5. and Hadith No. 807 & 808 Vol 2.)",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3926",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، حدثنا قتادة، أن عطاء، حدثهم عن جابر بن عبد الله الأنصاري  رضى الله عنهما  أن نبي الله صلى الله عليه وسلم صلى على النجاشي فصفنا وراءه فكنت في الصف الثاني أو الثالث‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     Allah's Apostle led the funeral prayer for the Negus and made us stand in rows behind him and I was in the second or third row.",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "34"
      ]
    },
    {
      "hadith_no": "4139",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  أن رعلا، وذكوان وعصية وبني لحيان استمدوا رسول الله صلى الله عليه وسلم على عدو، فأمدهم بسبعين من الأنصار، كنا نسميهم القراء في زمانهم، كانوا يحتطبون بالنهار ويصلون بالليل، حتى كانوا ببئر معونة قتلوهم، وغدروا بهم، فبلغ النبي صلى الله عليه وسلم، فقنت شهرا يدعو في الصبح على أحياء من أحياء العرب، على رعل وذكوان وعصية وبني لحيان‏.‏ قال أنس فقرأنا فيهم قرآنا ثم إن ذلك رفع بلغوا عنا قومنا، أنا لقينا ربنا، فرضي عنا وأرضانا‏.‏ وعن قتادة عن أنس بن مالك حدثه أن نبي الله صلى الله عليه وسلم قنت شهرا في صلاة الصبح يدعو على أحياء من أحياء العرب، على رعل وذكوان وعصية وبني لحيان‏.‏   زاد خليفة حدثنا ابن زريع، حدثنا سعيد، عن قتادة، حدثنا أنس، أن أولئك السبعين، من الأنصار قتلوا ببئر معونة، قرآنا كتابا‏.‏ نحوه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     (The tribes of) Ril, Dhakwan, 'Usaiya and Bani Lihyan asked Allah's Apostle to provide them with some men to support them against their enemy. He therefore provided them with seventy men from the Ansar whom we used to call Al-Qurra' in their lifetime. They used to collect wood by daytime and pray at night. When they were at the well of Ma'una, the infidels killed them by betraying them. When this news reached the Prophet , he said Al-Qunut for one month In the morning prayer, invoking evil upon some of the 'Arab tribes, upon Ril, Dhakwan, 'Usaiya and Bani Libyan. We used to read a verse of the Qur'an revealed in their connection, but later the verse was cancelled. It was: \"convey to our people on our behalf the information that we have met our Lord, and He is pleased with us, and has made us pleased.\" (Anas bin Malik added:) Allah's Prophet said Qunut for one month in the morning prayer, invoking evil upon some of the 'Arab tribes (namely), Ril, Dhakwan, Usaiya, and Bani Libyan. (Anas added:) Those seventy Ansari men were killed at the well of Mauna.",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4241",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، أن أنسا  رضى الله عنه  حدثهم أن ناسا من عكل وعرينة قدموا المدينة على النبي صلى الله عليه وسلم وتكلموا بالإسلام فقالوا يا نبي الله إنا كنا أهل ضرع، ولم نكن أهل ريف‏.‏ واستوخموا المدينة، فأمرهم رسول الله صلى الله عليه وسلم بذود وراع، وأمرهم أن يخرجوا فيه، فيشربوا من ألبانها وأبوالها، فانطلقوا حتى إذا كانوا ناحية الحرة كفروا بعد إسلامهم، وقتلوا راعي النبي صلى الله عليه وسلم، واستاقوا الذود، فبلغ النبي صلى الله عليه وسلم فبعث الطلب في آثارهم فأمر بهم فسمروا أعينهم، وقطعوا أيديهم، وتركوا في ناحية الحرة حتى ماتوا على حالهم‏.‏ قال قتادة بلغنا أن النبي صلى الله عليه وسلم بعد ذلك كان يحث على الصدقة، وينهى عن المثلة‏.‏ وقال شعبة وأبان وحماد عن قتادة من عرينة‏.‏ وقال يحيى بن أبي كثير وأيوب عن أبي قلابة عن أنس قدم نفر من عكل‏.‏",
      "text_en": " Narrated Anas:                     Some people of the tribe of `Ukl and `Uraina arrived at Medina to meet the Prophet and embraced Islam and said, \"O Allah's Prophet! We are the owners of milch livestock (i.e. bedouins) and not farmers (i.e. countrymen).\" They found the climate of Medina unsuitable for them. So Allah's Apostle ordered that they should be provided with some milch camels and a shepherd and ordered them to go out of Medina and to drink the camels' milk and urine (as medicine) So they set out and when they reached Al-Harra, they reverted to Heathenism after embracing Islam, and killed the shepherd of the Prophet and drove away the camels. When this news reached the Prophet, he sent some people in pursuit of them. (So they were caught and brought back to the Prophet ). The Prophet gave his orders in their concern. So their eyes were branded with pieces of iron and their hands and legs were cut off and they were left away in Harra till they died in that state of theirs. (See Hadith 234 Vol 1)",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5270",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، أن أنس بن مالك، حدثهم أن نبي الله صلى الله عليه وسلم كان يطوف على نسائه في الليلة الواحدة، وله يومئذ تسع نسوة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to pass by (have sexual relation with) all his wives in one night, and at that time he had nine wives.",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5336",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا وهيب، حدثنا أيوب، عن عكرمة، عن ابن عباس، قال ذاك مغيث عبد بني فلان  يعني زوج بريرة  كأني أنظر إليه يتبعها في سكك المدينة، يبكي عليها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That was Mughith, the slave of Bani so-and-so, i.e., Barira's husband as if I am now looking at him following her (Barira) along the streets of Medina.",
      "chain": [
        "30146",
        "20299",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5786",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، حدثنا قتادة، أن أنس بن مالك، حدثهم أن ناسا أو رجالا من عكل وعرينة قدموا على رسول الله صلى الله عليه وسلم وتكلموا بالإسلام وقالوا يا نبي الله إنا كنا أهل ضرع، ولم نكن أهل ريف، واستوخموا المدينة فأمر لهم رسول الله صلى الله عليه وسلم بذود وبراع وأمرهم، أن يخرجوا فيه فيشربوا من ألبانها وأبوالها، فانطلقوا حتى كانوا ناحية الحرة، كفروا بعد إسلامهم، وقتلوا راعي رسول الله صلى الله عليه وسلم واستاقوا الذود فبلغ النبي صلى الله عليه وسلم فبعث الطلب في آثارهم، وأمر بهم فسمروا أعينهم وقطعوا أيديهم وتركوا في ناحية الحرة حتى ماتوا على حالهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some people from the tribes of `Ukl and `Uraina came to Allah's Apostle and embraced Islam and said, \"O Allah's Apostle! We are owners of livestock and have never been farmers,\" and they found the climate of Medina unsuitable for them. So Allah's Apostle ordered that they be given some camels and a shepherd, and ordered them to go out with those camels and drink their milk and urine. So they set out, but when they reached a place called Al-Harra, they reverted to disbelief after their conversion to Islam, killed the shepherd and drove away the camels. When this news reached the Prophet he sent in their pursuit (and they were caught and brought). The Prophet ordered that their eyes be branded with heated iron bars and their hands be cut off, and they were left at Al-Harra till they died in that state.",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7521",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أبي العالية، عن ابن عباس، أن نبي الله صلى الله عليه وسلم كان يدعو بهن عند الكرب ‏\"‏ لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب العرش الكريم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle used to say at the time of difficulty, \"None has the right to be worshipped but Allah, the Majestic, the Most Forbearing. None has the right to be worshipped but Allah, the Lord of the Tremendous Throne. None has the right to be worshipped but Allah, the Lord of the Heavens and the Lord of the Honourable Throne. (See Hadith No. 357, Vol. 8)",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو نصر التمار، وعبد الأعلى بن حماد، قالا حدثنا حماد بن سلمة، عن داود بن أبي هند، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثل حديث يحيى بن محمد عن العلاء ذكر فيه ‏\"‏ وإن صام وصلى وزعم أنه مسلم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings of Allah be upon him) made observations like them embodied in the hadith narrated by Yahya b. Muhammad on the authority of 'Ala', and added to it:                      even if he observed fast and prayed and asserted that he was a Muslim.",
      "chain": [
        "20663",
        "30146",
        "20021",
        "11585",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "407",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثناه عبد الأعلى بن حماد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان بن عيينة، ح وحدثنيه حرملة بن يحيى، أخبرنا ابن وهب، قال حدثني يونس، ح وحدثنا حسن الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كلهم عن الزهري، بهذا الإسناد وفي رواية ابن عيينة ‏\"‏ إماما مقسطا وحكما عدلا ‏\"‏ ‏.‏ وفي رواية يونس ‏\"‏ حكما عادلا ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ إماما مقسطا ‏\"‏ ‏.‏ وفي حديث صالح ‏\"‏ حكما مقسطا ‏\"‏ كما قال الليث ‏.‏ وفي حديثه من الزيادة ‏\"‏ وحتى تكون السجدة الواحدة خيرا من الدنيا وما فيها ‏\"‏ ‏.‏ ثم يقول أبو هريرة اقرءوا إن شئتم ‏{‏ وإن من أهل الكتاب إلا ليؤمنن به قبل موته‏}‏ الآية ‏.‏",
      "text_en": " The same hadith is transmitted from Zuhri with the same chain of transmission. But in the tradition narrated by Ibn 'Uyaina the words are:                     \" impartial leader and just judge\" and in the tradition narrated by Yunus: the\" judge judging with justice\" and\" impartial leader\" are not mentioned. And in the hadith narrated by Salih like the one transmitted by Laith the words are:\" impartial judge\". And in the hadith transmitted by Ziyad the words are:\" Till one sajda is better than the worldand what it contains. Then Abu Huraira used to say,\" recite\" if you like: Not one of the People of the Book will fail to believe in him before his death.",
      "chain": [
        "30146",
        "20005",
        "20029",
        "20475",
        "130115",
        "30553",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "1409",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه عبد الأعلى بن حماد، حدثنا معتمر، قال سمعت معمرا، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been reported by Ma'mar with another chain of transmitters.",
      "chain": [
        "30146",
        "20288"
      ]
    },
    {
      "hadith_no": "2117",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثني عبد الأعلى بن حماد، ومحمد بن أبي بكر المقدمي، قالا حدثنا معتمر، حدثنا عبيد الله، عن ثابت البناني، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم يخطب يوم الجمعة فقام إليه الناس فصاحوا وقالوا يا نبي الله قحط المطر واحمر الشجر وهلكت البهائم ‏.‏ وساق الحديث وفيه من رواية عبد الأعلى فتقشعت عن المدينة ‏.‏ فجعلت",
      "text_en": " Anas b. Malik reported that while the Apostle of Allah (may peace be upon him) was delivering the sermon on Friday, people stood up before him and said in a loud voice:                      Apostle of Allah, there is a drought and the trees have become yellow, the animals have died; and the rest of the hadith is the same, and in the narration transmitted by 'Abd al-A'la the words are:\" The clouds cleard from Medina and it began to rain around it and not a single drop of rain fell in Medina. And as I looked towards Medina, I found it hollow like (the hollowness of) a basin.",
      "chain": [
        "30146",
        "30161",
        "20288",
        "11201",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3689",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا سعيد بن منصور، وزهير بن حرب، وعبد الأعلى بن حماد، وعمرو الناقد، قالوا حدثنا سفيان، عن الزهري، أما ابن منصور فقال عن سعيد، عن أبي هريرة، وأما، عبد الأعلى فقال عن أبي سلمة، أو عن سعيد، عن أبي هريرة، وقال، زهير عن سعيد، أو عن أبي سلمة، أحدهما أو كلاهما عن أبي هريرة، وقال، عمرو حدثنا سفيان، مرة عن الزهري، عن سعيد، وأبي، سلمة ومرة عن سعيد، أو أبي سلمة ومرة عن سعيد، عن أبي، هريرة عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث معمر ‏.‏",
      "text_en": " A hadith like this is narrated on the authority of Abu Huraira.",
      "chain": [
        "30116",
        "30022",
        "30146",
        "30263",
        "20005",
        "11168",
        "13",
        "11168",
        "13",
        "20321"
      ]
    },
    {
      "hadith_no": "5736",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا حماد بن سلمة، عن ثابت البناني، عن أنس، بن مالك قال ذهبت بعبد الله بن أبي طلحة الأنصاري إلى رسول الله صلى الله عليه وسلم حين ولد ورسول الله صلى الله عليه وسلم في عباءة يهنأ بعيرا له فقال ‏\"‏ هل معك تمر ‏\"‏ ‏.‏ فقلت نعم ‏.‏ فناولته تمرات فألقاهن في فيه فلاكهن ثم فغر فا الصبي فمجه في فيه فجعل الصبي يتلمظه فقال رسول الله صلى الله عليه وسلم ‏\"‏ حب الأنصار التمر ‏\"‏ ‏.‏ وسماه عبد الله ‏.‏",
      "text_en": " Anas b. Malik reported:                      I took 'Abdullah b. Abi Talha Ansari to Allah's Messenger (may peace be upon him) at the time of his birth. Allah's Messenger (may peace be upon him) was at that time wearing a woollen cloak and besmearing the camels with tar. He said: Have you got with you the dates? I said: Yes. He took hold of the dates and put them in his mouth and softened them, then opened the mouth of the infant and put that in it and the child began to lick it. Thereupon Allah's Messenger (may peace be upon him) said: The Ansar have a liking for the dates, and he (the Holy Prophet) gave him the name of 'Abdullah.",
      "chain": [
        "30146",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6469",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عبد الأعلى بن حماد، ومحمد بن عبد الأعلى القيسي، كلاهما عن المعتمر، - قال ابن حماد حدثنا معتمر بن سليمان، - قال سمعت أبي، حدثنا أبو عثمان، عن سلمان، قال لا تكونن إن استطعت أول من يدخل السوق ولا آخر من يخرج منها فإنها معركة الشيطان وبها ينصب رايته ‏.‏ قال وأنبئت أن جبريل عليه السلام أتى نبي الله صلى الله عليه وسلم وعنده أم سلمة - قال - فجعل يتحدث ثم قام فقال نبي الله صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏ ‏.‏ أو كما قال قالت هذا دحية - قال - فقالت أم سلمة ايم الله ما حسبته إلا إياه حتى سمعت خطبة نبي الله صلى الله عليه وسلم يخبر خبرنا أو كما قال قال فقلت لأبي عثمان ممن سمعت هذا قال من أسامة بن زيد ‏.‏",
      "text_en": " Salman reported:                      In case it lies in your power don't be one to enter the bazar first and the last to get out of that because there is a bustle and the standard of Satan is set there. He said: I was informed that Gabriel (Allah be pleased with him) came to Allah's Apostle (may peace be upon him) and there was with him Umin Salama and he began to talk with him. He then stood up, whereupon Allah's Apostle (may peace be upon him) said to Umm Salama: (Do you know) who was he and what did he say? She said: He was Dihya (Kalbi). He reported Umm Salama having said: By Allah, I did not deem him but only he (Dihya) until I heard the address of Allah's Apostle (may peace be upon him) informing him about us. He (the narrator) said: I said to Uthman: From whom did you hear it? He said: From Usima b. Zaid.",
      "chain": [
        "30146",
        "20288",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "6714",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبد الأعلى بن حماد، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا زار أخا له في قرية أخرى فأرصد الله له على مدرجته ملكا فلما أتى عليه قال أين تريد قال أريد أخا لي في هذه القرية ‏.‏ قال هل لك عليه من نعمة تربها قال لا غير أني أحببته في الله عز وجل ‏.‏ قال فإني رسول الله إليك بأن الله قد أحبك كما أحببته فيه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      A person visited his brother in another town and Allah deputed an Angel to wait for him on his way and when he came to him he said: Where do you intend to go? He said: I intend to go to my brother in this town. He said: Have you done any favour to him (the repayment of which you intend to get)? He said: No, excepting this that I love Mm for the sake of Allah, the Exalted and Glorious. Thereupon he said: I am a meesenger to you from, Allah: (to inform you) that Allah loves you as you love him (for His sake) This hadith has been narrated on the authority of Hammid b. Salama with the same of transmitters.",
      "chain": [
        "30146",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "6715",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "قال الشيخ أبو أحمد أخبرني أبو بكر، محمد بن زنجويه القشيري حدثنا عبد، الأعلى بن حماد حدثنا حماد بن سلمة، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30146",
        "20021"
      ]
    },
    {
      "hadith_no": "6809",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى، وعبد الأعلى بن حماد، قالا كلاهما قرأت على مالك عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس الشديد بالصرعة إنما الشديد الذي يملك نفسه عند الغضب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The strong-man is not one who wrestles well but the strong man is one who controls himself when he is in a fit of rage.",
      "chain": [
        "30399",
        "30146",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "6922",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني عبد الأعلى بن حماد، قال قرأت على مالك بن أنس ح وحدثنا قتيبة، بن سعيد عن مالك، فيما قرئ عليه عن زياد بن سعد، عن عمرو بن مسلم، عن طاوس، أنه قال أدركت ناسا من أصحاب رسول الله صلى الله عليه وسلم يقولون كل شىء بقدر ‏.‏ قال وسمعت عبد الله بن عمر يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ كل شىء بقدر حتى العجز والكيس أو الكيس والعجز ‏\"‏ ‏.‏",
      "text_en": " Tawus reported:                      I found some Companions of Allah's Messenger (may peace be upon him) as saying: Everything is by measure. And he further said: I heard Abdullah b. 'Umar as saying: There is a neasure for everything-even for incapacity and-capability.",
      "chain": [
        "30146",
        "30367",
        "11245",
        "10953",
        "11053"
      ]
    },
    {
      "hadith_no": "7162",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبد الأعلى بن حماد، حدثنا حماد بن سلمة، عن إسحاق بن عبد الله، بن أبي طلحة عن عبد الرحمن بن أبي عمرة، عن أبي هريرة، عن النبي صلى الله عليه وسلم فيما يحكي عن ربه عز وجل قال ‏\"‏ أذنب عبد ذنبا فقال اللهم اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى أذنب عبدي ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب ‏.‏ ثم عاد فأذنب فقال أى رب اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى عبدي أذنب ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب ‏.‏ ثم عاد فأذنب فقال أى رب اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى أذنب عبدي ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب واعمل ما شئت فقد غفرت لك ‏\"‏ ‏.‏ قال عبد الأعلى لا أدري أقال في الثالثة أو الرابعة ‏\"‏ اعمل ما شئت ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upon him) that his Lord, the Exalted and Glorious, thus said. A servant committed a sin and he said:                      O Allah, forgive me my sins, and Allah (the Exalted and Glorious) said: My servant commited a sin and then he came to realise that he has a Lord Who forgives the sins and takes to account (the sinner) for the sin. He then again committed a sin and said: My Lord, forgive me my sin, and Allah, the Exalted and High, said: My servant committed a sin and then came to realise that he has a Lord Who would forgive his sin or would take (him) to account for the sin. He again committed a sin and said: My Lord, forgive me for my sin, and Allah (the Exalted and High) said: My servant sas committed a sin and then came to realise that he has a Lord Who forgives the sins or takes (him) to account for sin. 0 servant, do what you like. I have granted you forgiveness. 'Abd al-A'la said: I do not know whether he said thrice or four times to do\" what you desire\". The hadlth has been narrated on the authority of 'Abd al-A'la b. Hammad with the same chain of transmitters.",
      "chain": [
        "30146",
        "20021",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "1471",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا عبد الجبار بن الورد، قال سمعت ابن أبي مليكة، يقول قال عبيد الله بن أبي يزيد مر بنا أبو لبابة فاتبعناه حتى دخل بيته فدخلنا عليه فإذا رجل رث البيت رث الهيئة فسمعته يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس منا من لم يتغن بالقرآن ‏\"‏ ‏.‏ قال فقلت لابن أبي مليكة يا أبا محمد أرأيت إذا لم يكن حسن الصوت قال يحسنه ما استطاع ‏.‏",
      "text_en": " Narrated AbuLubabah:                     Ubaydullah ibn Yazid said: AbuLubabah passed by us and we followed him till he entered his house, and we also entered it. There was a man in a rusty house and in shabby condition. I heard him say: I heard the Messenger of Allah (ﷺ) say: He is not one of us who does not chant the Qur'an. I (the narrator AbdulJabbar) said to Ibn AbuMulaykah: AbuMuhammad, what do you think if a person does not have pleasant voice? He said: He should recite with pleasant voice as much as possible.",
      "chain": [
        "30146",
        "23034",
        "11090"
      ]
    },
    {
      "hadith_no": "1754",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا سفيان بن عيينة، عن الزهري، عن عروة، عن المسور بن مخرمة، ومروان، أنهما قالا خرج رسول الله صلى الله عليه وسلم عام الحديبية فلما كان بذي الحليفة قلد الهدى وأشعره وأحرم ‏.‏",
      "text_en": " Al-Miswar bin Makhramah and al-Marwan said the Messenger of Allah (SWAS) proceeded in the year of al-Hudaibiyyah (to Makkah).  When he reached Dhu al-Hulaifah, he tied (garlanded) something in the neck of the sacrificial camel (which He took along with him), and made incision in its hump and put on Ihram.",
      "chain": [
        "30146",
        "20005",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "1991",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا داود بن عبد الرحمن، عن هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم اعتمر عمرتين عمرة في ذي القعدة وعمرة في شوال ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) performed two umrahs: one umrah in Dhul-Qa'dah, and the other in Shawwal.",
      "chain": [
        "30146",
        "20192",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1995",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا داود بن عبد الرحمن، حدثني عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن بن أبي بكر، عن أبيها، أن رسول الله صلى الله عليه وسلم قال لعبد الرحمن ‏\"‏ يا عبد الرحمن أردف أختك عائشة فأعمرها من التنعيم فإذا هبطت بها من الأكمة فلتحرم فإنها عمرة متقبلة ‏\"‏ ‏.‏",
      "text_en": " Hafsah, daughter of AbdurRahman ibn AbuBakr, reported on the authority of her father:                      The Messenger of Allah (ﷺ) said to AbdurRahman: AbdurRahman, put your sister Aisha on the back of the camel behind you and make her perform umrah from at-Tan'im. When you come down from the hillock (in at-Tan'im), she must wear (ihram for umrah), for this is an umrah accepted (by Allah).",
      "chain": [
        "30146",
        "20192",
        "10644",
        "11264",
        "10521",
        "107"
      ]
    },
    {
      "hadith_no": "2350",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سمع أحدكم النداء والإناء على يده فلا يضعه حتى يقضي حاجته منه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When any of you hears the summons to prayer while he has a vessel in his hand, he should not lay it down till he fulfils his need.",
      "chain": [
        "30146",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4726",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الأعلى بن حماد، ومحمد بن المثنى، ومحمد بن بشار، وأحمد بن سعيد الرباطي، قالوا حدثنا وهب بن جرير، - قال أحمد كتبناه من نسخته وهذا لفظه - قال حدثنا أبي قال سمعت محمد بن إسحاق يحدث عن يعقوب بن عتبة عن جبير بن محمد بن جبير بن مطعم عن أبيه عن جده قال أتى رسول الله صلى الله عليه وسلم أعرابي فقال يا رسول الله جهدت الأنفس وضاعت العيال ونهكت الأموال وهلكت الأنعام فاستسق الله لنا فإنا نستشفع بك على الله ونستشفع بالله عليك ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ ويحك أتدري ما تقول ‏\"‏ وسبح رسول الله صلى الله عليه وسلم فما زال يسبح حتى عرف ذلك في وجوه أصحابه ثم قال ‏\"‏ ويحك إنه لا يستشفع بالله على أحد من خلقه شأن الله أعظم من ذلك ويحك أتدري ما الله إن عرشه على سمواته لهكذا ‏\"‏ ‏.‏ وقال بأصابعه مثل القبة عليه ‏\"‏ وإنه ليئط به أطيط الرحل بالراكب ‏\"‏ ‏.‏ قال ابن بشار في حديثه ‏\"‏ إن الله فوق عرشه وعرشه فوق سمواته ‏\"‏ ‏.‏ وساق الحديث وقال عبد الأعلى وابن المثنى وابن بشار عن يعقوب بن عتبة وجبير بن محمد بن جبير عن أبيه عن جده قال أبو داود والحديث بإسناد أحمد بن سعيد هو الصحيح وافقه عليه جماعة منهم يحيى بن معين وعلي بن المديني ورواه جماعة عن ابن إسحاق كما قال أحمد أيضا وكان سماع عبد الأعلى وابن المثنى وابن بشار من نسخة واحدة فيما بلغني ‏.‏",
      "text_en": " Muhammad b. Jubair b. Mut’im said from his father on the authority of his grandfather:                      An A’rab(a nomadic Arab) came to the Messenger of Allah(ﷺ) and said: People suffering distress, the children are hungry, the crops are withered, and the animals are perished, so ask Allah to grant us rain, for we seek you as our intercessor with Allah, and Allah as intercessor with you. The Messenger of Allah(ﷺ) said: Woe to you: Do you know what you are saying? Then the Messenger of Allah(ﷺ) declared Allah’s glory and he continued declaring His glory till the effect of that was apparent in the faces of his Companions. He then said: Woe to you: Allah is not to be sought as intercessor with anyone. Allah’s state is greater than that. Woe to you! Do you know how great Allah is? His throne is above the heavens thus(indicating with his fingers like a dome over him), and it groans on account of Him as a saddle does because of the rider.Ibn Bashshar said in his version: Allah is above the throne, and the throne is above the heavens. He then mentioned the rest of the tradition. ‘Abd al-A’la, Ibn al- Muthana and Ibn Bashshar transmitted it from Ya’qub b. ‘Utbah and Jubair b. Muhammad b. Jubair from his father on the authority of his grandfather.Abu Dawud said: This tradition with the chain of Ahmad b. Sa’ad is sound. It has been approved by the body (of traditionists) , which includes Yahya b. Ma’in and ‘Ali b. al-Madani, and a group has transmitted it from Ibn Ishaq, as Ahmad also said. And so far as I have been informed ‘Abd al-A’la, Ibn al-Muthanna, and Ibn Bashshar had heard from the same copy(of the collection of tradition).",
      "chain": [
        "30146",
        "30170",
        "30160",
        "30295",
        "20298",
        "11272",
        "11107",
        "19192",
        "18118"
      ]
    },
    {
      "hadith_no": "4897",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا سفيان، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبي هريرة، أن رجلا، كان يسب أبا بكر وساق نحوه ‏.‏ قال أبو داود وكذلك رواه صفوان بن عيسى عن ابن عجلان، كما قال سفيان ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Hurairah through a different chain of narrators. This version has:                      A man was reviling Abu Bakr. He then mentioned the rest of the tradition in a similar manner.Abu Dawud said: Similarly, it has been transmitted by Safwan b. ‘Isa, from Ibn ‘Affan, as Sufyan said.",
      "chain": [
        "30146",
        "20012",
        "10616",
        "11168",
        "13",
        "20553"
      ]
    },
    {
      "hadith_no": "5405",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبد الأعلى بن حماد، قال حدثنا بشر بن السري، قال حدثنا عبد الله بن المبارك، عن معمر، ح وأنبأنا أحمد بن علي بن سعيد، قال حدثنا يحيى بن معين، قال حدثنا هشام بن يوسف، وعبد الرزاق، عن معمر، عن الزهري، عن سالم، عن أبيه، قال بعث النبي صلى الله عليه وسلم خالد بن الوليد إلى بني جذيمة فدعاهم إلى الإسلام فلم يحسنوا أن يقولوا أسلمنا فجعلوا يقولون صبأنا وجعل خالد قتلا وأسرا - قال - فدفع إلى كل رجل أسيره حتى إذا أصبح يومنا أمر خالد بن الوليد أن يقتل كل رجل منا أسيره ‏.‏ قال ابن عمر فقلت والله لا أقتل أسيري ولا يقتل أحد - وقال بشر - من أصحابي أسيره - قال - فقدمنا على النبي صلى الله عليه وسلم فذكر له صنع خالد فقال النبي صلى الله عليه وسلم ورفع يديه ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ قال زكريا في حديثه فذكر وفي حديث بشر فقال ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"The Prophet [SAW] sent Khalid bin Al-Walid to Banu Jadhimah. He called them to Islam, but they could not say Aslamna (we submitted, i.e., became Muslim) so they started to say Saba'na (we changed our religion). Khalid started killing and taking prisoners, and he gave a prisoner to each man. The next day Khalid bin Al-Walid issued orders that each man among us kill his prisoner.\" Ibn 'Umar said: \"I said: 'By Allah, I will not kill my prisoner, and no one (among my companions) will kill his prisoner.' We came to the Prophet [SAW], and he was told of what Khalid had done. The Prophet [SAW] said: 'I disavow what Khalid has done,' twice.\"",
      "chain": [
        "30146",
        "20190",
        "20025",
        "20115",
        "28001",
        "30020",
        "20467",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5676",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبد الأعلى بن حماد، قال حدثنا معتمر بن سليمان، قال حدثني عبد الرزاق، عن معمر، عن الزهري، عن سعيد بن المسيب، قال غرب عمر رضى الله عنه ربيعة بن أمية في الخمر إلى خيبر فلحق بهرقل فتنصر فقال عمر رضي الله عنه لا أغرب بعده مسلما ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"'Umar, may Allah be pleased with him, banished Rabi'ah bin Umaiyah to Khaibar for drinking Khamr, and he went and joined Heraclius and became a Christian. 'Umar, may Allah be pleased with him, said: 'I will never expel any Muslim after this.'\"",
      "chain": [
        "30146",
        "20288",
        "20121",
        "20115",
        "11013",
        "11002"
      ]
    }
  ],
  "total_hadiths": 34
}