{
  "id": "30143",
  "name": "'Abdullah bin 'Abdul Wahab al-Hajabi عبد الله بن عبد الوهاب الحجبي",
  "full_name": "'Abdullah bin 'Abdul Wahab al-Hajabi عبد الله بن عبد الوهاب الحجبي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "228",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]"
    ],
    "tags": [
      "al-Hajabi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "32250",
      "name": "'Ali bin 'Abdul 'Aziz al-Baghvi علي بن عبد العزيز البغوي",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "105",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، ذكر النبي صلى الله عليه وسلم قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال وأعراضكم  عليكم حرام كحرمة يومكم هذا في شهركم هذا، ألا ليبلغ الشاهد منكم الغائب ‏\"‏‏.‏ وكان محمد يقول صدق رسول الله صلى الله عليه وسلم كان ذلك ‏\"‏ ألا هل بلغت ‏\"‏ مرتين‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said. No doubt your blood, property, the sub-narrator Muhammad thought that Abu Bakra had also mentioned and your honor (chastity), are sacred to one another as is the sanctity of this day of yours in this month of yours. It is incumbent on those who are present to inform those who are absent.\" (Muhammad the Sub-narrator used to say, \"Allah's Apostle told the truth.\") The Prophet repeated twice: \"No doubt! Haven't I conveyed Allah's message to you.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد بن زيد، عن أيوب، عن حفصة  قال أبو عبد الله أو هشام بن حسان عن حفصة، عن أم عطية  قالت كنا ننهى أن نحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا، ولا نكتحل ولا نتطيب ولا نلبس ثوبا مصبوغا إلا ثوب عصب، وقد رخص لنا عند الطهر إذا اغتسلت إحدانا من محيضها في نبذة من كست أظفار، وكنا ننهى عن اتباع الجنائز‏.‏ قال رواه هشام بن حسان عن حفصة عن أم عطية عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Um-`Atiya:                     We were forbidden to mourn for a dead person for more than three days except in the case of a husband for whom mourning was allowed for four months and ten days. (During that time) we were not allowed to put kohl (Antimony eye power) in our eyes or to use perfumes or to put on colored clothes except a dress made of `Asr (a kind of Yemen cloth, very coarse and rough). We were allowed very light perfumes at the time of taking a bath after menses and also we were forbidden to go with the funeral procession .",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11039",
        "11311",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "668",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد بن زيد، قال حدثنا عبد الحميد، صاحب الزيادي قال سمعت عبد الله بن الحارث، قال خطبنا ابن عباس في يوم ذي ردغ، فأمر المؤذن لما بلغ حى على الصلاة‏.‏ قال قل الصلاة في الرحال، فنظر بعضهم إلى بعض، فكأنهم أنكروا فقال كأنكم أنكرتم هذا إن هذا فعله من هو خير مني  يعني النبي صلى الله عليه وسلم  إنها عزمة، وإني كرهت أن أحرجكم‏.‏ وعن حماد عن عاصم عن عبد الله بن الحارث عن ابن عباس نحوه، غير أنه قال كرهت أن أؤثمكم، فتجيئون تدوسون الطين إلى ركبكم‏.‏",
      "text_en": " Narrated `Abdullah bin Al-Harith:                     Ibn `Abbas addressed us on a (rainy and) muddy day and when the Mu'adh-dhin said, \"Come for the prayer\" Ibn `Abbas ordered him to say, \"Pray in your homes.\" The people began to look at one another with surprise as if they did not like it. Ibn `Abbas said, \"It seems that you thought ill of it but no doubt it was done by one who was better than I (i.e. the Prophet). It (the prayer) is a strict order and I disliked to bring you out.\" Ibn `Abbas narrated the same as above but he said, \"I did not like you to make you sinful (in refraining from coming to the mosque) and to come (to the mosque) covered with mud up to the knees.\"",
      "chain": [
        "30143",
        "20022",
        "11703",
        "912"
      ]
    },
    {
      "hadith_no": "974",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن أم عطية، قالت أمرنا أن نخرج، العواتق وذوات الخدور‏.‏ وعن أيوب عن حفصة بنحوه‏.‏ وزاد في حديث حفصة قال أو قالت العواتق وذوات الخدور، ويعتزلن الحيض المصلى‏.‏",
      "text_en": " Narrated Muhammad:                     Um 'Atiyya said: \"Our Prophet ordered us to come out (on `Id day) with the mature girls and the virgins staying in seclusion.\" Hafsa narrated the above mentioned Hadith and added, \"The mature girls or virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "71",
        "11015"
      ]
    },
    {
      "hadith_no": "1306",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، حدثنا أيوب، عن محمد، عن أم عطية  رضى الله عنها  قالت أخذ علينا النبي صلى الله عليه وسلم عند البيعة أن لا ننوح، فما وفت منا امرأة غير خمس نسوة أم سليم وأم العلاء وابنة أبي سبرة امرأة معاذ وامرأتين أو ابنة أبي سبرة وامرأة معاذ وامرأة أخرى‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     At the time of giving the pledge of allegiance to the Prophet one of the conditions was that we would not wail, but it was not fulfilled except by five women and they are Um Sulaim, Um Al-`Ala', the daughter of Abi Sabra (the wife of Mu`adh), and two other women; or the daughter of Abi Sabra and the wife of Mu`adh and another woman.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "1605",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حاتم، عن هشام، عن عروة، دخل النبي صلى الله عليه وسلم عام الفتح من كداء من أعلى مكة‏.‏ وكان عروة أكثر ما يدخل من كداء وكان أقربهما إلى منزله‏.‏",
      "text_en": " Narrated Hisham:                     `Urwa said, \"The Prophet entered Mecca in the year of the conquest of Mecca from the side of Kada' which is at the higher part of Mecca.\" `Urwa often entered from Kada' which was nearer of the two to his dwelling place.",
      "chain": [
        "30143",
        "20159",
        "11065"
      ]
    },
    {
      "hadith_no": "1619",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا سفيان، حدثنا واصل الأحدب، عن أبي وائل، قال جئت إلى شيبة‏.‏ وحدثنا قبيصة، حدثنا سفيان، عن واصل، عن أبي وائل، قال جلست مع شيبة على الكرسي في الكعبة فقال لقد جلس هذا المجلس عمر  رضى الله عنه  فقال لقد هممت أن لا أدع فيها صفراء ولا بيضاء إلا قسمته‏.‏ قلت إن صاحبيك لم يفعلا‏.‏ قال هما المرآن أقتدي بهما‏.‏",
      "text_en": " Narrated Abu Wail:                     (One day) I sat along with Shaiba on the chair inside the Ka`ba. He (Shaiba) said, \"No doubt, `Umar sat at this place and said, 'I intended not to leave any yellow (i.e. gold) or white (i.e. silver) (inside the Ka`ba) undistributed.' I said (to `Umar), 'But your two companions (i.e. The Prophet and Abu Bakr) did not do so.' `Umar said, They are the two persons whom I always follow.' \"",
      "chain": [
        "30143",
        "20226",
        "20012",
        "11401",
        "11353",
        "20351",
        "20012",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، قال سئل عبيد الله عن المحصب، فحدثنا عبيد الله، عن نافع،، قال نزل بها رسول الله صلى الله عليه وسلم وعمر وابن عمر‏.‏ وعن نافع أن ابن عمر  رضى الله عنهما  كان يصلي بها  يعني المحصب  الظهر والعصر  أحسبه قال والمغرب‏.‏ قال خالد لا أشك في العشاء، ويهجع هجعة، ويذكر ذلك عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Khalid bin Al-Harith:                     'Ubaidullah was asked about Al Mahassab. 'Ubaidullah narrated: Nafi` said, 'Allah's Apostles, `Umar and Ibn `Umar camped there.\" Nafi` added, \"Ibn `Umar used to offer the Zuhr and `Asr prayers at it (i.e. Al-Mahassab).\" I think he mentioned the Maghrib prayer also. I said, \"I don't doubt about `Isha' (i.e. he used to offer it there also), and he used to sleep there for a while. He used to say, 'The Prophet used to do the same.' \"",
      "chain": [
        "30143",
        "20226",
        "11014"
      ]
    },
    {
      "hadith_no": "2190",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال سمعت مالكا، وسأله، عبيد الله بن الربيع أحدثك داود عن أبي سفيان، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم رخص في بيع العرايا في خمسة أوسق أو دون خمسة أوسق قال نعم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet allowed the sale of the dates of 'Araya provided they were about five Awsuq (singular: Wasaq which means sixty Sa's) or less (in amount).",
      "chain": [
        "30143",
        "20001",
        "116",
        "13"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا يزيد بن زريع، أخبرنا عوف، عن سعيد بن أبي الحسن، قال كنت عند ابن عباس  رضى الله عنهما  إذ أتاه رجل فقال يا أبا عباس إني إنسان، إنما معيشتي من صنعة يدي، وإني أصنع هذه التصاوير‏.‏ فقال ابن عباس لا أحدثك إلا ما سمعت رسول الله صلى الله عليه وسلم يقول سمعته يقول ‏\"‏ من صور صورة فإن الله معذبه، حتى ينفخ فيها الروح، وليس بنافخ فيها أبدا ‏\"‏‏.‏ فربا الرجل ربوة شديدة واصفر وجهه‏.‏ فقال ويحك إن أبيت إلا أن تصنع، فعليك بهذا الشجر، كل شىء ليس فيه روح‏.‏ قال أبو عبد الله سمع سعيد بن أبي عروبة من النضر بن أنس هذا الواحد‏.‏",
      "text_en": " Narrated Sa`id bin Abu Al-Hasan:                     While I was with Ibn `Abbas a man came and said, \"O father of `Abbas! My sustenance is from my manual profession and I make these pictures.\" Ibn `Abbas said, \"I will tell you only what I heard from Allah's Apostle . I heard him saying, 'Whoever makes a picture will be punished by Allah till he puts life in it, and he will never be able to put life in it.' \" Hearing this, that man heaved a sigh and his face turned pale. Ibn `Abbas said to him, \"What a pity! If you insist on making pictures I advise you to make pictures of trees and any other unanimated objects.\"",
      "chain": [
        "30143",
        "20304",
        "11298",
        "11287"
      ]
    },
    {
      "hadith_no": "2617",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك  رضى الله عنه  أن يهودية، أتت النبي صلى الله عليه وسلم بشاة مسمومة، فأكل منها فجيء بها فقيل ألا نقتلها‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jewess brought a poisoned (cooked) sheep for the Prophet who ate from it. She was brought to the Prophet and he was asked, \"Shall we kill her?\" He said, \"No.\" I continued to see the effect of the poison on the palate of the mouth of Allah's Apostle .",
      "chain": [
        "30143",
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "2845",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا ابن عون، عن موسى بن أنس، قال وذكر يوم اليمامة قال أتى أنس ثابت بن قيس وقد حسر عن فخذيه وهو يتحنط فقال يا عم ما يحبسك أن لا تجيء قال الآن يا ابن أخي‏.‏ وجعل يتحنط، يعني من الحنوط، ثم جاء فجلس، فذكر في الحديث انكشافا من الناس، فقال هكذا عن وجوهنا حتى نضارب القوم، ما هكذا كنا نفعل مع رسول الله صلى الله عليه وسلم، بئس ما عودتم أقرانكم‏.‏ رواه حماد عن ثابت عن أنس‏.‏",
      "text_en": " Narrated Ibn `Aun:                     Once Musa bin Anas while describing the battle of Yamama, said, \"Anas bin Malik went to Thabit bin Qais, who had lifted his clothes from his thighs and was applying Hunut to his body. Anas asked, 'O Uncle! What is holding you back (from the battle)?' He replied, 'O my nephew! I am coming just now,' and went on perfuming himself with Hunut, then he came and sat (in the row). Anas then mentioned that the people fled from the battle-field. On that Thabit said, 'Clear the way for me to fight the enemy. We would never do so (i.e. flee) in the company of Allah's Apostle. How bad the habits you have acquired from your enemies!\"",
      "chain": [
        "30143",
        "20226",
        "11071",
        "14383"
      ]
    },
    {
      "hadith_no": "3127",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن أيوب، عن عبد الله بن أبي مليكة، أن النبي صلى الله عليه وسلم أهديت له أقبية من ديباج مزررة بالذهب، فقسمها في ناس من أصحابه، وعزل منها واحدا لمخرمة بن نوفل، فجاء ومعه ابنه المسور بن مخرمة، فقام على الباب فقال ادعه لي‏.‏ فسمع النبي صلى الله عليه وسلم صوته فأخذ قباء فتلقاه به واستقبله بأزراره فقال ‏\"‏ يا أبا المسور، خبأت هذا لك، يا أبا المسور، خبأت هذا لك ‏\"‏‏.‏ وكان في خلقه شدة‏.‏ ورواه ابن علية عن أيوب‏.‏ قال حاتم بن وردان حدثنا أيوب عن ابن أبي مليكة عن المسور قدمت على النبي صلى الله عليه وسلم أقبية‏.‏ تابعه الليث عن ابن أبي مليكة‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Mulaika:                     Some silken cloaks with golden buttons were presented to the Prophet. He distributed them amongst his companions and kept one for Makhrama, bin Naufal. Later on Makhrama came along with his son Al-Miswar bin Makhrama, and stood up at the gate and said (to his son). \"Call him (i.e. the Prophet) to me.\" The Prophet heard his voice, took a silken cloak and brought it to him, placing those golden buttons in front of him saying, \"O Abu-al-Miswar! I have kept this aside for you! O Abu-al Miswar! I have kept this aside for you!\" Makhrama was a bad-tempered man.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11090"
      ]
    },
    {
      "hadith_no": "3133",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد، حدثنا أيوب، عن أبي قلابة، قال وحدثني القاسم بن عاصم الكليبي  وأنا لحديث القاسم، أحفظ  عن زهدم، قال كنا عند أبي موسى، فأتي ذكر دجاجة وعنده رجل من بني تيم الله أحمر كأنه من الموالي، فدعاه للطعام فقال إني رأيته يأكل شيئا، فقذرته، فحلفت لا آكل‏.‏ فقال هلم فلأحدثكم عن ذاك، إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ وأتي رسول الله صلى الله عليه وسلم بنهب إبل، فسأل عنا فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، فلما انطلقنا قلنا ما صنعنا لا يبارك لنا، فرجعنا إليه فقلنا إنا سألناك أن تحملنا، فحلفت أن لا تحملنا أفنسيت قال ‏\"‏ لست أنا حملتكم، ولكن الله حملكم، وإني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     Once we were in the house of Abu Musa who presented a meal containing cooked chicken. A man from the tribe of Bani Taim Allah with red complexion as if he were from the Byzantine war prisoners, was present. Abu Musa invited him to share the meal but he (apologised) saying. \"I saw chickens eating dirty things and so I have had a strong aversion to eating them, and have taken an oath that I will not eat chickens.\" Abu Musa said, \"Come along, I will tell you about this matter (i.e. how to cancel one's oat ). I went to the Prophet in the company of a group of Al-Ashariyin, asked him to provide us with means of conveyance. He said, 'By Allah, I will not provide you with any means of conveyance and I have nothing to make you ride on.' Then some camels as booty were brought to Allah's Apostle and he asked for us saying. 'Where are the group of Al-Ash`ariyun?' Then he ordered that we should be given five camels with white humps. When we set out we said, 'What have we done? We will never be blessed (with what we have been given).' So, we returned to the Prophet and said, 'We asked you to provide us with means of conveyance, but you took an oath that you would not provide us with any means of conveyance. Did you forget (your oath when you gave us the camels)? He replied. 'I have not provided you with means of conveyance, but Allah has provided you with it, and by Allah, Allah willing, if ever I take an oath to do something, and later on I find that it is more beneficial to do something different, I will do the thing which is better, and give expiation for my oath.\"",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11047",
        "11589"
      ]
    },
    {
      "hadith_no": "3760",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "أخبرني عبد الله بن عبد الوهاب، حدثنا خالد، حدثنا شعبة، عن واقد، قال سمعت أبي يحدث، عن ابن عمر، عن أبي بكر  رضى الله عنهم  قال ارقبوا محمدا صلى الله عليه وسلم في أهل بيته‏.‏",
      "text_en": " Abu Bakr:                      Look at      Muhammad through his family (i.e. if you are no good to his family you     are not good to him).",
      "chain": [
        "30143",
        "20423",
        "20020",
        "19124",
        "18",
        "2"
      ]
    },
    {
      "hadith_no": "3821",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد، حدثنا هشام، عن أبيه،، قال كان الناس يتحرون بهداياهم يوم عائشة قالت عائشة فاجتمع صواحبي إلى أم سلمة، فقلن يا أم سلمة، والله إن الناس يتحرون بهداياهم يوم عائشة، وإنا نريد الخير كما تريده عائشة، فمري رسول الله صلى الله عليه وسلم أن يأمر الناس أن يهدوا إليه حيث ما كان أو حيث ما دار، قالت فذكرت ذلك أم سلمة للنبي صلى الله عليه وسلم قالت فأعرض عني، فلما عاد إلى ذكرت له ذاك فأعرض عني، فلما كان في الثالثة ذكرت له فقال ‏\"‏ يا أم سلمة لا تؤذيني في عائشة، فإنه والله ما نزل على الوحى وأنا في لحاف امرأة منكن غيرها ‏\"‏‏.‏",
      "text_en": " Narrated Hisham's father:                     The people used to send presents to the Prophet on the day of `Aisha's turn. `Aisha said, \"My companions (i.e. the other wives of the Prophet) gathered in the house of Um Salama and said, \"0 Um Salama! By Allah, the people choose to send presents on the day of `Aisha's turn and we too, love the good (i.e. presents etc.) as `Aisha does. You should tell Allah's Apostle to tell the people to send their presents to him wherever he may be, or wherever his turn may be.\" Um Salama said that to the Prophet and he turned away from her, and when the Prophet returned to her (i.e. Um Salama), she repeated the same, and the Prophet again turned away, and when she told him the same for the third time, the Prophet said, \"O Um Salama! Don't trouble me by harming `Aisha, for by Allah, the Divine Inspiration never came to me while I was under the blanket of any woman amongst you except her.\"",
      "chain": [
        "30143",
        "20022",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "3916",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن عبد الوهاب، حدثنا بشر بن المفضل، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك  رضى الله عنه أن أهل، مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية، فأراهم القمر شقتين، حتى رأوا حراء بينهما‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The people of Mecca asked Allah's Apostle to show them a miracle. So he showed them the moon split in two halves between which they saw the Hira' mountain.",
      "chain": [
        "30143",
        "20212",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4248",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن أنس بن مالك  رضى الله عنه أن رسول الله صلى الله عليه وسلم جاءه جاء فقال أكلت الحمر‏.‏ فسكت، ثم أتاه الثانية فقال أكلت الحمر‏.‏ فسكت، ثم الثالثة فقال أفنيت الحمر‏.‏ فأمر مناديا فنادى في الناس إن الله ورسوله ينهيانكم عن لحوم الحمر الأهلية‏.‏ فأكفئت القدور، وإنها لتفور باللحم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Someone came to Allah's Apostles and said, \"The donkeys have been eaten (by the Muslims).\" The Prophet kept quiet. Then the man came again and said, \"The donkeys have been eaten.\" The Prophet kept quiet. The man came to him the third time and said, \"The donkeys have been consumed.\" On that the Prophet ordered an announcer to announce to the people, \"Allah and His Apostle forbid you to eat the meat of donkeys.\" Then the cooking pots were upset while the meat was still boiling in them.",
      "chain": [
        "30143",
        "20259",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "4708",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض، السنة اثنا عشر شهرا منها، أربعة حرم، ثلاث متواليات، ذو القعدة وذو الحجة والمحرم ورجب مضر الذي بين جمادى وشعبان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     The Prophet said, \"Time has come back to its original state which it had when Allah created the Heavens and the Earth; the year is twelve months, four of which are sacred. Three of them are in succession; Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and (the fourth being) Rajab Mudar (named after the tribe of Mudar as they used to respect this month) which stands between Jumad (ath-thani) and Sha'ban.\"",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "4947",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد العزيز، أخبرني ثور، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ لناله رجال من هؤلاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said. Then some men from these people would attain it.\"",
      "chain": [
        "30143",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "5395",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن أيوب، عن حفصة، عن أم عطية، قالت كنا ننهى أن نحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا، ولا نكتحل، ولا نطيب، ولا نلبس ثوبا مصبوغا، إلا ثوب عصب، وقد رخص لنا عند الطهر إذا اغتسلت إحدانا من محيضها في نبذة من كست أظفار، وكنا ننهى عن اتباع الجنائز‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     We were forbidden to mourn for more than three days for a dead person, except for a husband, for whom a wife should mourn for four months and ten days (while in the mourning period) we were not allowed to put kohl in our eyes, nor perfume our-selves, nor wear dyed clothes, except a garment of 'Asb (special clothes made in Yemen). But it was permissible for us that when one of us became clean from her menses and took a bath, she could use a piece of a certain kind of incense. And it was forbidden for us to follow funeral processions.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "5459",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد، حدثنا أيوب، عن محمد، عن ابن عباس  رضى الله عنهما  قال تعرق رسول الله صلى الله عليه وسلم كتفا، ثم قام فصلى، ولم يتوضأ‏.‏",
      "text_en": "      Narrated Ibn 'Abbas:                          The Prophet ate of the meat of a shoulder (by cutting the meat with      his teeth), and then got up and offered the prayer without performing      the ablution anew.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "17"
      ]
    },
    {
      "hadith_no": "5837",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن سليمان، قال سمعت ذكوان، يحدث عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من تردى من جبل فقتل نفسه، فهو في نار جهنم، يتردى فيه خالدا مخلدا فيها أبدا، ومن تحسى سما فقتل نفسه، فسمه في يده، يتحساه في نار جهنم خالدا مخلدا فيها أبدا، ومن قتل نفسه بحديدة، فحديدته في يده، يجأ بها في بطنه في نار جهنم خالدا مخلدا فيها أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever purposely throws himself from a mountain and kills himself, will be in the (Hell) Fire falling down into it and abiding therein perpetually forever; and whoever drinks poison and kills himself with it, he will be carrying his poison in his hand and drinking it in the (Hell) Fire wherein he will abide eternally forever; and whoever kills himself with an iron weapon, will be carrying that weapon in his hand and stabbing his `Abdomen with it in the (Hell) Fire wherein he will abide eternally forever.\"",
      "chain": [
        "30143",
        "20226",
        "20020",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6072",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثني عبد العزيز بن أبي حازم، قال حدثني أبي قال، سمعت سهل بن سعد، عن النبي صلى الله عليه وسلم قال ‏\"‏ أنا وكافل اليتيم، في الجنة هكذا ‏\"‏‏.‏ وقال بإصبعيه السبابة والوسطى‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"I and the person who looks after an orphan and provides for him, will be in Paradise like this,\" putting his index and middle fingers together.",
      "chain": [
        "30143",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6094",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن ثابت، عن أنس بن مالك، أن أعرابيا، بال في المسجد، فقاموا إليه، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزرموه ‏\"‏‏.‏ ثم دعا بدلو من ماء فصب عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A bedouin urinated in the mosque and the people ran to (beat) him. Allah's Apostle said, \"Do not interrupt his urination (i.e. let him finish).\" Then the Prophet asked for a tumbler of water and poured the water over the place of urine.",
      "chain": [
        "30143",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6200",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، أخبرنا ابن علية، أخبرنا أيوب، عن عبد الله بن أبي مليكة، أن النبي صلى الله عليه وسلم أهديت له أقبية من ديباج مزررة بالذهب، فقسمها في ناس من أصحابه وعزل منها واحدا لمخرمة، فلما جاء قال ‏\"‏ خبأت هذا لك ‏\"‏‏.‏ قال أيوب بثوبه أنه يريه إياه، وكان في خلقه شىء‏.‏ رواه حماد بن زيد عن أيوب وقال حاتم بن وردان حدثنا أيوب، عن ابن أبي مليكة، عن المسور، قدمت على النبي صلى الله عليه وسلم أقبية‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Mulaika:                     The Prophet was given a gift of a few silken cloaks with gold buttons. He distributed them amongst some of his companions and put aside one of them for Makhrama. When Makhrama came, the Prophet said, \"I kept this for you.\" (Aiyub, the sub-narrator held his garment to show how the Prophet showed the cloak to Makhrama who had something unfavorable about his temper.)",
      "chain": [
        "30143",
        "20208",
        "11015",
        "11090"
      ]
    },
    {
      "hadith_no": "6236",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن واقد بن محمد بن زيد، سمعت أبي، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ويلكم  أو ويحكم قال شعبة شك هو  لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏ وقال النضر عن شعبة ويحكم‏.‏ وقال عمر بن محمد عن أبيه ويلكم أو ويحكم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Wailakum\" (woe to you) or \"waihakum\" (May Allah be merciful to you).\" Shu`ba is not sure as to which was the right word. \"Do not become disbelievers after me by cutting the necks of one another.\"",
      "chain": [
        "30143",
        "20226",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "6865",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا سفيان، حدثنا أبو حصين، سمعت عمير بن سعيد النخعي، قال سمعت علي بن أبي طالب  رضى الله عنه  قال ما كنت لأقيم حدا على أحد فيموت، فأجد في نفسي، إلا صاحب الخمر، فإنه لو مات وديته، وذلك أن رسول الله صلى الله عليه وسلم لم يسنه‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     I would not feel sorry for one who dies because of receiving a legal punishment, except the drunk, for if he should die (when being punished), I would give blood money to his family because no fixed punishment has been ordered by Allah's Apostle for the drunk.",
      "chain": [
        "30143",
        "20226",
        "20012",
        "11371",
        "11646",
        "5"
      ]
    },
    {
      "hadith_no": "7170",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد، عن رجل، لم يسمه عن الحسن، قال خرجت بسلاحي ليالي الفتنة فاستقبلني أبو بكرة فقال أين تريد قلت أريد نصرة ابن عم رسول الله صلى الله عليه وسلم‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا تواجه المسلمان بسيفيهما فكلاهما من أهل النار ‏\"‏‏.‏ قيل فهذا القاتل، فما بال المقتول قال ‏\"‏ إنه أراد قتل صاحبه ‏\"‏‏.‏ قال حماد بن زيد فذكرت هذا الحديث لأيوب ويونس بن عبيد وأنا أريد أن يحدثاني به فقالا إنما روى هذا الحديث الحسن عن الأحنف بن قيس عن أبي بكرة‏.‏ حدثنا سليمان حدثنا حماد بهذا‏.‏",
      "text_en": " Narrated Al-Hasan:                     (Al-Ahnaf said:) I went out carrying my arms during the nights of the affliction (i.e. the war between `Ali and `Aisha) and Abu Bakra met me and asked, \"Where are you going?\" I replied, \"I intend to help the cousin of Allah's Apostle (i.e.,`Ali).\" Abu Bakra said, \"Allah's Apostle said, 'If two Muslims take out their swords to fight each other, then both of them will be from amongst the people of the Hell- Fire.' It was said to the Prophet, 'It is alright for the killer but what about the killed one?' He replied, 'The killed one had the intention to kill his opponent.'\" (See Hadith No. 30, Vol. 1)",
      "chain": [
        "30143",
        "20022",
        "11016"
      ]
    },
    {
      "hadith_no": "7650",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، والقاسم التميمي، عن زهدم، قال كان بين هذا الحى من جرم وبين الأشعريين ود وإخاء، فكنا عند أبي موسى الأشعري فقرب إليه الطعام فيه لحم دجاج، وعنده رجل من بني تيم الله كأنه من الموالي، فدعاه إليه فقال إني رأيته يأكل شيئا فقذرته، فحلفت لا آكله‏.‏ فقال هلم فلأحدثك عن ذاك، إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين نستحمله قال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم ‏\"‏‏.‏ فأتي النبي صلى الله عليه وسلم بنهب إبل فسأل عنا فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، ثم انطلقنا قلنا ما صنعنا حلف رسول الله صلى الله عليه وسلم لا يحملنا، وما عنده ما يحملنا، ثم حملنا، تغفلنا رسول الله صلى الله عليه وسلم يمينه، والله لا نفلح أبدا، فرجعنا إليه فقلنا له فقال ‏\"‏ لست أنا أحملكم، ولكن الله حملكم، إني والله لا أحلف على يمين فأرى غيرها خيرا منها، إلا أتيت الذي هو خير منه، وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     There were good relations and brotherhood between this tribe of Jurm and the Ash`ariyyin. Once, while we were sitting with Abu Musa Al-Ash`ari, there was brought to him a meal which contained chicken meat, and there was sitting beside him, a man from the tribe of Bani Taimul-lah who looked like one of the Mawali. Abu Musa invited the man to eat but the man said, \"I have seen chicken eating some dirty things, and I have taken an oath not to eat chicken.\" Abu Musa said to him, \"Come along, let me tell you something in this regard. Once I went to the Prophet with a few men from Ash`ariyyin and we asked him for mounts. The Prophet said, By Allah, I will not mount you on anything; besides I do not have anything to mount you on.' Then a few camels from the war booty were brought to the Prophet, and he asked about us, saying, 'Where are the group of Ash`ariyyin?' So he ordered for five fat camels to be given to us and then we set out. We said, 'What have we done? Allah's Apostle took an oath that he would not give us anything to ride and that he had nothing for us to ride, yet he provided us with mounts. We made Allah's Apostle forget his oath! By Allah, we will never be successful.' So we returned to him and reminded him of his oath. He said, 'I have not provided you with the mount, but Allah has done so. By Allah, I may take an oath to do something, but on finding something else which is better, I do that which is better and make the expiation for my oath.' \"",
      "chain": [
        "30143",
        "20259",
        "11015",
        "11047",
        "11719",
        "11589"
      ]
    }
  ],
  "total_hadiths": 30
}