{
  "id": "30148",
  "name": "Abd al-Qdws bin Muhammad عبد القدوس بن محمد بن عبد الكبير",
  "full_name": "Abd al-Qdws bin Muhammad عبد القدوس بن محمد بن عبد الكبير",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-6912",
      "hadith_no": "6912",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثني عبد القدوس بن محمد، حدثني عمرو بن عاصم الكلابي، حدثنا همام بن يحيى، حدثنا إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كنت عند النبي صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله إني أصبت حدا فأقمه على‏.‏ قال ولم يسأله عنه‏.‏ قال وحضرت الصلاة فصلى مع النبي صلى الله عليه وسلم فلما قضى النبي صلى الله عليه وسلم الصلاة قام إليه الرجل فقال يا رسول الله إني أصبت حدا، فأقم في كتاب الله‏.‏ قال ‏\"‏ أليس قد صليت معنا ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فإن الله قد غفر لك ذنبك ‏\"‏‏.‏ أو قال ‏\"‏ حدك ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While I was with the Prophet a man came and said, \"O Allah's Apostle! I have committed a legally punishable sin; please inflict the legal punishment on me'.' The Prophet did not ask him what he had done. Then the time for the prayer became due and the man offered prayer along with the Prophet , and when the Prophet had finished his prayer, the man again got up and said, \"O Allah's Apostle! I have committed a legally punishable sin; please inflict the punishment on me according to Allah's Laws.\" The Prophet said, \"Haven't you prayed with us?' He said, \"Yes.\" The Prophet said, \"Allah has forgiven your sin.\" or said, \"....your legally punishable sin.\"",
      "usc_msa_ref": "812",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2187",
      "hadith_no": "2187",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن الحسن، عن عمران بن حصين، قال نهينا عن الكى، ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود، وعقبة بن عامر، وابن، عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11019",
        "11016",
        "123",
        "16",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2189",
      "hadith_no": "2189",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا عمرو بن عاصم، حدثنا همام، وجرير بن حازم، قالا حدثنا قتادة، عن أنس، قال كان رسول الله صلى الله عليه وسلم يحتجم في الأخدعين والكاهل وكان يحتجم لسبع عشرة وتسع عشرة وإحدى وعشرين ‏.‏ قال أبو عيسى وفي الباب عن ابن عباس ومعقل بن يسار ‏.‏ وهذا حديث حسن غريب ‏.‏",
      "text_en": " Anas narrated:                     \"The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.\"",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-192",
      "hadith_no": "192",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا حجاج، حدثنا حماد، عن ثابت البناني، عن عبد الرحمن بن أبي ليلى، عن صهيب، قال تلا رسول الله  صلى الله عليه وسلم  هذه الآية ‏{للذين أحسنوا الحسنى وزيادة}‏ وقال ‏\"‏ إذا دخل أهل الجنة الجنة وأهل النار النار نادى مناد يا أهل الجنة إن لكم عند الله موعدا يريد أن ينجزكموه ‏.‏ فيقولون وما هو ألم يثقل الله موازيننا ويبيض وجوهنا ويدخلنا الجنة وينجنا من النار قال فيكشف الحجاب فينظرون إليه فوالله ما أعطاهم الله شيئا أحب إليهم من النظر إليه ولا أقر لأعينهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Suhaib said:                     \"The Messenger of Allah recited this Verse: 'For those who have done good is the best reward and even more.' Then he said: 'When the people of Paradise enter Paradise, and the people of the Fire enter the Fire, a caller will cry out: \"O people of Paradise! You have a covenant with Allah and He wants to fulfill it.\" They will say: \"What is it?\" Has Allah not made the Balance (of our good deeds) heavy, and made our faces bright, and admitted us to Paradise and saved us from Hell?\" Then the Veil will be lifted and they will look upon Him, and by Allah, Allah will not give them anything that is more beloved to them or delightful, than looking upon Him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20219",
        "20022",
        "11269",
        "11196",
        "182"
      ]
    },
    {
      "id": "sunan-ibn-majah-1375",
      "hadith_no": "1375",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا نائل بن نجيح، حدثنا إسماعيل بن زياد، عن ابن جريج، عن عطاء، عن ابن عباس، أن النبي  صلى الله عليه وسلم  نهى أن يلبس السلاح في بلاد الإسلام في العيدين إلا أن يكونوا بحضرة العدو ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) forbadewearingweapons in the Muslim lands on the two ‘Eid, except if theenemywas present.",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "24455",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1578",
      "hadith_no": "1578",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا داود بن شبيب الباهلي، حدثنا إبراهيم بن عثمان، حدثنا الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال لما مات إبراهيم ابن رسول الله  صلى الله عليه وسلم  صلى عليه رسول الله  صلى الله عليه وسلم  وقال ‏\"‏ إن له مرضعا في الجنة ولو عاش لكان صديقا نبيا ‏.‏ ولو عاش لعتقت أخواله القبط وما استرق قبطي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “Then Ibrahim the son of theMessenger of Allah (ﷺ) died, the Messenger of Allah (ﷺ) prayedandsaid: ‘He has a wet-nurse in Paradise, and if he had lived hewouldhave been a Siddiq and a Prophet. If he had lived his maternaluncles,the Egyptians, would have been set free and no Egyptian wouldeverhave been enslaved.’”",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20228",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3683",
      "hadith_no": "3683",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا بشر بن عمر، حدثنا ابن لهيعة، حدثنا أبو الأسود، عن عاصم بن عمر بن قتادة، عن علي بن الحسين، عن عائشة، قالت ما رأيت رسول الله  صلى الله عليه وسلم  يسب أحدا ولا يطوى له ثوب ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I never saw the Messenger ofAllah(ﷺ) insulting anyone, and no garment was ever folded up forhim.”*",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20211",
        "20624",
        "11114",
        "11103",
        "11045",
        "53"
      ]
    }
  ],
  "total_hadiths": 7
}