{
  "id": "30145",
  "name": "'Abdullah bin Muhammad bin Abi al-Aswad عبد الله بن محمد بن أبي الأسود",
  "full_name": "'Abdullah bin Muhammad bin Abi al-Aswad عبد الله بن محمد بن أبي الأسود",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "163",
      "date_gregorian": "NA",
      "date_display": [
        "163 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "223",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      " Hamadan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  د  ت  -  ثقة حافظ ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Basri",
      "Judge",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20273",
      "name": "Quraysh bin Anas al-Ansari قريش بن أنس الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20269",
      "name": "al-Fadl bin al-'Ala' Abu al-'Abbas الفضل بن العلاء أبو العباس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20221",
      "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "798",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، قال حدثنا إسماعيل، عن خالد الحذاء، عن أبي قلابة، عن أنس  رضى الله عنه  قال كان القنوت في المغرب والفجر‏.‏",
      "text_en": " Narrated Anas:                     The qunut [supplication before going down for prostration] used to be recited in the Maghrib and the Fajr prayers.",
      "chain": [
        "30145",
        "30103",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1659",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا أبو ضمرة، حدثنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال استأذن العباس بن عبد المطلب  رضى الله عنه  رسول الله صلى الله عليه وسلم أن يبيت بمكة ليالي منى من أجل سقايته، فأذن له‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Al `Abbas bin `Abdul-Muttalib asked the permission of Allah's Apostle to let him stay in Mecca during the nights of Mina in order to provide the pilgrims with water to drink, so the Prophet permitted him.",
      "chain": [
        "30145",
        "20157",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2022",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا عبد الواحد، حدثنا عاصم، عن أبي مجلز، وعكرمة، قال ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هي في العشر، هي في تسع يمضين أو في سبع يبقين ‏\"‏‏.‏ يعني ليلة القدر‏.‏ قال عبد الوهاب عن أيوب‏.‏ وعن خالد عن عكرمة عن ابن عباس التمسوا في أربع وعشرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"The Night of Qadr is in the last ten nights of the month (Ramadan), either on the first nine or in the last (remaining) seven nights (of Ramadan).\" Ibn `Abbas added, \"Search for it on the twenty-fourth (of Ramadan).",
      "chain": [
        "30145",
        "20256",
        "11080",
        "11313",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا يزيد بن زريع، وحميد بن الأسود، عن حبيب بن الشهيد، عن ابن أبي مليكة، قال ابن الزبير لابن جعفر  رضى الله عنهم أتذكر إذ تلقينا رسول الله صلى الله عليه وسلم أنا وأنت وابن عباس قال نعم، فحملنا وتركك‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     Ibn Az-Zubair said to Ibn Ja`far \"Do you remember when I, you and Ibn `Abbas went out to receive Allah's Apostle?\" Ibn Ja`far replied in the affirmative. Ibn Az-Zubair added, \"And Allah's Apostle made us (i.e. I and Ibn `Abbas) ride along with him and left you.\"",
      "chain": [
        "30145",
        "20304",
        "20225",
        "11275",
        "11090"
      ]
    },
    {
      "hadith_no": "3128",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، قال سمعت أنس بن مالك  رضى الله عنه  يقول كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     People used to give some of their datepalms to the Prophet (as a gift), till he conquered Bani Quraiza and Bani An-Nadir, whereupon he started returning their favors.",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3683",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا يحيى، عن إسماعيل، حدثنا قيس، سمعت المغيرة بن شعبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال ناس من أمتي ظاهرين حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"Some of my followers will remain victorious (and on the right path) till the Last Day comes, and they will still be victorious.\"",
      "chain": [
        "30145",
        "20031",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، سمعت أنس بن مالك  رضى الله عنه قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some people used to allot some date palm trees to the Prophet as gift till he conquered Banu Quraiza and Bani An-Nadir, where upon he started returning their date palms to them.",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، قال سمعت السائب بن يزيد، قال صحبت عبد الرحمن بن عوف وطلحة بن عبيد الله والمقداد وسعدا رضى الله عنهم فما سمعت أحدا منهم يحدث عن النبي صلى الله عليه وسلم، إلا أني سمعت طلحة يحدث عن يوم أحد",
      "text_en": " Narrated As-Saib bin Yazid:                     I have been in the company of `AbdurRahman bin `Auf, Talha bin 'Ubaidullah, Al-Miqdad and Sa`d, and I heard none of them narrating anything from the Prophet excepting the fact that I heard Talha narrating about the day of Uhud (battle) .",
      "chain": [
        "30145",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "4170",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا ابن أبي الأسود، حدثنا معتمر، وحدثني خليفة، حدثنا معتمر، قال سمعت أبي، عن أنس  رضى الله عنه  قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله الذين كانوا أعطوه أو بعضه‏.‏ وكان النبي صلى الله عليه وسلم قد أعطاه أم أيمن، فجاءت أم أيمن فجعلت الثوب في عنقي تقول كلا والذي لا إله إلا هو لا يعطيكهم وقد أعطانيها، أو كما قالت، والنبي صلى الله عليه وسلم يقول ‏\"‏ لك كذا ‏\"‏‏.‏ وتقول كلا والله‏.‏ حتى أعطاها، حسبت أنه قال ‏\"‏ عشرة أمثاله ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Anas:                     Some (of the Ansar) used to present date palm trees to the Prophet till Banu Quraiza and Banu An- Nadir were conquered (then he returned to the people their date palms). My people ordered me to ask the Prophet to return some or all the date palms they had given to him, but the Prophet had given those trees to Um Aiman. On that, Um Aiman came and put the garment around my neck and said, \"No, by Him except Whom none has the right to be worshipped, he will not return those trees to you as he (i.e. the Prophet ) has given them to me.\" The Prophet go said (to her), \"Return those trees and I will give you so much (instead of them).\" But she kept on refusing, saying, \"No, by Allah,\" till he gave her ten times the number of her date palms.",
      "chain": [
        "30145",
        "20288",
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4578",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن أبي الأسود، حدثنا حميد بن الأسود، ويزيد بن زريع، قالا حدثنا حبيب بن الشهيد، عن ابن أبي مليكة، قال قال ابن الزبير قلت لعثمان هذه الآية التي في البقرة ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ إلى قوله ‏{‏غير إخراج‏}‏ قد نسختها الأخرى، فلم تكتبها قال تدعها‏.‏ يا ابن أخي لا أغير شيئا منه من مكانه‏.‏ قال حميد أو نحو هذا‏.‏",
      "text_en": " Narrated Ibn Az-Zubair:                     I said to `Uthman, \"This Verse which is in Surat-al-Baqara: \"Those of you who die and leave widows behind...without turning them out.\" has been abrogated by another Verse. Why then do you write it (in the Qur'an)?\" `Uthman said. \"Leave it (where it is), O the son of my brother, for I will not shift anything of it (i.e. the Qur'an) from its original position.\"",
      "chain": [
        "30145",
        "20225",
        "20304",
        "11275",
        "11090",
        "106"
      ]
    },
    {
      "hadith_no": "4897",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حرمي، حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى في النار وتقول هل من مزيد‏.‏ حتى يضع قدمه فتقول قط قط ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The people will be thrown into the (Hell) Fire and it will say: \"Are there any more (to come)?' (50.30) till Allah puts His Foot over it and it will say, 'Qati! Qati! (Enough Enough!)'\"",
      "chain": [
        "30145",
        "20221",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4927",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا عبد العزيز بن عبد الصمد العمي، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ جنتان من فضة، آنيتهما وما فيهما وجنتان من ذهب آنيتهما وما فيهما، وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبر على وجهه في جنة عدن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Qais:                     Allah's Apostle said, \"Two gardens, the utensils and the contents of which are of silver, and two other gardens, the utensils and contents of which are of gold. And nothing will prevent the people who will be in the Garden of Eden from seeing their Lord except the curtain of Majesty over His Face.\"",
      "chain": [
        "30145",
        "20251",
        "11296"
      ]
    },
    {
      "hadith_no": "5470",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معاذ، حدثني أبي، عن يونس، عن قتادة، عن أنس بن مالك، قال ما أكل النبي صلى الله عليه وسلم على خوان، ولا في سكرجة، ولا خبز له مرقق‏.‏ قلت لقتادة على ما يأكلون قال على السفر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet never took his meals at a dining table, nor in small plates, and he never ate thin wellbaked bread. (The sub-narrator asked Qatada, \"Over what did they use to take their meals?\" Qatada said, \"On leather dining sheets.\"",
      "chain": [
        "30145",
        "32",
        "20475",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5517",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا شقيق، حدثنا أبو مسعود الأنصاري، قال كان رجل من الأنصار يكنى أبا شعيب، وكان له غلام لحام، فأتى النبي صلى الله عليه وسلم وهو في أصحابه، فعرف الجوع في وجه النبي صلى الله عليه وسلم فذهب إلى غلامه اللحام فقال اصنع لي طعاما يكفي خمسة، لعلي أدعو النبي صلى الله عليه وسلم خامس خمسة‏.‏ فصنع له طعيما، ثم أتاه فدعاه، فتبعهم رجل فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا شعيب إن رجلا تبعنا فإن شئت أذنت له، وإن شئت تركته ‏\"‏‏.‏ قال لا بل أذنت له‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     There was an Ansari man nicknamed, Abu Shu'aib, who had a slave who was a butcher. He came to the Prophet while he was sitting with his companions and noticed the signs of hunger on the face of the Prophet . So he went to his butcher slave and said, \"Prepare for me a meal sufficient for five persons so that I may invite the Prophet along with four other men.\" He had the meal prepared for him and invited him. A (sixth) man followed them. The Prophet said, \"O Abu Shu'aib! Another man has followed us. If you wish, you may invite him; and if you wish, you may refuse him.\" Abu Shu'aib said, \"No, I will admit him.\"",
      "chain": [
        "30145",
        "20318",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "5530",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثني عبد الله بن أبي الأسود، حدثنا قريش بن أنس، عن حبيب بن الشهيد، قال أمرني ابن سيرين أن أسأل الحسن، ممن سمع حديث العقيقة، فسألته فقال من سمرة بن جندب‏.‏",
      "text_en": " Narrated Habib bin Ash-Shahid:                     Ibn Seereen told me to ask Al-Hassan from whom he had heard the narration of 'Aqiqa. I asked him and he said, \"From Samura bin Jundab.\"",
      "chain": [
        "30145",
        "20273",
        "11275"
      ]
    },
    {
      "hadith_no": "5873",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني عبد الله بن أبي الأسود، حدثنا معاذ، قال حدثني أبي، عن قتادة، عن أنس بن مالك، رضى الله عنه  قال كان أحب الثياب إلى النبي صلى الله عليه وسلم أن يلبسها الحبرة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The most beloved garment to the Prophet to wear was the Hibra (a kind of Yemenese cloth).",
      "chain": [
        "30145",
        "32",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6418",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حرمي، حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  قال قالت أمي يا رسول الله خادمك أنس ادع الله له‏.‏ قال ‏\"‏ اللهم أكثر ماله وولده، وبارك له فيما أعطيته ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     My mother said, \"O Allah's Apostle! Please invoke Allah on behalf of your servant.\" He said, \"O Allah! Increase his wealth and children, and bestow Your Blessing on whatever You give him.\" a time of distress.",
      "chain": [
        "30145",
        "20221",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7460",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وحدثني عبد الله بن أبي الأسود، حدثنا الفضل بن العلاء، حدثنا إسماعيل بن أمية، عن يحيى بن عبد الله بن محمد بن صيفي، أنه سمع أبا معبد، مولى ابن عباس يقول سمعت ابن عباس، يقول لما بعث النبي صلى الله عليه وسلم معاذا نحو اليمن قال له ‏\"‏ إنك تقدم على قوم من أهل الكتاب فليكن أول ما تدعوهم إلى أن يوحدوا الله تعالى فإذا عرفوا ذلك فأخبرهم أن الله فرض عليهم خمس صلوات في يومهم وليلتهم، فإذا صلوا فأخبرهم أن الله افترض عليهم زكاة في أموالهم تؤخذ من غنيهم فترد على فقيرهم، فإذا أقروا بذلك فخذ منهم وتوق كرائم أموال الناس ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet sent Mu`adh to Yemen, he said to him, \"You are going to a nation from the people of the Scripture, so let the first thing to which you will invite them, be the Tauhid of Allah. If they learn that, tell them that Allah has enjoined on them, five prayers to be offered in one day and one night. And if they pray, tell them that Allah has enjoined on them Zakat of their properties and it is to be taken from the rich among them and given to the poor. And if they agree to that, then take from them Zakat but avoid the best property of the people.\"",
      "chain": [
        "30145",
        "20269",
        "11417",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "7473",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا ابن أبي الأسود، حدثنا حرمي، حدثنا شعبة، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى في النار ‏\"‏‏.‏ وقال لي خليفة حدثنا يزيد بن زريع حدثنا سعيد عن قتادة عن أنس‏.‏ وعن معتمر سمعت أبي عن قتادة عن أنس عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال يلقى فيها وتقول هل من مزيد‏.‏ حتى يضع فيها رب العالمين قدمه فينزوي بعضها إلى بعض، ثم تقول قد قد بعزتك وكرمك‏.‏ ولا تزال الجنة تفضل حتى ينشئ الله لها خلقا فيسكنهم فضل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"(The people will be thrown into Hell ( Fire) and it will keep on saying, 'Is there any more?' till the Lord of the worlds puts His Foot over it, whereupon its different sides will come close to each other, and it will say, 'Qad! Qad! (enough! enough!) By Your 'Izzat (Honor and Power) and YOUR KARAM (Generosity)!' Paradise will remain spacious enough to accommodate more people until Allah will create some more people and let them dwell in the superfluous space of Paradise. \"",
      "chain": [
        "30145",
        "20221",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7600",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، سمعت أبي، حدثنا قتادة، عن عقبة بن عبد الغافر، عن أبي سعيد، عن النبي صلى الله عليه وسلم ‏\"‏ أنه ذكر رجلا فيمن سلف  أو فيمن كان قبلكم قال كلمة يعني  أعطاه الله مالا وولدا  فلما حضرت الوفاة قال لبنيه أى أب كنت لكم قالوا خير أب‏.‏ قال فإنه لم يبتئر  أو لم يبتئز  عند الله خيرا، وإن يقدر الله عليه يعذبه، فانظروا إذا مت فأحرقوني حتى إذا صرت فحما فاسحقوني  أو قال فاسحكوني  فإذا كان يوم ريح عاصف فأذروني فيها ‏\"‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ فأخذ مواثيقهم على ذلك وربي، ففعلوا ثم أذروه في يوم عاصف، فقال الله عز وجل كن‏.‏ فإذا هو رجل قائم‏.‏ قال الله أى عبدي ما حملك على أن فعلت ما فعلت قال مخافتك أو فرق منك قال فما تلافاه أن رحمه عندها  وقال مرة أخرى فما تلافاه غيرها  ‏\"‏‏.‏ فحدثت به أبا عثمان فقال سمعت هذا من سلمان غير أنه زاد فيه أذروني في البحر‏.‏ أو كما حدث‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet mentioned a man from the people of the past or those who preceded you. The Prophet said a sentence meaning: Allah had given him wealth and children. When his death approached, he said to his sons, \"What kind of father have I been to you?\" They replied, \"You have been a good father.\" He told them that he had not presented any good deed before Allah, and if Allah should get hold of him He would punish him.' \"So look!\" he added, \"When I die, burn me, and when I turn into coal, crush me, and when there comes a windy day, scatter my ashes in the wind.\" The Prophet added, \"Then by Allah, he took a firm promise from his children to do so, and they did so. (They burnt him after his death) and threw his ashes on a windy day. Then Allah commanded to his ashes. \"Be,\" and behold! He became a man standing! Allah said, \"O My slave! What made you do what you did?\" He replied, \"For fear of You.\" Nothing saved him then but Allah's Mercy (So Allah forgave him).",
      "chain": [
        "30145",
        "20288",
        "11289",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "1300",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي الأسود، حدثني أبو مطرف، محمد بن أبي الوزير حدثنا محمد بن موسى الفطري، عن سعد بن إسحاق بن كعب بن عجرة، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم أتى مسجد بني عبد الأشهل فصلى فيه المغرب فلما قضوا صلاتهم رآهم يسبحون بعدها فقال ‏\"‏ هذه صلاة البيوت ‏\"‏ ‏.‏",
      "text_en": " Narrated Ka'b ibn Ujrah:                     The Prophet (ﷺ) came to the mosque of Banu AbdulAshhal. He prayed the sunset prayer there. When they finished the prayer, he saw them praying the supererogatory prayer after it. He said: This is the prayer to be offered in the houses.",
      "chain": [
        "30145",
        "20516",
        "19805"
      ]
    }
  ],
  "total_hadiths": 21
}