{
  "id": "30156",
  "name": "'Imran bin Mysrh عمران بن ميسرة",
  "full_name": "'Imran bin Mysrh عمران بن ميسرة",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "223",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "80",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عمران بن ميسرة، قال حدثنا عبد الوارث، عن أبي التياح، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أشراط الساعة أن يرفع العلم، ويثبت الجهل، ويشرب الخمر، ويظهر الزنا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"From among the portents of the Hour are (the following): -1. Religious knowledge will be taken away (by the death of Religious learned men). -2. (Religious) ignorance will prevail. -3. Drinking of Alcoholic drinks (will be very common). -4. There will be prevalence of open illegal sexual intercourse.",
      "chain": [
        "30156",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "595",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عمران بن ميسرة، قال حدثنا محمد بن فضيل، قال حدثنا حصين، عن عبد الله بن أبي قتادة، عن أبيه، قال سرنا مع النبي صلى الله عليه وسلم ليلة فقال بعض القوم لو عرست بنا يا رسول الله‏.‏ قال ‏\"‏ أخاف أن تناموا عن الصلاة ‏\"‏‏.‏ قال بلال أنا أوقظكم‏.‏ فاضطجعوا وأسند بلال ظهره إلى راحلته، فغلبته عيناه فنام، فاستيقظ النبي صلى الله عليه وسلم وقد طلع حاجب الشمس فقال ‏\"‏ يا بلال أين ما قلت ‏\"‏‏.‏ قال ما ألقيت على نومة مثلها قط‏.‏ قال ‏\"‏ إن الله قبض أرواحكم حين شاء، وردها عليكم حين شاء، يا بلال قم فأذن بالناس بالصلاة ‏\"‏‏.‏ فتوضأ فلما ارتفعت الشمس وابياضت قام فصلى‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"One night we were traveling with the Prophet and some people said, 'We wish that Allah's Apostle would take a rest along with us during the last hours of the night.' He said, 'I am afraid that you will sleep and miss the (Fajr) prayer.' Bilal said, 'I will make you get up.' So all slept and Bilal rested his back against his Rahila and he too was overwhelmed (by sleep) and slept. The Prophet got up when the edge of the sun had risen and said, 'O Bilal! What about your statement?' He replied, 'I have never slept such a sleep.' The Prophet said, 'Allah captured your souls when He wished, and released them when He wished. O Bilal! Get up and pronounce the Adhan for the prayer.' The Prophet performed ablution and when the sun came up and became bright, he stood up and prayed.\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "603",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا خالد الحذاء، عن أبي قلابة، عن أنس، قال ذكروا النار والناقوس، فذكروا اليهود والنصارى، فأمر بلال أن يشفع الأذان وأن يوتر الإقامة‏.‏",
      "text_en": " Narrated Anas:                     The people mentioned the fire and the bell (they suggested those as signals to indicate the starting of prayers), and by that they mentioned the Jews and the Christians. Then Bilal was ordered to pronounce Adhan for the prayer by saying its wordings twice, and for the Iqama (the call for the actual standing for the prayers in rows) by saying its wordings once. (Iqama is pronounced when the people are ready for the prayer).",
      "chain": [
        "30156",
        "20258",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1332",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا حسين، عن ابن بريدة، حدثنا سمرة بن جندب  رضى الله عنه  قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     I offered the funeral prayer behind the Prophet for a woman who had died during childbirth and he stood up by the middle of the coffin.",
      "chain": [
        "30156",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "2182",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عباد بن العوام، أخبرنا يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن الفضة بالفضة والذهب بالذهب، إلا سواء بسواء، وأمرنا أن نبتاع الذهب بالفضة كيف شئنا، والفضة بالذهب كيف شئنا‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakra:                     that his father said, \"The Prophet forbade the selling of gold for gold and silver for silver except if they are equivalent in weight, and allowed us to sell gold for silver and vice versa as we wished.\"",
      "chain": [
        "30156",
        "20431",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2491",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق شقصا له من عبد  أو شركا أو قال نصيبا  وكان له ما يبلغ ثمنه بقيمة العدل، فهو عتيق، وإلا فقد عتق منه ما عتق ‏\"‏‏.‏ قال لا أدري قوله عتق منه ما عتق‏.‏ قول من نافع أو في الحديث عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"Allah's Apostle said, 'If one manumits his share of a jointly possessed slave, and can afford the price of the other shares according to the adequate price of the slave, the slave will be completely manumitted; otherwise he will be partially manumitted.' \" (Aiyub, a sub-narrator is not sure whether the saying \" ... otherwise he will be partially manumitted\" was said by Nafi` or the Prophet.)",
      "chain": [
        "30156",
        "20258",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3457",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا خالد، عن أبي قلابة، عن أنس  رضى الله عنه  قال ذكروا النار والناقوس، فذكروا اليهود والنصارى، فأمر بلال أن يشفع الأذان وأن يوتر الإقامة‏.‏",
      "text_en": " Narrated Anas:                     The people mentioned the fire and the bell (as means proposed for announcing the time of prayer) and by such a suggestion they referred to the Jews and the Christians. But Bilal was ordered, \"Pronounce the words of the Adhan (i.e. call for the prayer) twice and the Iqama once only.\"",
      "chain": [
        "30156",
        "20258",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4312",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمران بن ميسرة، حدثنا محمد بن فضيل، عن حصين، عن عامر، عن النعمان بن بشير  رضى الله عنهما  قال أغمي على عبد الله بن رواحة، فجعلت أخته عمرة تبكي واجبلاه واكذا واكذا‏.‏ تعدد عليه فقال حين أفاق ما قلت شيئا إلا قيل لي آنت كذلك‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     `Abdullah bin Rawaha fell down unconscious and his sister `Amra started crying and was saying loudly, \"O Jabala! Oh so-and-so! Oh so-and-so! and went on calling him by his (good ) qualities one by one). When he came to his senses, he said (to his sister), \"When-ever you said something, I was asked, 'Are you really so (i.e. as she says)?\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "5767",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا حصين، عن عامر، عن عمران بن حصين  رضى الله عنهما  قال لا رقية إلا من عين أو حمة‏.‏ فذكرته لسعيد بن جبير فقال حدثنا ابن عباس قال رسول الله صلى الله عليه وسلم ‏\"‏ عرضت على الأمم، فجعل النبي والنبيان يمرون معهم الرهط، والنبي ليس معه أحد، حتى رفع لي سواد عظيم، قلت ما هذا أمتي هذه قيل هذا موسى وقومه‏.‏ قيل انظر إلى الأفق‏.‏ فإذا سواد يملأ الأفق، ثم قيل لي انظر ها هنا وها هنا في آفاق السماء فإذا سواد قد ملأ الأفق قيل هذه أمتك ويدخل الجنة من هؤلاء سبعون ألفا بغير حساب، ثم دخل ولم يبين لهم فأفاض القوم وقالوا نحن الذين آمنا بالله، واتبعنا رسوله، فنحن هم أو أولادنا الذين ولدوا في الإسلام فإنا ولدنا في الجاهلية‏.‏ فبلغ النبي صلى الله عليه وسلم فخرج فقال هم الذين لا يسترقون، ولا يتطيرون، ولا يكتوون وعلى ربهم يتوكلون ‏\"‏‏.‏ فقال عكاشة بن محصن أمنهم أنا يا رسول الله قال ‏\"‏ نعم ‏\"‏‏.‏ فقام آخر فقال أمنهم أنا قال ‏\"‏ سبقك عكاشة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, 'Nations were displayed before me; one or two prophets would pass by along with a few followers. A prophet would pass by accompanied by nobody. Then a big crowd of people passed in front of me and I asked, Who are they Are they my followers?\" It was said, 'No. It is Moses and his followers It was said to me, 'Look at the horizon.'' Behold! There was a multitude of people filling the horizon. Then it was said to me, 'Look there and there about the stretching sky! Behold! There was a multitude filling the horizon,' It was said to me, 'This is your nation out of whom seventy thousand shall enter Paradise without reckoning.' \"Then the Prophet entered his house without telling his companions who they (the 70,000) were. So the people started talking about the issue and said, \"It is we who have believed in Allah and followed His Apostle; therefore those people are either ourselves or our children who are born m the Islamic era, for we were born in the Pre-lslamic Period of Ignorance.'' When the Prophet heard of that, he came out and said. \"Those people are those who do not treat themselves with Ruqya, nor do they believe in bad or good omen (from birds etc.) nor do they get themselves branded (Cauterized). but they put their trust (only) in their Lord \" On that 'Ukasha bin Muhsin said. \"Am I one of them, O Allah's Apostle?' The Prophet said, \"Yes.\" Then another person got up and said, \"Am I one of them?\" The Prophet said, 'Ukasha has anticipated you.\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11052",
        "123"
      ]
    },
    {
      "hadith_no": "6025",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أنس  رضى الله عنه  قال كان قرام لعائشة سترت به جانب بيتها، فقال لها النبي صلى الله عليه وسلم ‏\"‏ أميطي عني، فإنه لا تزال تصاويره تعرض لي في صلاتي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Aisha had a thick curtain (having pictures on it) and she screened the side of her i house with it. The Prophet said to her, \"Remove it from my sight, for its pictures are still coming to my mind in my prayers.\"",
      "chain": [
        "30156",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6246",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا أبو التياح، عن أبي جمرة، عن ابن عباس  رضى الله عنهما  قال لما قدم وفد عبد القيس على النبي صلى الله عليه وسلم قال ‏\"‏ مرحبا بالوفد الذين جاءوا غير خزايا ولا ندامى ‏\"‏‏.‏ فقالوا يا رسول الله إنا حى من ربيعة وبيننا وبينك مضر، وإنا لا نصل إليك إلا في الشهر الحرام، فمرنا بأمر فصل ندخل به الجنة، وندعو به من وراءنا‏.‏ فقال ‏\"‏ أربع وأربع أقيموا الصلاة، وآتوا الزكاة، وصوم رمضان، وأعطوا خمس ما غنمتم، ولا تشربوا في الدباء، والحنتم، والنقير، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the delegation of `Abdul Qais came to the Prophet, he said, \"Welcome, O the delegation who have come! Neither you will have disgrace, nor you will regret.\" They said, \"O Allah's Apostle! We are a group from the tribe of Ar-Rabi`a, and between you and us there is the tribe of Mudar and we cannot come to you except in the sacred months. So please order us to do something good (religious deeds) so that we may enter Paradise by doing that, and also that we may order our people who are behind us (whom we have left behind at home) to follow it.\" He said, \"Four and four:\" offer prayers perfectly , pay the Zakat, (obligatory charity), fast the month of Ramadan, and give one-fifth of the war booty (in Allah's cause), and do not drink in (containers called) Ad-Duba,' Al-Hantam, An-Naqir and Al-Muzaffat.\"",
      "chain": [
        "30156",
        "20258",
        "11317",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "6621",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا حصين،‏.‏ وحدثني أسيد بن زيد، حدثنا هشيم، عن حصين، قال كنت عند سعيد بن جبير فقال حدثني ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ عرضت على الأمم، فأخذ النبي يمر معه الأمة، والنبي يمر معه النفر، والنبي يمر معه العشرة، والنبي يمر معه الخمسة، والنبي يمر وحده، فنظرت فإذا سواد كثير قلت يا جبريل هؤلاء أمتي قال لا ولكن انظر إلى الأفق‏.‏ فنظرت فإذا سواد كثير‏.‏ قال هؤلاء أمتك، وهؤلاء سبعون ألفا قدامهم، لا حساب عليهم ولا عذاب‏.‏ قلت ولم قال كانوا لا يكتوون، ولا يسترقون، ولا يتطيرون، وعلى ربهم يتوكلون ‏\"‏‏.‏ فقام إليه عكاشة بن محصن فقال ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ اللهم اجعله منهم ‏\"‏‏.‏ ثم قام إليه رجل آخر قال ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"The people were displayed in front of me and I saw one prophet passing by with a large group of his followers, and another prophet passing by with only a small group of people, and another prophet passing by with only ten (persons), and another prophet passing by with only five (persons), and another prophet passed by alone. And then I looked and saw a large multitude of people, so I asked Gabriel, \"Are these people my followers?' He said, 'No, but look towards the horizon.' I looked and saw a very large multitude of people. Gabriel said. 'Those are your followers, and those are seventy thousand (persons) in front of them who will neither have any reckoning of their accounts nor will receive any punishment.' I asked, 'Why?' He said, 'For they used not to treat themselves with branding (cauterization) nor with Ruqya (get oneself treated by the recitation of some Verses of the Qur'an) and not to see evil omen in things, and they used to put their trust (only) in their Lord.\" On hearing that, 'Ukasha bin Mihsan got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet said, \"O Allah, make him one of them.\" Then another man got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet said, 'Ukasha has preceded you.\"",
      "chain": [
        "30156",
        "20356",
        "20468",
        "15097",
        "17"
      ]
    },
    {
      "hadith_no": "6878",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا الحسين، عن يحيى، عن محمد بن عبد الرحمن الأنصاري، عن عمرة بنت عبد الرحمن، حدثته أن عائشة  رضى الله عنها  حدثتهم عن النبي صلى الله عليه وسلم قال ‏\"‏ يقطع في ربع دينار ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"The hand should be cut off for stealing a quarter of a Dinar.\"",
      "chain": [
        "30156",
        "20258",
        "11278",
        "11449",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا خصيف، عن أبي عبيدة، عن عبد الله بن مسعود، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة الخوف فقاموا صفين صف خلف رسول الله صلى الله عليه وسلم وصف مستقبل العدو فصلى بهم رسول الله صلى الله عليه وسلم ركعة ثم جاء الآخرون فقاموا مقامهم واستقبل هؤلاء العدو فصلى بهم النبي صلى الله عليه وسلم ركعة ثم سلم فقام هؤلاء فصلوا لأنفسهم ركعة ثم سلموا ثم ذهبوا فقاموا مقام أولئك مستقبلي العدو ورجع أولئك إلى مقامهم فصلوا لأنفسهم ركعة ثم سلموا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) led us in prayer in the time of danger. They (the people) stood in two rows. One row was behind the Messenger of Allah (ﷺ) and the other faced the enemy. The Messenger of Allah (ﷺ) led them in one rak'ah,and then the other section came and took their place; they went and faced the enemy. The Prophet (ﷺ) led them in one rak'ah and uttered the salutation. They stood up and prayed the second rak'ah by themselves and uttered the salutation and went away; they took the place of the other section facing the enemy.  They came back and took their place. They prayed one rak'ah by themselves and then uttered the salutation.",
      "chain": [
        "30156",
        "20356",
        "19908",
        "10",
        "16"
      ]
    }
  ],
  "total_hadiths": 14
}