{
  "id": "30152",
  "name": "'Amr bin al-'Abbas al-Bahly عمرو بن العباس الباهلي أبو عثمان البصري",
  "full_name": "'Amr bin al-'Abbas al-Bahly عمرو بن العباس الباهلي أبو عثمان البصري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "235",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ خ  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ خ  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Basri",
        "ar": "al-Basri",
        "ckb": "al-Basri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "24415",
      "name": "Muhammad bin Mrwan bin Qdamh محمد بن مروان بن قدامة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "24006",
      "name": "Ibrahim bin Sdqh al-Basri إبراهيم بن صدقة البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "38562",
      "name": "Muhammad bin 'Amr bin محمد بن عمرو",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "11547",
      "name": "Abu Bakr bin Suliaman bin Abi Hathma أبو بكر بن سليمان بن أبي حثمة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-391",
      "hadith_no": "391",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عباس، قال حدثنا ابن المهدي، قال حدثنا منصور بن سعد، عن ميمون بن سياه، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاتنا، واستقبل قبلتنا، وأكل ذبيحتنا، فذلك المسلم الذي له ذمة الله وذمة رسوله، فلا تخفروا الله في ذمته ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Whoever prays like us and faces our Qibla and eats our slaughtered animals is a Muslim and is under Allah's and His Apostle's protection. So do not betray Allah by betraying those who are in His protection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30152",
        "20033",
        "20289",
        "11614",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-975",
      "hadith_no": "975",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عمرو بن عباس، قال حدثنا عبد الرحمن، حدثنا سفيان، عن عبد الرحمن، قال سمعت ابن عباس، قال خرجت مع النبي صلى الله عليه وسلم يوم فطر أو أضحى، فصلى ثم خطب، ثم أتى النساء فوعظهن وذكرهن، وأمرهن بالصدقة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I (in my boyhood) went out with the Prophet on the day of `Id ul Fitr or Id-ul-Adha. The Prophet prayed and then delivered the Khutba and then went towards the women, preached and advised them and ordered them to give alms.",
      "usc_msa_ref": "92",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1916",
      "hadith_no": "1916",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن محمد بن المنكدر، عن جابر  رضى الله عنه  جاء أعرابي النبي صلى الله عليه وسلم فبايعه على الإسلام، فجاء من الغد محموما، فقال أقلني، فأبى ثلاث مرار، فقال ‏\"‏ المدينة كالكير، تنفي خبثها، وينصع طيبها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     A bedouin came to the Prophet and gave a pledge of allegiance for embracing Islam. The next day he came with fever and said (to the Prophet ), \"Please cancel my pledge (of embracing Islam and of emigrating to Medina).\" The Prophet refused (that request) three times and said, \"Medina is like a furnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"",
      "usc_msa_ref": "107",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11048",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2427",
      "hadith_no": "2427",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن ربيعة، حدثني يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  قال جاء أعرابي النبي صلى الله عليه وسلم فسأله عما يلتقطه فقال ‏\"‏ عرفها سنة، ثم احفظ عفاصها ووكاءها، فإن جاء أحد يخبرك بها، وإلا فاستنفقها ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال ضالة الإبل فتمعر وجه النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، ترد الماء وتأكل الشجر ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A bedouin went to the Prophet and asked him about picking up a lost thing. The Prophet said, \"Make public announcement about it for one year. Remember the description of its container and the string with which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); otherwise, utilize it.\" He said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" On that the face of the Prophet became red (with anger) and said, \"You have nothing to do with it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"",
      "usc_msa_ref": "609",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11162",
        "11238",
        "3625"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2912",
      "hadith_no": "2912",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، عن سفيان، عن أبي إسحاق، عن عمرو بن الحارث، قال ما ترك النبي صلى الله عليه وسلم إلا سلاحه وبغلة بيضاء وأرضا جعلها صدقة‏.‏",
      "text_en": " Narrated `Amr bin Al-Harith:                     The Prophet did not leave behind him after his death, anything except his arms, his white mule, and a piece of land at Khaibar which he left to be given in charity .",
      "usc_msa_ref": "160",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11049",
        "20377"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3262",
      "hadith_no": "3262",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، قال أخبرني رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم، فأبردوها عنكم بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard the Prophet saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"",
      "usc_msa_ref": "484",
      "chain": [
        "30152",
        "20033",
        "20012",
        "20016",
        "11179",
        "1986"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3674",
      "hadith_no": "3674",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عمرو بن عباس، حدثنا ابن مهدي، حدثنا سفيان، عن محمد بن المنكدر، عن جابر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ هل لكم من أنماط ‏\"‏‏.‏ قلت وأنى يكون لنا الأنماط قال ‏\"‏ أما إنه سيكون لكم الأنماط ‏\"‏‏.‏ فأنا أقول لها  يعني امرأته  أخري عني أنماطك‏.‏ فتقول ألم يقل النبي صلى الله عليه وسلم ‏\"‏ إنها ستكون لكم الأنماط ‏\"‏‏.‏ فأدعها‏.‏",
      "text_en": " Narrated Jabir:                     (Once) the Prophet said, \"Have you got carpets?\" I replied, \"Whence can we get carpets?\" He said, \"But you shall soon have carpets.\" I used to say to my wife, \"Remove your carpets from my sight,\" but she would say, \"Didn't the Prophet tell you that you would soon have carpets?\" So I would give up my request.",
      "usc_msa_ref": "825",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11048",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3812",
      "hadith_no": "3812",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، عن معاوية  رضى الله عنه  قال إنكم لتصلون صلاة لقد صحبنا النبي صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Humran bin `Abbas:                     Muawiya said (to the people), \"You offer a prayer which we, who were the companions of the Prophet never saw the Prophet offering, and he forbade its offering,\" i.e. the two rak`at after the compulsory `Asr prayer.",
      "usc_msa_ref": "110",
      "chain": [
        "30152",
        "20173",
        "20020",
        "11317",
        "11421",
        "27"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3886",
      "hadith_no": "3886",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، قال قال عمر  رضى الله عنه  إن المشركين كانوا لا يفيضون من جمع حتى تشرق الشمس على ثبير، فخالفهم النبي صلى الله عليه وسلم فأفاض قبل أن تطلع الشمس‏.‏",
      "text_en": " Narrated `Umar:                     The pagans used not to leave Jam' (i.e. Muzdalifa) till the sun had risen on Thabir mountain. The Prophet contradicted them by leaving (Muzdalifa) before the sun rose.",
      "usc_msa_ref": "179",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11049",
        "11382",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3909",
      "hadith_no": "3909",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن بن مهدي، حدثنا المثنى، عن أبي جمرة، عن ابن عباس  رضى الله عنهما  قال لما بلغ أبا ذر مبعث النبي صلى الله عليه وسلم قال لأخيه اركب إلى هذا الوادي، فاعلم لي علم هذا الرجل الذي يزعم أنه نبي، يأتيه الخبر من السماء، واسمع من قوله، ثم ائتني‏.‏ فانطلق الأخ حتى قدمه وسمع من قوله، ثم رجع إلى أبي ذر، فقال له رأيته يأمر بمكارم الأخلاق، وكلاما ما هو بالشعر‏.‏ فقال ما شفيتني مما أردت، فتزود وحمل شنة له فيها ماء حتى قدم مكة، فأتى المسجد، فالتمس النبي صلى الله عليه وسلم ولا يعرفه، وكره أن يسأل عنه حتى أدركه بعض الليل، فرآه علي فعرف أنه غريب‏.‏ فلما رآه تبعه، فلم يسأل واحد منهما صاحبه عن شىء حتى أصبح، ثم احتمل قربته وزاده إلى المسجد، وظل ذلك اليوم ولا يراه النبي صلى الله عليه وسلم حتى أمسى، فعاد إلى مضجعه، فمر به علي فقال أما نال للرجل أن يعلم منزله فأقامه، فذهب به معه لا يسأل واحد منهما صاحبه عن شىء، حتى إذا كان يوم الثالث، فعاد علي مثل ذلك، فأقام معه ثم قال ألا تحدثني ما الذي أقدمك قال إن أعطيتني عهدا وميثاقا لترشدنني فعلت ففعل فأخبره‏.‏ قال فإنه حق وهو رسول الله صلى الله عليه وسلم، فإذا أصبحت فاتبعني، فإني إن رأيت شيئا أخاف عليك قمت كأني أريق الماء، فإن مضيت فاتبعني حتى تدخل مدخلي‏.‏ ففعل، فانطلق يقفوه حتى دخل على النبي صلى الله عليه وسلم ودخل معه، فسمع من قوله، وأسلم مكانه فقال له النبي صلى الله عليه وسلم ‏\"‏ ارجع إلى قومك، فأخبرهم حتى يأتيك أمري ‏\"‏‏.‏ قال والذي نفسي بيده لأصرخن بها بين ظهرانيهم، فخرج حتى أتى المسجد فنادى بأعلى صوته أشهد أن لا إله إلا الله، وأن محمدا رسول الله‏.‏ ثم قام القوم فضربوه حتى أضجعوه، وأتى العباس فأكب عليه قال ويلكم ألستم تعلمون أنه من غفار وأن طريق تجاركم إلى الشأم فأنقذه منهم، ثم عاد من الغد لمثلها، فضربوه وثاروا إليه، فأكب العباس عليه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Abu Dhar received the news of the Advent of the Prophet he said to his brother, \"Ride to this valley (of Mecca) and try to find out the truth of the person who claims to be a prophet who is informed of the news of Heaven. Listen to what he says and come back to me.\" So his brother set out and came to the Prophet and listened to some of his talks, and returned to Abu Dhar and said to him. \"I have seen him enjoining virtuous behavior and saying something that is not poetry.\" Abu Dhar said, \"You have not satisfied me as to what I wanted.\" He then took his journey-food and carried a waterskin of his, containing some water till be reached Mecca. He went to the Mosque and searched for the Prophet and though he did not know him, he hated to ask anybody about him. When a part of the night had passed away, `Ali saw him and knew that he was a stranger. So when Abu Dhar saw `Ali, he followed him, and none of them asked his companion about anything, and when it was dawn, Abu Dhar took his journey food and his water-skin to the Mosque and stayed there all the day long without being perceived by the Prophet, and when it was evening, he came back to his retiring place. `Ali passed by him and said, \"Has the man not known his dwelling place yet?\" So `Ali awakened him and took him with him and none of them spoke to the other about anything. When it was the third day. `Ali did the same and Abu Dhar stayed with him. Then `Ali said \"Will you tell me what has brought you here?\" Abu Dhar said, \"If you give me a firm promise that you will guide me, then I will tell you.\" `Ali promised him, and he informed `Ali about the matter. `Ali said, \"It is true, and he is the Apostle of Allah. Next morning when you get up, accompany me, and if I see any danger for you, I will stop as if to pass water, but if I go on, follow me and enter the place which I will enter.\" Abu Dhar did so, and followed `Ali till he entered the place of the Prophet, and Abu Dhar went in with him, Abu Dhar listened to some of the Prophet's talks and embraced Islam on the spot. The Prophet said to him, \"Go back to your people and inform them (about it) till you receive my order.\" Abu Dhar said, \"By Him in Whose Hand my life is, I will proclaim my conversion loudly amongst them (i.e. the pagans).\" So he went out, and when he reached the Mosque, he said as loudly as possible, \"I bear witness that None has the right to be worshipped except Allah, and Muhammad is the Apostle of Allah.\" The People got up and beat him painfully. Then Al-Abbas came and knelt over him ((to protect him) and said (to the people), \"Woe to you! Don't you know that this man belongs to the tribe of Ghifar and your trade to Sha'm is through their way?\" So he rescued him from them. Abu Dhar again did the same the next day. They beat him and took vengeance on him and again Al-Abbas knelt over him (to protect him).",
      "usc_msa_ref": "201",
      "chain": [
        "30152",
        "20033",
        "11309",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5380",
      "hadith_no": "5380",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال عروة بن الزبير لعائشة ألم ترين إلى فلانة بنت الحكم طلقها زوجها البتة فخرجت‏.‏ فقالت بئس ما صنعت‏.‏ قال ألم تسمعي في قول فاطمة قالت أما إنه ليس لها خير في ذكر هذا الحديث‏.‏",
      "text_en": " Narrated Qasim:                     Ursa said to Aisha, \"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her irrevocably and she left (her husband's house).\" `Aisha said, \"What a bad thing she has done!\" 'Ursa said (to `Aisha), \"Haven't you heard the statement of Fatima?\" `Aisha replied, \"It is not in her favor to mention.\" 'Ursa added, `Aisha reproached (Fatima) severely and said, \"Fatima was in a lonely place, and she was proned to danger, so the Prophet allowed her (to go out of her husband's house).",
      "usc_msa_ref": "244",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "10535",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5696",
      "hadith_no": "5696",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن سالم أبي النضر، عن عمير، مولى أم الفضل عن أم الفضل، أنهم شكوا في صوم النبي صلى الله عليه وسلم يوم عرفة، فبعث إليه بقدح من لبن فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     that the people were in doubt whether the Prophet was fasting on the Day of `Arafat or not, so a (wooden) drinking vessel full of milk was sent to him, and he drank it.",
      "usc_msa_ref": "540",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11164",
        "11532"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5726",
      "hadith_no": "5726",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن محمد  هو ابن المنكدر  عن جابر  رضى الله عنه  قال جاءني النبي صلى الله عليه وسلم يعودني ليس براكب بغل ولا برذون‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet came to visit me (while I was sick) and he was riding neither a mule, nor a horse.",
      "usc_msa_ref": "568",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11048",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6056",
      "hadith_no": "6056",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، أن عمرو بن العاص، قال سمعت النبي صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ إن آل أبي ‏\"‏  قال عمرو في كتاب محمد بن جعفر بياض  ليسوا بأوليائي، إنما وليي الله وصالح المؤمنين‏.‏ زاد عنبسة بن عبد الواحد عن بيان عن قيس عن عمرو بن العاص قال سمعت النبي صلى الله عليه وسلم ‏\"‏ ولكن لهم رحم أبلها ببلالها ‏\"‏‏.‏ يعني أصلها بصلتها‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     I heard the Prophet saying openly not secretly, \"The family of Abu so-and-so (i.e. Talib) are not among my protectors.\" `Amr said that there was a blank space (1) in the Book of Muhammad bin Ja`far. He added, \"My Protector is Allah and the righteous believing people.\" `Amr bin Al-`As added: I heard the Prophet saying, 'But they (that family) have kinship (Rahm) with me and I will be good and dutiful to them. \"",
      "usc_msa_ref": "19",
      "chain": [
        "30152",
        "20173",
        "20020",
        "11418",
        "11046",
        "28"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6828",
      "hadith_no": "6828",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبي قيس، عن هزيل، قال قال عبد الله لأقضين فيها بقضاء النبي صلى الله عليه وسلم للابنة النصف، ولابنة الابن السدس، وما بقي فللأخت‏.‏",
      "text_en": " Narrated Huzail:                     `Abdullah said, \"The judgment I will give in this matter will be like the judgment of the Prophet, i.e. one-half is for the daughter and one-sixth for the son's daughter and the rest of the inheritance for the sister.\"",
      "usc_msa_ref": "734",
      "chain": [
        "30152",
        "20033",
        "20012"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7361",
      "hadith_no": "7361",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن واصل، عن أبي وائل، قال جلست إلى شيبة في هذا المسجد قال جلس إلى عمر في مجلسك هذا فقال هممت أن لا أدع فيها صفراء ولا بيضاء إلا قسمتها بين المسلمين‏.‏ قلت ما أنت بفاعل‏.‏ قال لم‏.‏ قلت لم يفعله صاحباك قال هما المرآن يقتدى بهما‏.‏",
      "text_en": " Narrated Abu Wail:                     I sat with Shaiba in this Mosque (Al-Masjid-Al-Haram), and he said, \"`Umar once sat beside me here as you are now sitting, and said, 'I feel like distributing all the gold and silver that are in it (i.e., the Ka`ba) among the Muslims'. I said, 'You cannot do that.' `Umar said, 'Why?' I said, 'Your two (previous) companions (the Prophet and Abu Bakr) did not do it. `Umar said, 'They are the two persons whom one must follow.'\" (See Hadith No. 664, Vol. 2)",
      "usc_msa_ref": "380",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11401",
        "11353"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    }
  ],
  "total_hadiths": 16,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}