{
  "id": "30151",
  "name": "'Uthman bin al-Haythm bin Jahm عثمان بن الهيثم بن جهم بن عيسى",
  "full_name": "'Uthman bin al-Haythm bin Jahm عثمان بن الهيثم بن جهم بن عيسى",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": [
        "120 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1797",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان بن الهيثم، أخبرنا ابن جريج، قال عمرو بن دينار قال ابن عباس  رضى الله عنهما  كان ذو المجاز وعكاظ متجر الناس في الجاهلية، فلما جاء الإسلام كأنهم كرهوا ذلك حتى نزلت ‏{‏ليس عليكم جناح أن تبتغوا فضلا من ربكم‏}‏ في مواسم الحج‏.‏",
      "text_en": " Narrated Ibn ' `Abbas:                     Dhul-Majaz and `Ukaz were the markets of the people during the Pre-Islamic period of ignorance. When the people embraced Islam, they disliked to do bargaining there till the following Holy Verses were revealed:-- There is no harm for you If you seek of the bounty Of your Lord (during Hajj by trading, etc.) (2.198)",
      "chain": [
        "30151",
        "11070",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "2311",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "وقال عثمان بن الهيثم أبو عمرو حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت فجعل يحثو من الطعام، فأخذته، وقلت والله لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال إني محتاج، وعلى عيال، ولي حاجة شديدة‏.‏ قال فخليت عنه فأصبحت فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة ما فعل أسيرك البارحة ‏\"‏‏.‏ قال قلت يا رسول الله شكا حاجة شديدة وعيالا فرحمته، فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فعرفت أنه سيعود لقول رسول الله صلى الله عليه وسلم إنه سيعود‏.‏ فرصدته فجاء يحثو من الطعام فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال دعني فإني محتاج، وعلى عيال لا أعود، فرحمته، فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، ما فعل أسيرك ‏\"‏‏.‏ قلت يا رسول الله شكا حاجة شديدة وعيالا، فرحمته فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فرصدته الثالثة فجاء يحثو من الطعام، فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم، وهذا آخر ثلاث مرات أنك تزعم لا تعود ثم تعود‏.‏ قال دعني أعلمك كلمات ينفعك الله بها‏.‏ قلت ما هو قال إذا أويت إلى فراشك فاقرأ آية الكرسي ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ حتى تختم الآية، فإنك لن يزال عليك من الله حافظ ولا يقربنك شيطان حتى تصبح‏.‏ فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما فعل أسيرك البارحة ‏\"‏‏.‏ قلت يا رسول الله زعم أنه يعلمني كلمات، ينفعني الله بها، فخليت سبيله‏.‏ قال ‏\"‏ ما هي ‏\"‏‏.‏ قلت قال لي إذا أويت إلى فراشك فاقرأ آية الكرسي من أولها حتى تختم ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ وقال لي لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح، وكانوا أحرص شىء على الخير‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما إنه قد صدقك وهو كذوب، تعلم من تخاطب منذ ثلاث ليال يا أبا هريرة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ ذاك شيطان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle deputed me to keep Sadaqat (al-Fitr) of Ramadan. A      comer came and started taking handfuls of the foodstuff (of the      Sadaqa) (stealthily). I took hold of him and said, \"By Allah, I will      take you to Allah's Apostle .\" He said, \"I am needy and have many      dependents, and I am in great need.\" I released him, and in the      morning Allah's Apostle asked me, \"What did your prisoner do      yesterday?\" I said, \"O Allah's Apostle! The person complained of being     needy and of having many dependents, so, I pitied him and let him go.\"     Allah's Apostle said, \"Indeed, he told you a lie and he will be coming     again.\" I believed that he would show up again as Allah's Apostle had      told me that he would return. So, I waited for him watchfully. When he     (showed up and) started stealing handfuls of foodstuff, I caught hold      of him again and said, \"I will definitely take you to Allah's Apostle.     He said, \"Leave me, for I am very needy and have many dependents. I      promise I will not come back again.\" I pitied him and let him go.      In the morning Allah's Apostle asked me, \"What did your prisoner do.\"      I replied, \"O Allah's Apostle! He complained of his great need and of      too many dependents, so I took pity on him and set him free.\" Allah's      Apostle said, \"Verily, he told you a lie and he will return.\" I waited     for him attentively for the third time, and when he (came and) started     stealing handfuls of the foodstuff, I caught hold of him and said, \"I      will surely take you to Allah's Apostle as it is the third time you      promise not to return, yet you break your promise and come.\" He said,      \"(Forgive me and) I will teach you some words with which Allah will      benefit you.\" I asked, \"What are they?\" He replied, \"Whenever you go      to bed, recite \"Ayat-al-Kursi\"-- 'Allahu la ilaha illa huwa-l-Haiy-ul      Qaiyum' till you finish the whole verse. (If you do so), Allah will      appoint a guard for you who will stay with you and no satan will come      near you till morning. \" So, I released him. In the morning, Allah's      Apostle asked, \"What did your prisoner do yesterday?\" I replied, \"He      claimed that he would teach me some words by which Allah will benefit      me, so I let him go.\" Allah's Apostle asked, \"What are they?\" I      replied, \"He said to me, 'Whenever you go to bed, recite Ayat-al-Kursi     from the beginning to the end ---- Allahu la ilaha illa      huwa-lHaiy-ul-Qaiyum----.' He further said to me, '(If you do so),      Allah will appoint a guard for you who will stay with you, and no      satan will come near you till morning.' (Abu Huraira or another      sub-narrator) added that they (the companions) were very keen to do      good deeds. The Prophet said, \"He really spoke the truth, although he      is an absolute liar. Do you know whom you were talking to, these three     nights, O Abu Huraira?\" Abu Huraira said, \"No.\" He said, \"It was      Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3275",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وقال عثمان بن الهيثم حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت، فجعل يحثو من الطعام، فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ فذكر الحديث فقال إذا أويت إلى فراشك فاقرأ آية الكرسي لن يزال عليك من الله حافظ، ولا يقربك شيطان حتى تصبح‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدقك وهو كذوب، ذاك شيطان ‏\"‏‏.‏",
      "text_en": "    Narrated Muhammad bin Sirin:                      Abu Huraira said, \"Allah's Apostle put me in charge of the Zakat of Ramadan (i.e. Zakat-ul-Fitr). Someone came to me and started scooping some of the foodstuff of (Zakat) with both hands. I caught him and told him that I would take him to Allah's Apostle.\" Then Abu Huraira told the whole narration and added \"He (i.e. the thief) said, 'Whenever you go to your bed, recite the Verse of \"Al-Kursi\" (2.255) for then a guardian from Allah will be guarding you, and Satan will not approach you till dawn.' \" On that the Prophet said, \"He told you the truth, though he is a liar, and he (the thief) himself was the Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4469",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن الحسن، عن أبي بكرة، قال لقد نفعني الله بكلمة سمعتها من، رسول الله صلى الله عليه وسلم أيام الجمل، بعد ما كدت أن ألحق بأصحاب الجمل فأقاتل معهم قال لما بلغ رسول الله صلى الله عليه وسلم أن أهل فارس قد ملكوا عليهم بنت كسرى قال ‏\"‏ لن يفلح قوم ولوا أمرهم امرأة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     During the days (of the battle) of Al-Jamal, Allah benefited me with a word I had heard from Allah's Apostle after I had been about to join the Companions of Al-Jamal (i.e. the camel) and fight along with them. When Allah's Apostle was informed that the Persians had crowned the daughter of Khosrau as their ruler, he said, \"Such people as ruled by a lady will never be successful.\"",
      "chain": [
        "30151",
        "11298",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "5062",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال عثمان بن الهيثم حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان فأتاني آت فجعل يحثو من الطعام فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم فقص الحديث فقال إذا أويت إلى فراشك فاقرأ آية الكرسي لن يزال معك من الله حافظ ولا يقربك شيطان حتى تصبح‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ صدقك وهو كذوب ذاك شيطان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                      Allah 's Apostle ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing of the foodstuff. I caught him and said, \"I will take you to Allah's Apostle!\" Then Abu Huraira described the whole narration and said:) That person said (to me), \"(Please don't take me to Allah's Apostle and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and Satan will not be able to come near you till dawn.\" (When the Prophet heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5253",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن أبي رجاء، عن عمران، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء، واطلعت في النار، فرأيت أكثر أهلها النساء ‏\"‏‏.‏ تابعه أيوب وسلم بن زرير‏.‏",
      "text_en": " Narrated `Imran:                     The Prophet said, \"I looked at Paradise and saw that the majority of its residents were the poor; and I looked at the (Hell) Fire and saw that the majority of its residents were women.\"",
      "chain": [
        "30151",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "5993",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عثمان بن الهيثم، أو محمد عنه عن ابن جريج، أخبرني عمر بن عبد الله بن عروة، سمع عروة، والقاسم، يخبران عن عائشة، قالت طيبت رسول الله صلى الله عليه وسلم بيدى بذريرة في حجة الوداع، للحل والإحرام‏.‏",
      "text_en": " Narrated `Aisha:                     During Hajjat-al-Wada`, I perfumed Allah's Apostle with Dharira with my own hands, both on his assuming Ihram and on finishing it.",
      "chain": [
        "30151",
        "11070",
        "11529",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6626",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن أبي رجاء، عن عمران، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء واطلعت في النار فرأيت أكثر أهلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated `Imran:                     The Prophet said, \"I looked into paradise and saw that the majority of its people were the poor, and I looked into the Fire and found that the majority of its people were women.\"",
      "chain": [
        "30151",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "6746",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عثمان بن الهيثم، أو محمد عنه عن ابن جريج، قال سمعت ابن شهاب، يقول حدثني عيسى بن طلحة، أن عبد الله بن عمرو بن العاص، حدثه أن النبي صلى الله عليه وسلم بينما هو يخطب يوم النحر إذ قام إليه رجل فقال كنت أحسب يا رسول الله كذا وكذا قبل كذا وكذا‏.‏ ثم قام آخر فقال يا رسول الله كنت أحسب كذا وكذا لهؤلاء الثلاث‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ افعل ولا حرج ‏\"‏ لهن كلهن يومئذ، فما سئل يومئذ عن شىء إلا قال ‏\"‏ افعل ولا حرج ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-As:                     While the Prophet was delivering a sermon on the Day of Nahr (i.e., 10th Dhul-Hijja-Day of slaughtering the sacrifice), a man got up saying, \"I thought, O Allah's Apostle, such-and-such a thing was to be done before such-and-such a thing.\" Another man got up, saying, \"O Allah's Apostle! As regards these three (acts of Hajj), thought so-and-so.\" The Prophet said, \"Do, and there is no harm,\" concerning all those matters on that day. And so, on that day, whatever question he was asked, he said, \"Do it, do it, and there is no harm therein.\"",
      "chain": [
        "30151",
        "11070",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "7188",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن الحسن، عن أبي بكرة، قال لقد نفعني الله بكلمة أيام الجمل لما بلغ النبي صلى الله عليه وسلم أن فارسا ملكوا ابنة كسرى قال ‏\"‏ لن يفلح قوم ولوا أمرهم امرأة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     During the battle of Al-Jamal, Allah benefited me with a Word (I heard from the Prophet). When the Prophet heard the news that the people of the Persia had made the daughter of Khosrau their Queen (ruler), he said, \"Never will succeed such a nation as makes a woman their ruler.\"",
      "chain": [
        "30151",
        "11298",
        "11016",
        "3229"
      ]
    }
  ],
  "total_hadiths": 10
}