{
  "id": "30150",
  "name": "'Ubaidullah bin Mua'dh عبيد الله بن معاذ بن معاذ بن نصر",
  "full_name": "'Ubaidullah bin Mua'dh عبيد الله بن معاذ بن معاذ بن نصر",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "237",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-'Anbari",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "30566",
      "name": "al-Mthna bin Mua'dh bin Mua'dh المثنى بن معاذ بن معاذ العنبري",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30566",
      "name": "al-Mthna bin Mua'dh bin Mua'dh المثنى بن معاذ بن معاذ العنبري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4208",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عبيد الله بن معاذ حدثنا أبي، حدثنا شعبة، عن عمرو بن مرة، حدثني عبد الله بن أبي أوفى  رضى الله عنهما  كان أصحاب الشجرة ألفا وثلاثمائة، وكانت أسلم ثمن المهاجرين‏.‏ تابعه محمد بن بشار حدثنا أبو داود حدثنا شعبة‏.‏",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "4694",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني أحمد، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الحميد  هو ابن كرديد صاحب الزيادي  سمع أنس بن مالك  رضى الله عنه  قال أبو جهل ‏{‏اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم‏}‏ فنزلت ‏{‏وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You, then rain down on us a shower of stones from the sky or bring on us a painful torment.\" So Allah revealed:-- \"But Allah would not punish them while you were amongst them, nor He will punish them while they seek (Allah's) forgiveness...\" (8.33) And why Allah should not punish them while they turn away (men) from Al- Masjid-al-Haram (the Sacred Mosque of Mecca)...\" (8.33-34)",
      "chain": [
        "30007",
        "30150",
        "20286",
        "20020",
        "19"
      ]
    },
    {
      "hadith_no": "4695",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن النضر، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الحميد، صاحب الزيادي سمع أنس بن مالك، قال قال أبو جهل ‏{‏اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم‏}‏ فنزلت ‏{‏وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You), then rain down on us a shower of stones from the sky or bring on us a painful punishment.\" So there was revealed:-- 'But Allah would not punish them while you (Muhammad) were amongst them, nor will He punish them while they seek (Allah's) Forgiveness. And why Allah should not punish them while they stop (men) from Al-Masjid-al-Haram ..' (8.33-34)",
      "chain": [
        "30386",
        "30150",
        "20286",
        "20020",
        "11703",
        "19"
      ]
    },
    {
      "hadith_no": "7442",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا حماد بن حميد، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن المنكدر، قال رأيت جابر بن عبد الله يحلف بالله أن ابن الصائد الدجال، قلت تحلف بالله‏.‏ قال إني سمعت عمر يحلف على ذلك عند النبي صلى الله عليه وسلم فلم ينكره النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Muhammad bin Al-Munkadir:                     I saw Jabir bin `Abdullah swearing by Allah that Ibn Sayyad was the Dajjal. I said to Jabir, \"How can you swear by Allah?\" Jabir said, \"I have heard `Umar swearing by Allah regarding this matter in the presence of the Prophet and the Prophet did not disapprove of it.\"",
      "chain": [
        "30331",
        "30150",
        "20286",
        "20020",
        "11063",
        "11048"
      ]
    },
    {
      "hadith_no": "7",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، قالا حدثنا شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كفى بالمرء كذبا أن يحدث بكل ما سمع ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "30170",
        "20033",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "hadith_no": "80",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني عبيد الله بن معاذ العنبري، حدثنا أبي قال، كتبت إلى شعبة أسأله عن أبي شيبة، قاضي واسط فكتب إلى لا تكتب عنه شيئا ومزق كتابي ‏.‏",
      "text_en": "",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "122",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا عاصم، - وهو ابن محمد بن زيد بن عبد الله بن عمر - عن أبيه، قال قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ بني الإسلام على خمس شهادة أن لا إله إلا الله وأن محمدا عبده ورسوله وإقام الصلاة وإيتاء الزكاة وحج البيت وصوم رمضان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah son of 'Umar that the Messenger of Allah (may peace be upon him) said:                      (The superstructure of) al-Islam is raised on five (pillars), testifying (the fact) that there is no god but Allah, that Muhammad is His bondsman and messenger, and the establishment of prayer, payment of Zakat, Pilgrimage to the House (Ka'ba) and the fast of Ramadan.",
      "chain": [
        "30150",
        "20286",
        "20163",
        "11217",
        "16"
      ]
    },
    {
      "hadith_no": "126",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا نصر بن علي الجهضمي، قال أخبرني أبي قالا، جميعا حدثنا قرة بن خالد، عن أبي جمرة، عن ابن عباس، عن النبي صلى الله عليه وسلم بهذا الحديث نحو حديث شعبة ‏.‏ وقال ‏\"‏ أنهاكم عما ينبذ في الدباء والنقير والحنتم والمزفت ‏\"‏ ‏.‏ وزاد ابن معاذ في حديثه عن أبيه قال وقال رسول الله صلى الله عليه وسلم للأشج أشج عبد القيس ‏\"‏ إن فيك خصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏",
      "text_en": " There is another hadith narrated on the authority of Ibn Abbas (the contents of which are similar to the one) narrated by Shu'ba in which the Holy Prophet (may peace be upon him) said:                      I forbid you to prepare nabidh in a gourd, hollowed block of wood, a varnished jar or receptacle. Ibn Mu'adh made this addition on the authority of his father that the Messenger of Allah said to Ashajj, of the tribe of 'Abdul-Qais: You possess two qualities which are liked by Allah: insight and deliberateness.",
      "chain": [
        "30150",
        "20286",
        "30395",
        "20264",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن واقد بن محمد، عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abdullah b. Mu'adh narrated from the Apostle (may peace and blessings be upon him) a hadith like this on the authority on Ibn Umar.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "264",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الوليد بن العيزار، أنه سمع أبا عمرو الشيباني، قال حدثني صاحب، هذه الدار - وأشار إلى دار عبد الله - قال سألت رسول الله صلى الله عليه وسلم أى الأعمال أحب إلى الله قال ‏\"‏ الصلاة على وقتها ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ ثم بر الوالدين ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ ثم الجهاد في سبيل الله ‏\"‏ قال حدثني بهن ولو استزدته لزادني ‏.‏",
      "text_en": " It was heard from Abu 'Amr Shaibani that, pointing towards the house of Abdullah, he said:                      The owner of this house told me that he asked the Messenger of Allah (may peace be upon him): Which of the deeds are liked by Allah? He (the Holy Prophet) observed: Prayer at its proper time. I (again) said: What next? He replied: Then goodness to the parents. I (again) said: What then? He replied: Then Jihad in the cause of Allah. He ('Abdullah) said: This is what I was told (by the Holy Prophet). Had I questioned further, he would have made additions for me.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11663",
        "15580"
      ]
    },
    {
      "hadith_no": "405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، ح وحدثنا ابن أبي عمر، حدثنا سفيان، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، كلهم عن صالح بن صالح، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters like Abu Bakr b. Abi Shaiba, 'Abda b. Sulaiman Ibn Abi 'Umar Sufyan, 'Ubaidullah b. Mu'adh, Shu'ba; all of them heard it from Salih b. Salih.",
      "chain": [
        "30201",
        "20337",
        "30421",
        "20005",
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن سليمان الشيباني، سمع زر بن حبيش، عن عبد الله، قال ‏{‏ لقد رأى من آيات ربه الكبرى‏}‏ قال رأى جبريل في صورته له ستمائة جناح ‏.‏",
      "text_en": " Zirr b. Hubaish narrated it on the authority of 'Abdullah (that the words of Allah):                     \" Certainly he saw of the greatest signs of Allah\" (al-Qur'an, liii. 18) imply that he saw Gabriel in his (original) form and he had six hundred wings.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11352",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن محمد، - وهو ابن زياد - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل نبي دعوة دعا بها في أمته فاستجيب له وإني أريد إن شاء الله أن أؤخر دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: There was for every apostle a prayer with which he prayed for his Ummah and it was granted to him; but I wish, if Allah so wills, to defer my prayer for the intercession of my Ummah on the Day of Resurrection.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، قالا جميعا حدثنا شعبة، عن جامع بن شداد، قال سمعت حمران بن أبان، يحدث أبا بردة في هذا المسجد في إمارة بشر أن عثمان بن عفان قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتم الوضوء كما أمره الله تعالى فالصلوات المكتوبات كفارات لما بينهن ‏\"‏ ‏.‏ هذا حديث ابن معاذ وليس في حديث غندر في إمارة بشر ولا ذكر المكتوبات ‏.‏",
      "text_en": " Jami' b. Shaddad reported:                      I heard Humran b. Aban narrate to Abu Burda in this very mosque during the governorship of Bishr that 'Uthman b. Alfan said: The Messenger of Allah (may peace be upon him) observed: He who completed ablution as Allah, the Exalted, enjoined upon him, his obligatory prayers would be explatious (for his minor sins that he would commit) during (the interval) between them. This hadith is transmitted by Ibn Mu'adh, and in the hadith narrated by Ghundar, the words\" during the governorship of Bishr\" are omitted and there is no mention of the obligatory prayers.",
      "chain": [
        "30150",
        "20286",
        "30170",
        "30160",
        "20173",
        "20020",
        "11328",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن الأشعث، عن أبيه، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يحب التيمن في شأنه كله في نعليه وترجله وطهوره ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) loved to start from the right-hand side in his every act i. e. in wearing shoes, in combing (his hair) and in performing ablution.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "485",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، سمع مطرف بن عبد الله، يحدث عن ابن المغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب ثم قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ ثم رخص في كلب الصيد وكلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة في التراب ‏\"‏ ‏.‏",
      "text_en": " Ibn Mughaffal reported:                      The Messenger of Allah (may peace be upon him) ordered killing of the dogs, and then said: What about them, i. e. about other dogs? and then granted concession (to keep) the dog for hunting and the dog for (the security) of the herd, and said: When the dog licks the utensil, wash it seven times, and rub it with earth the eighth time.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "11305"
      ]
    },
    {
      "hadith_no": "305",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، قال حدثنا أبي قال، حدثنا شعبة، بهذا الإسناد قال ابن المثنى في حديثه حدثنا الحكم، سمعت إبراهيم، يحدث ‏.‏",
      "text_en": " This hadith has been transmitted by Shu'ba with the same chain of transmitters. Ibn at-Muthanna said in his narration:                      AI-Hakam narrated to us who heard from Ibrahim narrating that.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "11069",
        "11051"
      ]
    },
    {
      "hadith_no": "320",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني عبيد الله بن معاذ العنبري، قال حدثنا أبي قال، حدثنا شعبة، عن أبي بكر بن حفص، عن أبي سلمة بن عبد الرحمن، قال دخلت على عائشة أنا وأخوها، من الرضاعة فسألها عن غسل النبي، صلى الله عليه وسلم من الجنابة فدعت بإناء قدر الصاع فاغتسلت وبيننا وبينها ستر وأفرغت على رأسها ثلاثا ‏.‏ قال وكان أزواج النبي صلى الله عليه وسلم يأخذن من رءوسهن حتى تكون كالوفرة ‏.‏",
      "text_en": " Abu Salamab. 'Abd al-Rahman reported:                      I along with the foster brother of 'A'isha went to her and he asked about the bath of the Apostle (may peace be upon him) because of sexual intercourse. She called for a vessel equal to a Sa' and she took a bath. and there was a curtain between us and her. She poured water on her head thrice and he (Abu Salama) said: The wives of the Apostle (may peace be upon him) collectedhair on their heads and these lopped up to ears (and did rot go beyond that).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11180",
        "10567"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - قالا حدثنا شعبة، عن عبد الله بن عبد الله بن جبر، قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم يغتسل بخمس مكاكيك ويتوضأ بمكوك ‏.‏ وقال ابن المثنى بخمس مكاكي ‏.‏ وقال ابن معاذ عن عبد الله بن عبد الله ولم يذكر ابن جبر ‏.‏",
      "text_en": " Anas reported that the Messenger of Allah (may peace he upon him) took a bath with five Makkuks of water and performed ablution with one Makkuk. Ibn Muthanna has used the words five Makakiyya, and Ibn Mu'adh narrated it from 'Abdullah b. 'Abdullah and he made no mention of Ibn Jabr.",
      "chain": [
        "30150",
        "20286",
        "30170",
        "20033",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، في هذا الإسناد نحوه وقال قال ‏\"‏ سبحان الله تطهري بها ‏\"‏ ‏.‏ واستتر ‏.‏",
      "text_en": " This hadith is narrated by 'Ubaidullah b. Mu'adh with the same chain of transmitters (but for the words) that he (the Holy Prophet) said:                      Cleanse yourself with it, and he covered (his face on account of shyness).",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "344",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا المعتمر، حدثنا أبي، حدثنا أبو العلاء بن الشخير، قال كان رسول الله صلى الله عليه وسلم ينسخ حديثه بعضه بعضا كما ينسخ القرآن بعضه بعضا ‏.‏",
      "text_en": " Abu al. 'Ala' b. al-Shikhkhir said:                      The Messenger of Allah (may peace be upon him) abrogated some of his commands by others, just as the Qur'an abrogates some part with the other.",
      "chain": [
        "30150",
        "20288",
        "11289",
        "11318"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد العزيز بن صهيب، سمع أنس بن مالك، قال أقيمت الصلاة والنبي صلى الله عليه وسلم يناجي رجلا فلم يزل يناجيه حتى نام أصحابه ثم جاء فصلى بهم ‏.‏",
      "text_en": " Anas b. Malik reported:                      (The people) stood up for prayer and the Apostle of Allah (may peace be upon him) was talking in whispers with a man, and he did not discontinue the conversation till his Companions dozed off; he then came and led the prayer.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، وعبد الرحمن بن الربيع بن مسلم، جميعا عن الربيع بن مسلم، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن حماد بن سلمة، كلهم عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا غير أن في حديث الربيع بن مسلم ‏\"‏ أن يجعل الله وجهه وجه حمار ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Abu Huraira by another chain of transmitters except for the words narrated by Rabi' b. Muslim:                     \" Allah may make his face like the face of an ass.\"",
      "chain": [
        "20540",
        "30150",
        "20286",
        "20020",
        "30201",
        "20032",
        "20021",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، قال سمعت البراء، يحدث عن النبي صلى الله عليه وسلم أنه كان في سفر فصلى العشاء الآخرة فقرأ في إحدى الركعتين ‏{‏ والتين والزيتون‏}‏",
      "text_en": " 'Adi reported:                      I heard al-Bara' narrating it from the Apostle of Allah (may peace be upon him) that while in a journey he said the night prayer and recited in one of the two rak'ahs:\" By the Fig and the Olive\" (Su'rah xcv.).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، قال غلب على الكوفة رجل - قد سماه - زمن ابن الأشعث فأمر أبا عبيدة بن عبد الله أن يصلي بالناس فكان يصلي فإذا رفع رأسه من الركوع قام قدر ما أقول اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏.‏ قال الحكم فذكرت ذلك لعبد الرحمن بن أبي ليلى فقال سمعت البراء بن عازب يقول كانت صلاة رسول الله صلى الله عليه وسلم وركوعه وإذا رفع رأسه من الركوع وسجوده وما بين السجدتين قريبا من السواء ‏.‏ قال شعبة فذكرته لعمرو بن مرة فقال قد رأيت ابن أبي ليلى فلم تكن صلاته هكذا ‏.‏",
      "text_en": " Hakam reported:                      There dominated in Kufa a man whose name was men- tioned as Zaman b. al-Ash'ath, who ordered Abu 'Ubaidah b. 'Abdullah to lead people in prayer and he accordingly used to lead them. Whenever he raised his head after bowing, he stood up equal to the time that I can recite (this supplication): O Allah! our Lord! unto Thee be the praise which would fill the heavens and the earth, and that which will please Thee besides them I Worthy art Thou of all praise and glory. None can prevent that which Thou bestowest, and none can bestow that whichthou preventest. And the greatness of the great will not avail him against Thee. Hakam (the narrator) said: I made a mention of that to Abd al-Rahman ibn Abi Laila who reported: I heard al-Bara' b. 'Azib say that the prayer of the Messenger of Allah (may peace be upon him) and his bowing, and when he lifted his head from bowing, and his prostration, and between the two prostrations (all these acts) were nearly proportionate. I made a mention of that to 'Ar b. Murrah and he said: I saw Ibn Abi Laili (saying the prayer), but his prayer was not like this.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، قال وحدثني زهير بن حرب، حدثنا يزيد بن هارون، كلاهما عن شعبة، بهذا الإسناد في رواية معاذ ‏\"‏ كما ينقى الثوب الأبيض من الدرن ‏\"‏ ‏.‏ وفي رواية يزيد ‏\"‏ من الدنس ‏\"‏ ‏.‏",
      "text_en": " This hadith with the same chain of transmitters has been narrated by Shu'ba, and in the narration of Mu'adh the words are:                     \" just as the white garment is cleansed from filth,\" and in the narration of Yazid:\" from dirt\".",
      "chain": [
        "30150",
        "20286",
        "30022",
        "20472"
      ]
    },
    {
      "hadith_no": "1202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني أبو التياح، عن أنس، أن رسول الله صلى الله عليه وسلم كان يصلي في مرابض الغنم قبل أن يبنى المسجد ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) used to pray in the folds of the sheep and goats before the mosque was built.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا كهمس، عن يزيد بن عبد الله بن الشخير، عن أبيه، قال صليت مع رسول الله صلى الله عليه وسلم فرأيته تنخع فدلكها بنعله ‏.‏",
      "text_en": " Abdullah b. Shakhkhir reported on the authority of his father that he said:                      I said prayer with the Messenger of Allah (may peace be upon him) and saw him spitting and rubbing it off with his shoe.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "11318",
        "5130"
      ]
    },
    {
      "hadith_no": "1309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم صلى الظهر خمسا فلما سلم قيل له أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ فسجد سجدتين ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      The Apostle of Allah (may peace be upon him) said five rak'ahs of the noon prayer and when he completed the prayer, It was said to him: Has there been (commanded) an addition In prayer? He said: What is it? They said: You have said five rak'ahs, so he performed two prostrations.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبيد الله بن معاذ، ومحمد بن عبد الأعلى، قالا حدثنا المعتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة صلاة العتمة فقرأ ‏{‏ إذا السماء انشقت‏}‏ فسجد فيها ‏.‏ فقلت له ما هذه السجدة فقال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ‏.‏ وقال ابن عبد الأعلى فلا أزال أسجدها ‏.‏",
      "text_en": " Abu Rafi' reported:                      I said the night prayer along with Abu Huraira and -as he recited:\" When the heaven burst asunder,\" he performed prostration. Isaid to him: What prostration is this? He said: I prostrated myself (on this occasion of recital) behind Abu'I-Qasim (Muhammad. may peace be upon him), and Iwould go on doing this till I meet him (in the next world). Ibn 'Abu al-A'la said: (Abu Huraira uttered this: ) I would not abandon performing prostration.",
      "chain": [
        "30150",
        "30449",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "hadith_no": "1417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن قتادة، عن أبي أيوب، - واسمه يحيى بن مالك الأزدي ويقال المراغي والمراغ حى من الأزد - عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال ‏\"‏ وقت الظهر ما لم يحضر العصر ووقت العصر ما لم تصفر الشمس ووقت المغرب ما لم يسقط ثور الشفق ووقت العشاء إلى نصف الليل ووقت الفجر ما لم تطلع الشمس ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Amr reported the Apostle (may peace be upon him) saying:                      The time of the noon prayer (lasts) as long as it is not afternoon, and the time of the afternoon prayer (lasts) as long as the sun does not turn pale and the time of the evening prayer (lasts) as long as the spreading appearance of the redness above the horizon after sunset does not sink down, and the, time of the night prayer (lasts) by midnight and the time of the morning prayer (lasts) as long as the sun dots not rise.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "29"
      ]
    },
    {
      "hadith_no": "1493",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد، سمع محمد بن عمرو بن الحسن بن علي، قال كان الحجاج يؤخر الصلوات فسألنا جابر بن عبد الله بمثل حديث غندر ‏.‏",
      "text_en": " Muhammad b. 'Amr al-Hasan b. 'All reported:                      Hajjaj used to delay the prayers, and so we asked Jabir b. 'Abdullah, and the rest of the hadith is the same.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "9",
        "11220"
      ]
    },
    {
      "hadith_no": "1495",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سيار بن سلامة، قال سمعت أبا برزة، يقول كان رسول الله صلى الله عليه وسلم لا يبالي بعض تأخير صلاة العشاء إلى نصف الليل وكان لا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته مرة أخرى فقال أو ثلث الليل ‏.‏",
      "text_en": " Sayyar b. Salama reported:                      I heard Abu Barza saying that the Messenger of Allah (may peace be upon him) did not mind some delay in the 'Isha' prayer even up to midnight and he did not like sleeping before (observing it) and talking after it. Shu'ba said: I again met him (Sayyar b. Salama) for the second time and he said: Even up to the third (part) of the night.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "1534",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن المختار، سمع موسى بن أنس، يحدث عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم صلى به وبأمه أو خالته ‏.‏ قال فأقامني عن يمينه وأقام المرأة خلفنا ‏.‏",
      "text_en": " Abdullah b. al-Mukhtar heard Musa b. Anas narrating on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) led him, his mother or his aunt in prayer. He made me, stand on his right side and made the woman stand, behind us.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "24244",
        "14383",
        "19"
      ]
    },
    {
      "hadith_no": "1579",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني عبيد الله بن معاذ العنبري، وأبو كريب وإسحاق بن إبراهيم ومحمد بن عبد الأعلى - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، عن أبيه، عن أبي مجلز، عن أنس بن مالك، قنت رسول الله صلى الله عليه وسلم شهرا بعد الركوع في صلاة الصبح يدعو على رعل وذكوان ويقول ‏\"‏ عصية عصت الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) observed Qunut for a month in the dawn prayer after ruku' and invoked curse upon Ri'l, Dhakwan, and said that 'Usayya had disobeyed Allah and His Apostle (may peace be upon him).",
      "chain": [
        "30150",
        "20288",
        "11289",
        "11313"
      ]
    },
    {
      "hadith_no": "1620",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، قال حدثني يحيى بن أبي إسحاق، قال سمعت أنس بن مالك، يقول خرجنا من المدينة إلى الحج ‏.‏ ثم ذكر مثله ‏.‏",
      "text_en": " Yahya b. Abu Ishaq reported:                      I heard Anas b. Malik say: We went out for Pilgrimage from Medina. The rest is the same.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1626",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن خبيب بن عبد الرحمن، سمع حفص بن عاصم، عن ابن عمر، قال صلى النبي صلى الله عليه وسلم بمنى صلاة المسافر وأبو بكر وعمر وعثمان ثماني سنين أو قال ست سنين ‏.‏ قال حفص وكان ابن عمر يصلي بمنى ركعتين ثم يأتي فراشه ‏.‏ فقلت أى عم لو صليت بعدها ركعتين ‏.‏ قال لو فعلت لأتممت الصلاة ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The Apostle of Allah (may peace be upon him) said in Mina the prayer of a traveller (short prayer) ; Abu Bakr and 'Umar did the same and 'Uthmia did it for eight years or six years. Hafs (one of the narrators) said: Ibn 'Umar would also say two rak'ahs at Mina and then go to bed. I said to him: O uncle, I wish you could have said two rak'ahs (of Sunnah prayer after shorenting the Fard prayer). He said: Were I to do that, I would have completed the prayer.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11159",
        "11420",
        "18"
      ]
    },
    {
      "hadith_no": "1690",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محارب، سمع جابر بن عبد الله، يقول اشترى مني رسول الله صلى الله عليه وسلم بعيرا فلما قدم المدينة أمرني أن آتي المسجد فأصلي ركعتين ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      The Messenger of Allah (may peace be upon him) bought a camel from me. When he came back to Medina, he ordered me to come to the mosque and observed two rak'ahs of prayer.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "1694",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس بن الحسن القيسي، عن عبد الله بن شقيق، قال قلت لعائشة أكان النبي صلى الله عليه وسلم يصلي الضحى قالت لا إلا أن يجيء من مغيبه",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I aksed 'A'isha whether the Apostle of Allah (may peace be upon him) used to observe the forenoon prayer. She said: No, except when he came back from a journey.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1718",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن عبد الرحمن الأنصاري، سمع عمرة بنت عبد الرحمن، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر صلى ركعتين أقول هل يقرأ فيهما بفاتحة الكتاب ‏.‏",
      "text_en": " 'A'isha reported:                      When it was dawn, the Messenger of Allah (may peace be upon him) observed two rak'ahs, and I would say: Does he recite only the opening chapter of the Qur'an in it?",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1743",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن عبد الله بن شقيق، قال قلت لعائشة ‏.‏ فذكر عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) died (in this very state) that he observed most of his (Nafl) prayers in a sitting position.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1823",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد ‏.‏ نحوه ولم يذكر إنما شك شعبة ‏.‏ وما بعده ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent a night with my material aunt (sister of my mother) Maimuna. The Apostle of Allah (may peace be upon him) got up during the night and relieved himself, then washed his face and hands and went to sleep. He then got up again, and came to the water skin and loosened its straps, then performed good ablution between the two extremes. He then stood up and observed prayer. I also stood up and stretched my body fearing that he might be under the impression that I was there to find out (what he did at night). So I also performed ablution and stood up to pray, but I stood on his left. He took hold of my hand and made me go round to his right side. The Messenger of Allah (may peace be upon him) completed thirteen rak'abs of his night prayer. He then lay down and slept and snored (and it was his habit to snore while asleep). Then Bilal came and he informed him about the prayer. He (the Holy Prophet) then stood up for prayer and did not perform ablution, and his supplication included there words:\" O Allah, place light in my heart, light in my sight, light in my hearing, light on my right hand, light on my left hand, light above me, light below me, light in front of me, light behind me, and enhance light for me.\" Kuraib (the narrator) said: There are seven (words more) which are in my heart (but I cannot recall them) and I met some of the descendants of 'Abbas and they narrated these words to me and mentioned in them: (Light) in my sinew, in my flesh, in my blood, in my hair, in my skin, and made a mention of two more things.",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "1891",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، ح وحدثنا عبيد، الله بن معاذ حدثنا أبي قالا، حدثنا شعبة، بهذا الإسناد نحوه وفي حديث خالد بن الحارث قال على راحلة يسير وهو يقرأ سورة الفتح ‏.‏",
      "text_en": " Al-Bara' reported that a person was reciting Surat al-Kahf and there was a horse tied with two ropes at his side, a cloud overshadowed him, and as it began to come nearer and nearer his horse began to take fright from it. He went and mentioned that to the Prophet (may peace be upon him) in the morning, and he (the Holy Prophet) said:                      That was tranquillity which came down at the recitation of the Qur'an.",
      "chain": [
        "20226",
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "1944",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد مثله ‏.‏",
      "text_en": " Abu Wa'il reported that a person named Nabik b. Sinan came to Abdullah (b. Mas'ud) and said:                      Abu 'Abd al-Rahman, how do you recite this word (alif) or (ya)? Would you read It as: min ma'in ghaira asin or au min ma'in ghaira ghaira yasin. (al-Qur'an, xlvii. 15)? 'Abdullah said: You (seem to) have memorised the whole of the Qur'an except this. He (again) said: I recite all the mufassal surahs in one rak'ah. Upon this 'Abdullah said: (You must have been reciting It) hastily like the recitation of poetry. Verily. there are people who recite the Qur'an, but it does not go down beyond their collar bones. It is (a fact with the Qur'an) that it is beneficial only when it settles in the heart and is rooted deeply in it. The best of (the acts) in prayer are bowing and prostration. I am quite aware of the occasions when the Messenger of Allah (may peace be upon him) combined together two surahs in every rak'ah. 'Abdullah then stood up and went out with 'Alqama following in his footstep. He said Ibn Numair had told him that the narration was like that:\" A person belonging to Banu Bajila came to 'Abdullah,\" and he did not mention (the name of) Nahik b. Sinan.",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "1984",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن، القاسم عن أبيه، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بأصحابه في الخوف فصفهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Yazid b. Ruman told on the authority of Salih b. Khawwat on the authority of one who prayed in time of danger with Allah's Messenger (may peace he upon him) at the Battle of Dhat ar-Riqa' that a group formed a row and prayed along with him, and a group faced the enemy. He led the group which was along with him in a rak'ah, then remained standing while they finished the prayer by themselves. Then they departed and formed a row facing the enemy. Then the second group came and he led them in the remaining rak'ah, after which he remained seated while they finished the prayer themselves. He then led them in salutation.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "hadith_no": "2094",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، عن سعيد، بن جبير عن ابن عباس، أن رسول الله صلى الله عليه وسلم خرج يوم أضحى أو فطر فصلى ركعتين لم يصل قبلها ولا بعدها ثم أتى النساء ومعه بلال فأمرهن بالصدقة فجعلت المرأة تلقي خرصها وتلقي سخابها ‏.‏  وحدثنيه عمرو الناقد، حدثنا ابن إدريس، ح وحدثني أبو بكر بن نافع، ومحمد، بن بشار جميعا عن غندر، كلاهما عن شعبة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) went out on the day of Adha or Fitr and observed two rak'ahs, and did not observe prayer (at that place) before and after that. He then came to the women along with Bilal and commanded them to give alms and the women began to give their rings and necklaces. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، ويحيى بن حبيب، قالا حدثنا معتمر، عن إسماعيل، عن قيس، عن أبي مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الشمس والقمر ليس ينكسفان لموت أحد من الناس ولكنهما آيتان من آيات الله فإذا رأيتموه فقوموا فصلوا ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud reported that the Messenger of Allah (may peace be upon him) said:                      Verily the sun and the moon do not eclipse on account of the death of any one of the people, but they are the two signs among the signs of Allah. So when you see it, stand up and observe prayer.",
      "chain": [
        "30150",
        "20288",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "2256",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا حسن بن الربيع، وأبو كامل قالا حدثنا عبد الواحد بن زياد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثني محمد بن حاتم، حدثنا وكيع، حدثنا سفيان، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، قال حدثنا شعبة، كل هؤلاء عن الشيباني، عن الشعبي، عن ابن عباس، عن النبي صلى الله عليه وسلم بمثله وليس في حديث أحد منهم أن النبي صلى الله عليه وسلم كبر عليه أربعا ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters, but in one of them (these words are found):                     \" The Apostle of Allah (may peace be upon him) recited four takbirs.\"",
      "chain": [
        "30399",
        "20468",
        "20256",
        "30123",
        "4057",
        "38487",
        "20032",
        "20012",
        "30150",
        "20286",
        "30170",
        "20173"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - عن عبد الله بن يزيد، عن أبي مسعود البدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المسلم إذا أنفق على أهله نفقة وهو يحتسبها كانت له صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud reported Allah's Messenger (way peace be upon him) as saying:                      When a Muslim spends on his family seeking reward for it from Allah, it counts for him as sadaqa.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "1945",
        "402"
      ]
    },
    {
      "hadith_no": "2399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا عبيد الله بن معاذ، العنبري حدثنا أبي قالا، جميعا حدثنا شعبة، حدثني عون بن أبي جحيفة، قال سمعت المنذر بن جرير، عن أبيه، قال كنا عند رسول الله صلى الله عليه وسلم صدر النهار ‏.‏ بمثل حديث ابن جعفر وفي حديث ابن معاذ من الزيادة قال ثم صلى الظهر ثم خطب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mandhir through another chain of transmitters. And the hadith transmitted by Ibn Mu'adh contains an addition:                     \" He then observed the noon prayer and then gave the sermon.\"",
      "chain": [
        "30201",
        "20318",
        "30150",
        "20286",
        "20020",
        "11383",
        "10831"
      ]
    },
    {
      "hadith_no": "2489",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ، وحامد بن عمر، ومحمد بن عبد الأعلى، قال ابن معاذ حدثنا المعتمر بن سليمان، عن أبيه، قال حدثني السميط، عن أنس بن مالك، قال افتتحنا مكة ثم إنا غزونا حنينا فجاء المشركون بأحسن صفوف رأيت - قال - فصفت الخيل ثم صفت المقاتلة ثم صفت النساء من وراء ذلك ثم صفت الغنم ثم صفت النعم - قال - ونحن بشر كثير قد بلغنا ستة آلاف وعلى مجنبة خيلنا خالد بن الوليد - قال - فجعلت خيلنا تلوي خلف ظهورنا فلم نلبث أن انكشفت خيلنا وفرت الأعراب ومن نعلم من الناس - قال - فنادى رسول الله صلى الله عليه وسلم ‏\"‏ يا للمهاجرين يا للمهاجرين ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا للأنصار يا للأنصار ‏\"‏ ‏.‏ قال قال أنس هذا حديث عمية ‏.‏ قال قلنا لبيك يا رسول الله - قال - فتقدم رسول الله صلى الله عليه وسلم - قال - فايم الله ما أتيناهم حتى هزمهم الله - قال - فقبضنا ذلك المال ثم انطلقنا إلى الطائف فحاصرناهم أربعين ليلة ثم رجعنا إلى مكة فنزلنا - قال - فجعل رسول الله صلى الله عليه وسلم يعطي الرجل المائة من الإبل ‏.‏ ثم ذكر باقي الحديث كنحو حديث قتادة وأبي التياح وهشام بن زيد ‏.‏",
      "text_en": " Anas b. Malik reported:                      We conquered Mecca and then we went on an expedition to Hunain. The polytheists came, forming themselves into the best rows that I have seen. They first formed the rows of cavalry, then those of infantry, and then those of women behind them. Then there were formed the rows of sheep and goats and then of other animals. We were also people large in number, and our (number) had reached six thousand. And on one side Khalid b. Walid was in charge of the cavalry. And our horses at once turned back from our rear. And we could hardly hold our own when our horses were exposed, and the bedouins and the peoplewhom we knew took to their heels. (Seeing this) the Messenger of Allah (may peace be upon him) called thus: 0 refugees,0 refugees. He then. said: 0 Ansar,0 Ansar. (Anas said: This hadith is transmitted by a group of eminent persons.) We said: At thy beck and call are we, Messenger of Allah. The Messenger of Allah (may peace be upon him) then advanced and he (Anas) said: By Allah, we had not yet reached them when Allah defeated them. and we took possession of the wealth and we then marched towards Ta'if, and we besieged them for forty nights. and then came back to Mecca and encamped (at a place), and the Messenger of Allah (may peace be upon him) began to bestow a hundred camels upon each individual. The rest of the hadith is the same.",
      "chain": [
        "30150",
        "30128",
        "30449",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "2522",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن محمد، - وهو ابن زياد - سمع أبا هريرة، يقول أخذ الحسن بن علي تمرة من تمر الصدقة فجعلها في فيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ كخ كخ ارم بها أما علمت أنا لا نأكل الصدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Hasan b. 'Ali took one of The dates of the sadaqa and put it in his mouth, whereupon the Prophet (may peace be upon him) said:                      Leave it, leave it, throw it; don't you know that we do not eat the sadaqa?",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2536",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثنا محمد بن المثنى، وابن بشار - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة، وأتي النبي، صلى الله عليه وسلم بلحم بقر فقيل هذا ما تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that (once) the Apostle of Allah (may peace be upon him, ) was presented with beef. It was said (by someone) that it had been given to Barira as Sadaqa. Upon this he (the Prophet) said:                      It is a Sadaqa for her and a gift for us.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "30170",
        "20173",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2561",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن جبلة، قال سمعت ابن، عمر - رضى الله عنهما - يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر كذا وكذا وكذا ‏\"‏ ‏.‏ وصفق بيديه مرتين بكل أصابعهما ونقص في الصفقة الثالثة إبهام اليمنى أو اليسرى ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month is thus, and thus, and thus, and he flapped his hands with all their fingers twice. but at the third turn, folded his right thumb or left thumb (in order to give an idea of twenty-nine).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "18"
      ]
    },
    {
      "hadith_no": "2568",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن زياد، قال سمعت أبا هريرة، - رضى الله عنه - يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صوموا لرؤيته وأفطروا لرؤيته فإن غمي عليكم الشهر فعدوا ثلاثين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Observe fast on sighting it (the new moon) and break it on sighting it. But if (due to clouds) the actual position of the month is concealed from you, you should then count thirty (days).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2599",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سوادة، قال سمعت سمرة، بن جندب - رضى الله عنه - وهو يخطب يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يغرنكم نداء بلال ولا هذا البياض حتى يبدو الفجر - أو قال - حتى ينفجر الفجر ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub addressed and narrated from the Apostle of Allah (may peace be upon him) having said (these words):                      Neither the call of Bilal should mislead you nor this whiteness (of false dawn) till (the true) dawn appears (or he said) till the dawn breaks.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "394"
      ]
    },
    {
      "hadith_no": "2616",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا ابن أبي عمر، أخبرنا سفيان، ح وحدثنا إسحاق، أخبرنا جرير، كلاهما عن الشيباني، عن ابن أبي أوفى، ح . وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن المثنى، حدثنا محمد بن، جعفر قالا حدثنا شعبة، عن الشيباني، عن ابن أبي أوفى، - رضى الله عنه - عن النبي صلى الله عليه وسلم بمعنى حديث ابن مسهر وعباد وعبد الواحد وليس في حديث أحد منهم في شهر رمضان ولا قوله ‏\"‏ وجاء الليل من ها هنا ‏\"‏ ‏.‏ إلا في رواية هشيم وحده ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Abi Aufa (Allah be pleased with him) through another chain of transmitters (but with a sight alteration of words):                      In this hadith transmitted by one of the narrators (neither these words are found): During the month of Ramadan.\" nor his statement:\" And the night prevails from that side (the eastern side).\" (These words are found in the narration of) Hushaim only.",
      "chain": [
        "30421",
        "20005",
        "30312",
        "11352",
        "5115",
        "30150",
        "20286",
        "20173",
        "20020",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2669",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن عبد الرحمن، قال سمعت محمد بن عمرو بن الحسن، يحدث أنه سمع جابر بن عبد الله، - رضى الله عنهما - يقول رأى رسول الله صلى الله عليه وسلم رجلا بمثله ‏.‏",
      "text_en": " 'Amr b. al-Hasan is reported to have said that he heard Jabir b. 'Abdullah (Allah be pleased with both of them) as saying that the Messenger of Allah (may peace be upon him) saw a man. The rest of the hadith is the same as mentioned above.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11105",
        "11863",
        "34"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن عبد الله بن شقيق، قال قلت لعائشة - رضى الله عنها - أكان رسول الله صلى الله عليه وسلم يصوم شهرا كله قالت ما علمته صام شهرا كله إلا رمضان ولا أفطره كله حتى يصوم منه حتى مضى لسبيله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I said to 'A'isha (Allah be pleased with her): Did the Messenger of Allah (may peace be upon him) observe fast during a month? She said, I do not know of any month in which he fasted throughout except Ramedan and (the month) in which he did not fast at all till he ran the course of his life. May peace be upon him.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "2793",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثني أبي، حدثنا شعبة، عن حبيب، سمع أبا العباس، سمع عبد الله بن عمرو، - رضى الله عنهما - قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله بن عمرو إنك لتصوم الدهر وتقوم الليل وإنك إذا فعلت ذلك هجمت له العين ونهكت لا صام من صام الأبد صوم ثلاثة أيام من الشهر صوم الشهر كله ‏\"‏ ‏.‏ قلت فإني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ فصم صوم داود كان يصوم يوما ويفطر يوما ولا يفر إذا لاقى ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Amr (Allah be pleased with both of them) reported:                      The Messenger of Allah (may peace be upon him) said to me: 'Abdullah b. Amr, you fast continuously and stand in prayer for the whole of night. If you do like that, your eyes would be highly strained and would sink and lose sight. There is no (reward for) fasting (for him) who fasts perpetually. Fasting for three days during the month is like fasting, the whole of the month. I said: I am capable of doing more than this, whereupon he said: Observe the fast of David. He used to fast one day and break (the other) day. And he did not turn back in the encounter.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11276",
        "29"
      ]
    },
    {
      "hadith_no": "2805",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، كلهم عن شعبة، بهذا الإسناد‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30201",
        "20426",
        "30123",
        "20291"
      ]
    },
    {
      "hadith_no": "2906",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه يحيى بن يحيى، أخبرنا المعتمر بن سليمان، قال سمعت منصورا، يحدث عن الحكم، ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن حبيب، جميعا عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - في رواية منصور عن الحكم أهدى الصعب بن جثامة إلى النبي صلى الله عليه وسلم رجل حمار وحش ‏.‏ وفي رواية شعبة عن الحكم عجز حمار وحش يقطر دما ‏.‏ وفي رواية شعبة عن حبيب أهدي للنبي صلى الله عليه وسلم شق حمار وحش فرده ‏.‏",
      "text_en": " The narration transmitted by Hakam (the words are):                      Al-Sa'b b. Jaththama presented to the Apostle of Allah (may peace be upon him) the leg of a wild ass. And in the narration transmitted by Shu'ba (the words are): (He presented to him) the rump of a wild ass as the blood was trickling from it. In the narration transmitted by Shu'ba on the authority of Habib (the words are): A part of a wild ass was presented to the Apostle (may peace he upon him) and he returned it to him (who presented it).",
      "chain": [
        "30399",
        "20288",
        "11067",
        "11069",
        "30170",
        "30160",
        "20173",
        "20020",
        "11069",
        "30150",
        "20286",
        "20020",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2991",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن الحكم، سمع علي بن، الحسين عن ذكوان، عن عائشة، - رضى الله عنها - قالت قدم النبي صلى الله عليه وسلم لأربع أو خمس مضين من ذي الحجة ‏.‏ بمثل حديث غندر ولم يذكر الشك من الحكم في قوله يترددون ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported that the Apostle of Allah (may peace be upon him) came out (for Pilgrimage) on The 4th or 5th of Dbu'l Hjjja. The rest of the hadith is the same, but he (the narrator) made no mention of the doubt of Hakam about his (the Prophet's) words:                     \" They were reluctant.\"",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069",
        "11045",
        "11161",
        "53"
      ]
    },
    {
      "hadith_no": "3017",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، في هذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "3033",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن حميد بن هلال، عن مطرف، قال قال لي عمران بن حصين أحدثك حديثا عسى الله أن ينفعك به إن رسول الله صلى الله عليه وسلم جمع بين حجة وعمرة ثم لم ينه عنه حتى مات ولم ينزل فيه قرآن يحرمه وقد كان يسلم على حتى اكتويت فتركت ثم تركت الكى فعاد ‏.‏",
      "text_en": " Imran b. Husain reported:                      I am narrating to you a hadith by which Allah will benefit you (and the hadith is) that Allah's Messenger (may peace be upon him) combined Hajj and 'Umra, and he did not forbid (this combination) till he died. (Moreover) nothing was revealed in the Holy Qur'an which forbade it. And I was always blessed till I was branded and then it (blessing) was abandoned. I then abandoned branding and it (the blessing was restored).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11281",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "3066",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، حدثنا مسلم القري، سمع ابن عباس، - رضى الله عنهما - يقول أهل النبي صلى الله عليه وسلم بعمرة وأهل أصحابه بحج فلم يحل النبي صلى الله عليه وسلم ولا من ساق الهدى من أصحابه وحل بقيتهم فكان طلحة بن عبيد الله فيمن ساق الهدى فلم يحل ‏.‏",
      "text_en": " Muslim al-Qurri heardlbn 'Abbas (Allah be pleased with them) saying that Allah's Apostle (may peace be upon him) entered into the state of Ihram for Umra and his Companions for Hajj. Neither Allah's Apostle (may peace be upon him) nor those among his Companions who had brought sacrificial animals with them put off Ihram, whereas the rest (of the pilgrims) did so. Talha b. Ubaidullah was one of those who had brought the sacrificial animals along with them so he did not put off Ihram.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "17"
      ]
    },
    {
      "hadith_no": "3195",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد غير أنه قال فلما أتى جمرة العقبة ‏.‏",
      "text_en": " This hadith nas been narrated on the authority of Shu'ba with the same chain of transmitters except with this variation of (words):                      As he came to Jamrat al-'Aqaba.\"",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "3422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبيد الله بن معاذ، - وهو العنبري - حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - سمع عبد الله بن يزيد، عن زيد بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنها طيبة - يعني المدينة - وإنها تنفي الخبث كما تنفي النار خبث الفضة‏\"‏ ‏.‏",
      "text_en": " Zaid b. Thabit reported Allah's Apostle (may peace be upon him) as saying:                      It is Taiba, thereby meaning Medina. It drives away impurity just as fire removes the impurity of silver.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "1945",
        "49"
      ]
    },
    {
      "hadith_no": "3438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا قرة بن خالد، عن قتادة، حدثنا أنس، بن مالك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحدا جبل يحبنا ونحبه ‏\"‏ ‏.‏",
      "text_en": "  Anas b. Malik (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:                      Uhud is a mountain which loves us and which we love.",
      "chain": [
        "30150",
        "20286",
        "11301",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3653",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، عن عراك، بن مالك عن عروة، عن عائشة، قالت استأذن على أفلح بن قعيس فأبيت أن آذن، له فأرسل إني عمك أرضعتك امرأة أخي ‏.‏ فأبيت أن آذن له فجاء رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ ليدخل عليك فإنه عمك ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Aflah b. Qu'ais sought permission from me (to enter the house), but I refused to grant him the permission, and he sent me (the message saying): I am your uncle (in the sense) that the wife of my brother has suckled you, (but still) I refused to grant him permission. There came the Messenger of Allah (may peace be upon him) and I made a mention of it to him, and he said: He can enter (your house), for he is your uncle.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069",
        "11204",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي قالا، جميعا حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، جميعا عن سفيان، ح وحدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، كلهم عن أشعث بن أبي الشعثاء، بإسناد أبي الأحوص كمعنى حديثه غير أنهم قالوا ‏\"‏ من المجاعة ‏\".",
      "text_en": " This hadith is narrated on the authority of Abu al-Ahwas with another chain of transmitters and a slight variation of words.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "20020",
        "30201",
        "20032",
        "30022",
        "20005",
        "30553",
        "20315"
      ]
    },
    {
      "hadith_no": "3710",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محارب، عن جابر بن، عبد الله قال تزوجت امرأة فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ هل تزوجت ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ أبكرا أم ثيبا ‏\"‏ ‏.‏ قلت ثيبا ‏.‏ قال ‏\"‏ فأين أنت من العذارى ولعابها ‏\"‏ ‏.‏ قال شعبة فذكرته لعمرو بن دينار فقال قد سمعته من جابر وإنما قال ‏\"‏ فهلا جارية تلاعبها وتلاعبك ‏\"‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      I married a woman, whereupon Allah's Messenger (may peace be upon him) said to me: Have you married? I said: Yes. He said: Is it a virgin or a previously married one (widow or divorced)? I said: With a previously married one, whereupon he said: Where had you been (away) from the amusements of virgins? Shu'ba said: I made a mention of it to 'Amr b. Dinar and he said: I too heard from Jabir making mention of that (that Allah's Apostle) said: Why didn't you marry a girl, so that you might sport with her and she might sport with you?",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "3788",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني أبو بكر، قال دخلت أنا وأبو سلمة على فاطمة بنت قيس زمن ابن الزبير فحدثتنا أن زوجها طلقها طلاقا باتا ‏.‏ بنحو حديث سفيان ‏.‏",
      "text_en": " Abu Bakr reported:                      I and Abu Salama came to Fatima bint Qais (Allah be pleased with her) during the time of Ibn Zubair (Allah be pleased with him) and she narrated to us that her husband gave her an irrevocable divorce. (The rest of the hadith is the same.)",
      "chain": [
        "30150",
        "20286",
        "20020",
        "20436"
      ]
    },
    {
      "hadith_no": "3805",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن حميد بن نافع، بالحديثين جميعا حديث أم سلمة في الكحل وحديث أم سلمة وأخرى من أزواج النبي صلى الله عليه وسلم غير أنه لم تسمها زينب نحو حديث محمد بن جعفر ‏.‏",
      "text_en": " Humaid b. Nafi' narrated two traditions from Umm Salama dealing with collyrium and the other hadith from the wives of Allah's Prophet (may peace be upon him) except with this that no mention was made of Zainab.",
      "chain": [
        "30150",
        "20286",
        "20020"
      ]
    },
    {
      "hadith_no": "3891",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن التلقي للركبان وأن يبيع حاضر لباد وأن تسأل المرأة طلاق أختها وعن النجش والتصرية وأن يستام الرجل على سوم أخيه ‏.‏",
      "text_en": "  Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) forbade the (people) meeting the caravan (for entering into business transaction with them), and the selling of goods by a townsman on behalf of a man of the desert, and seeking by a woman the divorce of her sister (from her husband), and outbidding (against one another), and tying up the udders (of animals), and buying of (things) in opposition to one's brother.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، سمع مطرف، بن عبد الله عن ابن المغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب ثم قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ ثم رخص في كلب الصيد وكلب الغنم ‏.‏",
      "text_en": "  Ibn Mughaffal reported:                      Allah's Messenger (may peace be upon him) ordered the killing of dogs and then said: what is the trouble with them (the people of Medina)? How dogs are nuisance to them (the citizens of Medina)? He then permitted keehing of dogs for hunting and (the protection of) herds.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "11305"
      ]
    },
    {
      "hadith_no": "4156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن حبيب، أنه سمع أبا المنهال، يقول سألت البراء بن عازب عن الصرف، فقال سل زيد بن أرقم فهو أعلم ‏.‏ فسألت زيدا فقال سل البراء فإنه أعلم ثم قالا نهى رسول الله صلى الله عليه وسلم عن بيع الورق بالذهب دينا.",
      "text_en": " Habib reported that he heard Abu Minhal as saying:                      I asked al-Bara' b. Azib about the exchange of (gold for silver or vice versa), whereupon he said: you better ask Zaid b. Arqam for he knows more than I. So I asked Zaid but he said: You better ask al-Bara' for he knows more than I. Then both of them said: Allah's Messenger (may peace be upon him) forbade the sale of silver for gold when payment is to be made in future.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11276",
        "11290",
        "400"
      ]
    },
    {
      "hadith_no": "4189",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن محارب، أنه سمع جابر بن عبد الله، يقول اشترى مني رسول الله صلى الله عليه وسلم بعيرا بوقيتين ودرهم أو درهمين - قال - فلما قدم صرارا أمر ببقرة فذبحت فأكلوا منها فلما قدم المدينة أمرني أن آتي المسجد فأصلي ركعتين ووزن لي ثمن البعير فأرجح لي ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) bought a camel from me for two 'uqiyas and a dirham or two dirhams. As he reached Sirar (a village near Medina), he commanded a cow to be slaughtered and it was slaughtered, and they ate of that, and as he (the Holy Prophet) reached Medina he ordered me to go to the mosque and offer two rak'ahs of prayer, and he measured for me the price of the camel and even made an excess payment to me.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "4246",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، أنه سمع أبا حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من ترك مالا فللورثة ومن ترك كلا فإلينا ‏\"‏ ‏.‏",
      "text_en": "  Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who leaves property, that is for the inheritors; and he who leaves behind destitute children, then it is my responsibility (to look after them).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "4365",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليترك يمينه ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported Allah's Messenger (may peace be upon him) as saying:                      He who took an oath, but he found something else better than that, should do that which is better and break his oath.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4372",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني علي بن حجر السعدي، حدثنا هشيم، عن يونس، ومنصور، وحميد، ح وحدثنا أبو كامل الجحدري، حدثنا حماد بن زيد، عن سماك بن عطية، ويونس بن عبيد، وهشام، بن حسان في آخرين ح وحدثنا عبيد الله بن معاذ، حدثنا المعتمر، عن أبيه، ح وحدثنا عقبة بن مكرم العمي، حدثنا سعيد بن عامر، عن سعيد، عن قتادة، كلهم عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ بهذا الحديث وليس في حديث المعتمر عن أبيه ذكر الإمارة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abd al-Rahman b. Samura through another chain of transmitters but there is no mention of the word\" authority\".",
      "chain": [
        "20387",
        "20468",
        "20475",
        "11067",
        "11279",
        "30559",
        "20022",
        "11075",
        "11311",
        "30150",
        "20288",
        "11289",
        "30441",
        "20232",
        "11168"
      ]
    },
    {
      "hadith_no": "4422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد قال ‏\"‏ من أعتق شقيصا من مملوك فهو حر من ماله ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters (and the words are):                     \" He who emancipates a portion in a slave, he should (secure full) freedom for him from his property.\"",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "4476",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثني يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - ح وحدثني بشر بن خالد، حدثنا محمد بن جعفر، ح وحدثنا ابن، المثنى وابن بشار قالا حدثنا ابن أبي عدي، كلهم عن شعبة، عن الأعمش، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أن بعضهم قال عن شعبة ‏\"‏ يقضى ‏\"‏ ‏.‏ وبعضهم قال ‏\"‏ يحكم بين الناس ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters with a slight variation of words.",
      "chain": [
        "30150",
        "20286",
        "20226",
        "30126",
        "20173",
        "20276",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4481",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا أبو يونس، عن سماك بن، حرب أن علقمة بن وائل، حدثه أن أباه حدثه قال إني لقاعد مع النبي صلى الله عليه وسلم إذ جاء رجل يقود آخر بنسعة فقال يا رسول الله هذا قتل أخي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ فقال إنه لو لم يعترف أقمت عليه البينة ‏.‏ قال نعم ‏.‏ قتلته قال ‏\"‏ كيف قتلته ‏\"‏ ‏.‏ قال كنت أنا وهو نختبط من شجرة فسبني فأغضبني فضربته بالفأس على قرنه فقتلته ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل لك من شىء تؤديه عن نفسك ‏\"‏ ‏.‏ قال ما لي مال إلا كسائي وفأسي ‏.‏ قال ‏\"‏ فترى قومك يشترونك ‏\"‏ ‏.‏ قال أنا أهون على قومي من ذاك ‏.‏ فرمى إليه بنسعته ‏.‏ وقال ‏\"‏ دونك صاحبك ‏\"‏ ‏.‏ فانطلق به الرجل فلما ولى قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ فرجع فقال يا رسول الله إنه بلغني أنك قلت ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ وأخذته بأمرك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما تريد أن يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ قال يا نبي الله - لعله قال - بلى ‏.‏ قال ‏\"‏ فإن ذاك كذاك ‏\"‏ ‏.‏ قال فرمى بنسعته وخلى سبيله ‏.‏",
      "text_en": " 'Alqama b. Wa'il reported on the authority of his-father:                      While I was sitting in the company of Allah's Apostle (may peace be upon him), a person came there dragging another one with the help of a strap and said: Allah's Messenger, this man has killed my brother. Allah's Messenger (may peace be upon him) said to him: Did you kill him? And the other man said: (In case he did not make a confession of this, I shall brine, a witness against him). He (the murderer) said: Yes, I have killed him. He (the Holy Prophet) said: Why did you kill him? He said: I and he won striking down the leaves of a tree and he abused me and enraged me, and to I struck his head with an axe and killed him, whereupon Allah's Messenger (may peace be upon him) said: Have you anything with you to pay blood-wit on your behalf? He said: I do not possess any property but this robe of mine and this axe of mine. He (the Holy, Prophet) said: Do you think your people will pay ransom for you? He said: I am more insignificant among my people than this (that I would not be able to get this benefit from my tribe). He (the Holy Prophet) threw the strap towards him (the claimant of the blood-wit) saying: Take away your man. The man took him away, and as he returned, Allah's Messenger (may peace be upon him) said: If he kills him, he will be like him. He returned and said: Allah's Messenger, it has reached me that you have said that\" If he killed him, he would be like him.\" I caught hold of him according to your command, whereupon Allah's Messenger (may peace be upon him) said: Don't you like that he should take upon him (the burden) of your sin and the sin of your companion (your brother)? He said: Allah's Apostle, why not? The Messenger of Allah (may peace be. upon him) said: If it is so, then let it be. He threw away the strap (around the offender) and set him free.",
      "chain": [
        "30150",
        "20286",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "4566",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع يعني ابن مسلم، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا محمد بن جعفر، قالا حدثنا شعبة، كلاهما عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Abu Huraira.",
      "chain": [
        "20540",
        "30150",
        "20286",
        "30160",
        "20173",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "4588",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثناه يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، ح وحدثنا محمد، بن المثنى حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي كلاهما، عن شعبة، ح وحدثنا أبو كريب، حدثنا حسين بن علي، عن زائدة، كل هؤلاء عن عبد الملك، بن عمير عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث أبي عوانة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abd al-Rahman b. Abu Bakra through another chain of transmitters.",
      "chain": [
        "30399",
        "20468",
        "20656",
        "20021",
        "30201",
        "20032",
        "20012",
        "30170",
        "20173",
        "30150",
        "20020",
        "30216",
        "20315"
      ]
    },
    {
      "hadith_no": "4625",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي التياح، عن أنس، ح. وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن سعيد، ح وحدثنا محمد بن، الوليد حدثنا محمد بن جعفر، كلاهما عن شعبة، عن أبي التياح، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسروا ولا تعسروا وسكنوا ولا تنفروا ‏\"‏.",
      "text_en": " The Messenger of Allah (may peace he upon him) has been reported by Anas b. Malik to have said:                      Show leniency; do not be hard; give solace and do not create aversion.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "19",
        "30201",
        "30359",
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4729",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء بن عازب، يقول كتب علي بن أبي طالب الصلح بين النبي صلى الله عليه وسلم وبين المشركين يوم الحديبية فكتب ‏\"‏ هذا ما كاتب عليه محمد رسول الله‏\"‏ ‏.‏ فقالوا لا تكتب رسول الله فلو نعلم أنك رسول الله لم نقاتلك ‏.‏ فقال النبي صلى الله عليه وسلم لعلي ‏\"‏ امحه ‏\"‏ ‏.‏ فقال ما أنا بالذي أمحاه ‏.‏ فمحاه النبي صلى الله عليه وسلم بيده قال وكان فيما اشترطوا أن يدخلوا مكة فيقيموا بها ثلاثا ولا يدخلها بسلاح إلا جلبان السلاح ‏.‏ قلت لأبي إسحاق وما جلبان السلاح قال القراب وما فيه ‏.‏",
      "text_en": " It has been narrated on the authority of al-Bara' b. 'Azib who said:                      'Ali b. Abu Talib penned the treaty between the Holy Prophet (may peace be upon him) and the polytheists on the Day of Hudaibiya. He wrote: This is what Muhammad, the Messenger of Allah, has settled. They (the polytheists) said: Do not write words\" the Messenger of Allah\". If we knew that you were the Messenger of Allah, we would not fight against you. The Prophet (may peace be upon him) said to 'Ali: Strike out these words. He (Ali) said: I am not going to strike them out. So the Prophet (may peace be upon him) struck them out with his own hand. The narrator said that the conditions upon which the two sides had agreed included that the Muslims would enter Mecca (next year) and would stay there for three days, and that they would not enter bearing arms except in their sheaths or bolsters.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4857",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن بشار، حدثنا محمد، بن جعفر قالا حدثنا شعبة، عن يعلى بن عطاء، سمع أبا علقمة، سمع أبا هريرة، عن النبي صلى الله عليه وسلم نحو حديثهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira by more than one chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20173",
        "20020",
        "10986",
        "13"
      ]
    },
    {
      "hadith_no": "4863",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي عمران، بهذا الإسناد كما قال ابن إدريس عبدا مجدع الأطراف ‏.‏",
      "text_en": " Abu 'Imran narrated this hadith with a slight change of wording.",
      "chain": [
        "30150",
        "20286",
        "20020"
      ]
    },
    {
      "hadith_no": "4899",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا عاصم، - وهو ابن محمد بن زيد - عن زيد بن محمد، عن نافع، قال جاء عبد الله بن عمر إلى عبد الله بن مطيع حين كان من أمر الحرة ما كان زمن يزيد بن معاوية فقال اطرحوا لأبي عبد الرحمن وسادة فقال إني لم آتك لأجلس أتيتك لأحدثك حديثا سمعت رسول الله صلى الله عليه وسلم يقوله سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من خلع يدا من طاعة لقي الله يوم القيامة لا حجة له ومن مات وليس في عنقه بيعة مات ميتة جاهلية ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Nafi, that 'Abdullah b. Umar paid a visit to Abdullah b. Muti' in the days (when atrocities were perpetrated on the People Of Medina) at Harra in the time of Yazid b. Mu'awiya. Ibn Muti' said:                      Place a pillow for Abu 'Abd al-Rahman (family name of 'Abdullah b. 'Umar). But the latter said: I have not come to sit with you. I have come to you to tell you a tradition I heard from the Messenger of Allah (may peace be upon him). I heard him say: One who withdraws his band from obedience (to the Amir) will find no argument (in his defence) when he stands before Allah on the Day of Judgment, and one who dies without having bound himself by an oath of allegiance (to an Amir) will die the death of one belonging to the days of Jahillyya.",
      "chain": [
        "30150",
        "20286",
        "20163",
        "11014"
      ]
    },
    {
      "hadith_no": "4922",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عمرو، - يعني ابن مرة - حدثني عبد الله بن أبي أوفى، قال كان أصحاب الشجرة ألفا وثلاثمائة وكانت أسلم ثمن المهاجرين ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abdullah b. Abu Aufa who said:                      The Companions of the Tree (i e. those who swore fealty under the tree) were one thousand and three hundred, and the people of Aslam tribe were one-eighth of the Muhajirs.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "4961",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، كلاهما عن شعبة، عن أبي إسحاق، عن العيزار بن حريث، عن عروة، بن الجعد عن النبي صلى الله عليه وسلم بهذا ‏.‏ ولم يذكر ‏\"‏ الأجر والمغنم ‏\"‏ ‏.‏",
      "text_en": " A version of the tradition transmitted on the authority of 'Urwa b. al-ja'd does not mention\" reward and booty\".",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20173",
        "20020",
        "11049",
        "10808"
      ]
    },
    {
      "hadith_no": "4962",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا يحيى بن سعيد، كلاهما عن شعبة، عن أبي التياح، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البركة في نواصي الخيل ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said:                      There is a blessing in the forelocks of the war horses.",
      "chain": [
        "30150",
        "20286",
        "30170",
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "5080",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي قالا، جميعا حدثنا شعبة، عن محارب، عن جابر، عن النبي صلى الله عليه وسلم بكراهة الطروق ولم يذكر يتخونهم أو يلتمس عثراتهم ‏.‏",
      "text_en": " A version of the tradition narrated on the authority of Jabir (but through a different chain of transmitters) mentions the undesirability of coining to one's house like a night visitor, but does not contain the words:                     \" Doubting their fidelity or spying into their lapses.\"",
      "chain": [
        "30170",
        "20173",
        "30150",
        "20286",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "5083",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الله بن، أبي السفر عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن المعراض فقال ‏\"‏ إذا أصاب بحده فكل وإذا أصاب بعرضه فقتل فإنه وقيذ فلا تأكل ‏\"‏ ‏.‏ وسألت رسول الله صلى الله عليه وسلم عن الكلب فقال ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله فكل فإن أكل منه فلا تأكل فإنه إنما أمسك على نفسه ‏\"‏ ‏.‏ قلت فإن وجدت مع كلبي كلبا آخر فلا أدري أيهما أخذه قال ‏\"‏ فلا تأكل فإنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported that he asked the Messenger of Allah (may peace be upon him) about (hunting) with the help of an arrow having a stub end. He said:                      If it strikes (the game) with its point, then eat, but if it strikes flatly and it dies, that is Waqidh (beaten into death), do not eat that. I asked the Messenger of Allah (may peace be upon him) about (hunting with the help of) dogs, whereupon he said. When you send your dog (for hunting) reciting the name of Allah, then eat (the game), but if some part of it is eaten (by the dogs, then do not eat that, for it (your dog) has caught that (the-game) for itself. I (again) said: If I find along with my dog another dog, and do not know which of (the dogs) has caught (the game). then (what should I do)? Thereupon he ('Allah's Messenger) said: Then don't eat that, for you recited the name of Allah on your dog and not on the other one.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5103",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، عن ميمون، بن مهران عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) prohibited the eating of all fanged beasts of prey, and all the birds having talons.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5124",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - قال سمعت البراء، وعبد الله بن أبي أوفى، يقولان أصبنا حمرا فطبخناها فنادى منادي رسول الله صلى الله عليه وسلم اكفئوا القدور ‏.‏",
      "text_en": " 'Adi (he was the son of Thabit) said:                      I heard al-Bara' and 'Abdullah b. Abu Aufa say: We found domestic asses and we cooked them. Then the announcer of Allah's Messenger (may peace be upon him) made an announcement that the earthen pots should be turned over.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "5144",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن توبة العنبري، سمع الشعبي، سمع ابن عمر، أن النبي صلى الله عليه وسلم كان معه ناس من أصحابه فيهم سعد وأتوا بلحم ضب فنادت امرأة من نساء النبي صلى الله عليه وسلم إنه لحم ضب فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا فإنه حلال ولكنه ليس من طعامي ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported that there were some persons with Allah's Apostle (may peace be upon him) from among his Companions, Sa'd being one of them. There was brought to them the flesh of the lizard when a lady amongst the wives of Allah's Apostle (may peace be upon him) said:                      It is the flesh of the lizard. Thereupon Allah's Messenger (way peace be upon him) &aid: Eat, for it is lawful, but it is not my diet.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11579",
        "11052",
        "18"
      ]
    },
    {
      "hadith_no": "5162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا كهمس، عن ابن بريدة، قال رأى عبد الله بن المغفل رجلا من أصحابه يخذف فقال له لا تخذف فإن رسول الله صلى الله عليه وسلم كان يكره - أو قال - ينهى عن الخذف فإنه لا يصطاد به الصيد ولا ينكأ به العدو ولكنه يكسر السن ويفقأ العين ‏.‏ ثم رآه بعد ذلك يخذف فقال له أخبرك أن رسول الله صلى الله عليه وسلم كان يكره أو ينهى عن الخذف ثم أراك تخذف لا أكلمك كلمة كذا وكذا ‏.‏",
      "text_en": " Ibn Buraida reported that Abdullah b. al-Mughaffal saw a person from amongst his companions throwing small pebbles, whereupon he said:                      Don't throw pebbles. for Allah's Messenger (may peace be upon him) did not like it, or he forbade flinging of pebbles since neither the game is taken thereby, nor an enemy defeated. but it may break a tooth or put out an eye. He, afterwards, again saw him flinging pebbles, and said to him: I inform you that the Messenger of Allah (may peace be upon him) did not approve or he forbade flinging of pebbles, but if I see you again flinging pebbles. I will not speak with you.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "11432"
      ]
    },
    {
      "hadith_no": "5171",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عدي، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تتخذوا شيئا فيه الروح غرضا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported Allah's Messenger (may peace be upon him) having said this:                      Do not make anything having life as a target.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن الأسود، سمع جندبا البجلي، قال شهدت رسول الله صلى الله عليه وسلم صلى يوم أضحى ثم خطب فقال ‏\"‏ من كان ذبح قبل أن يصلي فليعد مكانها ومن لم يكن ذبح فليذبح باسم الله ‏\"‏ ‏.‏",
      "text_en": " Jundab al-Bajali reported:                      I saw Allah's Messenger (may peace be upon him) observing ('Id) prayer on the Day of Sacrifice (10th of Dhu'l-Hijja) and then delivering a sermon and he said: He who sacrificed the (animal) before offering ('Id) prayer, he should offer again in its stead, and he who did not sacrifice the animal should slaughter it by reciting the name of Allah.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11323"
      ]
    },
    {
      "hadith_no": "5186",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن زبيد، سمع الشعبي، عن  البراء بن عازب، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of al-Bara' b. 'Azib through another chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "5236",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا محمد بن عمرو الليثي، عن عمر بن مسلم بن عمار بن أكيمة الليثي، قال سمعت سعيد بن المسيب، يقول سمعت  أم سلمة، زوج النبي صلى الله عليه وسلم تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان له ذبح يذبحه فإذا أهل هلال ذي الحجة فلا يأخذن من شعره ولا من أظفاره شيئا حتى يضحي ‏\"‏ ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported Allah's Messenger (may peace be upon him) to have said:                      He who has a sacrificial animal with him whom (he intends) to offer as sacrifice, and he enters the month of Dhu'I-Hijja, he should not get his hair cut or nails trimmed until he has sacrificed the animal.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "5315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عمرو بن مرة، حدثني  زاذان، قال قلت لابن عمر حدثني بما، نهى عنه النبي صلى الله عليه وسلم من الأشربة بلغتك وفسره لي بلغتنا فإن لكم لغة سوى لغتنا ‏.‏ فقال نهى رسول الله صلى الله عليه وسلم عن الحنتم وهي الجرة وعن الدباء وهي القرعة وعن المزفت وهو المقير وعن النقير وهى النخلة تنسح نسحا وتنقر نقرا وأمر أن ينتبذ في الأسقية ‏.‏",
      "text_en": " Zadhan reported:                      I said to Ibn 'Umar: Tell me in your own language and then explain it to me in any language because your language is different from our language (about the vessels) in which Allah's Apostle (may peace be upon him) has forbidden (us) to drink. He said: Allah's Messenger (may peace be upon him) has forbidden (the preparation) of Nabidh in Hantama and that is a pitcher (besmeared with pitch), in gourd and that is pumpkin, in the varnished jar, in hollow stump and in wooden vessels. This Naqir is the wood of date-palm from which the vessel is fashioned out or hollowed out, but he commanded us to prepare Nabidh in waterskins.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "5344",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن يحيى بن عبيد، أبي عمر البهراني قال سمعت ابن عباس، يقول كان رسول الله صلى الله عليه وسلم ينتبذ له أول الليل فيشربه إذا أصبح يومه ذلك والليلة التي تجيء والغد والليلة الأخرى والغد إلى العصر فإن بقي شىء سقاه الخادم أو أمر به فصب ‏.‏",
      "text_en": " Ibn 'Abbas reported that Nabidh was prepared for Allah's Messenger (may peace be upon him) in the beginning of the night and he would drink it in the morning and the following night and the following day and the night after that up to the afternoon. If anything was left out of that he gave it to his servant, or gave orders for it to be poured out.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10841",
        "17"
      ]
    },
    {
      "hadith_no": "5356",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي إسحاق، عن البراء، قال قال أبو بكر الصديق لما خرجنا مع النبي صلى الله عليه وسلم من مكة إلى المدينة مررنا براع وقد عطش رسول الله صلى الله عليه وسلم قال فحلبت له كثبة من لبن فأتيته بها فشرب حتى رضيت ‏.‏",
      "text_en": " Abu Bakr Siddiq reported:                      As we went along with Allah's Messenger (may peace be upon him) from Mecca to Medina, we passed by a shepherd and Allah's Messenger (may peace be upon him) was feeling thirsty. He (Abu Bakr Siddiq) said: I milked for him a small quantity of milk (from his goat) and brought it to him (the Holy Prophet), and he drank it and I was very happy.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "5402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عاصم، سمع الشعبي، سمع ابن عباس، قال سقيت رسول الله صلى الله عليه وسلم من زمزم فشرب قائما واستسقى وهو عند البيت ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I served (water from) Zamzam to Allah's Messenger (may peace be upon him), and he drank while standing, and he asked for it while he was near the House (i. e. House of Allah-Ka'ba).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "5430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن أبي معاوية، ح وحدثناه نصر بن علي الجهضمي، وأبو سعيد الأشج قالا حدثنا أبو أسامة، ح وحدثنا  عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن يوسف، عن سفيان، كلهم عن الأعمش، عن أبي وائل، عن أبي مسعود، بهذا الحديث عن النبي صلى الله عليه وسلم بنحو حديث جرير ‏.‏ قال نصر بن علي في روايته لهذا الحديث حدثنا أبو أسامة، حدثنا الأعمش، حدثنا شقيق بن سلمة، حدثنا أبو مسعود، الأنصاري ‏.‏ وساق الحديث ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Mas'ud Ansari through another chain of transmitters.",
      "chain": [
        "30201",
        "30123",
        "20354",
        "30395",
        "30200",
        "20318",
        "30150",
        "20286",
        "20020",
        "30025",
        "30388",
        "11060"
      ]
    },
    {
      "hadith_no": "5455",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن بشار، حدثنا عبد، الرحمن بن مهدي كلاهما عن شعبة، بهذا الإسناد وليس في حديثهما قول شعبة ولا قوله وقد كان أصاب الناس يومئذ جهد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Shu'ba with the same chain of transmitters but these words of his (are not found):                     \" The people were hard pressed because of the famine during those days.\"",
      "chain": [
        "30150",
        "20286",
        "30160"
      ]
    },
    {
      "hadith_no": "5485",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد، الأعلى جميعا عن المعتمر بن سليمان، - واللفظ لابن معاذ - حدثنا المعتمر، حدثنا أبي، عن أبي عثمان، - وحدث أيضا، - عن عبد الرحمن بن أبي بكر، قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏ ‏.‏ فإذا مع رجل صاع من طعام أو نحوه فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية - أو قال - أم هبة ‏\"‏ ‏.‏ فقال لا بل بيع ‏.‏ فاشترى منه شاة فصنعت وأمر رسول الله صلى الله عليه وسلم بسواد البطن أن يشوى ‏.‏ قال وايم الله ما من الثلاثين ومائة إلا حز له رسول الله صلى الله عليه وسلم حزة حزة من سواد بطنها إن كان شاهدا أعطاه وإن كان غائبا خبأ له - قال - وجعل قصعتين فأكلنا منهما أجمعون وشبعنا وفضل في القصعتين فحملته على البعير ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abu Bakr reported:                      We were one hundred and thirty (persons) with Allah's Apostle (may peace be upon him). Allah's Apostle (may peace be upon him) said: Does any one of You possess food? There was a person with (us) who had a sa' of flour or something about that, and it was kneaded. Then a tall polytheist with dishevelled hair came driving his flock of sheep. Thereupon Allah's Apostle (may peace be upon him) said: Would you like to sell it (any one of these goats) or offer it as a gift or a present? He said: No, (I am not prepared to offer as a gift), but I would sell it. He (the Holy Prophet) bought a sheep from him, and it was slaughtered and its meat was prepared, and Allah's Messenger (may peace be upon him) commanded that its liver should be roasted. He (the narrator) said: By Allah, none among one hundred and thirty persons was left whom Allah's Messenger (may peace be upon him) had not given a part out of her liver; if anyone was present he gave it to him. but if he was absent it was set aside for him. And he (the Holy Prophet) filled two bowls (one with soup and the other with mutton) and we all ate out of them to our hearts' content, but (still) some part was (left) in (those) two bowls, and I placed it on the camel- (or words to the same effect).",
      "chain": [
        "30150",
        "30128",
        "20288",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "hadith_no": "5486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، القيسي كلهم عن المعتمر، - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، قال قال أبي حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا ناسا فقراء وإن رسول الله صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثلاثة ومن كان عنده طعام أربعة فليذهب بخامس بسادس ‏\"‏ ‏.‏ أو كما قال ‏.‏ وإن أبا بكر جاء بثلاثة وانطلق نبي الله صلى الله عليه وسلم بعشرة وأبو بكر بثلاثة - قال - فهو وأنا وأبي وأمي - ولا أدري هل قال وامرأتي وخادم بين بيتنا وبيت أبي بكر - قال وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ‏.‏ ثم لبث حتى صليت العشاء ثم رجع فلبث حتى نعس رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله قالت له امرأته ما حبسك عن أضيافك - أو قالت - ضيفك قال أوما عشيتهم قالت أبوا حتى تجيء قد عرضوا عليهم فغلبوهم - قال - فذهبت أنا فاختبأت وقال يا غنثر ‏.‏ فجدع وسب وقال كلوا لا هنيئا ‏.‏ وقال والله لا أطعمه أبدا - قال - فايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها - قال - حتى شبعنا وصارت أكثر مما كانت قبل ذلك فنظر إليها أبو بكر فإذا هي كما هي أو أكثر ‏.‏ قال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرار - قال - فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان - يعني يمينه - ثم أكل منها لقمة ثم حملها إلى رسول الله صلى الله عليه وسلم فأصبحت عنده - قال - وكان بيننا وبين قوم عقد فمضى الأجل فعرفنا اثنا عشر رجلا مع كل رجل منهم أناس الله أعلم كم مع كل رجل إلا أنه بعث معهم فأكلوا منها أجمعون ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rabman b. Abu Bakr reported that the people of Suffa were very poor. Once the Messenger of Allah (may peace be upon him) said (to his Companions):                      He who amongst you has food for two persons should take three (guests with him). and he who has with him food for four persons should take five or six (guests with him for entertaining them). It was (in accordance with these instructions of the Holy Prophet) that Abu Bakr brought three persons, and the Apostle of Allah (may peace be upon him) brought ten persons (as guests to their respective houses). Abu Bakr had brought three persons (he himself, and myself), my father and my mother (along with therm). He (the narrator) said: I do not know whether he also said: My wife and one servant who was common between our house and that of Abu Bakr. Abu Bakr had had his evening meal with Allah's Apostle (may peace be upon him). He stayed here until night prayer had been offered. He then came back (to the house of Allah's Apostle) and stayed there until Allah's Messenger (may peace be upon him) felt drowsy and (Abu Bakr) then came (back to his own house) when (a considerable) part of the night had been over, as Allah had desired. His wife said to him: What held you back from your guests? He said: Oh! have you not served them the evening meal (by this time)? She said: It was in fact served to them. but they refused to eat until you came. He ('Abd al-Rahman) said: I slunk away and bid myself. He (Abu Bakr) said: O, you stupid fellow, and he reprimanded me, and said to the guests: Eat, though it may not be pleasant now. He said: By Allah. I will never eat it He ('Abd al-Rahman) said: By Allah. we did not take a morsel when from beneath that (there appeared) more until they had eaten to their fill, and lo! it was more than what it was before. Abu Bakr saw that and found that it was so or more than that. He said to his wife: Sister of Band Firis, what is th-is? She said: By the coolness of my eyes. it is in excess by three times over the previous one. Then Abu Bakr ate saying: That was from the Satan (viz. his vow for not eating the food). He then took a morsel out of that and then took it (the rest) to the Messenger of Allah (may peace be upon him), and it was kept there until morning, and during (those days) there was a covenant between us and some other people, and the period of covenant was over, and we had appointed twelve officials with every person amongst them. It is Allah only Who knows as to how many people were there with each of them. He sent (this food to them) and all of them ate out of it.",
      "chain": [
        "30150",
        "30128",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "5513",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه أبو كريب، حدثنا ابن إدريس، أخبرنا أبو إسحاق الشيباني، وليث بن، أبي سليم عن أشعث بن أبي الشعثاء، بإسنادهم ولم يذكر زيادة جرير وابن مسهر ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن، معاذ حدثنا أبي ح، وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، ح وحدثنا عبد، الرحمن بن بشر حدثنا بهز، قالوا جميعا حدثنا شعبة، عن أشعث بن سليم، بإسنادهم ومعنى حديثهم إلا قوله وإفشاء السلام ‏.‏ فإنه قال بدلها ورد السلام ‏.‏ وقال نهانا عن خاتم الذهب أو حلقة الذهب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ash'ath b. Sulaim with the same chain of transmitters but with this difference that instead of the words:                      Ifsha as-Salam (spreading the salutations), he substituted the words Radd as-Saldm (i. e. responding to the words of salutation) and he said: He forbade (the use of) gold ring.",
      "chain": [
        "30216",
        "20102",
        "11352",
        "10957",
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "30123",
        "20443"
      ]
    },
    {
      "hadith_no": "5518",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، أنه سمع عبد الرحمن، - يعني ابن أبي ليلى - قال شهدت حذيفة استسقى بالمدائن فأتاه إنسان بإناء من فضة ‏.‏ فذكره بمعنى حديث ابن عكيم عن حذيفة ‏.‏",
      "text_en": " Shu'ba reported from al-Hakam that he heard 'Abd al-Rahmin (i. e. Ibn Abu Laila) as saying:                      I personally saw Hudhaifa asking for water in Mada'in and a man giving it to him in a silver vessel. The rest of the hadith is the same.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "5584",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد، - وهو ابن زياد- قال سمعت أبا هريرة، ورأى، رجلا يجر إزاره فجعل يضرب الأرض برجله وهو أميرعلى البحرين وهو يقول جاء الأمير جاء الأمير ‏.‏ قال رسول الله صلى الله عليه وسلم‏\"‏ إن الله لا ينظر إلى من يجر إزاره بطرا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraire reported that he saw a person whose lower garment bad been trailin. and he was striking the ground with his foot (conceitedly). He was the Amir of Bahrain and it was being said:                      Here comes the Amir, here comes the Amir. He (Abu Huraira) reported that Allah's Messenger (may peace be upon him) said: Allah will not look toward him who trails his lower garment out of pride.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "13"
      ]
    },
    {
      "hadith_no": "5587",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن بشار، عن محمد بن،جعفر ح وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، قالوا جميعا حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحو هذا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira but with a different chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30160",
        "30170",
        "20276",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "5591",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن قتادة، عن النضر بن أنس،عن بشير بن نهيك، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى عن خاتمالذهب ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Apostle (may peace be upon him) forbade the wearing of gold signet ring.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "13"
      ]
    },
    {
      "hadith_no": "5730",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، قالوا حدثنا  محمد بن جعفر، حدثنا شعبة، عن عطاء بن أبي ميمونة، سمعت أبا رافع، يحدث عن أبي، هريرة ح  وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، عن أبي هريرة، أن زينب، كان اسمها برة فقيل تزكي نفسها ‏.‏ فسماها رسول الله صلى الله عليه وسلم زينب ‏.‏ ولفظ الحديث لهؤلاء دون ابن بشار ‏.‏ وقال ابن أبي شيبة حدثنا محمد بن جعفر عن شعبة ‏.‏",
      "text_en": " Abu Huraira reported that the name of Zainab was Barra. It was said of her:                      She presents herself to be innocent. Allah's Messenger (may peace be upon him) gave her the name of Zainab.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "11601",
        "13",
        "30150",
        "20286",
        "20020",
        "11601",
        "479",
        "13",
        "57"
      ]
    },
    {
      "hadith_no": "5781",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثني يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - قالا حدثنا شعبة، ح وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لهما - قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس، أنعليه وسلم قالوا للنبي صلى الله عليه وسلم إن أهل الكتاب يسلمون علينا فكيف نرد عليهم قال ‏\"‏ قولوا وعليكم ‏\"‏ ‏.‏",
      "text_en": " Anas reported that the Companions of Allah's Apostle (may peace be upon him) said to him:                      The People. of the Book offer us salutations (by saying as-Salamu- 'Alaikum). How should we reciprocate them? Thereupon he said: Say: Wa 'Alaikum (and upon you too).",
      "chain": [
        "30150",
        "20286",
        "20226",
        "20020",
        "30170",
        "20173",
        "20020",
        "11019"
      ]
    },
    {
      "hadith_no": "5911",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد غير أنه لم يذكر قصة عطاء بن يسار في أول الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters except for the fact that no mention has been made of the account of 'Ata b. Yasir as in the previous hadith.",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "6047",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن ثابت البناني، عن أنس، بن مالك عن النبي صلى الله عليه وسلم مثل ذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6107",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا ابن بشر، جميعا عن مسعر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، قالا حدثنا شعبة، كلاهما عن عبد الملك بن عمير، عن جندب، عن  النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jundab through another chain of transmitters.",
      "chain": [
        "30201",
        "20032",
        "30216",
        "20359",
        "30150",
        "20286",
        "30170",
        "20173",
        "11368",
        "4053"
      ]
    },
    {
      "hadith_no": "6175",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن قتادة، سمع عبد الله، بن أبي عتبة يحدث عن أبي سعيد الخدري، ح",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11598"
      ]
    },
    {
      "hadith_no": "6263",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن زياد، سمع  أبا هريرة، ح",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216"
      ]
    },
    {
      "hadith_no": "6372",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، في هذا الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "6411",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - حدثنا البراء بن عازب، قال رأيت الحسن بن علي على عاتق النبي صلى الله عليه وسلم وهو يقول ‏\"‏ اللهم إني أحبه فأحبه ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' b. Azib reported:                      I saw Hasan b. 'Ali upon the shoulders of Allah's Apostle (may peace be upon him) and he was saying: O Allah, I love him, and love him Thou.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "6449",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثناه أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا عبيد الله بن معاذ، حدثنا  أبي قالا، حدثنا شعبة، عن سعد، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sa'd with the same chain of transmitters.",
      "chain": [
        "20032",
        "30150",
        "20286",
        "20020"
      ]
    },
    {
      "hadith_no": "6493",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد وزاد قال شعبة بدأ بهذين لا أدري بأيهما بدأ ‏.‏",
      "text_en": " Ubaidullah b. Mu'adh reported it on the authority of his father Shu'ba with the same chain of transmitters and he made this addition. He made a mention of these two names but I do not know whose name he mentioned first.",
      "chain": [
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "6542",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - قال سمعت البراء بن عازب، قال سمعت رسول الله صلى الله عليه وسلم يقول لحسان بن ثابت ‏\"‏ اهجهم أو هاجهم وجبريل معك ‏\"‏ ‏.‏",
      "text_en": " Al-Bari' b. 'Azib reported:                      I heard Allah's Messenger (may peace be upon him) as saying: Hassan b. Thibit, write satire (against the non-believers) ; Gabriel is with you. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "6589",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد، الرحمن بن مهدي قالا حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة، ح",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "30170",
        "20033",
        "20020",
        "11216"
      ]
    },
    {
      "hadith_no": "6600",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، بهذا الإسناد ‏.‏ مثله غير أن في الحديث قال سعد في بعض هذا فيما أعلم ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The tribes of Ashja', Ghifar and Muzaina and from the tribe of Juhaina they are better than Banu Tamim, Banu Amir and the allies of Asad and Ghatfan.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11063"
      ]
    },
    {
      "hadith_no": "6653",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو سعيد الأشج، وأبو كريب قالا حدثنا وكيع، عن الأعمش، ح وحدثنا  عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، جميعا عن شعبة، عن الأعمش، بإسناد جرير وأبي معاوية ‏.‏ بمثل حديثهما وليس في حديث شعبة ووكيع ذكر عبد الرحمن بن عوف وخالد بن الوليد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of al-A'mash and there is no mention by Shu'ba and Waki' of 'Abd al-Rahman b. Auf and Khalid.",
      "chain": [
        "30200",
        "30216",
        "20032",
        "11060",
        "30150",
        "20286",
        "30160",
        "20276",
        "20020"
      ]
    },
    {
      "hadith_no": "6669",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن حبيب، سمعت أبا العباس، سمعت عبد الله بن عمرو بن العاص، يقول جاء رجل إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثله ‏.‏ قال مسلم أبو العباس اسمه السائب بن فروخ المكي ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Habib with the same chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11276",
        "29"
      ]
    },
    {
      "hadith_no": "6723",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ، أخبرني أبي ح، وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - كلهم عن شعبة، عن الأعمش، ح وحدثني أبو بكر بن نافع، حدثنا عبد الرحمن، ح وحدثنا ابن، نمير حدثنا مصعب بن المقدام، كلاهما عن سفيان، عن الأعمش، بإسناد جرير مثل حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'mash through other chains of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20276",
        "30126",
        "20173",
        "20020",
        "11060",
        "20523",
        "10530",
        "30212",
        "20608",
        "20012"
      ]
    },
    {
      "hadith_no": "6767",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن المقدام، - وهو ابن شريح بن هانئ - عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الرفق لا يكون في شىء إلا زانه ولا ينزع من شىء إلا شانه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha, the wife of Allah's Apostle (may peace be upon him), reported Allah's Apostle (may peace be upon him) as saying:                      Kindness is not to be found in anything but that it adds to its beauty and it is not withdrawn from anything but it makes it defective.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10830",
        "10774"
      ]
    },
    {
      "hadith_no": "6820",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن قتادة، سمع أبا، أيوب يحدث عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قاتل أحدكم أخاه فلا يلطمن الوجه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When any one of you fights with his brother, he should not slap at the face.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "33",
        "13"
      ]
    },
    {
      "hadith_no": "6869",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد، الله بن معاذ حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، في هذا الإسناد ‏.‏ بمثل معناه وزادا جميعا عن شعبة عن عبد الرحمن بن الأصبهاني قال سمعت أبا حازم يحدث عن أبي هريرة قال ‏\"‏ ثلاثة لم يبلغوا الحنث ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he (the Holy Prophet) said:                      Three (children) who die in childhood.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "20020",
        "20020",
        "11364",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "6894",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، كلاهما عن جرير بن عبد، الحميد ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثني أبو سعيد، الأشج حدثنا وكيع، ح وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة بن الحجاج، كلهم عن الأعمش، بهذا الإسناد ‏.‏ قال في حديث وكيع ‏\"‏ إن خلق أحدكم يجمع في بطن أمه أربعين ليلة ‏\"‏ ‏.‏ وقال في حديث معاذ عن شعبة ‏\"‏ أربعين ليلة أربعين يوما ‏\"‏ ‏.‏ وأما في حديث جرير وعيسى ‏\"‏ أربعين يوما ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of A'mash with the same chain of transmitters and in the hadith transmitted on the authority of Waki' (the words are):                     \" The creation of any one of you is like this that (semen) is collected in the womb of the mother for forty nights,\" and in the hadith transmitted on the authority of Shu'ba (the words are):\" Forty nights and forty days.\" And in the hadith transmitted on the authority of Jarir and 'Isa (the words are):\" Forty days.\"",
      "chain": [
        "30203",
        "30123",
        "20028",
        "30123",
        "20347",
        "30200",
        "20032",
        "30150",
        "20286",
        "20020"
      ]
    },
    {
      "hadith_no": "6979",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي قالوا، حدثنا شعبة، عن عون، بن أبي جحيفة عن المنذر بن جرير، عن أبيه، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20173",
        "30201",
        "20318",
        "30150",
        "20286",
        "20020",
        "11383",
        "10831"
      ]
    },
    {
      "hadith_no": "6994",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثناه إسحاق بن إبراهيم، أخبرنا سفيان بن عيينة، وجرير بن عبد الحميد، ووكيع ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا عبيد الله بن معاذ، ويحيى بن حبيب، قالا حدثنا معتمر، ح وحدثنا محمد بن رافع، حدثنا أبو أسامة، كلهم عن إسماعيل، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Isma'il through other chains of narrators.",
      "chain": [
        "20005",
        "30212",
        "20331",
        "30150",
        "20288",
        "30375"
      ]
    },
    {
      "hadith_no": "7017",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن ثابت، عن أنس، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) used to supplicate (in these words):                     \" Our Lord, grant us the good in this world and the good in the Hereafter and save us from the torment of Hell Fire.\"",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7062",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن أبي السفر، عن أبي بكر بن أبي موسى، عن البراء، أن النبي صلى الله عليه وسلم كان إذا أخذ مضجعه قال ‏\"‏ اللهم باسمك أحيا وباسمك أموت ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' reported that whenever Allah's Messenger (may peace be upon him) went to bed, he said:                     \" O Allah, it is with Thine Name that I live and it is with Thine Name that I die.\" And when he got up he used to say:\" Praise is due to Allah, Who gave us life after our death (sleep) and unto Thee is resurrection.\"",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11900",
        "400"
      ]
    },
    {
      "hadith_no": "7076",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي إسحاق، عن أبي بردة بن أبي موسى الأشعري، عن أبيه، عن النبي صلى الله عليه وسلم أنه كان يدعو بهذا الدعاء ‏\"‏ اللهم اغفر لي خطيئتي وجهلي وإسرافي في أمري وما أنت أعلم به مني اللهم اغفر لي جدي وهزلي وخطئي وعمدي وكل ذلك عندي اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني أنت المقدم وأنت المؤخر وأنت على كل شىء قدير ‏\"‏ ‏.‏",
      "text_en": " Abu Musa Ash'ari reported on the authority of his father that Allahs Apostle (may peace be upon him) used to supplicate in these words:                     \" O Allah, forgive me my faults, my ignorance, my immoderation in my concerns. And Thou art better aware (of my affairs) than myself. O Allah, grant me forgiveness (of the faults which I committed) seriously or otherwise (and which I committed inadvertently and de- liberately. All these (failings) are in me. O Allah, grant me forgiveness from the fault which I did in haste or deferred, which I committed in privacy or in public and Thou art better aware of (them) than myself. Thou art the First and the Last and over all things Thou art Omnipotent.\"",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11049",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7091",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا عبيد الله بن معاذ، حدثنا  أبي ح، وحدثنا ابن المثنى، حدثنا ابن أبي عدي، كلهم عن شعبة، بهذا الإسناد وفي حديث معاذ ‏\"‏ أخذتما مضجعكما من الليل ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but. with a slight variation of wording.",
      "chain": [
        "30201",
        "20032",
        "30150",
        "20286",
        "20276"
      ]
    },
    {
      "hadith_no": "7118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، قال كان لمطرف بن عبد الله امرأتان فجاء من عند إحداهما فقالت الأخرى جئت من عند فلانة فقال جئت من عند عمران بن حصين فحدثنا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أقل ساكني الجنة النساء ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain reported that Allah's Messenger (may peace be upon him) said:                      Amongst the inmates of Paradise the women would form a minority.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317"
      ]
    },
    {
      "hadith_no": "7122",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، وسويد بن سعيد، ومحمد بن عبد الأعلى، جميعا عن المعتمر، قال ابن معاذ حدثنا المعتمر بن سليمان، قال قال أبي حدثنا أبو عثمان، عن أسامة بن زيد بن حارثة، وسعيد بن زيد بن عمرو بن نفيل، أنهما حدثا عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ ما تركت بعدي في الناس فتنة أضر على الرجال من النساء ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid b. Harith and Sa'id b. Zaid b. 'Amr b. Naufal both reported Allah's Messenger (may peace be upon him) as saying:                      I have not left after me turmoil for the people but the harm done to men by women.",
      "chain": [
        "30150",
        "30547",
        "20288",
        "20288",
        "11289",
        "11113",
        "50",
        "11"
      ]
    },
    {
      "hadith_no": "7134",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا أبو يونس، عن سماك، قال خطب النعمان بن بشير فقال ‏\"‏ لله أشد فرحا بتوبة عبده من رجل حمل زاده ومزاده على بعير ثم سار حتى كان بفلاة من الأرض فأدركته القائلة فنزل فقال تحت شجرة فغلبته عينه وانسل بعيره فاستيقظ فسعى شرفا فلم ير شيئا ثم سعى شرفا ثانيا فلم ير شيئا ثم سعى شرفا ثالثا فلم ير شيئا فأقبل حتى أتى مكانه الذي قال فيه فبينما هو قاعد إذ جاءه بعيره يمشي حتى وضع خطامه في يده فلله أشد فرحا بتوبة العبد من هذا حين وجد بعيره على حاله ‏\"‏ ‏.‏ قال سماك فزعم الشعبي أن النعمان رفع هذا الحديث إلى النبي صلى الله عليه وسلم وأما أنا فلم أسمعه ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      Allah is more pleased with the repentance of a believing servant than of a person who set out on a journey with a provision of food and drink on the back of his camel. He went on until he came to a waterless desert and he felt like sleeping. So he got down under the shade of a tree and was overcome by sleep and his camel ran away. As he got up he tried to see (the camel) standing upon a mound. but did not find it. He then got upon the other mound, but could not see anything. He then climbed upon the third mound but did not see anything until he came back to the place where he had been previously. And as he was sitting (in utter disappointment) there came to him the camel, till that (camel) placed its nosestring in his hand. Allah is more pleased with the repentance of His servant than the person who found (his lost camel) in this very state. Simak reported that Sha'bi was of the opinion that Nu'min traced it to Allah's Apostle (may peace be upon him). Simak, however, did not hear that himself.",
      "chain": [
        "30150",
        "20286",
        "10770"
      ]
    },
    {
      "hadith_no": "7160",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن قتادة، سمع  عقبة بن عبد الغافر، يقول سمعت أبا سعيد الخدري، يحدث عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا فيمن كان قبلكم راشه الله مالا وولدا فقال لولده لتفعلن ما آمركم به أو لأولين ميراثي غيركم إذا أنا مت فأحرقوني - وأكثر علمي أنه قال - ثم اسحقوني واذروني في الريح فإني لم أبتهر عند الله خيرا وإن الله يقدر على أن يعذبني - قال - فأخذ منهم ميثاقا ففعلوا ذلك به وربي فقال الله ما حملك على ما فعلت فقال مخافتك ‏.‏ قال فما تلافاه غيرها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that Allah's Messenger (may peace be upon him) said that a person amongst the earlier nations before you was conferred property and children by Allah, He said to his children:                      'You must do as I command you to do, otherwise I will make others besides you as my inheritors. As I die, burn my body and blow my ashes in the wind as I do not find any merit of mine which would please Allah, and if Allah were to take hold of me, He would punish me. He took a pledge from them and they did as he commanded thein to do. Allah said: What prompted you to do this? He said: My Lord. Thine fear, and Allah did not punish him at all.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "7185",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن قتادة، أنه سمع  أبا الصديق الناجي، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا قتل تسعة وتسعين نفسا فجعل يسأل هل له من توبة فأتى راهبا فسأله فقال ليست لك توبة ‏.‏ فقتل الراهب ثم جعل يسأل ثم خرج من قرية إلى قرية فيها قوم صالحون فلما كان في بعض الطريق أدركه الموت فنأى بصدره ثم مات فاختصمت فيه ملائكة الرحمة وملائكة العذاب فكان إلى القرية الصالحة أقرب منها بشبر فجعل من أهلها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying that a man killed ninety-nine persons and then he began to make an inquiry whether there was any way left for him for repentance. He came to a monk and asked him about that, and he said:                      There is no chance for repentance for you. He killed the monk also and then began to make an inquiry and moved from one village to another village where there lived pious persons, and as he had covered some distance, he was overtaken by death, but he managed to crawl upon his chest (to the side nearer to the place where the pious men lived). He died and then there was a dispute between the angels of mercy and the angels of punishment and (when it was measured) he was found to be nearer to the village where pious persons were living equal to the Space of a span and he was thus included among them.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11268",
        "38"
      ]
    },
    {
      "hadith_no": "7208",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - قال سمعت عبد الله بن يزيد، يحدث عن زيد بن ثابت، أن النبي صلى الله عليه وسلم خرج إلى أحد فرجع ناس ممن كان معه فكان أصحاب النبي صلى الله عليه وسلم فيهم فرقتين قال بعضهم نقتلهم ‏.‏ وقال بعضهم لا ‏.‏ فنزلت ‏{‏ فما لكم في المنافقين فئتين‏}‏",
      "text_en": " Zaid b. Thabit reported that Allah's Apostle (may peace be upon him) set out for Uhud. Some of those persons who were with them came back. The Companions of Allah's Apostle (may peace be upon him) were divided in two groups. One group said:                      We would kill them, and the other one said: No, this should not be done, and it was on this occasion that this verse was revealed:\" Why should you, then, be two parties in relation to hypocrites?\" (iv. 88).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "1945",
        "49"
      ]
    },
    {
      "hadith_no": "7215",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا قرة بن خالد، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يصعد الثنية ثنية المرار فإنه يحط عنه ما حط عن بني إسرائيل ‏\"‏ ‏.‏ قال فكان أول من صعدها خيلنا خيل بني الخزرج ثم تتام الناس فقال رسول الله صلى الله عليه وسلم ‏\"‏ وكلكم مغفور له إلا صاحب الجمل الأحمر ‏\"‏ ‏.‏ فأتيناه فقلنا له تعال يستغفر لك رسول الله صلى الله عليه وسلم فقال والله لأن أجد ضالتي أحب إلى من أن يستغفر لي صاحبكم ‏.‏ قال وكان رجل ينشد ضالة له ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) said:                      He who climbed this hill, the hill of Murar, his sins would be obliterated as were obliterated the sins of Bani Isra'il. So the first to take their horses were the people of Banu Khazraj. Then there was a ceaseless flow of persons and Allah's Messenger (may peace be upon him) said to them: All of you are those who have been pardoned except the owner of a red camel. We came to him and said to him: You also come on, so that Allah's Messenger (may peace be upon him) may seek forgiveness for you. But he said: By Allah, so far as I am concerned, the finding of something lost is dearer to me than seeking of forgiveness for me by your companion (the Holy Prophet), and he remained busy in finding out his lost thing.",
      "chain": [
        "30150",
        "20286",
        "11301",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "7242",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الحميد الزيادي، أنه سمع أنس بن مالك، يقول قال أبو جهل اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم ‏.‏ فنزلت ‏{‏ وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم ألا يعذبهم الله وهم يصدون عن المسجد الحرام‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Anas b. Malik reported that Abu Jahl said:                      O Allah, if he is true, then shower upon us the volley of stones from the sky or inflict upon us a grievous torment, and it was on this occasion that this verse was revealed:\" 'Allah would never torment them so long as you are amongst them. And Allah is not going to torment them as long as they seek forgiveness. And why is it that Allah should not torment them and they prevent people from coming to the sacred mosque....\" (viii. 34) to the end.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "19"
      ]
    },
    {
      "hadith_no": "7243",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ، ومحمد بن عبد الأعلى القيسي، قالا حدثنا المعتمر، عن أبيه، حدثني نعيم بن أبي هند، عن أبي حازم، عن أبي هريرة، قال قال أبو جهل هل يعفر محمد وجهه بين أظهركم قال فقيل نعم ‏.‏ فقال واللات والعزى لئن رأيته يفعل ذلك لأطأن على رقبته أو لأعفرن وجهه في التراب - قال - فأتى رسول الله صلى الله عليه وسلم وهو يصلي زعم ليطأ على رقبته - قال - فما فجئهم منه إلا وهو ينكص على عقبيه ويتقي بيديه - قال - فقيل له ما لك فقال إن بيني وبينه لخندقا من نار وهولا وأجنحة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو دنا مني لاختطفته الملائكة عضوا عضوا ‏\"‏ ‏.‏ قال فأنزل الله عز وجل لا ندري في حديث أبي هريرة أو شىء بلغه ‏{‏ كلا إن الإنسان ليطغى * أن رآه استغنى * إن إلى ربك الرجعى * أرأيت الذي ينهى * عبدا إذا صلى * أرأيت إن كان على الهدى * أو أمر بالتقوى * أرأيت إن كذب وتولى‏}‏ - يعني أبا جهل - ‏{‏ ألم يعلم بأن الله يرى * كلا لئن لم ينته لنسفعا بالناصية * ناصية كاذبة خاطئة * فليدع ناديه * سندع الزبانية * كلا لا تطعه‏}‏ زاد عبيد الله في حديثه قال وأمره بما أمره به ‏.‏ وزاد ابن عبد الأعلى فليدع ناديه يعني قومه ‏.‏",
      "text_en": " Abu Huraira reported that Abu Jahl asked (people) whether Mubammad placed his face (on the ground) in their presence. It was said to him:                      Yes. He said: By Lit and Uzza. If I were to see him do that, I would trample his neck, or I would beamear his face with dust. He came to Allah's Messenger (may peace be upon him) as he was engaged in prayer and thought of trampling his neck (and the people say) that he came near him but turned upon his heels and tried to repulse something with his hands. It was said to him: What is the matter with you? He said: There is between me and him a ditch of fire and terror and wings. Thereupon Allah's Messenger (may peace he upon him) said: If he were to come near me the angels would have torn him to pieces. Then Allah, the Exalted and Glorious, revealed this verse- (the narrator) said: We do not whether it is the hadith transmitted te Abu Huraira or something conveyed to him from another source:\" Nay, man is surely inordinate, because he looks upon himself as self-sufficient. Surely to thy Lord is the return. Hast thou seen him who forbids a servant when he prays? Seest thou if he is on the right way, or enjoins observance of piety? Seest thou if he [Abu Jah]] denies and turns away? Knowest he not that Allah sees? Nay. if he desists not, We will seize him by the forelock-a lying, sinful forelock. Then let him summon his council. We will summon the guards of the Hell. Nay! Obey not thou him\" (Icvi. 6-19). (Rather prostrate thyself.) Ubaidullah made this addition: It was after this that (prostration) was enjoined upon and Ibn Abd al-Ala made this addition that by Nadia he meant his people.",
      "chain": [
        "30150",
        "20288",
        "11289",
        "10973",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "7251",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الأعمش، عن  إبراهيم، عن أبي معمر، عن عبد الله بن مسعود، قال انشق القمر على عهد رسول الله صلى الله عليه وسلم فلقتين فستر الجبل فلقة وكانت فلقة فوق الجبل فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported that the moon was split up in two parts during the lifetime of Allah's Messenger (may peace be upon him). The mountain covered one of its parts and one part of it was above the mountain and Allah's Messenger (may peace be upon him) said:                      Bear witness to this.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7252",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن الأعمش، عن مجاهد، عن  ابن عمر، عن النبي صلى الله عليه وسلم مثل ذلك ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11060",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "7261",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي عمران الجوني، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقول الله تبارك وتعالى لأهون أهل النار عذابا لو كانت لك الدنيا وما فيها أكنت مفتديا بها فيقول نعم فيقول قد أردت منك أهون من هذا وأنت في صلب آدم أن لا تشرك - أحسبه قال - ولا أدخلك النار فأبيت إلا الشرك ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported Allah's Messenger (may peace be upon him) as saying:                      Allah, the Exalted and High, would say to one who shall have to undergo the least torture (on the Day of Resurrection): Would you like to go as ransom if you had all worldly riches; he would say: Yes. Allah would say to him: When you were in the loins of Adam, I demadded from you something easier than this that you should not associate anything with Me. (The narrator says): I think He also said: I would not cause you to enter Hell-Fire but you defied and attributed Divinity (to others besides Me).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "7366",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني معبد بن خالد، أنه سمع حارثة بن وهب، أنه سمع النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأهل الجنة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال صلى الله عليه وسلم ‏\"‏ كل ضعيف متضعف لو أقسم على الله لأبره ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أخبركم بأهل النار ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ كل عتل جواظ مستكبر ‏\"‏ ‏.‏",
      "text_en": " Haritha b. Wahb reported that he heard Allah's Apostle (may peace be upon him) as saying:                      May I not inform you about the inmates of Paradise? They said: Do this, of course. Thereupon Allah's Apostle (may peace be upon him) said: Every humble person who is considered to be humble if he were to adjure In the name of Allah, He would fulfil it. He then said: May I not inform you about the denizens of Hell-Fire? They said: Yes. And he said: Every haughty, fat and proud (person).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "7380",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا عبيد الله بن معاذ، حدثنا  أبي كلاهما، عن شعبة، ح وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قام فينا رسول الله صلى الله عليه وسلم خطيبا بموعظة فقال ‏\"‏ يا أيها الناس إنكم تحشرون إلى الله حفاة عراة غرلا ‏{‏ كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ ألا وإن أول الخلائق يكسى يوم القيامة إبراهيم عليه السلام ألا وإنه سيجاء برجال من أمتي فيؤخذ بهم ذات الشمال فأقول يا رب أصحابي ‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك ‏.‏ فأقول كما قال العبد الصالح ‏{‏ وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شىء شهيد * إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم‏}‏ قال فيقال لي إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏\"‏ ‏.‏ وفي حديث وكيع ومعاذ ‏\"‏ فيقال إنك لا تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through other chains of transmitters on the authority of Ibn Abbas, (and) the words are:                      While Allah's Messenger (may peace be upon him) stood up to deliver a sermon, he said: 0 people, Allah would make you assemble barefooted, naked and uncircumcised (and then recited the words of the Qur'an):\" As We created you for the first time, We shall repeat it. (It is) a promise (binding) upon us. Lo! We are to perform it, and the first person who would be clothed on the Day of Resurrection would be (Hadrat) Ibrahim (peace be upon him)\" and, behold! some persons of my Ummah would be brought and taken to the left and I would say: My Lord, they are my companions, and it would be said: You do not know what they did after you, and I would say just as the pious servant (Hadrat 'Isa) said:, I was a witness regarding them as I remained among them and Thou art a witness over everything, so if Thou chastisest them, they are Thy servants and if Thou for- givest them, Thou art Mighty, Wise\" (v. 117-118). And it would be said to him: They constantly turned to their heels since you left them. This hadith has been transmitted on the authority of Waki' and Mu'adh (and the words are):\" What new things they fabricated.\"",
      "chain": [
        "30201",
        "20032",
        "30150",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "7394",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا عبيد الله بن معاذ، حدثنا  أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، كلهم عن شعبة، عن عون بن أبي جحيفة، ح وحدثني زهير بن حرب، ومحمد بن المثنى، وابن، بشار جميعا عن يحيى القطان، - واللفظ لزهير - حدثنا يحيى بن سعيد، حدثنا شعبة، حدثني عون، بن أبي جحيفة عن أبيه، عن البراء، عن أبي أيوب، قال خرج رسول الله صلى الله عليه وسلم بعد ما غربت الشمس فسمع صوتا فقال ‏\"‏ يهود تعذب في قبورها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Ayyub through some other chains of transmitters (and the words are):                     \" Allah's Messenger (may peace be upon him) went out after the sun had set and he heard some sound and said: It is the Jews who are being tormented in their graves.",
      "chain": [
        "30201",
        "20032",
        "30150",
        "20286",
        "30170",
        "30160",
        "20173",
        "20020",
        "11383",
        "30022",
        "30170"
      ]
    },
    {
      "hadith_no": "7468",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن فرات القزاز، عن  أبي الطفيل، عن أبي سريحة، حذيفة بن أسيد قال كان النبي صلى الله عليه وسلم في غرفة ونحن أسفل منه فاطلع إلينا فقال ‏\"‏ ما تذكرون ‏\"‏ ‏.‏ قلنا الساعة ‏.‏ قال ‏\"‏ إن الساعة لا تكون حتى تكون عشر آيات خسف بالمشرق وخسف بالمغرب وخسف في جزيرة العرب والدخان والدجال ودابة الأرض ويأجوج ومأجوج وطلوع الشمس من مغربها ونار تخرج من قعرة عدن ترحل الناس ‏\"‏ ‏.‏ قال شعبة وحدثني عبد العزيز بن رفيع عن أبي الطفيل عن أبي سريحة ‏.‏ مثل ذلك لا يذكر النبي صلى الله عليه وسلم وقال أحدهما في العاشرة نزول عيسى ابن مريم صلى الله عليه وسلم ‏.‏ وقال الآخر وريح تلقي الناس في البحر ‏.‏",
      "text_en": " Hudhaifa b. Usaid reported:                      Allah's Apostle (may peace be upon him) was in an apartment and we were beneath that that he peeped in and said to us: What are you discussing about? We said: (We are discussing about the Last) Hour. Thereupon he said: The Last Hour would not come until the ten signs dppear: land-sliding in the east, and land-sliding in the west, and land-sliding in the peninsula of Arabia, the smoke, the Dajjal, the beast of the earth, Gog and Magog, the rising of the sun from the west and the fire which would emit from the lower part of 'Adan. Shu'ba said that 'Abd al-'Aziz b. Rufai' reported on the authority of Abu Tufail who reported on the authority of Abu Sariha a hadith like this that Allah's Apostle (may peace be upon him) did not make a mention of (the tenth sign) but he said that out of the ten one was the descent of Jesus Christ, son of Mary (peace be upon him), and in another version it is theb lowing of the violent gale which would drive the people to the ocean.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11384",
        "3660"
      ]
    },
    {
      "hadith_no": "7537",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن المنكدر، قال رأيت جابر بن عبد الله يحلف بالله أن ابن صائد الدجال، فقلت أتحلف بالله قال إني سمعت عمر يحلف على ذلك عند النبي صلى الله عليه وسلم فلم ينكره النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Muhammad b. Munkadir reported:                      As I saw Jabir b. 'Abdullah taking an oath in the name of Allah that it was Ibn Sa'id who was the Dajjal I said: Do you take an oath in the name of Allah? Thereupon he said: I heard 'Umar taking an oath in the presence of Allah's Apostle (may peace be upon him) to this effect but Allah's Apostle (may peace be upon him) did not disapprove of it.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11063",
        "11048"
      ]
    },
    {
      "hadith_no": "7553",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن عمير، عن ربعي بن، حراش عن حذيفة، عن النبي صلى الله عليه وسلم أنه قال في الدجال ‏\"‏ إن معه ماء ونارا فناره ماء بارد وماؤه نار فلا تهلكوا ‏\"‏ ‏.‏   قال أبو مسعود وأنا سمعته من، رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa reported Allah's Messenger (may peace be upon him) as saying:                      the Dajjal would have with him water and fire and his fire would bays the effect of cold water and his water would have the effect of fire, so don't put yourself to ruin. Abu Mas'ud reported: I also heard it from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "30170",
        "20173",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7568",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن النعمان بن سالم، قال سمعت يعقوب بن عاصم بن عروة بن مسعود الثقفي، يقول سمعت عبد الله بن عمرو، وجاءه رجل فقال ما هذا الحديث الذي تحدث به تقول إن الساعة تقوم إلى كذا وكذا ‏.‏ فقال سبحان الله - أو لا إله إلا الله أو كلمة نحوهما - لقد هممت أن لا أحدث أحدا شيئا أبدا إنما قلت إنكم سترون بعد قليل أمرا عظيما يحرق البيت ويكون ويكون ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يخرج الدجال في أمتي فيمكث أربعين - لا أدري أربعين يوما أو أربعين شهرا أو أربعين عاما - فيبعث الله عيسى ابن مريم كأنه عروة بن مسعود فيطلبه فيهلكه ثم يمكث الناس سبع سنين ليس بين اثنين عداوة ثم يرسل الله ريحا باردة من قبل الشأم فلا يبقى على وجه الأرض أحد في قلبه مثقال ذرة من خير أو إيمان إلا قبضته حتى لو أن أحدكم دخل في كبد جبل لدخلته عليه حتى تقبضه ‏\"‏ ‏.‏ قال سمعتها من رسول الله صلى الله عليه وسلم قال ‏\"‏ فيبقى شرار الناس في خفة الطير وأحلام السباع لا يعرفون معروفا ولا ينكرون منكرا فيتمثل لهم الشيطان فيقول ألا تستجيبون فيقولون فما تأمرنا فيأمرهم بعبادة الأوثان وهم في ذلك دار رزقهم حسن عيشهم ثم ينفخ في الصور فلا يسمعه أحد إلا أصغى ليتا ورفع ليتا - قال - وأول من يسمعه رجل يلوط حوض إبله - قال - فيصعق ويصعق الناس ثم يرسل الله - أو قال ينزل الله - مطرا كأنه الطل أو الظل - نعمان الشاك - فتنبت منه أجساد الناس ثم ينفخ فيه أخرى فإذا هم قيام ينظرون ثم يقال يا أيها الناس هلم إلى ربكم ‏.‏ وقفوهم إنهم مسئولون - قال - ثم يقال أخرجوا بعث النار فيقال من كم فيقال من كل ألف تسعمائة وتسعة وتسعين - قال - فذاك يوم يجعل الولدان شيبا وذلك يوم يكشف عن ساق ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr reported that a person came to him and said:                      What is this hadith that you narrate that the Last Hour would come at such and such time? Thereupon he said: Hallowed be Allah, there is no god but Allah (or the words to the same effect). I have decided that I would not narrate anything to anyone now. I had only said that you would see after some time an important event that the (sacred) House (Ka'ba) would be burnt and it would happen and definitely happen. He then reported that Allah's Messenger (may peace be upon him) said: The Dajjal would appear in my Ummah and he would stay (in the world) for forty-I cannot say whether he meant forty days, forty months or forty years. And Allah would then send Jesus son of Mary who would resemble 'Urwa b Mas'ud. He (Jesus Christ) would chase him and kill him. Then people would live for seven years that there would be no ran. cour between two persons. Then Allah would send cold wind from the side of Syria that none would survive upon the earth having a speck of good in him or faith in him but he would die, so much so that even if some amongst you were to enter the innermost part of the mountain, this wind would reach that place also and that would cause his heath. I heard Allah's Messenger (may peace be upon him) as saying: Only the wicked people would survive and they would be as careless as birds with the charactertistics of beasts. They would never appreciate the good nor condemn evil. Then the Satan would come to them in human form and would say: Don't you respond? And they would say: What do you order us? And he would command them to worship the idols but, in spite of this, they would have abundance of sustenance and lead comfortable lives. Then the trumpet would be blown and no one would hear that but he would bend hfs neck to one side and raise it from the other side and the first one to hear that trumpet would be the person who would be busy in setting right the tank meant for providing water to the camels. He would swoon and the other people would also swoon, then Allah would send or He would cause to send rain which would be like dew and there would grow out of it the bodies of the people. Then the second trumpet would be blown and they would stand up and begin to look (around). Then it would be said: O people, go to your Lord, and make them stand there. And they would be questioned. Then it would be said: Bring out a group (out of them) for the Hell-Fire. And then it would be asked: How much? It would be said: Nine hundred and ninty-nine out of one thousand for the Hell-Fire and that would be the day which would make the children old because of its terror and that would be the day about which it has been said:\" On the day when the shank would be uncovered\" (lxviii. 42).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10972"
      ]
    },
    {
      "hadith_no": "7595",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن الوليد، حدثنا محمد، بن جعفر قالا حدثنا شعبة، عن أبي التياح، عن أنس، عن النبي صلى الله عليه وسلم بهذا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "7726",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، قال اختلف أهل الكوفة في هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم‏}‏ فرحلت إلى ابن عباس فسألته عنها فقال لقد أنزلت آخر ما أنزل ثم ما نسخها شىء ‏.‏",
      "text_en": " Sa'id b. Jubair reported:                      The inhabitants of Kufa differed in regard to this verse:\" But whoever slays another believer intentionally, his requital shall be Hell\" (iv. 92), so I went to Ibn 'Abbas and asked him about it, whereupon he said: This has been revealed and nothing abrogated it.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11655",
        "11050"
      ]
    },
    {
      "hadith_no": "153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي بكر، - يعني ابن حفص بن عمر بن سعد - سمع أبا عبد الله، عن أبي عبد الرحمن السلمي، أنه شهد عبد الرحمن بن عوف يسأل بلالا عن وضوء رسول الله صلى الله عليه وسلم فقال كان يخرج يقضي حاجته فآتيه بالماء فيتوضأ ويمسح على عمامته وموقيه ‏.‏ قال أبو داود هو أبو عبد الله مولى بني تيم بن مرة ‏.‏",
      "text_en": " Abu ‘Abd al-Rahman al-Sulami said that he witnessed ‘Abd al-Rahman b. ‘Awf asking Bilal about the ablution of the Prophet (ﷺ). Bilal said:                      He went out to relieve himself. Then I brought water for him and he performed ablution, and wiped over his turban and socks.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11180",
        "30184",
        "11359"
      ]
    },
    {
      "hadith_no": "294",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت استحيضت امرأة على عهد رسول الله صلى الله عليه وسلم فأمرت أن تعجل العصر وتؤخر الظهر وتغتسل لهما غسلا ‏.‏ وأن تؤخر المغرب وتعجل العشاء وتغتسل لهما غسلا وتغتسل لصلاة الصبح غسلا ‏.‏ فقلت لعبد الرحمن أعن النبي صلى الله عليه وسلم فقال لا أحدثك عن النبي صلى الله عليه وسلم بشىء ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     A woman had a prolonged flow of blood in the time of the Messenger of Allah (ﷺ). She was commanded to advance the afternoon prayer and delay the noon prayer, and to take a bath for them only once; and to delay the sunset prayer and advance the night prayer and to take a bath only once for them; and to take a bath separately for the dawn prayer. I (Shu'bah) asked AbdurRahman: (Is it) from the Prophet (ﷺ)? I do not report to you anything except from the Prophet (ﷺ).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "316",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، أخبرني أبي، عن شعبة، عن إبراهيم، - يعني ابن مهاجر - عن صفية بنت شيبة، عن عائشة، أن أسماء، سألت النبي صلى الله عليه وسلم بمعناه قال ‏\"‏ فرصة ممسكة ‏\"‏ ‏.‏ قالت كيف أتطهر بها قال ‏\"‏ سبحان الله تطهري بها واستتري بثوب ‏\"‏ ‏.‏ وزاد وسألته عن الغسل من الجنابة فقال ‏\"‏ تأخذين ماءك فتطهرين أحسن الطهور وأبلغه ثم تصبين على رأسك الماء ثم تدلكينه حتى يبلغ شئون رأسك ثم تفيضين عليك الماء ‏\"‏ ‏.‏ قال وقالت عائشة نعم النساء نساء الأنصار لم يكن يمنعهن الحياء أن يسألن عن الدين ويتفقهن فيه ‏.‏",
      "text_en": " 'Aishah said:                      Asma' asked the Prophet (ﷺ) and then narrated the rest of the tradition to the same effect. He (the Prophet) said: \"a musk-scented piece of cloth.\" She (Asma') said: How should I purify with it ? He said: By glory of Allah ! Purify with it, and he covered his face with the cloth. This version also adds: \"She asked about the washing because of sexual defilement.\" He said: Take your water and purify yourself as best as possible. Then pour water over yourself. 'Aishah said: The best of the women are the women of the Ansar. Shyness would not prevent them from inquiring about religion and from acquiring deep understanding in it.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10739",
        "2802",
        "53",
        "70"
      ]
    },
    {
      "hadith_no": "367",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا الأشعث، عن محمد بن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في شعرنا أو في لحفنا ‏.‏ قال عبيد الله شك أبي ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) would not pray in our wrappers or in our quilts. Ubaydullah said: My father (Mu'adh) doubted this.",
      "chain": [
        "30150",
        "20286",
        "485",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "396",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن قتادة، سمع أبا أيوب، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ وقت الظهر ما لم تحضر العصر ووقت العصر ما لم تصفر الشمس ووقت المغرب ما لم يسقط فور الشفق ووقت العشاء إلى نصف الليل ووقت صلاة الفجر ما لم تطلع الشمس ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Amr reported the Prophet (ﷺ) as saying:                      The time of the Zuhr prayer is as along as the time of the 'Asr prayer has not come; the time of the Asr prayer is as long as the sun has not become yellow ; the time of the Maghrib prayer is as long as the twilight has not ended; the time of the Isha prayer is up to midnight; and the time of the Fajr prayer is as long as the sun has not risen.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "33",
        "29"
      ]
    },
    {
      "hadith_no": "576",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا شعبة، عن يعلى بن عطاء، عن جابر بن يزيد، عن أبيه، قال صليت مع النبي صلى الله عليه وسلم الصبح بمنى بمعناه ‏.‏",
      "text_en": " Jabir b. Yazid reported on the authority of his father:                      I said the morning prayer along with the prophet (ﷺ) at Mina. He narrated the rest of the tradition to the same effect.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10986"
      ]
    },
    {
      "hadith_no": "583",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الحديث قال فيه ‏\"‏ ولا يؤم الرجل الرجل في سلطانه ‏\"‏ ‏.‏ قال أبو داود كذا قال يحيى القطان عن شعبة ‏\"‏ أقدمهم قراءة ‏\"‏ ‏.‏",
      "text_en": " The version of this tradition narrated through a different chain by Shu’bah has the words:                      “A man should not lead the another man in prayer.Abu Dawud said: Yahya al-Qattan narrated from Shu’bah in a similar way, i.e. the earliest of them in recitation.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "20031"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا الأشعث، عن محمد، - يعني ابن سيرين - عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في شعرنا أو لحفنا ‏.‏ قال عبيد الله شك أبي ‏.‏",
      "text_en": " ‘A’ishah said; The Messenger of Allah (ﷺ) would not pray on our sheets of cloth or on our quits. ‘Ubaid allah said:                      My father doubted.",
      "chain": [
        "30150",
        "20286",
        "485",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "657",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أنس بن سيرين، عن أنس بن مالك، قال قال رجل من الأنصار يا رسول الله إني رجل ضخم - وكان ضخما - لا أستطيع أن أصلي معك - وصنع له طعاما ودعاه إلى بيته - فصل حتى أراك كيف تصلي فأقتدي بك ‏.‏ فنضحوا له طرف حصير كان لهم فقام فصلى ركعتين ‏.‏ قال فلان بن الجارود لأنس بن مالك أكان يصلي الضحى قال لم أره صلى إلا يومئذ ‏.‏",
      "text_en": " Anas b. Malik reported:                      A man from the Ansar said: I am a corpulent man-and he was (actually) a fat man; I cannot pray along with you. He prepared food for him and invited him to his house. (he said) (please) pray (here) so that I may see how you pray, and then I would follow you. They (the people) washed one side of their mat. He (the prophet) then got up and prayed two Rak’ahs. Ibn al-Jarud asked Anas b. Malik: would he (the prophet) say the forenoon prayer? He replied: I did not see him offering this prayer except that day.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا خالد بن الحارث، حدثنا حاتم، - يعني ابن أبي صغيرة - عن سماك، قال سمعت النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يسوي صفوفنا إذا قمنا للصلاة فإذا استوينا كبر ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Messenger of Allah (ﷺ) used to straighten our rows when we stood up to pray, and when we were straight, he said: Allah is most great (takbir).",
      "chain": [
        "30150",
        "20226",
        "11274",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "746",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي ح، وحدثنا موسى بن مروان، حدثنا شعيب، - يعني ابن إسحاق المعنى - عن عمران، عن لاحق، عن بشير بن نهيك، قال قال أبو هريرة لو كنت قدام النبي صلى الله عليه وسلم لرأيت إبطيه ‏.‏ زاد ابن معاذ قال يقول لاحق ألا ترى أنه في الصلاة ولا يستطيع أن يكون قدام رسول الله صلى الله عليه وسلم وزاد موسى يعني إذا كبر رفع يديه ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     If I were in front of the Prophet (ﷺ), I would see his armpits. Ibn Mu'adh added that Lahiq said: Do you not see, AbuHurayrah could not stand in front of the Prophet (ﷺ) while he was praying. Musa added: When he uttered the takbir, he raised his hands.",
      "chain": [
        "30150",
        "20286",
        "35154",
        "20239",
        "123",
        "11313",
        "11266"
      ]
    },
    {
      "hadith_no": "760",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا عبد العزيز بن أبي سلمة، عن عمه الماجشون بن أبي سلمة، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة كبر ثم قال ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا مسلما وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين اللهم أنت الملك لا إله لي إلا أنت أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك أنا بك وإليك تباركت وتعاليت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ وإذا ركع قال ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت خشع لك سمعي وبصري ومخي وعظامي وعصبي ‏\"‏ ‏.‏ وإذا رفع قال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ملء السموات والأرض وملء ما بينهما وملء ما شئت من شىء بعد ‏\"‏ ‏.‏ وإذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت سجد وجهي للذي خلقه وصوره فأحسن صورته وشق سمعه وبصره وتبارك الله أحسن الخالقين ‏\"‏ ‏.‏ وإذا سلم من الصلاة قال ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم والمؤخر لا إله إلا أنت ‏\"‏ ‏.‏",
      "text_en": " ‘Ali b. Ali Talib said:                      When the Messenger of Allah (ﷺ) stood up for prayer, he uttered the takbir (Allah is most great), then said: I have turned my face, breaking with all others, towards Him Who created the heavens and the earth, and I am not a polytheist. My prayer and my devotion, my life and my death belong to Allah, the Lord of the Universe, Who has no partner. That is what I have been commanded, and I am first of Muslims (those who surrender themselves). O Allah, Thou art the King. There is no God but Thee. Thou art my Lord and I am Thy servant. I have wronged myself, but I acknowledge my sin, so forgive me all my sins; Thou Who alone canst forgive sins; and guide me to the best qualities. Thou Who alone canst guide to the best of them; and turn me from evil ones. Thou who alone canst turn from evil qualities. I come to serve and please Thee. All good is in Thy Hands, and evil does not pertain to Thee. I seek refuge in Thee and turn to Thee, Who art blessed and exalted. I ask Thy forgiveness and turn to thee in repentance. When he bowed, he said: O Allah, to Thee I bow, in Thee I trust, and to Thee I submit myself. My hearing, my sight, my brain, my bone and my sinews humble themselves before Thee. When he raised his head, he said: Allah listens to him who praises Him. O our lord, and all praises be to Thee in the whole of the heavens and the earth, and what is between them, and in whatever Thou creates afterwards. When he prostrated himself, he said: O Allah, to Thee I prostrate myself, to Thee I trust, and to Thee I submit myself. My face prostrated itself before Him Who created it, fashioned it, and fashioned it in the best shape, and brought forth its hearing and seeing. Blessed is Allah, the best of creators. When he saluted at the end of the prayer, he said: O Allah, forgive me my former and my latter sins, my open and secret sins, my sins in exceeding the limits, and what Thou knowest better than I. Thou art He Who puts forward and puts back. There is deity but Thee.",
      "chain": [
        "30150",
        "20286",
        "32017",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "806",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سماك، سمع جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم إذا دحضت الشمس صلى الظهر وقرأ بنحو من ‏{‏ والليل إذا يغشى ‏}‏ والعصر كذلك والصلوات كذلك إلا الصبح فإنه كان يطيلها ‏.‏",
      "text_en": " Jabir b. samurah said:                      When the sun declined, the Messenger of Allah (ﷺ) offered the noon prayer and recited surahs lie \"By the night when it covers over\" (92) and (recited similar surahs) in the afternoon prayer, and in the other prayers except the dawn prayer which he used to prolong.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "815",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا قرة، عن النزال بن عمار، عن أبي عثمان النهدي، أنه صلى خلف ابن مسعود المغرب فقرأ ب ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " Abu’Uthman al-Nahdl said that he offered the sunset prayer behind Ibn mas’ud, when he recited “Say:                      He is Allah, the One” (Surah 112).",
      "chain": [
        "30150",
        "20286",
        "11301",
        "11113"
      ]
    },
    {
      "hadith_no": "915",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا عبد الرحمن، - يعني ابن أبي الزناد - قال سمعت هشاما، يحدث عن أبيه، عن عائشة، بهذا الخبر قال وأخذ كرديا كان لأبي جهم فقيل يا رسول الله الخميصة كانت خيرا من الكردي ‏.‏",
      "text_en": " The above-mentioned tradition has also been narrated by ‘A’ishah through a different chain of transmitters. This version adds:                      He (the prophet) took a kind of sheet of cloth known as kurdi which belongs to Abu Jahm. The people told him; Messenger of Allah, the (former) sheet of cloth was better than this kind of kurdi sheet.",
      "chain": [
        "30150",
        "20286",
        "20509",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "959",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا عبد الوهاب، قال سمعت يحيى، قال سمعت القاسم، يقول أخبرني عبد الله بن عبد الله، أنه سمع عبد الله بن عمر، يقول من سنة الصلاة أن تضجع رجلك اليسرى وتنصب اليمنى ‏.‏",
      "text_en": " (There is another chain) reported from Yahya who said:                      \"I heard Al-Qasim saying: \"Abdullah bin 'Abdullah informed me that he heard 'Abdullah bin 'Umar saying: \"From the Sunnah of the prayer is to lay your left foot on the ground, and raise your right foot.\"",
      "chain": [
        "30150",
        "20259",
        "20031",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1237",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، أن النبي صلى الله عليه وسلم صلى بأصحابه في خوف فجعلهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم النبي صلى الله عليه وسلم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Narrated Sahl b. Abi Hathmah:                     The Prophet (ﷺ) prayed in time of danger and divided them (the people) behind him in two rows. He then led those who were near him in one rak'ah. Then he stood and remained standing till those who were in second row offered one rak'ah. Thereafter they came forward and those who were in front of them (in the first row) stepped backward. The Prophet (ﷺ) led them in one rak'ah of prayer. He sat down till those who were in the second row completed on rak'ah. He then uttered the salutation.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "hadith_no": "1248",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا الأشعث، عن الحسن، عن أبي بكرة، قال صلى النبي صلى الله عليه وسلم في خوف الظهر فصف بعضهم خلفه وبعضهم بإزاء العدو فصلى بهم ركعتين ثم سلم فانطلق الذين صلوا معه فوقفوا موقف أصحابهم ثم جاء أولئك فصلوا خلفه فصلى بهم ركعتين ثم سلم فكانت لرسول الله صلى الله عليه وسلم أربعا ولأصحابه ركعتين ركعتين ‏.‏ وبذلك كان يفتي الحسن ‏.‏ قال أبو داود وكذلك في المغرب يكون للإمام ست ركعات وللقوم ثلاثا ثلاثا ‏.‏ قال أبو داود وكذلك رواه يحيى بن أبي كثير عن أبي سلمة عن جابر عن النبي صلى الله عليه وسلم وكذلك قال سليمان اليشكري عن جابر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated AbuBakrah:                     The Prophet (ﷺ) offered the noon prayer in time of danger. Some of the people formed a row behind him and others arrayed themselves against the enemy. He led them in two rak'ahs and then he uttered the salutation. Then those who were with him went away and took the position of their companions before the enemy. Then they came and prayed behind him. He led them in two rak'ahs and uttered the salutation. Thus the Messenger of Allah (ﷺ) offered four rak'ahs and his companions offered two rak'ahs. Al-Hasan used to give legal verdict on the authority of this tradition.Abu Dawud said: This will be so in the sunset prayer. The imam will offer six rak'ahs and the people three rak'ahs.Abu Dawud said: Yahya b. Abi Kathir narrated from Abu Salamah from Jabir from the Prophet (ﷺ) something similar. Sulaiman al-Yashkuri reported it from the Prophet (ﷺ) in like manner.",
      "chain": [
        "30150",
        "20286",
        "485",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، أخبرنا شعبة، عن قتادة، أنه سمع مطرفا، عن معاوية بن أبي سفيان، عن النبي صلى الله عليه وسلم في ليلة القدر قال ‏\"‏ ليلة القدر ليلة سبع وعشرين ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah b. Abi Sufyan :                     The Prophet (ﷺ) as saying: Lailat al-qadr is the twenty-seventh night (of Ramadan)",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11395",
        "27"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، ومسلم بن إبراهيم، وحفص بن عمر، ح وحدثنا ابن معاذ، حدثني أبي قالوا، كلهم حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي ليلى، عن البراء، أن النبي صلى الله عليه وسلم كان يقنت في صلاة الصبح زاد ابن معاذ وصلاة المغرب ‏.‏",
      "text_en": " Al-Bara' said:                      The Prophet (ﷺ) used to recite the supplication in the dawn prayer. The version of Ibn Mu'adh has the words: \"sunset prayer\".",
      "chain": [
        "20296",
        "20285",
        "30329",
        "30150",
        "20286",
        "20020",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1458",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا خالد، حدثنا شعبة، عن خبيب بن عبد الرحمن، قال سمعت حفص بن عاصم، يحدث عن أبي سعيد بن المعلى، أن النبي صلى الله عليه وسلم مر به وهو يصلي فدعاه قال فصليت ثم أتيته قال فقال ‏\"‏ ما منعك أن تجيبني ‏\"‏ ‏.‏ قال كنت أصلي ‏.‏ قال ‏\"‏ ألم يقل الله عز وجل ‏{‏ يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم ‏}‏ لأعلمنك أعظم سورة من القرآن أو في القرآن ‏\"‏ ‏.‏ شك خالد ‏\"‏ قبل أن أخرج من المسجد ‏\"‏ ‏.‏ قال قلت يا رسول الله قولك ‏.‏ قال ‏\"‏ ‏{‏ الحمد لله رب العالمين ‏}‏ وهي السبع المثاني التي أوتيت والقرآن العظيم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id b. al-Mu'alla said that when he was praying the Prophet (ﷺ) passed by him and he called him. He said:                      I prayed ant then I came to him. He asked: What prevented you from answering me ? He replied: I was praying. He said: Has not Allah said: \"O you who believe, respond to Allah and the Apostle when he calls you to that which gives you life ? (8:24) Let me teach you the greatest surah from the Qur'an or in the Qur'an (the narrator Khalid doubted) before I leave the mosque. I said: (I shall memorize) your saying. He said: It is: \"Praise be to Allah, the Lord of the Universe\" which is the seven oft-repeated verses, and the mighty Qur'an.",
      "chain": [
        "30150",
        "20423",
        "20020",
        "11159",
        "11420",
        "1535"
      ]
    },
    {
      "hadith_no": "1509",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن معاذ، قال حدثنا أبي، حدثنا عبد العزيز بن أبي سلمة، عن عمه الماجشون بن أبي سلمة، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، قال كان النبي صلى الله عليه وسلم إذا سلم من الصلاة قال ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ‏\"‏ ‏.‏",
      "text_en": " 'Ali b. Abi Talib said:                      When the Prophet (ﷺ) uttered salutation at the end of the prayer, he used to say: \"O Allah, forgive me my former and latter sins, what I have kept secret and what I have done openly, and what I have done extravagance; and what You know better than I do. You are the Advancer, the Delayer, there is no god but You.\"",
      "chain": [
        "30150",
        "20286",
        "32017",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "1643",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عاصم، عن أبي العالية، عن ثوبان، قال وكان ثوبان مولى رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تكفل لي أن لا يسأل الناس شيئا وأتكفل له بالجنة ‏\"‏ ‏.‏ فقال ثوبان أنا ‏.‏ فكان لا يسأل أحدا شيئا ‏.‏",
      "text_en": " Thawban, the client of the Messenger of Allah (May peace be upon him), reported him as saying :                      If anyone guarantees me that he will not beg from people, I will guarantee him Paradise.  Thawban said : I (will not beg).  He never asked anyone for anything.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11080",
        "11618",
        "130"
      ]
    },
    {
      "hadith_no": "1669",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا كهمس، عن سيار بن منظور، - رجل من بني فزارة - عن أبيه، عن امرأة، يقال لها بهيسة عن أبيها، قالت استأذن أبي النبي صلى الله عليه وسلم فدخل بينه وبين قميصه فجعل يقبل ويلتزم ثم قال يا رسول الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الماء ‏\"‏ ‏.‏ قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الملح ‏\"‏ ‏.‏ قال يا رسول الله ما الشىء الذي لا يحل منعه قال ‏\"‏ أن تفعل الخير خير لك ‏\"‏ ‏.‏",
      "text_en": " Buhaysah reported on the authority of his father:                      My father sought permission from the Prophet (ﷺ). (When permission was granted and he came near him) he lifted his shirt, and began to kiss him and embrace him (out of love for him). He asked: Messenger of Allah, what is the thing which it is unlawful to refuse? He replied: Water. He again asked: Prophet of Allah, what is the thing which it is unlawful to refuse? He replied: Salt. He again asked: Prophet of Allah, what is the thing which it is unlawful to refuse? He said: To do good is better for you.",
      "chain": [
        "30150",
        "11303",
        "14174",
        "14379"
      ]
    },
    {
      "hadith_no": "1791",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثني أبي، حدثنا النهاس، عن عطاء، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أهل الرجل بالحج ثم قدم مكة فطاف بالبيت وبالصفا والمروة فقد حل وهي عمرة ‏\"‏ ‏.‏ قال أبو داود رواه ابن جريج عن رجل عن عطاء دخل أصحاب النبي صلى الله عليه وسلم مهلين بالحج خالصا فجعلها النبي صلى الله عليه وسلم عمرة ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet(ﷺ) as saying If a man raises his voice in talbiya for Hajj, then he comes to Makkah, goes round the House(the Ka’bah) and runs between Al Safa’ and Al Marwah he may take off his ihram. That will be considered as ihram for ‘Umrah.Abu Dawud said Ibn Juraij narrated from a man on the authority of ‘Ata that the companions of the Prophet (ﷺ) entered Makkah raising their voices in talbiyah for Hajj alone, but the Prophet (ﷺ) changed it to ‘Umrah.",
      "chain": [
        "30150",
        "20286",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1804",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن معاذ، أخبرنا أبي، حدثنا شعبة، عن مسلم القري، سمع ابن عباس، يقول أهل النبي صلى الله عليه وسلم بعمرة وأهل أصحابه بحج ‏.‏",
      "text_en": " Ibn ‘Abbas said The Prophet(ﷺ) raised his voice in talbiyah for ‘Umrah and his companions for Hajj.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "17"
      ]
    },
    {
      "hadith_no": "2271",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سلمة، سمع الشعبي، عن الخليل، أو ابن الخليل قال أتي علي بن أبي طالب - رضى الله عنه - في امرأة ولدت من ثلاث نحوه لم يذكر اليمن ولا النبي صلى الله عليه وسلم ولا قوله طيبا بالولد ‏.‏",
      "text_en": " Khalil or Ibn Khalil said “A woman was brought to Ali bin Abi Talib(may Allaah be pleased with him). She bore a child from intercourse of three persons. The narrator transmitted the rest of the tradition similar to the previous one. But in this version he did not mention “Yemen” and the Prophet (ﷺ) and his words “give the child willingly.”",
      "chain": [
        "30150",
        "20286",
        "20020",
        "237",
        "11052"
      ]
    },
    {
      "hadith_no": "2312",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا معتمر، عن أبيه، ‏{‏ ومن يكرههن فإن الله من بعد إكراههن غفور رحيم ‏}‏ قال قال سعيد بن أبي الحسن غفور لهن المكرهات ‏.‏",
      "text_en": " Mu’tamir reported on the authority of his father Sa’id bin Al Hassan explain the Qur’anic verse “But if anyone compels them, yet after such compulsion is Allaah oft-forgiving most merciful(to them), said Allaah is oft-forgiving to those (slave girls) who were compelled (to prostitution)",
      "chain": [
        "30150",
        "20288"
      ]
    },
    {
      "hadith_no": "2333",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثني أبي، حدثنا الأشعث، عن الحسنفي رجل كان بمصر من الأمصار فصام يوم الاثنين وشهد رجلان أنهما رأيا الهلال ليلة الأحد فقال لا يقضي ذلك اليوم الرجل ولا أهل مصره إلا أن يعلموا أن أهل مصر من أمصار المسلمين قد صاموا يوم الأحد فيقضونه ‏.‏",
      "text_en": " Al-Hasan said about a person who was in a certain city. He fasted on Monday, and twp persons bore witness that they had sighted the moon on the night of sunday. He said:                      That man and the people of his city should not fast as an atonement except that they know (for certain) that the people of a certain city of Muslims had fasted on Sunday. In that case they should keep fast as an atonement.",
      "chain": [
        "30150",
        "20286",
        "485"
      ]
    },
    {
      "hadith_no": "2620",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي بشر، عن عباد بن شرحبيل، قال أصابتني سنة فدخلت حائطا من حيطان المدينة ففركت سنبلا فأكلت وحملت في ثوبي فجاء صاحبه فضربني وأخذ ثوبي فأتيت رسول الله صلى الله عليه وسلم فقال له ‏\"‏ ما علمت إذ كان جاهلا ولا أطعمت إذ كان جائعا ‏\"‏ ‏.‏ أو قال ‏\"‏ ساغبا ‏\"‏ ‏.‏ وأمره فرد على ثوبي وأعطاني وسقا أو نصف وسق من طعام ‏.‏",
      "text_en": " Narrated Abbad ibn Shurahbil:                     I suffered from drought; so I entered a garden of Medina, and rubbed an ear-corn. I ate and carried in my garment. Then its master came, he beat me and took my garment. He came to the Messenger of Allah (ﷺ) who said to him: You did not teach him if he was ignorant; and you did not feed him if he was hungry. He ordered him, so he returned my garment to me, and gave me one or half a wasq (sixty or thirty sa's) of corn.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11419"
      ]
    },
    {
      "hadith_no": "2791",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا محمد بن عمرو، حدثنا عمرو بن مسلم الليثي، قال سمعت سعيد بن المسيب، يقول سمعت أم سلمة، تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان له ذبح يذبحه فإذا أهل هلال ذي الحجة فلا يأخذن من شعره ولا من أظفاره شيئا حتى يضحي ‏\"‏ ‏.‏ قال أبو داود اختلفوا على مالك وعلى محمد بن عمرو في عمرو بن مسلم قال بعضهم عمر وأكثرهم قال عمرو ‏.‏ قال أبو داود وهو عمرو بن مسلم بن أكيمة الليثي الجندعي ‏.‏",
      "text_en": " Narrated Umm Salamah:                     The Prophet (ﷺ) as saying: If anyone has sacrificial animal and intends to sacrifice it, and he sights the new moon of Dhul-Hajjah, he must not take any of his hair and nails until he sacrificesAbu Dawud said: The name of 'Amr b. Muslim in the chain narrated by Malik and Muhammad b. 'Amr is disputed. Some say that it is 'Umar and the majority holds that it is 'Amr.Abu Dawud said: He is 'Amr b. Muslim b. Ukaimah al-Laithi al-Jundu'i.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "10953",
        "11002"
      ]
    },
    {
      "hadith_no": "3178",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سماك، سمع جابر بن سمرة، قال صلى النبي صلى الله عليه وسلم على ابن الدحداح ونحن شهود ثم أتي بفرس فعقل حتى ركبه فجعل يتوقص به ونحن نسعى حوله ‏.‏",
      "text_en": " Narrated Jabir b. Samurah:                     The Prophet (ﷺ) offered funeral prayer over Ibn al-Dahdah while we were present. He was then brought a horse, and it was tied until he rode it. It then began to gallop and we were running around it.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3211",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي إسحاق، قال أوصى الحارث أن يصلي، عليه عبد الله بن يزيد فصلى عليه ثم أدخله القبر من قبل رجلى القبر وقال هذا من السنة ‏.‏",
      "text_en": " Abu Ishaq said:                      Al-Harith left his will that Abdullah ibn Yazid should offer his funeral prayer; so he prayed over him. He then put him in the grave from the side of his legs and said: This is a Sunnah (model practice of the Prophet).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11049"
      ]
    },
    {
      "hadith_no": "3248",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحلفوا بآبائكم ولا بأمهاتكم ولا بالأنداد ولا تحلفوا إلا بالله ولا تحلفوا بالله إلا وأنتم صادقون ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Do not swear by your fathers, or by your mothers, or by rivals to Allah; and swear by Allah only, and swear by Allah only when you are speaking the truth.",
      "chain": [
        "30150",
        "20286",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3336",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا سفيان، عن سماك بن حرب، حدثني سويد بن قيس، قال جلبت أنا ومخرمة العبدي، بزا من هجر فأتينا به مكة فجاءنا رسول الله صلى الله عليه وسلم يمشي فساومنا بسراويل فبعناه وثم رجل يزن بالأجر فقال له رسول الله صلى الله عليه وسلم ‏\"‏ زن وأرجح ‏\"‏ ‏.‏",
      "text_en": " Narrated Suwayd ibn Qays:                     I and Makhrafah al-Abdi imported some garments from Hajar, and brought them to Mecca. The Messenger of Allah (ﷺ) came to us walking, and after he had bargained with us for some trousers, we sold them to him. There was a man who was weighing for payment. The Messenger of Allah (ﷺ) said to him: Weigh out and give overweight.",
      "chain": [
        "30150",
        "20286",
        "20012",
        "10770",
        "16165"
      ]
    },
    {
      "hadith_no": "3388",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا يحيى، حدثنا سفيان، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال اشتركت أنا وعمار، وسعد، فيما نصيب يوم بدر قال فجاء سعد بأسيرين ولم أجئ أنا وعمار بشىء ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     I Ammar, and Sa'd became partners in what we would receive on the day of Badr. Sa'd then brought two prisoners, but I and Ammar did not bring anything.",
      "chain": [
        "30150",
        "20031",
        "20012",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "3420",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت، عن عمه، أنه مر بقوم فأتوه فقالوا إنك جئت من عند هذا الرجل بخير فارق لنا هذا الرجل ‏.‏ فأتوه برجل معتوه في القيود فرقاه بأم القرآن ثلاثة أيام غدوة وعشية كلما ختمها جمع بزاقه ثم تفل فكأنما أنشط من عقال فأعطوه شيئا فأتى النبي صلى الله عليه وسلم فذكره له فقال النبي صلى الله عليه وسلم ‏\"‏ كل فلعمري لمن أكل برقية باطل لقد أكلت برقية حق ‏\"‏ ‏.‏",
      "text_en": " Kharijah b. al-Salt quoted his paternal uncle as saying that he passed by a clan (of the Arab) who came to him and said:                      You have brought what is good from this man. Then they brought a lunatic in chains. He recited Surat al-Fatihah over him three days, morning and evening. When he finished, he collected his saliva and then spat it out, (he felt relief) as if he were set free from a bond. They gave him something (as wages). He then came to the Prophet (ﷺ) and mentioned it to him. The Messenger of Allah (ﷺ) said: Accept it, for by my life, some accept it for a worthless charm, but you have done so far a genuine one.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "hadith_no": "3425",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن جحادة، قال سمعت أبا حازم، سمع أبا هريرة، قال نهى رسول الله صلى الله عليه وسلم عن كسب الإماء ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) forbade earnings of slave-girls.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "18897",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3476",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن سيار بن منظور، - رجل من بني فزارة - عن أبيه، عن امرأة، يقال لها بهيسة عن أبيها، قالت استأذن أبي النبي صلى الله عليه وسلم فدخل بينه وبين قميصه فجعل يقبل ويلتزم ثم قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الماء ‏\"‏ ‏.‏ قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الملح ‏\"‏ ‏.‏ قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ أن تفعل الخير خير لك ‏\"‏ ‏.‏",
      "text_en": " Narrated Buhaisah:                     On the authority of her father: My father asked the Prophet (ﷺ) for permission (to kiss his body). (When he was given permission), lifting his shirt he approached his body, and began to kiss and stick to him. He then asked: Prophet of Allah, what is the thing withholding of which is not lawful ? He replied: Water. He asked: Prophet of Allah, what is the thing withholding of which is not lawful ? He replied: Salt. He again asked: Prophet of Allah, what is the thing withholding of which is not lawful ? He said: That you do a good work is better for you.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "14174",
        "14379"
      ]
    },
    {
      "hadith_no": "3897",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا ابن جعفر، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت، عن عمه، أنه مر - قال - فرقاه بفاتحة الكتاب ثلاثة أيام غدوة وعشية كلما ختمها جمع بزاقه ثم تفل فكأنما أنشط من عقال فأعطوه شيئا فأتى النبي صلى الله عليه وسلم ثم ذكر معنى حديث مسدد ‏.‏",
      "text_en": " Kharijah b. al-Salt quoted his parental uncle as saying that he passed (some people) :                      He recited Surat al-Fatihah over him for three days morning and evening. Whenever he finished it, he collected some of his saliva and spat it out, and he seemed as if he were set free from a bond. They gave him something as payment. He then came to the Prophet (ﷺ). He then transmitted the rest of the tradition to the same effect as Musaddad narrated.",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "hadith_no": "3901",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت التميمي، عن عمه، قال أقبلنا من عند رسول الله صلى الله عليه وسلم فأتينا على حى من العرب فقالوا إنا أنبئنا أنكم جئتم من عند هذا الرجل بخير فهل عندكم من دواء أو رقية فإن عندنا معتوها في القيود قال فقلنا نعم ‏.‏ قال فجاءوا بمعتوه في القيود - قال - فقرأت عليه فاتحة الكتاب ثلاثة أيام غدوة وعشية كلما ختمتها أجمع بزاقي ثم أتفل فكأنما نشط من عقال قال فأعطوني جعلا فقلت لا حتى أسأل رسول الله صلى الله عليه وسلم فقال ‏\"‏ كل فلعمري من أكل برقية باطل لقد أكلت برقية حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Alaqah ibn Sahar at-Tamimi:                     We proceeded from the Messenger of Allah (ﷺ) and came to a clan of the Arabs.  They said: We have been told that you have brought what is good from this man. Have you any medicine or a charm, for we have a lunatic in chains?  We said: Yes. Then they brought a lunatic in chains.  He said: I recited Surat al-Fatihah over him for three days, morning and evening. Whenever I finished it, I would collect my saliva and spit it out, and he seemed as if he were set free from a bond. He said: They gave me some payment, but I said: No, not until I ask the Messenger of Allah (ﷺ).  He (the Prophet) said: Accept it, for, by my life, some accept it for a worthless charm, but you have done so for a genuine one.",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20173",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "hadith_no": "4097",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن قتادة، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه لعن المتشبهات من النساء بالرجال والمتشبهين من الرجال بالنساء ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Prophet (ﷺ) cursed women who imitate men and men who imitate women.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4331",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن المنكدر، قال رأيت جابر بن عبد الله يحلف بالله أن ابن صائد الدجال، فقلت تحلف بالله فقال إني سمعت عمر يحلف على ذلك عند رسول الله صلى الله عليه وسلم فلم ينكره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Muhammad ibn al-Munkadir told that he saw Jabir ibn Abdullah swearing by Allah that Ibn as-Sa'id was the Dajjal (Antichrist). I expressed my surprise by saying:                      You swear by Allah! He said: I heard Umar swearing to that in the presence of the Messenger of Allah (ﷺ), but the Messenger of Allah (ﷺ) did not make any objection to it.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11063",
        "11048"
      ]
    },
    {
      "hadith_no": "4334",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا محمد، - يعني ابن عمرو - عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يخرج ثلاثون كذابا دجالا كلهم يكذب على الله وعلى رسوله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: The Last Hour will not come before there come forth thirty liar Dajjals (fraudulents) lying on Allah and His Apostle.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4357",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا المسعودي، عن القاسم، بهذه القصة قال فلم ينزل حتى ضرب عنقه وما استتابه ‏.‏",
      "text_en": " The tradition mention above has also been transmitted by Abu Musa through a different chain if narrators. But there is no mention of demand of repentance.",
      "chain": [
        "30150",
        "20286",
        "20724"
      ]
    },
    {
      "hadith_no": "4558",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، ح وحدثنا ابن معاذ، حدثنا أبي ح، وحدثنا نصر بن علي، أخبرنا يزيد بن زريع، كلهم عن شعبة، عن قتادة، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هذه وهذه سواء ‏\"‏ ‏.‏ قال يعني الإبهام والخنصر ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) as saying: This and that are equal, that is, the thumb and the little finger.",
      "chain": [
        "30175",
        "20031",
        "30150",
        "20286",
        "30395",
        "20304",
        "20020",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4695",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن ابن بريدة، عن يحيى بن يعمر، قال كان أول من تكلم في القدر بالبصرة معبد الجهني فانطلقت أنا وحميد بن عبد الرحمن الحميري حاجين أو معتمرين فقلنا لو لقينا أحدا من أصحاب رسول الله صلى الله عليه وسلم فسألناه عما يقول هؤلاء في القدر ‏.‏ فوفق الله لنا عبد الله بن عمر داخلا في المسجد فاكتنفته أنا وصاحبي فظننت أن صاحبي سيكل الكلام إلى فقلت أبا عبد الرحمن إنه قد ظهر قبلنا ناس يقرءون القرآن ويتفقرون العلم يزعمون أن لا قدر والأمر أنف ‏.‏ فقال إذا لقيت أولئك فأخبرهم أني بريء منهم وهم برآء مني والذي يحلف به عبد الله بن عمر لو أن لأحدهم مثل أحد ذهبا فأنفقه ما قبله الله منه حتى يؤمن بالقدر ثم قال حدثني عمر بن الخطاب قال بينا نحن عند رسول الله صلى الله عليه وسلم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا نعرفه حتى جلس إلى النبي صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وقال يا محمد أخبرني عن الإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت إليه سبيلا ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فعجبنا له يسأله ويصدقه ‏.‏ قال فأخبرني عن الإيمان ‏.‏ قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فأخبرني عن الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال فأخبرني عن الساعة ‏.‏ قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فأخبرني عن أماراتها ‏.‏ قال ‏\"‏ أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال ثم انطلق فلبثت ثلاثا ثم قال ‏\"‏ يا عمر هل تدري من السائل ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه جبريل أتاكم يعلمكم دينكم ‏\"‏ ‏.‏",
      "text_en": " Yahya b. Ya’mur said :                      The first to speak on Divine decree in al-Basrah was Ma’bad al Juhani. I and Humaid b.’Abd al-Rahman al-Himyari proceeded to perform HAJJ or UMRAH. We said : would that we meet any of the Companions of the Messenger of Allah (May peace be upon him) so that we could ask him about what they say with regard to divine decree. So Allah helped us to meet ‘Abd Allah b. Umar who was entering the mosque. So I and my companion surrounded him, and I thought that my companion would entrust me the task of speaking to him. Then I said : Abu ‘Abd al-Rahman, there appeared on our side some people who recite the Quran and are engaged in the hair-splitting of knowledge. They conceive that there is no Divine decree and everything happens freely without predestination. He said : When you meet those people, tell them that I am free from them, and they are free from me. By Him by Whom swears ‘Abd Allah b. ‘Umar, if one of them has gold equivalent to Uhud and he spends it, Allah will not accept it from him until he believes in Divine decree. He then said : ‘Umar b. Khattab transmitted to me a tradition, saying : One day when we were with the Messenger of Allah (May peace be upon him) a man with very white clothing and very black hair came up to us. No mark of travel was visible on him, and we did not recognize him. Sitting down beside the Messenger of Allah (May peace be upon him), leaning his knees against his and placing his hands on his thighs, he said : tell me, Muhammad, about Islam. The Messenger of Allah (May peace be upon him) said : Islam means that you should testify that there is no god but Allah, and Muhammad is Allah’s Apostle, that you should observe prayer, pay ZAKAT, fast during RAMADAN, and perform Hajj to the house (i.e., KABAH), If you have the meant to go. He said : You have spoken the truth. We were surprised at his questioning him and then declaring that he spoke the truth. He said : now tell me about faith. He replied : It means that you should believe in Allah, his angels, his Books, his Apostles and the last day, and that you should believe in the decreeing both of good and evil. He said : you have spoken the truth. He said : now tell me about doing good (ihsan). He replied: it means that you should worship Allah as though you are seeing him; if you are not seeing him, he is seeing you. He said: Now tell me about the hour. He replied : The one who is asked about it is no better informed than the one who is asking. He said : Then tell me about its signs. He replied : That a maidservant should beget her mistress, and that you should see barefooted, naked, poor men and shepherds exalting themselves in buildings. ‘Umar said : He then went away, and I waited for three days, then he said : Do you know who the questioner was, Umar? I replied : Allah and his Apostle know best. He said : He was Gabriel who came to you to teach you your religion.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "4731",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، - المعنى - عن يعلى بن عطاء، عن وكيع، - قال موسى - ابن عدس عن أبي رزين، - قال موسى العقيلي - قال قلت يا رسول الله أكلنا يرى ربه قال ابن معاذ مخليا به يوم القيامة وما آية ذلك في خلقه قال ‏\"‏ يا أبا رزين أليس كلكم يرى القمر ‏\"‏ ‏.‏ قال ابن معاذ ‏\"‏ ليلة البدر مخليا به ‏\"‏ ‏.‏ ثم اتفقا قلت بلى ‏.‏ قال ‏\"‏ فالله أعظم ‏\"‏ ‏.‏ قال ابن معاذ قال ‏\"‏ فإنما هو خلق من خلق الله فالله أجل وأعظم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuRazin al-Uqayli:                     I asked: Messenger of Allah! will each one of us see his Lord? Ibn Mu'adh's version has: \"being alone with Him, on the Day of Resurrection? And what sign is there is His creation?\" He replied: AbuRazin! does each one of you not see the moon? Ibn Mu'adh's version has: \"on the night when it is full, being alone with it?\"  Then the agreed version goes: I said: Yes. He said: Allah is more great. Ibn Mu'adh's version has: It is only part of Allah's creation, but Allah is more glorious and greater.",
      "chain": [
        "20040",
        "20022",
        "30150",
        "20286",
        "10986",
        "20032",
        "10826"
      ]
    },
    {
      "hadith_no": "4830",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، - المعنى - ح وحدثنا ابن معاذ، حدثنا أبي، حدثنا شعبة، عن قتادة، عن أنس، عن أبي موسى، عن النبي صلى الله عليه وسلم بهذا الكلام الأول إلى قوله ‏\"‏ وطعمها مر ‏\"‏ ‏.‏ وزاد ابن معاذ قال قال أنس وكنا نتحدث أن مثل جليس الصالح وساق بقية الحديث ‏.‏",
      "text_en": " THE TRADITION MENTIONED ABOVE HAS ALSO BEEN TRANSMITTED BY ABU MUSA FROM THE PROPHET(MAY PEACE BE UPON HIM) THROUGH A DIFFERENT CHAIN OF NARRATORS UP TO “AND ITS TASTE BITTER”. IBN MU’ADH ADDED:                      ANAS SAID: WE USED TALK TO ONE ANOTHER THET A GOOD COMPANION IS LIKE... HE THEN TRANSMITTED THE REST OF THE TRADITION.",
      "chain": [
        "30175",
        "30150",
        "20286",
        "20020",
        "11019",
        "19",
        "41"
      ]
    },
    {
      "hadith_no": "4898",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا عبيد الله بن عمر بن ميسرة، حدثنا معاذ بن معاذ، - المعنى واحد - قال حدثنا ابن عون، قال كنت أسأل عن الانتصار، ‏{‏ ولمن انتصر بعد ظلمه فأولئك ما عليهم من سبيل ‏}‏ فحدثني علي بن زيد بن جدعان عن أم محمد امرأة أبيه قال ابن عون وزعموا أنها كانت تدخل على أم المؤمنين قالت قالت أم المؤمنين دخل على رسول الله صلى الله عليه وسلم وعندنا زينب بنت جحش فجعل يصنع شيئا بيده فقلت بيده حتى فطنته لها فأمسك وأقبلت زينب تقحم لعائشة رضى الله عنها فنهاها فأبت أن تنتهي فقال لعائشة ‏\"‏ سبيها ‏\"‏ فسبتها فغلبتها فانطلقت زينب إلى علي رضى الله عنه فقالت إن عائشة رضى الله عنها وقعت بكم وفعلت ‏.‏ فجاءت فاطمة فقال لها ‏\"‏ إنها حبة أبيك ورب الكعبة ‏\"‏ ‏.‏ فانصرفت فقالت لهم إني قلت له كذا وكذا فقال لي كذا وكذا ‏.‏ قال وجاء علي رضى الله عنه إلى النبي صلى الله عليه وسلم فكلمه في ذلك ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Ibn Awn said: I asked about the meaning of intisar (revenge) in the Qur'anic verse: \"But indeed if any do help and defend themselves (intasara) after a wrong (done) to them, against them there is no cause of blame.\" Then Ali ibn Zayd ibn Jad'an told me on the authority of Umm Muhammad, the wife of his father.  Ibn Awn said: It was believed that she used to go to the Mother of the Faithful (i.e. Aisha).  She said: The Mother of the Faithful said: The Messenger of Allah (ﷺ) came upon me while Zaynab, daughter of Jahsh, was with us. He began to do something with his hand. I signalled to him until I made him understand about her. So he stopped. Zaynab came on and began to abuse Aisha. She tried to prevent her but she did not stop.  So he (the Prophet) said to Aisha: Abuse her.  So she abused her and dominated her.  Zaynab then went to Ali and said: Aisha abused you and did (such and such).  Then Fatimah came (to the Prophet) and he said to her: She is the favourite of your father, by the Lord of the Ka'bah!  She then returned and said to them: I said to him such and such, and he said to me such and such. Then Ali came to the Prophet (ﷺ) and spoke to him about that.",
      "chain": [
        "30150",
        "20286",
        "30024",
        "20286",
        "11071"
      ]
    },
    {
      "hadith_no": "4909",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا سفيان، عن حبيب، عن عطاء، عن عائشة، رضى الله عنها قالت سرق لها شىء فجعلت تدعو عليه فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبخي عنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Something of her was stolen, and she began to curse him (i.e. the thief). The Messenger of Allah (ﷺ) said to her: Do not lessen his sin.",
      "chain": [
        "30150",
        "20286",
        "20012",
        "11276",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "4937",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا محمد، - يعني ابن عمرو - عن يحيى، - يعني ابن عبد الرحمن بن حاطب - قال قالت عائشة رضى الله عنها فقدمنا المدينة فنزلنا في بني الحارث بن الخزرج - قالت - فوالله إني لعلى أرجوحة بين عذقين فجاءتني أمي فأنزلتني ولي جميمة ‏.‏ وساق الحديث ‏.‏",
      "text_en": " ‘A’ishah said :                      We came to Medina and stayed with Banu al-Harith b. al-Khazraj. She said : I swear by Allah, I was swinging between two date-palms. Then my mother came down; and I had my hair up to the ears. The transmitter then rest of the tradition.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "10625",
        "53"
      ]
    },
    {
      "hadith_no": "5087",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا المسعودي، حدثنا القاسم، قال كان أبو ذر يقول من قال حين يصبح اللهم ما حلفت من حلف أو قلت من قول أو نذرت من نذر فمشيئتك بين يدى ذلك كله ما شئت كان وما لم تشأ لم يكن اللهم اغفر لي وتجاوز لي عنه اللهم فمن صليت عليه فعليه صلاتي ومن لعنت فعليه لعنتي كان في استثناء يومه ذلك أو قال ذلك اليوم ‏.‏",
      "text_en": " Narrated AbuDharr:                     If anyone says in the morning: \"O Allah! whatever oath I take, whatever word I speak, and whatever vow I take, Thine will precedes all that: whatever Thou willeth, occurs, and whatever Thou dost not will, dost not occur. O Allah! pardon me and disregard me for it. O Allah! whomsoever Thou sendest thine blessing, to him my blessing is due, and whomsoever thou cursest, to him my curse is due, \" exemption from it will be granted to him that day.",
      "chain": [
        "30150",
        "20286",
        "20724",
        "10535",
        "23"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن منصور، عن ربعي، عن رجل، من بني عامر أنه استأذن على النبي صلى الله عليه وسلم بمعناه ‏.‏ قال فسمعته فقلت السلام عليكم أأدخل",
      "text_en": " Rib’i said that a man of Banu Amir told him that he asked permission of the prophet (May peace be upon him) to enter the house. He related the tradition to the same effect, saying :                      I heard it and so I said: Peace be upon you. May I enter?",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "588",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا عبيد الله بن معاذ، قال أنبأنا أبي قال، حدثنا عمران بن حدير، قال سألت لاحقا عن الركعتين، قبل غروب الشمس فقال كان عبد الله بن الزبير يصليهما فأرسل إليه معاوية ما هاتان الركعتان عند غروب الشمس فاضطر الحديث إلى أم سلمة فقالت أم سلمة إن رسول الله صلى الله عليه وسلم كان يصلي ركعتين قبل العصر فشغل عنهما فركعهما حين غابت الشمس فلم أره يصليهما قبل ولا بعد ‏.‏",
      "text_en": " 'Imran bin Hudair said:                      \"I asked Lahiq about the two Rak'ahs before sunset. He said: \"Abdullah bin Az-Zubair used to pray them, and Mu'awiyah sent word to him asking: 'What are these two Rak'ahs at sunset?' He had to refer to Umm Salamah, and Umm Salamah said: 'The Messenger of Allah (ﷺ) used to pray two Rak'ahs before 'Asr, then he was distracted and did not pray them, so he prayed them when the sun set, and I never saw him pray them before or after that.'\"",
      "chain": [
        "11524",
        "30150",
        "20286",
        "10709",
        "11313"
      ]
    },
    {
      "hadith_no": "3769",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا عبيد الله بن معاذ، قال حدثنا أبي قال، حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحلفوا بآبائكم ولا بأمهاتكم ولا بالأنداد ولا تحلفوا إلا بالله ولا تحلفوا إلا وأنتم صادقون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: 'Do not swear by your fathers, nor by your mothers nor by the idols. Swear only by Allah, and do not swear unless you are sincere.'\"",
      "chain": [
        "30150",
        "20286",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4728",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبيد الله بن معاذ، قال حدثنا أبي قال، حدثنا أبو يونس، عن سماك بن حرب، أن علقمة بن وائل، حدثه أن أباه حدثه قال إني لقاعد مع رسول الله صلى الله عليه وسلم إذ جاء رجل يقود آخر نحوه ‏.‏",
      "text_en": " It was narrated from Simak bin Harb that 'Alqamah bin Wa'il told him that his father said:                     \"I was sitting with the Messenger of Allah when a man came leading another\" (and he narrated) a similar report.",
      "chain": [
        "30150",
        "20286",
        "10770",
        "10801"
      ]
    }
  ],
  "total_hadiths": 222
}