{
  "id": "30163",
  "name": "Muhammad bin Hatm bin Bzy' محمد بن حاتم بن بزيع",
  "full_name": "Muhammad bin Hatm bin Bzy' محمد بن حاتم بن بزيع",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "249",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20557",
      "name": "Abd al-Whab bin Ata'a عبد الوهاب بن عطاء الخفاف أبو نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30525",
      "name": "Yahya bin Ishaq يحيى بن إسحاق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30278",
      "name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30362",
      "name": "'Ali bin al-Hasan bin Shaqayq علي بن الحسن بن شقيق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20636",
      "name": "Musa bin Da'ud al-Dby موسى بن داود الضبي أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20351",
      "name": "Qabaysa bin 'Uqba bin Muhammad قبيصة بن عقبة بن محمد بن سفيان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-500",
      "hadith_no": "500",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، قال حدثنا شاذان، عن شعبة، عن عطاء بن أبي ميمونة، قال سمعت أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا خرج لحاجته تبعته أنا وغلام ومعنا عكازة أو عصا أو عنزة ومعنا إداوة، فإذا فرغ من حاجته ناولناه الإداوة‏.‏",
      "text_en": " Narrated Anas Ibn Malik:                     Whenever the Prophet went for answering the call of nature, I and another boy used to go after him with a staff, a stick or a short spear (or stick) and a tumbler of water and when he finished from answering the call of nature we would hand that tumbler of water to him.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20380",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4227",
      "hadith_no": "4227",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا شاذان، عن شعبة، عن أبي جمرة، قال سألت عائذ بن عمرو  رضى الله عنه  وكان من أصحاب النبي صلى الله عليه وسلم من أصحاب الشجرة هل ينقض الوتر قال إذا أوترت من أوله، فلا توتر من آخره‏.‏",
      "text_en": " Narrated Abu Jamra:                     I asked Aidh bin `Amr, who was one of the companions of the Prophet one of those (who gave the allegiance to the Prophet the Tree: \"Can the witr prayer be repeated (in one night)?\" He said, \"If you have offered it in the first part of the night, you should not repeat it in the last part 'of the night.\" (See Fath-ul-Bari page 458 Vol 8th).",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20380",
        "20020",
        "11309",
        "3240"
      ]
    },
    {
      "id": "sunan-abi-daud-34",
      "hadith_no": "34",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا عبد الوهاب بن عطاء، عن سعيد، عن أبي معشر، عن إبراهيم، عن الأسود، عن عائشة، عن النبي صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " Aishah, also reported a tradition bearing similar meaning through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20557",
        "11073",
        "10765",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-633",
      "hadith_no": "633",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا يحيى بن أبي بكير، عن إسرائيل، عن أبي حومل العامري، - قال أبو داود كذا قال والصواب أبو حرمل عن - محمد بن عبد الرحمن بن أبي بكر، عن أبيه، قال أمنا جابر بن عبد الله في قميص ليس عليه رداء فلما انصرف قال إني رأيت رسول الله صلى الله عليه وسلم يصلي في قميص ‏.‏",
      "text_en": " ‘Abd al-rahman b. Abu Bakr reported on the authority of his father Jabir b. ‘Abd Allah led us in prayer in a single shirt, having no sheet upon him. When he finished the prayer he said:                      I witnesses the Messenger of Allah (ﷺ) praying in a shirt.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20365",
        "20311",
        "10846"
      ]
    },
    {
      "id": "sunan-abi-daud-1309",
      "hadith_no": "1309",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن كثير، حدثنا سفيان، عن مسعر، عن علي بن الأقمر، ح وحدثنا محمد بن حاتم بن بزيع، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن علي بن الأقمر، - المعنى - عن الأغر، عن أبي سعيد، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أيقظ الرجل أهله من الليل فصليا أو صلى ركعتين جميعا كتبا في الذاكرين والذاكرات ‏\"‏ ‏.‏ ولم يرفعه ابن كثير ولا ذكر أبا هريرة جعله كلام أبي سعيد ‏.‏ قال أبو داود رواه ابن مهدي عن سفيان قال وأراه ذكر أبا هريرة ‏.‏ قال أبو داود وحديث سفيان موقوف ‏.‏",
      "text_en": " Narrated AbuSa'id and AbuHurayrah:                     The Prophet (ﷺ) said: If a man awakens his wife at night, and then both pray or both offer two rak'ahs together, the (name of the )man will be recorded among those who mention the name of Allah, and the (name of the) woman will be recorded among those who mention the name of Allah. Ibn Kathir did not narrate this tradition as a statement of the Prophet (ﷺ), but he reported it as a statement of Abu Sa'id.Abu Dawud said: This tradition has been narrated by Ibn Mahdi from Sufyan and I think he mentioned the name of Sufyan. He also said: The tradition transmitted by Sufyan is a statement of the Companion (and not that of the Prophet).",
      "usc_msa_ref": "",
      "chain": [
        "30169",
        "20012",
        "20359",
        "11375",
        "30163",
        "20340",
        "20240",
        "11060",
        "11375",
        "15022",
        "38",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1451",
      "hadith_no": "1451",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن علي بن الأقمر، عن الأغر أبي مسلم، عن أبي سعيد الخدري، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ من استيقظ من الليل وأيقظ امرأته فصليا ركعتين جميعا كتبا من الذاكرين الله كثيرا والذاكرات ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id ; AbuHurayrah:                     The Prophet (ﷺ) said: When a man himself wakes at night and wakens his wife and they pray two rak'ahs together, they are recorded among the men and women who make much mention of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20340",
        "20240",
        "11060",
        "11375",
        "38",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2108",
      "hadith_no": "2108",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا علي بن الحسن بن شقيق، عن ابن المبارك، عن يونس، عن الزهري، أن النجاشي، زوج أم حبيبة بنت أبي سفيان من رسول الله صلى الله عليه وسلم على صداق أربعة آلاف درهم وكتب بذلك إلى رسول الله صلى الله عليه وسلم فقبل ‏.‏",
      "text_en": " Az-Zuhri said:                      The Negus married Umm Habibah daughter of Abu Sufyan to the Messenger of Allah (ﷺ) for a dower of four thousand dirhams. He wrote it to the Messenger of Allah (ﷺ) who accepted it.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "30362",
        "20025",
        "20475",
        "11013"
      ]
    },
    {
      "id": "sunan-abi-daud-3164",
      "hadith_no": "3164",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا أبو نعيم، عن محمد بن مسلم، عن عمرو بن دينار، أخبرني جابر بن عبد الله، - أو سمعت جابر بن عبد الله، - قال رأى ناس نارا في المقبرة فأتوها فإذا رسول الله صلى الله عليه وسلم في القبر وإذا هو يقول ‏\"‏ ناولوني صاحبكم ‏\"‏ ‏.‏ فإذا هو الرجل الذي كان يرفع صوته بالذكر ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The people saw fire (light) in the graveyard and they went there. They found that the Messenger of Allah (ﷺ) was in a grave and he was saying: Give me your companion. This was a man who used to raise his voice while mentioning the name of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20348",
        "167",
        "11081",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3758",
      "hadith_no": "3758",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا معلى، - يعني ابن منصور - عن محمد بن ميمون، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تؤخر الصلاة لطعام ولا لغيره ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: Prayer should not be postponed for taking meals nor for any other thing.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "30278",
        "20458",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4560",
      "hadith_no": "4560",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا علي بن الحسن، أخبرنا أبو حمزة، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأسنان سواء والأصابع سواء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: The teeth are equal, and the fingers are equal.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20458",
        "19950",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 10
}