{
  "id": "30161",
  "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
  "full_name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "234",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "24511",
      "name": "Abu Bakr bin 'Ali bin 'Ata' bin Maqaddam أبو بكر بن علي بن عطاء بن مقدم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20265",
      "name": "'Umar bin 'Ali bin Ata'a bin Maqaddam عمر بن علي بن عطاء بن مقدم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11615",
      "name": "Yusuf bin Yazid al-Barra' al-Atar يوسف بن يزيد البصري البراء العطار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20221",
      "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20343",
      "name": "Atham bin 'Ali bin Hjyr عثام بن علي بن هجير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "39144",
      "name": "Isma'il bin Ishaq bin Isma'il إسماعيل بن إسحاق",
      "grade": "3rd Century AH"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "507",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا معتمر، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه كان يعرض راحلته فيصلي إليها‏.‏ قلت أفرأيت إذا هبت الركاب‏.‏ قال كان يأخذ هذا الرحل فيعدله فيصلي إلى آخرته  أو قال مؤخره  وكان ابن عمر  رضى الله عنه  يفعله‏.‏",
      "text_en": " Narrated Nafi`:                     \"The Prophet used to make his she-camel sit across and he would pray facing it (as a Sutra).\" I asked, \"What would the Prophet do if the she-camel was provoked and moved?\" He said, \"He would take its camel-saddle and put it in front of him and pray facing its back part (as a Sutra). And Ibn `Umar used to do the same.\" (This indicates that one should not pray except behind a Sutra).",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "843",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن أبي بكر، قال حدثنا معتمر، عن عبيد الله، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال جاء الفقراء إلى النبي صلى الله عليه وسلم فقالوا ذهب أهل الدثور من الأموال بالدرجات العلا والنعيم المقيم، يصلون كما نصلي، ويصومون كما نصوم، ولهم فضل من أموال يحجون بها، ويعتمرون، ويجاهدون، ويتصدقون قال ‏\"‏ ألا أحدثكم بأمر إن أخذتم به أدركتم من سبقكم ولم يدرككم أحد بعدكم، وكنتم خير من أنتم بين ظهرانيه، إلا من عمل مثله تسبحون وتحمدون، وتكبرون خلف كل صلاة ثلاثا وثلاثين ‏\"‏‏.‏ فاختلفنا بيننا فقال بعضنا نسبح ثلاثا وثلاثين، ونحمد ثلاثا وثلاثين، ونكبر أربعا وثلاثين‏.‏ فرجعت إليه فقال ‏\"‏ تقول سبحان الله، والحمد لله، والله أكبر، حتى يكون منهن كلهن ثلاثا وثلاثين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some poor people came to the Prophet and said, \"The wealthy people will get higher grades and will have permanent enjoyment and they pray like us and fast as we do. They have more money by which they perform the Hajj, and `Umra; fight and struggle in Allah's Cause and give in charity.\" The Prophet said, \"Shall I not tell you a thing upon which if you acted you would catch up with those who have surpassed you? Nobody would overtake you and you would be better than the people amongst whom you live except those who would do the same. Say \"Subhana l-lah\", \"Al hamdu li l-lah\" and \"Allahu Akbar\" thirty three times each after every (compulsory) prayer.\" We differed and some of us said that we should say, \"Subhan-al-lah\" thirty three times and \"Al hamdu li l-lah\" thirty three times and \"Allahu Akbar\" thirty four times. I went to the Prophet who said, \"Say, \"Subhan-al-lah\" and \"Al hamdu li l-lah\" and \"Allahu Akbar\" all together [??], thirty three times.\"",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "906",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، قال حدثنا حرمي بن عمارة، قال حدثنا أبو خلدة  هو خالد بن دينار  قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم إذا اشتد البرد بكر بالصلاة، وإذا اشتد الحر أبرد بالصلاة، يعني الجمعة‏.‏ قال يونس بن بكير أخبرنا أبو خلدة فقال بالصلاة، ولم يذكر الجمعة‏.‏ وقال بشر بن ثابت حدثنا أبو خلدة قال صلى بنا أمير الجمعة ثم قال لأنس  رضى الله عنه  كيف كان النبي صلى الله عليه وسلم يصلي الظهر",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to offer the prayer earlier if it was very cold; and if it was very hot he used to delay the prayer, i.e. the Jumua prayer.",
      "chain": [
        "30161",
        "20221",
        "11583",
        "19"
      ]
    },
    {
      "hadith_no": "1021",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن ثابت، عن أنس، قال كان النبي صلى الله عليه وسلم يخطب يوم جمعة، فقام الناس فصاحوا فقالوا يا رسول الله، قحط المطر واحمرت الشجر وهلكت البهائم، فادع الله يسقينا‏.‏ فقال ‏\"‏ اللهم اسقنا ‏\"‏‏.‏ مرتين، وايم الله ما نرى في السماء قزعة من سحاب، فنشأت سحابة وأمطرت، ونزل عن المنبر فصلى، فلما انصرف لم تزل تمطر إلى الجمعة التي تليها، فلما قام النبي صلى الله عليه وسلم يخطب صاحوا إليه تهدمت البيوت وانقطعت السبل، فادع الله يحبسها عنا‏.‏ فتبسم النبي صلى الله عليه وسلم ثم قال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ فكشطت المدينة، فجعلت تمطر حولها ولا تمطر بالمدينة قطرة، فنظرت إلى المدينة وإنها لفي مثل الإكليل‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle I was delivering the Khutba (sermon) on a Friday when the people stood up, shouted and said, \"O Allah's Apostle! There is no rain (drought), the trees have dried and the livestock are destroyed; Please pray to Allah for rain.\" So Allah's Apostle said twice, \"O Allah! Bless us with rain.\" By Allah, there was no trace of cloud in the sky and suddenly the sky became overcast with clouds and it started raining. The Prophet came down the pulpit and offered the prayer. When he came back from the prayer (to his house) it was raining and it rained continuously till the next Friday. When the Prophet started delivering the Friday Khutba (sermon), the people started shouting and said to him, \"The houses have collapsed and the roads are cut off; so please pray to Allah to withhold the rain.\" So the Prophet smiled and said, \"O Allah! Round about us and not on us.\" So the sky became clear over Medina but it kept on raining over the outskirts (of Medina) and not a single drop of rain fell over Median. I looked towards the sky which was as bright and clear as a crown.",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1542",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وحدثنا محمد بن أبي بكر، حدثنا يزيد بن زريع، حدثنا عزرة بن ثابت، عن ثمامة بن عبد الله بن أنس، قال حج أنس على رحل، ولم يكن شحيحا، وحدث أن رسول الله صلى الله عليه وسلم حج على رحل وكانت زاملته‏.‏",
      "text_en": " Narrated Thumama bin `Abdullah bin Anas:                     Anas performed the Hajj on a packsaddle and he was not a miser. Anas said, \"Allah's Apostle performed Hajj on a packsaddle and the same Mount was carrying his baggage too.\"",
      "chain": [
        "30161",
        "20304",
        "20561",
        "11270"
      ]
    },
    {
      "hadith_no": "1560",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، قال حدثني سالم بن عبد الله، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه رئي وهو في معرس بذي الحليفة ببطن الوادي قيل له إنك ببطحاء مباركة‏.‏ وقد أناخ بنا سالم، يتوخى بالمناخ الذي كان عبد الله ينيخ، يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي، بينهم وبين الطريق وسط من ذلك‏.‏",
      "text_en": " Narrated Musa bin `Uqba:                     Salim bin `Abdullah's father said, \"The Prophet said that while resting in the bottom of the valley at Muarras in Dhul-Hulaifa, he had been addressed in a dream: 'You are verily in a blessed valley.' \" Salim made us to dismount from our camels at the place where `Abdullah used to dismount, aiming at the place where Allah's Apostle had rested and it was below the Mosque situated in the middle of the valley in between them (the residence) and the road.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1569",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، قال حدثني موسى بن عقبة، قال أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال انطلق النبي صلى الله عليه وسلم من المدينة، بعد ما ترجل وادهن ولبس إزاره ورداءه، هو وأصحابه، فلم ينه عن شىء من الأردية والأزر تلبس إلا المزعفرة التي تردع على الجلد، فأصبح بذي الحليفة، ركب راحلته حتى استوى على البيداء، أهل هو وأصحابه وقلد بدنته، وذلك لخمس بقين من ذي القعدة، فقدم مكة لأربع ليال خلون من ذي الحجة، فطاف بالبيت وسعى بين الصفا والمروة، ولم يحل من أجل بدنه لأنه قلدها، ثم نزل بأعلى مكة عند الحجون، وهو مهل بالحج، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة، وأمر أصحابه أن يطوفوا بالبيت وبين الصفا والمروة، ثم يقصروا من رءوسهم ثم يحلوا، وذلك لمن لم يكن معه بدنة قلدها، ومن كانت معه امرأته فهي له حلال، والطيب والثياب‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The Prophet with his companions started from Medina after combing and oiling his hair and putting on two sheets of lhram (upper body cover and waist cover). He did not forbid anyone to wear any kind of sheets except the ones colored with saffron because they may leave the scent on the skin. And so in the early morning, the Prophet mounted his Mount while in Dhul-Hulaifa and set out till they reached Baida', where he and his companions recited Talbiya, and then they did the ceremony of Taqlid (which means to put the colored garlands around the necks of the Budn (camels for sacrifice). And all that happened on the 25th of Dhul-Qa'da. And when he reached Mecca on the 4th of Dhul-Hijja he performed the Tawaf round the Ka`ba and performed the Tawaf between Safa and Marwa. And as he had a Badana and had garlanded it, he did not finish his Ihram. He proceeded towards the highest places of Mecca near Al-Hujun and he was assuming the Ihram for Hajj and did not go near the Ka`ba after he performed Tawaf (round it) till he returned from `Arafat. Then he ordered his companions to perform the Tawaf round the Ka`ba and then the Tawaf of Safa and Marwa, and to cut short the hair of their heads and to finish their Ihram. And that was only for those people who had not garlanded Budn. Those who had their wives with them were permitted to contact them (have sexual intercourse), and similarly perfume and (ordinary) clothes were permissible for them.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1650",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل، حدثنا موسى بن عقبة، أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم مكة، فطاف وسعى بين الصفا والمروة، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet arrived at Mecca and performed Tawaf of the Ka`ba and Sa`i between Safa and Marwa, but he did not go near the Ka`ba after his Tawaf till he returned from `Arafat.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1758",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس  رضى الله عنهما  قال لما قدم النبي صلى الله عليه وسلم مكة أمر أصحابه أن يطوفوا بالبيت، وبالصفا والمروة، ثم يحلوا، ويحلقوا أو يقصروا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet came to Mecca, he ordered his Companions to perform Tawaf round the Ka`ba and between Safa and Marwa, to finish their Ihram and get their hair shaved off or cut short.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2520",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا عثام، حدثنا هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت كنا نؤمر عند الخسوف بالعتاقة‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     We were ordered to free slaves at the time of lunar eclipses.",
      "chain": [
        "30161",
        "20295",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2854",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، عن أبي حازم، عن عبد الله بن أبي قتادة، عن أبيه، أنه خرج مع النبي صلى الله عليه وسلم فتخلف أبو قتادة مع بعض أصحابه وهم محرمون وهو غير محرم، فرأوا حمارا وحشيا قبل أن يراه، فلما رأوه تركوه حتى رآه أبو قتادة، فركب فرسا له يقال له الجرادة، فسألهم أن يناولوه سوطه فأبوا، فتناوله فحمل فعقره، ثم أكل فأكلوا، فندموا فلما أدركوه قال ‏\"‏ هل معكم منه شىء ‏\"‏‏.‏ قال معنا رجله، فأخذها النبي صلى الله عليه وسلم فأكلها‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     (from his father) Abu Qatada went out (on a journey) with Allah's Apostle but he was left behind with some of his companions who were in the state of Ihram. He himself was not in the state of Ihram. They saw an opener before he could see it. When they saw the opener, they did not speak anything till Abu Qatada saw it. So, he rode over his horse called Al-Jarada and requested them to give him his lash, but they refused. So, he himself took it and then attacked the opener and slaughtered it. He ate of its meat and his companions ate, too, but they regretted their eating. When they met the Prophet (they asked him about it) and he asked, \"Have you some of its meat (left) with you?\" Abu Qatada replied, \"Yes, we have its leg with us.\" So, the Prophet took and ate it.",
      "chain": [
        "30161",
        "20271",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "3247",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ ليدخلن من أمتي سبعون ألفا  أو سبعمائة ألف  لا يدخل أولهم حتى يدخل آخرهم، وجوههم على صورة القمر ليلة البدر ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Verily! 70,000 or 700,000 of my followers will enter Paradise altogether; so that the first and the last amongst them will enter at the same time, and their faces will be glittering like the bright full moon.\"",
      "chain": [
        "30161",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3769",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن أبي بكر المقدمي، حدثنا معتمر، عن أبيه، عن أبي عثمان، قال لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي قاتل فيهن رسول الله صلى الله عليه وسلم غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
      "text_en": " Narrated Abu `Uthman:                     During one of the Ghazawat in which Allah's Apostle was fighting, none remained with the Prophet but Talha and Sa`d.",
      "chain": [
        "30161",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "3874",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى، حدثنا سالم بن عبد الله، عن عبد الله بن عمر، رضى الله عنهما أن النبي صلى الله عليه وسلم لقي زيد بن عمرو بن نفيل بأسفل بلدح، قبل أن ينزل على النبي صلى الله عليه وسلم الوحى فقدمت إلى النبي صلى الله عليه وسلم سفرة، فأبى أن يأكل منها ثم قال زيد إني لست آكل مما تذبحون على أنصابكم، ولا آكل إلا ما ذكر اسم الله عليه‏.‏ وأن زيد بن عمرو كان يعيب على قريش ذبائحهم، ويقول الشاة خلقها الله، وأنزل لها من السماء الماء، وأنبت لها من الأرض، ثم تذبحونها على غير اسم الله إنكارا لذلك وإعظاما له‏.‏",
      "text_en": "  Narrated 'Abdullah bin 'Umar:                       The Prophet met Zaid bin 'Amr bin Nufail in the bottom of (the valley of) Baldah before any Divine Inspiration came to the Prophet. A meal was presented to the Prophet but he refused to eat from it. (Then it was presented to Zaid) who said, \"I do not eat anything which you slaughter in the name of your stone idols. I eat none but those things on which Allah's Name has been mentioned at the time of slaughtering.\" Zaid bin 'Amr used to criticize the way Quraish used to slaughter their animals, and used to say, \"Allah has created the sheep and He has sent the water for it from the sky, and He has grown the grass for it from the earth; yet you slaughter it in other than the Name of Allah. He used to say so, for he rejected that practice and considered it as something abominable.",
      "chain": [
        "30161",
        "20271",
        "20040",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4309",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا عمر بن علي، عن إسماعيل بن أبي خالد، عن عامر، قال كان ابن عمر إذا حيا ابن جعفر قال السلام عليك يا ابن ذي الجناحين‏.‏",
      "text_en": " Narrated 'Amir:                     Whenever Ibn `Umar greeted the son of Ja`far, he used to say (to him), \"Assalam 'Alaika (i.e. peace be on you) O the son of two-winged person.\"",
      "chain": [
        "30161",
        "20265",
        "11418",
        "11052"
      ]
    },
    {
      "hadith_no": "4352",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا الفضيل بن سليمان، حدثنا عاصم، عن أبي عثمان النهدي، عن مجاشع بن مسعود، انطلقت بأبي معبد إلى النبي صلى الله عليه وسلم ليبايعه على الهجرة، قال ‏\"‏ مضت الهجرة لأهلها، أبايعه على الإسلام والجهاد ‏\"‏‏.‏",
      "text_en": " Narrated Mujashi bin Masud:                     I took Abu Mabad to the Prophet in order that he might give him the pledge of allegiance for migration. The Prophet said, \"Migration has gone to its people, but I take the pledge from him (i.e. Abu Mabad) for Islam and Jihad.\"",
      "chain": [
        "30161",
        "20271",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "4562",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس، قال يطوف الرجل بالبيت ما كان حلالا حتى يهل بالحج، فإذا ركب إلى عرفة فمن تيسر له هدية من الإبل أو البقر أو الغنم، ما تيسر له من ذلك أى ذلك شاء، غير إن لم يتيسر له فعليه ثلاثة أيام في الحج، وذلك قبل يوم عرفة، فإن كان آخر يوم من الأيام الثلاثة يوم عرفة فلا جناح عليه، ثم لينطلق حتى يقف بعرفات من صلاة العصر إلى أن يكون الظلام، ثم ليدفعوا من عرفات إذا أفاضوا منها حتى يبلغوا جمعا الذي يتبرر فيه، ثم ليذكروا الله كثيرا، أو أكثروا التكبير والتهليل قبل أن تصبحوا ثم أفيضوا، فإن الناس كانوا يفيضون، وقال الله تعالى ‏{‏ثم أفيضوا من حيث أفاض الناس واستغفروا الله إن الله غفور رحيم‏}‏ حتى ترموا الجمرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man who wants to perform the Hajj (from Mecca) can perform the Tawaf around the Ka`ba as long as he is not in the state of Ihram till he assumes the Ihram for Hajj. Then, if he rides and proceeds to `Arafat, he should take a Hadi (i.e. animal for sacrifice), either a camel or a cow or a sheep, whatever he can afford; but if he cannot afford it, he should fast for three days during the Hajj before the day of `Arafat, but if the third day of his fasting happens to be the day of `Arafat (i.e. 9th of Dhul-Hijja) then it is no sin for him (to fast on it). Then he should proceed to `Arafat and stay there from the time of the `Asr prayer till darkness falls. Then the pilgrims should proceed from `Arafat, and when they have departed from it, they reach Jam' (i.e. Al-Muzdalifa) where they ask Allah to help them to be righteous and dutiful to Him, and there they remember Allah greatly or say Takbir (i.e. Allah is Greater) and Tahlil (i.e. None has the right to be worshipped but Allah) repeatedly before dawn breaks. Then, after offering the morning (Fajr) prayer you should pass on (to Mina) for the people used to do so and Allah said:-- \"Then depart from the place whence all the people depart. And ask for Allah's Forgiveness. Truly! Allah is Oft-Forgiving, Most Merciful.\" (2.199) Then you should go on doing so till you throw pebbles over the Jamra.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "5281",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا معتمر، عن عبيد الله، عن محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ دخلت الجنة  أو أتيت الجنة  فأبصرت قصرا فقلت لمن هذا قالوا لعمر بن الخطاب‏.‏ فأردت أن أدخله فلم يمنعني إلا علمي بغيرتك ‏\"‏‏.‏ قال عمر بن الخطاب يا رسول الله بأبي أنت وأمي يا نبي الله أوعليك أغار‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet, said, \"I entered Paradise and saw a palace and asked whose palace is this? They (the Angels) said, \"This palace belongs to `Umar bin Al-Khattab.' I intended to enter it, and nothing stopped me except my knowledge about your sense of Ghira (self-respect (O `Umar).\" `Umar said, \"O Allah's Apostle! Let my father and mother be sacrificed for you! O Allah's Prophet! How dare I think of my Ghira (self-respect) being offended by you?\"",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "5559",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن نافع، سمع ابن كعب بن مالك، يخبر ابن عمر أن أباه، أخبره أن جارية لهم كانت ترعى غنما بسلع، فأبصرت بشاة من غنمها موتا، فكسرت حجرا فذبحتها، فقال لأهله لا تأكلوا حتى آتي النبي صلى الله عليه وسلم فأسأله، أو حتى أرسل إليه من يسأله‏.‏ فأتى النبي صلى الله عليه وسلم أو بعث إليه فأمر النبي صلى الله عليه وسلم بأكلها‏.‏",
      "text_en": " Narrated Ka`b:                     that a slave girl of theirs used to shepherd some sheep at Si'a (a mountain near Medina). On seeing one of her sheep dying, she broke a stone and slaughtered it. Ka`b said to his family, \"Do not eat (of it) till I go to the Prophet and ask him, or, till I send someone to ask him.\" So he went to the Prophet or sent someone to him The Prophet permitted (them) to eat it.",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "5609",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا خالد بن الحارث، حدثنا عبيد الله، عن نافع، قال كان عبد الله ينحر في المنحر‏.‏ قال عبيد الله يعني منحر النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated Nafi':                          'Abdullah (bin 'Umar) used to slaughter his sacrifice at the      slaughtering place (i.e the slaughtering place of the Prophet ) .",
      "chain": [
        "30161",
        "20226",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "5643",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يوسف أبو معشر البراء، قال سمعت سعيد بن عبيد الله، قال حدثني بكر بن عبد الله، أن أنس بن مالك، حدثهم أن الخمر حرمت، والخمر يومئذ البسر والتمر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe dates.",
      "chain": [
        "30161",
        "11629",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "5922",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن سعيد بن أبي سعيد، عن أبي سلمة بن عبد الرحمن، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان يحتجر حصيرا بالليل فيصلي، ويبسطه بالنهار فيجلس عليه، فجعل الناس يثوبون إلى النبي صلى الله عليه وسلم فيصلون بصلاته حتى كثروا فأقبل فقال ‏\"‏ يا أيها الناس خذوا من الأعمال ما تطيقون، فإن الله لا يمل حتى تملوا، وإن أحب الأعمال إلى الله ما دام وإن قل ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to construct a loom with a Hasir at night m order to pray therein, and during the day he used to spread it out and sit on it. The people started coming to the Prophet at night to offer the prayer behind him When their number increased, the Prophet faced them and said. O people! Do only those good deeds which you can do, for Allah does not get tired (of giving reward) till you get tired, and the best deeds to Allah are the incessant ones though they were few.",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "6552",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا عمر بن علي، سمع أبا حازم، عن سهل بن سعد، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يضمن لي ما بين لحييه وما بين رجليه أضمن له الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Allah's Apostle said, \"Whoever can guarantee (the chastity of) what is between his two jaw-bones and what is between his two legs (i.e. his tongue and his private parts), I guarantee Paradise for him.\"",
      "chain": [
        "30161",
        "20265",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6790",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، حدثنا حكيم بن أبي حرة الأسلمي، أنه سمع عبد الله بن عمر  رضى الله عنهما  سئل عن رجل، نذر أن لا، يأتي عليه يوم إلا صام، فوافق يوم أضحى أو فطر‏.‏ فقال لقد كان لكم في رسول الله أسوة حسنة، لم يكن يصوم يوم الأضحى والفطر، ولا يرى صيامهما‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     that he was asked about a man who had vowed that he would fast all the days of his life then the day of `Id al Adha or `Id-al-Fitr came. `Abdullah bin `Umar said: You have indeed a good example in Allah's Apostle. He did not fast on the day of `Id al Adha or the day of `Id-al-Fitr, and we do not intend fasting on these two days.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11687",
        "18"
      ]
    },
    {
      "hadith_no": "6895",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا عمر بن علي‏.‏ وحدثني خليفة، حدثنا عمر بن علي، حدثنا أبو حازم، عن سهل بن سعد الساعدي، قال النبي صلى الله عليه وسلم ‏\"‏ من توكل لي ما بين رجليه وما بين لحييه، توكلت له بالجنة ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Whoever guarantees me (the chastity of) what is between his legs (i.e. his private parts), and what is between his jaws (i.e., his tongue), I guarantee him Paradise.\"",
      "chain": [
        "30161",
        "30132",
        "20265",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "7125",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، حدثنا موسى، حدثني سالم بن عبد الله، عن عبد الله بن عمر  رضى الله عنهما  في رؤيا النبي صلى الله عليه وسلم في المدينة ‏\"‏ رأيت امرأة سوداء ثائرة الرأس، خرجت من المدينة، حتى نزلت بمهيعة، فتأولتها أن وباء المدينة نقل إلى مهيعة، وهى الجحفة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     concerning the dream of the Prophet in Medina: The Prophet said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling at Mahai'a. I interpreted that as (a symbol of) the epidemic of Medina being transferred to Mahai'a, namely, Al-Juhfa.\"",
      "chain": [
        "30161",
        "20271",
        "20040",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7509",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد، حدثنا محمد بن أبي بكر المقدمي، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال جاء زيد بن حارثة يشكو فجعل النبي صلى الله عليه وسلم يقول ‏\"‏ اتق الله، وأمسك عليك زوجك ‏\"‏‏.‏ قالت عائشة لو كان رسول الله صلى الله عليه وسلم كاتما شيئا لكتم هذه‏.‏ قال فكانت زينب تفخر على أزواج النبي صلى الله عليه وسلم تقول زوجكن أهاليكن، وزوجني الله تعالى من فوق سبع سموات‏.‏ وعن ثابت ‏{‏وتخفي في نفسك ما الله مبديه وتخشى الناس‏}‏ نزلت في شأن زينب وزيد بن حارثة‏.‏",
      "text_en": " Narrated Anas:                     Zaid bin Haritha came to the Prophet complaining about his wife. The Prophet kept on saying (to him), \"Be afraid of Allah and keep your wife.\" Aisha said, \"If Allah's Apostle were to conceal anything (of the Qur'an he would have concealed this Verse.\" Zainab used to boast before the wives of the Prophet and used to say, \"You were given in marriage by your families, while I was married (to the Prophet) by Allah from over seven Heavens.\" And Thabit recited, \"The Verse:-- 'But (O Muhammad) you did hide in your heart that which Allah was about to make manifest, you did fear the people,' (33.37) was revealed in connection with Zainab and Zaid bin Haritha.\"",
      "chain": [
        "30007",
        "30161",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، عن الوليد أبي بشر، قال سمعت حمران، يقول سمعت عثمان، يقول سمعت رسول الله صلى الله عليه وسلم يقول مثله سواء ‏.‏",
      "text_en": " It is narrated on the authority of Humran that he heard Uthman saying this:                      I heard the Messenger of Allah (may peace be upon him) uttering these words (as stated above).",
      "chain": [
        "30161",
        "20212",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت الحسن، يقول حدثنا جندب بن عبد الله البجلي، في هذا المسجد فما نسينا وما نخشى أن يكون جندب كذب على رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خرج برجل فيمن كان قبلكم خراج ‏\"‏ ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " It is reported on the authority of Hasan:                      Jundab b. 'Abdullah al-Bajali narrated this hadith in this mosque which we can neither forget and at the same time we have no apprehension that Jundab could attribute a lie to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) observed: A person belonging to the people of the past suffered from a boil, and then the rest of the hadith was narrated.",
      "chain": [
        "30161",
        "20298",
        "11272",
        "11016"
      ]
    },
    {
      "hadith_no": "531",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، ومحمد بن أبي بكر المقدمي، ومحمد بن عبد الملك الأموي، قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الله بن الحارث بن نوفل، عن العباس بن عبد المطلب، أنه قال يا رسول الله هل نفعت أبا طالب بشىء فإنه كان يحوطك ويغضب لك قال ‏\"‏ نعم هو في ضحضاح من نار ولولا أنا لكان في الدرك الأسفل من النار ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'Abbas b. Abd al-Muttalib that he said:                      Messenger of Allah, have you benefited Abu Talib in any way for he defended you and was fervent in your defence? The Messenger of Allah (may peace he upon him) said: Yes; he would be in the most shallow part of the Fire: and but for me he would have been in the lowest part of Hell.",
      "chain": [
        "30024",
        "30161",
        "20469",
        "11368",
        "912",
        "100"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن أبي بكر المقدمي، وزهير بن حرب، قالا حدثنا يحيى، - وهو ابن سعيد - عن عبيد الله، ح وحدثنا أبو بكر بن أبي شيبة، وابن، نمير - واللفظ لهما - قال ابن نمير حدثنا أبي وقال أبو بكر، حدثنا أبو أسامة، - قالا حدثنا عبيد الله، عن نافع، عن ابن عمر، أن عمر، قال يا رسول الله أيرقد أحدنا وهو جنب قال ‏\"‏ نعم إذا توضأ ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      Umar said: Is one amongst us permitted to sleep in a state of impurity (i. e. after having sexual intercourse)? He (the Holy Prophet) said: Yes, after performing ablution.",
      "chain": [
        "30161",
        "30022",
        "20031",
        "11201",
        "30201",
        "30212",
        "20331",
        "20436",
        "20318",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "1452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، ح وحدثناه إسحاق بن إبراهيم، أخبرنا المعتمر بن سليمان، جميعا عن هشام، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Hisham with the same chain of transmitters.",
      "chain": [
        "30161",
        "20031",
        "30123",
        "20288"
      ]
    },
    {
      "hadith_no": "1548",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا عباد بن عباد، حدثنا عاصم، عن أبي عثمان، عن أبى بن كعب، قال كان رجل من الأنصار بيته أقصى بيت في المدينة فكان لا تخطئه الصلاة مع رسول الله صلى الله عليه وسلم - قال - فتوجعنا له فقلت له يا فلان لو أنك اشتريت حمارا يقيك من الرمضاء ويقيك من هوام الأرض ‏.‏ قال أما والله ما أحب أن بيتي مطنب ببيت محمد صلى الله عليه وسلم قال فحملت به حملا حتى أتيت نبي الله صلى الله عليه وسلم فأخبرته - قال - فدعاه فقال له مثل ذلك وذكر له أنه يرجو في أثره الأجر ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ إن لك ما احتسبت ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b reported:                      There was a person among the Ansar whose house was situated at the farthest end of Medina, but he never in missed any prayer along with the Messenger of Allah (may peace be upon him). We felt pity for him and said to him: O, so and so, had you bought a donkey it would have saved you from the burning sand and would have saved you from the reptiles of the earth. He said: Listen I by Allah, I do not like my house to be situated by the side of Muhammad (may peace be upon him). I took (these words of his) ill and came to the Apostle of Allah (may peace be upon him) and informed him about (these words). He (the Holy Prophet) called him and he said exactly like that (which he had mentioned to Ubbay b. Ka'b), but made a mention of this (also) that he wanted a reward for his steps. Upon this the Apostle of Allah (may peace be upon him) said: In fact for you is the reward which you expect.",
      "chain": [
        "30161",
        "20243",
        "11080",
        "11113",
        "39"
      ]
    },
    {
      "hadith_no": "1606",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى، عن ابن جريج، قال حدثني عبد الرحمن بن عبد الله بن أبي عمار، عن عبد الله بن بابيه، عن يعلى بن أمية، قال قلت لعمر بن الخطاب ‏.‏ بمثل حديث ابن إدريس ‏.‏",
      "text_en": " Ya'la b. Umayya reported:                      I said to 'Umar b. al-Khattab, and the rest of the hadlth is the same.",
      "chain": [
        "30161",
        "20031",
        "11070",
        "10647"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يوسف الماجشون، حدثني أبي، عن عبد، الرحمن الأعرج عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة قال ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت ‏.‏ أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك أنا بك وإليك تباركت وتعاليت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ وإذا ركع قال ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت خشع لك سمعي وبصري ومخي وعظمي وعصبي ‏\"‏ ‏.‏ وإذا رفع قال ‏\"‏ اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما بينهما وملء ما شئت من شىء بعد ‏\"‏ ‏.‏ وإذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت سجد وجهي للذي خلقه وصوره وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ثم يكون من آخر ما يقول بين التشهد والتسليم ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ‏\"‏ ‏.‏",
      "text_en": " A'raj reported that when the Messenger of Allah (may peace be upon him) would start the prayer, he would pronounce takbir (Allah-o-Akbar) and then say:                      I turn my face (up to Thee), I am the first of the believers; and when he raised his head from ruku' he said: Allah listened to him who praised Him; O our Lord, praise be to Thee; and he said: He shaped (man) and how fine is his shape? And he (the narrator) said: When he pronounced salutation he said: O Allah, forgive me my ear- lier (sins), to the end of the hadith; and he did not say it between the Tashahhud and salutation (as mentioned above).",
      "chain": [
        "30161",
        "24511",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "2117",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثني عبد الأعلى بن حماد، ومحمد بن أبي بكر المقدمي، قالا حدثنا معتمر، حدثنا عبيد الله، عن ثابت البناني، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم يخطب يوم الجمعة فقام إليه الناس فصاحوا وقالوا يا نبي الله قحط المطر واحمر الشجر وهلكت البهائم ‏.‏ وساق الحديث وفيه من رواية عبد الأعلى فتقشعت عن المدينة ‏.‏ فجعلت",
      "text_en": " Anas b. Malik reported that while the Apostle of Allah (may peace be upon him) was delivering the sermon on Friday, people stood up before him and said in a loud voice:                      Apostle of Allah, there is a drought and the trees have become yellow, the animals have died; and the rest of the hadith is the same, and in the narration transmitted by 'Abd al-A'la the words are:\" The clouds cleard from Medina and it began to rain around it and not a single drop of rain fell in Medina. And as I looked towards Medina, I found it hollow like (the hollowness of) a basin.",
      "chain": [
        "30146",
        "30161",
        "20288",
        "11201",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2275",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه محمد بن أبي بكر المقدمي، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن شعبة، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "30161",
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "2514",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا ابن علية، وحماد بن زيد، ح وحدثنا قتيبة بن سعيد، حدثنا حماد بن زيد، ح وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لهما - قالا حدثنا إسماعيل ابن علية، عن أيوب، عن محمد، عن عبيدة، عن علي، قال ذكر الخوارج فقال فيهم رجل مخدج اليد - أو مودن اليد أو مثدون اليد - لولا أن تبطروا لحدثتكم بما وعد الله الذين يقتلونهم على لسان محمد صلى الله عليه وسلم - قال - قلت آنت سمعته من محمد صلى الله عليه وسلم قال إي ورب الكعبة إي ورب الكعبة إي ورب الكعبة ‏.‏",
      "text_en": " 'Abida narrated from 'Ali that he made a mention of the Khwarij (and in this connection) said that there would be a person among them with a defective hand. (or with a short hand) or a fleshy hand. If you were to exercise restraint, I would tell you what Allah has promised to those who would kill them on the order of Mubarrmad (may peace be upon him). I (the narrator) said to him:                      Did you hear it from Muhammad: (may peace be upon him)? He (Hadrat 'Ali) said: Yes, by the Lord of the Ka'ba; Yes, by the Lord of the Ka'ba; yes, by the Lord of the Ka'ba.",
      "chain": [
        "30161",
        "20208",
        "20022",
        "30367",
        "20022",
        "30201",
        "30022",
        "20208",
        "11015",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، عن التيمي، ح وحدثناه محمد بن المثنى، حدثنا ابن مهدي، حدثنا شعبة، وقال ابن المثنى، حدثنا أبو عامر، حدثنا هشام، وقال ابن المثنى، حدثنا سالم بن نوح، حدثنا عمر يعني ابن عامر، ح وحدثنا أبو بكر بن أبي شيبة حدثنا محمد بن بشر، عن سعيد، كلهم عن قتادة، بهذا الإسناد ‏.‏ نحو حديث همام غير أن في حديث التيمي وعمر بن عامر وهشام لثمان عشرة خلت وفي حديث سعيد في ثنتى عشرة ‏.‏ وشعبة لسبع عشرة أو تسع عشرة ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Qatada with the same chain of transmitters by different narrators (except this difference) that in the hadith transmitted by Taimi and Umar b. Amir and Hisham (the date of setting out is) 18th, and in the hadith transmitted by Sa'id it is the 12th, and in the one transmitted by Shu'ba it is the 17th or 19th.",
      "chain": [
        "30161",
        "20031",
        "11289",
        "30170",
        "20033",
        "20020",
        "20443",
        "20295",
        "20542",
        "30201",
        "20352"
      ]
    },
    {
      "hadith_no": "3039",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا حامد بن عمر البكراوي، ومحمد بن أبي بكر المقدمي، قالا حدثنا بشر، بن المفضل حدثنا عمران بن مسلم، عن أبي رجاء، قال قال عمران بن حصين نزلت آية المتعة في كتاب الله - يعني متعة الحج - وأمرنا بها رسول الله صلى الله عليه وسلم ثم لم تنزل آية تنسخ آية متعة الحج ولم ينه عنها رسول الله صلى الله عليه وسلم حتى مات ‏.‏ قال رجل برأيه بعد ما شاء ‏.‏",
      "text_en": "  'Imran b. Husain said:                      There was revealed the verse of Tamattu' in Hajj in the Book of Allah and the Messenger of Allah (may peace be upon him) commanded us to perform it. and then no verse was revealed abrogating the Tamattu' (form of Hajj), and the Messenger of Allah (may peace be upon him) did not forbid to do it till he died. So whatever a person said was his personal opinion.",
      "chain": [
        "30128",
        "30161",
        "20212",
        "11562",
        "11440"
      ]
    },
    {
      "hadith_no": "3127",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، أن عمر، قبل الحجر وقال إني لأقبلك وإني لأعلم أنك حجر ولكني رأيت رسول الله صلى الله عليه وسلم يقبلك ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that Umar (Allah be pleased with him) kissed the Stone and said:                      I am kissing you, whereas I know that you are a stone, but I saw Allah's Messenger (may peace be upon him) kissing you (that Is why I kiss you).",
      "chain": [
        "30161",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3182",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى، - وهو القطان - عن ابن جريج، حدثني عبد الله، مولى أسماء قال قالت لي أسماء وهى عند دار المزدلفة هل غاب القمر قلت لا ‏.‏ فصلت ساعة ثم قالت يا بنى هل غاب القمر قلت نعم ‏.‏ قالت ارحل بي ‏.‏ فارتحلنا حتى رمت الجمرة ثم صلت في منزلها فقلت لها أى هنتاه لقد غلسنا ‏.‏ قالت كلا أى بنى إن النبي صلى الله عليه وسلم أذن للظعن ‏.‏",
      "text_en": "  Abdullah, the freed slave of (Hadrat) Asma', reported:                      Asma' (Allah be pleased with her), as she was in the house at Muzdalifa, asked me whether the moon had set. I said: No. She prayed for some time, and again said: My son has the moon set? I said: Yes. And she said: Set forth along with me, and so we set forth until (we reached Mini) and the stoned at al-Jamra. She then prayed in her place. I said to her: Respected lady, we set forth (in the very early part of dawn) when it was dark, whereupon she said: My son, there is no harm in it; Allah's Apostle (may peace be upon him) had granted permission to women.",
      "chain": [
        "30161",
        "20031",
        "11070"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، ومحمد بن أبي بكر المقدمي، قالا حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن الأعمش، بهذا الإسناد نحو حديث ابن مسهر ووكيع إلا قوله ‏\"‏ من تولى غير مواليه ‏\"‏ وذكر اللعنة له ‏.‏",
      "text_en": " A hadith like this has been narrated with the same chain of transmitters by A'mash with a slight variation of words.",
      "chain": [
        "30024",
        "30161",
        "20033",
        "20012"
      ]
    },
    {
      "hadith_no": "3513",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا حماد بن زيد، عن أيوب، عن نافع، حدثني نبيه بن وهب، قال بعثني عمر بن عبيد الله بن معمر وكان يخطب بنت شيبة بن عثمان على ابنه فأرسلني إلى أبان بن عثمان وهو على الموسم فقال ألا أراه أعرابيا ‏\"‏ إن المحرم لا ينكح ولا ينكح ‏\"‏ ‏.‏ أخبرنا بذلك عثمان عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nubaih b. Wahb reported:                      Umar b. Ubaidullah b. Ma'mar sent me to Aban b. Uthman as he wanted to make the proposal of the marriage of his son with the daughter of Shaiba b. Uthman. He (Aban b. Uthman) was at that time (busy) in the season of Pilgrimage. He said: I deem him to be a man of the desert (for it is a common thing) that a Muhrim can neither marry, nor is he allowed to be married to anyone. It is Uthman (b. Affan) who reported this to us from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30161",
        "20022",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "3655",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، عن جرير، ح وحدثنا ابن، نمير حدثنا أبي ح، وحدثنا محمد بن أبي بكر المقدمي، حدثنا عبد الرحمن بن مهدي، عن سفيان، كلهم عن الأعمش، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of A'mash with the same chain of transmitters.",
      "chain": [
        "30203",
        "30123",
        "20028",
        "30212",
        "20331",
        "30161",
        "20033"
      ]
    },
    {
      "hadith_no": "4235",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، ومحمد بن المثنى، - واللفظ لابن المثنى - قالا حدثنا يحيى بن سعيد، حدثنا هشام، حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن، أبي طلحة أن عمر بن الخطاب، خطب يوم جمعة فذكر نبي الله صلى الله عليه وسلم وذكر أبا بكر ثم قال إني لا أدع بعدي شيئا أهم عندي من الكلالة ما راجعت رسول الله صلى الله عليه وسلم في شىء ما راجعته في الكلالة وما أغلظ لي في شىء ما أغلظ لي فيه حتى طعن بإصبعه في صدري وقال ‏\"‏ يا عمر ألا تكفيك آية الصيف التي في آخر سورة النساء ‏\"‏ ‏.‏ وإني إن أعش أقض فيها بقضية يقضي بها من يقرأ القرآن ومن لا يقرأ القرآن ‏.‏",
      "text_en": " Abu Talha reported:                      'Umar b. al-Khattab (Allah be pleased with him) delivered a sermon on Friday and made a mention of Allah's Apostle (may peace be upon him) and he also made a mention of Abu Bakr (Allah be pleased with him) and then said: I do not leave behind me any problem more difficult than that of Kalala. I did not refer to Allah's Messenger (may peace be upon him) more repeatedly than in case of the problem of Kalala, and he (the Holy Prophet) never showed more annoyance to me than in regard to this problem, so much so that he struck my chest with his fingers and said: 'Umar, does the verse revealed in summer season, at the end of Sura al-Nisa' not suffice you? Hadrat 'Umar (then) said: If I live I would give such verdict about (Kalala) that everyone would be able to decide whether he reads the Qur'an or he does not.",
      "chain": [
        "30161",
        "30170",
        "20031",
        "11065",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "4382",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، ومحمد بن المثنى، وزهير بن حرب، - واللفظ لزهير - قالوا حدثنا يحيى، - وهو ابن سعيد القطان - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن عمر، قال يا رسول الله إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام ‏.‏ قال ‏\"‏ فأوف بنذرك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported that Umar (b. Khattab) said:                      Messenger of Allah, I had taken a vow during the days of Ignorance (Jahiliyya) that I would observe I'tikaf for a night in the Sacred Mosque. He (the Holy Prophet) said: Fulfil your vow.",
      "chain": [
        "30161",
        "30170",
        "30022",
        "20031",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4547",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا سليمان أبو داود، حدثنا زائدة، عن السدي، عن سعد بن عبيدة، عن أبي عبد الرحمن، قال خطب علي فقال يا أيها الناس أقيموا على أرقائكم الحد من أحصن منهم ومن لم يحصن فإن أمة لرسول الله صلى الله عليه وسلم زنت فأمرني أن أجلدها فإذا هي حديث عهد بنفاس فخشيت إن أنا جلدتها أن أقتلها فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ أحسنت ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman reported that 'Ali, while delivering the address said:                      O people, impose the prescribed punishment upon your slaves, those who are married and those not married, for a slave-woman belonging to Allah's Messenger (may peace be upon him) had committed adultery, and he committed me to flog her. But she had recently given birth to a child and I was afraid that if I flogged her I might kill her. So I mentioned that to Allah's Apostle (may peace be upon him) and he said: You have done well.",
      "chain": [
        "30161",
        "20320",
        "10743",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "5523",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، كلهم عن عبيد الله، ح وحدثني سويد بن سعيد، حدثنا حفص بن ميسرة، عن موسى بن عقبة، كلاهما عن نافع، عن ابن، عمر عن النبي صلى الله عليه وسلم بنحو حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Umar through another chain of transmitters.",
      "chain": [
        "30212",
        "20331",
        "30201",
        "20318",
        "30161",
        "20031",
        "11201",
        "30547",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6395",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، قالوا حدثنا المعتمر، - وهو ابن سليمان - قال سمعت أبي، عن أبي عثمان، قال لم يبق مع رسول الله صلى الله عليه وسلم في بعض تلك الأيام التي قاتل فيهن رسول الله صلى الله عليه وسلم غير طلحة وسعد ‏.‏ عن حديثهما ‏.‏",
      "text_en": " Abu 'Uthman reported on one of the days when Allah's Messenger (may peace be upon him) was fighting and none remained with him save Talha and Sa'd.",
      "chain": [
        "30161",
        "30128",
        "30449",
        "20288",
        "11289",
        "11113"
      ]
    }
  ],
  "total_hadiths": 51
}