{
  "id": "30160",
  "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
  "full_name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "167",
      "date_gregorian": "NA",
      "date_display": [
        "167 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "252",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Basri",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20221",
      "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20214",
      "name": "Bahz bin Asad al-'Ami",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20542",
      "name": "Salm bin Nwh bin Aby سالم بن نوح بن أبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20224",
      "name": "Hmad bin Ms'd'h al-Tmymy حماد بن مسعدة التميمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20712",
      "name": "Sahl bin Yusuf al-Anmaty سهل بن يوسف الأنماطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30426",
      "name": "Ibrahim bin Muhammad bin 'Ar'ara إبراهيم بن محمد بن عرعرة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20260",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20530",
      "name": "Umayya bin Khalid bin al-'Aswad أمية بن خالد بن الأسود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20255",
      "name": "'Abdul Malik bin al-Sbah al-Msm'y عبد الملك بن الصباح المسمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "69",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، قال حدثني أبو التياح، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسروا ولا تعسروا، وبشروا ولا تنفروا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Facilitate things to people (concerning religious matters), and do not make it hard for them and give them good tidings and do not make them run away (from Islam).",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "87",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي جمرة، قال كنت أترجم بين ابن عباس وبين الناس فقال إن وفد عبد القيس أتوا النبي صلى الله عليه وسلم فقال ‏\"‏ من الوفد  أو من القوم ‏\"‏‏.‏ قالوا ربيعة‏.‏ فقال ‏\"‏ مرحبا بالقوم  أو بالوفد  غير خزايا ولا ندامى ‏\"‏‏.‏ قالوا إنا نأتيك من شقة بعيدة، وبيننا وبينك هذا الحى من كفار مضر، ولا نستطيع أن نأتيك إلا في شهر حرام فمرنا بأمر نخبر به من وراءنا، ندخل به الجنة‏.‏ فأمرهم بأربع، ونهاهم عن أربع أمرهم بالإيمان بالله عز وجل وحده‏.‏ قال ‏\"‏ هل تدرون ما الإيمان بالله وحده ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وتعطوا الخمس من المغنم ‏\"‏‏.‏ ونهاهم عن الدباء والحنتم والمزفت‏.‏ قال شعبة ربما قال النقير، وربما قال المقير‏.‏ قال ‏\"‏ احفظوه وأخبروه من وراءكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Jamra:                     I was an interpreter between the people and Ibn `Abbas. Once Ibn `Abbas said that a delegation of the tribe of `Abdul Qais came to the Prophet who asked them, \"Who are the people (i.e. you)? (Or) who are the delegates?\" They replied, \"We are from the tribe of Rabi`a.\" Then the Prophet said to them, \"Welcome, O people (or said, \"O delegation (of `Abdul Qais).\") Neither will you have disgrace nor will you regret.\" They said, \"We have come to you from a distant place and there is the tribe of the infidels of Mudar intervening between you and us and we cannot come to you except in the sacred month. So please order us to do something good (religious deeds) and that we may also inform our people whom we have left behind (at home) and that we may enter Paradise (by acting on them.)\" The Prophet ordered them to do four things, and forbade them from four things. He ordered them to believe in Allah Alone, the Honorable the Majestic and said to them, \"Do you know what is meant by believing in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet said, \"(That means to testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to observe fasts during the month of Ramadan, (and) to pay Al-Khumus (one fifth of the booty to be given in Allah's cause).\" Then he forbade them four things, namely Ad-Dubba.' Hantam, Muzaffat (and) An-Naqir or Muqaiyar (These were the names of pots in which alcoholic drinks used to be prepared). The Prophet further said, \"Memorize them (these instructions) and tell them to the people whom you have left behind.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏ وعن عبد الرحمن بن الأصبهاني، قال سمعت أبا حازم، عن أبي هريرة، قال ‏\"‏ ثلاثة لم يبلغوا الحنث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     as above (the sub narrators are different). Abu Huraira qualified the three children referred to in the above mentioned Hadith as not having reached the age of committing sins (i.e. age of puberty) .",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عطاء بن أبي ميمونة، سمع أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يدخل الخلاء، فأحمل أنا وغلام إداوة من ماء، وعنزة، يستنجي بالماء‏.‏ تابعه النضر وشاذان عن شعبة‏.‏ العنزة عصا عليه زج‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy used to carry a tumbler full of water (for cleaning the private parts) and a short spear (or stick).",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن مخول بن راشد، عن محمد بن علي، عن جابر بن عبد الله، قال كان النبي صلى الله عليه وسلم يفرغ على رأسه ثلاثا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pour water three times on his head.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11390",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا ابن أبي عدي، ويحيى بن سعيد، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال ذكرته لعائشة فقالت يرحم الله أبا عبد الرحمن، كنت أطيب رسول الله صلى الله عليه وسلم، فيطوف على نسائه، ثم يصبح محرما ينضخ طيبا‏.‏",
      "text_en": " Narrated Muhammad bin Al-Muntathir:                     on the authority of his father that he had asked `Aisha (about the Hadith of Ibn `Umar). She said, \"May Allah be Merciful to Abu `Abdur-Rahman. I used to put scent on Allah's Apostle and he used to go round his wives, and in the morning he assumed the Ihram, and the fragrance of scent was still coming out from his body.\"",
      "chain": [
        "30160",
        "20276",
        "20031",
        "20020",
        "11321",
        "11388"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا أنس بن مالك، قال كان النبي صلى الله عليه وسلم يدور على نسائه في الساعة الواحدة من الليل والنهار، وهن إحدى عشرة‏.‏ قال قلت لأنس أوكان يطيقه قال كنا نتحدث أنه أعطي قوة ثلاثين‏.‏ وقال سعيد عن قتادة إن أنسا حدثهم تسع نسوة‏.‏",
      "text_en": " Narrated Qatada:                     Anas bin Malik said, \"The Prophet used to visit all his wives in a round, during the day and night and they were eleven in number.\" I asked Anas, \"Had the Prophet the strength for it?\" Anas replied, \"We used to say that the Prophet was given the strength of thirty (men).\" And Sa`id said on the authority of Qatada that Anas had told him about nine wives only (not eleven).",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، قال قال عمار فضرب النبي صلى الله عليه وسلم بيده الأرض، فمسح وجهه وكفيه‏.‏",
      "text_en": " Narrated `Ammar:                     The Prophet stroked the earth with his hands and then passed them over his face and the backs of his hands (while demonstrating Tayammum).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "535",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن المهاجر أبي الحسن، سمع زيد بن وهب، عن أبي ذر، قال أذن مؤذن النبي صلى الله عليه وسلم الظهر فقال ‏\"‏ أبرد أبرد  أو قال  انتظر انتظر ‏\"‏‏.‏ وقال ‏\"‏ شدة الحر من فيح جهنم، فإذا اشتد الحر فأبردوا عن الصلاة ‏\"‏‏.‏ حتى رأينا فىء التلول‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Mu'adh-dhin (call-maker) of the Prophet pronounced the Adhan (call) for the Zuhr prayer but the Prophet said, \"Let it be cooler, let it be cooler.\" Or said, 'Wait, wait, because the severity of heat is from the raging of the Hell-fire. In severe hot weather, pray when it becomes (a bit) cooler and the shadows of hillocks appear.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "560",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سعد، عن محمد بن عمرو بن الحسن بن علي، قال قدم الحجاج فسألنا جابر بن عبد الله فقال كان النبي صلى الله عليه وسلم يصلي الظهر بالهاجرة، والعصر والشمس نقية، والمغرب إذا وجبت، والعشاء أحيانا وأحيانا، إذا رآهم اجتمعوا عجل، وإذا رآهم أبطوا أخر، والصبح كانوا  أو كان النبي صلى الله عليه وسلم يصليها بغلس‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pray the Zuhr at midday, and the `Asr at a time when the sun was still bright, the Maghrib after sunset (at its stated time) and the `Isha at a variable time. Whenever he saw the people assembled (for `Isha' prayer) he would pray earlier and if the people delayed, he would delay the prayer. And they or the Prophet used to offer the Fajr Prayers when it still dark.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "9",
        "11220"
      ]
    },
    {
      "hadith_no": "625",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، قال سمعت عمرو بن عامر الأنصاري، عن أنس بن مالك، قال كان المؤذن إذا أذن قام ناس من أصحاب النبي صلى الله عليه وسلم يبتدرون السواري حتى يخرج النبي صلى الله عليه وسلم وهم كذلك يصلون الركعتين قبل المغرب، ولم يكن بين الأذان والإقامة شىء‏.‏ قال عثمان بن جبلة وأبو داود عن شعبة لم يكن بينهما إلا قليل‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"When the Mu'adh-dhin pronounced the Adhan, some of the companions of the Prophet would proceed to the pillars of the mosque (for the prayer) till the Prophet arrived and in this way they used to pray two rak`at before the Maghrib prayer. There used to be a little time between the Adhan and the Iqama.\" Shu`ba said, \"There used to be a very short interval between the two (Adhan and Iqama).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "660",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا يحيى، عن عبيد الله، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله في ظله يوم لا ظل إلا ظله الإمام العادل، وشاب نشأ في عبادة ربه، ورجل قلبه معلق في المساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل طلبته امرأة ذات منصب وجمال فقال إني أخاف الله‏.‏ ورجل تصدق أخفى حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خاليا ففاضت عيناه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah will give shade, to seven, on the Day when there will be no shade but His. (These seven persons are) a just ruler, a youth who has been brought up in the worship of Allah (i.e. worships Allah sincerely from childhood), a man whose heart is attached to the mosques (i.e. to pray the compulsory prayers in the mosque in congregation), two persons who love each other only for Allah's sake and they meet and part in Allah's cause only, a man who refuses the call of a charming woman of noble birth for illicit intercourse with her and says: I am afraid of Allah, a man who gives charitable gifts so secretly that his left hand does not know what his right hand has given (i.e. nobody knows how much he has given in charity), and a person who remembers Allah in seclusion and his eyes are then flooded with tears.\"",
      "chain": [
        "30160",
        "20031",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، حدثنا شعبة، قال حدثني أبو التياح، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ اسمعوا وأطيعوا، وإن استعمل حبشي كأن رأسه زبيبة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Listen and obey (your chief) even if an Ethiopian whose head is like a raisin were made your chief.\"",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "وحدثني محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن عمرو، قال سمعت جابر بن عبد الله، قال كان معاذ بن جبل يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤم قومه، فصلى العشاء فقرأ بالبقرة، فانصرف الرجل، فكأن معاذا تناول منه، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ فتان فتان فتان ‏\"‏ ثلاث مرار أو قال ‏\"‏ فاتنا فاتنا فاتن ‏\"‏ وأمره بسورتين من أوسط المفصل‏.‏ قال عمرو لا أحفظهما‏.‏",
      "text_en": " Narrated `Amr:                     Jabir bin `Abdullah said, \"Mu`adh bin Jabal used to pray with the Prophet and then go to lead his people in prayer Once he led the `Isha' prayer and recited Surat \"Al-Baqara.\" Somebody left the prayer and Mu`adh criticized him. The news reached the Prophet and he said to Mu`adh, 'You are putting the people to trial,' and repeated it thrice (or said something similar) and ordered him to recite two medium Suras of Mufassal.\" (`Amr said that he had forgotten the names of those Suras).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11439",
        "34"
      ]
    },
    {
      "hadith_no": "710",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا ابن أبي عدي، عن سعيد، عن قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأدخل في الصلاة فأريد إطالتها، فأسمع بكاء الصبي، فأتجوز مما أعلم من شدة وجد أمه من بكائه ‏\"‏‏.‏ وقال موسى حدثنا أبان، حدثنا قتادة، حدثنا أنس، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet, said, \"Whenever I start the prayer I intend to prolong it, but on hearing the cries of a child, I cut short the prayer because I know that the cries of the child will incite its mother's passions.\"",
      "chain": [
        "30160",
        "20276",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "742",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، قال سمعت قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ أقيموا الركوع والسجود، فوالله إني لأراكم من بعدي  وربما قال من بعد ظهري  إذا ركعتم وسجدتم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Perform the bowing and the prostrations properly. By Allah, I see you from behind me (or from behind my back) when you bow or prostrate.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "757",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا يحيى، عن عبيد الله، قال حدثني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم دخل المسجد، فدخل رجل فصلى فسلم على النبي صلى الله عليه وسلم فرد وقال ‏\"‏ ارجع فصل، فإنك لم تصل ‏\"‏‏.‏ فرجع يصلي كما صلى ثم جاء فسلم على النبي صلى الله عليه وسلم فقال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ثلاثا‏.‏ فقال والذي بعثك بالحق ما أحسن غيره فعلمني‏.‏ فقال ‏\"‏ إذا قمت إلى الصلاة فكبر، ثم اقرأ ما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع حتى تعتدل قائما، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، وافعل ذلك في صلاتك كلها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle entered the mosque and a person followed him. The man prayed and went to the Prophet and greeted him. The Prophet returned the greeting and said to him, \"Go back and pray, for you have not prayed.\" The man went back prayed in the same way as before, returned and greeted the Prophet who said, \"Go back and pray, for you have not prayed.\" This happened thrice. The man said, \"By Him Who sent you with the Truth, I cannot offer the prayer in a better way than this. Please, teach me how to pray.\" The Prophet said, \"When you stand for Prayer say Takbir and then recite from the Holy Qur'an (of what you know by heart) and then bow till you feel at ease. Then raise your head and stand up straight, then prostrate till you feel at ease during your prostration, then sit with calmness till you feel at ease (do not hurry) and do the same in all your prayers.",
      "chain": [
        "30160",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "822",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال سمعت قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ اعتدلوا في السجود، ولا يبسط أحدكم ذراعيه انبساط الكلب ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Be straight in the prostrations and none of you should put his forearms on the ground (in the prostration) like a dog.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "972",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا عبد الوهاب، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان تركز الحربة قدامه يوم الفطر والنحر ثم يصلي‏.‏",
      "text_en": " Narrated Ibn `Umar On the day of `Id-ul-Fitr and `Id-ul-Adha a spear used to be planted in front of:                     the Prophet I (as a Sutra for the prayer) and then he would pray.",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1031",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، وابن أبي عدي، عن سعيد، عن قتادة، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم لا يرفع يديه في شىء من دعائه إلا في الاستسقاء، وإنه يرفع حتى يرى بياض إبطيه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet never raised his hands for any invocation except for that of Istisqa' and he used to raise them so much that the whiteness of his armpits became visible. (Note: It may be that Anas did not see the Prophet raising his hands, but it is narrated that the Prophet used to raise his hands for invocations other than Istisqa. See Hadith No. 807 & 808 and also see Hadith No. 612, Vol. 5).",
      "chain": [
        "30160",
        "20031",
        "20276",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي إسحاق، قال سمعت الأسود، عن عبد الله  رضى الله عنه  قال قرأ النبي صلى الله عليه وسلم النجم بمكة فسجد فيها، وسجد من معه، غير شيخ أخذ كفا من حصى أو تراب فرفعه إلى جبهته وقال يكفيني هذا‏.‏ فرأيته بعد ذلك قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1165",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، حدثنا شعبة، عن محمد بن عبد الرحمن، عن عمته، عمرة عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم ح وحدثنا أحمد بن يونس حدثنا زهير حدثنا يحيى  هو ابن سعيد  عن محمد بن عبد الرحمن عن عمرة عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يخفف الركعتين اللتين قبل صلاة الصبح حتى إني لأقول هل قرأ بأم الكتاب",
      "text_en": " Narrated `Aisha:                     The Prophet (p.b.u.h) used to make the two rak`at before the Fajr prayer so light that I would wonder whether he recited Al-Fatiha (or not).",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11105",
        "53"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت محمد بن المنكدر، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما قتل أبي جعلت أكشف الثوب عن وجهه أبكي، وينهوني عنه والنبي صلى الله عليه وسلم لا ينهاني، فجعلت عمتي فاطمة تبكي، فقال النبي صلى الله عليه وسلم ‏\"‏ تبكين أو لا تبكين، ما زالت الملائكة تظله بأجنحتها حتى رفعتموه ‏\"‏‏.‏ تابعه ابن جريج أخبرني ابن المنكدر سمع جابرا  رضى الله عنه ‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When my father was martyred, I lifted the sheet from his face and wept and the people forbade me to do so but the Prophet did not forbid me. Then my aunt Fatima began weeping and the Prophet said, \"It is all the same whether you weep or not. The angels were shading him continuously with their wings till you shifted him (from the field). \"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1297",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"He who slaps the cheeks, tears the clothes and follows the tradition of the Days of Ignorance is not from us.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "1302",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن ثابت، قال سمعت أنسا  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الصبر عند الصدمة الأولى ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The real patience is at the first stroke of a calamity.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1335",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن طلحة، قال صليت خلف ابن عباس  رضى الله عنهما ‏.‏ حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن طلحة بن عبد الله بن عوف، قال صليت خلف ابن عباس  رضى الله عنهما  على جنازة فقرأ بفاتحة الكتاب قال ليعلموا أنها سنة‏.‏",
      "text_en": " Narrated Talha bin `Abdullah bin `Auf:                     I offered the funeral prayer behind Ibn `Abbas and he recited Al-Fatiha and said, \"You should know that it (i.e. recitation of Al-Fatiha) is the tradition of the Prophet Muhammad.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "11356"
      ]
    },
    {
      "hadith_no": "1585",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، قال حدثني أبو بكر الحنفي، حدثنا أفلح بن حميد، سمعت القاسم بن محمد، عن عائشة  رضى الله عنها  قالت خرجنا مع رسول الله صلى الله عليه وسلم في أشهر الحج، وليالي الحج وحرم الحج، فنزلنا بسرف قالت فخرج إلى أصحابه فقال ‏\"‏ من لم يكن منكم معه هدى فأحب أن يجعلها عمرة فليفعل، ومن كان معه الهدى فلا ‏\"‏‏.‏ قالت فالآخذ بها والتارك لها من أصحابه قالت فأما رسول الله صلى الله عليه وسلم ورجال من أصحابه فكانوا أهل قوة، وكان معهم الهدى، فلم يقدروا على العمرة قالت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك يا هنتاه ‏\"‏‏.‏ قلت سمعت قولك لأصحابك فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضيرك، إنما أنت امرأة من بنات آدم كتب الله عليك ما كتب عليهن، فكوني في حجتك، فعسى الله أن يرزقكيها ‏\"‏‏.‏ قالت فخرجنا في حجته حتى قدمنا منى فطهرت، ثم خرجت من منى فأفضت بالبيت قالت ثم خرجت معه في النفر الآخر حتى نزل المحصب، ونزلنا معه فدعا عبد الرحمن بن أبي بكر فقال ‏\"‏ اخرج بأختك من الحرم، فلتهل بعمرة ثم افرغا، ثم ائتيا ها هنا، فإني أنظركما حتى تأتياني ‏\"‏‏.‏  قالت  فخرجنا حتى إذا فرغت، وفرغت من الطواف ثم جئته بسحر فقال ‏\"‏ هل فرغتم ‏\"‏‏.‏ فقلت نعم‏.‏ فآذن بالرحيل في أصحابه، فارتحل الناس فمر متوجها إلى المدينة‏.‏ ضير من ضار يضير ضيرا، ويقال ضار يضور ضورا وضر يضر ضرا‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     ' Aisha said, \"We set out with Allah's Apostles in the months of Hajj, and (in) the nights of Hajj, and at the time and places of Hajj and in a state of Hajj. We dismounted at Sarif (a village six miles from Mecca). The Prophet then addressed his companions and said, \"Anyone who has not got the Hadi and likes to do Umra instead of Hajj may do so (i.e. Hajj-al-Tamattu`) and anyone who has got the Hadi should not finish the Ihram after performing ' `Umra). (i.e. Hajj-al-Qiran). Aisha added, \"The companions of the Prophet obeyed the above (order) and some of them (i.e. who did not have Hadi) finished their Ihram after Umra.\" Allah's Apostle and some of his companions were resourceful and had the Hadi with them, they could not perform Umra (alone) (but had to perform both Hajj and Umra with one Ihram). Aisha added, \"Allah's Apostle came to me and saw me weeping and said, \"What makes you weep, O Hantah?\" I replied, \"I have heard your conversation with your companions and I cannot perform the Umra.\" He asked, \"What is wrong with you?' I replied, ' I do not offer the prayers (i.e. I have my menses).' He said, ' It will not harm you for you are one of the daughters of Adam, and Allah has written for you (this state) as He has written it for them. Keep on with your intentions for Hajj and Allah may reward you that.\" Aisha further added, \"Then we proceeded for Hajj till we reached Mina and I became clean from my menses. Then I went out from Mina and performed Tawaf round the Ka`ba.\" Aisha added, \"I went along with the Prophet in his final departure (from Hajj) till he dismounted at Al-Muhassab (a valley outside Mecca), and we too, dismounted with him.\" He called ' `Abdur-Rahman bin Abu Bakr and said to him, ' Take your sister outside the sanctuary of Mecca and let her assume Ihram for ' `Umra, and when you had finished ' `Umra, return to this place and I will wait for you both till you both return to me.' \" ' Aisha added, \" So we went out of the sanctuary of Mecca and after finishing from the ' `Umra and the Tawaf we returned to the Prophet at dawn. He said, 'Have you performed the ' `Umra?' We replied in the affirmative. So he announced the departure amongst his companions and the people set out for the journey, and the Prophet: too left for Medina.''",
      "chain": [
        "30160",
        "20254",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1588",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن الحكم، عن علي بن حسين، عن مروان بن الحكم، قال شهدت عثمان وعليا  رضى الله عنهما  وعثمان ينهى عن المتعة وأن يجمع بينهما‏.‏ فلما رأى علي، أهل بهما لبيك بعمرة وحجة قال ما كنت لأدع سنة النبي صلى الله عليه وسلم لقول أحد‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakam:                     I saw `Uthman and `Ali. `Uthman used to forbid people to perform Hajj-at-Tamattu` and Hajj-al- Qiran (Hajj and `Umra together), and when `Ali saw (this act of `Uthman), he assumed Ihram for Hajj and `Umra together saying, \"Lubbaik for `Umra and Hajj,\" and said, \"I will not leave the tradition of the Prophet on the saying of somebody.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11045",
        "858"
      ]
    },
    {
      "hadith_no": "1823",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى الأشعري  رضى الله عنه  قال قدمت على النبي صلى الله عليه وسلم بالبطحاء وهو منيخ فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال النبي صلى الله عليه وسلم قال ‏\"‏ أحسنت‏.‏ طف بالبيت وبالصفا والمروة ثم أحل ‏\"‏‏.‏ فطفت بالبيت، وبالصفا والمروة، ثم أتيت امرأة من قيس، ففلت رأسي، ثم أهللت بالحج‏.‏ فكنت أفتي به، حتى كان في خلافة عمر فقال إن أخذنا بكتاب الله فإنه يأمرنا بالتمام، وإن أخذنا بقول النبي صلى الله عليه وسلم فإنه لم يحل حتى يبلغ الهدى محله‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I came to the Prophet at Al-Batha' while his camel was kneeling down and he asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have you assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. He said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- Marwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between As-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. Later I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of `Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till you finish from Hajj, if you follow the Prophet then he did not finish his Ihram till the Hadi (sacrifice) had reached its place of slaughtering (Hajj-al-Qiran).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي  رضى الله عنه  قال ما عندنا شىء إلا كتاب الله، وهذه الصحيفة عن النبي صلى الله عليه وسلم ‏\"‏ المدينة حرم، ما بين عائر إلى كذا، من أحدث فيها حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏ وقال ‏\"‏ ذمة المسلمين واحدة، فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن تولى قوما بغير إذن مواليه، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     We have nothing except the Book of Allah and this written paper from the Prophet (wherein is written:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever innovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the curse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of worship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured (respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters without their permission incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11322",
        "11405",
        "5"
      ]
    },
    {
      "hadith_no": "1968",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى النبي صلى الله عليه وسلم بين سلمان، وأبي الدرداء، فزار سلمان أبا الدرداء، فرأى أم الدرداء متبذلة‏.‏ فقال لها ما شأنك قالت أخوك أبو الدرداء ليس له حاجة في الدنيا‏.‏ فجاء أبو الدرداء، فصنع له طعاما‏.‏ فقال كل‏.‏ قال فإني صائم‏.‏ قال ما أنا بآكل حتى تأكل‏.‏ قال فأكل‏.‏ فلما كان الليل ذهب أبو الدرداء يقوم‏.‏ قال نم‏.‏ فنام، ثم ذهب يقوم‏.‏ فقال نم‏.‏ فلما كان من آخر الليل قال سلمان قم الآن‏.‏ فصليا، فقال له سلمان إن لربك عليك حقا، ولنفسك عليك حقا، ولأهلك عليك حقا، فأعط كل ذي حق حقه‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له، فقال النبي صلى الله عليه وسلم ‏\"‏ صدق سلمان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     The Prophet made a bond of brotherhood between Salman and Abu Ad-Darda.' Salman paid a visit to Abu Ad-Darda' and found Um Ad-Darda' dressed in shabby clothes and asked her why she was in that state. She replied, \"Your brother Abu Ad-Darda' is not interested in (the luxuries of) this world.\" In the meantime Abu Ad-Darda' came and prepared a meal for Salman. Salman requested Abu Ad- Darda' to eat (with him), but Abu Ad-Darda' said, \"I am fasting.\" Salman said, \"I am not going to eat unless you eat.\" So, Abu Ad-Darda' ate (with Salman). When it was night and (a part of the night passed), Abu Ad-Darda' got up (to offer the night prayer), but Salman told him to sleep and Abu Ad- Darda' slept. After sometime Abu Ad-Darda' again got up but Salman told him to sleep. When it was the last hours of the night, Salman told him to get up then, and both of them offered the prayer. Salman told Abu Ad-Darda', \"Your Lord has a right on you, your soul has a right on you, and your family has a right on you; so you should give the rights of all those who has a right on you.\" Abu Ad- Darda' came to the Prophet and narrated the whole story. The Prophet said, \"Salman has spoken the truth.\"",
      "chain": [
        "30160",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1978",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن مغيرة، قال سمعت مجاهدا، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ صم من الشهر ثلاثة أيام ‏\"‏‏.‏ قال أطيق أكثر من ذلك‏.‏ فما زال حتى قال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ فقال ‏\"‏ اقرإ القرآن في شهر ‏\"‏‏.‏ قال إني أطيق أكثر‏.‏ فما زال حتى قال في ثلاث‏.‏",
      "text_en": " Narrated Mujahid from `Abdullah bin `Amr:                     The Prophet said (to `Abdullah), \"Fast three days a month.\" `Abdullah said, (to the Prophet) \"I am able to fast more than that.\" They kept on arguing on this matter till the Prophet said, \"Fast on alternate days, and recite the whole Qur'an once a month.\" `Abdullah said, \"I can recite more (in a month),\" and the argument went on till the Prophet said, \"Recite the Qur'an once each three days.\" (i.e. you must not recite the whole Qur'an in less than three days).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11072",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "1997",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، سمعت عبد الله بن عيسى، عن الزهري، عن عروة، عن عائشة،‏.‏ وعن سالم، عن ابن عمر  رضى الله عنهم  قالا لم يرخص في أيام التشريق أن يصمن، إلا لمن لم يجد الهدى‏.‏",
      "text_en": " Narrated `Aisha and Ibn `Umar:                     Nobody was allowed to fast on the days of Tashriq except those who could not afford the Hadi (Sacrifice).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11361",
        "11013",
        "10511",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2084",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت لما نزلت آخر البقرة قرأهن النبي صلى الله عليه وسلم عليهم في المسجد، ثم حرم التجارة في الخمر‏.‏",
      "text_en": " Narrated Aisha:                     When the last Verses of Surat al- Baqara were revealed, the Prophet recited them in the mosque and proclaimed the trade of alcohol as illegal.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2091",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية، وكان لي على العاص بن وائل دين، فأتيته أتقاضاه قال لا أعطيك حتى تكفر بمحمد صلى الله عليه وسلم‏.‏ فقلت لا أكفر حتى يميتك الله، ثم تبعث‏.‏ قال دعني حتى أموت وأبعث، فسأوتى مالا وولدا فأقضيك فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا ‏}‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith in the Pre-Islamic period, and 'Asi bin Wail owed me some money, so I went to him to demand it. He said (to me), \"I will not pay you unless you disbelieve Muhammad.\" I said, \"I will not disbelieve till Allah kills you and then you get resurrected.\" He said, \"Leave me till I die and get resurrected, then I will be given wealth and children and I will pay you your debt.\" On that occasion it was revealed to the Prophet: 'Have you seen him who disbelieved in Our signs and says: Surely I will be given wealth and children? Has he known the unseen, or has he taken a covenant from the Beneficent (Allah)? (19.77- 78)",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "2097",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن وهب بن كيسان، عن جابر بن عبد الله  رضى الله عنهما  قال كنت مع النبي صلى الله عليه وسلم في غزاة، فأبطأ بي جملي وأعيا، فأتى على النبي صلى الله عليه وسلم فقال ‏\"‏ جابر ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏ ما شأنك ‏\"‏‏.‏ قلت أبطأ على جملي وأعيا، فتخلفت‏.‏ فنزل يحجنه بمحجنه، ثم قال ‏\"‏ اركب ‏\"‏‏.‏ فركبت، فلقد رأيته أكفه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تزوجت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بكرا أم ثيبا ‏\"‏‏.‏ قلت بل ثيبا‏.‏ قال ‏\"‏ أفلا جارية تلاعبها وتلاعبك ‏\"‏‏.‏ قلت إن لي أخوات، فأحببت أن أتزوج امرأة تجمعهن، وتمشطهن، وتقوم عليهن‏.‏ قال ‏\"‏ أما إنك قادم، فإذا قدمت فالكيس الكيس ‏\"‏‏.‏ ثم قال ‏\"‏ أتبيع جملك ‏\"‏‏.‏ قلت نعم‏.‏ فاشتراه مني بأوقية، ثم قدم رسول الله صلى الله عليه وسلم قبلي، وقدمت بالغداة، فجئنا إلى المسجد، فوجدته على باب المسجد، قال ‏\"‏ الآن قدمت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فدع جملك، فادخل فصل ركعتين ‏\"‏‏.‏ فدخلت فصليت، فأمر بلالا أن يزن له أوقية‏.‏ فوزن لي بلال، فأرجح في الميزان، فانطلقت حتى وليت فقال ‏\"‏ ادع لي جابرا ‏\"‏‏.‏ قلت الآن يرد على الجمل، ولم يكن شىء أبغض إلى منه‏.‏ قال ‏\"‏ خذ جملك ولك ثمنه ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I was with the Prophet in a Ghazwa (Military Expedition) and my camel was slow and exhausted. The Prophet came up to me and said, \"O Jabir.\" I replied, \"Yes?\" He said, \"What is the matter with you?\" I replied, \"My camel is slow and tired, so I am left behind.\" So, he got down and poked the camel with his stick and then ordered me to ride. I rode the camel and it became so fast that I had to hold it from going ahead of Allah's Apostle . He then asked me, have you got married?\" I replied in the affirmative. He asked, \"A virgin or a matron?\" I replied, \"I married a matron.\" The Prophet said, \"Why have you not married a virgin, so that you may play with her and she may play with you?\" Jabir replied, \"I have sisters (young in age) so I liked to marry a matron who could collect them all and comb their hair and look after them.\" The Prophet said, \"You will reach, so when you have arrived (at home), I advise you to associate with your wife (that you may have an intelligent son).\" Then he asked me, \"Would you like to sell your camel?\" I replied in the affirmative and the Prophet purchased it for one Uqiya of gold. Allah's Apostle reached before me and I reached in the morning, and when I went to the mosque, I found him at the door of the mosque. He asked me, \"Have you arrived just now?\" I replied in the affirmative. He said, \"Leave your camel and come into (the mosque) and pray two rak`at.\" I entered and offered the prayer. He told Bilal to weigh and give me one Uqiya of gold. So Bilal weighed for me fairly and I went away. The Prophet sent for me and I thought that he would return to me my camel which I hated more than anything else. But the Prophet said to me, \"Take your camel as well as its price.\"",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن سعيد بن أبي سعيد، عن أبي هريرة  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن التلقي، وأن يبيع حاضر لباد‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet forbade the meeting (of caravans) on the way and the selling of goods by an inhabitant of the town on behalf of a desert dweller.",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن أبيه، قال عبد الرحمن بن عوف  رضى الله عنه  لصهيب اتق الله ولا تدع إلى غير أبيك‏.‏ فقال صهيب ما يسرني أن لي كذا وكذا، وأني قلت ذلك، ولكني سرقت وأنا صبي‏.‏",
      "text_en": " Narrated Sa`d that his father said:                     `Abdur-Rahman bin `Auf said to Suhaib, 'Fear Allah and do not ascribe yourself to somebody other than your father.' Suhaib replied, 'I would not like to say it even if I were given large amounts of money, but I say I was kidnapped in my childhood.' \"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "8"
      ]
    },
    {
      "hadith_no": "2250",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عمرو، عن أبي البختري، سألت ابن عمر  رضى الله عنهما  عن السلم، في النخل فقال نهى النبي صلى الله عليه وسلم عن بيع الثمر حتى يصلح، ونهى عن الورق بالذهب نساء بناجز‏.‏ وسألت ابن عباس فقال نهى النبي صلى الله عليه وسلم عن بيع النخل حتى يأكل أو يؤكل، وحتى يوزن‏.‏ قلت وما يوزن قال رجل عنده حتى يحرز‏.‏",
      "text_en": " Narrated Abu Al-Bakhtari:                     I asked Ibn `Umar about Salam for dates. Ibn `Umar replied, \"The Prophet forbade the sale (the fruits) of date-palms until they were fit for eating and also forbade the sale of silver for gold on credit.\" I also asked Ibn `Abbas about it. Ibn `Abbas replied, \"The Prophet forbade the sale of dates till they were fit for eating, and could be weighed.\" I asked him, \"What is to be weighed (as the dates are on the trees)?\" A man sitting by Ibn `Abbas said, \"It means till they are cut and stored.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11439",
        "11347",
        "18"
      ]
    },
    {
      "hadith_no": "2324",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، سمعت أبا سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل راكب على بقرة التفتت إليه‏.‏ فقالت لم أخلق لهذا، خلقت للحراثة، قال آمنت به أنا وأبو بكر وعمر، وأخذ الذئب شاة فتبعها الراعي، فقال الذئب من لها يوم السبع، يوم لا راعي لها غيري‏.‏ قال آمنت به أنا وأبو بكر وعمر ‏\"‏‏.‏ قال أبو سلمة ما هما يومئذ في القوم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While a man was riding a cow, it turned towards him and said, 'I have not been created for this purpose (i.e. carrying), I have been created for sloughing.\" The Prophet added, \"I, Abu Bakr and `Umar believe in the story.\" The Prophet went on, \"A wolf caught a sheep, and when the shepherd chased it, the wolf said, 'Who will be its guard on the day of wild beasts, when there will be no shepherd for it except me?' \"After narrating it, the Prophet said, \"I, Abu Bakr and `Umar too believe it.\" Abu Salama (a sub-narrator) said, \"Abu Bakr and `Umar were not present then.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن زياد، سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لأذودن رجالا عن حوضي كما تذاد الغريبة من الإبل عن الحوض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"By Him in Whose Hands my soul is, I will drive some people out from my (sacred) Fount on the Day of Resurrection as strange camels are expelled from a private trough.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2420",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار حدثنا محمد بن أبي عدي، عن شعبة، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقد هممت أن آمر بالصلاة فتقام ثم أخالف إلى منازل قوم لا يشهدون الصلاة فأحرق عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No doubt, I intended to order somebody to pronounce the Iqama of the (compulsory congregational) prayer and then I would go to the houses of those who do not attend the prayer and burn their houses over them.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2426",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا آدم، حدثنا شعبة،‏.‏ وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سلمة، سمعت سويد بن غفلة، قال لقيت أبى بن كعب  رضى الله عنه  فقال أخذت صرة مائة دينار فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ عرفها حولا‏\"‏‏.‏ فعرفتها حولها فلم أجد من يعرفها، ثم أتيته فقال ‏\"‏ عرفها حولا ‏\"‏ فعرفتها فلم أجد، ثم أتيته ثلاثا فقال ‏\"‏ احفظ وعاءها وعددها ووكاءها، فإن جاء صاحبها، وإلا فاستمتع بها ‏\"‏‏.‏ فاستمتعت فلقيته بعد بمكة فقال لا أدري ثلاثة أحوال أو حولا واحدا‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     I found a purse containing one hundred Diners. So I went to the Prophet (and informed him about it), he said, \"Make public announcement about it for one year\" I did so, but nobody turned up to claim it, so I again went to the Prophet who said, \"Make public announcement for another year.\" I did, but none turned up to claim it. I went to him for the third time and he said, \"Keep the container and the string which is used for its tying and count the money it contains and if its owner comes, give it to him; otherwise, utilize it.\" The sub-narrator Salama said, \"I met him (Suwaid, another sub-narrator) in Mecca and he said, 'I don't know whether Ubai made the announcement for three years or just one year.' \"",
      "chain": [
        "20404",
        "30160",
        "20278",
        "20020",
        "237",
        "11174"
      ]
    },
    {
      "hadith_no": "2568",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن أبي حازم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لو دعيت إلى ذراع أو كراع لأجبت، ولو أهدي إلى ذراع أو كراع لقبلت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I shall accept the invitation even if I were invited to a meal of a sheep's trotter, and I shall accept the gift even if it were an arm or a trotter of a sheep.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة، عن أنس بن مالك  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم بلحم فقيل تصدق على بريرة قال ‏\"‏ هو لها صدقة، ولنا هدية ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some meat was brought to the Prophet and it was said that the meat had been given in charity to Buraira. He said, \"It was Sadaqa for Buraira but a gift for us.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2578",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، قال سمعته منه، عن القاسم، عن عائشة  رضى الله عنها  أنها أرادت أن تشتري بريرة، وأنهم اشترطوا ولاءها، فذكر للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اشتريها فأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ وأهدي لها لحم، فقيل للنبي صلى الله عليه وسلم هذا تصدق على بريرة‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏‏.‏ وخيرت‏.‏ قال عبد الرحمن زوجها حر أو عبد قال شعبة سألت عبد الرحمن عن زوجها‏.‏ قال لا أدري أحر أم عبد",
      "text_en": " Narrated `Aisha:                     I intended to buy Buraira but her masters stipulated that her Wala should be for them. When the Prophet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" Once Buraira was given some meat, and the Prophet asked, \"What is this?\" I said, \"It has been given to Buraira in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Buraira was given the option (to stay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her husband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether her husband was a slave or a free man. He replied that he did not know whether he was a slave or a free man.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2595",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن طلحة بن عبد الله  رجل من بني تيم بن مرة  عن عائشة  رضى الله عنها  قالت قلت يا رسول الله، إن لي جارين فإلى أيهما أهدي قال ‏\"‏ إلى أقربهما منك بابا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     I said, \"O Allah's Apostle! I have two neighbors; which of them should I give a gift to?\" The Prophet said, \"(Give) to the one whose door is nearer to you.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "53"
      ]
    },
    {
      "hadith_no": "2604",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محارب، سمعت جابر بن عبد الله  رضى الله عنهما  يقول بعت من النبي صلى الله عليه وسلم بعيرا في سفر، فلما أتينا المدينة قال ‏\"‏ ائت المسجد فصل ركعتين ‏\"‏‏.‏ فوزن  قال شعبة أراه فوزن لي فأرجح، فما زال منها شىء حتى أصابها أهل الشأم يوم الحرة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I sold a camel to the Prophet on one of the journeys. When we reached Medina, he ordered me to go to the Mosque and offer two rak`at. Then he weighed for me (the price of the camel in gold) and gave an extra amount over it. A part of it remained with me till it was taken by the army of Sham on the day of Harra.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "2634",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا أيوب، عن عمرو، عن طاوس، قال حدثني أعلمهم، بذاك  يعني ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم خرج إلى أرض تهتز زرعا فقال ‏\"‏ لمن هذه ‏\"‏‏.‏ فقالوا اكتراها فلان‏.‏ فقال ‏\"‏ أما إنه لو منحها إياه كان خيرا له من أن يأخذ عليها أجرا معلوما ‏\"‏‏.‏",
      "text_en": " Narrated Tawus:                     That he was told by the most learned one amongst them (i.e. Ibn `Abbas) that the Prophet went towards some land which was flourishing with vegetation and asked to whom it belonged. He was told that such and such a person took it on rent. The Prophet said, \"It would have been better (for the owner) if he had given it to him gratis rather than charging him a fixed rent.",
      "chain": [
        "30160",
        "20259",
        "11015",
        "11081",
        "11053"
      ]
    },
    {
      "hadith_no": "2671",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن هشام، حدثنا عكرمة، عن ابن عباس  رضى الله عنهما  أن هلال بن أمية، قذف امرأته عند النبي صلى الله عليه وسلم بشريك بن سحماء، فقال النبي صلى الله عليه وسلم ‏\"‏ البينة أو حد في ظهرك ‏\"‏‏.‏ فقال يا رسول الله إذا رأى أحدنا على امرأته رجلا ينطلق يلتمس البينة فجعل يقول ‏\"‏ البينة وإلا حد في ظهرك ‏\"‏‏.‏ فذكر حديث اللعان‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Hilal bin Umaiya accused his wife before the Prophet of committing illegal sexual intercourse with Sharik bin Sahma.' The Prophet said, \"Produce a proof, or else you would get the legal punishment (by being lashed) on your back.\" Hilal said, \"O Allah's Apostle! If anyone of us saw another man over his wife, would he go to search for a proof.\" The Prophet went on saying, \"Produce a proof or else you would get the legal punishment (by being lashed) on your back.\" The Prophet then mentioned the narration of Lian (as in the Holy Book). (Surat-al-Nur: 24)",
      "chain": [
        "30160",
        "20276",
        "20295",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 1414
}