{
  "id": "30173",
  "name": "Muhammad bin al-Minhal al-Darir محمد بن المنهال الضرير",
  "full_name": "Muhammad bin al-Minhal al-Darir محمد بن المنهال الضرير",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "231",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Basri",
      "Hafiz",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20281",
      "name": "Muhammad bin 'Abdur Rahman al-Tafawi محمد بن عبد الرحمن الطفاوي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20530",
      "name": "Umayya bin Khalid bin al-'Aswad أمية بن خالد بن الأسود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20254",
      "name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38665",
      "name": "Nsr bin Muhammad bin Sulaiman نصر بن محمد بن سليمان بن أبي ضمرة",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5150",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد العسقلاني، عن أبيه، عن ابن عمر، قال ذكروا الشؤم عند النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان الشؤم في شىء ففي الدار والمرأة والفرس ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Evil omen was mentioned before the Prophet: The Prophet said, \"If there is evil omen in anything, it is in the house, the woman and the horse.\"",
      "chain": [
        "30173",
        "20304",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "5953",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد بن زيد، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ خالفوا المشركين، وفروا اللحى، وأحفوا الشوارب ‏\"‏‏.‏ وكان ابن عمر إذا حج أو اعتمر قبض على لحيته، فما فضل أخذه‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, The Prophet said, 'Do the opposite of what the pagans do. Keep the beards and cut the moustaches short.' Whenever Ibn `Umar performed the Hajj or `Umra, he used to hold his beard with his hand and cut whatever moustaches. Ibn `Umar used to cut his moustache so short that the whiteness of his skin (above the upper lip) was visible, and he used to cut (the hair) between his moustaches and his beard.",
      "chain": [
        "30173",
        "20304",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6083",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد، عن أبيه، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ‏\"‏‏.‏",
      "text_en": " Narrates Ibn `Umar:                     Allah' Apostle said, Gabriel kept on recommending me about treating the neighbors in a kind and polite manner, so much so that I thought that he would order (me) to make them (my) heirs.\"",
      "chain": [
        "30173",
        "20304",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "344",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن منهال الضرير، وأمية بن بسطام العيشي، - واللفظ لأمية - قالا حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن العلاء، عن أبيه، عن أبي هريرة، قال لما نزلت على رسول الله صلى الله عليه وسلم ‏{‏ لله ما في السموات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شىء قدير‏}‏ قال فاشتد ذلك على أصحاب رسول الله صلى الله عليه وسلم فأتوا رسول الله صلى الله عليه وسلم ثم بركوا على الركب فقالوا أى رسول الله كلفنا من الأعمال ما نطيق الصلاة والصيام والجهاد والصدقة وقد أنزلت عليك هذه الآية ولا نطيقها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أتريدون أن تقولوا كما قال أهل الكتابين من قبلكم سمعنا وعصينا بل قولوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏\"‏ ‏.‏ قالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏.‏ فلما اقترأها القوم ذلت بها ألسنتهم فأنزل الله في إثرها ‏{‏ آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير‏}‏ فلما فعلوا ذلك نسخها الله تعالى فأنزل الله عز وجل ‏{‏ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا‏}‏ قال نعم ‏{‏ ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا‏}‏ قال نعم ‏{‏ ربنا ولا تحملنا ما لا طاقة لنا به‏}‏ قال نعم ‏{‏ واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين‏}‏ قال نعم ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that when it was revealed to the Messenger of Allah (may peace be upon him):                      To Allah belongs whatever is in the heavens and whatever is in the earth and whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it. Then He forgives whom He pleases and chastises whom He Pleases; and Allah is over everything Potent\" (ii. 284). the Companions of the Messenger of Allah (may peace be upon him) felt it hard and severe and they came to the Messenger of Allah (may peace be upon him) and sat down on their knees and said: Messenger of Allah, we were assigned some duties which were within our power to perform, such as prayer, fasting, struggling (in the cause of Allah), charity. Then this (the above-mentioned) verse was revealed unto you and it is beyond our power to live up to it. The Messenger of Allah (may peace be upon him) said: Do you intend to say what the people of two books (Jews and Christians) said before you:\" We hear and disobey\"? You should rather say:\" We hear and we obey, (we seek) Thy forgiveness, our Lord! and unto Thee is the return.\" And they said:\" We hear and we obey, (we seek) Thy forgiveness, Our Lord! and unto Thee is the return.\" When the people recited it and it smoothly flowed on their tongues, then Allah revealed immediately afterwards:\" The Apostle believes in that which is sent down unto him from his Lord, and so do the believers. Each one believes in Allah and His Angels and His Books and His Apostles, saying: We differentiate not between any of His Apostles and they say: We hearken and we obey: (we seek) Thy forgiveness, our Lord! and unto Thee is the return\" (ii. 285). When they did that, Allah abrogated this (verse) and the Great, Majestic Allah revealed:\" Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, punish us not if we forget or make a mistake.\" (The Prophet said: ) Yes, our Lord! do not lay on us a burden as Thou didst lay on those before us. (The Prophet said: ) Yes, our Lord, impose not on us (burdens) which we have not the strength to bear (The Prophet said: ) Yes, and pardon us and grant us protection! and have mercy on us. Thou art our Patron, so grant us victory over the disbelieving people\" (ii. 286). He (the Lord) said: Yes.",
      "chain": [
        "30173",
        "30124",
        "20304",
        "11586",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، وهشام، صاحب الدستوائي عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "470",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأدخل الصلاة أريد إطالتها فأسمع بكاء الصبي فأخفف من شدة وجد أمه به ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported the Messenger of Allah (may peace be upon him) having said:                      When I begin the prayer I Intend to make it long, but I hear a boy cry. ing; I then shorten it because of his mother's feelings.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1610",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، ح وحدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثنا أبي جميعا، عن قتادة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Qatada with the same chain of transmitters.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "30170",
        "20287"
      ]
    },
    {
      "hadith_no": "3240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن المنهال الضرير، حدثنا يزيد بن زريع، حدثنا حميد الطويل، عن بكر بن عبد الله المزني، قال كنت جالسا مع ابن عباس عند الكعبة فأتاه أعرابي فقال ما لي أرى بني عمكم يسقون العسل واللبن وأنتم تسقون النبيذ أمن حاجة بكم أم من بخل فقال ابن عباس الحمد لله ما بنا من حاجة ولا بخل قدم النبي صلى الله عليه وسلم على راحلته وخلفه أسامة فاستسقى فأتيناه بإناء من نبيذ فشرب وسقى فضله أسامة وقال ‏\"‏ أحسنتم وأجملتم كذا فاصنعوا ‏\"‏ ‏.‏ فلا نريد تغيير ما أمر به رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Bakr b. 'Abdullah al-Muzani said:                      While I was sitting along with Ibn 'Abbas (Allah be pleased with him) near the Ka'ba, there came a bedouin to him and said: What is the matter that I see that the progeny of your uncle supply honey and milk (as drink to the travellers), whereas you supply al-nabidh (water sweetened with dates)? Is it due to your poverty or due to your close-fistedness? Thereupon Ibn 'Abbas said: Allah be praised, it is neither due to poverty nor due to close-fistedness (but due to the fact) that Allah's Apostle (may peace be upon him) came here riding his she-came, and there was sitting behind him Usama. He asked for water, and we gave him a cup full of nabidh and he drank it, and gave the remaining (part) to Usama; and he (the Holy Prophet) said: You have done Food, You have done well. So continue doing like it So we do not like to change what Allah's Messenger (may peace be upon him) had commanded us to do.",
      "chain": [
        "30173",
        "20304",
        "11279",
        "11267"
      ]
    },
    {
      "hadith_no": "4427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن منهال الضرير، وأحمد بن عبدة، قالا حدثنا يزيد بن زريع، حدثنا هشام بن حسان، عن محمد بن سيرين، عن عمران بن حصين، عن النبي صلى الله عليه وسلم بمثل حديث ابن علية وحماد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Imran b. Husain through another chain of narrators.",
      "chain": [
        "30173",
        "30423",
        "20304",
        "11311",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "4555",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سفيان الثوري، عن أبي حصين، عن عمير بن سعيد، عن علي، قال ما كنت أقيم على أحد حدا فيموت فيه فأجد منه في نفسي إلا صاحب الخمر لأنه إن مات وديته لأن رسول الله صلى الله عليه وسلم لم يسنه ‏.‏",
      "text_en": " Ali reported:                      If I impose Hadd on anyone, and he (in course of punish ment) dies, I would not mind except in case of a drunkard. If he dies. I would pay indemnity for him because the Messenger of Allah (may peace be upon him) has laid down no rule for it.",
      "chain": [
        "30173",
        "20304",
        "20012",
        "11371",
        "11646",
        "5"
      ]
    },
    {
      "hadith_no": "5133",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا هشام بن حسان، عن محمد بن سيرين، عن أنس بن مالك، قال لما كان يوم خيبر جاء جاء فقال يا رسول الله أكلت الحمر ‏.‏ ثم جاء آخر فقال يا رسول الله أفنيت الحمر فأمر رسول الله صلى الله عليه وسلم أبا طلحة فنادى إن الله ورسوله ينهيانكم عن لحوم الحمر فإنها رجس أو نجس ‏.‏ قال فأكفئت القدور بما فيها ‏.‏",
      "text_en": " Anas b. Malik reported:                      When it was the Day of Khaibar a visitor came and said: Messenger of Allah, the asses have been eaten. Then another came and said: Messenger of Allah, the asses are being destroyed. Then Allah's Messenger (may peace be upon him) commanded Abu Talha to make an announcement that Allah and His Messenger have prohibited you (from eating) of the flesh of (domestic) asses, for these are loathsome or impure. He (the narrator) said: The earthein pots were turned over along with what was in them.",
      "chain": [
        "30173",
        "20304",
        "11311",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "6918",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم نحو حديثهم ‏.‏",
      "text_en": " Abu Huraira reported a hadith like this through another chain of transmitters.",
      "chain": [
        "30173",
        "20304",
        "11311",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "7396",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الميت إذا وضع في قبره إنه ليسمع خفق نعالهم إذا انصرفوا ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      When the dead body. is placed in the grave, he listens to the sound of the shoes (as his friends and relatives return after burying him).",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن عمار بن ياسر، قال سألت النبي صلى الله عليه وسلم عن التيمم فأمرني ضربة واحدة للوجه والكفين ‏.‏",
      "text_en": " 'Ammar b. Yasir said:                      I asked the Prophet (ﷺ) about tayammum. He commanded me to strike only one stroke (i.e. the strike the ground) for (wiping) the face and the hands.",
      "chain": [
        "30173",
        "20304",
        "11168",
        "11019",
        "10799",
        "11346",
        "4046",
        "25"
      ]
    },
    {
      "hadith_no": "1394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المنهال، أخبرنا يزيد بن زريع، أخبرنا سعيد، عن قتادة، عن أبي العلاء، يزيد بن عبد الله بن الشخير عن عبد الله، - يعني ابن عمرو - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يفقه من قرأ القرآن في أقل من ثلاث ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: He who recites the Qur'an in a period less than three days does not understand it.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "11318",
        "29"
      ]
    },
    {
      "hadith_no": "1749",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، حدثنا محمد بن إسحاق، ح وحدثنا محمد بن المنهال، حدثنا يزيد بن زريع، عن ابن إسحاق، - المعنى - قال قال عبد الله - يعني ابن أبي نجيح - حدثني مجاهد عن ابن عباس أن رسول الله صلى الله عليه وسلم أهدى عام الحديبية في هدايا رسول الله صلى الله عليه وسلم جملا كان لأبي جهل في رأسه برة فضة ‏.‏ قال ابن منهال برة من ذهب زاد النفيلي يغيظ بذلك المشركين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     In the year of al-Hudaybiyyah, the Messenger of Allah (ﷺ) included among his sacrificial animals a camel with a silver nose-ring (Ibn Minhal's version has gold) which had belonged to AbuJahl (the version of an-Nufayli added) \"thereby enraging the polytheists\".",
      "chain": [
        "30352",
        "20672",
        "11107",
        "30173",
        "20304",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "2447",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن عبد الرحمن بن مسلمة، عن عمه، أن أسلم، أتت النبي صلى الله عليه وسلم فقال ‏\"‏ صمتم يومكم هذا ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فأتموا بقية يومكم واقضوه ‏\"‏ ‏.‏ قال أبو داود يعني يوم عاشوراء ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Maslamah:                     AbdurRahman reported on the authority of his uncle that the people of the tribe Aslam came to the Prophet (ﷺ). He said (to them): Did you fast on this day? They replied: No. He said: Complete the rest of your day, and make atonement for it.",
      "chain": [
        "30173",
        "20304",
        "11168",
        "11019"
      ]
    },
    {
      "hadith_no": "2857",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المنهال الضرير، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن أعرابيا، يقال له أبو ثعلبة قال يا رسول الله إن لي كلابا مكلبة فأفتني في صيدها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان لك كلاب مكلبة فكل مما أمسكن عليك ‏\"‏ ‏.‏ قال ذكيا أو غير ذكي قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن أكل منه قال ‏\"‏ وإن أكل منه ‏\"‏ ‏.‏ فقال يا رسول الله أفتني في قوسي ‏.‏ قال ‏\"‏ كل ما ردت عليك قوسك ‏\"‏ ‏.‏ قال ‏\"‏ ذكيا أو غير ذكي ‏\"‏ ‏.‏ قال وإن تغيب عني قال ‏\"‏ وإن تغيب عنك ما لم يصل أو تجد فيه أثرا غير سهمك ‏\"‏ ‏.‏ قال أفتني في آنية المجوس إن اضطررنا إليها ‏.‏ قال ‏\"‏ اغسلها وكل فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     There was a bedouin called AbuTha'labah. He said: Messenger of Allah, I have trained dogs, so tell me your opinion about (eating) the animal they hunt. The Prophet (ﷺ) said: If you have trained dogs, then eat what they catch for you. He asked: Whether it is slaughtered or not? He replied: Yes. He asked: Does it apply even if it eats any of it? He replied: Even if it eats any of it. He again asked: Messenger of Allah, tell me your opinion about my bow (i.e. the game hunted by arrow). He said: Eat what your bow returns to you, whether it is slaughtered or not. He asked: If it goes out of my sight? He replied: Even if it goes out of your sight, provided it has no stench, or you find a mark on it other than the mark of your arrow. He asked: Tell me about the use of the vessels of the Magians when we are forced to use them. He replied: Wash them and eat in them.",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3272",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن سعيد بن المسيب، ‏:‏ أن أخوين، من الأنصار كان بينهما ميراث فسأل أحدهما صاحبه القسمة فقال ‏:‏ إن عدت تسألني عن القسمة فكل مال لي في رتاج الكعبة ‏.‏ فقال له عمر ‏:‏ إن الكعبة غنية عن مالك، كفر عن يمينك وكلم أخاك سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ لا يمين عليك، ولا نذر في معصية الرب وفي قطيعة الرحم وفيما لا تملك ‏\"‏ ‏.‏",
      "text_en": " Sa'id ibn al-Musayyab said:                      There were two brothers among the Ansar who shared an inheritance. When one of them asked the other for the portion due to him, he replied: If you ask me again for the portion due to you, all my property will be devoted to the decoration of the Ka'bah. Umar said to him: The Ka'bah does not need your property. Make atonement for your oath and speak to your brother. I heard the Messenger of Allah (ﷺ) say: An oath or vow to disobey the Lord, or to break ties of relationship or about something over which one has no control is not binding on you.",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "11002"
      ]
    },
    {
      "hadith_no": "3530",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن لي مالا وولدا وإن والدي يجتاح مالي ‏.‏ قال ‏\"‏ أنت ومالك لوالدك إن أولادكم من أطيب كسبكم فكلوا من كسب أولادكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah, I have property and children, and my father finishes my property. He replied; You and your property belong to your father; your children come from the pleasantest of what you earn; so enjoy from the earning of your children.",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3613",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا ابن أبي عروبة، عن قتادة، عن سعيد بن أبي بردة، عن أبيه، عن جده أبي موسى الأشعري، أن رجلين، ادعيا بعيرا أو دابة إلى النبي صلى الله عليه وسلم ليست لواحد منهما بينة فجعله النبي صلى الله عليه وسلم بينهما ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     Two men claimed a camel or an animal and brought the case to the Holy Prophet (ﷺ). But as neither of them produced any proof, the Holy Prophet (ﷺ) declared that they should share it equally.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3616",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا ابن أبي عروبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رجلين، اختصما في متاع إلى النبي صلى الله عليه وسلم ليس لواحد منهما بينة فقال النبي صلى الله عليه وسلم ‏\"‏ استهما على اليمين ما كان أحبا ذلك أو كرها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Two men disputed about some property and brought the case to the Holy Prophet (ﷺ), but neither of them could produce any proof. So the Holy Prophet (ﷺ) said: Cast lots about the oath whatever it may be, whether they like it or dislike it.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "5091",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد، - يعني ابن زريع - حدثنا روح بن القاسم، عن سهيل، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يصبح سبحان الله العظيم وبحمده مائة مرة وإذا أمسى كذلك لم يواف أحد من الخلائق بمثل ما وافى ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying:                      if anyone says a hundred times in the morning: “Glory be to Allah, the Sublime, and I begin with praise of him”, and says likewise in the evening, no one from the creatures will bring anything like the one which he will bring.",
      "chain": [
        "30173",
        "20304",
        "11586",
        "11428",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 23
}