{
  "id": "30171",
  "name": "Muhammad bin Mhbwb al-Binany محمد بن محبوب البناني",
  "full_name": "Muhammad bin Mhbwb al-Binany محمد بن محبوب البناني",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "223",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24154",
      "name": "Srar bin Mjshr bin Qbys'h سرار بن مجشر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30535",
      "name": "Ahmed bin Yusuf bin Khalid أحمد بن يوسف بن خالد حمدان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34175",
      "name": "'Isa bin Shadhan al-Qtan عيسى بن شاذان القطان البصري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "265",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن محبوب، قال حدثنا عبد الواحد، قال حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، مولى ابن عباس عن ابن عباس، قال قالت ميمونة وضعت لرسول الله صلى الله عليه وسلم ماء يغتسل به، فأفرغ على يديه، فغسلهما مرتين مرتين أو ثلاثا، ثم أفرغ بيمينه على شماله، فغسل مذاكيره، ثم دلك يده بالأرض، ثم مضمض واستنشق، ثم غسل وجهه ويديه ثم غسل رأسه ثلاثا، ثم أفرغ على جسده، ثم تنحى من مقامه فغسل قدميه‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of Allah's Apostle and he poured water over his hands and washed them twice or thrice; then he poured water with his right hand over his left and washed his private parts (with his left hand). He rubbed his hand over the earth and rinsed his mouth and washed his nose by putting water in it and blowing it out. After that he washed his face, both fore arms and head thrice and then poured water over his body. He withdrew from that place and washed his feet.",
      "chain": [
        "30171",
        "20256",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2214",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله  رضى الله عنهما  قال قضى النبي صلى الله عليه وسلم بالشفعة في كل مال لم يقسم، فإذا وقعت الحدود وصرفت الطرق فلا شفعة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle decided the validity of preemption in every joint undivided property, but if the boundaries were well marked or the ways and streets were fixed, then there was no pre-emption.",
      "chain": [
        "30171",
        "20256",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2252",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن محبوب، حدثنا عبد الواحد، حدثنا الأعمش، قال تذاكرنا عند إبراهيم الرهن في السلف فقال حدثني الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل معلوم، وارتهن منه درعا من حديد‏.‏",
      "text_en": " Narrated Al-A`mash:                     We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha said, 'The Prophet bought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and he mortgaged his iron armor to him.\"",
      "chain": [
        "30171",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2600",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال هلكت‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال وقعت بأهلي في رمضان‏.‏ قال ‏\"‏ تجد رقبة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فهل تستطيع أن تصوم شهرين متتابعين ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فتستطيع أن تطعم ستين مسكينا ‏\"‏‏.‏ قال لا‏.‏ قال فجاء رجل من الأنصار بعرق  والعرق المكتل  فيه تمر فقال ‏\"‏ اذهب بهذا فتصدق به ‏\"‏‏.‏ قال على أحوج منا يا رسول الله والذي بعثك بالحق ما بين لابتيها أهل بيت أحوج منا‏.‏ قال ‏\"‏ اذهب فأطعمه أهلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"I am ruined.\" The Prophet asked, \"What do you mean?\" He said, \"I had a sexual intercourse with my wife during Ramadan (while fasting).\" The Prophet asked him, \"Can you manumit a slave?\" He replied in the negative. He then asked him, \"Can you fast for two successive months continuously\" He replied in the negative. The Prophet then asked him, \"Can you feed sixty poor persons?\" He replied in the negative. In the meantime an Ansari came with a basket full of dates. The Prophet said to the man, \"Take it and give it in charity (as an expiation of your sin).\" The man said \"Should I give it to some people who are poorer than we O Allah's Apostle? By Him Who has sent you with the Truth, there is no family between Medina's two mountains poorer than we.\" Allah's Apostle told him to take it and provide his family with it.\"",
      "chain": [
        "30171",
        "20256",
        "20115",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "3358",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال لم يكذب إبراهيم  عليه السلام  إلا ثلاث كذبات ثنتين منهن في ذات الله عز وجل، قوله ‏{‏إني سقيم ‏}‏ وقوله ‏{‏بل فعله كبيرهم هذا‏}‏، وقال بينا هو ذات يوم وسارة إذ أتى على جبار من الجبابرة فقيل له إن ها هنا رجلا معه امرأة من أحسن الناس، فأرسل إليه، فسأله عنها‏.‏ فقال من هذه قال أختي، فأتى سارة قال يا سارة، ليس على وجه الأرض مؤمن غيري وغيرك، وإن هذا سألني، فأخبرته أنك أختي فلا تكذبيني‏.‏ فأرسل إليها، فلما دخلت عليه ذهب يتناولها بيده، فأخذ فقال ادعي الله لي ولا أضرك‏.‏ فدعت الله فأطلق، ثم تناولها الثانية، فأخذ مثلها أو أشد فقال ادعي الله لي ولا أضرك‏.‏ فدعت فأطلق‏.‏ فدعا بعض حجبته فقال إنكم لم تأتوني بإنسان، إنما أتيتموني بشيطان‏.‏ فأخدمها هاجر فأتته، وهو قائم يصلي، فأومأ بيده مهيا قالت رد الله كيد الكافر  أو الفاجر  في نحره، وأخدم هاجر‏.‏ قال أبو هريرة تلك أمكم يا بني ماء السماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     Abraham did not tell a lie except on three occasion. Twice for the Sake of Allah when he said, \"I am sick,\" and he said, \"(I have not done this but) the big idol has done it.\" The (third was) that while Abraham and Sarah (his wife) were going (on a journey) they passed by (the territory of) a tyrant. Someone said to the tyrant, \"This man (i.e. Abraham) is accompanied by a very charming lady.\" So, he sent for Abraham and asked him about Sarah saying, \"Who is this lady?\" Abraham said, \"She is my sister.\" Abraham went to Sarah and said, \"O Sarah! There are no believers on the surface of the earth except you and I. This man asked me about you and I have told him that you are my sister, so don't contradict my statement.\" The tyrant then called Sarah and when she went to him, he tried to take hold of her with his hand, but (his hand got stiff and) he was confounded. He asked Sarah. \"Pray to Allah for me, and I shall not harm you.\" So Sarah asked Allah to cure him and he got cured. He tried to take hold of her for the second time, but (his hand got as stiff as or stiffer than before and) was more confounded. He again requested Sarah, \"Pray to Allah for me, and I will not harm you.\" Sarah asked Allah again and he became alright. He then called one of his guards (who had brought her) and said, \"You have not brought me a human being but have brought me a devil.\" The tyrant then gave Hajar as a girl-servant to Sarah. Sarah came back (to Abraham) while he was praying. Abraham, gesturing with his hand, asked, \"What has happened?\" She replied, \"Allah has spoiled the evil plot of the infidel (or immoral person) and gave me Hajar for service.\" (Abu Huraira then addressed his listeners saying, \"That (Hajar) was your mother, O Bani Ma-is-Sama (i.e. the Arabs, the descendants of Ishmael, Hajar's son).",
      "chain": [
        "30171",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "6160",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا أبو عوانة، عن قتادة، عن أنس،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس  رضى الله عنه أن رجلا، جاء إلى النبي صلى الله عليه وسلم يوم الجمعة وهو يخطب بالمدينة فقال قحط المطر فاستسق ربك، فنظر إلى السماء وما نرى من سحاب، فاستسقى فنشأ السحاب بعضه إلى بعض، ثم مطروا حتى سالت مثاعب المدينة، فما زالت إلى الجمعة المقبلة ما تقلع، ثم قام ذلك الرجل أو غيره والنبي صلى الله عليه وسلم يخطب فقال غرقنا فادع ربك يحبسها عنا‏.‏ فضحك ثم قال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏ فجعل السحاب يتصدع عن المدينة يمينا وشمالا، يمطر ما حوالينا، ولا يمطر منها شىء، يريهم الله كرامة نبيه صلى الله عليه وسلم وإجابة دعوته‏.‏",
      "text_en": " Narrated Anas:                     A man came to the Prophet on a Friday while he (the Prophet) was delivering a sermon at Medina, and said, \"There is lack of rain, so please invoke your Lord to bless us with the rain.\" The Prophet looked at the sky when no cloud could be detected. Then he invoked Allah for rain. Clouds started gathering together and it rained till the Medina valleys started flowing with water. It continued raining till the next Friday. Then that man (or some other man) stood up while the Prophet was delivering the Friday sermon, and said, \"We are drowned; Please invoke your Lord to withhold it (rain) from us\" The Prophet smiled and said twice or thrice, \"O Allah! Please let it rain round about us and not upon us.\" The clouds started dispersing over Medina to the right and to the left, and it rained round about Medina and not upon Medina. Allah showed them (the people) the miracle of His Prophet and His response to his invocation.",
      "chain": [
        "30171",
        "20469",
        "11019",
        "30132",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6416",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا أبو عوانة، عن قتادة، عن أنس  رضى الله عنه  قال بينا النبي صلى الله عليه وسلم يخطب يوم الجمعة فقام رجل فقال يا رسول الله ادع الله أن يسقينا‏.‏ فتغيمت السماء ومطرنا، حتى ما كاد الرجل يصل إلى منزله، فلم تزل تمطر إلى الجمعة المقبلة، فقام ذلك الرجل أو غيره فقال ادع الله أن يصرفه عنا، فقد غرقنا‏.‏ فقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ فجعل السحاب يتقطع حول المدينة، ولا يمطر أهل المدينة‏.‏",
      "text_en": " Narrated Anas:                     While the Prophet was delivering a sermon on a Friday, a man stood up and said, \"O Allah's Apostle! Invoke Allah to bless us with rain.\" (The Prophet invoked Allah for rain.) So, the sky became overcast and it started raining till one could hardly reach one's home. It kept on raining till the next Friday when the same man or another man got up and said (to the Prophet), \"Invoke Allah to withhold the rain from us, for we have been drowned (with heavy rain ).\" The Prophet said, \"O Allah! Let it rain around us and not on us.\" Then the clouds started dispersing around Medina and rain ceased to fall on the people of Medina.",
      "chain": [
        "30171",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6795",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال هلكت‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال وقعت بأهلي في رمضان‏.‏ قال ‏\"‏ تجد رقبة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ هل تستطيع أن تصوم شهرين متتابعين ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فتستطيع أن تطعم ستين مسكينا ‏\"‏‏.‏ قال لا‏.‏ قال فجاء رجل من الأنصار بعرق  والعرق المكتل فيه تمر  فقال ‏\"‏ اذهب بهذا، فتصدق به ‏\"‏‏.‏ قال على أحوج منا يا رسول الله والذي بعثك بالحق ما بين لابتيها أهل بيت أحوج منا‏.‏ ثم قال ‏\"‏ اذهب، فأطعمه أهلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"I am ruined!\" The Prophet said to him, \"What is the matter?\" He said, \"I have done a sexual relation with my wife (while fasting) in Ramadan.\" The Prophet said to him?\" \"Can you afford to manumit a slave?\" He said, \"No.\" The Prophet said, \"Can you fast for two successive months?\" He said, \"No.\" The Prophet said, \"Can you feed sixty poor persons?\" He said, \"No.\" Then an Ansari man came with an Irq (a big basket full of dates). The Prophet said (to the man), \"Take this (basket) and give it in charity.\" That man said, \"To poorer people than we, O Allah's Apostle? By Him Who has sent you with the Truth! There is no house in between the two mountains (of the city of Medina) poorer than we.\" So the Prophet said (to him), \"Go and feed it to your family.\"",
      "chain": [
        "30171",
        "20256",
        "20115",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا حفص بن غياث، عن عبد الرحمن بن إسحاق، عن زياد بن زيد، عن أبي جحيفة، أن عليا، - رضى الله عنه - قال السنة وضع الكف على الكف في الصلاة تحت السرة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     AbuJuhayfah said: Ali said that it is a sunnah to place one hand on the other in prayer below the navel.",
      "chain": [
        "30171",
        "20317",
        "11876",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "1116",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن محبوب، وإسماعيل بن إبراهيم، - المعنى - قالا حدثنا حفص بن غياث، عن الأعمش، عن أبي سفيان، عن جابر، وعن أبي صالح، عن أبي هريرة، قالا جاء سليك الغطفاني ورسول الله صلى الله عليه وسلم يخطب فقال له ‏\"‏ أصليت شيئا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ صل ركعتين تجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " Jabir and Abu Salih reported on the authority of Abu Hurairah:                      Sulaik al-Ghatafani came (to the mosque) while the Messenger of Allah (ﷺ) was giving the (Friday) sermon. He asked him: Did you pray something ? He said: No. He said: Offer two rak'ahs and make them short.",
      "chain": [
        "30171",
        "20208",
        "20317",
        "11060",
        "11249",
        "34",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا موسى بن إسماعيل، ومحمد بن محبوب، - المعنى واحد - قالا حدثنا حماد، عن سماك بن حرب، عن سعيد بن جبير، عن ابن عمر، قال كنت أبيع الإبل بالبقيع فأبيع بالدنانير وآخذ الدراهم وأبيع بالدراهم وآخذ الدنانير آخذ هذه من هذه وأعطي هذه من هذه فأتيت رسول الله صلى الله عليه وسلم وهو في بيت حفصة فقلت يا رسول الله رويدك أسألك إني أبيع الإبل بالبقيع فأبيع بالدنانير وآخذ الدراهم وأبيع بالدراهم وآخذ الدنانير آخذ هذه من هذه وأعطي هذه من هذه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا بأس أن تأخذها بسعر يومها ما لم تفترقا وبينكما شىء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     I used to sell camels at al-Baqi for dinars and take dirhams for them, and sell for dirhams and take dinars for them. I would take these for these and give these for these. I went to the Messenger of Allah (ﷺ) who was in the house of Hafsah. I said: Messenger of Allah , take it easy, I shall ask you (a question): I sell camels at al-Baqi'. I sell (them) for dinars and take dirhams and I sell for dirhams and take dinars. I take these for these, and give these for these. The Messenger of Allah (ﷺ) then said: There is no harm in taking them at the current rate so long as you do not separate leaving something to be settled.",
      "chain": [
        "20040",
        "30171",
        "20022",
        "10770",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "3749",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، ومحمد بن محبوب، قالا حدثنا حماد، عن عاصم، عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الضيافة ثلاثة أيام فما سوى ذلك فهو صدقة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Hospitality extend for three days, and what goes beyond that is sadaqah (charity).",
      "chain": [
        "20040",
        "30171",
        "20022",
        "11080",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4964",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عون، قال أخبرنا ح، وحدثنا مسدد، ومحمد بن محبوب، قالوا حدثنا أبو عوانة، عن أبي عثمان، - وسماه ابن محبوب الجعد - عن أنس بن مالك، أن النبي صلى الله عليه وسلم قال له ‏\"‏ يا بنى ‏\"‏ ‏.‏ قال أبو داود سمعت يحيى بن معين يثني على محمد بن محبوب ويقول كثير الحديث ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet (ﷺ) said to him: My sonny.Abu Dawud said: I heard Yahya b. Ma'in praising the transmitter Muhammad b. Mahbub, and he said: He transmitted a large number of traditions.",
      "chain": [
        "30154",
        "30175",
        "30171",
        "20469",
        "19"
      ]
    },
    {
      "hadith_no": "4574",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا محمد بن محبوب، قال حدثنا هشيم، قال أنبأنا الليث بن سعد، عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال أصبت يوم خيبر قلادة فيها ذهب وخرز فأردت أن أبيعها فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ افصل بعضها من بعض ثم بعها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Fadalah bin 'Ubad said:                     \"On the Day of Khaibar I got a necklace containing gold and gems, and I wanted to sell it. Mention of that was made to the Prophet and he said: 'Take it apart, and then sell it.\"'",
      "chain": [
        "38433",
        "30171",
        "20468",
        "20023",
        "10906",
        "10905",
        "1935"
      ]
    }
  ],
  "total_hadiths": 14
}