{
  "id": "30184",
  "name": "Ahmad bin Yunus",
  "full_name": "Ahmad bin Yunus (أحمد بن يونس)",
  "grade": "Thiqah (Trustworthy)",
  "biography": {
    "birth": {
      "date_hijri": "",
      "date_gregorian": "",
      "date_display": null,
      "place": ""
    },
    "death": {
      "date_hijri": "227",
      "date_gregorian": "842",
      "date_display": null,
      "place": "",
      "reason": ""
    },
    "places_of_stay": [],
    "area_of_interest": [],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "26",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، وموسى بن إسماعيل، قالا حدثنا إبراهيم بن سعد، قال حدثنا ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم سئل أى العمل أفضل فقال ‏\"‏ إيمان بالله ورسوله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ الجهاد في سبيل الله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ حج مبرور ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle was asked, \"What is the best deed?\" He replied, \"To      believe in Allah and His Apostle (Muhammad). The questioner then      asked, \"What is the next (in goodness)? He replied, \"To participate in     Jihad (religious fighting) in Allah's Cause.\" The questioner again      asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj      (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is      performed with the intention of seeking Allah's pleasure only and not      to show off and without committing a sin and in accordance with the      traditions of the Prophet).\"",
      "chain": [
        "30184",
        "20040",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح قال أبو عبد الله وقال ابن وهب أخبرنا يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس، عن عمر، قال كنت أنا وجار، لي من الأنصار في بني أمية بن زيد، وهى من عوالي المدينة، وكنا نتناوب النزول على رسول الله صلى الله عليه وسلم ينزل يوما وأنزل يوما، فإذا نزلت جئته بخبر ذلك اليوم من الوحى وغيره، وإذا نزل فعل مثل ذلك، فنزل صاحبي الأنصاري يوم نوبته، فضرب بابي ضربا شديدا‏.‏ فقال أثم هو ففزعت فخرجت إليه فقال قد حدث أمر عظيم‏.‏ قال فدخلت على حفصة فإذا هي تبكي فقلت طلقكن رسول الله صلى الله عليه وسلم قالت لا أدري‏.‏ ثم دخلت على النبي صلى الله عليه وسلم فقلت وأنا قائم أطلقت نساءك قال ‏\"‏ لا ‏\"‏‏.‏ فقلت الله أكبر‏.‏",
      "text_en": " Narrated `Umar:                     My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to visit the Prophet by turns. He used to go one day and I another day. When I went I used to bring the news of that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked violently at my door and asked if I was there.\" I became horrified and came out to him. He said, \"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did Allah's Apostle divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet and said while standing, \"Have you divorced your wives?\" The Prophet replied in the negative. On what I said, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30184",
        "20029",
        "20475",
        "11013",
        "11200",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا عبد العزيز بن أبي سلمة، قال حدثنا عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال أتى رسول الله صلى الله عليه وسلم فأخرجنا له ماء في تور من صفر فتوضأ، فغسل وجهه ثلاثا ويديه مرتين مرتين، ومسح برأسه فأقبل به وأدبر، وغسل رجليه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     Once Allah's Apostle came to us and we brought out water for him in a brass pot. He performed ablution thus: He washed his face thrice, and his forearms to the elbows twice, then passed his wet hands lightly over the head from front to rear and brought them to front again and washed his feet (up to the ankles).",
      "chain": [
        "30184",
        "32017",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "331",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن يونس، عن زهير، قال حدثنا هشام، عن عروة، عن عائشة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ إذا أقبلت الحيضة فدعي الصلاة، وإذا أدبرت فاغسلي عنك الدم وصلي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said to me, \"Give up the prayer when your menses begin and when it has finished, wash the blood off your body (take a bath) and start praying.\"",
      "chain": [
        "30184",
        "20321",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "352",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا عاصم بن محمد، قال حدثني واقد بن محمد، عن محمد بن المنكدر، قال صلى جابر في إزار قد عقده من قبل قفاه، وثيابه موضوعة على المشجب قال له قائل تصلي في إزار واحد فقال إنما صنعت ذلك ليراني أحمق مثلك، وأينا كان له ثوبان على عهد النبي صلى الله عليه وسلم",
      "text_en": " Narrated Muhammad bin Al-Munkadir:                     Once Jabir prayed with his Izar tied to his back while his clothes were Lying beside him on a wooden peg. Somebody asked him, \"Do you offer your prayer in a single Izar?\" He replied, \"I did so to show it to a fool like you. Had anyone of us two garments in the lifetime of the Prophet?\"",
      "chain": [
        "30184",
        "20163",
        "11544",
        "11048"
      ]
    },
    {
      "hadith_no": "373",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا إبراهيم بن سعد، قال حدثنا ابن شهاب، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم صلى في خميصة لها أعلام، فنظر إلى أعلامها نظرة، فلما انصرف قال ‏\"‏ اذهبوا بخميصتي هذه إلى أبي جهم وائتوني بأنبجانية أبي جهم، فإنها ألهتني آنفا عن صلاتي ‏\"‏‏.‏ وقال هشام بن عروة عن أبيه عن عائشة قال النبي صلى الله عليه وسلم ‏\"‏ كنت أنظر إلى علمها وأنا في الصلاة فأخاف أن تفتنني ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     the Prophet prayed in a Khamisa (a square garment) having marks. During the prayer, he looked at its marks. So when he finished the prayer he said, \"Take this Khamisa of mine to Abu Jahm and get me his Inbijaniya (a woolen garment without marks) as it (the Khamisa) has diverted my attention from the prayer.\"Narrated `Aisha:The Prophet said, 'I was looking at its (Khamisa's) marks during the prayers and I was afraid that it may put me in trial (by taking away my attention).",
      "chain": [
        "30184",
        "20150",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "621",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا سليمان التيمي، عن أبي عثمان النهدي، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يمنعن أحدكم  أو أحدا منكم  أذان بلال من سحوره، فإنه يؤذن  أو ينادي  بليل، ليرجع قائمكم ولينبه نائمكم، وليس أن يقول الفجر أو الصبح ‏\"‏‏.‏ وقال بأصابعه ورفعها إلى فوق وطأطأ إلى أسفل حتى يقول هكذا‏.‏ وقال زهير بسبابتيه إحداهما فوق الأخرى ثم مدها عن يمينه وشماله‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"The Adhan pronounced by Bilal should not stop you from taking Suhur, for he pronounces the Adhan at night, so that the one offering the late night prayer (Tahajjud) from among you might hurry up and the sleeping from among you might wake up. It does not mean that dawn or morning has started.\" Then he (the Prophet) pointed with his fingers and raised them up (towards the sky) and then lowered them (towards the earth) like this (Ibn Mas`ud imitated the gesture of the Prophet). Az-Zuhri gestured with his two index fingers which he put on each other and then stretched them to the right and left. These gestures illustrate the way real dawn appears. It spreads left and right horizontally. The dawn that appears in the high sky and lowers down is not the real dawn) .",
      "chain": [
        "30184",
        "20321",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "687",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زائدة، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله بن عتبة، قال دخلت على عائشة فقلت ألا تحدثيني عن مرض رسول الله صلى الله عليه وسلم قالت بلى، ثقل النبي صلى الله عليه وسلم فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏‏.‏ قالت ففعلنا فاغتسل فذهب لينوء فأغمي عليه، ثم أفاق فقال صلى الله عليه وسلم ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك يا رسول الله‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏‏.‏ قالت فقعد فاغتسل، ثم ذهب لينوء فأغمي عليه، ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك يا رسول الله‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏، فقعد فاغتسل، ثم ذهب لينوء فأغمي عليه، ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ فقلنا لا، هم ينتظرونك يا رسول الله  والناس عكوف في المسجد ينتظرون النبي عليه السلام لصلاة العشاء الآخرة  فأرسل النبي صلى الله عليه وسلم إلى أبي بكر بأن يصلي بالناس، فأتاه الرسول فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تصلي بالناس‏.‏ فقال أبو بكر  وكان رجلا رقيقا  يا عمر صل بالناس‏.‏ فقال له عمر أنت أحق بذلك‏.‏ فصلى أبو بكر تلك الأيام، ثم إن النبي صلى الله عليه وسلم وجد من نفسه خفة فخرج بين رجلين أحدهما العباس لصلاة الظهر، وأبو بكر يصلي بالناس، فلما رآه أبو بكر ذهب ليتأخر فأومأ إليه النبي صلى الله عليه وسلم بأن لا يتأخر‏.‏ قال ‏\"‏ أجلساني إلى جنبه ‏\"‏‏.‏ فأجلساه إلى جنب أبي بكر‏.‏ قال فجعل أبو بكر يصلي وهو يأتم بصلاة النبي صلى الله عليه وسلم والناس بصلاة أبي بكر، والنبي صلى الله عليه وسلم قاعد‏.‏ قال عبيد الله فدخلت على عبد الله بن عباس فقلت له ألا أعرض عليك ما حدثتني عائشة عن مرض النبي صلى الله عليه وسلم قال هات‏.‏ فعرضت عليه حديثها، فما أنكر منه شيئا، غير أنه قال أسمت لك الرجل الذي كان مع العباس قلت لا‏.‏ قال هو علي‏.‏",
      "text_en": " Narrated 'Ubaidullah Ibn `Abdullah bin `Utba:                     I went to `Aisha and asked her to describe to me the illness of Allah's Apostle. `Aisha said, \"Yes. The Prophet became seriously ill and asked whether the people had prayed. We replied, 'No. O Allah's Apostle! They are waiting for you.' He added, 'Put water for me in a trough.\" `Aisha added, \"We did so. He took a bath and tried to get up but fainted. When he recovered, he again asked whether the people had prayed. We said, 'No, they are waiting for you. O Allah's Apostle,' He again said, 'Put water in a trough for me.' He sat down and took a bath and tried to get up but fainted again. Then he recovered and said, 'Have the people prayed?' We replied, 'No, they are waiting for you. O Allah's Apostle.' He said, 'Put water for me in the trough.' Then he sat down and washed himself and tried to get up but he fainted. When he recovered, he asked, 'Have the people prayed?' We said, 'No, they are waiting for you. O Allah's Apostle! The people were in the mosque waiting for the Prophet for the `Isha prayer. The Prophet sent for Abu Bakr to lead the people in the prayer. The messenger went to Abu Bakr and said, 'Allah's Apostle orders you to lead the people in the prayer.' Abu Bakr was a softhearted man, so he asked `Umar to lead the prayer but `Umar replied, 'You are more rightful.' So Abu Bakr led the prayer in those days. When the Prophet felt a bit better, he came out for the Zuhr prayer with the help of two persons one of whom was Al-`Abbas. while Abu Bakr was leading the people in the prayer. When Abu Bakr saw him he wanted to retreat but the Prophet beckoned him not to do so and asked them to make him sit beside Abu Bakr and they did so. Abu Bakr was following the Prophet (in the prayer) and the people were following Abu Bakr. The Prophet (prayed) sitting.\" 'Ubaidullah added \"I went to `Abdullah bin `Abbas and asked him, Shall I tell you what Aisha has told me about the fatal illness of the Prophet?' Ibn `Abbas said, 'Go ahead. I told him her narration and he did not deny anything of it but asked whether `Aisha told me the name of the second person (who helped the Prophet ) along with Al-Abbas. I said. 'No.' He said, 'He was `Ali (Ibn Abi Talib).",
      "chain": [
        "30184",
        "20320",
        "11399",
        "11004"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "قال أبو عبد الله وقال لنا محمد بن يوسف حدثنا الأوزاعي، حدثنا الزهري، عن حميد بن عبد الرحمن، عن عبيد الله بن عدي بن خيار، أنه دخل على عثمان بن عفان  رضى الله عنه  وهو محصور فقال إنك إمام عامة، ونزل بك ما ترى ويصلي لنا إمام فتنة ونتحرج‏.‏ فقال الصلاة أحسن ما يعمل الناس، فإذا أحسن الناس فأحسن معهم، وإذا أساءوا فاجتنب إساءتهم‏.‏ وقال الزبيدي قال الزهري لا نرى أن يصلى خلف المخنث إلا من ضرورة لا بد منها‏.‏",
      "text_en": " Narrated 'Ubaid-Ullah bin Adi bin Khiyar:                      I went to 'Uthman bin Affan while he was besieged, and said to him, \"You are the chief of all Muslims in general and you see what has befallen you. We are led in the Salat (prayer) by a leader of Al-Fitan (trials and afflictions etc.) and we are afraid of being sinful in following him.\" 'Uthman said. \"As-Salat (the prayers) is the best of all deeds so when the people do good deeds do the same with them and when they do bad deeds, avoid those bad deeds.\" Az-Zuhri said, \"In our opinion one should not offer Salat behind an effeminate person unless there is no alternative.\"",
      "chain": [
        "30184",
        "30388",
        "20024",
        "11013",
        "10561",
        "880"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا إسماعيل، قال سمعت قيسا، قال أخبرني أبو مسعود، أن رجلا، قال والله يا رسول الله إني لأتأخر عن صلاة الغداة من أجل فلان مما يطيل بنا‏.‏ فما رأيت رسول الله صلى الله عليه وسلم في موعظة أشد غضبا منه يومئذ ثم قال ‏\"‏ إن منكم منفرين، فأيكم ما صلى بالناس فليتجوز، فإن فيهم الضعيف والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came and said, \"O Allah's Apostle! By Allah, I keep away from the morning prayer only because So and so prolongs the prayer when he leads us in it.\" The narrator said, \"I never saw Allah's Apostle more furious in giving advice than he was at that time. He then said, \"Some of you make people dislike good deeds (the prayer). So whoever among you leads the people in prayer should shorten it because among them are the weak, the old and the needy.\"",
      "chain": [
        "30184",
        "20321",
        "20208",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن يونس، قال حدثنا زائدة، عن التيمي، عن أبي مجلز، عن أنس، قال قنت النبي صلى الله عليه وسلم شهرا يدعو على رعل وذكوان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan.",
      "chain": [
        "30184",
        "20320",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "1309",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، قال كنا في جنازة فأخذ أبو هريرة  رضى الله عنه  بيد مروان فجلسا قبل أن توضع، فجاء أبو سعيد  رضى الله عنه  فأخذ بيد مروان فقال قم فوالله لقد علم هذا أن النبي صلى الله عليه وسلم نهانا عن ذلك‏.‏ فقال أبو هريرة صدق‏.‏",
      "text_en": " Narrated Sa`id Al-Maqburi:                     That his father said, \"While we were accompanying a funeral procession, Abu Huraira got hold of the hand of Marwan and they sat down before the coffin was put down. Then Abu Sa`id came and took hold of Marwan's hand and said, \"Get up. By Allah, no doubt this (i.e. Abu Huraira) knows that the Prophet forbade us to do that.\" Abu Huraira said, \"He (Abu Sa`id) has spoken the truth.\"",
      "chain": [
        "30184",
        "20177",
        "11168",
        "11212"
      ]
    },
    {
      "hadith_no": "1468",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت بعث إلى نسيبة الأنصارية بشاة فأرسلت إلى عائشة  رضى الله عنها  منها فقال النبي صلى الله عليه وسلم ‏\"‏ عندكم شىء ‏\"‏‏.‏ فقلت لا إلا ما أرسلت به نسيبة من تلك الشاة فقال ‏\"‏ هات فقد بلغت محلها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     A sheep was sent to me (Nusaiba Al-Ansariya) (in charity) and I sent some of it to `Aisha. The Prophet asked `Aisha for something to eat. `Aisha replied that there was nothing except what Nusaiba Al-Ansariya had sent of that sheep. The Prophet said to her, \"Bring it as it has reached its place.\"",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1532",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا الليث، عن نافع، أن عبد الله، قال أمر النبي صلى الله عليه وسلم بزكاة الفطر، صاعا من تمر، أو صاعا من شعير‏.‏ قال عبد الله  رضى الله عنه  فجعل الناس عدله مدين من حنطة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet ordered (Muslims) to give one Sa' of dates or one Sa' of barley as Zakat-ul-Fitr. The people rewarded two Mudds of wheat as equal to that.",
      "chain": [
        "30184",
        "20023",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن يونس، أخبرنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس  رضى الله عنهما  قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ وقال عبد الرحيم الرازي عن ابن خثيم أخبرني عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال القاسم بن يحيى حدثني ابن خثيم عن عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏   وقال عفان أراه عن وهيب، حدثنا ابن خثيم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال حماد عن قيس بن سعد وعباد بن منصور عن عطاء عن جابر  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man said to the Prophet \"I performed the Tawaf-al-Ifada before the Rami (throwing pebbles at the Jamra).\" The Prophet replied, \"There is no harm.\" The man said, \"I had my head shaved before slaughtering.\" The Prophet replied, \"There is no harm.\" He said, \"I have slaughtered the Hadi before the Rami.\" The Prophet replied, \"There is no harm.\"",
      "chain": [
        "30184",
        "20436",
        "11257",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1873",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، حدثنا ابن شهاب، عن سالم، عن عبد الله  رضى الله عنه  سئل رسول الله صلى الله عليه وسلم ما يلبس المحرم من الثياب فقال ‏\"‏ لا يلبس القميص، ولا العمائم، ولا السراويلات، ولا البرنس، ولا ثوبا مسه زعفران ولا ورس، وإن لم يجد نعلين فليلبس الخفين، وليقطعهما حتى يكونا أسفل من الكعبين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle was asked what sort of clothes a Muhrim should wear. He replied, \"He should not wear a shirt, turbans, trousers, a hooded cloak, or a dress perfumed with saffron or Wars; and if slippers are not available he can wear Khuffs (socks made from thick fabric or leather) but he should cut them so that they reach below the ankles.",
      "chain": [
        "30184",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1950",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يحيى، عن أبي سلمة، قال سمعت عائشة  رضى الله عنها  تقول كان يكون على الصوم من رمضان، فما أستطيع أن أقضي إلا في شعبان‏.‏ قال يحيى الشغل من النبي أو بالنبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     Sometimes I missed some days of Ramadan, but could not fast in lieu of them except in the month of Sha'ban.\" Said Yahya, a sub-narrator, \"She used to be busy serving the Prophet .\"",
      "chain": [
        "30184",
        "20321",
        "20031",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1958",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن سليمان، عن ابن أبي أوفى  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في سفر، فصام حتى أمسى، قال لرجل ‏\"‏ انزل، فاجدح لي ‏\"‏‏.‏ قال لو انتظرت حتى تمسي‏.‏ قال ‏\"‏ انزل، فاجدح لي، إذا رأيت الليل قد أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     I was with the Prophet on a journey, and he observed the fast till evening. The Prophet said to a man, \"Get down and mix Sawiq with water for me.\" He replied, \"Will you wait till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for me; when you see night falling from this side, the fasting person should break his fast.\"",
      "chain": [
        "30184",
        "20436",
        "20160",
        "5115"
      ]
    },
    {
      "hadith_no": "2049",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا حميد، عن أنس  رضى الله عنه  قال قدم عبد الرحمن بن عوف المدينة فآخى النبي صلى الله عليه وسلم بينه وبين سعد بن الربيع الأنصاري، وكان سعد ذا غنى، فقال لعبد الرحمن أقاسمك مالي نصفين، وأزوجك‏.‏ قال بارك الله لك في أهلك ومالك، دلوني على السوق‏.‏ فما رجع حتى استفضل أقطا وسمنا، فأتى به أهل منزله، فمكثنا يسيرا  أو ما شاء الله  فجاء وعليه وضر من صفرة، فقال له النبي صلى الله عليه وسلم ‏\"‏ مهيم ‏\"‏‏.‏ قال يا رسول الله تزوجت امرأة من الأنصار‏.‏ قال ‏\"‏ ما سقت إليها ‏\"‏‏.‏ قال نواة من ذهب، أو وزن نواة من ذهب‏.‏ قال ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When `Abdur-Rahman bin `Auf came to Medina, the Prophet established a bond of brotherhood between him and Sa`d bin Ar-Rabi al-Ansari. Sa`d was a rich man, so he said to `Abdur-Rahman, \"I will give you half of my property and will help you marry.\" `Abdur-Rahman said (to him), \"May Allah bless you in your family and property. Show me the market.\" So `Abdur-Rahman did not return from the market) till he gained some dried buttermilk (yogurt) and butter (through trading). He brought that to his house-hold. We stayed for sometime (or as long as Allah wished), and then `Abdur-Rahman came, scented with yellowish perfume. The Prophet said (to him) \"What is this?\" He replied, \"I got married to an Ansari woman.\" The Prophet asked, \"What did you pay her?\" He replied, \"A gold stone or gold equal to the weight of a date stone.\" The Prophet said (to him), \"Give a wedding banquet even if with one sheep.\"",
      "chain": [
        "30184",
        "20321",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2077",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، أن ربعي بن حراش، حدثه أن حذيفة  رضى الله عنه  حدثه قال قال النبي صلى الله عليه وسلم ‏\"‏ تلقت الملائكة روح رجل ممن كان قبلكم قالوا أعملت من الخير شيئا قال كنت آمر فتياني أن ينظروا ويتجاوزوا عن الموسر قال قال فتجاوزوا عنه ‏\"‏‏.‏ وقال أبو مالك عن ربعي ‏\"‏ كنت أيسر على الموسر وأنظر المعسر ‏\"‏‏.‏ وتابعه شعبة عن عبد الملك عن ربعي‏.‏ وقال أبو عوانة عن عبد الملك عن ربعي ‏\"‏ أنظر الموسر، وأتجاوز عن المعسر ‏\"‏‏.‏ وقال نعيم بن أبي هند عن ربعي ‏\"‏ فأقبل من الموسر، وأتجاوز عن المعسر ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"Before your time the angels received the soul of a man and asked him, 'Did you do any good deeds (in your life)?' He replied, 'I used to order my employees to grant time to the rich person to pay his debts at his convenience.' So Allah said to the angels; \"Excuse him.\" Rabi said that (the dead man said), 'I used to be easy to the rich and grant time to the poor.' Or, in another narration, 'grant time to the well-off and forgive the needy,' or, 'accept from the well-off and forgive the needy.'",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2116",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "قال أبو عبد الله وقال الليث حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن سالم بن عبد الله، عن عبد الله بن عمر  رضى الله عنهما  قال بعت من أمير المؤمنين عثمان مالا بالوادي بمال له بخيبر، فلما تبايعنا رجعت على عقبي حتى خرجت من بيته، خشية أن يرادني البيع، وكانت السنة أن المتبايعين بالخيار حتى يتفرقا، قال عبد الله فلما وجب بيعي وبيعه رأيت أني قد غبنته بأني سقته إلى أرض ثمود بثلاث ليال وساقني إلى المدينة بثلاث ليال‏.‏",
      "text_en": " Narrated  'Abdullah bin 'Umar (ra):                      I bartered my property in Khaibar to 'Uthman (chief of the faithful believers) for his property in Al-Wadi. When we finished the deal, I left immediately and got out of his house lest he should cancel the deal, for the tradition was that they buyer and the seller had the option of canceling the bargain unless they separated.  When out deal was completed, I came to know that I have been unfair to 'Uthman, for by selling him my land I caused him to be in a land of Thamud, at a distance of three days journey from Al-Madina, while he made me neared to Al-Madina, at a distance of three days journey from my former land.",
      "chain": [
        "30184",
        "20023",
        "20376",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2203",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "قال أبو عبد الله وقال لي إبراهيم أخبرنا هشام، أخبرنا ابن جريج، قال سمعت ابن أبي مليكة، يخبر عن نافع، مولى ابن عمر أن أيما، نخل بيعت قد أبرت لم يذكر الثمر، فالثمر للذي أبرها، وكذلك العبد والحرث‏.‏ سمى له نافع هؤلاء الثلاث‏.‏",
      "text_en": " Narrated Nafi', the freed slave of Ibn 'Umar:                      If pollinated date-palms are sold and nothing is mentioned (in the contract) about their fruits, the fruits will go to the person who has pollinated them, and so will be the case with the slave and the cultivator. Nafi' mentioned those three things.",
      "chain": [
        "30184",
        "20150",
        "11065",
        "11070",
        "11090",
        "11014"
      ]
    },
    {
      "hadith_no": "2291",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "قال أبو عبد الله وقال الليث حدثني جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم ‏\"‏ أنه ذكر رجلا من بني إسرائيل سأل بعض بني إسرائيل أن يسلفه ألف دينار، فقال ائتني بالشهداء أشهدهم‏.‏ فقال كفى بالله شهيدا‏.‏ قال فأتني بالكفيل‏.‏ قال كفى بالله كفيلا‏.‏ قال صدقت‏.‏ فدفعها إليه إلى أجل مسمى، فخرج في البحر، فقضى حاجته، ثم التمس مركبا يركبها، يقدم عليه للأجل الذي أجله، فلم يجد مركبا، فأخذ خشبة، فنقرها فأدخل فيها ألف دينار، وصحيفة منه إلى صاحبه، ثم زجج موضعها، ثم أتى بها إلى البحر، فقال اللهم إنك تعلم أني كنت تسلفت فلانا ألف دينار، فسألني كفيلا، فقلت كفى بالله كفيلا، فرضي بك، وسألني شهيدا، فقلت كفى بالله شهيدا، فرضي بك، وأني جهدت أن أجد مركبا، أبعث إليه الذي له فلم أقدر، وإني أستودعكها‏.‏ فرمى بها في البحر حتى ولجت فيه، ثم انصرف، وهو في ذلك يلتمس مركبا، يخرج إلى بلده، فخرج الرجل الذي كان أسلفه، ينظر لعل مركبا قد جاء بماله، فإذا بالخشبة التي فيها المال، فأخذها لأهله حطبا، فلما نشرها وجد المال والصحيفة، ثم قدم الذي كان أسلفه، فأتى بالألف دينار، فقال والله ما زلت جاهدا في طلب مركب لآتيك بمالك، فما وجدت مركبا قبل الذي أتيت فيه‏.‏ قال هل كنت بعثت إلى بشىء قال أخبرك أني لم أجد مركبا قبل الذي جئت فيه‏.‏ قال فإن الله قد أدى عنك الذي بعثت في الخشبة فانصرف بالألف الدينار راشدا ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"An Israeli man asked another Israeli to lend him      one thousand Dinars. The second man required witnesses. The former      replied, 'Allah is sufficient as a witness.' The second said, 'I want      a surety.' The former replied, 'Allah is sufficient as a surety.' The      second said, 'You are right,' and lent him the money for a certain      period. The debtor went across the sea. When he finished his job, he      searched for a conveyance so that he might reach in time for the      repayment of the debt, but he could not find any. So, he took a piece      of wood and made a hole in it, inserted in it one thousand Dinars and      a letter to the lender and then closed (i.e. sealed) the hole tightly.     He took the piece of wood to the sea and said. 'O Allah! You know well     that I took a loan of one thousand Dinars from so-and-so. He demanded      a surety from me but I told him that Allah's Guarantee was sufficient      and he accepted Your guarantee. He then asked for a witness and I told     him that Allah was sufficient as a Witness, and he accepted You as a      Witness. No doubt, I tried hard to find a conveyance so that I could      pay his money but could not find, so I hand over this money to You.'      Saying that, he threw the piece of wood into the sea till it went out      far into it, and then he went away. Meanwhile he started searching for     a conveyance in order to reach the creditor's country.      One day the lender came out of his house to see whether a ship had      arrived bringing his money, and all of a sudden he saw the piece of      wood in which his money had been deposited. He took it home to use for     fire. When he sawed it, he found his money and the letter inside it.      Shortly after that, the debtor came bringing one thousand Dinars to      him and said, 'By Allah, I had been trying hard to get a boat so that      I could bring you your money, but failed to get one before the one I      have come by.' The lender asked, 'Have you sent something to me?' The      debtor replied, 'I have told you I could not get a boat other than the     one I have come by.' The lender said, 'Allah has delivered on your      behalf the money you sent in the piece of wood. So, you may keep your      one thousand Dinars and depart guided on the right path.' \"",
      "chain": [
        "30184",
        "20023",
        "11407",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2388",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الأعمش، عن زيد بن وهب، عن أبي ذر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم فلما أبصر  يعني أحدا  قال ‏\"‏ ما أحب أنه يحول لي ذهبا يمكث عندي منه دينار فوق ثلاث، إلا دينارا أرصده لدين ‏\"‏‏.‏ ثم قال ‏\"‏ إن الأكثرين هم الأقلون، إلا من قال بالمال هكذا وهكذا ‏\"‏‏.‏ وأشار أبو شهاب بين يديه وعن يمينه وعن شماله  وقليل ما هم  وقال مكانك‏.‏ وتقدم غير بعيد، فسمعت صوتا، فأردت أن آتيه، ثم ذكرت قوله مكانك حتى آتيك، فلما جاء قلت يا رسول الله، الذي سمعت أو قال الصوت الذي سمعت قال ‏\"‏ وهل سمعت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أتاني جبريل  عليه السلام  فقال من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن فعل كذا وكذا قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not like to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains of it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar which I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have little reward in the Hereafter except those who spend their money here and there (in Allah's Cause), and they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a voice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his return I said, \"O Allah's Apostle! (What was) that noise which I heard?\" He said, \"Did you hear anything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers dies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such things (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"",
      "chain": [
        "30184",
        "11613",
        "11060",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يحيى بن سعيد، قال أخبرني أبو بكر بن محمد بن عمرو بن حزم، أن عمر بن عبد العزيز، أخبره أن أبا بكر بن عبد الرحمن بن الحارث بن هشام أخبره أنه، سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم أو قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أدرك ماله بعينه عند رجل أو إنسان قد أفلس، فهو أحق به من غيره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a man finds his very things with a bankrupt, he has more right to take them back than anyone else.\"",
      "chain": [
        "30184",
        "20321",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "2447",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا عبد العزيز الماجشون، أخبرنا عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الظلم ظلمات يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Oppression will be a darkness on the Day of Resurrection.\"",
      "chain": [
        "30184",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "2517",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا عاصم بن محمد، قال حدثني واقد بن محمد، قال حدثني سعيد ابن مرجانة، صاحب علي بن حسين قال لي أبو هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ أيما رجل أعتق امرأ مسلما استنقذ الله بكل عضو منه عضوا منه من النار ‏\"‏‏.‏ قال سعيد ابن مرجانة فانطلقت إلى علي بن حسين فعمد علي بن حسين  رضى الله عنهما  إلى عبد له قد أعطاه به عبد الله بن جعفر عشرة آلاف درهم  أو ألف دينار  فأعتقه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever frees a Muslim slave, Allah will save all the parts of his body from the (Hell) Fire as he has freed the body-parts of the slave.\" Sa`id bin Marjana said that he narrated that Hadith to `Ali bin Al-Husain and he freed his slave for whom `Abdullah bin Ja`far had offered him ten thousand Dirhams or one-thousand Dinars.",
      "chain": [
        "30184",
        "20163",
        "11544",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "2838",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا حميد، أن أنسا، حدثهم قال رجعنا من غزوة تبوك مع النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     We returned from the Ghazwa of Tabuk along with the Prophet. (See Hadith No. 92 below) .",
      "chain": [
        "30184",
        "20321",
        "11279"
      ]
    },
    {
      "hadith_no": "2848",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال انصرفت من عند النبي صلى الله عليه وسلم، فقال لنا أنا وصاحب لي ‏\"‏ أذنا وأقيما، وليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Al-Huwairith:                     On my departure from the Prophet he said to me and to a friend of mine, \"You two, pronounce the Adhan and the Iqama for the prayer and let the elder of you lead the prayer.\"",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "2869",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا الليث، عن نافع، عن عبد الله  رضى الله عنه أن النبي صلى الله عليه وسلم سابق بين الخيل التي لم تضمر، وكان أمدها من الثنية إلى مسجد بني زريق‏.‏ وأن عبد الله بن عمر كان سابق بها‏.‏   قال أبو عبد الله أمدا غاية  فطال عليهم الأمد",
      "text_en": " Narrated `Abdullah:                     The Prophet arranged for a horse race of the horses which had not been made lean; the area of the race was from Ath-Thaniya to the mosque of Bani Zuraiq. (The sub-narrator said, \"`Abdullah bin `Umar was amongst those who participated in that horse race.\").",
      "chain": [
        "30184",
        "20023",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3014",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، أخبرنا الليث، عن نافع، أن عبد الله  رضى الله عنه  أخبره أن امرأة وجدت في بعض مغازي النبي صلى الله عليه وسلم مقتولة، فأنكر رسول الله صلى الله عليه وسلم قتل النساء والصبيان‏.‏",
      "text_en": " Narrated `Abdullah:                     During some of the Ghazawat of the Prophet a woman was found killed. Allah's Apostle disapproved the killing of women and children.",
      "chain": [
        "30184",
        "20023",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3047",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا مطرف، أن عامرا، حدثهم عن أبي جحيفة  رضى الله عنه  قال قلت لعلي  رضى الله عنه هل عندكم شىء من الوحى إلا ما في كتاب الله قال والذي فلق الحبة وبرأ النسمة ما أعلمه إلا فهما يعطيه الله رجلا في القرآن، وما في هذه الصحيفة‏.‏ قلت وما في الصحيفة قال العقل وفكاك الأسير، وأن لا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I asked `Ali, \"Do you have the knowledge of any Divine Inspiration besides what is in Allah's Book?\" `Ali replied, \"No, by Him Who splits the grain of corn and creates the soul. I don't think we have such knowledge, but we have the ability of understanding which Allah may endow a person with, so that he may understand the Qur'an, and we have what is written in this paper as well.\" I asked, \"What is written in this paper?\" He replied, \"(The regulations of) blood-money, the freeing of captives, and the judgment that no Muslim should be killed for killing an infidel.\"",
      "chain": [
        "30184",
        "20321",
        "11395",
        "4047"
      ]
    },
    {
      "hadith_no": "3069",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، عن موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما أنه كان على فرس يوم لقي المسلمون، وأمير المسلمين يومئذ خالد بن الوليد، بعثه أبو بكر، فأخذه العدو، فلما هزم العدو رد خالد فرسه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That he was riding a horse on the day, the Muslims fought (against the Byzantines), and the commander of the Muslim army was Khalid bin Al-Walid who had been appointed by Abu Bakr. The enemy took the horse away, and when the enemy was defeated, Khalid returned the horse to him.",
      "chain": [
        "30184",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3163",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، عن يحيى بن سعيد، قال سمعت أنسا  رضى الله عنه  قال دعا النبي صلى الله عليه وسلم الأنصار ليكتب لهم بالبحرين فقالوا لا والله حتى تكتب لإخواننا من قريش بمثلها‏.‏ فقال ذاك لهم ما شاء الله على ذلك يقولون له قال ‏\"‏ فإنكم سترون بعدي أثرة، فاصبروا حتى تلقوني ‏على الحوض\"‏‏.‏",
      "text_en": " Narrated Yahya bin Sa`id:                     Once the Prophet called the Ansar in order to grant them part of the land of Bahrain. On that they said, \"No! By Allah, we will not accept it unless you grant a similar thing to our Quarries brothers as well.\" He said, \"That will be their's if Allah wishes.\" But when the Ansar persisted in their request, he said, \"After me you will see others given preference over you in this respect (in which case) you should be patient till you meet me at the Tank (of Al-Kauthar).",
      "chain": [
        "30184",
        "20321",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "3211",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، حدثنا ابن شهاب، عن أبي سلمة، والأغر، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا كان يوم الجمعة كان على كل باب من أبواب المسجد الملائكة، يكتبون الأول فالأول، فإذا جلس الإمام طووا الصحف وجاءوا يستمعون الذكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"On every Friday the angels take heir stand at every gate of the mosques to write the names of the people chronologically (i.e. according to the time of their arrival for the Friday prayer and when the Imam sits (on the pulpit) they fold up their scrolls and get ready to listen to the sermon.\"",
      "chain": [
        "30184",
        "20150",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3240",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا الليث بن سعد، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مات أحدكم فإنه يعرض عليه مقعده بالغداة والعشي، فإن كان من أهل الجنة فمن أهل الجنة، وإن كان من أهل النار فمن أهل النار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"When anyone of you dies, he will be shown his destination both in the morning and in the evening, and if he belongs to the people of Paradise, he will be shown his place in Paradise, and if he is from the people of Hell, he will be shown his place in Hell.\"",
      "chain": [
        "30184",
        "20023",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3483",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أحمد بن يونس، عن زهير، حدثنا منصور، عن ربعي بن حراش، حدثنا أبو مسعود، عقبة قال قال النبي صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة، إذا لم تستحي فافعل ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud `Uqba:                     The Prophet said, \"One of the sayings of the prophets which the people have got, is. 'If you do not feel ashamed, then do whatever you like.\"",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا إسماعيل، عن أبي جحيفة  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم وكان الحسن يشبهه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I saw the Prophet, and Al-Hasan resembled him.",
      "chain": [
        "30184",
        "20321",
        "20208",
        "4047"
      ]
    },
    {
      "hadith_no": "3783",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "قال أبو عبد الله وحدثني سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا عبد الرحمن بن نمر، عن الزهري، حدثني حرملة، مولى أسامة بن زيد أنه بينما هو مع عبد الله بن عمر إذ دخل الحجاج بن أيمن فلم يتم ركوعه ولا سجوده، فقال أعد‏.‏ فلما ولى قال لي ابن عمر من هذا قلت الحجاج بن أيمن ابن أم أيمن‏.‏ فقال ابن عمر لو رأى هذا رسول الله صلى الله عليه وسلم لأحبه، فذكر حبه وما ولدته أم أيمن‏.‏ قال وحدثني بعض أصحابي عن سليمان وكانت حاضنة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Harmala, the freed slave of Usama bin Zaid saidthat while he      was in the company of 'Abdullah bin 'Umar, Al-Hajjaj bin Aiman came in     and (while praying) he did not perform his bowing and prostrations      properly. So Ibn 'Umar told him to repeat his prayer. When he went      away, Ibn 'Umar asked me, \"Who is he?\" I said, \"Al-Hajjaj bin Um      Aiman.\" Ibn 'Umar said, \"If Allah's Apostle saw him, he would have      loved him.\" Then Ibn 'Umar mentioned the love of the Prophet for the      children of Um Aiman. Sulaiman said that Um Aiman was one of the nurses     of the Prophet.",
      "chain": [
        "30184",
        "30587",
        "20733",
        "11013",
        "11683"
      ]
    },
    {
      "hadith_no": "4010",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا سليمان التيمي، أن أنسا، حدثهم قال قال النبي صلى الله عليه وسلم ح وحدثني عمرو بن خالد حدثنا زهير عن سليمان التيمي عن أنس  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من ينظر ما صنع أبو جهل ‏\"‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد قال آأنت أبو جهل قال فأخذ بلحيته‏.‏ قال وهل فوق رجل قتلتموه أو رجل قتله قومه قال أحمد بن يونس أنت أبو جهل‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and found that the two sons of 'Afra had struck him fatally (and he was in his last breaths). `Abdullah bin Mas`ud said, \"Are you Abu Jahl?\" And took him by the beard. Abu Jahl said, \"Can there be a man superior to one you have killed or one whom his own folk have killed?\"",
      "chain": [
        "30184",
        "20321",
        "11289"
      ]
    },
    {
      "hadith_no": "4097",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأعمش، عن شقيق، عن خباب  رضى الله عنه  قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله، فوجب أجرنا على الله، ومنا من مضى أو ذهب لم يأكل من أجره شيئا، كان منهم مصعب بن عمير قتل يوم أحد، لم يترك إلا نمرة، كنا إذا غطينا بها رأسه خرجت رجلاه، وإذا غطي بها رجلاه خرج رأسه، فقال لنا النبي صلى الله عليه وسلم ‏\"‏ غطوا بها رأسه، واجعلوا على رجله الإذخر  أو قال ألقوا على رجله من الإذخر ‏\"‏‏.‏ ومنا من قد أينعت له ثمرته فهو يهدبها‏.‏",
      "text_en": "      Narrated Khabbab bin Al-Art:                          We migrated in the company of Allah's Apostle, seeking Allah's      Pleasure. So our reward became due and sure with Allah. Some of us      have been dead without enjoying anything of their rewards (here), and      one of them was Mus'ab bin 'Umar who was martyred on the day of the      battle of Uhud, and did not leave anything except a Namira (i.e. a      sheet in which he was shrouded). If we covered his head with it, his      feet became naked, and if we covered his feet with it, his head became     naked. So the Prophet said to us, \"Cover his head with it and put some     Idhkhir (i.e. a kind of grass) over his feet or throw Idhkhir over his     feet.\" But some amongst us have got the fruits of their labor ripened,     and they are collecting them.",
      "chain": [
        "30184",
        "20321",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "hadith_no": "4131",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأعمش، عن شقيق، عن خباب  رضى الله عنه  قال هاجرنا مع النبي صلى الله عليه وسلم ونحن نبتغي وجه الله، فوجب أجرنا على الله، فمنا من مضى أو ذهب لم يأكل من أجره شيئا، كان منهم مصعب بن عمير قتل يوم أحد، فلم يترك إلا نمرة كنا إذا غطينا بها رأسه خرجت رجلاه، وإذا غطي بها رجلاه خرج رأسه، فقال لنا النبي صلى الله عليه وسلم ‏\"‏ غطوا بها رأسه، واجعلوا على رجليه الإذخر ‏\"‏‏.‏ أو قال ‏\"‏ ألقوا على رجليه من الإذخر ‏\"‏‏.‏ ومنا من أينعت له ثمرته فهو يهدبها‏.‏",
      "text_en": " Narrated Khabbab:                     We migrated with the Prophet for Allah's Cause, so our reward became due with Allah. Some of us passed away (i.e. died) without enjoying anything from their reward, and one of them was Mus`ab bin `Umar who was killed (i.e. martyred) on the day of Uhud. He did not leave behind except a sheet of striped woolen cloth. If we covered his head with it, his feet became naked, and if we covered his feet with it, his head became naked. The Prophet said to us, \"Cover his head with it and put Idhkhir (i.e. a kind of grass) over his feet,\" or said, \"Put some Idhkhir over his feet.\" But some of us have got their fruits ripened, and they are collecting them.",
      "chain": [
        "30184",
        "20321",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "hadith_no": "4344",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن عاصم، عن عكرمة، عن ابن عباس، قال أقمنا مع النبي صلى الله عليه وسلم في سفر تسع عشرة نقصر الصلاة‏.‏ وقال ابن عباس ونحن نقصر ما بيننا وبين تسع عشرة، فإذا زدنا أتممنا‏.‏",
      "text_en": " Narrated `Ikrima:                     Ibn `Abbas said, \"We stayed for 19 days with Prophet on a journey during which we used to offer shortened prayers.\" Ibn `Abbas added, \"We offer the Qasr prayer (i.e. shortened prayer) If we stay up to 19 days as travelers, But if we stay longer, we offer complete prayers.",
      "chain": [
        "30184",
        "11613",
        "11080",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4453",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم  هو ابن سعد  حدثنا ابن شهاب، عن عامر بن سعد، عن أبيه، قال عادني النبي صلى الله عليه وسلم في حجة الوداع من وجع، أشفيت منه على الموت، فقلت يا رسول الله بلغ بي من الوجع ما ترى، وأنا ذو مال ولا يرثني إلا ابنة لي واحدة أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قلت أفأتصدق بشطره قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ والثلث كثير، إنك أن تذر ورثتك أغنياء خير من أن تذرهم عالة يتكففون الناس، ولست تنفق نفقة تبتغي بها وجه الله إلا أجرت بها، حتى اللقمة تجعلها في في امرأتك ‏\"‏‏.‏ قلت يا رسول الله آأخلف بعد أصحابي قال ‏\"‏ إنك لن تخلف فتعمل عملا تبتغي به وجه الله إلا ازددت به درجة ورفعة، ولعلك تخلف حتى ينتفع بك أقوام ويضر بك آخرون، اللهم أمض لأصحابي هجرتهم، ولا تردهم على أعقابهم‏.‏ لكن البائس سعد ابن خولة رثى له رسول الله صلى الله عليه وسلم أن توفي بمكة ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     The Prophet visited me during Hajjat ul-Wada` while I was suffering from a disease which brought me to the verge of death. I said, \"O Allah's Apostle! My ailment has reached such a (bad) state as you see, and I have much wealth, but I have no-one to inherit from me except my only daughter. Shall I give 2/3 of my property as alms (in charity)?\" The Prophet said, \"No,\" I said, \"Shall I give half of my property as alms?\" He said, \"No.\" I said, \"(Shall I give) 1/3 of it? \" He replied, \" 1/3, and even 1/3 is too much. It is better for you to leave your inheritors wealthy rather than to leave them poor, begging people (for their sustenance); and whatever you spend for Allah's Sake, you will get reward for it even for the morsel of food which you put in your wives mouth.\" I said, \"O Allah's Apostle! Should I remain (in Mecca) behind my companions (who are going with you to Medina)?\" The Prophet said, \"If you remain behind, any good deed which you will do for Allah's Sake, will upgrade and elevate you. May be you will live longer so that some people may benefit by you and some other (i.e. infidels) may get harmed by you.\" The Prophet then added, \"O Allah! Complete the Migration of my companions and do not turn them on their heels. But the poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca) .\" Allah's Apostle pitied Sa`d for he died in Mecca.",
      "chain": [
        "30184",
        "20150",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس  أراه قال  حدثنا أبو بكر، عن أبي حصين، عن أبي الضحى، عن ابن عباس، ‏{‏حسبنا الله ونعم الوكيل‏}‏ قالها إبراهيم عليه السلام حين ألقي في النار، وقالها محمد صلى الله عليه وسلم حين قالوا ‏{‏إن الناس قد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     'Allah is Sufficient for us and He Is the Best Disposer of affairs,\" was said by Abraham when he was thrown into the fire; and it was said by Muhammad when they (i.e. hypocrites) said, \"A great army is gathering against you, therefore, fear them,\" but it only increased their faith and they said: \"Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).\" (3.173)",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11392"
      ]
    },
    {
      "hadith_no": "4697",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا بيان، أن وبرة، حدثه قال حدثني سعيد بن جبير، قال خرج علينا أو إلينا ابن عمر، فقال رجل كيف ترى في قتال الفتنة‏.‏ فقال وهل تدري ما الفتنة كان محمد صلى الله عليه وسلم يقاتل المشركين، وكان الدخول عليهم فتنة، وليس كقتالكم على الملك‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Umar came to us and a man said (to him), \"What do you think about 'Qit-alal-Fitnah' (fighting caused by afflictions).\" Ibn `Umar said (to him), \"And do you understand what an affliction is? Muhammad used to fight against the pagans, and his fighting with them was an affliction, (and his fighting was) not like your fighting which is carried on for the sake of ruling.\"",
      "chain": [
        "30184",
        "20321",
        "11326",
        "11662",
        "11050"
      ]
    },
    {
      "hadith_no": "4937",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن حصين، عن عمرو بن ميمون، قال قال عمر رضى الله عنه أوصي الخليفة بالمهاجرين الأولين أن يعرف لهم حقهم، وأوصي الخليفة بالأنصار الذين تبوءوا الدار والإيمان من قبل أن يهاجر النبي صلى الله عليه وسلم أن يقبل من محسنهم ويعفو عن مسيئهم‏.‏",
      "text_en": " Narrated `Umar:                     I recommend that my successor should take care of and secure the rights of the early emigrants; and I also advise my successor to be kind to the Ansar who had homes (in Medina) and had adopted the Faith, before the Prophet migrated to them, and to accept the good from their good ones and excuse their wrong doers.",
      "chain": [
        "30184",
        "20436",
        "15097",
        "11382",
        "3"
      ]
    },
    {
      "hadith_no": "5001",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأسود بن قيس، قال سمعت جندب بن سفيان  رضى الله عنه  قال اشتكى رسول الله صلى الله عليه وسلم فلم يقم ليلتين أو ثلاثا، فجاءت امرأة فقالت يا محمد إني لأرجو أن يكون شيطانك قد تركك، لم أره قربك منذ ليلتين أو ثلاثا‏.‏ فأنزل الله عز وجل ‏{‏والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
      "text_en": " Narrated Jundub bin Sufyan:                     Once Allah's Apostle became sick and could not offer his night prayer (Tahajjud) for two or three nights. Then a lady (the wife of Abu Lahab) came and said, \"O Muhammad! I think that your Satan has forsaken you, for I have not seen him with you for two or three nights!\" On that Allah revealed: 'By the fore-noon, and by the night when it darkens, your Lord (O Muhammad) has neither forsaken you, nor hated you.' (93.1-3)",
      "chain": [
        "30184",
        "20321",
        "11323"
      ]
    },
    {
      "hadith_no": "5129",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، أخبرنا ابن شهاب، سمع سعيد بن المسيب، يقول سمعت سعد بن أبي وقاص، يقول رد رسول الله صلى الله عليه وسلم على عثمان بن مظعون التبتل، ولو أذن له لاختصينا‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     Allah's Apostle forbade `Uthman bin Maz'un to abstain from marrying (and other pleasures) and if he had allowed him, we would have gotten ourselves castrated.",
      "chain": [
        "30184",
        "20150",
        "11013",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "5422",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، حدثنا ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال أتى النبي صلى الله عليه وسلم رجل فقال هلكت‏.‏ قال ‏\"‏ ولم ‏\"‏‏.‏ قال وقعت على أهلي في رمضان‏.‏ قال ‏\"‏ فأعتق رقبة ‏\"‏‏.‏ قال ليس عندي‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏‏.‏ قال لا أستطيع‏.‏ قال ‏\"‏ فأطعم ستين مسكينا ‏\"‏‏.‏ قال لا أجد‏.‏ فأتي النبي صلى الله عليه وسلم بعرق فيه تمر فقال ‏\"‏ أين السائل ‏\"‏‏.‏ قال ها أنا ذا‏.‏ قال ‏\"‏ تصدق بهذا ‏\"‏‏.‏ قال على أحوج منا يا رسول الله فوالذي بعثك بالحق ما بين لابتيها أهل بيت أحوج منا فضحك النبي صلى الله عليه وسلم حتى بدت أنيابه قال ‏\"‏ فأنتم إذا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet and said, \"I am ruined!\" The Prophet said, \"Why?\" He said, \"I had sexual intercourse with my wife while fasting (in the month of Ramadan).\" The Prophet said to him, \"Manumit a slave (as expiation).\" He replied, \"I cannot afford that.\" The Prophet said, \"Then fast for two successive months.\" He said, \"I cannot.\" The Prophet said, \"Then feed sixty poor persons.\" He said, \"I have nothing to do that.\" In the meantime a basket full of dates was brought to the Prophet . He said, \"Where is the questioner.\" The man said, \"I am here.\" The Prophet said (to him), \"Give this (basket of dates) in charity (as expiation).\" He said, \"O Allah's Apostle! Shall I give it to poorer people than us? By Him Who sent you with the Truth, there is no family between Medina's two mountains poorer than us.\" The Prophet smiled till his pre-molar teeth became visible. He then said, \"Then take it.\"",
      "chain": [
        "30184",
        "20150",
        "11013",
        "10561",
        "13"
      ]
    }
  ],
  "total_hadiths": 247
}