{
  "id": "30189",
  "name": "al-Hasan bin al-Rabi' al-Bajli الحسن بن الربيع",
  "full_name": "al-Hasan bin al-Rabi' al-Bajli الحسن بن الربيع",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "221",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Kufa",
      "al_Burani"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Bajli",
        "ar": "al-Bajli",
        "ckb": "al-Bajli"
      },
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      },
      {
        "en": "al_Burani",
        "ar": "al_Burani",
        "ckb": "al_Burani"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20533",
      "name": "al-Harith bin 'Ubaid al-Ayadi الحارث بن عبيد الإيادي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [Shafi'i]",
        "ar": "القرن الثالث الهجري [شافعي]",
        "ckb": "سەدەی سێیەمی كۆچی [شافیعی]"
      }
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3208",
      "hadith_no": "3208",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن زيد بن وهب، قال عبد الله حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق قال ‏\"‏ إن أحدكم يجمع خلقه في بطن أمه أربعين يوما، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يبعث الله ملكا، فيؤمر بأربع كلمات، ويقال له اكتب عمله ورزقه وأجله وشقي أو سعيد‏.‏ ثم ينفخ فيه الروح، فإن الرجل منكم ليعمل حتى ما يكون بينه وبين الجنة إلا ذراع، فيسبق عليه كتابه، فيعمل بعمل أهل النار، ويعمل حتى ما يكون بينه وبين النار إلا ذراع، فيسبق عليه الكتاب، فيعمل بعمل أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mus'ud:                     Allah's Apostle, the true and truly inspired said, \"(The matter of the Creation of) a human being is put together in the womb of the mother in forty days, and then he becomes a clot of thick blood for a similar period, and then a piece of flesh for a similar period. Then Allah sends an angel who is ordered to write four things. He is ordered to write down his (i.e. the new creature's) deeds, his livelihood, his (date of) death, and whether he will be blessed or wretched (in religion). Then the soul is breathed into him. So, a man amongst you may do (good deeds till there is only a cubit between him and Paradise and then what has been written for him decides his behavior and he starts doing (evil) deeds characteristic of the people of the (Hell) Fire. And similarly a man amongst you may do (evil) deeds till there is only a cubit between him and the (Hell) Fire, and then what has been written for him decides his behavior, and he starts doing deeds characteristic of the people of Paradise.\"",
      "usc_msa_ref": "430",
      "chain": [
        "30189",
        "20327",
        "11060",
        "11341",
        "16"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3291",
      "hadith_no": "3291",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، قال قالت عائشة  رضى الله عنها  سألت النبي صلى الله عليه وسلم عن التفات الرجل في الصلاة‏.‏ فقال ‏\"‏ هو اختلاس يختلس الشيطان من صلاة أحدكم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet about one's looking here and there during the prayer. He replied, \"It is what Satan steals from the prayer of any one of you.\"",
      "usc_msa_ref": "511",
      "chain": [
        "30189",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5019",
      "hadith_no": "5019",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت ما صلى النبي صلى الله عليه وسلم صلاة بعد أن نزلت عليه ‏{‏إذا جاء نصر الله والفتح‏}‏ إلا يقول فيها ‏\"‏ سبحانك ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     \"When the \"Surat-An-Nasr\", 'When comes the Help of Allah and the conquest,' had been revealed to the Prophet he did not offer any prayer except that he said therein, \"Subhanka Rabbana wa bihamdika; Allahumma ighfirli (I testify the Uniqueness of our Lord, and all the praises are for Him: O Allah, forgive me!\")",
      "usc_msa_ref": "491",
      "chain": [
        "30189",
        "20327",
        "11060",
        "11392",
        "11018",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5230",
      "hadith_no": "5230",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأشعث، عن معاوية بن سويد، قال البراء بن عازب  رضى الله عنهما  أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع، أمرنا بعيادة المريض، واتباع الجنازة، وتشميت العاطس، وإبرار القسم، ونصر المظلوم، وإفشاء السلام، وإجابة الداعي، ونهانا عن خواتيم الذهب، وعن آنية الفضة، وعن المياثر، والقسية، والإستبرق والديباج‏.‏ تابعه أبو عوانة والشيباني عن أشعث في إفشاء السلام‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet ordered us to do seven (things) and forbade us from seven. He ordered us to visit the patients, to follow the funeral procession, to reply to the sneezer (i.e., say to him, 'Yarhamuka-l-lah (May Allah bestow His Mercy upon you), if he says 'Al-hamduli l-lah' (Praise be to Allah), to help others to fulfill their oaths, to help the oppressed, to greet (whomever one should meet), and to accept the invitation (to a wedding banquet). He forbade us to wear golden rings, to use silver utensils, to use Maiyathir (cushions of silk stuffed with cotton and placed under the rider on the saddle), the Qasiyya (linen clothes containing silk brought from an Egyptian town), the Istibraq (thick silk) and the Dibaj (another kind of silk). (See Hadith No. 539 and 753).",
      "usc_msa_ref": "",
      "chain": [
        "30189",
        "20327",
        "485",
        "400"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6467",
      "hadith_no": "6467",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن عاصم، عن أنس  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية يقال لهم القراء فأصيبوا، فما رأيت النبي صلى الله عليه وسلم وجد على شىء ما وجد عليهم، فقنت شهرا في صلاة الفجر ويقول ‏\"‏ إن عصية عصوا الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet sent a Sariya (an army detachment) consisting of men called Al-Qurra', and all of them were martyred. I had never seen the Prophet so sad over anything as he was over them. So he said Qunut (invocation in the prayer) for one month in the Fajr prayer, invoking for Allah's wrath upon the tribe of 'Usaiya, and he used to say, \"The people of 'Usaiya have disobeyed Allah and His Apostle.\"",
      "usc_msa_ref": "403",
      "chain": [
        "30189",
        "20327",
        "11080",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6521",
      "hadith_no": "6521",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن زيد بن وهب، قال قال أبو ذر كنت أمشي مع النبي صلى الله عليه وسلم في حرة المدينة فاستقبلنا أحد فقال ‏\"‏ يا أبا ذر ‏\"‏‏.‏ قلت لبيك يا رسول الله‏.‏ قال ‏\"‏ ما يسرني أن عندي مثل أحد هذا ذهبا، تمضي على ثالثة وعندي منه دينار، إلا شيئا أرصده لدين، إلا أن أقول به في عباد الله هكذا وهكذا وهكذا ‏\"‏‏.‏ عن يمينه وعن شماله ومن خلفه‏.‏ ثم مشى فقال ‏\"‏ إن الأكثرين هم الأقلون يوم القيامة إلا من قال هكذا وهكذا وهكذا  عن يمينه وعن شماله ومن خلفه  وقليل ما هم ‏\"‏‏.‏ ثم قال لي ‏\"‏ مكانك لا تبرح حتى آتيك ‏\"‏‏.‏ ثم انطلق في سواد الليل حتى توارى فسمعت صوتا قد ارتفع، فتخوفت أن يكون قد عرض للنبي صلى الله عليه وسلم فأردت أن آتيه فذكرت قوله لي ‏\"‏ لا تبرح حتى آتيك ‏\"‏ فلم أبرح حتى أتاني، قلت يا رسول الله لقد سمعت صوتا تخوفت، فذكرت له فقال ‏\"‏ وهل سمعته ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ ذاك جبريل أتاني فقال من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     While I was walking with the Prophet in the Harra of Medina, Uhud came in sight. The Prophet said, \"O Abu Dhar!\" I said, \"Labbaik, O Allah's Apostle!\" He said, \"I would not like to have gold equal to this mountain of Uhud, unless nothing of it, not even a single Dinar of it remains with me for more than three days, except something which I will keep for repaying debts. I would have spent all of it (distributed it) amongst Allah's Slaves like this, and like this, and like this.\" The Prophet pointed out with his hand towards his right, his left and his back (while illustrating it). He proceeded with his walk and said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except those who spend their wealth like this, and like this, and like this, to their right, left and back, but such people are few in number.\" Then he said to me, \"Stay at your place and do not leave it till I come back.\" Then he proceeded in the darkness of the night till he went out of sight, and then I heard a loud voice, and was afraid that something might have happened to the Prophet .1 intended to go to him, but I remembered what he had said to me, i.e. 'Don't leave your place till I come back to you,' so I remained at my place till he came back to me. I said, \"O Allah's Apostle! I heard a voice and I was afraid.\" So I mentioned the whole story to him. He said, \"Did you hear it?\" I replied, \"Yes.\" He said, \"It was Gabriel who came to me and said, 'Whoever died without joining others in worship with Allah, will enter Paradise.' I asked (Gabriel), 'Even if he had committed theft or committed illegal sexual intercourse? Gabriel said, 'Yes, even if he had committed theft or committed illegal sexual intercourse.\"",
      "usc_msa_ref": "451",
      "chain": [
        "30189",
        "20327",
        "11060",
        "11341"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-abi-daud-412",
      "hadith_no": "412",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن الربيع، حدثني ابن المبارك، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدرك ومن أدرك من الفجر ركعة قبل أن تطلع الشمس فقد أدرك ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone says a rak'ah of the 'Asr prayer before sunset, he has observed (the 'Asr prayer), and if anyone performs a rak'ah of the Fajr prayer, he has observed (the Fajr prayer).",
      "usc_msa_ref": "",
      "chain": [
        "30189",
        "20025",
        "20115",
        "11433",
        "11053",
        "17",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3515",
      "hadith_no": "3515",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا الحسن بن الربيع، حدثنا ابن إدريس، عن ابن جريج، عن ابن شهاب الزهري، عن أبي سلمة، أو عن سعيد بن المسيب، أو عنهما جميعا عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قسمت الأرض وحدت فلا شفعة فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When land has been divided and boundaries have been set up, there is no right of pre-emption in it.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30189",
        "20102",
        "11070",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-4176",
      "hadith_no": "4176",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرني محمد بن يحيى بن محمد، قال حدثنا الحسن بن الربيع، قال حدثنا أبو الأحوص، عن الأعمش، عن أبي وائل، عن أبي نخيلة، عن جرير، قال أتيت رسول الله صلى الله عليه وسلم فذكر نحوه ‏.‏",
      "text_en": " It was narrated that Jarir said:                     \"I came to the Messenger of Allah\" and he mentioned something similar.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30189",
        "20327",
        "11060",
        "11353",
        "4057"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1329",
      "hadith_no": "1329",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن أبي القاسم أبو الأحوص، حدثنا الحسن بن الربيع، حدثنا عبد الله بن إدريس، حدثنا حصين، عن حبيب بن أبي ثابت، عن ابن عباس، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله لقد جئتك من عند قوم ما يتزود لهم راع ولا يخطر لهم فحل ‏.‏ فصعد المنبر فحمد الله ثم قال ‏\"‏ اللهم اسقنا غيثا مغيثا مريئا طبقا مريعا غدقا عاجلا غير رائث ‏\"‏ ‏.‏ ثم نزل فما يأتيه أحد من وجه من الوجوه إلا قالوا قد أحيينا ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A Bedouin came to the Prophet(ﷺ) and said: ‘O Messenger of Allah, I have come to you frompeoplewho have no place to graze their flocks and even their malecamelshave become weak. He mounted the pulpit and praised Allah,then hesaid: ‘O Allah, send upon us all abundant, wholesome rain,productiveand plentiful, sooner rather than later.’ Then the raincame down, andno one came to him from any direction but they said:‘We have beenrevived.’”",
      "usc_msa_ref": "",
      "chain": [
        "30189",
        "20102",
        "15097",
        "11331",
        "17"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2196",
      "hadith_no": "2196",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا الحسن بن الربيع، عن عبد الله بن إدريس، عن يزيد بن أبي زياد، بإسناده نحوه ‏.‏ قال يزيد بن أبي زياد يعني لا هجرة من دار قد أسلم أهلها ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30189",
        "20102"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 11,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}