{
  "id": "30188",
  "name": "al-Hasan bin Bashr bin Slm الحسن بن بشر بن سلم",
  "full_name": "al-Hasan bin Bashr bin Slm الحسن بن بشر بن سلم",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "221",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  ت  س  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Hamdani",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20464",
      "name": "al-Ma'afa bin 'Imaran bin Naufayl المعافى بن عمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19825",
      "name": "Najih bin 'Abdur Rahman نجيح بن عبد الرحمن السندي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31130",
      "name": "al-Fadl bin Abi Talb Akhw الفضل بن أبي طالب",
      "grade": "3rd Century AH"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "32250",
      "name": "'Ali bin 'Abdul 'Aziz al-Baghvi علي بن عبد العزيز البغوي",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1018",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن بشر، قال حدثنا معافى بن عمران، عن الأوزاعي، عن إسحاق بن عبد الله، عن أنس بن مالك، أن رجلا، شكا إلى النبي صلى الله عليه وسلم هلاك المال وجهد العيال، فدعا الله يستسقي، ولم يذكر أنه حول رداءه ولا استقبل القبلة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I p man complained to the Prophet about the destruction of livestock and property and the hunger of the offspring. So he invoked (Allah for rain. The narrator (Anas) did not mention that the Prophet had worn his cloak inside out or faced the Qibla.",
      "chain": [
        "30188",
        "20464",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3810",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحسن بن بشر، حدثنا المعافى، عن عثمان بن الأسود، عن ابن أبي مليكة، قال أوتر معاوية بعد العشاء بركعة وعنده مولى لابن عباس، فأتى ابن عباس فقال دعه، فإنه صحب رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn Abu Mulaika:                     Muawiya offered one rak`a witr prayer after the `Isha prayer, and at that time a freed slave of Ibn `Abbas was present. He (i.e. the slave) went to Ibn `Abbas (and told him that Muawiya offered one rak`a witr prayer). Ibn `Abbas said, \"Leave him, for he was in the company of Allah's Apostle.\"",
      "chain": [
        "30188",
        "20197",
        "11090"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "قال أبو إسحاق إبراهيم حدثنا الحسن بن بشر بن القاسم، حدثنا أبو أسامة، بهذا سواء وحدثنيه سويد بن سعيد، حدثنا علي بن مسهر، عن هشام بن عروة، بهذا الإسناد نحوه ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of 'Urwa with the same chain of transmitters.",
      "chain": [
        "30188",
        "20345",
        "11065"
      ]
    },
    {
      "hadith_no": "4320",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "قال أبو إسحاق إبراهيم حدثنا الحسن بن بشر، قال حدثنا سفيان، بهذا الحديث",
      "text_en": "",
      "chain": [
        "30188"
      ]
    },
    {
      "hadith_no": "4830",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "قال أبو إسحاق حدثنا الحسن بن بشر، حدثنا عبد الله بن نمير، عن عبيد الله، عن نافع، عن ابن عمر، بهذا مثل حديث الليث عن نافع، ‏.‏",
      "text_en": "",
      "chain": [
        "11049",
        "30188",
        "20331",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "5888",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه أبو كريب، حدثنا ابن نمير، وأبو أسامة عن هشام، بهذا الإسناد ‏.‏ وفي حديث ابن نمير صبت الماء بينها وبين جيبها ‏.‏ ولم يذكر في حديث أبي أسامة ‏\"‏ أنها من فيح جهنم ‏\"‏ ‏.‏ قال أبو أحمد قال إبراهيم حدثنا الحسن بن بشر حدثنا أبو أسامة بهذا الإسناد ‏.‏",
      "text_en": " Hisham reported this hadith with the same chain of transmitters. In the hadith transmitted on the authority of Ibn Numair (the words are):                     \" She poured water on her sides and in the opening of the shirt at the uppermost part of the chest.\" There is no mention of these words:\" It is from the vehemence of the heat of the Hell.\" This hadith has been narrated on the authority of Abu Usama with the same chain of transmitters.",
      "chain": [
        "30216",
        "30212",
        "20318",
        "20355",
        "11051",
        "30188"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثني الحسن بن بشر، حدثنا شريك، عن الأعمش، عن سعد بن عبيدة، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة قاضيان في النار وقاض في الجنة رجل قضى بغير الحق فعلم ذاك فذاك في النار وقاض لا يعلم فأهلك حقوق الناس فهو في النار وقاض قضى بالحق فذلك في الجنة ‏\"‏ ‏.‏",
      "text_en": " [Ibn Buraidah narrated from his father that the Prophet (ﷺ) said:                      \"The judges are three: Two judges that are in the Fire, and a judge that is in Paradise. A man who judges without the truth, and he knows that. This one is in the Fire. One who judges while not knowing, ruining the rights of the people. So he is in the Fire. A judge who judges with the truth, that is the one in Paradise.\"] (Daif)",
      "chain": [
        "34188",
        "30188",
        "20587",
        "11060",
        "11344",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو زرعة، والفضل بن أبي طالب، وغير، واحد، قالوا حدثنا الحسن بن بشر، عن الحكم بن عبد الملك، عن قتادة، عن عمران بن حصين، أن النبي صلى الله عليه وسلم قرأ‏:‏ ‏(‏وترى الناس سكارى وما هم بسكارى ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن وهكذا روى الحكم بن عبد الملك عن قتادة ‏.‏ ولا نعرف لقتادة سماعا من أحد من أصحاب النبي صلى الله عليه وسلم إلا من أنس وأبو الطفيل ‏.‏ وهو عندي حديث مختصر إنما يروى عن قتادة عن الحسن عن عمران بن حصين قال كنا مع النبي صلى الله عليه وسلم في السفر فقرأ ‏:‏ ‏(‏يا أيها الناس اتقوا ربكم ‏)‏ الحديث بطوله وحديث الحكم بن عبد الملك عندي مختصر من هذا الحديث ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     \"The Prophet (ﷺ) recited: You shall see mankind as if in a drunken state, yet they will not be in a drunken state. (22:2)",
      "chain": [
        "30554",
        "31130",
        "30188",
        "24090",
        "11019",
        "123"
      ]
    },
    {
      "hadith_no": "4067",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو زرعة، حدثنا الحسن بن بشر، حدثنا الحكم بن عبد الملك، عن قتادة، عن أنس بن مالك، قال لما أمر رسول الله صلى الله عليه وسلم ببيعة الرضوان كان عثمان بن عفان رسول رسول الله صلى الله عليه وسلم إلى أهل مكة قال فبايع الناس قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن عثمان في حاجة الله وحاجة رسوله ‏\"‏ ‏.‏ فضرب بإحدى يديه على الأخرى فكانت يد رسول الله صلى الله عليه وسلم لعثمان خيرا من أيديهم لأنفسهم ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that when the Messenger of Allah (ﷺ) ordered the pledge of Ridwan, 'Uthman bin 'Affan was the messenger of the Messenger of Allah (ﷺ) to the people of Makkah. He said: \"So the Messenger of Allah (ﷺ) said: 'Indeed 'Uthman is busy with the affair of Allah and the affair of His Messenger' then he (ﷺ) put one of his hands on the other. The hand of the Messenger of Allah (ﷺ) on behalf of 'Uthman, was better than their own hands for themselves.",
      "chain": [
        "30554",
        "30188",
        "24090",
        "11019",
        "19"
      ]
    }
  ],
  "total_hadiths": 9
}