{
  "id": "30180",
  "name": "Mu'ammal bin Hisham",
  "full_name": "Mu'ammal bin Hisham (مؤمل بن هشام)",
  "grade": "Thiqah (Trustworthy)",
  "biography": {
    "birth": {
      "date_hijri": "",
      "date_gregorian": "",
      "date_display": null,
      "place": ""
    },
    "death": {
      "date_hijri": "",
      "date_gregorian": "",
      "date_display": null,
      "place": "",
      "reason": ""
    },
    "places_of_stay": [],
    "area_of_interest": [],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1143",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مؤمل بن هشام، قال حدثنا إسماعيل، قال حدثنا عوف، قال حدثنا أبو رجاء، قال حدثنا سمرة بن جندب  رضى الله عنه  عن النبي صلى الله عليه وسلم في الرؤيا قال ‏\"‏ أما الذي يثلغ رأسه بالحجر فإنه يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     The Prophet said in his narration of a dream that he saw, \"He whose head was being crushed with a stone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "1472",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مؤمل، حدثنا إسماعيل، عن أيوب، عن عطاء بن أبي رباح، قال قال ابن عباس  رضى الله عنهما  أشهد على رسول الله صلى الله عليه وسلم لصلى قبل الخطبة، فرأى أنه لم يسمع النساء، فأتاهن ومعه بلال ناشر ثوبه فوعظهن، وأمرهن أن يتصدقن، فجعلت المرأة تلقي، وأشار أيوب إلى أذنه وإلى حلقه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I am a witness that Allah's Apostle offered the Id prayer before delivering the sermon and then he thought that the women would not be able to hear him (because of the distance), so he went to them along with Bilal who was spreading his garment. The Prophet advised and ordered them to give in charity. So the women started giving their ornaments (in charity). (The sub-narrator Aiyub pointed towards his ears and neck meaning that they gave ornaments from those places such as earrings and necklaces.)",
      "chain": [
        "30180",
        "20208",
        "11015",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أيوب، عن حفصة، قالت كنا نمنع عواتقنا أن يخرجن، فقدمت امرأة فنزلت قصر بني خلف، فحدثت أن أختها كانت تحت رجل من أصحاب رسول الله صلى الله عليه وسلم قد غزا مع رسول الله صلى الله عليه وسلم ثنتى عشرة غزوة، وكانت أختي معه في ست غزوات، قالت كنا نداوي الكلمى ونقوم على المرضى‏.‏ فسألت أختي رسول الله صلى الله عليه وسلم فقالت هل على إحدانا بأس إن لم يكن لها جلباب أن لا تخرج قال ‏\"‏ لتلبسها صاحبتها من جلبابها، ولتشهد الخير، ودعوة المؤمنين ‏\"‏‏.‏ فلما قدمت أم عطية  رضى الله عنها  سألنها  أو قالت سألناها  فقالت وكانت لا تذكر رسول الله صلى الله عليه وسلم إلا قالت بأبي‏.‏ فقلنا أسمعت رسول الله صلى الله عليه وسلم يقول كذا وكذا قالت نعم بأبي‏.‏ فقال ‏\"‏ لتخرج العواتق ذوات الخدور  أو العواتق وذوات الخدور  والحيض، فيشهدن الخير، ودعوة المسلمين، ويعتزل الحيض المصلى ‏\"‏‏.‏ فقلت الحائض‏.‏ فقالت أو ليس تشهد عرفة، وتشهد كذا وتشهد كذا",
      "text_en": " Narrated Hafsa:                     (On `Id) We used to forbid our virgins to go out (for `Id prayer). A lady came and stayed at the Palace of Bani Khalaf. She mentioned that her sister was married to one of the companions of Allah's Apostle who participated in twelve Ghazawats along with Allah's Apostle and her sister was with him in six of them. She said, \"We used to dress the wounded and look after the patients.\" She (her sister) asked Allah's Apostle , \"Is there any harm for a woman to stay at home if she doesn't have a veil?\" He said, \"She should cover herself with the veil of her companion and she should take part in the good deeds and in the religious gatherings of the believers.\" When Um 'Atiyya came, I asked her. \"Did you hear anything about that?\" Um 'Atiyya said, \"Bi Abi\" and she never mentioned the name of Allah's Apostle without saying \"Bi Abi\" (i.e. 'Let my father be sacrificed for you'). We asked her, \"Have you heard Allah's Apostle saying so and so (about women)?\" She replied in the affirmative and said, \"Let my father be sacrificed for him. He told us that unmarried mature virgins who stay often screened or unmarried young virgins and mature girls who stay often screened should come out and take part in the good deeds and in the religious gatherings of the believers. But the menstruating women should keep away from the Musalla (praying place).\" I asked her, \"The menstruating women?\" She replied, \"Don't they present themselves at `Arafat and at such and such places?\"",
      "chain": [
        "30180",
        "20208",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مؤمل، حدثنا إسماعيل، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني الليلة آتيان، فأتينا على رجل طويل، لا أكاد أرى رأسه طولا، وإنه إبراهيم صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     Allah's Apostle said, \"Two persons came to me at night (in dream) (and took me along with them). We passed by a tall man who was so tall that I was not able to see his head and that person was Abraham.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "4720",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مؤمل  هو ابن هشام  حدثنا إسماعيل بن إبراهيم، وحدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم لنا ‏\"‏ أتاني الليلة آتيان فابتعثاني، فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ فوقعوا فيه ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة قالا لي هذه جنة عدن، وهذاك منزلك قالا أما القوم الذين كانوا شطر منهم حسن وشطر منهم قبيح فإنهم خلطوا عملا صالحا وآخر سيئا تجاوز الله عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     Allah's Apostle said, \"Tonight two (visitors) came to me (in my dream) and took me to a town built with gold bricks and silver bricks. There we met men who, half of their bodies, look like the mosthandsome human beings you have ever seen, and the other half, the ugliest human beings you have ever seen. Those two visitors said to those men, 'Go and dip yourselves in that river. So they dipped themselves therein and then came to us, their ugliness having disappeared and they were in the mosthandsome shape. The visitors said, 'The first is the Garden of Eden and that is your dwelling place.' Then they added, 'As for those people who were half ugly and half handsome, they were those who mixed good deeds and bad deeds, but Allah forgave them.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "7134",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني مؤمل بن هشام أبو هشام، حدثنا إسماعيل بن إبراهيم، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم مما يكثر أن يقول لأصحابه ‏\"‏ هل رأى أحد منكم من رؤيا ‏\"‏‏.‏ قال فيقص عليه من شاء الله أن يقص، وإنه قال ذات غداة ‏\"‏ إنه أتاني الليلة آتيان، وإنهما ابتعثاني، وإنهما قالا لي انطلق‏.‏ وإني انطلقت معهما، وإنا أتينا على رجل مضطجع، وإذا آخر قائم عليه بصخرة، وإذا هو يهوي بالصخرة لرأسه، فيثلغ رأسه فيتهدهد الحجر ها هنا، فيتبع الحجر فيأخذه، فلا يرجع إليه حتى يصح رأسه كما كان، ثم يعود عليه، فيفعل به مثل ما فعل المرة الأولى‏.‏ قال قلت لهما سبحان الله ما هذان قال قالا لي انطلق  قال  فانطلقنا فأتينا على رجل مستلق لقفاه، وإذا آخر قائم عليه بكلوب من حديد، وإذا هو يأتي أحد شقى وجهه فيشرشر شدقه إلى قفاه، ومنخره إلى قفاه وعينه إلى قفاه  قال وربما قال أبو رجاء فيشق  قال ثم يتحول إلى الجانب الآخر، فيفعل به مثل ما فعل بالجانب الأول، فما يفرغ من ذلك الجانب حتى يصح ذلك الجانب كما كان، ثم يعود عليه فيفعل مثل ما فعل المرة الأولى‏.‏ قال قلت سبحان الله ما هذان قال قالا لي انطلق‏.‏ فانطلقنا فأتينا على مثل التنور  قال فأحسب أنه كان يقول  فإذا فيه لغط وأصوات  قال  فاطلعنا فيه، فإذا فيه رجال ونساء عراة، وإذا هم يأتيهم لهب من أسفل منهم، فإذا أتاهم ذلك اللهب ضوضوا  قال  قلت لهما ما هؤلاء قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على نهر  حسبت أنه كان يقول  أحمر مثل الدم، وإذا في النهر رجل سابح يسبح، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة، وإذا ذلك السابح يسبح ما يسبح، ثم يأتي ذلك الذي قد جمع عنده الحجارة فيفغر له فاه فيلقمه حجرا فينطلق يسبح، ثم يرجع إليه، كلما رجع إليه فغر له فاه فألقمه حجرا  قال  قلت لهما ما هذان قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على رجل كريه المرآة كأكره ما أنت راء رجلا مرآة، وإذا عنده نار يحشها ويسعى حولها  قال  قلت لهما ما هذا قال قالا لي انطلق انطلق‏.‏ فانطلقنا فأتينا على روضة معتمة فيها من كل نور الربيع، وإذا بين ظهرى الروضة رجل طويل لا أكاد أرى رأسه طولا في السماء، وإذا حول الرجل من أكثر ولدان رأيتهم قط  قال  قلت لهما ما هذا ما هؤلاء قال قالا لي انطلق انطلق‏.‏  قال  فانطلقنا فانتهينا إلى روضة عظيمة لم أر روضة قط أعظم منها ولا أحسن‏.‏  قال  قالا لي ارق فيها‏.‏ قال فارتقينا فيها فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فأتينا باب المدينة فاستفتحنا ففتح لنا، فدخلناها فتلقانا فيها رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء  قال  قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ قال وإذا نهر معترض يجري كأن ماءه المحض في البياض، فذهبوا فوقعوا فيه، ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة  قال  قالا لي هذه جنة عدن، وهذاك منزلك‏.‏ قال فسما بصري صعدا، فإذا قصر مثل الربابة البيضاء  قال  قالا هذاك منزلك‏.‏ قال قلت لهما بارك الله فيكما، ذراني فأدخله‏.‏ قالا أما الآن فلا وأنت داخله‏.‏ قال قلت لهما فإني قد رأيت منذ الليلة عجبا، فما هذا الذي رأيت قال قالا لي أما إنا سنخبرك، أما الرجل الأول الذي أتيت عليه يثلغ رأسه بالحجر، فإنه الرجل يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة، وأما الرجل الذي أتيت عليه يشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، فإنه الرجل يغدو من بيته فيكذب الكذبة تبلغ الآفاق، وأما الرجال والنساء العراة الذين في مثل بناء التنور فإنهم الزناة والزواني‏.‏ وأما الرجل الذي أتيت عليه يسبح في النهر ويلقم الحجر، فإنه آكل الربا، وأما الرجل الكريه المرآة الذي عند النار يحشها ويسعى حولها، فإنه مالك خازن جهنم، وأما الرجل الطويل الذي في الروضة فإنه إبراهيم صلى الله عليه وسلم وأما الولدان الذين حوله فكل مولود مات على الفطرة ‏\"‏‏.‏ قال فقال بعض المسلمين يا رسول الله وأولاد المشركين فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأولاد المشركين‏.‏ وأما القوم الذين كانوا شطر منهم حسنا وشطر منهم قبيحا، فإنهم قوم خلطوا عملا صالحا وآخر سيئا، تجاوز الله عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     Allah's Apostle very often used to ask his companions, \"Did anyone of you see a dream?\" So dreams would be narrated to him by those whom Allah wished to tell. One morning the Prophet said, \"Last night two persons came to me (in a dream) and woke me up and said to me, 'Proceed!' I set out with them and we came across a man Lying down, and behold, another man was standing over his head, holding a big rock. Behold, he was throwing the rock at the man's head, injuring it. The rock rolled away and the thrower followed it and took it back. By the time he reached the man, his head returned to the normal state. The thrower then did the same as he had done before. I said to my two companions, 'Subhan Allah! Who are these two persons?' They said, 'Proceed!' So we proceeded and came to a man Lying flat on his back and another man standing over his head with an iron hook, and behold, he would put the hook in one side of the man's mouth and tear off that side of his face to the back (of the neck) and similarly tear his nose from front to back and his eye from front to back. Then he turned to the other side of the man's face and did just as he had done with the other side. He hardly completed this side when the other side returned to its normal state. Then he returned to it to repeat what he had done before. I said to my two companions, 'Subhan Allah! Who are these two persons?' They said to me, 'Proceed!' So we proceeded and came across something like a Tannur (a kind of baking oven, a pit usually clay-lined for baking bread).\" I think the Prophet said, \"In that oven t here was much noise and voices.\" The Prophet added, \"We looked into it and found naked men and women, and behold, a flame of fire was reaching to them from underneath, and when it reached them, they cried loudly. I asked them, 'Who are these?' They said to me, 'Proceed!' And so we proceeded and came across a river.\" I think he said, \".... red like blood.\" The Prophet added, \"And behold, in the river there was a man swimming, and on the bank there was a man who had collected many stones. Behold. while the other man was swimming, he went near him. The former opened his mouth and the latter (on the bank) threw a stone into his mouth whereupon he went swimming again. He returned and every time the performance was repeated. I asked my two companions, 'Who are these (two) persons?' They replied, 'Proceed! Proceed!' And we proceeded till we came to a man with a repulsive appearance, the most repulsive appearance, you ever saw a man having! Beside him there was a fire and he was kindling it and running around it. I asked my companions, 'Who is this (man)?' They said to me, 'Proceed! Proceed!' So we proceeded till we reached a garden of deep green dense vegetation, having all sorts of spring colors. In the midst of the garden there was a very tall man and I could hardly see his head because of his great height, and around him there were children in such a large number as I have never seen. I said to my companions, 'Who is this?' They replied, 'Proceed! Proceed!' So we proceeded till we came to a majestic huge garden, greater and better than I have ever seen! My two companions said to me, 'Go up and I went up' The Prophet added, \"So we ascended till we reached a city built of gold and silver bricks and we went to its gate and asked (the gatekeeper) to open the gate, and it was opened and we entered the city and found in it, men with one side of their bodies as handsome as the handsomest person you have ever seen, and the other side as ugly as the ugliest person you have ever seen. My two companions ordered those men to throw themselves into the river. Behold, there was a river flowing across (the city), and its water was like milk in whiteness. Those men went and threw themselves in it and then returned to us after the ugliness (of their bodies) had disappeared and they became in the best shape.\" The Prophet further added, \"My two companions (angels) said to me, 'This place is the Eden Paradise, and that is your place.' I raised up my sight, and behold, there I saw a palace like a white cloud! My two companions said to me, 'That (palace) is your place.' I said to them, 'May Allah bless you both! Let me enter it.' They replied, 'As for now, you will not enter it, but you shall enter it (one day) I said to them, 'I have seen many wonders tonight. What does all that mean which I have seen?' They replied, 'We will inform you: As for the first man you came upon whose head was being injured with the rock, he is the symbol of the one who studies the Qur'an and then neither recites it nor acts on its orders, and sleeps, neglecting the enjoined prayers. As for the man you came upon whose sides of mouth, nostrils and eyes were torn off from front to back, he is the symbol of the man who goes out of his house in the morning and tells so many lies that it spreads all over the world. And those naked men and women whom you saw in a construction resembling an oven, they are the adulterers and the adulteresses. And the man whom you saw swimming in the river and given a stone to swallow, is the eater of usury (Riba). aand the bad looking man whom you saw near the fire kindling it and going round it, is Malik, the gatekeeper of Hell. And the tall man whom you saw in the garden, is Abraham and the children around him are those children who die with Al-Fitra (the Islamic Faith). The narrator added: Some Muslims asked the Prophet, \"O Allah's Apostle! What about the children of pagans?\" The Prophet replied, \"And also the children of pagans.\" The Prophet added, \"My two companions added, 'The men you saw half handsome and half ugly were those persons who had mixed an act that was good with another that was bad, but Allah forgave them.'\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "7171",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "وقال مؤمل حدثنا حماد بن زيد، حدثنا أيوب، ويونس، وهشام، ومعلى بن زياد، عن الحسن، عن الأحنف، عن أبي بكرة، عن النبي صلى الله عليه وسلم‏.‏ ورواه معمر عن أيوب‏.‏ ورواه بكار بن عبد العزيز عن أبيه عن أبي بكرة‏.‏",
      "text_en": " Narrated Al-Ahnaf:                     Abu Bakra said: The Prophet said (as above, 204).",
      "chain": [
        "30180",
        "20022",
        "11015",
        "20475",
        "11065",
        "11016",
        "11112",
        "3229"
      ]
    },
    {
      "hadith_no": "495",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن هشام، - يعني اليشكري - حدثنا إسماعيل، عن سوار أبي حمزة، - قال أبو داود وهو سوار بن داود أبو حمزة المزني الصيرفي - عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مروا أولادكم بالصلاة وهم أبناء سبع سنين واضربوهم عليها وهم أبناء عشر سنين وفرقوا بينهم في المضاجع ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: Command your children to pray when they become seven years old, and beat them for it (prayer) when they become ten years old; and arrange their beds (to sleep) separately.",
      "chain": [
        "30180",
        "20208",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "860",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن محمد بن إسحاق، حدثني علي بن يحيى بن خلاد بن رافع، عن أبيه، عن عمه، رفاعة بن رافع عن النبي صلى الله عليه وسلم بهذه القصة قال ‏\"‏ إذا أنت قمت في صلاتك فكبر الله تعالى ثم اقرأ ما تيسر عليك من القرآن ‏\"‏ ‏.‏ وقال فيه ‏\"‏ فإذا جلست في وسط الصلاة فاطمئن وافترش فخذك اليسرى ثم تشهد ثم إذا قمت فمثل ذلك حتى تفرغ من صلاتك ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted by Rifa’ah b Rafi through a different chain of narrators. This version has :                      When you get up to pray, say the takbir, exalting Allah; then recite the Qur’an as much as it is convenient for you. The version adds: When you sit in the middle of the prayer, do it completely(so that you are at rest) and spread your left thigh; then recite the tashahhud. Then if you get up (again), do in a similar way until you finish your prayer.",
      "chain": [
        "30180",
        "20208",
        "11107",
        "11120",
        "323"
      ]
    },
    {
      "hadith_no": "1061",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أيوب، عن نافع، قال نادى ابن عمر بالصلاة بضجنان ثم نادى أن صلوا في رحالكم قال فيه ثم حدث عن رسول الله صلى الله عليه وسلم أنه كان يأمر المنادي فينادي بالصلاة ثم ينادي ‏\"‏ أن صلوا في رحالكم ‏\"‏ ‏.‏ في الليلة الباردة وفي الليلة المطيرة في السفر ‏.‏ قال أبو داود ورواه حماد بن سلمة عن أيوب وعبيد الله قال فيه في السفر في الليلة القرة أو المطيرة ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Nafi' reported: Ibn Umar made the call to prayer at Dajnan (a place between Mecca and Medina). Then he announced: \"Offer prayer in your dwellings:\" He then narrated a tradition from the Messenger of Allah (ﷺ). He used to command an announcer who made the call to prayer. He then announced: \"Pray in your dwellings\" on a cold or rainy night during journey.Abu Dawud said: This tradition has been narrated by Hammad b. Salamah from Ayyub and 'Ubaid Allah. In his version he added: During journey on a cold or a rainy night.",
      "chain": [
        "30180",
        "20208",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "1179",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن هشام، حدثنا أبو الزبير، عن جابر، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم في يوم شديد الحر فصلى رسول الله صلى الله عليه وسلم بأصحابه فأطال القيام حتى جعلوا يخرون ثم ركع فأطال ثم رفع فأطال ثم ركع فأطال ثم رفع فأطال ثم سجد سجدتين ثم قام فصنع نحوا من ذلك فكان أربع ركعات وأربع سجدات ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Narrated Jabir:                     There was an eclipse of the sun in the time of the Messenger of Allah (ﷺ) on a hot day.  The Messenger of Allah (ﷺ)led his Companions in prayer and prolonged the standing until the people began to fall down.  He then bowed and prolonged it; then he raised his head and prolonged (the stay); then he bowed and prolonged it; then he raised his head and prolonged (the stay); then he made two prostrations and then stood up; then he did in the same manner.  He thus performed four bowings and four prostrations.  Then the narrator narrated the rest of the tradition.",
      "chain": [
        "30180",
        "20208",
        "20295",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1363",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل بن إبراهيم، عن منصور بن عبد الرحمن، عن أبي إسحاق الهمداني، عن الأسود بن يزيد، ‏:‏ أنه دخل على عائشة فسألها عن صلاة، رسول الله صلى الله عليه وسلم بالليل ‏.‏ فقالت ‏:‏ كان يصلي ثلاث عشرة ركعة من الليل، ثم إنه صلى إحدى عشرة ركعة، وترك ركعتين ثم قبض صلى الله عليه وسلم حين قبض وهو يصلي من الليل تسع ركعات، وكان آخر صلاته من الليل الوتر ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Al-Aswad ibn Yazid said that he entered upon Aisha and asked her about the prayer of the Messenger of Allah (ﷺ) during the night. She said: He used to pray thirteen rak'ahs during the night. Then he began to pray eleven rak'ahs and left two rak'ahs. When he died, he would pray nine rak'ahs during the night. His last prayer during the night was witr.",
      "chain": [
        "30180",
        "20208",
        "11565",
        "11049",
        "11054"
      ]
    },
    {
      "hadith_no": "2174",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا الجريري، ح وحدثنا مؤمل، حدثنا إسماعيل، ح وحدثنا موسى، حدثنا حماد، كلهم عن الجريري، عن أبي نضرة، حدثني شيخ، من طفاوة قال تثويت أبا هريرة بالمدينة فلم أر رجلا من أصحاب النبي صلى الله عليه وسلم أشد تشميرا ولا أقوم على ضيف منه فبينما أنا عنده يوما وهو على سرير له ومعه كيس فيه حصى أو نوى - وأسفل منه جارية له سوداء - وهو يسبح بها حتى إذا أنفد ما في الكيس ألقاه إليها فجمعته فأعادته في الكيس فدفعته إليه فقال ألا أحدثك عني وعن رسول الله صلى الله عليه وسلم قال قلت بلى ‏.‏ قال بينا أنا أوعك في المسجد إذ جاء رسول الله صلى الله عليه وسلم حتى دخل المسجد ‏.‏ فقال ‏\"‏ من أحس الفتى الدوسي ‏\"‏ ‏.‏ ثلاث مرات ‏.‏ فقال رجل يا رسول الله هو ذا يوعك في جانب المسجد فأقبل يمشي حتى انتهى إلى فوضع يده على فقال لي معروفا فنهضت فانطلق يمشي حتى أتى مقامه الذي يصلي فيه فأقبل عليهم ومعه صفان من رجال وصف من نساء أو صفان من نساء وصف من رجال فقال ‏\"‏ إن أنساني الشيطان شيئا من صلاتي فليسبح القوم وليصفق النساء ‏\"‏ ‏.‏ قال فصلى رسول الله صلى الله عليه وسلم ولم ينس من صلاته شيئا ‏.‏ فقال ‏\"‏ مجالسكم مجالسكم ‏\"‏ ‏.‏ زاد موسى ‏\"‏ ها هنا ‏\"‏ ‏.‏ ثم حمد الله تعالى وأثنى عليه ثم قال ‏\"‏ أما بعد ‏\"‏ ‏.‏ ثم اتفقوا ثم أقبل على الرجال فقال ‏\"‏ هل منكم الرجل إذا أتى أهله فأغلق عليه بابه وألقى عليه ستره واستتر بستر الله ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ ثم يجلس بعد ذلك فيقول فعلت كذا فعلت كذا ‏\"‏ ‏.‏ قال فسكتوا قال فأقبل على النساء فقال ‏\"‏ هل منكن من تحدث ‏\"‏ ‏.‏ فسكتن فجثت فتاة - قال مؤمل في حديثه فتاة كعاب - على إحدى ركبتيها وتطاولت لرسول الله صلى الله عليه وسلم ليراها ويسمع كلامها فقالت يا رسول الله إنهم ليتحدثون وإنهن ليتحدثنه فقال ‏\"‏ هل تدرون ما مثل ذلك ‏\"‏ ‏.‏ فقال ‏\"‏ إنما ذلك مثل شيطانة لقيت شيطانا في السكة فقضى منها حاجته والناس ينظرون إليه ألا وإن طيب الرجال ما ظهر ريحه ولم يظهر لونه ألا إن طيب النساء ما ظهر لونه ولم يظهر ريحه ‏\"‏ ‏.‏ قال أبو داود من ها هنا حفظته عن مؤمل وموسى ‏\"‏ ألا لا يفضين رجل إلى رجل ولا امرأة إلى امرأة إلا إلى ولد أو والد ‏\"‏ ‏.‏ وذكر ثالثة فأنسيتها وهو في حديث مسدد ولكني لم أتقنه كما أحب وقال موسى حدثنا حماد عن الجريري عن أبي نضرة عن الطفاوي ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuNadrah reported: An old man of Tufawah said to me: I was a guest of AbuHurayrah at Medina. I did not find any one of the companions of the Prophet (ﷺ) more devoted to worship and more hospitable than AbuHurayrah.  One day I was with him when he was sitting on his bed. He had a purse which contained pebbles or kernels. A black slave-girl of his was sitting below. Counting them he was glorifying Allah. When the pebbles or the kernels in the purse were finished, she gathered them and put them again in the purse, and gave it to him. He said: Should I not tell you about me and about the Messenger of Allah (ﷺ)?  I said: Yes.  He said: Once when I was laid up with fever in the mosque, the Messenger of Allah (ﷺ) came and entered the mosque, and said: Who saw the youth of ad-Daws. He said this three times.  A man said: Messenger of Allah, there he is, laid up with fever on one side of the mosque. He moved, walking forward till he reached me. He placed his hand on me. He had a kind talk with me, and I rose. He then began to walk till he reached the place where he used to offer his prayer. He paid his attention to the people. There were two rows of men and one row of women, or two rows of women and one row of men (the narrator is doubtful).  He then said: If Satan makes me forget anything during the prayer, the men should glorify Allah, and the women should clap their hands. The Messenger of Allah (ﷺ) then prayed and he did not forget anything during the prayer.  He said: Be seated in your places, be seated in your places. The narrator, Musa, added the word \"here\". He then praised Allah and exalted Him, and said: Now to our topic.  The agreed version begins: He then said: Is there any man among you who approaches his wife, closes the door, covers himself with a curtain, and he is concealed with the curtain of Allah?  They replied: Yes.  He said: later he sits and says: I did so-and-so; I did so-and-so. The people kept silence. He then turned to the women and said (to them): Is there any woman among you who narrates it? They kept silence. Then a girl fell on one of her knees. The narrator, Mu'ammil, said in his version: a buxom girl. She raised her head before the Messenger of Allah (ﷺ) so that he could see her and listen to her.  She said: Messenger of Allah, they (the men) describe the secrets (of intercourse) and they (the women) also describe the secrets (of intercourse) to the people.  He said: Do you know what the similitude is? He said: The likeness of this act is the likeness of a female Satan who meets the male Satan on the roadside; he fulfils his desire with her while the people are looking at him. Beware! The perfume of men is that whose smell becomes visible and its colour does not appear. Beware! The perfume of women is that whose colour becomes visible and whose smell is not obvious.  AbuDawud said: From here I remembered this tradition from Mu'ammil and Musa: Beware! No man should lie with another man, no woman should lie with another woman except with one's child or father. He also mentioned a third which I have forgotten. This has been mentioned in the version of Musaddad, but I do not remember it as precisely as I like.  The narrator, Musa, said: Hammad narrated this tradition from al-Jarir from AbuNadrah from at-Tufawi.",
      "chain": [
        "30175",
        "20212",
        "11286",
        "30180",
        "20208",
        "20040",
        "20022",
        "11286",
        "10721"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن الجريري، عن أبي عثمان، أو عن أبي السليل، عنه عن عبد الرحمن بن أبي بكر، قال ‏:‏ نزل بنا أضياف لنا قال ‏:‏ وكان أبو بكر يتحدث عند رسول الله صلى الله عليه وسلم بالليل فقال ‏:‏ لا أرجعن إليك حتى تفرغ من ضيافة هؤلاء ومن قراهم فأتاهم بقراهم فقالوا ‏:‏ لا نطعمه حتى يأتي أبو بكر ‏.‏ فجاء فقال ‏:‏ ما فعل أضيافكم أفرغتم من قراهم قالوا ‏:‏ لا ‏.‏ قلت ‏:‏ قد أتيتهم بقراهم فأبوا وقالوا ‏:‏ والله لا نطعمه حتى يجيء، فقالوا ‏:‏ صدق قد أتانا به فأبينا حتى تجيء، قال ‏:‏ فما منعكم قالوا ‏:‏ مكانك ‏.‏ قال ‏:‏ والله لا أطعمه الليلة، قال فقالوا ‏:‏ ونحن والله لا نطعمه حتى تطعمه ‏.‏ قال ‏:‏ ما رأيت في الشر كالليلة قط - قال - قربوا طعامكم ‏.‏ قال ‏:‏ فقرب طعامهم فقال ‏:‏ بسم الله فطعم وطعموا فأخبرت أنه أصبح فغدا على النبي صلى الله عليه وسلم فأخبره بالذي صنع وصنعوا، قال ‏:‏ ‏\"‏ بل أنت أبرهم وأصدقهم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Abi Bakr:                     Some guests visited us, and Abu Bakr was conversing with the Messenger of Allah (ﷺ) at night. He (Abu Bakr) said: I will not return to you until you are free from their entertainment and serving them food. So he brought them food, but they said: We shall not eat it until Abu Bakr comes (back). Abu Bakr then came and asked: What did your guest do? Are you free from their entertainment ? They said: No. I said: I brought them food, but they refused and said: We swear by Allah, we shall not take it until he comes. They said: He spoke the truth. He brought it to us, but we refused (to take it) until you come. He asked: What did prevent you ? He said: I swear by Allah, I shall not take food tonight. They said: And we also swear by Allah that we shall not take food until you take it. He said: I never saw an evil like the one tonight. He said: Bring your food near (you). He ('Abd al-Rahman) said: Their food was then brought near them. He said: In the name of Allah, and he took the food, and they also took it. I then informed him that the dawn had broken. So he went to th Prophet (ﷺ) and informed him of what he and they had done. He said: You are the most obedient and most trustful of them.",
      "chain": [
        "30180",
        "20208",
        "11286",
        "107"
      ]
    },
    {
      "hadith_no": "3631",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن قدامة، ومؤمل بن هشام، - قال ابن قدامة - حدثني إسماعيل، عن بهز بن حكيم، عن أبيه، عن جده، - قال ابن قدامة - إن أخاه أو عمه وقال مؤمل - إنه قام إلى النبي صلى الله عليه وسلم وهو يخطب فقال جيراني بما أخذوا ‏.‏ فأعرض عنه مرتين ثم ذكر شيئا فقال النبي صلى الله عليه وسلم ‏\"‏ خلوا له عن جيرانه ‏\"‏ ‏.‏ لم يذكر مؤمل وهو يخطب ‏.‏",
      "text_en": " Bahz ibn Hakim reported from his grandfather:                      (Ibn Qudamah's version has: His grandfather's brother or uncle reported:) - the narrator Mu'ammal said: - He (his grandfather Mu'awiyah) got up before the Holy Prophet (ﷺ) who was giving sermon: and he said: Why have your companions arrested my neighbours? He turned away from him twice. He (his grandfather Mu'awiyah) then mentioned something. The Holy Prophet (ﷺ) then said: Let his neighbours go. (Mu'ammal did not mention the words \"He was giving sermon.\")",
      "chain": [
        "30180",
        "20208",
        "19901",
        "19905",
        "30180"
      ]
    },
    {
      "hadith_no": "3649",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا مؤمل، قال حدثنا الوليد، ح وحدثنا العباس بن الوليد بن مزيد، قال أخبرني أبي، عن الأوزاعي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة، - يعني ابن عبد الرحمن - قال حدثني أبو هريرة، قال لما فتحت مكة قام النبي صلى الله عليه وسلم فذكر الخطبة خطبة النبي صلى الله عليه وسلم قال فقام رجل من أهل اليمن يقال له أبو شاه فقال يا رسول الله اكتبوا لي ‏.‏ فقال ‏\"‏ اكتبوا لأبي شاه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said :                      When Mecca was conquered, the Holy Prophet peace be upon him stood up. He (Abu Hurairah)then mentioned the sermon of the Holy prophet (ﷺ). He said: A man of the Yemen , who was called Abu shah, go up and said ; Messenger of Allah! Write it for me. He said :Write for Abu shah.",
      "chain": [
        "30180",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3767",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن هشام، - يعني ابن أبي عبد الله الدستوائي - عن بديل، عن عبد الله بن عبيد، عن امرأة، منهم يقال لها أم كلثوم عن عائشة، - رضى الله عنها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أكل أحدكم فليذكر اسم الله تعالى فإن نسي أن يذكر اسم الله تعالى في أوله فليقل بسم الله أوله وآخره ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: When one of you eats, he should mention Allah's name; if he forgets to mention  Allah's name at the beginning, he should say: \"In the name of Allah at the beginning and at the end of it.\"",
      "chain": [
        "30180",
        "20208",
        "20295",
        "53"
      ]
    },
    {
      "hadith_no": "3941",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا مؤمل، حدثنا إسماعيل، عن أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعناه قال وكان نافع ربما قال ‏\"‏ فقد عتق منه ما عتق ‏\"‏ ‏.‏ وربما لم يقله ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Umar to the same effect through a different chain of narrators. Nafi' sometimes said:                      He will be emancipated to the extent of the share which he emancipated, and sometimes he did not say these words.",
      "chain": [
        "30180",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4019",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا ابن علية، عن الجريري، ح وحدثنا مؤمل بن هشام، قال حدثنا إسماعيل، عن الجريري، عن أبي نضرة، عن رجل، من الطفاوة عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يفضين رجل إلى رجل ولا امرأة إلى امرأة إلا ولدا أو والدا ‏\"‏ ‏.‏ قال وذكر الثالثة فنسيتها ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: A man should not lie with another man and a woman should not lie with another woman without covering their private parts except a child or a father. He also mentioned a third thing which I forgot.",
      "chain": [
        "30309",
        "20208",
        "11286",
        "30180",
        "20208",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "hadith_no": "4234",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أبي الأشهب، عن عبد الرحمن بن طرفة بن عرفجة بن أسعد، عن أبيه، أن عرفجة، بمعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Arfajah through a different chain of narrators to the same effect.",
      "chain": [
        "30180",
        "20208"
      ]
    },
    {
      "hadith_no": "4310",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أبي حيان التيمي، عن أبي زرعة، قال جاء نفر إلى مروان بالمدينة فسمعوه يحدث في الآيات أن أولها الدجال قال فانصرفت إلى عبد الله بن عمرو فحدثته فقال عبد الله لم يقل شيئا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الآيات خروجا طلوع الشمس من مغربها أو الدابة على الناس ضحى فأيتهما كانت قبل صاحبتها فالأخرى على أثرها ‏\"‏ ‏.‏ قال عبد الله وكان يقرأ الكتب وأظن أولهما خروجا طلوع الشمس من مغربها ‏.‏",
      "text_en": " Abu zur’ah said:                      A group of people came to Marwan in Medina, and they heard him say that the first of the signs to appear would be the coming forth of the Dajjal (Antichirst). He said: I then went to Abd Allah b. ‘Amr and mentioned it to him. He did not say anything(reliable). I heard the Messenger of Allah (ﷺ) say: The first of the signs to appear will be the rising of the sun in its place of setting and the coming forth of the beast against mankind in the forenoon. Whichever of them comes first will soon be followed by the other. ’Abd Allah who used to read the scriptures (Torah, Gospel) said: I think the first of them will be the rising of the sun in its place of setting.",
      "chain": [
        "30180",
        "20208",
        "11404",
        "11406"
      ]
    },
    {
      "hadith_no": "4432",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن الجريري، عن أبي نضرة، قال جاء رجل إلى النبي صلى الله عليه وسلم نحوه وليس بتمامه قال ذهبوا يسبونه فنهاهم قال ذهبوا يستغفرون له فنهاهم قال ‏\"‏ هو رجل أصاب ذنبا حسيبه الله ‏\"‏ ‏.‏",
      "text_en": " Abu Nadrah said:                      A man came to Prophet (ﷺ). He then mentioned a similar tradition but not completely. This version has: People began to speak ill of him but he (the Prophet) forbade them. Then they began to ask forgiveness from him, but he forbade them by saying. He is a man who had committed a sin. Allah will call him to account himself.",
      "chain": [
        "30180",
        "20208",
        "11286",
        "10721"
      ]
    },
    {
      "hadith_no": "5063",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن هشام اليشكري، حدثنا إسماعيل بن إبراهيم، عن الجريري، عن أبي الورد بن ثمامة، قال قال علي لابن أعبد ألا أحدثك عني وعن فاطمة بنت رسول الله صلى الله عليه وسلم وكانت أحب أهله إليه وكانت عندي فجرت بالرحى حتى أثرت بيدها واستقت بالقربة حتى أثرت في نحرها وقمت البيت حتى اغبرت ثيابها وأوقدت القدر حتى دكنت ثيابها وأصابها من ذلك ضر فسمعنا أن رقيقا أتي بهم إلى النبي صلى الله عليه وسلم فقلت لو أتيت أباك فسألتيه خادما يكفيك ‏.‏ فأتته فوجدت عنده حداثا فاستحيت فرجعت فغدا علينا ونحن في لفاعنا فجلس عند رأسها فأدخلت رأسها في اللفاع حياء من أبيها فقال ‏\"‏ ما كان حاجتك أمس إلى آل محمد ‏\"‏ ‏.‏ فسكتت مرتين فقلت أنا والله أحدثك يا رسول الله إن هذه جرت عندي بالرحى حتى أثرت في يدها واستقت بالقربة حتى أثرت في نحرها وكسحت البيت حتى اغبرت ثيابها وأوقدت القدر حتى دكنت ثيابها وبلغنا أنه قد أتاك رقيق أو خدم فقلت لها سليه خادما ‏.‏ فذكر معنى حديث الحكم وأتم ‏.‏",
      "text_en": " ‘Ali said to Ibn A’bad :                      should I not tell you about me and about Fatimah, daughter of the Messenger of Allah (May peace be upon him). She was dearest to him of his family. When she was with me, she pulled mill-stone which affected her hand; she carried water with the water-bag which affected the upper portion of her chest: She swept the house so much so that her clothes became dusty; and she cooked food by which her clothes became black, and it harmed her. We heard that some slaves had been brought to the prophet (May peace be upon him). I said: if you go to your father and ask him for a servant, that will be sufficient for you. She came to him and found some people talking to him. She felt shy and returned. Next morning he visited us when we were in our quilt. He sat beside her head, and she took her head into the quilt out of shame from her father. He asked: What need had you with me, O family of Muhammad? She kept silence twice. I then said : I swear by Allah, I shall tell you. She pulls the mile-stone which has  affected her hand; she carrys water with the water-bag which has affected the upper portion of her chest; she sweeps the house by which her clothes have become dusty, and she cooks food by which her clothes have become black. We were told that some slaves or servants had come to you. So I said to her; ask him for a servant. He then mentioned the rest of the tradition to the same effect as mentioned by al-Hakam rather more perfectly.",
      "chain": [
        "30180",
        "20208",
        "11286"
      ]
    },
    {
      "hadith_no": "2074",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا مؤمل، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب مملوكا لي فسمعت قائلا من خلفي يقول ‏\"‏ اعلم أبا مسعود اعلم أبا مسعود ‏\"‏ ‏.‏ فالتفت فإذا أنا برسول الله صلى الله عليه وسلم فقال ‏\"‏ لله أقدر عليك منك عليه ‏\"‏ ‏.‏ قال أبو مسعود فما ضربت مملوكا لي بعد ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإبراهيم التيمي هو إبراهيم بن يزيد بن شريك ‏.‏",
      "text_en": " Abu Mas'ud [Al-Ansari] said:                     \"I was beating a slave of mine and I heard someone behind me saying: 'Beware O Abu Mas'ud! Beware O Abu Mas'ud!' So I turned around and saw that it was the Messenger of Allah. He said: 'Allah has more power over you than you do over him.\" Abu Mas'ud said: \"I have not beaten any slave of mine since then.\"",
      "chain": [
        "30277",
        "30180",
        "20012",
        "11060",
        "11322",
        "11405",
        "402"
      ]
    },
    {
      "hadith_no": "2297",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا بندار، حدثنا مؤمل، حدثنا سفيان، عن أبي إسحاق، عن مطر بن عكامس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قضى الله لعبد أن يموت بأرض جعل له إليها حاجة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي عزة ‏.‏ وهذا حديث حسن غريب ‏.‏ ولا يعرف لمطر بن عكامس عن النبي صلى الله عليه وسلم غير هذا الحديث",
      "text_en": " Matar bin 'Ukamis narrated that the Messenger of Allah (s.a.w) said:                     \"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\"",
      "chain": [
        "30160",
        "30180",
        "20012",
        "11049"
      ]
    },
    {
      "hadith_no": "2298",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا مؤمل، وأبو داود الحفري عن سفيان، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "30180",
        "20668",
        "20012"
      ]
    },
    {
      "hadith_no": "4330",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا مؤمل، حدثنا سفيان، عن عبد الله بن دينار، نحو حديث شعبة وزاد فيه ‏\"‏ وعصية عصت الله ورسوله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin Dinar:                     similar to Shu'bah (#3948) and he added: \"And 'Usayyah has disobeyed Allah and His Messenger.\"",
      "chain": [
        "30160",
        "30180",
        "20012"
      ]
    },
    {
      "hadith_no": "26",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا مؤمل بن هشام، قال أنبأنا إسماعيل، قال أخبرنا شعبة، عن سليمان، عن أبي وائل، عن حذيفة، أن رسول الله صلى الله عليه وسلم أتى سباطة قوم فبال قائما ‏.‏",
      "text_en": " It was narrated from Hudhifah that the Messenger of Allah (ﷺ)came to some people's garbage dump and urinated while standing.",
      "chain": [
        "30180",
        "20208",
        "20020",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "110",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا يزيد بن زريع، عن شعبة، ح وأنبأنا مؤمل بن هشام، قال حدثنا إسماعيل، عن شعبة، عن محمد بن زياد، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ ويل للعقب من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"Abu Al-Qasim the Messenger of Allah (ﷺ) said: 'Woe to the heels from the Fire.'\"",
      "chain": [
        "30367",
        "20304",
        "20020",
        "30180",
        "20208",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "830",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا مؤمل بن هشام، قال حدثنا إسماعيل ابن علية، عن سعيد، عن قتادة، عن يونس بن جبير، عن حطان بن عبد الله، قال صلى بنا أبو موسى فلما كان في القعدة دخل رجل من القوم فقال أقرت الصلاة بالبر والزكاة ‏.‏ فلما سلم أبو موسى أقبل على القوم فقال أيكم القائل هذه الكلمة فأرم القوم ‏.‏ قال يا حطان لعلك قلتها قال لا وقد خشيت أن تبكعني بها فقال إن رسول الله صلى الله عليه وسلم كان يعلمنا صلاتنا وسنتنا فقال ‏\"‏ إنما الإمام ليؤتم به فإذا كبر فكبروا وإذا قال ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فقولوا آمين يجبكم الله وإذا ركع فاركعوا وإذا رفع فقال سمع الله لمن حمده فقولوا ربنا لك الحمد يسمع الله لكم وإذا سجد فاسجدوا وإذا رفع فارفعوا فإن الإمام يسجد قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hittan bin 'Abdullah said:                      \"Abu Musa led us in prayer and when he was sitting, a man from among the people entered and said: 'Prayer is based on righteousness and is always mentioned longside Zakah (in the Qur'in).' When Abu Musa had said the Salam, he turned to the people and said: 'Which of you spoke these words?' The people kept quiet. Then he said: '0 Hittan, perhaps you said it?' He said: 'No, but I was afraid that you would rebuke me for it.' He said:'The Messenger of Allah (ﷺ) taught us our prayer and Sunnah prayers, and he said: The Imam is appointed to be followed, so when he says the Takbir, say the Takbir; when he says\"Not (the way) of those who earned Your Anger, nor of those who went astray,\" say Amin, and Allah will respond to you; when he frombowing and rises up says, 'Sami' Allalhu liman hamidah (Allih hears those who praise Him), say 'Rabbana lakal-hamd (Our Lord, toYou be praise),' and Allah will hear you; when he prostrates, prostrate, and when he sits up, sit up. The Imam should prostrate before youdo and sit up before you do.' The Messenger of Allah (ﷺ) said: 'This makes up for that.\"'",
      "chain": [
        "30180",
        "20208",
        "11168",
        "11019",
        "11320"
      ]
    },
    {
      "hadith_no": "2117",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا مؤمل بن هشام، عن إسماعيل، عن شعبة، عن محمد بن زياد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صوموا لرؤيته وأفطروا لرؤيته فإن غم عليكم الشهر فعدوا ثلاثين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"the Messenger of Allah said: 'Fast when you see it and stop fasting  when you see it, and if it is obscured from you (too cloudy), then count it as thirty (days). \"'",
      "chain": [
        "30180",
        "20208",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "4585",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن بشار، قال أنبأنا مؤمل، قال حدثنا سفيان، عن أبي هاشم، عن سعيد بن جبير، عن ابن عمر، أنه كان لا يرى بأسا - يعني - في قبض الدراهم من الدنانير والدنانير من الدراهم ‏.‏",
      "text_en": " It was narrated from Saeed bin Jubair, from Ibn 'Umar, that:                     he did not see anything wrong with parying Dirhams for Dinars.",
      "chain": [
        "30160",
        "30180",
        "20012",
        "11454",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "4777",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا مؤمل بن هشام، قال حدثنا إسماعيل بن إبراهيم، قال حدثنا أبو مسعود، سعيد بن إياس الجريري عن أبي نضرة، عن أبي فراس، أن عمر، قال رأيت رسول الله صلى الله عليه وسلم يقص من نفسه ‏.‏",
      "text_en": " It was narrated from Abu Firas that \"Umar said:                     \"I saw the Messenger of Allah allowing others to seek retaliation against him.\"",
      "chain": [
        "30180",
        "20208",
        "11286",
        "10721",
        "3"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا مؤمل، قالا حدثنا سفيان، عن عبد الملك بن عمير، عن مولى، لربعي بن حراش عن ربعي بن حراش، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لا أدري قدر بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
      "text_en": " It was narrated that Hudhaifah bin Yaman said:                     \"The Messenger of Allah said: 'I do not know howlong I will stay among you, so follow the example of these two after I am gone,' and he pointed to Abu Bakr and 'Umar.\"",
      "chain": [
        "38409",
        "20032",
        "30160",
        "30180",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2091",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا مؤمل، حدثنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن أبي أمامة، قال أتت النبي  صلى الله عليه وسلم  امرأة معها صبيان لها قد حملت أحدهما وهي تقود الآخر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ حاملات والدات رحيمات لولا ما يأتين إلى أزواجهن دخل مصلياتهن الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"A woman came to the Prophet with two of her children, carrying one and leading the other. The Messenger of Allah said: 'They carry children and give birth to them and are compassionate. If they do not annoy their husbands, those among them who perform prayer will enter Paradise.\"'",
      "chain": [
        "30160",
        "30180",
        "20012",
        "11060",
        "11342",
        "405"
      ]
    },
    {
      "hadith_no": "2095",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا مؤمل، حدثنا سفيان، عن أبي إسحاق، عن أبي بردة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما بال أقوام يلعبون بحدود الله يقول أحدهم قد طلقتك قد راجعتك ‏.‏ قد طلقتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that:                     the Messenger of Allah said: What is wrong with people who play with the limits imposed by Allah, and one of them says: \"I divorce you, I take you back, I divorce you?\"",
      "chain": [
        "30160",
        "30180",
        "20012",
        "11049",
        "11901",
        "41"
      ]
    }
  ],
  "total_hadiths": 36
}