{
  "id": "30197",
  "name": "Talq bin Ghanam طلق بن غنام",
  "full_name": "Talq bin Ghanam طلق بن غنام",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "211",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Rajab, ",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Nakha'i",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20745",
      "name": "Y'aqub bin 'Abdullah يعقوب بن عبد الله بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30326",
      "name": "al-Husain bin 'Isa bin Hamran الحسين بن عيسى بن حمران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30475",
      "name": "al-Qasim bin Zakaria bin Dinar القاسم بن زكريا بن دينار القرشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35010",
      "name": "Ibrahim bin Abi Bakr bin Muhammad إبراهيم بن أبي بكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38467",
      "name": "abu Umayya, Muhammad bin Ibrahim محمد بن إبراهيم أبو أمية الطرسوسي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2058",
      "hadith_no": "2058",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا طلق بن غنام، حدثنا زائدة، عن حصين، عن سالم، قال حدثني جابر  رضى الله عنه  قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت من الشأم عير، تحمل طعاما، فالتفتوا إليها، حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا فنزلت ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها‏}‏",
      "text_en": " Narrated Jabir:                     While we were offering the prayer with the Prophet a caravan carrying food came from Sham. The people looked towards the caravan (and went to it) and only twelve persons remained with the Prophet. So, the Divine Inspiration came; \"But when they see some bargain or some amusement, they disperse headlong to it.\" (62.11)",
      "usc_msa_ref": "274",
      "chain": [
        "30197",
        "20320",
        "15097",
        "11011",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-4770",
      "hadith_no": "4770",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني طلق بن غنام، حدثنا زائدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت أنزل ذلك في الدعاء‏.‏",
      "text_en": " Narrated Aisha:                     The (above) verse was revealed in connection with the invocations.",
      "usc_msa_ref": "247",
      "chain": [
        "30197",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4906",
      "hadith_no": "4906",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا طلق بن غنام، حدثنا زائدة، عن الشيباني، قال سألت زرا عن قوله تعالى ‏{‏فكان قاب قوسين أو أدنى * فأوحى إلى عبده ما أوحى‏}‏ قال أخبرنا عبد الله أن محمدا صلى الله عليه وسلم رأى جبريل له ستمائة جناح‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     I asked Zirr about the Statement of Allah: 'And was at a distance of but two bow-lengths or (even) nearer. So did Allah convey the Inspiration to His slave (Gabriel) and then he (Gabriel) conveyed that to Muhammad.' (53.10) He said, \"Abdullah (bin Mas`ud) informed us that Muhammad had seen Gabriel with six hundred wings.\"",
      "usc_msa_ref": "",
      "chain": [
        "30197",
        "20320",
        "11352",
        "11337",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-776",
      "hadith_no": "776",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حسين بن عيسى، حدثنا طلق بن غنام، حدثنا عبد السلام بن حرب الملائي، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا استفتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ قال أبو داود وهذا الحديث ليس بالمشهور عن عبد السلام بن حرب لم يروه إلا طلق بن غنام وقد روى قصة الصلاة عن بديل جماعة لم يذكروا فيه شيئا من هذا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) began his prayer, he said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name, and Exalted is Thy greatness, sand there is no god but Allah.\"Abu Dawud said: This tradition is not well known from 'Abd al-Salam b. Harb. No one narrated this except Talq b. Ghannam. A group of narrators reported the description of prayer from (the narrator) Budail; they did not mention therein this supplication.",
      "usc_msa_ref": "",
      "chain": [
        "30326",
        "30197",
        "20248",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1301",
      "hadith_no": "1301",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا حسين بن عبد الرحمن الجرجرائي، حدثنا طلق بن غنام، حدثنا يعقوب بن عبد الله، عن جعفر بن أبي المغيرة، عن سعيد بن جبير، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يطيل القراءة في الركعتين بعد المغرب حتى يتفرق أهل المسجد ‏.‏ قال أبو داود رواه نصر المجدر عن يعقوب القمي وأسنده مثله ‏.‏ قال أبو داود حدثناه محمد بن عيسى بن الطباع حدثنا نصر المجدر عن يعقوب مثله ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) used to prolong the recitation of the Qur'an in the two rak'ahs after the sunset prayer until the people praying in the mosque dispersed.Abu Dawud said: This has been reported by Nasr al-Mujaddir from Ya'qub al-Qummi with the same chain of narrators.Abu Dawud said: Muhammad b. 'Isa b. al-tabba' transmitted from Nasr al-Mujaddir from Ya'qub in like manner.",
      "usc_msa_ref": "",
      "chain": [
        "30197",
        "18131",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3535",
      "hadith_no": "3535",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، وأحمد بن إبراهيم، قالا حدثنا طلق بن غنام، عن شريك، - قال ابن العلاء وقيس - عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Pay the deposit to him who deposited it with you, and do not betray him who betrayed you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30494",
        "30197",
        "20587",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4437",
      "hadith_no": "4437",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا طلق بن غنام، حدثنا عبد السلام بن حفص، حدثنا أبو حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم أن رجلا أتاه فأقر عنده أنه زنى بامرأة سماها له فبعث رسول الله صلى الله عليه وسلم إلى المرأة فسألها عن ذلك فأنكرت أن تكون زنت فجلده الحد وتركها ‏.‏",
      "text_en": " Narrated Sahl ibn Sa'd:                     A man came to the Prophet (ﷺ) and confessed before him that he had committed fornication with a woman whom he named. The Messenger of Allah (ﷺ) sent for the woman and asked her about it. But she denied that she had committed fornication. So he inflicted the prescribed punishment of flogging on him, and let her go.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30197",
        "22126",
        "11172",
        "399"
      ]
    },
    {
      "id": "sunan-abi-daud-4466",
      "hadith_no": "4466",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا طلق بن غنام، حدثنا عبد السلام بن حفص، حدثنا أبو حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم أن رجلا أتاه فأقر عنده أنه زنى بامرأة سماها له فبعث رسول الله صلى الله عليه وسلم إلى المرأة فسألها عن ذلك فأنكرت أن تكون زنت فجلده الحد وتركها ‏.‏",
      "text_en": " Narrated Sahl ibn Sa'd:                     A man came to the Prophet (ﷺ) and made acknowledgment before him that he had committed fornication with a woman whom he named. The Messenger of Allah (ﷺ) sent someone to the woman and he asked her about it. She denied that she had committed fornication. So he gave him the prescribed punishment of lashes and left her.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30197",
        "22126",
        "11172",
        "399"
      ]
    },
    {
      "id": "jami-al-tirmidhi-742",
      "hadith_no": "742",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا القاسم بن دينار، حدثنا عبيد الله بن موسى، وطلق بن غنام، عن شيبان، عن عاصم، عن زر، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يصوم من غرة كل شهر ثلاثة أيام وقلما كان يفطر يوم الجمعة ‏.‏ قال وفي الباب عن ابن عمر وأبي هريرة ‏.‏ قال أبو عيسى حديث عبد الله حديث حسن غريب ‏.‏ وقد استحب قوم من أهل العلم صيام يوم الجمعة وإنما يكره أن يصوم يوم الجمعة لا يصوم قبله ولا بعده ‏.‏ قال وروى شعبة عن عاصم هذا الحديث ولم يرفعه ‏.‏",
      "text_en": " Abdullah narrated:                     \"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "20340",
        "30197",
        "20240",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1264",
      "hadith_no": "1264",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا طلق بن غنام، عن شريك، وقيس، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا إذا كان للرجل على آخر شيء فذهب به فوقع له عنده شيء فليس له أن يحبس عنه بقدر ما ذهب له عليه ‏.‏ ورخص فيه بعض أهل العلم من التابعين ‏.‏ وهو قول الثوري وقال إن كان له عليه دراهم فوقع له عنده دنانير فليس له أن يحبس بمكان دراهمه إلا أن يقع عنده له دراهم فله حينئذ أن يحبس من دراهمه بقدر ما له عليه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"Fulfill the trust for the one who entrusted you, and do not cheat the one who cheated you.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge followed this Hadith, they said that when something belonging to a man is with another and he leaves (with it), then he has something that belongs to him, he may not withhold from him an equivalent to what the other took of his.Some of the people of knowledge among the Tabi'in allowed that. This is the view of Sufyan Ath-Thawri, he said: \"If one man has some Dirham that belong to another, and the second has some Dinar belonging to the first, he may not withhold any in place of his Dirham, unless it so happens that he has some Dirham of his, then in that case he can withhold some of his Dirham equal to what he is owed by the first.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30197",
        "20587",
        "11046",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-105",
      "hadith_no": "105",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "وأخبرنا الحسين بن عبد الرحمن الجرجرائي، عن طلق بن غنام، قال حدثنا زائدة، وحفص بن غياث، عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، عن بلال، قال رأيت رسول الله صلى الله عليه وسلم يمسح على الخفين ‏.‏",
      "text_en": " It was narrated that Bilal said:                      \"I saw the Messenger of Allah (ﷺ) wiping over the Khuff.\"",
      "usc_msa_ref": "",
      "chain": [
        "30197",
        "20320",
        "20317",
        "11060",
        "11069",
        "11196",
        "400",
        "24"
      ]
    }
  ],
  "total_hadiths": 11
}