{
  "id": "30194",
  "name": "Sa'id bin Shrhbyl al-Kndy سعيد بن شرحبيل الكندي",
  "full_name": "Sa'id bin Shrhbyl al-Kndy سعيد بن شرحبيل الكندي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "210",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Kundi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26011",
      "name": "Khlad bin Sulaiman al-Hdrmy خلاد بن سليمان الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22167",
      "name": "al-Qasim bin 'Abdullah bin 'Umar القاسم بن عبد الله بن عمر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3639",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني سعيد بن شرحبيل، حدثنا ليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر، فقال ‏\"‏ إني فرطكم، وأنا شهيد عليكم، إني والله لأنظر إلى حوضي الآن، وإني قد أعطيت خزائن مفاتيح الأرض، وإني والله ما أخاف بعدي أن تشركوا، ولكن أخاف أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin `Amr:                     The Prophet once came out and offered the funeral prayer for the martyrs of Uhud, and proceeded to the pulpit and said, \"I shall be your predecessor and a witness on you, and I am really looking at my sacred Fount now, and no doubt, I have been given the keys of the treasures of the world. By Allah, I am not afraid that you will worship others along with Allah, but I am afraid that you will envy and fight one another for worldly fortunes.\"",
      "chain": [
        "30194",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4340",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن شرحبيل، حدثنا الليث، عن المقبري، عن أبي شريح العدوي، أنه قال لعمرو بن سعيد وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به رسول الله صلى الله عليه وسلم الغد يوم الفتح، سمعته أذناى ووعاه قلبي، وأبصرته عيناى، حين تكلم به حمد الله وأثنى عليه ثم قال ‏\"‏ إن مكة حرمها الله ولم يحرمها الناس، لا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما، ولا يعضد بها شجرا، فإن أحد ترخص لقتال رسول الله صلى الله عليه وسلم فيها فقولوا له إن الله أذن لرسوله، ولم يأذن لكم‏.‏ وإنما أذن لي فيها ساعة من نهار، وقد عادت حرمتها اليوم كحرمتها بالأمس، وليبلغ الشاهد الغائب ‏\"‏‏.‏ فقيل لأبي شريح ماذا قال لك عمرو قال قال أنا أعلم بذلك منك يا أبا شريح، إن الحرم لا يعيذ عاصيا، ولا فارا بدم، ولا فارا بخربة‏.‏",
      "text_en": " Narrated Abu Shuraih:                     Al-Adawi that he said to `Amr bin Sa`id while the latter was sending troops in batches to Mecca, \"O chief! Allow me to tell you a statement which Allah's Apostle said on the second day of the Conquest of Mecca. My two ears heard it and my heart remembered it and my two eyes saw him when he said it. He (i.e. the Prophet) praised Allah and then said, 'Mecca has been made a sanctuary by Allah and not by the people, so it is not lawful for a person, who believes in Allah and the Last Day to shed blood in it, or to cut its trees and if someone asks the permission to fight in Mecca because Allah's Apostle was allowed to fight in it, say to him; Allah permitted His Apostle and did not allow you, and even he (i.e. the Apostle) was allowed for a short period of the day, and today its (Mecca's sanctity has become the same as it was before (of old) so those who are present should inform those who are absent (this Hadith).\" Then Abu Shuraih, was asked, \"What did `Amr say to you? Abu Shuraih said, \"He said, \"I knew that better than you, O Abu Shuraih! The Haram (i.e. Mecca) does not give refuge to a sinner or a fleeing murderer or a person running away after causing destruction.\"",
      "chain": [
        "30194",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "2331",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني القاسم بن زكريا بن دينار، قال حدثنا سعيد بن شرحبيل، قال أنبأنا الليث، عن يحيى بن أيوب، عن عبد الله بن أبي بكر، عن سالم بن عبد الله، عن عبد الله بن عمر، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يبيت الصيام قبل الفجر فلا صيام له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah that the Prophet said:                     \"Whoever does not have the intention of fasting before dawn, then there is no fast for him.\"(Daif)",
      "chain": [
        "30475",
        "30194",
        "20023",
        "20379",
        "11104",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1600",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، حدثنا سعيد بن شرحبيل، عن ابن لهيعة، عن عبيد الله بن المغيرة، عن أبي الهيثم، عن أبي سعيد، قال كانت سوداء تقم المسجد فتوفيت ليلا فلما أصبح رسول الله  صلى الله عليه وسلم  أخبر بموتها فقال ‏\"‏ ألا آذنتموني بها ‏\"‏ ‏.‏ فخرج بأصحابه فوقف على قبرها فكبر عليها والناس من خلفه ودعا لها ثم انصرف ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “There was a black woman whousedto sweep the mosque, and she passed away at night. The followingmorning the Messenger of Allah (ﷺ) was told of her death. He said:‘Why did you not call me?’ Then he went out with his Companionsandstood at her grave, and said Takbir over her, with the peoplebehindhim, and he supplicated for her, then he went away.’”",
      "chain": [
        "30216",
        "30194",
        "20624",
        "18689",
        "38"
      ]
    },
    {
      "hadith_no": "3875",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا يونس بن محمد، وسعيد بن شرحبيل، أنبأنا الليث بن سعد، عن عقيل، عن ابن شهاب، أن عروة بن الزبير، أخبره عن عائشة، أن النبي  صلى الله عليه وسلم  كان إذا أخذ مضجعه نفث في يديه وقرأ بالمعوذتين ومسح بهما جسده ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     whenever the Prophet (saas) went to bed, he would blow into his hands, recite Al-Mu'awwidhatain, then wipe his hands over his body.",
      "chain": [
        "20436",
        "20393",
        "30194",
        "20023",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 5
}