{
  "id": "30203",
  "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
  "full_name": "'Uthman bin Muhammad (Abi Shayba) عثمان بن محمد بن إبراهيم / بن أبي شيبة",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": [
        "170 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "239",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  س  ق  -  ثقة حافظ ]",
      "Tafsir/Quran"
    ],
    "tags": [
      "al-'Absi",
      "Client",
      "al-Kufi",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "25250",
      "name": "Muhammad bin Ibrahim bin 'Uthman محمد بن إبراهيم بن عثمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "39913",
      "name": "al-Qasim bin Abi Shayba القاسم بن أبي شيبة",
      "grade": "3rd Century AH"
    }
  ],
  "children": [
    {
      "id": "31213",
      "name": "Muhammad bin 'Uthman bin Aba محمد بن عثمان بن أبي شيبة",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20319",
      "name": "Hameed bin 'Abdur Rahman al-Rawasi حميد بن عبد الرحمن بن حميد بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20162",
      "name": "Talha bin Yahya bin al-Nu'man طلحة بن يحيى بن النعمان بن أبي عياش",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25208",
      "name": "'Umar bin 'Abdur Rahman عمر بن عبد الرحمن بن قيس",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20350",
      "name": "al-Qasim bin Malik al-Mzny القاسم بن مالك المزني أبو جعفر الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20352",
      "name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25304",
      "name": "al-Mtlb bin Ziyad bin Aby المطلب بن زياد بن أبي زهير الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "31213",
      "name": "Muhammad bin 'Uthman bin Aba محمد بن عثمان بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30008",
      "name": "Ibn Sa'd محمد بن سعد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "70",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي وائل، قال كان عبد الله يذكر الناس في كل خميس، فقال له رجل يا أبا عبد الرحمن لوددت أنك ذكرتنا كل يوم‏.‏ قال أما إنه يمنعني من ذلك أني أكره أن أملكم، وإني أتخولكم بالموعظة كما كان النبي صلى الله عليه وسلم يتخولنا بها، مخافة السآمة علينا‏.‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah used to give a religious talk to the people on every Thursday. Once a man said, \"O Aba `Abdur-Rahman! (By Allah) I wish if you could preach us daily.\" He replied, \"The only thing which prevents me from doing so, is that I hate to bore you, and no doubt I take care of you in preaching by selecting a suitable time just as the Prophet used to do with us, for fear of making us bored.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "123",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عثمان، قال أخبرنا جرير، عن منصور، عن أبي وائل، عن أبي موسى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله، ما القتال في سبيل الله فإن أحدنا يقاتل غضبا، ويقاتل حمية‏.‏ فرفع إليه رأسه  قال وما رفع إليه رأسه إلا أنه كان قائما  فقال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله عز وجل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     A man came to the Prophet and asked, \"O Allah's Apostle! What kind of fighting is in Allah's cause? (I ask this), for some of us fight because of being enraged and angry and some for the sake of his pride and haughtiness.\" The Prophet raised his head (as the questioner was standing) and said, \"He who fights so that Allah's Word (Islam) should be superior, then he fights in Allah's cause.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "216",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن مجاهد، عن ابن عباس، قال مر النبي صلى الله عليه وسلم بحائط من حيطان المدينة أو مكة، فسمع صوت إنسانين يعذبان في قبورهما، فقال النبي صلى الله عليه وسلم ‏\"‏ يعذبان، وما يعذبان في كبير ‏\"‏، ثم قال ‏\"‏ بلى، كان أحدهما لا يستتر من بوله، وكان الآخر يمشي بالنميمة ‏\"‏‏.‏ ثم دعا بجريدة فكسرها كسرتين، فوضع على كل قبر منهما كسرة‏.‏ فقيل له يا رسول الله لم فعلت هذا قال ‏\"‏ لعله أن يخفف عنهما ما لم تيبسا أو إلى أن ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices of two persons who were being tortured in their graves. The Prophet said, \"These two persons are being tortured not for a major sin (to avoid).\" The Prophet then added, \"Yes! (they are being tortured for a major sin). Indeed, one of them never saved himself from being soiled with his urine while the other used to go about with calumnies (to make enmity between friends). The Prophet then asked for a green leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why he had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي وائل، عن حذيفة، قال رأيتني أنا والنبي، صلى الله عليه وسلم نتماشى، فأتى سباطة قوم خلف حائط، فقام كما يقوم أحدكم فبال، فانتبذت منه، فأشار إلى فجئته، فقمت عند عقبه حتى فرغ‏.‏",
      "text_en": " Narrated Hudhaifa':                     The Prophet and I walked till we reached the dumps of some people. He stood, as any one of you stands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him and stood near his back till he finished.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن أبي وائل، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا قام من الليل يشوص فاه بالسواك‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet got up at night, he used to clean his mouth with Siwak.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "401",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال قال عبد الله صلى النبي صلى الله عليه وسلم  قال إبراهيم لا أدري زاد أو نقص  فلما سلم قيل له يا رسول الله، أحدث في الصلاة شىء قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت كذا وكذا‏.‏ فثنى رجليه واستقبل القبلة، وسجد سجدتين ثم سلم، فلما أقبل علينا بوجهه قال ‏\"‏ إنه لو حدث في الصلاة شىء لنبأتكم به، ولكن إنما أنا بشر مثلكم، أنسى كما تنسون، فإذا نسيت فذكروني، وإذا شك أحدكم في صلاته فليتحرى الصواب، فليتم عليه ثم يسلم، ثم يسجد سجدتين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet prayed (and the sub-narrator Ibrahim said, \"I do not know whether he prayed more or less than usual\"), and when he had finished the prayers he was asked, \"O Allah's Apostle! Has there been any change in the prayers?\" He said, \"What is it?' The people said, \"You have prayed so much and so much.\" So the Prophet bent his legs, faced the Qibla and performed two prostration's (of Sahu) and finished his prayers with Taslim (by turning his face to right and left saying: 'As-Salamu `Alaikum- Warahmat-ullah'). When he turned his face to us he said, \"If there had been anything changed in the prayer, surely I would have informed you but I am a human being like you and liable to forget like you. So if I forget remind me and if anyone of you is doubtful about his prayer, he should follow what he thinks to be correct and complete his prayer accordingly and finish it and do two prostrations (of Sahu).",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "508",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت أعدلتمونا بالكلب والحمار لقد رأيتني مضطجعة على السرير، فيجيء النبي صلى الله عليه وسلم فيتوسط السرير فيصلي، فأكره أن أسنحه فأنسل من قبل رجلى السرير حتى أنسل من لحافي‏.‏",
      "text_en": " Narrated `Aisha:                     Do you make us (women) equal to dogs and donkeys? While I used to lie in my bed, the Prophet would come and pray facing the middle of the bed. I used to consider it not good to stand in front of him in his prayers. So I used to slip away slowly and quietly from the foot of the bed till I got out of my guilt.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1007",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي الضحى، عن مسروق، قال كنا عند عبد الله فقال إن النبي صلى الله عليه وسلم لما رأى من الناس إدبارا قال ‏\"‏ اللهم سبع كسبع يوسف ‏\"‏‏.‏ فأخذتهم سنة حصت كل شىء حتى أكلوا الجلود والميتة والجيف، وينظر أحدهم إلى السماء فيرى الدخان من الجوع، فأتاه أبو سفيان فقال يا محمد إنك تأمر بطاعة الله وبصلة الرحم وإن قومك قد هلكوا، فادع الله لهم قال الله تعالى ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ إلى قوله ‏{‏عائدون * يوم نبطش البطشة الكبرى‏}‏ فالبطشة يوم بدر، وقد مضت الدخان والبطشة واللزام وآية الروم‏.‏",
      "text_en": " Narrated Masruq:                     We were with `Abdullah and he said, \"When the Prophet saw the refusal of the people to accept Islam he said, \"O Allah! Send (famine) years on them for (seven years) like the seven years (of famine during the time) of (Prophet) Joseph.\" So famine overtook them for one year and destroyed every kind of life to such an extent that the people started eating hides, carcasses and rotten dead animals. Whenever one of them looked towards the sky, he would (imagine himself to) see smoke because of hunger. So Abu Sufyan went to the Prophet and said, \"O Muhammad! You order people to obey Allah and to keep good relations with kith and kin. No doubt the people of your tribe are dying, so please pray to Allah for them.\" So Allah revealed: \"Then watch you For the day that The sky will bring forth a kind Of smoke Plainly visible ... Verily! You will return (to disbelief) On the day when We shall seize You with a mighty grasp. (44.10-16) Ibn Mas`ud added, \"Al-Batsha (i.e. grasp) happened in the battle of Badr and no doubt smoke, Al-Batsha, Al-Lizam, and the verse of Surat Ar-Rum have all passed .",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "1340",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الشيباني، عن الشعبي، عن ابن عباس  رضى الله عنهما  قال صلى النبي صلى الله عليه وسلم على رجل بعد ما دفن بليلة قام هو وأصحابه، وكان سأل عنه فقال ‏\"‏ من هذا ‏\"‏‏.‏ فقالوا فلان، دفن البارحة‏.‏ فصلوا عليه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet (p.b.u.h) offered the funeral prayer of a man one night after he was buried, he and his companions stood up (for the Prayer). He had asked them about him before standing, saying, \"Who is this?\" They said, \"He is so and so and was buried last night.\" So all of them offered the funeral prayer.",
      "chain": [
        "30203",
        "20028",
        "11352",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1446",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن شقيق، عن مسروق، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أنفقت المرأة من طعام بيتها غير مفسدة كان لها أجرها بما أنفقت ولزوجها أجره بما كسب، وللخازن مثل ذلك، لا ينقص بعضهم أجر بعض شيئا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"When a woman gives in charity some of the foodstuff (which she has in her house) without spoiling it, she will receive the reward for what she has spent, and her husband will receive the reward because of his earning, and the storekeeper will also have a reward similar to it. The reward of one will not decrease the reward of the others . \"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1490",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن زينب ابنة أم سلمة، ‏{‏عن أم سلمة،‏}‏ قالت قلت يا رسول الله ألي أجر أن أنفق على بني أبي سلمة إنما هم بني‏.‏ فقال ‏\"‏ أنفقي عليهم، فلك أجر ما أنفقت عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Zainab:                     (the daughter of Um Salama) My mother said, \"O Allah's Apostle! Shall I receive a reward if I spend for the sustenance of Abu Salama's offspring, and in fact they are also my sons?\" The Prophet replied, \"Spend on them and you will get a reward for what you spend on them.\"",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "1586",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا أنه الحج، فلما قدمنا تطوفنا بالبيت، فأمر النبي صلى الله عليه وسلم من لم يكن ساق الهدى أن يحل، فحل من لم يكن ساق الهدى، ونساؤه لم يسقن فأحللن، قالت عائشة  رضى الله عنها  فحضت فلم أطف بالبيت، فلما كانت ليلة الحصبة قالت يا رسول الله، يرجع الناس بعمرة وحجة وأرجع أنا بحجة قال ‏\"‏ وما طفت ليالي قدمنا مكة ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فاذهبي مع أخيك إلى التنعيم، فأهلي بعمرة ثم موعدك كذا وكذا ‏\"‏‏.‏ قالت صفية ما أراني إلا حابستهم‏.‏ قال ‏\"‏ عقرى حلقى، أوما طفت يوم النحر ‏\"‏‏.‏ قالت قلت بلى‏.‏ قال ‏\"‏ لا بأس، انفري ‏\"‏‏.‏ قالت عائشة  رضى الله عنها  فلقيني النبي صلى الله عليه وسلم وهو مصعد من مكة، وأنا منهبطة عليها، أو أنا مصعدة وهو منهبط منها‏.‏",
      "text_en": " Narrated Al-Aswad:                     ' Aisha said, We went out with the Prophet (from Medina) with the intention of performing Hajj only and when we reached Mecca we performed Tawaf round the Ka`ba and then the Prophet ordered those who had not driven the Hadi along with them to finish their Ihram. So the people who had not driven the Hadi along with them finished their Ihram. The Prophet's wives, too, had not driven the Hadi with them, so they too, finished their Ihram.\" `Aisha added, \"I got my menses and could not perform Tawaf round the Ka`ba.\" So when it was the night of Hasba (i.e. when we stopped at Al-Muhassab), I said, 'O Allah's Apostle! Everyone is returning after performing Hajj and `Umra but I am returning after performing Hajj only.' He said, 'Didn't you perform Tawaf round the Ka`ba the night we reached Mecca?' I replied in the negative. He said, 'Go with your brother to Tan`im and assume the Ihram for `Umra, (and after performing it) come back to such and such a place.' On that Safiya said, 'I feel that I will detain you all.' The Prophet said, 'O 'Aqra Halqa! Didn't you perform Tawaf of the Ka`ba on the day of sacrifice? (i.e. Tawaf-al-ifada) Safiya replied in the affirmative. He said, (to Safiya). 'There is no harm for you to proceed on with us.' \" `Aisha added, \"(after returning from `Umra), the Prophet met me while he was ascending (from Mecca) and I was descending to it, or I was ascending and he was descending.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1778",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا طلحة بن يحيى، حدثنا يونس، عن الزهري، عن سالم، عن ابن عمر  رضى الله عنهما  أنه كان يرمي الجمرة الدنيا بسبع حصيات، يكبر على إثر كل حصاة، ثم يتقدم حتى يسهل فيقوم مستقبل القبلة فيقوم طويلا، ويدعو ويرفع يديه، ثم يرمي الوسطى، ثم يأخذ ذات الشمال فيستهل ويقوم مستقبل القبلة فيقوم طويلا ويدعو ويرفع يديه، ويقوم طويلا، ثم يرمي جمرة ذات العقبة من بطن الوادي، ولا يقف عندها ثم ينصرف فيقول هكذا رأيت النبي صلى الله عليه وسلم يفعله‏.‏",
      "text_en": " Narrated Salim:                     Ibn `Umar used to do Rami of the Jamrat-ud-Dunya (the Jamra near to the Khaif mosque) with seven small stones and used to recite Takbir on throwing every pebble. He then would go ahead till he reached the level ground where he would stand facing the Qibla for a long time to invoke (Allah) while raising his hands (while invoking). Then he would do Rami of the Jamrat-ul-Wusta (middle Jamra) and then he would go to the left towards the middle ground, where he would stand facing the Qibla. He would remain standing there for a long period to invoke (Allah) while raising his hands, and would stand there for a long period. Then he would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it, and then he would leave and say, \"I saw the Prophet doing like this.\"",
      "chain": [
        "30203",
        "11863",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1865",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم افتتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا، فإن هذا بلد حرم الله يوم خلق السموات والأرض، وهو حرام بحرمة الله إلى يوم القيامة، وإنه لم يحل القتال فيه لأحد قبلي، ولم يحل لي إلا ساعة من نهار، فهو حرام بحرمة الله إلى يوم القيامة، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها، ولا يختلى خلاها ‏\"‏‏.‏ قال العباس يا رسول الله‏.‏ إلا الإذخر، فإنه لقينهم ولبيوتهم‏.‏ قال قال ‏\"‏ إلا الإذخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of the conquest of Mecca, the Prophet said, \"There is no more emigration (from Mecca) but Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No doubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth and will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting was not permissible in it for anyone before me, and even for me it was allowed only for a portion of a day. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be uprooted and its game should not be chased; and its luqata (fallen things) should not be picked up except by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" Al-`Abbas said, \"O Allah's Apostle! Except Al-Idhkhir, (for it is used by their blacksmiths and for their domestic purposes).\" So, the Prophet said, \"Except Al-Idhkhir.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1937",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  جاء رجل إلى النبي صلى الله عليه وسلم فقال إن الأخر وقع على امرأته في رمضان‏.‏ فقال ‏\"‏ أتجد ما تحرر رقبة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فتستطيع أن تصوم شهرين متتابعين ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ أفتجد ما تطعم به ستين مسكينا ‏\"‏‏.‏ قال لا‏.‏ قال فأتي النبي صلى الله عليه وسلم بعرق فيه تمر  وهو الزبيل  قال ‏\"‏ أطعم هذا عنك ‏\"‏‏.‏ قال على أحوج منا ما بين لابتيها أهل بيت أحوج منا‏.‏ قال ‏\"‏ فأطعمه أهلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet and said, \"I had sexual intercourse with my wife on Ramadan (while fasting).\" The Prophet asked him, \"Can you afford to manumit a slave?\" He replied in the negative. The Prophet asked him, \"Can you fast for two successive months?\" He replied in the negative. He asked him, \"Can you afford to feed sixty poor persons?\" He replied in the negative. (Abu Huraira added): Then a basket full of dates was brought to the Prophet and he said (to that man), \"Feed (poor people) with this by way of atonement.\" He said, \"(Should I feed it) to poorer people than we? There is no poorer house than ours between its (Medina's) mountains.\" The Prophet said, \"Then feed your family with it.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "1964",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد، قالا أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت نهى رسول الله صلى الله عليه وسلم عن الوصال، رحمة لهم فقالوا إنك تواصل‏.‏ قال ‏\"‏ إني لست كهيئتكم، إني يطعمني ربي ويسقين ‏\"‏‏.‏ قال أبو عبد الله لم يذكر عثمان رحمة لهم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle forbade Al-Wisal out of mercy to them. They said to him, \"But you practice Al- Wisal?\" He said, \"I am not similar to you, for my Lord gives me food and drink. \"",
      "chain": [
        "30203",
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2065",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن مسروق، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ إذا أنفقت المرأة من طعام بيتها، غير مفسدة، كان لها أجرها بما أنفقت، ولزوجها بما كسب، وللخازن مثل ذلك، لا ينقص بعضهم أجر بعض شيئا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"If a woman gives in charity from her house meals without wasting (i.e. being extravagant), she will get the reward for her giving, and her husband will also get the reward for his earning and the storekeeper will also get a similar reward. The acquisition of the reward of none of them will reduce the reward of the others.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2443",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، وحميد الطويل، سمعا أنس بن مالك  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Help your brother, whether he is an oppressor or he is an oppressed one.\"",
      "chain": [
        "30203",
        "20468",
        "11436",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2536",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت اشتريت بريرة فاشترط أهلها ولاءها، فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ أعتقيها، فإن الولاء لمن أعطى الورق ‏\"‏‏.‏ فأعتقتها، فدعاها النبي صلى الله عليه وسلم فخيرها من زوجها فقالت لو أعطاني كذا وكذا ما ثبت عنده‏.‏ فاختارت نفسها‏.‏",
      "text_en": " Narrated `Aisha:                     I bought Buraira but her masters put the condition that her Wala' would be for them. I told the Prophet about it. He said (to me), \"Manumit her as her Wala' will be for the one who pays the price.\" So, I manumitted her. The Prophet called Buraira and gave her the option of either staying with her husband or leaving him. She said, \"Even if he gave me so much money, I would not stay with him,\" and so she preferred her freedom to her husband.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2669",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، قال قال عبد الله من حلف على يمين يستحق بها مالا لقي الله وهو عليه غضبان، ثم أنزل الله تصديق ذلك ‏{‏إن الذين يشترون بعهد الله وأيمانهم‏}‏ إلى ‏{‏عذاب أليم‏}‏‏.‏  ثم إن الأشعث بن قيس خرج إلينا فقال ما يحدثكم أبو عبد الرحمن فحدثناه بما، قال، فقال صدق لفي أنزلت، كان بيني وبين رجل خصومة في شىء، فاختصمنا إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ شاهداك أو يمينه ‏\"‏‏.‏ فقلت له إنه إذا يحلف ولا يبالي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من حلف على يمين يستحق بها مالا وهو فيها فاجر لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديق ذلك، ثم اقترأ هذه الآية‏.‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah (bin Mas`ud) said, \"Whoever takes a (false) oath in order to grab some property (unjustly), Allah will be angry with him when he will meet Him. Allah confirmed that through His Divine Revelation: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . they will have a painful punishment.\" (3.77) Al-Ash'ath bin Qais came to us and asked, 'What is Abu `Abdur-Rahman (i.e. `Abdullah) telling you? 'We told him what he was narrating to us. He said, 'He was telling the truth; this Divine Verse was revealed in connection with me. There was a dispute between me and another man about something and the case was filed before Allah's Apostle who said, 'Produce your two witnesses or else the defendant is to take an oath.' I said, The defendant will surely take a (false) oath caring for nothing.' The Prophet said, 'Whoever takes a false oath in order to grab (other's) property, then Allah will be angry with him when he will meet Him.' Then Allah revealed its confirmation. Al-Ashath then recited the above Divine Verse.\" (3.77)",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "485"
      ]
    },
    {
      "hadith_no": "2964",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، قال قال عبد الله  رضى الله عنه  لقد أتاني اليوم رجل فسألني عن أمر ما دريت ما أرد عليه، فقال أرأيت رجلا مؤديا نشيطا، يخرج مع أمرائنا في المغازي، فيعزم علينا في أشياء لا نحصيها‏.‏ فقلت له والله ما أدري ما أقول لك إلا أنا كنا مع النبي صلى الله عليه وسلم فعسى أن لا يعزم علينا في أمر إلا مرة حتى نفعله، وإن أحدكم لن يزال بخير ما اتقى الله، وإذا شك في نفسه شىء سأل رجلا فشفاه منه، وأوشك أن لا تجدوه، والذي لا إله إلا هو ما أذكر ما غبر من الدنيا إلا كالثغب شرب صفوه وبقي كدره‏.‏",
      "text_en": " Narrated `Abdullah:                     Today a man came to me and asked me a question which I did not know how to answer. He said, \"Tell me, if a wealthy active man, well-equipped with arms, goes out on military expeditions with our chiefs, and orders us to do such things as we cannot do (should we obey him?)\" I replied, \"By Allah, I do not know what to reply you, except that we, were in the company of the Prophet and he used to order us to do a thing once only till we finished it. And no doubt, everyone among you will remain in a good state as long as he obeys Allah. If one is in doubt as to the legality of something, he should ask somebody who would satisfy him, but soon will come a time when you will not find such a man. By Him, except Whom none has the right to be worshipped. I see that the example of what has passed of this life (to what remains thereof) is like a pond whose fresh water has been used up and nothing remains but muddy water.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3150",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال لما كان يوم حنين آثر النبي صلى الله عليه وسلم أناسا في القسمة، فأعطى الأقرع بن حابس مائة من الإبل، وأعطى عيينة مثل ذلك، وأعطى أناسا من أشراف العرب، فآثرهم يومئذ في القسمة‏.‏ قال رجل والله إن هذه القسمة ما عدل فيها، وما أريد بها وجه الله‏.‏ فقلت والله لأخبرن النبي صلى الله عليه وسلم‏.‏ فأتيته فأخبرته فقال ‏\"‏ فمن يعدل إذا لم يعدل الله ورسوله رحم الله موسى قد أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     On the day (of the battle) of Hunain, Allah's Apostle favored some people in the distribution of the booty (to the exclusion of others); he gave Al-Aqra' bin H`Abis one-hundred camels and he gave 'Uyaina the same amount, and also gave to some of the eminent Arabs, giving them preference in this regard. Then a person came and said, \"By Allah, in this distribution justice has not been observed, nor has Allah's Pleasure been aimed at.\" I said (to him), \"By Allah, I will inform the Prophet (of what you have said), \"I went and informed him, and he said, \"If Allah and His Apostle did not act justly, who else would act justly. May Allah be merciful to Moses, for he was harmed with more than this, yet he kept patient.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال ذكر عند النبي صلى الله عليه وسلم رجل نام ليله حتى أصبح، قال ‏\"‏ ذاك رجل بال الشيطان في أذنيه  أو قال  في أذنه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     It was mentioned before the Prophet that there was a man who slept the night till morning (after sunrise). The Prophet said, \"He is a man in whose ears (or ear) Satan had urinated.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن المنهال، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يعوذ الحسن والحسين ويقول ‏\"‏ إن أباكما كان يعوذ بها إسماعيل وإسحاق، أعوذ بكلمات الله التامة من كل شيطان وهامة، ومن كل عين لامة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to seek Refuge with Allah for Al-Hasan and Al-Husain and say: \"Your forefather (i.e. Abraham) used to seek Refuge with Allah for Ishmael and Isaac by reciting the following: 'O Allah! I seek Refuge with Your Perfect Words from every devil and from poisonous pests and from every evil, harmful, envious eye.' \"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3571",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت استأذن حسان النبي صلى الله عليه وسلم في هجاء المشركين، قال ‏\"‏ كيف بنسبي ‏\"‏‏.‏ فقال حسان لأسلنك منهم كما تسل الشعرة من العجين‏.‏ وعن أبيه قال ذهبت أسب حسان عند عائشة فقالت لا تسبه فإنه كان ينافح عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     Once Hassan bin Thabit asked the permission of the Prophet to lampoon (i.e. compose satirical poetry defaming) the infidels. The Prophet said, \"What about the fact that I have common descent with them?\" Hassan replied, \"I shall take you out of them as a hair is taken out of dough.\" Narrated `Urwa: I started abusing Hassan in front of `Aisha, whereupon she said. \"Don't abuse him, for he used to defend the Prophet (with his poetry).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3903",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، حدثني سعيد بن جبير، أو قال حدثني الحكم، عن سعيد بن جبير، قال أمرني عبد الرحمن بن أبزى قال سل ابن عباس عن هاتين الآيتين، ما أمرهما ‏{‏ولا تقتلوا النفس التي حرم الله ‏}‏ ‏{‏ومن يقتل مؤمنا متعمدا‏}‏ فسألت ابن عباس فقال لما أنزلت التي في الفرقان قال مشركو أهل مكة فقد قتلنا النفس التي حرم الله، ودعونا مع الله إلها آخر، وقد أتينا الفواحش‏.‏ فأنزل الله ‏{‏إلا من تاب وآمن‏}‏ الآية فهذه لأولئك وأما التي في النساء الرجل إذا عرف الإسلام وشرائعه، ثم قتل فجزاؤه جهنم‏.‏ فذكرته لمجاهد فقال إلا من ندم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     `AbdurRahman bin Abza said, \"Ask Ibn `Abbas about these two Qur'anic Verses: 'Nor kill such life as Allah has made sacred, Except for just cause.' (25.168) \"And whoever kills a believer intentionally, his recompense is Hell. (4.93) So I asked Ibn `Abbas who said, \"When the Verse that is in Sura-al-Furqan was revealed, the pagans of Mecca said, 'But we have slain such life as Allah has made sacred, and we have invoked other gods along with Allah, and we have also committed fornication.' So Allah revealed:-- 'Except those who repent, believe, and do good-- (25.70) So this Verse was concerned with those people. As for the Verse in Surat-an-Nisa (4-93), it means that if a man, after understanding Islam and its laws and obligations, murders somebody, then his punishment is to dwell in the (Hell) Fire forever.\" Then I mentioned this to Mujahid who said, \"Except the one who regrets (one's crime) . \"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11050",
        "11069",
        "11050"
      ]
    },
    {
      "hadith_no": "4029",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عثمان، حدثنا عبدة، عن هشام، عن أبيه، عن ابن عمر  رضى الله عنهما  قال وقف النبي صلى الله عليه وسلم على قليب بدر فقال ‏{‏هل وجدتم ما وعد ربكم حقا ثم قال إنهم الآن يسمعون ما أقول‏}‏  فذكر لعائشة فقالت إنما قال النبي صلى الله عليه وسلم ‏\"‏ إنهم الآن ليعلمون أن الذي كنت أقول لهم هو الحق ‏\"‏‏.‏ ثم قرأت ‏{‏إنك لا تسمع الموتى‏}‏ حتى قرأت الآية‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet stood at the well of Badr (which contained the corpses of the pagans) and said, \"Have you found true what your lord promised you?\" Then he further said, \"They now hear what I say.\" This was mentioned before `Aisha and she said, \"But the Prophet said, 'Now they know very well that what I used to tell them was the truth.' Then she recited (the Holy Verse):-- \"You cannot make the dead hear... ...till the end of Verse).\" (30.52)",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "18"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن عائشة، رضى الله عنها ‏{‏إذ جاءوكم من فوقكم ومن أسفل منكم وإذ زاغت الأبصار‏}‏ قالت كان ذاك يوم الخندق‏.‏",
      "text_en": " Narrated `Aisha:                     As regards the following Qur'anic Verse:-- \"When they came on you from above and from below you (from east and west of the valley) and when the eyes grew wild and the hearts reached up to the throats.....\" (33.10) That happened on the day of Al-Khandaq (i.e. Trench).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4197",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، قال ذهبت أسب حسان عند عائشة فقالت لا تسبه، فإنه كان ينافح عن رسول الله صلى الله عليه وسلم‏.‏ وقالت عائشة استأذن النبي صلى الله عليه وسلم في هجاء المشركين قال ‏\"‏ كيف بنسبي ‏\"‏‏.‏ قال لأسلنك منهم كما تسل الشعرة من العجين‏.‏",
      "text_en": " Narrated Hisham's father:                     I started abusing Hassan in front of `Aisha. She said, \"Do not abuse him as he used to defend Allah's Apostle (against the infidels). `Aisha added, \"Once Hassan took the permission from the Prophet to say poetic verses against the infidels. On that the Prophet said, 'How will you exclude my forefathers (from that)? Hassan replied, 'I will take you out of them as one takes a hair out of the dough.\" Hisham's father added, \"I abused Hassan as he was one of those who spoke against `Aisha.\"",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "4298",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن مجاهد، قال دخلت أنا وعروة بن الزبير المسجد، فإذا عبد الله بن عمر  رضى الله عنهما  جالس إلى حجرة عائشة ثم قال كم اعتمر النبي صلى الله عليه وسلم قال أربعا ‏{‏إحداهن في رجب‏}‏  ثم سمعنا استنان، عائشة قال عروة يا أم المؤمنين ألا تسمعين ما يقول أبو عبد الرحمن إن النبي صلى الله عليه وسلم اعتمر أربع عمر‏.‏ فقالت ما اعتمر النبي صلى الله عليه وسلم عمرة إلا وهو شاهده، وما اعتمر في رجب قط‏.‏",
      "text_en": " Narrated Mujahid:                     `Urwa and I entered the Mosque and found `Abdullah bin `Umar sitting beside the dwelling place of `Aisha. `Urwa asked (Ibn `Umar), \"How many `Umras did the Prophet perform?\" Ibn `Umar replied, \"Four, one of which was in Rajab.\" Then we heard `Aisha brushing her teeth whereupon `Urwa said, \"O mother of the believers! Don't you hear what Abu `Abdur-Rahman is saying? He is saying that the Prophet performed four `Umra, one of which was in Rajab.\" `Aisha said, \"The Prophet did not perform any `Umra but he (i.e. Ibn `Umar) witnessed it. And he (the Prophet ) never did any `Umra in (the month of) Rajab.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028"
      ]
    },
    {
      "hadith_no": "4517",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عمرو بن شرحبيل، عن عبد الله، قال سألت النبي صلى الله عليه وسلم أى الذنب أعظم عند الله قال ‏\"‏ أن تجعل لله ندا وهو خلقك ‏\"‏‏.‏ قلت إن ذلك لعظيم، قلت ثم أى قال ‏\"‏ وأن تقتل ولدك تخاف أن يطعم معك ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ أن تزاني حليلة جارك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I asked the Prophet, \"What is the greatest sin in the Sight of Allah?\" He said, \"That you set up a rival unto Allah though He Alone created you.\" I said, \"That is indeed a great sin.\" Then asked, \"What is next?\" He said, \"To kill your son lest he should share your food with you.\" I asked, \"What is next?\" He said, \"To commit illegal sexual intercourse with the wife of your neighbor.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "11644",
        "16"
      ]
    },
    {
      "hadith_no": "4999",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي  رضى الله عنه  قال كنا في جنازة في بقيع الغرقد، فأتانا رسول الله صلى الله عليه وسلم فقعد وقعدنا حوله، ومعه مخصرة فنكس، فجعل ينكت بمخصرته ثم قال ‏\"‏ ما منكم من أحد وما من نفس منفوسة إلا كتب مكانها من الجنة والنار، وإلا قد كتبت شقية أو سعيدة ‏\"‏‏.‏ قال رجل يا رسول الله أفلا نتكل على كتابنا وندع العمل فمن كان منا من أهل السعادة فسيصير إلى أهل السعادة، ومن كان منا من أهل الشقاء فسيصير إلى عمل أهل الشقاوة‏.‏ قال ‏\"‏ أما أهل السعادة فييسرون لعمل أهل السعادة وأما أهل الشقاوة فييسرون لعمل أهل الشقاء ‏\"‏‏.‏ ثم قرأ ‏{‏فأما من أعطى واتقى * وصدق بالحسنى‏}‏ الآية‏.‏",
      "text_en": " Narrated `Ali:                     While we were in a funeral procession in Baqi Al-Gharqad, Allah's Apostle came and sat down, and we sat around him. He had a small stick in his hand and he bent his head and started scraping the ground with it. He then said, \"There is none among you, and no created soul but has his place written for him either in Paradise or in the Hell-Fire, and also has his happy or miserable fate (in the Hereafter) written for him.\" A man said, \"O Allah's Apostle! Shall we depend upon what is written for us and give up doing (good) deeds? For whoever among us is destined to be fortunate (in the Hereafter), will join the fortunate peoples and whoever among us is destined to be miserable will do such deeds as are characteristic of the people who are destined to misery.\" The Prophet said, \"Those who are destined to be happy (in the Hereafter) will find it easy and pleasant to do the deeds characteristic of those destined to happiness, while those who are to be among the miserable (in the Hereafter), will find it easy to do the deeds characteristic of those destined to misery.\" Then he recited: 'As for him who gives (in charity) and keeps his duty to Allah and believes in the Best reward from Allah, We will make smooth for him the path of ease. But he who is a greedy miser and thinks himself self sufficient, and gives the lie to the Best reward from Allah we will make smooth for him the path for evil.' (92.5-10)",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "5020",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده ‏\"‏ سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏ يتأول القرآن‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle used to say very often in bowing and prostration (during his prayers), Subhanka Allahumma Rabbana wa bihamdika; Allahumma ighfirli,\" according to the order of the Qur'an.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5085",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، مثله‏.‏ تابعه بشر عن ابن المبارك، عن شعبة،‏.‏ وتابعه ابن جريج عن عبدة، عن شقيق، سمعت عبد الله، سمعت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah:                     I heard the Prophet saying... (as above, no. 550).",
      "chain": [
        "30203",
        "20028",
        "20025",
        "20337",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "5290",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال المخنث لأخي أم سلمة عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا أدلك على ابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هذا عليكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     that while the Prophet was with her, there was an effeminate man in the house. The effeminate man said to Um Salama's brother, `Abdullah bin Abi Umaiyya, \"If Allah should make you conquer Ta'if tomorrow, I recommend that you take the daughter of Ghailan (in marriage) for (she is so fat) that she shows four folds of flesh when facing you and eight when she turns her back.\" Thereupon the Prophet said (to us), \"This (effeminate man) should not enter upon you (anymore).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5454",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عثمان بن أبي شيبة، أخبرنا جرير، عن منصور، عن علي بن الأقمر، عن أبي جحيفة، قال كنت عند النبي صلى الله عليه وسلم فقال لرجل عنده ‏\"‏ لا آكل وأنا متكئ ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     While I was with the Prophet he said to a man who was with him, \"I do not take my meals while leaning.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11375",
        "4047"
      ]
    },
    {
      "hadith_no": "5655",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثني عثمان، حدثنا جرير، عن منصور، عن إبراهيم، قلت للأسود هل سألت عائشة أم المؤمنين عما يكره أن ينتبذ فيه فقال نعم قلت يا أم المؤمنين عما نهى النبي صلى الله عليه وسلم أن ينتبذ فيه قالت نهانا في ذلك أهل البيت أن ننتبذ في الدباء والمزفت‏.‏ قلت أما ذكرت الجر والحنتم قال إنما أحدثك ما سمعت، أفأحدث ما لم أسمع",
      "text_en": " Narrated Ibrahim:                     I asked Al-Aswad, \"Did you ask `Aisha, Mother of the Believers, about the containers in which it is disliked to prepare (non-alcoholic) drinks?\" He said, \"Yes, I said to her, 'O Mother of the Believers! What containers did the Prophet forbid to use for preparing (non-alcoholic) drinks?\" She said, 'The Prophet forbade us, (his family), to prepare (nonalcoholic) drinks in Ad-Dubba and Al-Muzaffat.' I asked, 'Didn't you mention Al Jar and Al Hantam?' She said, 'I tell what I have heard; shall I tell you what I have not heard?' \"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "53"
      ]
    },
    {
      "hadith_no": "5994",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، لعن الله الواشمات، والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله تعالى، مالي لا ألعن من لعن النبي صلى الله عليه وسلم وهو في كتاب الله ‏{‏وما آتاكم الرسول فخذوه‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah has cursed those women who practise tattooing and those who get themselves tattooed, and those who remove their face hairs, and those who create a space between their teeth artificially to look beautiful, and such women as change the features created by Allah. Why then should I not curse those whom the Prophet has cursed? And that is in Allah's Book. i.e. His Saying: 'And what the Apostle gives you take it and what he forbids you abstain (from it).' (59.7)",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "6161",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الصدق يهدي إلى البر، وإن البر يهدي إلى الجنة، وإن الرجل ليصدق حتى يكون صديقا، وإن الكذب يهدي إلى الفجور، وإن الفجور يهدي إلى النار، وإن الرجل ليكذب، حتى يكتب عند الله كذابا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Truthfulness leads to righteousness, and righteousness leads to Paradise. And a man keeps on telling the truth until he becomes a truthful person. Falsehood leads to Al-Fajur (i.e. wickedness, evil-doing), and Al-Fajur (wickedness) leads to the (Hell) Fire, and a man may keep on telling lies till he is written before Allah, a liar.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6183",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن عدي بن ثابت، حدثنا سليمان بن صرد، قال استب رجلان عند النبي صلى الله عليه وسلم ونحن عنده جلوس، وأحدهما يسب صاحبه مغضبا قد احمر وجهه فقال النبي صلى الله عليه وسلم ‏\"‏ إني لأعلم كلمة لو قالها لذهب عنه ما يجد لو قال أعوذ بالله من الشيطان الرجيم ‏\"‏‏.‏ فقالوا للرجل ألا تسمع ما يقول النبي صلى الله عليه وسلم قال إني لست بمجنون‏.‏",
      "text_en": " Narrated Sulaiman bin Sarad:                     Two men abused each other in front of the Prophet while we were sitting with him. One of the two abused his companion furiously and his face became red. The Prophet said, \"I know a word (sentence) the saying of which will cause him to relax if this man says it. Only if he said, \"I seek refuge with Allah from Satan, the outcast.' \" So they said to that (furious) man, 'Don't you hear what the Prophet is saying?\" He said, \"I am not mad.\"",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11372",
        "383"
      ]
    },
    {
      "hadith_no": "6331",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، حدثنا أنس بن مالك  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا سلم عليكم أهل الكتاب فقولوا وعليكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     the Prophet said, \"If the people of the Scripture greet you, then you should say (in reply), 'Wa'alaikum (And on you).' \"",
      "chain": [
        "30203",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6363",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏{‏إذا كنتم ثلاثة فلا يتناجى رجلان دون الآخر، حتى تختلطوا بالناس، أجل أن يحزنه‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"When you are three persons sitting together, then no two of you should hold secret counsel excluding the third person until you are with some other people too, for that would grieve him.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6402",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال كنا نقول في الصلاة السلام على الله، السلام على فلان‏.‏ فقال لنا النبي صلى الله عليه وسلم ذات يوم ‏\"‏ إن الله هو السلام، فإذا قعد أحدكم في الصلاة فليقل التحيات لله إلى قوله الصالحين‏.‏ فإذا قالها أصاب كل عبد لله في السماء والأرض صالح، أشهد أن لا إله إلا الله، وأشهد أن محمدا عبده ورسوله‏.‏ ثم يتخير من الثناء ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to say in the prayer: 'AsSalam be on Allah, As-Salam be on so-and so.' So one day the Prophet said to us, \"Allah Himself is As-Salam; when anyone of you sits during his prayer, he should say: 'at-tah, iyyatu-li l-lahi,' up to 'As-Salihin,' (All the compliments are for Allah ...righteous people) for when he recites this, then he says his Salam to all the righteous people present in the heavens and on the earth. Then he should say, 'I testify that none has the right to be worshipped except Allah, and that Muhammad is His slave and His Apostle,' and then he can select whatever he likes to celebrate (Allah's) Praises.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6409",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت سمع النبي صلى الله عليه وسلم رجلا يقرأ في المسجد فقال ‏\"‏ رحمه الله، لقد أذكرني كذا وكذا آية أسقطتها في سورة كذا وكذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet heard a man reciting (the Qur'an) in the mosque. He said,\" May Allah bestow His Mercy on him, as he made me remember such and-such Verse which I had missed in such-and-such Sura.\"",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6440",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن مسروق، عن عائشة، قالت دخلت على عجوزان من عجز يهود المدينة فقالتا لي إن أهل القبور يعذبون في قبورهم، فكذبتهما، ولم أنعم أن أصدقهما، فخرجتا ودخل على النبي صلى الله عليه وسلم فقلت له يا رسول الله إن عجوزين وذكرت له، فقال ‏\"‏ صدقتا، إنهم يعذبون عذابا تسمعه البهائم كلها ‏\"‏‏.‏ فما رأيته بعد في صلاة إلا تعوذ من عذاب القبر‏.‏",
      "text_en": " Narrated `Aisha:                     Two old ladies from among the Jewish ladies entered upon me and said' \"The dead are punished in their graves,\" but I thought they were telling a lie and did not believe them in the beginning. When they went away and the Prophet entered upon me, I said, \"O Allah's Apostle! Two old ladies..\" and told him the whole story. He said, \"They told the truth; the dead are really punished, to the extent that all the animals hear (the sound resulting from) their punishment.\" Since then I always saw him seeking refuge with Allah from the punishment of the grave in his prayers.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "6461",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن سالم، عن كريب، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لو أن أحدهم إذا أراد أن يأتي أهله قال باسم الله، اللهم جنبنا الشيطان، وجنب الشيطان ما رزقتنا، فإنه إن يقدر بينهما ولد في ذلك، لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, when intending to have a sexual intercourse with his wife, says: 'Bismillah, Allahumma jannibna-sh-shaitan, wa jannibi-sh-shaitan ma razaqtana,' and if the couple are destined to have a child (out of that very sexual relation), then Satan will never be able to harm that child.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "6531",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت ما شبع آل محمد صلى الله عليه وسلم منذ قدم المدينة من طعام بر ثلاث ليال تباعا حتى قبض‏.‏",
      "text_en": " Narrated `Aisha:                     The family of Muhammad had never eaten their fill of wheat bread for three successive days since they had migrated to Medina till the death of the Prophet.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "6543",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال سألت أم المؤمنين عائشة قلت يا أم المؤمنين كيف كان عمل النبي صلى الله عليه وسلم هل كان يخص شيئا من الأيام قالت لا، كان عمله ديمة، وأيكم يستطيع ما كان النبي صلى الله عليه وسلم يستطيع‏.‏",
      "text_en": " Narrated 'Alqama:                     I asked `Aisha, mother of the believers, \"O mother of the believers! How were the deeds of the Prophet? Did he use to do extra deeds of worship on special days?\" She said, \"No, but his deeds were regular and constant, and who among you is able to do what the Prophet was able to do (i.e. in worshipping Allah)?\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "6558",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن ربعي، عن حذيفة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كان رجل ممن كان قبلكم يسيء الظن بعمله، فقال لأهله إذا أنا مت فخذوني فذروني، في البحر في يوم صائف، ففعلوا به، فجمعه الله ثم قال ما حملك على الذي صنعت قال ما حملني إلا مخافتك‏.‏ فغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"There was a man amongst the people who had suspicion as to the righteousness of his deeds. Therefore he said to his family, 'If I die, take me and burn my corpse and throw my ashes into the sea on a hot (or windy) day.' They did so, but Allah, collected his particles and asked (him), What made you do what you did?' He replied, 'The only thing that made me do it, was that I was afraid of You.' So Allah forgave him.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6651",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ إني لأعلم آخر أهل النار خروجا منها، وآخر أهل الجنة دخولا رجل يخرج من النار كبوا، فيقول الله اذهب فادخل الجنة‏.‏ فيأتيها فيخيل إليه أنها ملأى، فيرجع فيقول يا رب وجدتها ملأى، فيقول اذهب فادخل الجنة‏.‏ فيأتيها فيخيل إليه أنها ملأى‏.‏ فيقول يا رب وجدتها ملأى، فيقول اذهب فادخل الجنة، فإن لك مثل الدنيا وعشرة أمثالها‏.‏ أو إن لك مثل عشرة أمثال الدنيا‏.‏ فيقول تسخر مني، أو تضحك مني وأنت الملك ‏\"‏‏.‏ فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه، وكان يقال ذلك أدنى أهل الجنة منزلة‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"I know the person who will be the last to come out of the (Hell) Fire, and the last to enter Paradise. He will be a man who will come out of the (Hell) Fire crawling, and Allah will say to him, 'Go and enter Paradise.' He will go to it, but he will imagine that it had been filled, and then he will return and say, 'O Lord, I have found it full.' Allah will say, 'Go and enter Paradise, and you will have what equals the world and ten times as much (or, you will have as much as ten times the like of the world).' On that, the man will say, 'Do you mock at me (or laugh at me) though You are the King?\" I saw Allah's Apostle (while saying that) smiling that his premolar teeth became visible. It is said that will be the lowest in degree amongst the people of Paradise.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    }
  ],
  "total_hadiths": 504
}