{
  "id": "30207",
  "name": "Frwh bin Abi al-Mghra'a فروة بن أبي المغراء",
  "full_name": "Frwh bin Abi al-Mghra'a فروة بن أبي المغراء",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "225",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  ت  -  صدوق ]"
    ],
    "tags": [
      "al-Kundi",
      "Kufi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ خ  ت  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ خ  ت  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ خ  ت  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Kundi",
        "ar": "al-Kundi",
        "ckb": "al-Kundi"
      },
      {
        "en": "Kufi",
        "ar": "Kufi",
        "ckb": "Kufi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20341",
      "name": "'Ubaid'h bin Hameed عبيدة بن حميد",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20111",
      "name": "Ibrahim bin al-Mukhtar al-Tamimi إبراهيم بن المختار التميمي حبويه",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "27362",
      "name": "al-Walid bin Abi Thwr Sm' الوليد بن أبي ثور",
      "grade": "Succ. (Taba' Tabi')",
      "grade_display": {
        "en": "Successor (Taba' Tabi')",
        "ar": "تابع التابعين",
        "ckb": "شوێنكەوتووی شوێنكەوتوو"
      }
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "25265",
      "name": "Muhammad bin Sulaiman محمد بن سليمان بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20350",
      "name": "al-Qasim bin Malik al-Mzny القاسم بن مالك المزني أبو جعفر الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "38001",
      "name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "38549",
      "name": "Muhammad bin 'Uthman bin Abi Safwan محمد بن عثمان بن أبي صفوان",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1390-3",
      "hadith_no": "1390",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا فروة، حدثنا علي، عن هشام بن عروة، عن أبيه، لما سقط عليهم الحائط في زمان الوليد بن عبد الملك أخذوا في بنائه، فبدت لهم قدم ففزعوا، وظنوا أنها قدم النبي صلى الله عليه وسلم فما وجدوا أحدا يعلم ذلك حتى قال لهم عروة لا والله ما هي قدم النبي صلى الله عليه وسلم ما هي إلا قدم عمر  رضى الله عنه ‏.‏",
      "text_en": " Narrated `Urwa:                     When the wall fell on them (i.e. graves) during the caliphate of Al-Walid bin `Abdul Malik, the people started repairing it, and a foot appeared to them. The people got scared and thought that it was the foot of the Prophet. No one could be found who could tell them about it till I (`Urwa) said to them, \"By Allah, this is not the foot of the Prophet but it is the foot of `Umar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30207",
        "30026",
        "11065"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1691",
      "hadith_no": "1691",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، قال عروة كان الناس يطوفون في الجاهلية عراة إلا الحمس، والحمس قريش وما ولدت، وكانت الحمس يحتسبون على الناس يعطي الرجل الرجل الثياب يطوف فيها، وتعطي المرأة المرأة الثياب تطوف فيها، فمن لم يعطه الحمس طاف بالبيت عريانا، وكان يفيض جماعة الناس من عرفات، ويفيض الحمس من جمع‏.‏ قال وأخبرني أبي عن عائشة  رضى الله عنها  أن هذه الآية نزلت في الحمس ‏{‏ثم أفيضوا من حيث أفاض الناس‏}‏ قال كانوا يفيضون من جمع فدفعوا إلى عرفات‏.‏",
      "text_en": " Narrated `Urwa:                     During the Pre-Islamic period of Ignorance, the people used to perform Tawaf of the Ka`ba naked except the Hums; and the Hums were Quraish and their offspring. The Hums used to give clothes to the men who would perform the Tawaf wearing them; and women (of the Hums) used to give clothes to the women who would perform the Tawaf wearing them. Those to whom the Hums did not give clothes would perform Tawaf round the Ka`ba naked. Most of the people used to go away (disperse) directly from `Arafat but they (Hums) used to depart after staying at Al-Muzdalifa. `Urwa added, \"My father narrated that `Aisha had said, 'The following verses were revealed about the Hums: Then depart from the place whence all the people depart--(2.199) `Urwa added, \"They (the Hums) used to stay at Al-Muzdalifa and used to depart from there (to Mina) and so they were sent to `Arafat (by Allah's order).\"",
      "usc_msa_ref": "",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2138",
      "hadith_no": "2138",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا فروة بن أبي المغراء، أخبرنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت لقل يوم كان يأتي على النبي صلى الله عليه وسلم إلا يأتي فيه بيت أبي بكر أحد طرفى النهار، فلما أذن له في الخروج إلى المدينة لم يرعنا إلا وقد أتانا ظهرا، فخبر به أبو بكر فقال ما جاءنا النبي صلى الله عليه وسلم في هذه الساعة، إلا لأمر حدث، فلما دخل عليه قال لأبي بكر ‏\"‏ أخرج من عندك ‏\"‏‏.‏ قال يا رسول الله إنما هما ابنتاى‏.‏ يعني عائشة وأسماء‏.‏ قال ‏\"‏ أشعرت أنه قد أذن لي في الخروج ‏\"‏‏.‏ قال الصحبة يا رسول الله‏.‏ قال ‏\"‏ الصحبة ‏\"‏‏.‏ قال يا رسول الله إن عندي ناقتين أعددتهما للخروج، فخذ إحداهما‏.‏ قال ‏\"‏ قد أخذتها بالثمن ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Rarely did the Prophet fail to visit Abu Bakr's house everyday, either in the morning or in the evening. When the permission for migration to Medina was granted, all of a sudden the Prophet came to us at noon and Abu Bakr was informed, who said, \"Certainly the Prophet has come for some urgent matter.\" The Prophet said to Abu Bark, when the latter entered \"Let nobody stay in your home.\" Abu Bakr said, \"O Allah's Apostle! There are only my two daughters (namely `Aisha and Asma') present.\" The Prophet said, \"I feel (am informed) that I have been granted the permission for migration.\" Abu Bakr said, \"I will accompany you, O Allah's Apostle!\" The Prophet said, \"You will accompany me.\" Abu Bakr then said \"O Allah's Apostle! I have two she-camels I have prepared specially for migration, so I offer you one of them. The Prophet said, \"I have accepted it on the condition that I will pay its price.\"",
      "usc_msa_ref": "348",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3215",
      "hadith_no": "3215",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن الحارث بن هشام، سأل النبي صلى الله عليه وسلم كيف يأتيك الوحى قال ‏\"‏ كل ذاك يأتي الملك أحيانا في مثل صلصلة الجرس، فيفصم عني وقد وعيت ما قال، وهو أشده على، ويتمثل لي الملك أحيانا رجلا، فيكلمني فأعي ما يقول ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Al Harith bin Hisham asked the Prophet, \"How does the divine inspiration come to you?\" He replied, \"In all these ways: The Angel sometimes comes to me with a voice which resembles the sound of a ringing bell, and when this state abandons me, I remember what the Angel has said, and this type of Divine Inspiration is the hardest on me; and sometimes the Angel comes to me in the shape of a man and talks to me, and I understand and remember what he says.\"",
      "usc_msa_ref": "438",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3883",
      "hadith_no": "3883",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني فروة بن أبي المغراء، أخبرنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت أسلمت امرأة سوداء لبعض العرب، وكان لها حفش في المسجد قالت فكانت تأتينا فتحدث عندنا فإذا فرغت من حديثها قالت ويوم الوشاح من تعاجيب ربنا ألا إنه من بلدة الكفر أنجاني فلما أكثرت قالت لها عائشة وما يوم الوشاح قالت خرجت جويرية لبعض أهلي، وعليها وشاح من أدم فسقط منها، فانحطت عليه الحديا وهى تحسبه لحما، فأخذت فاتهموني به فعذبوني، حتى بلغ من أمري أنهم طلبوا في قبلي، فبينا هم حولي وأنا في كربي إذ أقبلت الحديا حتى وازت برءوسنا ثم ألقته، فأخذوه فقلت لهم هذا الذي اتهمتموني به وأنا منه بريئة‏.‏",
      "text_en": " Narrated `Aisha:                     A black lady slave of some of the 'Arabs embraced Islam and she had a hut in the mosque. She used to visit us and talk to us, and when she finished her talk, she used to say: \"The day of the scarf was one of our Lord's wonders: Verily! He has delivered me from the land of Kufr.\" When she said the above verse many times, I (i.e. `Aisha) asked her, \"What was the day of the scarf?\" She replied, \"Once the daughter of some of my masters went out and she was wearing a leather scarf (round her neck) and the leather scarf fell from her and a kite descended and picked it up, mistaking it for a piece of meat. They (i.e. my masters) accused me of stealing it and they tortured me to such an extent that they even looked for it in my private parts. So, while they all were around me, and I was in my great distress, suddenly the kite came over our heads and threw the scarf, and they took it. I said to them 'This is what you accused me of stealing, though I was innocent.\"",
      "usc_msa_ref": "176",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3942",
      "hadith_no": "3942",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت تزوجني النبي صلى الله عليه وسلم وأنا بنت ست سنين، فقدمنا المدينة فنزلنا في بني الحارث بن خزرج، فوعكت فتمرق شعري فوفى جميمة، فأتتني أمي أم رومان وإني لفي أرجوحة ومعي صواحب لي، فصرخت بي فأتيتها لا أدري ما تريد بي فأخذت بيدي حتى أوقفتني على باب الدار، وإني لأنهج، حتى سكن بعض نفسي، ثم أخذت شيئا من ماء فمسحت به وجهي ورأسي ثم أدخلتني الدار فإذا نسوة من الأنصار في البيت فقلن على الخير والبركة، وعلى خير طائر‏.‏ فأسلمتني إليهن فأصلحن من شأني، فلم يرعني إلا رسول الله صلى الله عليه وسلم ضحى، فأسلمتني إليه، وأنا يومئذ بنت تسع سنين‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet engaged me when I was a girl of six (years). We went to Medina and stayed at the home of Bani-al-Harith bin Khazraj. Then I got ill and my hair fell down. Later on my hair grew (again) and my mother, Um Ruman, came to me while I was playing in a swing with some of my girl friends. She called me, and I went to her, not knowing what she wanted to do to me. She caught me by the hand and made me stand at the door of the house. I was breathless then, and when my breathing became Allright, she took some water and rubbed my face and head with it. Then she took me into the house. There in the house I saw some Ansari women who said, \"Best wishes and Allah's Blessing and a good luck.\" Then she entrusted me to them and they prepared me (for the marriage). Unexpectedly Allah's Apostle came to me in the forenoon and my mother handed me over to him, and at that time I was a girl of nine years of age.",
      "usc_msa_ref": "234",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4023",
      "hadith_no": "4023",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا فروة، عن علي، عن هشام، عن أبيه، قال كان سيف الزبير محلى بفضة‏.‏ قال هشام وكان سيف عروة محلى بفضة‏.‏",
      "text_en": " Narrated Hisham:                     That his father said, \"The sword of Az-Zubair was decorated with silver.\" Hisham added, \"The sword of `Urwa was (also) decorated with silver. \"",
      "usc_msa_ref": "312",
      "chain": [
        "30207",
        "30026",
        "20295",
        "20295"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5211",
      "hadith_no": "5211",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  تزوجني النبي صلى الله عليه وسلم فأتتني أمي فأدخلتني الدار، فإذا نسوة من الأنصار في البيت فقلن على الخير والبركة، وعلى خير طائر‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet married me, my mother came to me and made me enter the house where I saw some women from the Ansar who said, \"May you prosper and have blessings and have good omen.\"",
      "usc_msa_ref": "86",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5215",
      "hadith_no": "5215",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثني فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت تزوجني النبي صلى الله عليه وسلم فأتتني أمي فأدخلتني الدار، فلم يرعني إلا رسول الله صلى الله عليه وسلم ضحى‏.‏",
      "text_en": " Narrated Aisha:                     When the Prophet married me, my mother came to me and made me enter the house (of the Prophet) and nothing surprised me but the coming of Allah's Apostle to me in the forenoon.",
      "usc_msa_ref": "90",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5271",
      "hadith_no": "5271",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  كان رسول الله صلى الله عليه وسلم إذا انصرف من العصر دخل على نسائه، فيدنو من إحداهن، فدخل على حفصة، فاحتبس أكثر ما كان يحتبس‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle finished his `Asr prayer, he would enter upon his wives and stay with one of them. One day he went to Hafsa and stayed with her longer than usual.",
      "usc_msa_ref": "143",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5292",
      "hadith_no": "5292",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، قالت خرجت سودة بنت زمعة ليلا فرآها عمر فعرفها فقال إنك والله يا سودة ما تخفين علينا، فرجعت إلى النبي صلى الله عليه وسلم فذكرت ذلك له، وهو في حجرتي يتعشى، وإن في يده لعرقا، فأنزل عليه فرفع عنه وهو يقول ‏\"‏ قد أذن لكن أن تخرجن لحوائجكن ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Once Sa`da bint Zam`a went out at night for some need, and `Umar saw her, and recognizing her, he said (to her), \"By Allah, O Sa`da! You cannot hide yourself from us.\" So she returned to the Prophet and mentioned that to him while he was sitting in my dwelling taking his supper and holding a bone covered with meat in his hand. Then the Divine Inspiration was revealed to him and when that state was over, he (the Prophet was saying: \"O women! You have been allowed by Allah to go out for your needs.\"",
      "usc_msa_ref": "164",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5323",
      "hadith_no": "5323",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يحب العسل والحلواء، وكان إذا انصرف من العصر دخل على نسائه، فيدنو من إحداهن، فدخل على حفصة بنت عمر، فاحتبس أكثر ما كان يحتبس، فغرت فسألت عن ذلك فقيل لي أهدت لها امرأة من قومها عكة من عسل، فسقت النبي صلى الله عليه وسلم منه شربة، فقلت أما والله لنحتالن له‏.‏ فقلت لسودة بنت زمعة إنه سيدنو منك، فإذا دنا منك فقولي أكلت مغافير فإنه سيقول لك لا‏.‏ فقولي له ما هذه الريح التي أجد منك فإنه سيقول لك سقتني حفصة شربة عسل فقولي له جرست نحله العرفط‏.‏ وسأقول ذلك، وقولي أنت يا صفية ذاك‏.‏ قالت تقول سودة فوالله ما هو إلا أن قام على الباب، فأردت أن أباديه بما أمرتني به فرقا منك، فلما دنا منها قالت له سودة يا رسول الله أكلت مغافير قال ‏\"‏ لا ‏\"‏‏.‏ قالت فما هذه الريح التي أجد منك‏.‏ قال ‏\"‏ سقتني حفصة شربة عسل ‏\"‏‏.‏ فقالت جرست نحله العرفط فلما دار إلى قلت له نحو ذلك، فلما دار إلى صفية قالت له مثل ذلك فلما دار إلى حفصة قالت يا رسول الله ألا أسقيك منه‏.‏ قال ‏\"‏ لا حاجة لي فيه ‏\"‏‏.‏ قالت تقول سودة والله لقد حرمناه‏.‏ قلت لها اسكتي‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle was fond of honey and sweet edible things and (it was his habit) that after finishing the `Asr prayer he would visit his wives and stay with one of them at that time. Once he went to Hafsa, the daughter of `Umar and stayed with her more than usual. I got jealous and asked the reason for that. I was told that a lady of her folk had given her a skin filled with honey as a present, and that she made a syrup from it and gave it to the Prophet to drink (and that was the reason for the delay). I said, \"By Allah we will play a trick on him (to prevent him from doing so).\" So I said to Sa`da bint Zam`a \"The Prophet will approach you, and when he comes near you, say: 'Have you taken Maghafir (a bad-smelling gum)?' He will say, 'No.' Then say to him: 'Then what is this bad smell which i smell from you?' He will say to you, 'Hafsa made me drink honey syrup.' Then say: Perhaps the bees of that honey had sucked the juice of the tree of Al-`Urfut.' I shall also say the same. O you, Safiyya, say the same.\" Later Sa`da said, \"By Allah, as soon as he (the Prophet ) stood at the door, I was about to say to him what you had ordered me to say because I was afraid of you.\" So when the Prophet came near Sa`da, she said to him, \"O Allah's Apostle! Have you taken Maghafir?\" He said, \"No.\" She said. \"Then what is this bad smell which I detect on you?\" He said, \"Hafsa made me drink honey syrup.\" She said, \"Perhaps its bees had sucked the juice of Al-`Urfut tree.\" When he came to me, I also said the same, and when he went to Safiyya, she also said the same. And when the Prophet again went to Hafsa, she said, 'O Allah's Apostle! Shall I give you more of that drink?\" He said, \"I am not in need of it.\" Sa`da said, \"By Allah, we deprived him (of it).\" I said to her, \"Keep quiet.\" '",
      "usc_msa_ref": "193",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5752",
      "hadith_no": "5752",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، أنها كانت تأمر بالتلبينة وتقول هو البغيض النافع‏.‏",
      "text_en": " Narrated Hisham's father:                     `Aisha used to recommend at-Talbina and used to say, \"It is disliked (by the patient) although it is beneficial.''",
      "usc_msa_ref": "594",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6463",
      "hadith_no": "6463",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا عبيدة بن حميد، عن عبد الملك بن عمير، عن مصعب بن سعد بن أبي وقاص، عن أبيه  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعلمنا هؤلاء الكلمات كما تعلم الكتابة ‏\"‏ اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك أن نرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     The Prophet used to teach us these words as he used to teach us the Book (Qur'an): \"O Allah! seek refuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with You from being brought back to (senile) geriatric old age, and seek refuge with You from the affliction of the world and from the punishment in the Hereafter.\"",
      "usc_msa_ref": "399",
      "chain": [
        "30207",
        "20341",
        "11368",
        "10556",
        "9"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6749",
      "hadith_no": "6749",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت هزم المشركون يوم أحد هزيمة تعرف فيهم، فصرخ إبليس أى عباد الله أخراكم، فرجعت أولاهم فاجتلدت هي وأخراهم، فنظر حذيفة بن اليمان فإذا هو بأبيه فقال أبي أبي‏.‏ قالت فوالله ما انحجزوا حتى قتلوه، فقال حذيفة غفر الله لكم‏.‏ قال عروة فوالله ما زالت في حذيفة منها بقية حتى لقي الله‏.‏",
      "text_en": " Narrated `Aisha:                     When the pagans were defeated during the (first stage) of the battle of Uhud, Satan shouted, \"O Allah's slaves! Beware of what is behind you!\" So the front files of the Muslims attacked their own back files. Hudhaifa bin Al-Yaman looked and on seeing his father he shouted: \"My father! My father!\" By Allah! The people did not stop till they killed his father. Hudhaifa then said, \"May Allah forgive you.\" `Urwa (the sub-narrator) added, \"Hudhaifa continued asking Allah forgiveness for the killers of his father till he met Allah (till he died).",
      "usc_msa_ref": "661",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6967",
      "hadith_no": "6967",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، هزم المشركون يوم أحد‏.‏ وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة  رضى الله عنها  قالت صرخ إبليس يوم أحد في الناس يا عباد الله أخراكم‏.‏ فرجعت أولاهم على أخراهم حتى قتلوا اليمان فقال حذيفة أبي أبي‏.‏ فقتلوه، فقال حذيفة غفر الله لكم‏.‏ قال وقد كان انهزم منهم قوم حتى لحقوا بالطائف‏.‏",
      "text_en": " Narrated `Aisha:                     The pagans were defeated on the day (of the battle) of Uhud. Satan shouted among the people on the day of Uhud, \"O Allah's worshippers! Beware of what is behind you!\" So the front file of the army attacked the back files (mistaking them for the enemy) till they killed Al-Yaman. Hudhaifa (bin Al- Yaman) shouted, \"My father!\" My father! But they killed him. Hudhaifa said, \"May Allah forgive you.\" (The narrator added: Some of the defeated pagans fled till they reached Taif.)",
      "usc_msa_ref": "",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "jami-al-tirmidhi-2726",
      "hadith_no": "2726",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا فروة بن أبي المغراء، أخبرنا عبيدة بن حميد، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المرأة من نساء أهل الجنة ليرى بياض ساقها من وراء سبعين حلة حتى يرى مخها وذلك بأن الله يقول‏:‏ ‏(‏كأنهن الياقوت والمرجان ‏)‏ فأما الياقوت فإنه حجر لو أدخلت فيه سلكا ثم استصفيته لأريته من ورائه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Prophet (s.a.w) said:                     \"Indeed, a woman from the wives of the people of Paradise, the whiteness of her shin is visible through seventy garments until her marrow is seen, and that is because Allah, he Exalted, says: As if they are corundum and Marjan. So, as for the corundum, it is a stone that if you were to enter a wire through it, then you polished its cloudiness away, you would surely be able to see it through it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30207",
        "20341",
        "11068",
        "11382",
        "16"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    }
  ],
  "total_hadiths": 17,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}