{
  "id": "30201",
  "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
  "full_name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
  "grade": "3rd Century AH",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "235",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] ",
      "Tafsir/Quran"
    ],
    "tags": [
      "al-'Absi",
      "Client",
      "Kufi",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [
    {
      "id": "25250",
      "name": "Muhammad bin Ibrahim bin 'Uthman محمد بن إبراهيم بن عثمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "39913",
      "name": "al-Qasim bin Abi Shayba القاسم بن أبي شيبة",
      "grade": "3rd Century AH"
    }
  ],
  "children": [
    {
      "id": "35010",
      "name": "Ibrahim bin Abi Bakr bin Muhammad إبراهيم بن أبي بكر",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20251",
      "name": "'Abdul 'Aziz bin 'Abdul Samad عبد العزيز بن عبد الصمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20594",
      "name": "'Ali bin Hashim bin al-Burayd علي بن هاشم بن البريد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20346",
      "name": "'Umar bin 'Ubaid bin Abi Umayya عمر بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20334",
      "name": "'Abdul Rahim bin Sulaiman عبد الرحيم بن سليمان الكناني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30008",
      "name": "Ibn Sa'd محمد بن سعد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31170",
      "name": "Muhammad bin Sulaiman al-Baghandi محمد بن سليمان بن الحارث الباغندي",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1216",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا ابن فضيل، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أسلم على النبي صلى الله عليه وسلم وهو في الصلاة فيرد على، فلما رجعنا سلمت عليه فلم يرد على وقال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I used to greet the Prophet while he was in prayer and he would return my greeting, but when we returned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the greeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"",
      "chain": [
        "30201",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1959",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا أبو أسامة، عن هشام بن عروة، عن فاطمة، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أفطرنا على عهد النبي صلى الله عليه وسلم يوم غيم، ثم طلعت الشمس‏.‏ قيل لهشام فأمروا بالقضاء قال بد من قضاء‏.‏ وقال معمر سمعت هشاما لا أدري أقضوا أم لا‏.‏",
      "text_en": " Narrated Abu Usama from Hisham bin 'Ursa from Fatima:                     Asma bint Abi Bakr said, \"We broke our fast during the lifetime of the Prophet on a cloudy day and then the sun appeared.\" Hisham was asked, \"Were they ordered to fast in lieu of that day?\" He replied, \"It had to be made up for.\" Ma`mar said, \"I heard Hisham saying, \"I don't know whether they fasted in lieu of that day or not.\"",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2044",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعتكف في كل رمضان عشرة أيام، فلما كان العام الذي قبض فيه اعتكف عشرين يوما‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was the year of his death, he stayed in I`tikaf for twenty days.",
      "chain": [
        "30201",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا جعفر بن عون، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يصلي في ظل الكعبة، فقال أبو جهل وناس من قريش، ونحرت جزور بناحية مكة، فأرسلوا فجاءوا من سلاها، وطرحوه عليه، فجاءت فاطمة فألقته عنه، فقال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش ‏\"‏‏.‏ لأبي جهل بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأبى بن خلف، وعقبة بن أبي معيط‏.‏ قال عبد الله فلقد رأيتهم في قليب بدر قتلى‏.‏ قال أبو إسحاق ونسيت السابع‏.‏ وقال يوسف بن إسحاق عن أبي إسحاق أمية بن خلف‏.‏ وقال شعبة أمية أو أبى‏.‏ والصحيح أمية‏.‏",
      "text_en": " Narrated `Abdullah:                     Once the Prophet was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men sent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere in Mecca, and when he brought them, they put them over the Prophet Then Fatima (i.e. the Prophet's daughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) Quraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi Mitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well).",
      "chain": [
        "30201",
        "20416",
        "20012",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "3097",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن عائشة، قالت توفي رسول الله صلى الله عليه وسلم وما في بيتي من شىء يأكله ذو كبد، إلا شطر شعير في رف لي، فأكلت منه حتى طال على، فكلته ففني‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle died, and there was nothing in my house that a living being could eat, except some barley Lying on a shelf. So, I ate of it for a long period and measured it, and (after a short period) it was consumed.",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عبد الله بن أبي شيبة، عن أبي أحمد، عن سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم أراه ‏\"‏ يقول الله شتمني ابن آدم وما ينبغي له أن يشتمني، وتكذبني وما ينبغي له، أما شتمه فقوله إن لي ولدا‏.‏ وأما تكذيبه فقوله ليس يعيدني كما بدأني ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah the Most Superior said, \"The son of Adam slights Me, and he should not slight Me, and he disbelieves in Me, and he ought not to do so. As for his slighting Me, it is that he says that I have a son; and his disbelief in Me is his statement that I shall not recreate him as I have created (him) before.\"",
      "chain": [
        "30201",
        "20005",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3927",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يزيد، عن سليم بن حيان، حدثنا سعيد بن ميناء، عن جابر بن عبد الله  رضى الله عنهما أن النبي صلى الله عليه وسلم صلى على أصحمة النجاشي، فكبر عليه أربعا‏.‏ تابعه عبد الصمد‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet offered the funeral prayer for Ashama, the Negus, with four Takbir.",
      "chain": [
        "30201",
        "20472",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "3955",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، حدثنا هشام، عن أبيه، وفاطمة، عن أسماء، رضى الله عنها صنعت سفرة للنبي صلى الله عليه وسلم وأبي بكر حين أرادا المدينة، فقلت لأبي ما أجد شيئا أربطه إلا نطاقي‏.‏ قال فشقيه‏.‏ ففعلت، فسميت ذات النطاقين‏.‏",
      "text_en": " Narrated Asma:                     I prepared the journey food for the Prophet and Abu Bakr when they wanted (to migrate to) Medina. I said to my father (Abu Bakr), \"I do not have anything to tie the container of the journey food with except my waist belt.\" He said, \"Divide it lengthwise into two.\" I did so, and for this reason I was named 'Dhat-un-Nitaqain' (i.e. the owner of two belts). (Ibn `Abbas said, \"Asma', Dhat-un-Nitaq.\")",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10511",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "4007",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يحيى، عن سفيان، عن أبي إسحاق، عن البراء،‏.‏ وحدثنا محمد بن كثير، أخبرنا سفيان، عن أبي إسحاق، عن البراء  رضى الله عنه  قال كنا نتحدث أن أصحاب بدر ثلاثمائة وبضعة عشر، بعدة أصحاب طالوت الذين جاوزوا معه النهر، وما جاوز معه إلا مؤمن‏.‏",
      "text_en": " Narrated Al-Bara:                     We used to say that the warriors of Badr were over three-hundred-and-ten, as many as the Companions of Saul who crossed the river with him; and none crossed the river with him but a believer.",
      "chain": [
        "30201",
        "20031",
        "20012",
        "11049",
        "28531",
        "20005",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4112",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا وكيع، عن إسماعيل، عن قيس، قال رأيت يد طلحة شلاء، وقى بها النبي صلى الله عليه وسلم يوم أحد‏.‏",
      "text_en": " Narrated Qais:                     I saw Talha's paralyzed hand with which he had protected the Prophet on the day of Uhud.",
      "chain": [
        "30201",
        "20032",
        "11418",
        "11046"
      ]
    },
    {
      "hadith_no": "4167",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا ابن نمير، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت لما رجع النبي صلى الله عليه وسلم من الخندق ووضع السلاح واغتسل، أتاه جبريل  عليه السلام  فقال قد وضعت السلاح والله ما وضعناه، فاخرج إليهم‏.‏ قال ‏\"‏ فإلى أين ‏\"‏‏.‏ قال ها هنا، وأشار إلى بني قريظة، فخرج النبي صلى الله عليه وسلم إليهم‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet returned from Al-Khandaq (i.e. Trench) and laid down his arms and took a bath, Gabriel came and said (to the Prophet ), You have laid down your arms? By Allah, we angels have not laid them down yet. So set out for them.\" The Prophet said, \"Where to go?\" Gabriel said, \"Towards this side,\" pointing towards Banu Quraiza. So the Prophet went out towards them.",
      "chain": [
        "30201",
        "30212",
        "20295",
        "53"
      ]
    },
    {
      "hadith_no": "4498",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يحيى بن سعيد، عن سفيان، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله بن عتبة، عن عائشة، وابن، عباس أن أبا بكر   رضى الله عنه  قبل النبي صلى الله عليه وسلم بعد موته‏.‏",
      "text_en": " Narrated Aisha and Ibn `Abbas:                     Abu Bakr kissed the Prophet after his death.",
      "chain": [
        "30201",
        "20031",
        "20012",
        "11399",
        "11004",
        "53",
        "17",
        "20436"
      ]
    },
    {
      "hadith_no": "5021",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا عبد الرحمن، عن سفيان، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن عمر  رضى الله عنه  سألهم عن قوله تعالى ‏{‏إذا جاء نصر الله والفتح‏}‏ قالوا فتح المدائن والقصور قال ما تقول يا ابن عباس قال أجل أو مثل ضرب لمحمد صلى الله عليه وسلم نعيت له نفسه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar asked the people regarding Allah's Statement: 'When comes the Help of Allah (to you O Muhammad against your enemies) and the conquest of Mecca.' (110.1) They replied, \"It indicates the future conquest of towns and palaces (by Muslims).\" `Umar said, \"What do you say about it, O Ibn `Abbas?\" I replied, \"(This Surat) indicates the termination of the life of Muhammad. Through it he was informed of the nearness of his death.\"",
      "chain": [
        "30201",
        "20033",
        "20012",
        "11331",
        "11050",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "5659",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، حدثنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يحب الحلواء والعسل‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to like sweet edible things and honey.",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5736",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، عن هشام، عن عباد بن عبد الله بن الزبير، قال سمعت عائشة  رضى الله عنها  قالت سمعت النبي صلى الله عليه وسلم وهو مستند إلى يقول ‏\"‏ اللهم اغفر لي وارحمني وألحقني بالرفيق الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I heard the Prophet , who was resting against me, saying, \"O Allah! Excuse me and bestow Your Mercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)",
      "chain": [
        "30201",
        "20318",
        "11065",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "5749",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا عبيد الله، حدثنا إسرائيل، عن منصور، عن خالد بن سعد، قال خرجنا ومعنا غالب بن أبجر فمرض في الطريق، فقدمنا المدينة وهو مريض، فعاده ابن أبي عتيق فقال لنا عليكم بهذه الحبيبة السوداء، فخذوا منها خمسا أو سبعا فاسحقوها، ثم اقطروها في أنفه بقطرات زيت في هذا الجانب وفي هذا الجانب، فإن عائشة حدثتني أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن هذه الحبة السوداء شفاء من كل داء إلا من السام ‏\"‏‏.‏ قلت وما السام قال الموت‏.‏",
      "text_en": " Narrated Khalid bin Sa`d:                     We went out and Ghalib bin Abjar was accompanying us. He fell ill on the way and when we arrived at Medina he was still sick. Ibn Abi 'Atiq came to visit him and said to us, \"Treat him with black cumin. Take five or seven seeds and crush them (mix the powder with oil) and drop the resulting mixture into both nostrils, for `Aisha has narrated to me that she heard the Prophet saying, 'This black cumin is healing for all diseases except As-Sam.' Aisha said, 'What is As-Sam?' He said, 'Death.\"",
      "chain": [
        "30201",
        "11201",
        "20311",
        "11067",
        "11625"
      ]
    },
    {
      "hadith_no": "5809",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يحيى، عن سفيان، عن الأعمش، عن مسلم، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يعوذ بعضهم يمسحه بيمينه ‏\"‏ أذهب الباس رب الناس، واشف أنت الشافي، لا شفاء إلا شفاؤك، شفاء لا يغادر سقما ‏\"‏‏.‏ فذكرته لمنصور فحدثني عن إبراهيم عن مسروق عن عائشة بنحوه‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to treat some of his wives by passing his right hand over the place of ailment and used to say, \"O Lord of the people! Remove the difficulty and bring about healing as You are the Healer. There is no healing but Your Healing, a healing that will leave no ailment.\"",
      "chain": [
        "30201",
        "20031",
        "20012",
        "11060",
        "20285",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5996",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال ابن أبي شيبة حدثنا يونس بن محمد، حدثنا فليح، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله الواصلة والمستوصلة، والواشمة والمستوشمة ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20393",
        "20169",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6528",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت لقد توفي النبي صلى الله عليه وسلم وما في رفي من شىء يأكله ذو كبد، إلا شطر شعير في رف لي، فأكلت منه حتى طال على، فكلته، ففني‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet died, nothing which can be eaten by a living creature was left on my shelf except some barley grain. I ate of it for a period and when I measured it, it finished.",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "‏\"‏ من حدث عني، بحديث يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ حدثنا أبو بكر بن أبي شيبة حدثنا وكيع عن شعبة عن الحكم عن عبد الرحمن بن أبي ليلى عن سمرة بن جندب ‏.‏ ح وحدثنا أبو بكر بن أبي شيبة أيضا حدثنا وكيع عن شعبة وسفيان عن حبيب عن ميمون بن أبي شبيب عن المغيرة بن شعبة قالا قال رسول الله صلى الله عليه وسلم ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20032",
        "20020",
        "11069",
        "11196",
        "394",
        "20032",
        "11276"
      ]
    },
    {
      "hadith_no": "2",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن ربعي بن حراش، أنه سمع عليا، - رضى الله عنه - يخطب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكذبوا على فإنه من يكذب على يلج النار ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "8",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن حفص، حدثنا شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20632",
        "20020",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "106",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، قال زهير حدثنا إسماعيل بن إبراهيم، عن أبي حيان، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يوما بارزا للناس فأتاه رجل فقال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتابه ولقائه ورسله وتؤمن بالبعث الآخر ‏\"‏ ‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤدي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لا تراه فإنه يراك ‏\"‏ ‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأحدثك عن أشراطها إذا ولدت الأمة ربها فذاك من أشراطها وإذا كانت العراة الحفاة رءوس الناس فذاك من أشراطها وإذا تطاول رعاء البهم في البنيان فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ ثم تلا صلى الله عليه وسلم ‏{‏ إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ ‏\"‏ ‏.‏ قال ثم أدبر الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوا على الرجل ‏\"‏ ‏.‏ فأخذوا ليردوه فلم يروا شيئا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل جاء ليعلم الناس دينهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      One day the Messenger of Allah (may peace be upon him) appeared before the public that a man came to him and said: Prophet of Allah, (tell me) what is Iman. Upon this he (the Holy Prophet) replied: That you affirm your faith in Allah, His angels, His Books, His meeting, His Messengers and that you affirm your faith in the Resurrection hereafter. He (again) said: Messenger of Allah, (tell me) what does al-Islam signify. He (the Holy Prophet) replied: Al-Islam signifies that you worship Allah and do not associate anything with Him and you establish obligatory prayer and you pay the obligatory poor-rate (Zakat) and you observe the fast of Ramadan. He (the inquirer) again said: Messenger of Allah, what does al-Ihsan imply? He (the Holy Prophet) replied: That you worship Allah as if you are seeing Him, and in case you fail to see Him, then observe prayer (with this idea in your mind) that (at least) He is seeing you. He (the inquirer ) again said: Messenger of Allah, when would there be the hour (of Doom)? He (the Holy Prophet) replied: The one who is asked about it is no better informed than the inquirer. I, however, narrate some of its signs (and these are): when the slave-girl will give birth to he master, when the naked, barefooted would become the chiefs of the people - these are some of the signs of (Doom). (Moreover) when the shepherds of the black (camels) would exult themselves in buildings, this is one of the signs of (Doom). (Doom) is one of the five (happenings wrapped in the unseen) which no one knows but Allah. Then he (the Messenger of Allah) recited (the verse):\" Verily Allah! with Him alone is the knowledge of the hour and He it is Who sends (down the rain) and knows that which is in the wombs and no person knows whatsoever he shall earn tomorrow, and a person knows not in whatsoever land he shall die. Verily Allah is Knowing, Aware. He (the narrator, Abu Huraira) said: Then the person turned back and went away. The Messenger of Allah (may peace be upon him) said: Bring that man back to me. They (the Companions of the Holy Prophet present there) went to bring him back, but they saw nothing there. Upon this the Messenger of Allah remarked: he was Gabriel, who came to teach the people their religion.",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20321",
        "20208",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "115",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن موسى بن طلحة، عن أبي أيوب، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال دلني على عمل أعمله يدنيني من الجنة ويباعدني من النار ‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصل ذا رحمك ‏\"‏ فلما أدبر قال رسول الله صلى الله عليه وسلم ‏\"‏ إن تمسك بما أمر به دخل الجنة ‏\"‏ ‏.‏ وفي رواية ابن أبي شيبة ‏\"‏ إن تمسك به ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Ayyub that a man came to the Prophet (may peace be upon him) and said:                      Direct me to a deed which draws me near to Paradise and takes me away from the Fire (of Hell). Upon this he (the Holy Prophet) said: You worship Allah and never associate anything with Him, establish prayer, and pay Zakat, and do good to your kin. When he turned his back, the Messenger of Allah (may peace be upon him) remarked: If he adheres to what he has been ordered to do, he would enter Paradise.",
      "chain": [
        "30399",
        "20327",
        "30201",
        "20327",
        "11049",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال أتى النبي صلى الله عليه وسلم النعمان بن قوقل فقال يا رسول الله أرأيت إذا صليت المكتوبة وحرمت الحرام وأحللت الحلال أأدخل الجنة فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that Nu'man b. Qaufal came to the Holy Prophet (may peace be upon him) and said:                      Would I enter Paradise if I say the obligatory prayers and deny myself that which is forbidden and treat that as lawful what has been made permissible (by the Shari'ah)? The Holy Prophet (may peace be upon him) replied in the affirmative.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، وألفاظهم، متقاربة - قال أبو بكر حدثنا غندر، عن شعبة، وقال الآخران، حدثنا محمد بن جعفر، حدثنا شعبة، - عن أبي جمرة، قال كنت أترجم بين يدى ابن عباس وبين الناس فأتته امرأة تسأله عن نبيذ الجر، فقال إن وفد عبد القيس أتوا رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من الوفد أو من القوم ‏\"‏ ‏.‏ قالوا ربيعة ‏.‏ قال ‏\"‏ مرحبا بالقوم أو بالوفد غير خزايا ولا الندامى ‏\"‏ ‏.‏ قال فقالوا يا رسول الله إنا نأتيك من شقة بعيدة وإن بيننا وبينك هذا الحى من كفار مضر وإنا لا نستطيع أن نأتيك إلا في شهر الحرام فمرنا بأمر فصل نخبر به من وراءنا ندخل به الجنة ‏.‏ قال فأمرهم بأربع ونهاهم عن أربع ‏.‏ قال أمرهم بالإيمان بالله وحده ‏.‏ وقال ‏\"‏ هل تدرون ما الإيمان بالله ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وأن تؤدوا خمسا من المغنم ‏\"‏ ‏.‏ ونهاهم عن الدباء والحنتم والمزفت ‏.‏ قال شعبة وربما قال النقير ‏.‏ قال شعبة وربما قال المقير ‏.‏ وقال ‏\"‏ احفظوه وأخبروا به من ورائكم ‏\"‏ ‏.‏ وقال أبو بكر في روايته ‏\"‏ من وراءكم ‏\"‏ وليس في روايته المقير ‏.‏",
      "text_en": " Abu Jamra reported:                      I was an interpreter between Ibn Abbas and the people, that a woman happened to come there and asked about nabidh or the pitcher of wine. He replied: A delegation of the people of 'Abdul-Qais came to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) asked the delegation or the people (of the delegation about their identity). They replied that they belonged to the tribe of Rabi'a. He (the Holy Prophet) welcomed the people or the delegation which were neither humiliated nor put to shame. They (the members of the delegation) said: Messenger of Allah, we come to you from a far-off distance and there lives between you and us a tribe of the unbelievers of Mudar and, therefore, it is not possible for us to come to you except in the sacred months. Thus direct us to a clear command, about which we should inform people beside us and by which we may enter heaven. He (the Holy Prophet) replied: I command you to do four deeds and forbid you to do four (acts), and added: I direct you to affirm belief in Allah alone, and then asked them: Do you know what belief in Allah really implies? They said: Allah and His Messenger know best. The Prophet said: It implies testimony to the fact that there is no god but Allah, and that Muhammad is the messenger of Allah, establishment of prayer, payment of Zakat, fast of Ramadan, that you pay one-fifth of the booty (fallen to your lot) and I forbid you to use gourd, wine jar, or a receptacle for wine. Shu'ba sometimes narrated the word naqir (wooden pot) and sometimes narrated it as muqayyar. The Holy Prophet also said: Keep it in your mind and inform those who have been left behind.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20436",
        "20278",
        "20020",
        "20173",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن زكرياء بن إسحاق، قال حدثني يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، عن معاذ بن جبل، - قال أبو بكر ربما قال وكيع عن ابن عباس، أن معاذا، - قال بعثني رسول الله صلى الله عليه وسلم قال ‏\"‏ إنك تأتي قوما من أهل الكتاب ‏.‏ فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنه ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Abbas that Mu'adh said:                      The Messenger of Allah sent me (as a governor of Yemen) and (at the time of departure) instructed me thus: You will soon find yourself in a community one among the people of the Book, so first call them to testify that there is no god but Allah, that I (Muhammad) am the messenger of Allah, and if they accept this, then tell them Allah has enjoined upon them five prayers during the day and the night and if they accept it, then tell them that Allah has made Zakat obligatory for them that it should be collected from the rich and distributed among the poor, and if they agree to it don't pick up (as a share of Zakat) the best of their wealths. Beware of the supplication of the oppressed for there is no barrier between him and Allah.",
      "chain": [
        "30201",
        "20032",
        "20436",
        "20032",
        "11244",
        "11448",
        "13127",
        "17",
        "32",
        "20032",
        "17",
        "32"
      ]
    },
    {
      "hadith_no": "136",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن أبي سفيان، عن جابر، وعن أبي صالح، عن أبي هريرة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس ‏\"‏ ‏.‏ بمثل حديث ابن المسيب عن أبي هريرة ح",
      "text_en": "",
      "chain": [
        "30201",
        "20317",
        "11060",
        "116",
        "34",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "137",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - قالا جميعا حدثنا سفيان، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا لا إله إلا الله عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏ ثم قرأ ‏{‏ إنما أنت مذكر * لست عليهم بمسيطر‏}‏",
      "text_en": " It is narrated on the authority of Jabir that the Messenger of Allah said:                      I have been commanded that I should fight against people till they declare that there is no god but Allah, and when they profess it that there is no god but Allah, their blood and riches are guaranteed protection on my behalf except where it is justified by law, and their affairs rest with Allah, and then he (the Holy Prophet) recited (this verse of the Holy Qur'an):\" Thou art not over them a warden\" (lxxxviii, 22).",
      "chain": [
        "30201",
        "20032",
        "30170",
        "20033",
        "20005",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "140",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنيه زهير بن حرب، حدثنا يزيد بن هارون، كلاهما عن أبي مالك، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ من وحد الله ‏\"‏ ثم ذكر بمثله ‏.‏",
      "text_en": " Abu Malik narrated on the authority of his father that he heard the Apostle (may peace be upon him) say:                      He who held belief in the unity of Allah, and then narrated what has been stated above.",
      "chain": [
        "30201",
        "20326",
        "20472",
        "10766",
        "5098"
      ]
    },
    {
      "hadith_no": "145",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن إسماعيل بن إبراهيم، - قال أبو بكر حدثنا ابن علية، - عن خالد، قال حدثني الوليد بن مسلم، عن حمران، عن عثمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات وهو يعلم أنه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Uthman that the Messenger of Allah (may peace be upon him) said. He who died knowing (fully well) that there is no god but Allah entered Paradise.",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20436",
        "20208",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "153",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ بن جبل، قال كنت ردف رسول الله صلى الله عليه وسلم على حمار يقال له عفير قال فقال ‏\"‏ يا معاذ تدري ما حق الله على العباد وما حق العباد على الله ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوا الله ولا يشركوا به شيئا وحق العباد على الله عز وجل أن لا يعذب من لا يشرك به شيئا ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا أبشر الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal that he observed:                      I was riding behind the Messenger of Allah (may peace be upon him) on an ass known as 'Ufair. He (Mu'adh) observed: He (the Holy Prophet) said: Mu'adh, do you know what right has Allah over His bondsmen and what right have His bondsmen over Him? Mu'adh added: I replied: Allah and his Messenger know best. Upon this he (the Holy Prophet remarked: The right of Allah over His bondsmen is that they should worship Allah and should not associate anything with Him, and the right of His bondsmen over Allah, Glorious and Sublime, is that He does not punish him who associates not anything with Him. He (Mu'adh) added: I said to the Messenger of Allah: Should I then give the tidings to the people? He (the Holy Prophet) said: Do not tell them this good news, for they would trust in it alone.",
      "chain": [
        "30201",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "163",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن سالم، عن أبيه، سمع النبي صلى الله عليه وسلم رجلا يعظ أخاه في الحياء فقال ‏\"‏ الحياء من الإيمان ‏\"‏ ‏.‏",
      "text_en": " Salim reported on the authority of his father that the Prophet (may peace and blessings be upon him) heard a man instruction his brother about modesty. Upon this the Prophet remarked:                      Modesty is an ingredient of Iman (faith).",
      "chain": [
        "30201",
        "30263",
        "30022",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن نمير، ح وحدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، جميعا عن جرير، ح وحدثنا أبو كريب، حدثنا أبو أسامة، كلهم عن هشام بن عروة، عن أبيه، عن سفيان بن عبد الله الثقفي، قال قلت يا رسول الله قل لي في الإسلام قولا لا أسأل عنه أحدا بعدك - وفي حديث أبي أسامة غيرك - قال ‏\"‏ قل آمنت بالله فاستقم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Sufyan b. 'Abdulla al-Thaqafi that he said:                      I asked the Messenger of Allah to tell me about Islam a thing which might dispense with the necessity of my asking anybody after you. In the hadith of Abu Usama the (words) are: other than you. He (the Holy Prophet) remarked: Say I affirm my faith in Allah and then remain steadfast to it.",
      "chain": [
        "30201",
        "30216",
        "30212",
        "30367",
        "30123",
        "4057",
        "30216",
        "11065",
        "10511",
        "5066"
      ]
    },
    {
      "hadith_no": "183",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      He who believes in Allah and the Last Day does not harm is neighbour, and he who believes in Allah and the Last Day shows hospitality to his guest and he who believes in Allah and the Last Day speaks good or remains silent.",
      "chain": [
        "30201",
        "20327",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "186",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن قيس بن مسلم، عن طارق بن شهاب، - وهذا حديث أبي بكر - قال أول من بدأ بالخطبة يوم العيد قبل الصلاة مروان فقام إليه رجل فقال الصلاة قبل الخطبة ‏.‏ فقال قد ترك ما هنالك ‏.‏ فقال أبو سعيد أما هذا فقد قضى ما عليه سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رأى منكم منكرا فليغيره بيده فإن لم يستطع فبلسانه فإن لم يستطع فبقلبه وذلك أضعف الإيمان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Tariq b. Shihab:                      It was Marwan who initiated (the practice) of delivering khutbah (address) before the prayer on the 'Id day. A man stood up and said: Prayer should precede khutbah. He (Marwan) remarked, This (practice) has been done away with. Upon this Abu Sa'id remarked: This man has performed (his duty) laid on him. I heard the Messenger of Allah as saying: He who amongst you sees something abominable should modify it with the help of his hand; and if he has not strength enough to do it, then he should do it with his tongue, and if he has not strength enough to do it, (even) then he should (abhor it) from his heart, and that is the least of faith.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "30170",
        "20173",
        "11386",
        "3680"
      ]
    },
    {
      "hadith_no": "190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو كريب، حدثنا ابن إدريس، كلهم عن إسماعيل بن أبي خالد، ح وحدثنا يحيى بن حبيب الحارثي، - واللفظ له - حدثنا معتمر، عن إسماعيل، قال سمعت قيسا، يروي عن أبي مسعود، قال أشار النبي صلى الله عليه وسلم بيده نحو اليمن فقال ‏\"‏ ألا إن الإيمان ها هنا وإن القسوة وغلظ القلوب في الفدادين عند أصول أذناب الإبل حيث يطلع قرنا الشيطان في ربيعة ومضر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Mas'ud that the Apostle of Allah (may peace and blessings be upon him) pointed towards Yemen with his hand and said:                      Verily Iman is towards this side, and harshness and callousness of the hearts is found amongst the rude owners of the camels who drive them behind their tails (to the direction) where emerge the two horns of Satan, they are the tribes of Rabi'a and Mudar.",
      "chain": [
        "30201",
        "20318",
        "30212",
        "20331",
        "30216",
        "11418",
        "20288",
        "11418",
        "402"
      ]
    },
    {
      "hadith_no": "199",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاكم أهل اليمن هم ألين قلوبا وأرق أفئدة الإيمان يمان والحكمة يمانية رأس الكفر قبل المشرق ‏\"‏ ‏.‏",
      "text_en": " It is reporter on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      There came the people of Yemen who are soft of hearts, tender in feelings: the belief is that of the Yemenites, the sagacity is that of the Yemenites and the summit of unbelief is towards the East.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تدخلون الجنة حتى تؤمنوا ولا تؤمنوا حتى تحابوا ‏.‏ أولا أدلكم على شىء إذا فعلتموه تحاببتم أفشوا السلام بينكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace and blessing be upon him) observed: You shall not enter Paradise so long as you do not affirm belief (in all those things which are the articles of faith) and you will not believe as long as you do not love one another. Should I not direct you to a thing which, if you do, will foster love amongst you: (i. e.) give currency to (the practice of paying salutation to one another by saying) as-salamu alaikum.",
      "chain": [
        "30201",
        "20354",
        "20032",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "208",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that he observed I gave pledge of allegiance to the Messenger of Allah (may peace and blessings be upon him) on the observance of prayer, payment of Zakat, and sincerity and well-wishing for every Muslim.",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "209",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير قالوا حدثنا سفيان، عن زياد بن علاقة، سمع جرير بن عبد الله، يقول بايعت النبي صلى الله عليه وسلم على النصح لكل مسلم ‏.‏",
      "text_en": " Sufyan narrated on the authority of Ziyad b. 'Ilaqa that he heard Jarir b. 'Abdullah saying:                      I pledged allegiance to the Apostle of Allah may peace and blessings be upon him) on sincerity and well-wishing for every Muslim.",
      "chain": [
        "30201",
        "30022",
        "30212",
        "20005",
        "11339",
        "4057"
      ]
    },
    {
      "hadith_no": "219",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا الأعمش، ح وحدثني زهير بن حرب، حدثنا وكيع، حدثنا سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع من كن فيه كان منافقا خالصا ومن كانت فيه خلة منهن كانت فيه خلة من نفاق حتى يدعها إذا حدث كذب وإذا عاهد غدر وإذا وعد أخلف وإذا خاصم فجر ‏\"‏ ‏.‏ غير أن في حديث سفيان ‏\"‏ وإن كانت فيه خصلة منهن كانت فيه خصلة من النفاق ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abdullah b. 'Amr that the Prophet observed:                      Four characteristics made anyone who possessed them, a sheer hypocrite; anyone who possessed one of them possessed a characteristic of hypocrisy till be abandons it: when he talked he lied, when he made a covenant he acted treacherously, and when he quarreled he deviated from the truth.",
      "chain": [
        "30201",
        "20331",
        "30212",
        "20331",
        "11060",
        "30022",
        "20032",
        "20012",
        "11060",
        "11362",
        "11018",
        "29"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وعبد الله بن نمير، قالا حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كفر الرجل أخاه فقد باء بها أحدهما ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Umar that the Apostle (may peace and blessings be upon him) observed:                      When a man calls his brother an unbeliever, it returns (at least) to one of them.",
      "chain": [
        "30201",
        "20352",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن زكرياء بن أبي زائدة، وأبو معاوية عن عاصم، عن أبي عثمان، عن سعد، وأبي، بكرة كلاهما يقول سمعته أذناى، ووعاه، قلبي محمدا صلى الله عليه وسلم يقول ‏\"‏ من ادعى إلى غير أبيه وهو يعلم أنه غير أبيه فالجنة عليه حرام ‏\"‏ ‏.‏",
      "text_en": " Sa'd and Abu Bakra each one of them said:                      My ears heard and my hearing preserved it that Muhammad (peace and blessings be upon him) observed: He who claimed for another one his fatherhood besides his own father knowingly that he was not his father-to him Paradise is forbidden.",
      "chain": [
        "30201",
        "20354",
        "11080",
        "11113",
        "9"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن المثنى، عن محمد بن جعفر، عن شعبة، عن منصور، ح وحدثنا ابن نمير، حدثنا عفان، حدثنا شعبة، عن الأعمش، كلاهما عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abu Bakr b. Abu Shaiba narrated a hadith like this from the Apostle (may peace and blessings be upon him) on the authority of Abdullah.",
      "chain": [
        "30201",
        "20173",
        "20020",
        "11067",
        "30212",
        "30106",
        "20020",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "232",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن محمد بن جعفر، عن شعبة، ح وحدثنا عبيد الله بن معاذ، - واللفظ له - حدثنا أبي، حدثنا شعبة، عن علي بن مدرك، سمع أبا زرعة، يحدث عن جده، جرير قال قال لي النبي صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jarir b. 'Abdullah that the Apostle of Allah (may peace and blessings be upon him) asked him on the occasion of the Farewell Pilgrimage to make the people silent and then said:                      Do not return to unbelief after me by striking the necks of one another.",
      "chain": [
        "30201",
        "30170",
        "20173",
        "20020",
        "13898",
        "20020",
        "11377",
        "30554",
        "4057"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو بكر بن أبي شيبة، وأبو بكر بن خلاد الباهلي قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن واقد بن محمد بن زيد، أنه سمع أباه، يحدث عن عبد الله بن عمر، عن النبي صلى الله عليه وسلم أنه قال في حجة الوداع ‏\"‏ ويحكم - أو قال ويلكم - لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abdullah b. Umar that the Apostle (may peace and blessings be upon him) observed on the occasion of the Farewell Pilgrimage Woe unto you distress unto you! Don't turn back as unbelievers after me by striking the necks of one another.",
      "chain": [
        "30201",
        "30357",
        "20173",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "236",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ح وحدثنا ابن نمير، - واللفظ له - حدثنا أبي ومحمد بن عبيد، كلهم عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اثنتان في الناس هما بهم كفر الطعن في النسب والنياحة على الميت ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      Two (things) are found among men which are tantamount to unbelief: slandering one's lineage and lamentation on the dead.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن داود، عن الشعبي، عن جرير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما عبد أبق فقد برئت منه الذمة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that the Messenger of Allah (may peace and blessings be upon him) observed:                      The slave who fled from his master, responsibility with regard to him was absolved.",
      "chain": [
        "30201",
        "20317",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "248",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عثمان بن محمد بن أبي شيبة، حدثنا جرير، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، كلاهما عن الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبغض الأنصار رجل يؤمن بالله واليوم الآخر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id Khudri that the Messenger of Allah observed:                      The person who believes in Allah and the Last Day never nurses a grudge against the Ansar.",
      "chain": [
        "30203",
        "20028",
        "30201",
        "11060",
        "11161",
        "38"
      ]
    }
  ],
  "total_hadiths": 2216
}