{
  "id": "30211",
  "name": "Muhammad bin al-Salt bin al-Hajjaj محمد بن الصلت بن الحجاج الأسدي",
  "full_name": "Muhammad bin al-Salt bin al-Hajjaj محمد بن الصلت بن الحجاج الأسدي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Asadi",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "21315",
      "name": "al-Slt bin al-Hjaj Kwfa الصلت بن الحجاج",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "21315",
      "name": "al-Slt bin al-Hjaj Kwfa الصلت بن الحجاج",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11517",
      "name": "'Abdur Rahman bin Sulaiman ibn al-Ghasil عبد الرحمن بن سليمان - ابن الغسيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20437",
      "name": "'Abd Rabah bin Nafi',Abu Shahab al-Hanat عبد ربه بن نافع أبو شهاب الحناط",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20368",
      "name": "Yahya bin al-Mhlb al-Bjly يحيى بن المهلب البجلي أبو كدينة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25030",
      "name": "Bashr bin Amarh al-Khth'my بشر بن عمارة الخثعمي المكتب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25104",
      "name": "Sa'id bin Khthym سعيد بن خثيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25177",
      "name": "'Ubaidullah bin Iyad bin Laqayt عبيد الله بن إياد بن لقيط السدوسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-6891",
      "hadith_no": "6891",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن الصلت أبو يعلى، حدثنا الوليد، حدثني الأوزاعي، عن يحيى، عن أبي قلابة، عن أنس، أن النبي صلى الله عليه وسلم قطع العرنيين ولم يحسمهم حتى ماتوا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet cut off the hands and feet of the men belonging to the tribe of `Uraina and did not cauterise (their bleeding limbs) till they died.",
      "usc_msa_ref": "795",
      "chain": [
        "30211",
        "20733",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-541",
      "hadith_no": "541",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الأعلى بن واصل بن عبد الأعلى الكوفي، وأبو زرعة قالا حدثنا محمد بن الصلت، عن فليح بن سليمان، عن سعيد بن الحارث، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا خرج يوم العيد في طريق رجع في غيره ‏.‏ قال وفي الباب عن عبد الله بن عمر وأبي رافع ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن غريب ‏.‏ وروى أبو تميلة ويونس بن محمد هذا الحديث عن فليح بن سليمان عن سعيد بن الحارث عن جابر بن عبد الله ‏.‏ قال وقد استحب بعض أهل العلم للإمام إذا خرج في طريق أن يرجع في غيره اتباعا لهذا الحديث وهو قول الشافعي ‏.‏ وحديث جابر كأنه أصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"When Allah's Messenger would go out on the day of Eid by one route, he would return by another.\"",
      "usc_msa_ref": "",
      "chain": [
        "30554",
        "30211",
        "20169",
        "11167",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1053",
      "hadith_no": "1053",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن الصلت، عن أبي كدينة، عن قابوس بن أبي ظبيان، عن أبيه، عن ابن عباس، قال مر رسول الله صلى الله عليه وسلم بقبور المدينة فأقبل عليهم بوجهه فقال ‏\"‏ السلام عليكم يا أهل القبور يغفر الله لنا ولكم أنتم سلفنا ونحن بالأثر ‏\"‏ ‏.‏ قال وفي الباب عن بريدة وعائشة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن غريب ‏.‏ وأبو كدينة اسمه يحيى بن المهلب وأبو ظبيان اسمه حصين بن جندب ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Messenger of Allah passed by the graves of Al-Madinah, so he turned his face towards them and said: (As-Salamu alaikum ya ahlul-qubur! Yaghfirul-lahu lana wa lakun, antum salafuna wa nahnu bil-athar.) 'Peace be upon you O inhabitants of the grave! May Allah forgive us and you; you are our predecessors and we are to follow you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30211",
        "15452",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3548",
      "hadith_no": "3548",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن الصلت، حدثنا أبو كدينة، عن عطاء بن السائب، عن أبي الضحى، عن ابن عباس، قال مر يهودي بالنبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم ‏\"‏ يا يهودي حدثنا ‏\"‏ ‏.‏ فقال كيف تقول يا أبا القاسم إذا وضع الله السموات على ذه والأرضين على ذه والماء على ذه والجبال على ذه وسائر الخلق على ذه ‏.‏ وأشار أبو جعفر محمد بن الصلت بخنصره أولا ثم تابع حتى بلغ الإبهام فأنزل الله ‏:‏ ‏(‏وما قدروا الله حق قدره ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح لا نعرفه من حديث ابن عباس إلا من هذا الوجه ‏.‏ وأبو كدينة اسمه يحيى بن المهلب قال رأيت محمد بن إسماعيل روى هذا الحديث عن الحسن بن شجاع عن محمد بن الصلت ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"A Jew passed by the Prophet (ﷺ), so the Prophet (ﷺ) said: 'O you Jew! Narrate something to us.' So he said: 'What shall you say O Abul-Qasim, when Allah places the heavens upon this, the earths upon this, the water upon this, the mountains upon this, and the rest of creation upon this?'\" - Muhammad bin As-Salt, Abu Ja'far (one of the narrators) indicated first with his little finger, then followed one by one until he reached his index finger - \"So Allah, the Mighty and Sublime revealed: They made not a just estimate of Allah such as is due to Him (39:67).\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30211",
        "11068",
        "11392",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3669",
      "hadith_no": "3669",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا محمد بن الصلت، قال حدثنا أبو كدينة، عن عطاء، - وهو ابن السائب - عن سعيد بن جبير، عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ولا تقربوا مال اليتيم إلا بالتي هي أحسن‏}‏ و‏{‏إن الذين يأكلون أموال اليتامى ظلما‏}‏ قال اجتنب الناس مال اليتيم وطعامه فشق ذلك على المسلمين فشكوا ذلك إلى النبي صلى الله عليه وسلم فأنزل الله ‏{‏ويسألونك عن اليتامى قل إصلاح لهم خير‏}‏ إلى قوله ‏{‏لأعنتكم‏}‏‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"When these Verses were revealed - 'And come not near to the orphan's property, except to improve it,' and 'Verily, those who unjustly eat up the property of orphans' - the people avoided the property and food of the orphans. That caused hardship to the Muslims and they complained about that to the Prophet. Then Allah revealed: 'And they ask you concerning orphans. Say: The best thing is to work honestly in their property, and if you mix your affairs with theirs, then they are your brothers. And Allah knows him who means mischief (e.g. to swallow their property) from him who means good (e.g. to save their property). And if Allah had wished, He could have put you into difficulties.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "30211",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3762",
      "hadith_no": "3762",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن يحيى بن عبد الله، قال حدثنا محمد بن الصلت أبو يعلى، قال حدثنا عبد الله بن رجاء، عن عباد بن إسحاق، عن الزهري، عن سالم، عن أبيه، قال كانت يمين رسول الله صلى الله عليه وسلم التي يحلف بها ‏\"‏ لا ومصرف القلوب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                      \"The oath by which the Messenger of Allah used to swear was: 'No, by the Controller of the hearts.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30211",
        "20245",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 6
}