{
  "id": "30228",
  "name": "Asbgh bin al-Frj bin Sa'id أصبغ بن الفرج بن سعيد",
  "full_name": "Asbgh bin al-Frj bin Sa'id أصبغ بن الفرج بن سعيد",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "225",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "B.Umayya",
      "Client",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30292",
      "name": "Ahmed bin al-Hasan bin Junaydab أحمد بن الحسن بن جنيدب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36621",
      "name": "Muhammad bin Isma'il bin Yusuf محمد بن إسماعيل بن يوسف",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "202",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أصبغ بن الفرج المصري، عن ابن وهب، قال حدثني عمرو، حدثني أبو النضر، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمر، عن سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم أنه مسح على الخفين‏.‏ وأن عبد الله بن عمر سأل عمر عن ذلك فقال نعم إذا حدثك شيئا سعد عن النبي صلى الله عليه وسلم فلا تسأل عنه غيره‏.‏ وقال موسى بن عقبة أخبرني أبو النضر أن أبا سلمة أخبره أن سعدا حدثه فقال عمر لعبد الله‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin Abi Waqqas said, \"The Prophet passed wet hands over his Khuffs (socks made from thick fabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and added, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about it.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "20390",
        "10567",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "210",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "وحدثنا أصبغ، قال أخبرنا ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، عن ميمونة، أن النبي صلى الله عليه وسلم أكل عندها كتفا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet ate (a piece of) mutton from the shoulder region and then prayed without repeating the ablution.",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11154",
        "11211",
        "61"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت كانت إحدانا تحيض، ثم تقترص الدم من ثوبها عند طهرها فتغسله، وتنضح على سائره، ثم تصلي فيه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot and rub the blood off her garment, and pour water over it and wash that portion thoroughly and sprinkle water over the rest of the garment. After that she would pray in (with) it.",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1042",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن ابن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم‏.‏ ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموها فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1304",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أصبغ، عن ابن وهب، قال أخبرني عمرو، عن سعيد بن الحارث الأنصاري، عن عبد الله بن عمر  رضى الله عنهما  قال اشتكى سعد بن عبادة شكوى له فأتاه النبي صلى الله عليه وسلم يعوده مع عبد الرحمن بن عوف وسعد بن أبي وقاص وعبد الله بن مسعود  رضى الله عنهم  فلما دخل عليه فوجده في غاشية أهله فقال ‏\"‏ قد قضى ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ فبكى النبي صلى الله عليه وسلم فلما رأى القوم بكاء النبي صلى الله عليه وسلم بكوا فقال ‏\"‏ ألا تسمعون إن الله لا يعذب بدمع العين، ولا بحزن القلب، ولكن يعذب بهذا  وأشار إلى لسانه  أو يرحم وإن الميت يعذب ببكاء أهله عليه ‏\"‏‏.‏ وكان عمر  رضى الله عنه  يضرب فيه بالعصا، ويرمي بالحجارة ويحثي بالتراب‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin 'Ubada became sick and the Prophet along with `Abdur Rahman bin `Auf, Sa`d bin Abi Waqqas and `Abdullah bin Mas`ud visited him to inquire about his health. When he came to him, he found him surrounded by his household and he asked, \"Has he died?\" They said, \"No, O Allah's Apostle.\" The Prophet wept and when the people saw the weeping of Allah's Apostle (p.b.u.h) they all wept. He said, \"Will you listen? Allah does not punish for shedding tears, nor for the grief of the heart but he punishes or bestows His Mercy because of this.\" He pointed to his tongue and added, \"The deceased is punished for the wailing of his relatives over him.\" `Umar used to beat with a stick and throw stones and put dust over the faces (of those who used to wail over the dead).",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ، أخبرنا ابن وهب، عن يونس، عن ابن شهاب، عن سالم، عن أبيه  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يهل ملبدا‏.‏",
      "text_en": " Narrated Salim from his father:                     I heard that Allah's Apostle assumed Ihram with his hair matted together.",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1613",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، عن يونس، عن ابن شهاب، عن علي بن حسين، عن عمرو بن عثمان، عن أسامة بن زيد  رضى الله عنهما  أنه قال يا رسول الله، أين تنزل في دارك بمكة‏.‏ فقال ‏\"‏ وهل ترك عقيل من رباع أو دور ‏\"‏‏.‏ وكان عقيل ورث أبا طالب هو وطالب ولم يرثه جعفر ولا علي  رضى الله عنهما  شيئا لأنهما كانا مسلمين، وكان عقيل وطالب كافرين، فكان عمر بن الخطاب  رضى الله عنه  يقول لا يرث المؤمن الكافر‏.‏ قال ابن شهاب وكانوا يتأولون قول الله تعالى ‏{‏إن الذين آمنوا وهاجروا وجاهدوا بأموالهم وأنفسهم في سبيل الله والذين آووا ونصروا أولئك بعضهم أولياء بعض‏}‏ الآية‏.‏",
      "text_en": " Narrated 'Usama bin Zaid:                     I asked, \"O Allah's Apostle! Where will you stay in Mecca? Will you stay in your house in Mecca?\" He replied, \"Has `Aqil left any property or house?\" `Aqil along with Talib had inherited the property of Abu Talib. Jafar and `Ali did not inherit anything as they were Muslims and the other two were non-believers. `Umar bin Al-Khattab used to say, \"A believer cannot inherit (anything from an) infidel.\" Ibn Shihab, (a sub-narrator) said, \"They (`Umar and others) derived the above verdict from Allah's Statement: \"Verily! those who believed and Emigrated and strove with their life And property in Allah's Cause, And those who helped (the emigrants) And gave them their places to live in, These are (all) allies to one another.\" (8.72)",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11045",
        "10581",
        "50"
      ]
    },
    {
      "hadith_no": "1628",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ بن الفرج، أخبرني ابن وهب، عن يونس، عن ابن شهاب، عن سالم، عن أبيه  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم حين يقدم مكة، إذا استلم الركن الأسود أول ما يطوف يخب ثلاثة أطواف من السبع‏.‏",
      "text_en": " Narrated Salim that his father said:                     I saw Allah's Apostle arriving at Mecca; he kissed the Black Stone Corner first while doing Tawaf and did ramal in the first three rounds of the seven rounds (of Tawaf).",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1640",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ، عن ابن وهب، أخبرني عمرو، عن محمد بن عبد الرحمن،، ذكرت لعروة، قال فأخبرتني عائشة  رضى الله عنها  أن أول، شىء بدأ به حين قدم النبي صلى الله عليه وسلم أنه توضأ، ثم طاف، ثم لم تكن عمرة، ثم حج أبو بكر وعمر  رضى الله عنهما  مثله، ثم حججت مع أبي الزبير  رضى الله عنه  فأول شىء بدأ به الطواف، ثم رأيت المهاجرين والأنصار يفعلونه، وقد أخبرتني أمي أنها أهلت هي وأختها والزبير وفلان وفلان بعمرة، فلما مسحوا الركن حلوا‏.‏",
      "text_en": " Narrated `Urwa:                     `Aisha said, \"The first thing the Prophet did on reaching Mecca, was the ablution and then he performed Tawaf of the Ka`ba and that was not `Umra (alone), (but Hajj-al-Qiran). `Urwa added: Later Abu Bakr and `Umar did the same in their Hajj.\" And I performed the Hajj with my father Az- Zubair, and the first thing he did was Tawaf of the Ka`ba. Later I saw the Muhajirin (Emigrants) and the Ansar doing the same. My mother (Asma') told me that she, her sister (`Aisha), Az-Zubair and such and such persons assumed Ihram for `Umra, and after they passed their hands over the Black Stone Corner (of the Ka`ba) they finished the Ihram. (i.e. After doing Tawaf of the Ka`ba and Sa`i between Safa-Marwa.",
      "chain": [
        "30228",
        "20029",
        "20377"
      ]
    },
    {
      "hadith_no": "1783",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ بن الفرج، أخبرنا ابن وهب، عن عمرو بن الحارث، عن قتادة، أن أنس بن مالك  رضى الله عنه  حدثه أن النبي صلى الله عليه وسلم صلى الظهر والعصر، والمغرب والعشاء، ثم رقد رقدة بالمحصب، ثم ركب إلى البيت فطاف به‏.‏   تابعه الليث حدثني خالد، عن سعيد، عن قتادة، أن أنس بن مالك  رضى الله عنه  حدثه عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet offered the Zuhr, `Asr, Maghrib and the `Isha' prayers and slept for a while at a place called Al-Muhassab and then rode to the Ka`ba and performed Tawaf round it .",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1859",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أصبغ، قال أخبرني عبد الله بن وهب، عن يونس، عن ابن شهاب، عن سالم، قال قال عبد الله بن عمر  رضى الله عنهما  قالت حفصة قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من الدواب لا حرج على من قتلهن الغراب والحدأة والفأرة والعقرب والكلب العقور ‏\"‏‏.‏",
      "text_en": " Narrated Hafsa:                     Allah's Apostle said, \"It is not sinful (of a Muhrim) to kill five kinds of animals, namely: the crow, the kite, the mouse, the scorpion and the rabid dog.\"",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2501",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أصبغ بن الفرج، قال أخبرني عبد الله بن وهب، قال أخبرني سعيد، عن زهرة بن معبد، عن جده عبد الله بن هشام  وكان قد أدرك النبي صلى الله عليه وسلم  وذهبت به أمه زينب بنت حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه‏.‏ فقال ‏\"‏ هو صغير ‏\"‏‏.‏ فمسح رأسه ودعا له‏.‏ وعن زهرة بن معبد، أنه كان يخرج به جده عبد الله بن هشام إلى السوق فيشتري الطعام فيلقاه ابن عمر وابن الزبير  رضى الله عنهم  فيقولان له أشركنا، فإن النبي صلى الله عليه وسلم قد دعا لك بالبركة فيشركهم، فربما أصاب الراحلة كما هي، فيبعث بها إلى المنزل‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     that his mother Zainab bint Humaid took him to the Prophet and said, \"O Allah's Apostle! Take the pledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his hand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated that he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn `Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet invoked Allah to bless you.\" So, he would be their partner, and very often he would win a camel's load and send it home.",
      "chain": [
        "30228",
        "20029",
        "11168",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "3969",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أصبغ، حدثنا ابن وهب، عن يونس، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، أن أبا بكر  رضى الله عنه  تزوج امرأة من كلب يقال لها أم بكر، فلما هاجر أبو بكر طلقها، فتزوجها ابن عمها، هذا الشاعر الذي قال هذه القصيدة، رثى كفار قريش وماذا بالقليب قليب بدر من الشيزى تزين بالسنام وماذا بالقليب، قليب بدر من القينات والشرب الكرام تحيي بالسلامة أم بكر وهل لي بعد قومي من سلام يحدثنا الرسول بأن سنحيا وكيف حياة أصداء وهام",
      "text_en": " Narrate Aisha:                     Abu Bakr married a woman from the tribe of Bani Kalb, called Um Bakr. When Abu Bakr migrated to Medina, he divorced her and she was married by her cousin, the poet who said the following poem lamenting the infidels of Quraish: \"What is there kept in the well, The well of Badr, (The owners of) the trays of Roasted camel humps? What is there kept in the well, The well of Badr, (The owners of) lady singers And friends of the honorable companions; who used to drink (wine) together, Um Bakr greets us With the greeting of peace, But can I find peace After my people have gone? The Apostle tells us that We shall live again, But what sort of life will owls and skulls live?:",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "10511",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "4510",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو، عن ابن أبي حبيب، عن أبي الخير، عن الصنابحي، أنه قال له متى هاجرت قال خرجنا من اليمن مهاجرين، فقدمنا الجحفة، فأقبل راكب فقلت له الخبر فقال دفنا النبي صلى الله عليه وسلم منذ خمس‏.‏ قلت هل سمعت في ليلة القدر شيئا قال نعم أخبرني بلال مؤذن النبي صلى الله عليه وسلم أنه في السبع في العشر الأواخر‏.‏",
      "text_en": " Narrated Ibn Abu Habib:                     Abu Al-Khair said, \"As-Sanabih, I asked (me), 'When did you migrate?' I (i.e. Abu Al-Khair) said, 'We went out from Yemen as emigrants and arrived at Al-Juhfa, and there came a rider whom I asked about the news. The rider said: We buried the Prophet five days ago.\" I asked (As-Sanabihi), 'Did you hear anything about the night of Qadr?' He replied, 'Bilal, the Mu'adh-dhin of the Prophet informed me that it is on one of the seven nights of the last ten days (of Ramadan).",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11410",
        "5144"
      ]
    },
    {
      "hadith_no": "5132",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال أصبغ أخبرني ابن وهب، عن يونس بن يزيد، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قلت يا رسول الله إني رجل شاب وأنا أخاف على نفسي العنت ولا أجد ما أتزوج به النساء، فسكت عني، ثم قلت مثل ذلك، فسكت عني ثم قلت مثل ذلك، فسكت عني ثم قلت مثل ذلك، فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة جف القلم بما أنت لاق، فاختص على ذلك أو ذر ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          I said, \"O Allah's Apostle! I am a young man and I am afraid that I      may commit illegal sexual intercourse and I cannot afford to marry.\"      He kept silent, and then repeated my question once again, but he kept      silent. I said the same (for the third time) and he remained silent.      Then repeated my question (for the fourth time), and only then the      Prophet said, \"O Abu Huraira! The pen has dried after writing what you     are going to confront. So (it does not matter whether you) get      yourself castrated or not.\"",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5325",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا أصبغ، أخبرنا ابن وهب، عن يونس، عن ابن شهاب، قال أخبرني أبو سلمة، عن جابر، أن رجلا، من أسلم أتى النبي صلى الله عليه وسلم وهو في المسجد فقال إنه قد زنى‏.‏ فأعرض عنه، فتنحى لشقه الذي أعرض فشهد على نفسه أربع شهادات، فدعاه فقال ‏\"‏ هل بك جنون هل أحصنت ‏\"‏‏.‏ قال نعم‏.‏ فأمر به أن يرجم بالمصلى، فلما أذلقته الحجارة جمز حتى أدرك بالحرة فقتل‏.‏",
      "text_en": " Narrated Jabir:                     A man from the tribe of Bani Aslam came to the Prophet while he was in the mosque and said, \"I have committed illegal sexual intercourse.\" The Prophet turned his face to the other side. The man turned towards the side towards which the Prophet had turned his face, and gave four witnesses against himself. On that the Prophet called him and said, \"Are you insane?\" (He added), \"Are you married?\" The man said, 'Yes.\" On that the Prophet ordered him to be stoned to the death in the Musalla (a praying place). When the stones hit him with their sharp edges and he fled, but he was caught at Al- Harra and then killed",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "6100",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، أخبرنا أبو يحيى، هو فليح بن سليمان عن هلال بن أسامة، عن أنس بن مالك  رضى الله عنه  قال لم يكن النبي صلى الله عليه وسلم سبابا ولا فحاشا ولا لعانا، كان يقول لأحدنا عند المعتبة ‏\"‏ ما له، ترب جبينه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet was not one who would abuse (others) or say obscene words, or curse (others), and if he wanted to admonish anyone of us, he used to say: \"What is wrong with him, his forehead be dusted!\"",
      "chain": [
        "30228",
        "20029",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "6221",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أصبغ، قال أخبرني عبد الله بن وهب، قال أخبرني يونس، عن ابن شهاب، أن الهيثم بن أبي سنان، أخبره أنه، سمع أبا هريرة، في قصصه يذكر النبي صلى الله عليه وسلم يقول ‏\"‏ إن أخا لكم لا يقول الرفث ‏\"‏‏.‏ يعني بذاك ابن رواحة قال فينا رسول الله يتلو كتابه إذا انشق معروف من الفجر ساطع أرانا الهدى بعد العمى فقلوبنا به موقنات أن ما قال واقع يبيت يجافي جنبه عن فراشه إذا استثقلت بالكافرين المضاجع تابعه عقيل عن الزهري‏.‏ وقال الزبيدي عن الزهري عن سعيد والأعرج عن أبي هريرة‏.‏",
      "text_en": " Narrated Al-Haitham bin Abu Sinan:                     that he heard Abu Huraira in his narration, mentioning that the Prophet said, \"A Muslim brother of yours who does not say dirty words.\" and by that he meant Ibn Rawaha, \"said (in verse): 'We have Allah's Apostle with us who recites the Holy Qur'an in the early morning time. He gave us guidance and light while we were blind and astray, so our hearts are sure that whatever he says, will certainly happen. He does not touch his bed at night, being busy in worshipping Allah while the pagans are sound asleep in their beds.' \"",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11543"
      ]
    },
    {
      "hadith_no": "6854",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا أصبغ بن الفرج، حدثنا ابن وهب، أخبرني عمرو، عن جعفر بن ربيعة، عن عراك، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ترغبوا عن آبائكم، فمن رغب عن أبيه فهو كفر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Do not deny your fathers (i.e. claim to be the sons of persons other than your fathers), and whoever denies his father, is charged with disbelief.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11407",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "7284",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أصبغ، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما بعث الله من نبي ولا استخلف من خليفة، إلا كانت له بطانتان، بطانة تأمره بالمعروف وتحضه عليه، وبطانة تأمره بالشر وتحضه عليه، فالمعصوم من عصم الله تعالى ‏\"‏‏.‏ وقال سليمان عن يحيى أخبرني ابن شهاب بهذا، وعن ابن أبي عتيق وموسى عن ابن شهاب مثله، وقال شعيب عن الزهري حدثني أبو سلمة عن أبي سعيد قوله‏.‏ وقال الأوزاعي ومعاوية بن سلام حدثني الزهري حدثني أبو سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏ وقال ابن أبي حسين وسعيد بن زياد عن أبي سلمة عن أبي سعيد قوله‏.‏ وقال عبيد الله بن أبي جعفر حدثني صفوان عن أبي سلمة عن أبي أيوب قال سمعت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Allah never sends a prophet or gives the Caliphate to a Caliph but that he (the prophet or the Caliph) has two groups of advisors: A group advising him to do good and exhorts him to do it, and the other group advising him to do evil and exhorts him to do it. But the protected person (against such evil advisors) is the one protected by Allah.' \"",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "7400",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أصبغ بن الفرج، حدثني ابن وهب، عن يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن أعرابيا، أتى رسول الله صلى الله عليه وسلم فقال إن امرأتي ولدت غلاما أسود، وإني أنكرته‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ هل لك من إبل ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فما ألوانها ‏\"‏‏.‏ قال حمر‏.‏ قال ‏\"‏ هل فيها من أورق ‏\"‏‏.‏ قال إن فيها لورقا‏.‏ قال ‏\"‏ فأنى ترى ذلك جاءها ‏\"‏‏.‏ قال يا رسول الله عرق نزعها‏.‏ قال ‏\"‏ ولعل هذا عرق نزعه ‏\"‏‏.‏ ولم يرخص له في الانتفاء منه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A bedouin came to Allah's Apostle and said, \"My wife has delivered a black boy, and I suspect that he is not my child.\" Allah's Apostle said to him, \"Have you got camels?\" The bedouin said, \"Yes.\" The Prophet said, \"What color are they?\" The bedouin said, \"They are red.\" The Prophet said, \"Are any of them Grey?\" He said, \"There are Grey ones among them.\" The Prophet said, \"Whence do you think this color came to them?\" The bedouin said, \"O Allah's Apostle! It resulted from hereditary disposition.\" The Prophet said, \"And this (i.e., your child) has inherited his color from his ancestors.\" The Prophet did not allow him to deny his paternity of the child.",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3568",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا أصبغ بن الفرج، أخبرني عبد الله بن وهب، عن عمرو بن الحارث، أنه أخبره عن سعيد بن أبي هلال، عن خزيمة، عن عائشة بنت سعد بن أبي وقاص، عن أبيها، أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى أو قال حصى تسبح به فقال ‏\"‏ ألا أخبرك بما هو أيسر عليك من هذا أو أفضل سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض وسبحان الله عدد ما بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ولا حول ولا قوة إلا بالله مثل ذلك ‏\"‏ ‏.‏ قال وهذا حديث حسن غريب من حديث سعد ‏.‏",
      "text_en": " Aishah bint Sa’d bin Abi Waqqas narrated from her father,:                     that he entered with the Messenger of Allah upon a women, before here was a date-seed – or he said – stone – that she would make Tasbih with. So he said: “Should I not inform you of what is easier for you then this, and better? Glory to Allah according to the number of what He created in the ski, and glory to Allah according to the number of what He created in the earth, and glory to Allah according to the number of what is between that, and glory to Allah according to the number of what He is going to create, and Allah is great, in similar amount to that, and all praise is due to Allah, in similar amount to that, and there is no might or power except by Allah, in similar amount to that (Subhan Allahi Adada Ma Khalaqa Fis-Sama Wa Subhan Allahi Adada Ma Khalaqa Fil-Ard, Wa Subhan allahi Adada Ma Baina Dhalik, Wa Subhan Allahi Adada Ma Huwa Khalaq, Wa Allahi Akbbaru Mithla Dhalik, Wa La Hawla Wa La Quwwata Illa Billahi Mithla Dhalik).”",
      "chain": [
        "30292",
        "30228",
        "20029",
        "20377",
        "11169",
        "10559",
        "9"
      ]
    }
  ],
  "total_hadiths": 22
}