{
  "id": "30226",
  "name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
  "full_name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "248",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  د  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20451",
      "name": "Anbs'h bin Khalid bin Yazid عنبسة بن خالد بن يزيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38655",
      "name": "Musa bin Sahl bin Qadim موسى بن سهل بن قادم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "950",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرنا عمرو، أن محمد بن عبد الرحمن الأسدي، حدثه عن عروة، عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث، فاضطجع على الفراش وحول وجهه، ودخل أبو بكر فانتهرني وقال مزمارة الشيطان عند النبي صلى الله عليه وسلم فأقبل عليه رسول الله  عليه السلام  فقال ‏\"‏ دعهما ‏\"‏ فلما غفل غمزتهما فخرجتا‏.‏ وكان يوم عيد يلعب السودان بالدرق والحراب، فإما سألت النبي صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏‏.‏ فقلت نعم‏.‏ فأقامني وراءه خدي على خده، وهو يقول ‏\"‏ دونكم يا بني أرفدة ‏\"‏‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاذهبي ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath (a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). The Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke to me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Apostle (p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I signaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing with shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would like to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got tired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the affirmative and he told me to leave.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1046",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثني الليث، عن عقيل، عن ابن شهاب، ح وحدثني أحمد بن صالح، قال حدثنا عنبسة، قال حدثنا يونس، عن ابن شهاب، حدثني عروة، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خسفت الشمس في حياة النبي صلى الله عليه وسلم فخرج إلى المسجد فصف الناس وراءه، فكبر فاقترأ رسول الله صلى الله عليه وسلم قراءة طويلة، ثم كبر فركع ركوعا طويلا، ثم قال سمع الله لمن حمده‏.‏ فقام ولم يسجد، وقرأ قراءة طويلة، هي أدنى من القراءة الأولى، ثم كبر وركع ركوعا طويلا، وهو أدنى من الركوع الأول، ثم قال سمع الله لمن حمده، ربنا ولك الحمد‏.‏ ثم سجد، ثم قال في الركعة الآخرة مثل ذلك، فاستكمل أربع ركعات في أربع سجدات، وانجلت الشمس قبل أن ينصرف، ثم قام فأثنى على الله بما هو أهله ثم قال ‏\"‏ هما آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتموهما فافزعوا إلى الصلاة ‏\"‏‏.‏ وكان يحدث كثير بن عباس أن عبد الله بن عباس  رضى الله عنهما  كان يحدث يوم خسفت الشمس بمثل حديث عروة عن عائشة‏.‏ فقلت لعروة إن أخاك يوم خسفت بالمدينة لم يزد على ركعتين مثل الصبح‏.‏ قال أجل لأنه أخطأ السنة‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet (p.b.u.h) In the lifetime of the Prophet the sun eclipsed and he went to the Mosque and the people aligned behind him. He said the Takbir (starting the prayer) and prolonged the recitation (from the Qur'an) and then said Takbir and performed a prolonged bowing; then he (lifted his head and) said, \"Sami allahu liman hamidah\" (Allah heard him who sent his praises to Him). He then did not prostrate but stood up and recited a prolonged recitation which was shorter than the first recitation. He again said Takbir and then bowed a prolonged bowing but shorter than the first one and then said, \"Sami`a l-lahu Lyman hamidah Rabbana walak-lhamd, (Allah heard him who sent his praises to Him. O our Sustainer! All the praises are for You)\" and then prostrated and did the same in the second rak`a; thus he completed four bowing and four prostrations. The sun (eclipse) had cleared before he finished the prayer. (After the prayer) he stood up, glorified and praised Allah as He deserved and then said, \"The sun and the moon are two of the signs of Allah. They do not eclipse because of the death or the life (i.e. birth) of someone. When you see them make haste for the prayer.\" Narrated Az-Zuhri: I said to 'Ursa, \"When the sun eclipsed at Medina your brother (`Abdullah bin Az- Zubair) offered only a two-rak`at prayer like that of the morning (Fajr) prayer.\" 'Ursa replied, \"Yes, for he missed the Prophet's tradition (concerning this matter).\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، قال أيوب وسمعت حفصة بنت سيرين، قالت حدثتنا أم عطية  رضى الله عنها  أنهن جعلن رأس بنت رسول الله صلى الله عليه وسلم ثلاثة قرون نقضنه ثم غسلنه ثم جعلنه ثلاثة قرون‏.‏",
      "text_en": " Narrated Hafsa bint Seereen:                     Um 'Atiyya said that they had entwined the hair of the daughter of Allah's Apostle in three braids. They first undid her hair, washed and then entwined it in three braids.\"",
      "chain": [
        "30226",
        "20029",
        "11070",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه  رضى الله عنه  سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مهل أهل المدينة ذو الحليفة، ومهل أهل الشأم مهيعة وهي الجحفة، وأهل نجد قرن ‏\"‏‏.‏ قال ابن عمر  رضى الله عنهما  زعموا أن النبي صلى الله عليه وسلم قال ولم أسمعه ‏\"‏ ومهل أهل اليمن يلملم ‏\"‏‏.‏",
      "text_en": " Narrated Salim bin `Abdullah from his father:                     I heard Allah's Apostle saying, \"The Miqat for the people of Medina is Dhul-Hulaifa; for the people of Sham is Mahita; (i.e. Al-Juhfa); and for the people of Najd is Qarn. And said Ibn `Umar, \"They claim, but I did not hear personally, that the Prophet said, \"The Miqat for the people of Yemen is Yalamlam.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن صالح، ويحيى بن سليمان، قالا حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال طاف النبي صلى الله عليه وسلم في حجة الوداع على بعير، يستلم الركن بمحجن‏.‏ تابعه الدراوردي عن ابن أخي الزهري عن عمه‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     In his Last Hajj the Prophet performed Tawaf of the Ka`ba riding a camel and pointed a bent-headed stick towards the Corner (Black Stone).",
      "chain": [
        "30226",
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1930",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا يونس، عن ابن شهاب، عن عروة، وأبي، بكر قالت عائشة  رضى الله عنها  كان النبي صلى الله عليه وسلم يدركه الفجر ‏{‏جنبا‏}‏ في رمضان، من غير حلم فيغتسل ويصوم‏.‏",
      "text_en": " Narrated `Aisha:                     (At times) in Ramadan the Prophet used to take a bath in the morning not because of a wet dream and would continue his fast.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10511",
        "2",
        "53"
      ]
    },
    {
      "hadith_no": "3342",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "قال عبدان أخبرنا عبد الله، أخبرنا يونس، عن الزهري، ح حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال أنس كان أبو ذر  رضى الله عنه  يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقف بيتي وأنا بمكة، فنزل جبريل، ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا فأفرغها في صدري، ثم أطبقه ثم أخذ بيدي، فعرج بي إلى السماء، فلما جاء إلى السماء الدنيا، قال جبريل لخازن السماء افتح‏.‏ قال من هذا قال هذا جبريل‏.‏ قال معك أحد قال معي محمد‏.‏ قال أرسل إليه قال نعم، فافتح‏.‏ فلما علونا السماء إذا رجل عن يمينه أسودة، وعن يساره أسودة، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا يا جبريل قال هذا آدم، وهذه الأسودة عن يمينه، وعن شماله نسم بنيه، فأهل اليمين منهم أهل الجنة، والأسودة التي عن شماله أهل النار، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى، ثم عرج بي جبريل، حتى أتى السماء الثانية، فقال لخازنها افتح‏.‏ فقال له خازنها مثل ما قال الأول، ففتح ‏\"‏‏.‏ قال أنس فذكر أنه وجد في السموات إدريس وموسى وعيسى وإبراهيم، ولم يثبت لي كيف منازلهم، غير أنه قد ذكر أنه وجد آدم في السماء الدنيا، وإبراهيم في السادسة‏.‏ وقال أنس فلما مر جبريل بإدريس‏.‏ قال مرحبا بالنبي الصالح والأخ الصالح‏.‏ فقلت من هذا قال هذا إدريس، ثم مررت بموسى فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال هذا موسى‏.‏ ثم مررت بعيسى، فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال عيسى‏.‏ ثم مررت بإبراهيم، فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا قال هذا إبراهيم‏.‏ قال وأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال النبي صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع صريف الأقلام ‏\"‏‏.‏ قال ابن حزم وأنس بن مالك  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ ففرض الله على خمسين صلاة، فرجعت بذلك حتى أمر بموسى، فقال موسى ما الذي فرض على أمتك قلت فرض عليهم خمسين صلاة‏.‏ قال فراجع ربك، فإن أمتك لا تطيق ذلك‏.‏ فرجعت فراجعت ربي فوضع شطرها، فرجعت إلى موسى، فقال راجع ربك، فذكر مثله، فوضع شطرها، فرجعت إلى موسى، فأخبرته فقال راجع ربك، فإن أمتك لا تطيق ذلك، فرجعت فراجعت ربي فقال هي خمس، وهى خمسون، لا يبدل القول لدى‏.‏ فرجعت إلى موسى، فقال راجع ربك‏.‏ فقلت قد استحييت من ربي، ثم انطلق، حتى أتى السدرة المنتهى، فغشيها ألوان لا أدري ما هي، ثم أدخلت ‏{‏الجنة‏}‏ فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك ‏\"‏‏.‏",
      "text_en": " Narrated Anas (ra):                      Abu Dhar (ra) used to say that Allah's  Messenger () said, \"While I was at Makkah, the roof of my house was opened and Jibril descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith, and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the heaven. When Jibril reached the nearest heaven, he said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'who is it?' Jibril answered, 'Jibril'. He asked, 'Is there anyone with you?' Jibril replied, 'Muhammad () is with me.' He asked, 'Has he been called?', Jibril said, 'Yes'. So, the gate was opened and we went over the nearest heaven, and there we saw a man sitting with Aswida (a large number of people) of his right and Aswida on his left. When he looked towards his right, he laughed and when he looked towards his left he wept. He said (to me), 'Welcome, O pious Prophet and pious son'. I said, 'Who is this man O Jibril?' Jibril replied, 'He is Adam, and the people on his right and left are the souls of his offspring. Those on the right are the people of Paradise, and those on the left are the people of the (Hell) Fire. So, when he looks to the right, he laughs, and when he looks to the left he weeps.' Then Jibril ascended with me till he reached the second heaven and said to the gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven has said, and he opened the gate.\"Anas added: Abu Dhar mentioned that Prophet () met Idris, Musa (Moses), 'Isa (Jesus) and Ibrahim (Abraham) over the heavens, but he did not specify their places (i.e., on which heavens each of them was), but he mentioned that he (the Prophet ()) had met Adam on the nearest heaven, and Ibrahim on the sixth. Anas said, \"When Jibril and the Prophet () passed by Idris, the latter said, 'Welcome, O pious Prophet and pious brother!' the Prophet () asked, 'Who is he?' Jibril said, 'He is Idris.' \" The Prophet () added, \"Then I passed by Musa who said, 'Welcome, O pious Prophet  and pious brother!' I said, 'Who is he?' Jibril said, 'He is Musa.' Then I passed by 'Isa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' He replied, 'He is 'Isa.' Then I passed by the Prophet Ibrahim who said, 'Welcome, O pious Prophet and pious son!' I said, 'Who is he?' Jibril replied, 'He is Ibrahim'.\"Narrated Ibn 'Abbas and Abu Haiyya Al-Ansari: The Prophet () said, \"Then Jibril ascended with me to a place where I heard the creaking of pens.\" Ibn Hazm and Anas bin Malik state the Prophet () said, \"Allah enjoined fifty Salat (prayers) on me. When I returned with this order of Allah, I passed by Musa who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty Salat (prayers) on them.' On the Musa said to me, 'Go back to your Lord (and appeal for reduction), for your followers will not be able to bear it.' So, I returned to my Lord and asked for some reduction, and He reduced it to half. When I passed by Musa again and informed him about it, he once more said to me, 'Go back to your Lord, for your followers will not be able to bear it.' So, I returned to my Lord similarly as before, and half of it was reduced. I again passed by Musa and he said to me, 'Go back to your Lord, for your followers will not be able to bear it.' I again returned to my Lord and He said, 'These are five (Salat-prayers) and they are all (equal to) fifty (in reward), for My Word does not change.' I returned to Musa, he again told me to return to my Lord (for further reduction) but I said to him 'I feel shy of asking my Lord now.' Then Jibril took me till we reached Sidrat-ul-Muntaha (i.e., lote tree of utmost boundary) which was shrouded in colors indescribable. Then I was admitted into Paradise where I found small tents (made) of pearls and its earth was musk (a kind of perfume).\"",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "hadith_no": "3372",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحن أحق من إبراهيم إذ قال ‏{‏رب أرني كيف تحيي الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏ ويرحم الله لوطا، لقد كان يأوي إلى ركن شديد ولو لبثت في السجن طول ما لبث يوسف لأجبت الداعي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We are more liable to be in doubt than Abraham when he said, 'My Lord! Show me how You give life to the dead.\" . He (i.e. Allah) slid: 'Don't you believe then?' He (i.e. Abraham) said: \"Yes, but (I ask) in order to be stronger in Faith.\" (2.260) And may Allah send His Mercy on Lot! He wished to have a powerful support. If I were to stay in prison for such a long time as Joseph did I would have accepted the offer (of freedom without insisting on having my guiltless less declared).",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3937",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب  وكان قائد كعب حين عمي  قال سمعت كعب بن مالك يحدث حين تخلف عن النبي صلى الله عليه وسلم في غزوة تبوك‏.‏ بطوله، قال ابن بكير في حديثه ولقد شهدت مع النبي صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام، وما أحب أن لي بها مشهد بدر وإن كانت بدر، أذكر في الناس منها‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     Who was Ka`b's guide when Ka`b turned blind: I heard Ka`b bin Malik narrating: When he remained behind (i.e. did not Join) the Prophet in the Ghazwa of Tabuk. Ibn Bukair, in his narration stated that Ka`b said, \" I witnessed the Al-`Aqaba pledge of allegiance at night with the Prophet when we jointly agreed to support Islam with all our efforts I would not like to have attended the Badr battle instead of that 'Aqaba pledge although Badr is more well-known than it, amongst the people.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4053",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن الزهري، أخبرنا علي بن حسين، أن حسين بن علي  عليهم السلام  أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني مما أفاء الله عليه من الخمس يومئذ، فلما أردت أن أبتني بفاطمة  عليها السلام  بنت النبي صلى الله عليه وسلم واعدت رجلا صواغا في بني قينقاع أن يرتحل معي فنأتي بإذخر، فأردت أن أبيعه من الصواغين فنستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، حتى جمعت ما جمعت فإذا أنا بشارفى قد أجبت أسنمتها، وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت المنظر، قلت من فعل هذا قالوا فعله حمزة بن عبد المطلب، وهو في هذا البيت، في شرب من الأنصار، عنده قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء، فوثب حمزة إلى السيف، فأجب أسنمتهما، وبقر خواصرهما، وأخذ من أكبادهما قال علي فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، وعرف النبي صلى الله عليه وسلم الذي لقيت فقال ‏\"‏ ما لك ‏\"‏‏.‏ قلت يا رسول الله، ما رأيت كاليوم، عدا حمزة على ناقتى، فأجب أسنمتهما، وبقر خواصرهما وها هو ذا في بيت معه شرب، فدعا النبي صلى الله عليه وسلم بردائه، فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة، حتى جاء البيت الذي فيه حمزة، فاستأذن عليه فأذن له، فطفق النبي صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة ثمل محمرة عيناه، فنظر حمزة إلى النبي صلى الله عليه وسلم ثم صعد النظر، فنظر إلى ركبته، ثم صعد النظر، فنظر إلى وجهه، ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف النبي صلى الله عليه وسلم أنه ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى، فخرج وخرجنا معه‏.‏",
      "text_en": " Narrated `Ali:                     I had a she-camel which I got in my share from the booty of the battle of Badr, and the Prophet had given me another she camel from the Khumus which Allah had bestowed on him that day. And when I intended to celebrate my marriage to Fatima, the daughter of the Prophet, I made an arrangement with a goldsmith from Bani Qainuqa 'that he should go with me to bring Idhkhir (i.e. a kind of grass used by gold-smiths) which I intended to sell to gold-smiths in order to spend its price on the marriage banquet. While I was collecting ropes and sacks of pack saddles for my two she-camels which were kneeling down beside an Ansari's dwelling and after collecting what I needed, I suddenly found that the humps of the two she-camels had been cut off and their flanks had been cut open and portions of their livers had been taken out. On seeing that, I could not help weeping. I asked, \"Who has done that?\" They (i.e. the people) said, \"Hamza bin `Abdul Muttalib has done it. He is present in this house with some Ansari drinkers, a girl singer, and his friends. The singer said in her song, \"O Hamza, get at the fat she-camels!\" On hearing this, Hamza rushed to his sword and cut of the camels' humps and cut their flanks open and took out portions from their livers.\" Then I came to the Prophet, with whom Zaid bin Haritha was present. The Prophet noticed my state and asked, \"What is the matter?\" I said, \"O Allah's Apostle, I have never experienced such a day as today! Hamza attacked my two she-camels, cut off their humps and cut their flanks open, and he is still present in a house along some drinkers.\" The Prophet asked for his cloak, put it on, and proceeded, followed by Zaid bin Haritha and myself, till he reached the house where Hamza was. He asked the permission to enter, and he was permitted. The Prophet started blaming Hamza for what he had done. Hamza was drunk and his eyes were red. He looked at the Prophet then raised his eyes to look at his knees and raised his eves more to look at his face and then said, \"You are not but my father's slaves.\" When the Prophet understood that Hamza was drunk, he retreated, walking backwards went out and we left with him.",
      "chain": [
        "30349",
        "20025",
        "30226",
        "11716",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "4060",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد  هو ابن صالح  حدثنا عنبسة، حدثنا يونس، قال ابن شهاب ثم سألت الحصين بن محمد  وهو أحد بني سالم وهو من سراتهم  عن حديث، محمود بن الربيع عن عتبان بن مالك، فصدقة‏.‏",
      "text_en": " Narrated Ibn Shihab:                     I asked Al-Husain bin Muhammad who was one of the sons of Salim and one of the nobles amongst them, about the narration of Mahmud bin Ar-Rabi 'from `Itban bin Malik, and he confirmed it.",
      "chain": [
        "30226",
        "11716",
        "20475"
      ]
    },
    {
      "hadith_no": "4579",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة، وسعيد، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن أحق بالشك من إبراهيم إذ قال ‏{‏رب أرني كيف تحيي الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We have more right to be in doubt than Abraham when he said, 'My Lord! Show me how You give life to the dead.' He said, 'Do you not believe?' He said, 'Yes (I believe) but to be stronger in Faith.' \"(2.260)",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثني ابن وهب، قال أخبرني يونس، قال أحمد حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن كعب، قال أخبرني عبد الله بن كعب  وكان قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أن أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك بعض مالك، فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik talking about the Verse:-- 'And to the three (He also forgave) who remained behind.' (9.118) saying in the last portion of his talk, \"(I said), 'As a part (sign) of my repentance, I would like to give up all my property in the cause of Allah and His Apostle,' The Prophet said to me, 'Keep some of your wealth as it is good for you.\" (To the three (He also forgave) who remained behind till for them the earth, vast as it is, was straitened...\" (9.118)",
      "chain": [
        "30226",
        "20029",
        "20475",
        "30007",
        "11716",
        "20475",
        "11013",
        "1134",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4756",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبدان، حدثنا عبد الله، أخبرنا يونس، ح وحدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال ابن المسيب قال أبو هريرة أتي رسول الله صلى الله عليه وسلم ليلة أسري به بإيلياء بقدحين من خمر ولبن، فنظر إليهما فأخذ اللبن قال جبريل الحمد لله الذي هداك للفطرة، لو أخذت الخمر غوت أمتك‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle was presented with two cups one containing wine and the other milk on the night of his night journey at Jerusalem. He looked at it and took the milk. Gabriel said, \"Thanks to Allah Who guided you to the Fitra (i.e. Islam); if you had taken the wine, your followers would have gone astray.",
      "chain": [
        "30349",
        "20025",
        "20475",
        "30226",
        "11716",
        "20475",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "4757",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أبو سلمة سمعت جابر بن عبد الله  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لما كذبني قريش قمت في الحجر، فجلى الله لي بيت المقدس فطفقت أخبرهم عن آياته وأنا أنظر إليه ‏\"‏‏.‏ زاد يعقوب بن إبراهيم حدثنا ابن أخي ابن شهاب عن عمه ‏\"‏ لما كذبني قريش حين أسري بي إلى بيت المقدس ‏\"‏‏.‏ نحوه‏.‏ ‏{‏قاصفا‏}‏ ريح تقصف كل شىء‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"When the Quraish disbelieved me (concerning my night journey), I stood up in Al- Hijr (the unroofed portion of the Ka`ba) and Allah displayed Bait-ul-Maqdis before me, and I started to inform them (Quraish) about its signs while looking at it.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "5182",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "قال يحيى بن سليمان حدثنا ابن وهب، عن يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن النكاح في الجاهلية كان على أربعة أنحاء فنكاح منها نكاح الناس اليوم، يخطب الرجل إلى الرجل وليته أو ابنته، فيصدقها ثم ينكحها، ونكاح آخر كان الرجل يقول لامرأته إذا طهرت من طمثها أرسلي إلى فلان فاستبضعي منه‏.‏ ويعتزلها زوجها، ولا يمسها أبدا، حتى يتبين حملها من ذلك الرجل الذي تستبضع منه، فإذا تبين حملها أصابها زوجها إذا أحب، وإنما يفعل ذلك رغبة في نجابة الولد، فكان هذا النكاح نكاح الاستبضاع، ونكاح آخر يجتمع الرهط ما دون العشرة فيدخلون على المرأة كلهم يصيبها‏.‏ فإذا حملت ووضعت، ومر عليها ليالي بعد أن تضع حملها، أرسلت إليهم فلم يستطع رجل منهم أن يمتنع حتى يجتمعوا عندها تقول لهم قد عرفتم الذي كان من أمركم، وقد ولدت فهو ابنك يا فلان‏.‏ تسمي من أحبت باسمه، فيلحق به ولدها، لا يستطيع أن يمتنع به الرجل‏.‏ ونكاح الرابع يجتمع الناس الكثير فيدخلون على المرأة لا تمتنع ممن جاءها وهن البغايا كن ينصبن على أبوابهن رايات تكون علما فمن أرادهن دخل عليهن، فإذا حملت إحداهن ووضعت حملها جمعوا لها ودعوا لهم القافة ثم ألحقوا ولدها بالذي يرون فالتاط به، ودعي ابنه لا يمتنع من ذلك، فلما بعث محمد صلى الله عليه وسلم بالحق هدم نكاح الجاهلية كله، إلا نكاح الناس اليوم‏.‏",
      "text_en": "",
      "chain": [
        "30220",
        "20029",
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "5637",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال سمعت أبا سلمة بن عبد الرحمن، وابن المسيب، يقولان قال أبو هريرة  رضى الله عنه  إن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن، ولا يشرب الخمر حين يشربها وهو مؤمن، ولا يسرق السارق حين يسرق وهو مؤمن ‏\"‏‏.‏ قال ابن شهاب وأخبرني عبد الملك بن أبي بكر بن عبد الرحمن بن الحارث بن هشام أن أبا بكر كان يحدثه عن أبي هريرة ثم يقول كان أبو بكر يلحق معهن ‏\"‏ ولا ينتهب نهبة ذات شرف، يرفع الناس إليه أبصارهم فيها حين ينتهبها وهو مؤمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a believer; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the time of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman bin Al- Harith bin Hisham told me that Abu Bakr used to narrate that narration to him on the authority of Abu Huraira. He used to add that Abu Bakr used to mention, besides the above cases, \"And he who robs (takes illegally something by force) while the people are looking at him, is not a believer at the time he is robbing (taking).",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6435",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم فأيما مؤمن سببته فاجعل ذلك له قربة إليك يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet saying, \"O Allah! If I should ever abuse a believer, please let that be a means of bringing him near to You on the Day of Resurrection.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "6666",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن ابن المسيب، أنه كان يحدث عن أصحاب النبي، صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ يرد على الحوض رجال من أصحابي فيحلئون عنه فأقول يا رب أصحابي‏.‏ فيقول إنك لا علم لك بما أحدثوا بعدك، إنهم ارتدوا على أدبارهم القهقرى ‏\"‏‏.‏ وقال شعيب عن الزهري كان أبو هريرة يحدث عن النبي صلى الله عليه وسلم فيجلون‏.‏ وقال عقيل فيحلئون‏.‏ وقال الزبيدي عن الزهري عن محمد بن علي عن عبيد الله بن أبي رافع عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn Al-Musaiyab:                     The companions of the Prophet said, \"Some men from my companions will come to my Lake-Fount and they will be driven away from it, and I will say, 'O Lord, my companions!' It will be said, 'You have no knowledge of what they innovated after you left: they turned apostate as renegades (reverted from Islam).",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "6772",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن، عن عبد الله بن كعب بن مالك، وكان، قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏على الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أني أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     In the last part of his narration about the three who remained behind (from the battle of Tabuk). (I said) \"As a proof of my true repentance (for not joining the Holy battle of Tabuk), I shall give up all my property for the sake of Allah and His Apostle (as an expiation for that sin).\" The Prophet said (to me), \"Keep some of your wealth, for that is better for you.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "6996",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا يونس، عن ابن شهاب، عن ابن المسيب، وأبي، سلمة بن عبد الرحمن أن أبا هريرة  رضى الله عنه  قال اقتتلت امرأتان من هذيل، فرمت إحداهما الأخرى بحجر قتلتها وما في بطنها، فاختصموا إلى النبي صلى الله عليه وسلم فقضى أن دية جنينها غرة عبد أو وليدة، وقضى دية المرأة على عاقلتها‏.‏",
      "text_en": " Narrated Abu Huraira:                     Two women from Hudhail fought with each other and one of them hit the other with a stone that killed her and what was in her womb. The relatives of the killer and the relatives of the victim submitted their case to the Prophet who judged that the Diya for the fetus was a male or female slave, and the Diya for the killed woman was to be paid by the 'Asaba (near relatives) of the killer.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7446",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عطاء بن أبي رباح، عن جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل ثوما أو بصلا، فليعتزلنا أو ليعتزل مسجدنا، وليقعد في بيته ‏\"‏‏.‏ وإنه أتي ببدر  قال ابن وهب يعني طبقا  فيه خضرات من بقول، فوجد لها ريحا فسأل عنها  أخبر بما فيها من البقول  فقال قربوها فقربوها إلى بعض أصحابه كان معه، فلما رآه كره أكلها قال ‏\"‏ كل، فإني أناجي من لا تناجي ‏\"‏‏.‏ وقال ابن عفير عن ابن وهب بقدر فيه خضرات‏.‏ ولم يذكر الليث وأبو صفوان عن يونس قصة القدر، فلا أدري هو من قول الزهري أو في الحديث‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"Whoever has eaten garlic or onion, should keep away from us, or should keep away from our mosque and should stay at home.\" Ibn Wahb said, \"Once a plate full of cooked vegetables was brought to the Prophet at Badr. Detecting a bad smell from it, he asked about the dish and was informed of the kinds of vegetables in contained. He then said, \"Bring it near,\" and so it was brought near to one of his companions who was with him. When the Prophet saw it, he disliked eating it and said (to his companion), \"Eat, for I talk in secret to ones whom you do not talk to.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "7464",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد، حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا عمرو، عن ابن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة بنت عبد الرحمن وكانت في حجر عائشة زوج النبي صلى الله عليه وسلم عن عائشة أن النبي صلى الله عليه وسلم بعث رجلا على سرية، وكان يقرأ لأصحابه في صلاته فيختم ب  ‏{‏قل هو الله أحد‏}‏ فلما رجعوا ذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء يصنع ذلك ‏\"‏‏.‏ فسألوه فقال لأنها صفة الرحمن، وأنا أحب أن أقرأ بها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخبروه أن الله يحبه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet sent (an army unit) under the command of a man who used to lead his companions in the prayers and would finish his recitation with (the Sura 112): 'Say (O Muhammad): \"He is Allah, the One.\" ' (112.1) When they returned (from the battle), they mentioned that to the Prophet. He said (to them), \"Ask him why he does so.\" They asked him and he said, \"I do so because it mentions the qualities of the Beneficent and I love to recite it (in my prayer).\" The Prophet; said (to them), \"Tell him that Allah loves him.\"",
      "chain": [
        "30213",
        "30226",
        "20029",
        "20377",
        "11169",
        "10959"
      ]
    },
    {
      "hadith_no": "7471",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقبض الله الأرض يوم القيامة، ويطوي السماء بيمينه ثم يقول أنا الملك أين ملوك الأرض ‏\"‏‏.‏ وقال شعيب والزبيدي وابن مسافر وإسحاق بن يحيى عن الزهري عن أبي سلمة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"On the Day of Resurrection Allah will hold the whole earth and fold the heaven with His right hand and say, 'I am the King: where are the kings of the earth?\" '",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "7569",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وقال أحمد بن صالح حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ننزل غدا إن شاء الله بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏ يريد المحصب‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If Allah will, tomorrow we will encamp in Khaif Bani Kinana, the place where the pagans took the oath of Kufr (disbelief) against the Prophet. He meant Al-Muhassab. (See Hadith No. 659, Vol. 2)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7656",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا علي، حدثنا هشام، أخبرنا معمر، عن الزهري، ح وحدثني أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني يحيى بن عروة بن الزبير، أنه سمع عروة بن الزبير، قالت عائشة  رضى الله عنها  سأل أناس النبي صلى الله عليه وسلم عن الكهان فقال ‏\"‏ إنهم ليسوا بشىء ‏\"‏‏.‏ فقالوا يا رسول الله فإنهم يحدثون بالشىء يكون حقا‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الحق يخطفها الجني فيقرقرها في أذن وليه كقرقرة الدجاجة، فيخلطون فيه أكثر من مائة كذبة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Some people asked the Prophet regarding the soothsayers. He said, \"They are nothing.\" They said, \"O Allah's Apostle! Some of their talks come true.\" The Prophet said, \"That word which happens to be true is what a Jinn snatches away by stealth (from the Heaven) and pours it in the ears of his friend (the foreteller) with a sound like the cackling of a hen. The soothsayers then mix with that word, one hundred lies.\"",
      "chain": [
        "5",
        "11065",
        "20115",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "11545",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن عبد العزيز بن مسلم، عن أبي معقل، عن أنس بن مالك، قال رأيت رسول الله صلى الله عليه وسلم يتوضأ وعليه عمامة قطرية فأدخل يده من تحت العمامة فمسح مقدم رأسه ولم ينقض العمامة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I saw the Messenger (ﷺ) perform ablution. He had a Qutri turban. He inserted his hand beneath the turban and wiped over the forelock, and did not untie the turban.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "20253",
        "19384",
        "19"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، حدثني عباد بن زياد، أن عروة بن المغيرة بن شعبة، أخبره أنه، سمع أباه المغيرة، يقول عدل رسول الله صلى الله عليه وسلم وأنا معه في غزوة تبوك قبل الفجر فعدلت معه فأناخ النبي صلى الله عليه وسلم فتبرز ثم جاء فسكبت على يده من الإداوة فغسل كفيه ثم غسل وجهه ثم حسر عن ذراعيه فضاق كما جبته فأدخل يديه فأخرجهما من تحت الجبة فغسلهما إلى المرفق ومسح برأسه ثم توضأ على خفيه ثم ركب فأقبلنا نسير حتى نجد الناس في الصلاة قد قدموا عبد الرحمن بن عوف فصلى بهم حين كان وقت الصلاة ووجدنا عبد الرحمن وقد ركع بهم ركعة من صلاة الفجر فقام رسول الله صلى الله عليه وسلم فصف مع المسلمين فصلى وراء عبد الرحمن بن عوف الركعة الثانية ثم سلم عبد الرحمن فقام رسول الله صلى الله عليه وسلم في صلاته ‏.‏ ففزع المسلمون فأكثروا التسبيح لأنهم سبقوا النبي صلى الله عليه وسلم بالصلاة فلما سلم رسول الله صلى الله عليه وسلم قال لهم ‏\"‏ قد أصبتم ‏\"‏ ‏.‏ أو ‏\"‏ قد أحسنتم ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah reported:                      I was in the company of the Messenger of Allah (ﷺ) in the expedition of Tabuk. He abandoned the main road before the dawn prayer, and I also did the same along with him. The Prophet (ﷺ) made his camel kneel down and (went to ) relieve himself. He then came back and I poured water upon his hands from the skin-vessel. He then washed his hands and face. He tried to get his forearms out (of the gown), but the sleeves of the gown were too narrow, so he entered back both his hands, and brought them out from beneath the gown. He washed his forearms up to the elbows and wiped his head and wiped over his socks.80 He then mounted (his camel) and we began to proceed until we found people  offering the prayer. They brought forward ‘Abd al-Rahman b. ‘Awf who was leading them in prayer. The Prophet(ﷺ) stood in the row side by side with other Muslims. He performed the second rak’ah of the prayer behind ‘Abd al-Rahman b. ‘Awf. Then ‘Abd al-Rahman uttered salutation. The Prophet(ﷺ) stood to perform the remaining rak’ah of the prayer. The Muslims were alarmed. They began to utter tasbih (Subhan Allah) presuming that they had offered prayer before the Prophet (ﷺ) had done. When he uttered the salutation (i.e. finished his prayer), he said: You were right, or (he said) you did well.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10927",
        "11373"
      ]
    },
    {
      "hadith_no": "214",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن شهاب، حدثني بعض، من أرضى أن سهل بن سعد الساعدي، أخبره أن أبى بن كعب أخبره أن رسول الله صلى الله عليه وسلم إنما جعل ذلك رخصة للناس في أول الإسلام لقلة الثياب ثم أمر بالغسل ونهى عن ذلك ‏.‏ قال أبو داود يعني ‏\"‏ الماء من الماء ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b reported :                      The Messenger of Allah (May peace be upon him) made a concession in the early days of Islam on account of the paucity of clothes that one should not take a bath if one has sexual intercourse (and has no seminal emission). But later on her commanded to take a bath in such a case and prohibited its omission.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11013",
        "399",
        "39"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الماء من الماء ‏\"‏ ‏.‏ وكان أبو سلمة يفعل ذلك ‏.‏",
      "text_en": " Aba Sa’id al-Khudri reported :                      The Messenger of Allah (May peace be upon him) said : water (bath) is necessary only when there is seminal emission. And Abu Salamah followed it.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11013",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال عروة عن عائشة، أن أم سليم الأنصارية، - وهي أم أنس بن مالك - قالت يا رسول الله إن الله عز وجل لا يستحيي من الحق أرأيت المرأة إذا رأت في النوم ما يرى الرجل أتغتسل أم لا قالت عائشة فقال النبي صلى الله عليه وسلم ‏\"‏ نعم فلتغتسل إذا وجدت الماء ‏\"‏ ‏.‏ قالت عائشة فأقبلت عليها فقلت أف لك وهل ترى ذلك المرأة فأقبل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ تربت يمينك يا عائشة ومن أين يكون الشبه ‏\"‏ ‏.‏ قال أبو داود وكذلك روى عقيل والزبيدي ويونس وابن أخي الزهري عن الزهري وإبراهيم بن أبي الوزير عن مالك عن الزهري ووافق الزهري مسافع الحجبي قال عن عروة عن عائشة ‏.‏ وأما هشام بن عروة فقال عن عروة عن زينب بنت أبي سلمة عن أم سلمة أن أم سليم جاءت إلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘A’ishah reported on the authority of Umm Sulaim al-Ansariyah, who was the mother of Anas b. Malik, said:                      Messenger of Allah. Allah is not ashamed of truth what do you think, if a woman sees what a man sees in dream, should she take a bath or not? The prophet (ﷺ) replied: Yes, she should take a bath if she finds the liquid (vaginal secretion) ‘A’ishah said : Then I came upon her and said her : Woe to you! Does a woman see that (sexual dream)? In the meantime, the Messenger of Allah (ﷺ) came upon me and said: May your right hand be covered with dust! How can there be the resemblance (i.e., between the child and the mother)?Abu Dawud said: A similar version has been narrated by Zubaid, ‘Uqail, Yunus, cousin of Al-Zuhri, Ibn Abi-Wazir, on the authority of al-Zuhr, musan, al-Hajabi, like al-Zuhri, narrated on the authority of ‘Urwah from ‘A’ishah, but  Hisham b. ‘Urwah narrated from ‘Urwah on the authority of Zainab daughter of Abu Salamah from Umm Salamah saying. Umm Sulaim came to the Messenger of Allah (ﷺ).",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرتني عمرة بنت عبد الرحمن، عن أم حبيبة، بهذا الحديث قالت عائشة رضي الله عنها ‏.‏ فكانت تغتسل لكل صلاة ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain of narrators. According to this version. 'Aishah said:                      She would wash herself for every prayer.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11455",
        "59"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، حدثه عن عمار بن ياسر، أنه كان يحدث أنهم تمسحوا وهم مع رسول الله صلى الله عليه وسلم بالصعيد لصلاة الفجر فضربوا بأكفهم الصعيد ثم مسحوا وجوههم مسحة واحدة ثم عادوا فضربوا بأكفهم الصعيد مرة أخرى فمسحوا بأيديهم كلها إلى المناكب والآباط من بطون أيديهم ‏.‏",
      "text_en": " Narrated Ammar ibn Yasir:                     They (the Companions of the Prophet) wiped with pure earth (their hands and face) to offer the dawn prayer in the company of the Messenger of Allah (ﷺ). They struck the ground with their palms and wiped their faces once. Then they repeated and struck the ground with their palms once again and wiped their arms completely up to the shoulders and up to the armpits with the inner side of their hands.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11004",
        "25"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، حدثني حمزة بن عبد الله بن عمر، قال قال ابن عمر كنت أبيت في المسجد في عهد رسول الله صلى الله عليه وسلم وكنت فتى شابا عزبا وكانت الكلاب تبول وتقبل وتدبر في المسجد فلم يكونوا يرشون شيئا من ذلك ‏.‏",
      "text_en": " Ibn 'Umar said:                      I used to sleep in the mosque in the lifetime of the Messenger of Allah (ﷺ) when I was young and bachelor. The dogs would urinate frequently visit the mosque, and no one would sprinkle over it.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11818"
      ]
    },
    {
      "hadith_no": "435",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حين قفل من غزوة خيبر فسار ليلة حتى إذا أدركنا الكرى عرس وقال لبلال ‏\"‏ اكلأ لنا الليل ‏\"‏ ‏.‏ قال فغلبت بلالا عيناه وهو مستند إلى راحلته فلم يستيقظ النبي صلى الله عليه وسلم ولا بلال ولا أحد من أصحابه حتى إذا ضربتهم الشمس فكان رسول الله صلى الله عليه وسلم أولهم استيقاظا ففزع رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا بلال ‏\"‏ ‏.‏ فقال أخذ بنفسي الذي أخذ بنفسك بأبي أنت وأمي يا رسول الله فاقتادوا رواحلهم شيئا ثم توضأ النبي صلى الله عليه وسلم وأمر بلالا فأقام لهم الصلاة وصلى بهم الصبح فلما قضى الصلاة قال ‏\"‏ من نسي صلاة فليصلها إذا ذكرها فإن الله تعالى قال ‏{‏ أقم الصلاة للذكرى ‏}‏ ‏\"‏ ‏.‏ قال يونس وكان ابن شهاب يقرؤها كذلك ‏.‏ قال أحمد قال عنبسة - يعني عن يونس - في هذا الحديث لذكري ‏.‏ وقال أحمد الكرى النعاس ‏.‏",
      "text_en": " Abu Hurairah reported:                      When the Messenger of Allah (ﷺ) returned from the Battle of Khaibar, he travelled during the night. When we felt sleep, he halted for rest. Addressing Bilal he said: Keep vigilance at night for us. But Bilal who was leaning against the saddle of his mount was dominated by sleep. Neither the Prophet (ﷺ) nor Bilal nor any of his Companions could get up till the sunshine struck them. The Messenger of Allah (ﷺ) got up first of all. The Messenger of Allah (ﷺ) was embarrassed and said: O Bilal ! He replied: He who detained your soul, detained my soul, Messenger of Allah, my parents be sacrificed for you. Then they drove their mounts to a little distance. The Prophet (ﷺ) perfumed ablution and commanded Bilal who made announcement for the prayer. He (the Prophet) led them in the Fajr prayer. When he finished prayer, he said: If anyone forget saying prayer, he should observe it when he recalls it, for Allah has said (in the Qur'an): \"Establish prayer for my remembrance\". Yunus said: Ibn Shihab used to recite this verse in a similar way (i.e. instead of reciting the word li-dhikri - for the sake of My remembrance - he would recite li-dhikra - when you remember). Ahmad (one of the narrator) said: 'Anbasah (a reporter) reported on the authority of Yunus the word li-dhikri (for the sake of my remembrance). Ahmad said: The word nu'as (occurring in this tradition) means \"drowsiness\".",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "444",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباس العنبري، ح وحدثنا أحمد بن صالح، - وهذا لفظ عباس - أن عبد، الله بن يزيد حدثهم عن حيوة بن شريح عن عياش بن عباس - يعني القتباني - أن كليب بن صبح حدثهم أن الزبرقان حدثه عن عمه عمرو بن أمية الضمري قال كنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره فنام عن الصبح حتى طلعت الشمس فاستيقظ رسول الله صلى الله عليه وسلم فقال ‏\"‏ تنحوا عن هذا المكان ‏\"‏ ‏.‏ قال ثم أمر بلالا فأذن ثم توضئوا وصلوا ركعتى الفجر ثم أمر بلالا فأقام الصلاة فصلى بهم صلاة الصبح ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Umayyah ad-Damri:                     We were in the company of the Messenger of Allah (ﷺ) during one of his journeys. He overslept abandoning the morning prayer until the sun had arisen. The Messenger of Allah (ﷺ) awoke and said: Go away from this place. He then commanded Bilal to call for prayer. He called for prayer. They (the people) performed ablution and offered two rak'ahs of the morning prayer (sunnah prayer). He then commanded Bilal (to utter the iqamah, i.e. to summon the people to attend the prayer). He announced the prayer (i.e. uttered the iqamah) and he led them in the morning prayer.",
      "chain": [
        "30437",
        "30226",
        "26010",
        "10871",
        "16091",
        "4011"
      ]
    },
    {
      "hadith_no": "481",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن بكر بن سوادة الجذامي، عن صالح بن خيوان، عن أبي سهلة السائب بن خلاد، - قال أحمد - من أصحاب النبي صلى الله عليه وسلم أن رجلا أم قوما فبصق في القبلة ورسول الله صلى الله عليه وسلم ينظر فقال رسول الله صلى الله عليه وسلم حين فرغ ‏\"‏ لا يصلي لكم ‏\"‏ ‏.‏ فأراد بعد ذلك أن يصلي لهم فمنعوه وأخبروه بقول رسول الله صلى الله عليه وسلم فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ نعم ‏\"‏ ‏.‏ وحسبت أنه قال ‏\"‏ إنك آذيت الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSahlah as-Sa'ib ibn Khallad:                     A man led the people in prayer. He spat towards qiblah while the Messenger of Allah (ﷺ) was looking at him. The Messenger of Allah said to the people when he finished his prayer: He should not lead you in prayer (henceforth).  Thenceforth he intended to lead them in prayer, but they forbade him and informed him of the prohibition of the Messenger of Allah (ﷺ). He mentioned it to the Messenger of Allah (ﷺ) who said to him: Yes. The narrator said: I think he (the Prophet) said: You did harm to Allah and His Apostle.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "10849",
        "18427",
        "277"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يحيى بن أزهر، وابن، لهيعة عن الحجاج بن شداد، عن أبي صالح الغفاري، عن علي، بمعنى سليمان بن داود قال فلما خرج ‏.‏ مكان فلما برز ‏.‏",
      "text_en": " Abu Salih narrated this tradition with a different chain of transmitters to the same effect as reported by Sulaiman b. Dawud. But this version has the word KHARAJA (he went out) instead of BARAZA (proceeded).",
      "chain": [
        "30226",
        "20029",
        "20624"
      ]
    },
    {
      "hadith_no": "572",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، أخبرني يونس، عن ابن شهاب، أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أقيمت الصلاة فلا تأتوها تسعون وأتوها تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏ قال أبو داود كذا قال الزبيدي وابن أبي ذئب وإبراهيم بن سعد ومعمر وشعيب بن أبي حمزة عن الزهري ‏\"‏ وما فاتكم فأتموا ‏\"‏ ‏.‏ وقال ابن عيينة عن الزهري وحده ‏\"‏ فاقضوا ‏\"‏ ‏.‏ وقال محمد بن عمرو عن أبي سلمة عن أبي هريرة وجعفر بن ربيعة عن الأعرج عن أبي هريرة ‏\"‏ فأتموا ‏\"‏ ‏.‏ وابن مسعود عن النبي صلى الله عليه وسلم وأبو قتادة وأنس عن النبي صلى الله عليه وسلم كلهم قالوا ‏\"‏ فأتموا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      I heard the Messenger of Allah( may peace be upon him) say: When the iqamah is pronounced for prayer, do not come to it running, but come walking(slowly). You should observe tranquility. The part of the prayer you get(along with the imam) offer it, and the part you miss complete it(afterwards).Abu Dawud said: The version narrated by al-Zubaidi, Ibn Abi Dhi’b, Ibrahim b. Sa’d, Ma’mar, Shu’aib b. Abi Hamzah on the authority of al-Zuhri has the words: “the part you miss then complete it”. Ibn ‘Uyainah alone narrated from al-Zuhri the words “then offer it afterwards”. And Muhammad b. ‘Amr narrated from Abu Salamah on the authority of Abu Hurairah, and Ja’far b. Rabi’ah narrated from al-A’raj on the authority of Abu Hurairah the words “then complete it”. And Ibn Mas’ud narrated from the Prophet(ﷺ) and Abu Qatadah and Anas reported from the Prophet( may peace be upon him) the words” then complete it”.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "578",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، قال قرأت على ابن وهب قال أخبرني عمرو، عن بكير، أنه سمع عفيف بن عمرو بن المسيب، يقول حدثني رجل، من بني أسد بن خزيمة أنه سأل أبا أيوب الأنصاري فقال يصلي أحدنا في منزله الصلاة ثم يأتي المسجد وتقام الصلاة فأصلي معهم فأجد في نفسي من ذلك شيئا ‏.‏ فقال أبو أيوب سألنا عن ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ ذلك له سهم جمع ‏\"‏ ‏.‏",
      "text_en": " A man from Banu Asad b. Khuzaimah asked Abu Ayyub al-Ansari:                      if one of us prays in his house, then comes to the mosque and finds that the iqamah is being called, and if I pray along with them ( in congregation), I feel something inside about it. Abu Ayyub replied: We asked the Prophet (ﷺ) about it. He said: That is a share from the spoils received by the warriors (i.e. he will receive double the reward of the prayer).",
      "chain": [
        "30226",
        "20377",
        "11154"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة المكتوبة واجبة خلف كل مسلم برا كان أو فاجرا وإن عمل الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah(ﷺ) as saying:                      The obligatory prayer is essential behind every Muslim, pious or impious, even if he has committed a sins.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "10884",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "816",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، عن ابن أبي هلال، عن معاذ بن عبد الله الجهني، أن رجلا، من جهينة أخبره أنه سمع النبي صلى الله عليه وسلم يقرأ في الصبح ‏{‏ إذا زلزلت الأرض ‏}‏ في الركعتين كلتيهما فلا أدري أنسي رسول الله صلى الله عليه وسلم أم قرأ ذلك عمدا ‏.‏",
      "text_en": " Narrated Mu'adh ibn Abdullah al-Juhani:                     A man of Juhaynah told him that he had heard the Prophet (ﷺ) reciting \"When the earth is shaken\" (Surah 99) in both rak'ahs of the morning prayer. But I do not know whether he had forgotten, or whether he recited it on purpose.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169"
      ]
    },
    {
      "hadith_no": "831",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، وابن، لهيعة عن بكر بن سوادة، عن وفاء بن شريح الصدفي، عن سهل بن سعد الساعدي، قال خرج علينا رسول الله صلى الله عليه وسلم يوما ونحن نقترئ فقال ‏\"‏ الحمد لله كتاب الله واحد وفيكم الأحمر وفيكم الأبيض وفيكم الأسود اقرءوه قبل أن يقرأه أقوام يقيمونه كما يقوم السهم يتعجل أجره ولا يتأجله ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa’d al-Sa’idi said:                      The Messenger of Allah(ﷺ) one day came out to us while we were reciting the Qur’an. He said: Praise be to Allah. The Book of Allah is one, and among you are the red, and among you are the white and among you are the black. Recite it before there appear people who will recite it and straighten it as an arrow is straightened. They will get their reward for it in this world and will not get it in the Hereafter.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "20624",
        "10849",
        "399"
      ]
    },
    {
      "hadith_no": "873",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا معاوية بن صالح، عن عمرو بن قيس، عن عاصم بن حميد، عن عوف بن مالك الأشجعي، قال قمت مع رسول الله صلى الله عليه وسلم ليلة فقام فقرأ سورة البقرة لا يمر بآية رحمة إلا وقف فسأل ولا يمر بآية عذاب إلا وقف فتعوذ - قال - ثم ركع بقدر قيامه يقول في ركوعه ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم سجد بقدر قيامه ثم قال في سجوده مثل ذلك - ثم قام فقرأ بآل عمران ثم قرأ سورة سورة ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i:                     I stood up to pray along with the Messenger of Allah (ﷺ); he got up and recited Surat al-Baqarah (Surah 2). When he came to a verse which spoke of mercy, he stopped and made supplication, and when he came to verse which spoke of punishment, he stopped and sought refuge in Allah, then he bowed and paused as long as he stood (reciting Surah al-Baqarah), and said while bowing, \"Glory be to the Possessor of greatness, the Kingdom, grandeur and majesty.\"  :Then he prostrated himself and paused as long as he stood up and recited Surat Aal Imran (Surah 3) and then recited many surahs one after another.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "213",
        "3051"
      ]
    },
    {
      "hadith_no": "875",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، ومحمد بن سلمة، قالوا حدثنا ابن وهب، أخبرنا عمرو، - يعني ابن الحارث - عن عمارة بن غزية، عن سمى، مولى أبي بكر أنه سمع أبا صالح، ذكوان يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The nearest a servant come to his Lord is when he is prostrating himself, so make supplication often.",
      "chain": [
        "30226",
        "30485",
        "20672",
        "20029",
        "20377",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، ح حدثنا أحمد بن السرح، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، عن عمارة بن غزية، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يقول في سجوده ‏\"‏ اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره ‏\"‏ ‏.‏ زاد ابن السرح ‏\"‏ علانيته وسره ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The prophet (ﷺ) used to say when prostrating himself: “O Allah. Forgive me all my sins, small and great, first and last. “ the narrator Ibn al-sarh added: “open and secret.”",
      "chain": [
        "30226",
        "20029",
        "20029",
        "20379",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، أن أبا هريرة، قال قام رسول الله صلى الله عليه وسلم إلى الصلاة وقمنا معه فقال أعرابي في الصلاة اللهم ارحمني ومحمدا ولا ترحم معنا أحدا فلما سلم رسول الله صلى الله عليه وسلم قال للأعرابي ‏\"‏ لقد تحجرت واسعا ‏\"‏ ‏.‏ يريد رحمة الله عز وجل ‏.‏",
      "text_en": " Abu Hurairah said; The Messenger of Allah (May peace be upon him) got up for the prayer and we also stood up along with him. A Bedouin said said during prayer; O Allah, show mercy to me and to Muhammed and do not show mercy to anyone along with us. When the Messenger of Allah (May peace be upon him) uttered the salutation, he said to the Bedouin; you narrowed down a vast (thing). By this he meant the mercy of Allah.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "888",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، وابن، رافع قالا حدثنا عبد الله بن إبراهيم بن عمر بن كيسان، حدثني أبي، عن وهب بن مانوس، قال سمعت سعيد بن جبير، يقول سمعت أنس بن مالك، يقول ما صليت وراء أحد بعد رسول الله صلى الله عليه وسلم أشبه صلاة برسول الله صلى الله عليه وسلم من هذا الفتى يعني عمر بن عبد العزيز ‏.‏ قال فحزرنا في ركوعه عشر تسبيحات وفي سجوده عشر تسبيحات ‏.‏ قال أبو داود قال أحمد بن صالح قلت له مانوس أو مابوس قال أما عبد الرزاق فيقول مابوس وأما حفظي فمانوس وهذا لفظ ابن رافع ‏.‏ قال أحمد عن سعيد بن جبير عن أنس بن مالك ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I did not offer behind anyone after the Messenger of Allah (ﷺ) a prayer like the prayer offered by the Messenger of Allah (ﷺ) than this youth, i.e. Umar ibn AbdulAziz. We estimated reciting glorification ten times in his bowing, and in his prostration ten times.Abu Dawud said: Ahmad b. Salih said: I asked him ('Abd Allah) whether the name Manus is correct of Mabus. He replied: 'Abd al-Razzaq used to say Mabus, but I remember Manus (i.e. the narrator Wahb b. Manus). These are the words of Ibn Rafi'. It has also been narrated by Ahmad from Sa'id b. Jubair on the authority of Anas b. Malik.",
      "chain": [
        "30226",
        "28276",
        "11050",
        "19"
      ]
    },
    {
      "hadith_no": "909",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال سمعت أبا الأحوص، يحدثنا في مجلس سعيد بن المسيب قال قال أبو ذر قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الله عز وجل مقبلا على العبد وهو في صلاته ما لم يلتفت فإذا التفت انصرف عنه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: Allah, the Most High, continues to turn favourably towards a servant while he is engaged in prayer as long as he does not look to the side (by turning the neck), but if he does so, He turns away from him.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "23"
      ]
    },
    {
      "hadith_no": "1044",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني سليمان بن بلال، عن إبراهيم بن أبي النضر، عن أبيه، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة المرء في بيته أفضل من صلاته في مسجدي هذا إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Prophet (ﷺ) said: The prayer a man offers in his house is more excellent than his prayer in this mosque of mine except obligatory prayer.",
      "chain": [
        "30226",
        "20029",
        "20160",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "1048",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - أن الجلاح، مولى عبد العزيز حدثه أن أبا سلمة - يعني ابن عبد الرحمن - حدثه عن جابر بن عبد الله، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ يوم الجمعة ثنتا عشرة ‏\"‏ ‏.‏ يريد ساعة ‏\"‏ لا يوجد مسلم يسأل الله عز وجل شيئا إلا آتاه الله عز وجل فالتمسوها آخر ساعة بعد العصر ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: Friday is divided into twelve hours. Amongst them there is an hour in which a Muslim does not ask Allah  for anything but He gives it to him. So seek it in the last hour after the afternoon prayer.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "1049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني مخرمة، - يعني ابن بكير - عن أبيه، عن أبي بردة بن أبي موسى الأشعري، قال قال لي عبد الله بن عمر أسمعت أباك يحدث عن رسول الله صلى الله عليه وسلم في شأن الجمعة يعني الساعة ‏.‏ قال قلت نعم سمعته يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هي ما بين أن يجلس الإمام إلى أن تقضى الصلاة ‏\"‏ ‏.‏ قال أبو داود يعني على المنبر ‏.‏",
      "text_en": " Abu Burdah b. Abl Musa al-Asha’ri said:                      ‘Abd Allah b. ‘Umar said to me: Did you hear your father narrating a tradition from the Messenger of Allah (ﷺ) about an hour on Friday (when supplication is accepted by Allah)? I said: Yes, I heard it. I heard the Messenger of Allah (ﷺ) say: This hour is found during the period when the imam is seated (for giving Friday sermon) until the prayer is finished.Abu Dawud said: By sitting is meant sitting on the pulpit.",
      "chain": [
        "30226",
        "20029",
        "20517",
        "11154",
        "11901"
      ]
    },
    {
      "hadith_no": "1055",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان الناس ينتابون الجمعة من منازلهم ومن العوالي ‏.‏",
      "text_en": " ‘A’ishah, the wife of prophet(ﷺ), said:                      The people used to attend the Friday prayer from their houses and from the suburbs of Medina.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "20173",
        "10511"
      ]
    },
    {
      "hadith_no": "1077",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، وعمرو بن الحارث، عن ابن شهاب، عن سالم، عن أبيه، قال وجد عمر بن الخطاب حلة إستبرق تباع بالسوق فأخذها فأتى بها رسول الله صلى الله عليه وسلم فقال ابتع هذه تجمل بها للعيد وللوفد ‏.‏ ثم ساق الحديث والأول أتم ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar said:                      'Umar b. al-Khattab saw a suit of silken cloth being sold in the market. He took it to the Messenger of Allah (ﷺ), and said: Purchase it ad decorate with it on 'id on the occasion of the arrival of delegations. The narrator then narrated the tradition. The former version is complete.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "20377",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1078",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، وعمرو، أن يحيى بن سعيد الأنصاري، حدثه أن محمد بن يحيى بن حبان حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على أحدكم إن وجد ‏\"‏ ‏.‏ أو ‏\"‏ ما على أحدكم إن وجدتم أن يتخذ ثوبين ليوم الجمعة سوى ثوبى مهنته ‏\"‏ ‏.‏ قال عمرو وأخبرني ابن أبي حبيب عن موسى بن سعد عن ابن حبان عن ابن سلام أنه سمع رسول الله صلى الله عليه وسلم يقول ذلك على المنبر ‏.‏ قال أبو داود ورواه وهب بن جرير عن أبيه عن يحيى بن أيوب عن يزيد بن أبي حبيب عن موسى بن سعد عن يوسف بن عبد الله بن سلام عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Muhammad ibn Yahya ibn Habban:                     The Messenger of Allah (ﷺ) said: What is the harm if any of you has two garments, if he can provide them, for Friday (prayer) in addition to the two garments for his daily work? Amr reported from Ibn Habib from Musa ibn Sa'd from Ibn Habban from Ibn Salam who heard this (tradition) from the Messenger of Allah (ﷺ) on the pulpit.Abu Dawud said: This tradition has been reported by Yusuf b. 'Abd Allah b. Salam from the Prophet (ﷺ) through a different chain of narrators.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11439",
        "11062",
        "11222"
      ]
    },
    {
      "hadith_no": "1181",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال كان كثير بن عباس يحدث أن عبد الله بن عباس، كان يحدث أن رسول الله صلى الله عليه وسلم صلى في كسوف الشمس مثل حديث عروة عن عائشة عن رسول الله صلى الله عليه وسلم أنه صلى ركعتين في كل ركعة ركعتين ‏.‏",
      "text_en": " Narrated Abd Allah b. 'Abbas:                     The Messenger of Allah (ﷺ) prayed at the solar eclipse as reported in the tradition narrated by 'Urwah from Aishah from the Messenger of Allah (ﷺ) that he offered two rak'ahs of prayer bowing twice in each rak'ah.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "524",
        "17"
      ]
    },
    {
      "hadith_no": "1215",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا يحيى بن محمد الجاري، حدثنا عبد العزيز بن محمد، عن مالك، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم غابت له الشمس بمكة فجمع بينهما بسرف ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     When the sun set at Mecca, the Messenger of Allah (ﷺ) combined the two prayers at Sarif.",
      "chain": [
        "30226",
        "32046",
        "20167",
        "20001",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1224",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سالم، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يسبح على الراحلة أى وجه توجه ويوتر عليها غير أنه لا يصلي المكتوبة عليها ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     While travelling the Messenger of Allah (ﷺ) would pray voluntary prayer on his riding beast in whatever direction it turned; and he would observe witr prayer, but he did not offer the obligatory prayers upon it.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1273",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن كريب، مولى ابن عباس أن عبد الله بن عباس، وعبد الرحمن بن أزهر، والمسور بن مخرمة، أرسلوه إلى عائشة زوج النبي صلى الله عليه وسلم فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد العصر وقل إنا أخبرنا أنك تصلينهما وقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عنهما ‏.‏ فدخلت عليها فبلغتها ما أرسلوني به فقالت سل أم سلمة ‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة فقالت أم سلمة سمعت رسول الله صلى الله عليه وسلم ينهى عنهما ثم رأيته يصليهما أما حين صلاهما فإنه صلى العصر ثم دخل وعندي نسوة من بني حرام من الأنصار فصلاهما فأرسلت إليه الجارية فقلت قومي بجنبه فقولي له تقول أم سلمة يا رسول الله أسمعك تنهى عن هاتين الركعتين وأراك تصليهما فإن أشار بيده فاستأخري عنه ‏.‏ قالت ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر إنه أتاني ناس من عبد القيس بالإسلام من قومهم فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏ ‏.‏",
      "text_en": " Narrated Kuraib, the client of Ibn 'Abbas:                     That 'Abd Allah b. Abbas, 'Abd al-Rahman b. Azhar and al-Miswar b. Makhramah sent him to 'Aishah, wife of the Prophet (ﷺ). They said: Convey our regards to her from all of us and ask her about the two rak'ahs after the 'Asr prayer, and tell her that we have been informed that she prays them, and we are told that the Messenger of Allah (ﷺ) prohibited them. I entered upon her and told her that for which they had sent me to her. She said: Ask Umm Salamah. I returned to them (Ibn 'Abbas and others) and informed them about her opinion. They sent me back to Umm Salamah with the same mission for which they had sent me to 'Aishah. Umm Salamah said: I heard the Messenger of Allah (ﷺ) prohibiting them, but later on I saw him praying them. When he prayed them, he had offered the 'Asr prayer. He then came to me while a number of women from Banu Haram from the Ansar were sitting with me. He prayed these two rak'ahs. I sent a slave girl to him and I told her: Stand beside him and tell him that Umm Salamah has asked: Messenger of Allah (ﷺ), I heard you prohibiting these two rak'ahs (after the afternoon prayer) but I see you praying them yourself. If he makes a sign with his hand, step backward from him. The slave girl did so. When he finished prayer, he said: O daughter of Abu Umayyah, you asked about the praying of two rak'ahs after the 'Asr prayer, in fact, some people of 'Abd al-Qais has come to me with the news that their people had embraced Islam. They hindered me from praying the two rak'ahs after Zuhr prayer. It is those two rak'ahs (which I offered after the 'Asr prayer)",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2216"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا ابن وهب، حدثني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى ثماني ركعات يسلم من كل ركعتين ‏.‏ قال أبو داود قال أحمد بن صالح إن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى فذكر مثله ‏.‏ قال ابن السرح إن أم هانئ قالت دخل على رسول الله صلى الله عليه وسلم ولم يذكر سبحة الضحى بمعناه ‏.‏",
      "text_en": " Narrated Umm Hani ibn AbuTalib:                     The Messenger of Allah (ﷺ) prayed on the day of the Conquest (of Mecca) eight rak'ahs saluting after every two rak'ahs.Abu Dawud said: Ahmad b. Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Mecca, and he narrated something similar. Ibn al-Sarh reported that Umm Hani said: The Messenger of Allah (ﷺ) entered upon me. This version does not mention the prayer in the forenoon.",
      "chain": [
        "30226",
        "30485",
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال قلت لعائشة رضى الله عنها ‏:‏ بكم كان رسول الله صلى الله عليه وسلم يوتر قالت ‏:‏ كان يوتر بأربع وثلاث، وست وثلاث، وثمان وثلاث، وعشر وثلاث، ولم يكن يوتر بأنقص من سبع، ولا بأكثر من ثلاث عشرة ‏.‏ قال أبو داود زاد أحمد بن صالح ‏:‏ ولم يكن يوتر بركعتين قبل الفجر ‏.‏ قلت ‏:‏ ما يوتر قالت ‏:‏ لم يكن يدع ذلك ‏.‏ ولم يذكر أحمد ‏:‏ وست وثلاث ‏.‏",
      "text_en": " 'Abd Allah b. Abi Qais said that he asked 'Aishah:                      How many rak'ahs would the Messenger of Allah (ﷺ) pray observing the witr ? She said: He used to observe the witr with four and three, six and three, eight and three, and ten and three rak'ahs never observing less than seven or more than thirteen.The narrator Ahmad added in his version: He would not observe the witr with two rak'ahs before the dawn. I asked: With what would he observe the witr ? She said: He would never leave it. The version of Ahmad does not mention the words \"six and three (rak'ahs)\".",
      "chain": [
        "30226",
        "30491",
        "20029",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "1398",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرنا عمرو، أن أبا سوية، حدثه أنه، سمع ابن حجيرة، يخبر عن عبد الله بن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قام بعشر آيات لم يكتب من الغافلين ومن قام بمائة آية كتب من القانتين ومن قام بألف آية كتب من المقنطرين ‏\"‏ ‏.‏ قال أبو داود ابن حجيرة الأصغر عبد الله بن عبد الرحمن بن حجيرة ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: If anyone prays at night reciting regularly ten verses, he will not be recorded among the negligent; if anyone prays at night and recites a hundred verses, he will be recorded among those who are obedient to Allah; and if anyone prays at night reciting one thousand verses, he will be recorded among those who receive huge rewards.Abu Dawud said: The name of Ibn Hujairah al-Asghar is 'Abd Allah b. 'Abd al-Rahman b. Hujairah.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "12336",
        "10866",
        "29"
      ]
    },
    {
      "hadith_no": "1410",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن أبي هلال، عن عياض بن عبد الله بن سعد بن أبي سرح، عن أبي سعيد الخدري، أنه قال قرأ رسول الله صلى الله عليه وسلم وهو على المنبر ‏{‏ ص ‏}‏ فلما بلغ السجدة نزل فسجد وسجد الناس معه فلما كان يوم آخر قرأها فلما بلغ السجدة تشزن الناس للسجود فقال النبي صلى الله عليه وسلم ‏\"‏ إنما هي توبة نبي ولكني رأيتكم تشزنتم للسجود ‏\"‏ ‏.‏ فنزل فسجد وسجدوا ‏.‏",
      "text_en": " Narrated Sa'id al-Khudri:                     The Messenger of Allah (ﷺ) recited surah Sad on the pulpit. When he reached the place of prostration (in the surah), he descended and prostrated himself and the people prostrated with him. When the next day came, he recited it. When he reached the place of prostration (in the surah), the people became ready for prostration. Thereupon the Messenger of Allah (ﷺ) said: This is the repentance of a Prophet ; but I saw you being ready for prostration. So he descended and prostrated himself and the people prostrated along with him.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1500",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، أن سعيد بن أبي هلال، حدثه عن خزيمة، عن عائشة بنت سعد بن أبي وقاص، عن أبيها، أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى أو حصى تسبح به فقال ‏\"‏ أخبرك بما هو أيسر عليك من هذا أو أفضل ‏\"‏ ‏.‏ فقال ‏\"‏ سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض وسبحان الله عدد ما خلق بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ‏.‏ ولا إله إلا الله مثل ذلك ‏.‏ ولا حول ولا قوة إلا بالله مثل ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     Once Sa'd, with the Messenger of Allah (ﷺ), visited a woman in front of whom were some date-stones or pebbles which she was using as a rosary to glorify Allah. He (the Prophet) said: I tell you something which would be easier (or more excellent) for you than that. He said (it consisted of saying): \"Glory be to Allah\" as many times as the number of that which He has created in Heaven; \"Glory be to Allah\" as many times as the number of that which He has created on Earth; \"Glory be to Allah\" as many times as the number of that which He has created between them; \"Glory be to Allah\" as many times as the number of that which He is creating; \"Allah is most great\" a similar number of times; \"Praise (be to Allah)\" a similar number of times; and \"There is no god but Allah\" a similar number of times; \"There is no might and no power except in Allah\" a similar number of times.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "28158",
        "10559",
        "9"
      ]
    },
    {
      "hadith_no": "1597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن أبي الزبير، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فيما سقت الأنهار والعيون العشر وما سقي بالسواني ففيه نصف العشر ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdallah :                     The Messenger of Allah(ﷺ) as saying A tenth is payable on what is watered by rivers and brooks or from underground moisture and a twentieth on what is watered by draught camels.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1621",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال وقال ابن شهاب قال عبد الله بن ثعلبة قال ابن صالح قال العدوي وإنما هو العذري خطب رسول الله صلى الله عليه وسلم الناس قبل الفطر بيومين بمعنى حديث المقرئ ‏.‏",
      "text_en": " Abd Allah b. Tha’labah said (the narrator Ahmad b. salih said :                      He, i.e “Abd al-Razzaq, said : He is ‘Adawl. Abu Dawud said : Ahmed b. Salih said : He is ‘Adhri): The Messenger of Allah (May peace be upon him) delivered a speech before the closing fast (‘Id) by two days. He then transmitted the tradition like that of al Muqri (‘Abd Allah b. Yazid).",
      "chain": [
        "30226",
        "20121",
        "11070",
        "11013"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن صالح، وعثمان بن أبي شيبة، - وهذا حديثه - قالا حدثنا الفضل بن دكين، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، - رضى الله عنه - يقول أمرنا رسول الله صلى الله عليه وسلم يوما أن نتصدق فوافق ذلك مالا عندي فقلت اليوم أسبق أبا بكر إن سبقته يوما فجئت بنصف مالي فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قلت مثله ‏.‏ قال وأتى أبو بكر - رضى الله عنه - بكل ما عنده فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قال أبقيت لهم الله ورسوله ‏.‏ قلت لا أسابقك إلى شىء أبدا ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     The Messenger of Allah (ﷺ) commanded us one day to give sadaqah. At that time I had some property. I said: Today I shall surpass AbuBakr if I surpass him any day. I, therefore, brought half my property. The Messenger of Allah (ﷺ) asked: What did you leave for your family? I replied: The same amount. AbuBakr brought all that he had with him. The Messenger of Allah (ﷺ) asked him: What did you leave for your family? He replied: I left Allah and His Apostle for them. I said: I shall never compete you in anything.",
      "chain": [
        "30226",
        "30203",
        "20348",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1693",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن صالح، ويعقوب بن كعب، - وهذا حديثه - قالا حدثنا ابن وهب، قال أخبرني يونس، عن الزهري، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سره أن يبسط له في رزقه وينسأ له في أثره فليصل رحمه ‏\"‏ ‏.‏",
      "text_en": " Anas reported the Messenger of Allah (ﷺ) as saying :                      Anyone who is pleased that his sustenance is expanded and his age extended should do kindness to his near relatives.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "1719",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا يزيد بن خالد بن موهب، وأحمد بن صالح، قالا حدثنا ابن وهب، أخبرني عمرو، عن بكير، عن يحيى بن عبد الرحمن بن حاطب، عن عبد الرحمن بن عثمان التيمي، أن رسول الله صلى الله عليه وسلم نهى عن لقطة الحاج ‏.‏ قال أحمد قال ابن وهب يعني في لقطة الحاج يتركها حتى يجدها صاحبها قال ابن موهب عن عمرو ‏.‏",
      "text_en": " ‘Abd al-Rahman bin `Uthman al-Taime said:                      The Messenger of Allah (SWAS) prohibited taking the find of pilgrims.  Ibn Wahb said : One should leave the find of a pilgrim till its owner finds it.",
      "chain": [
        "38715",
        "30226",
        "20029",
        "20377",
        "11154",
        "10625",
        "2705"
      ]
    },
    {
      "hadith_no": "1735",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، أخبرني ابن أبي ذئب، عن عبيد بن عمير، - قال أحمد بن صالح كلاما معناه أنه مولى ابن عباس - عن عبد الله بن عباس، أن الناس، في أول ما كان الحج كانوا يبيعون فذكر معناه إلى قوله مواسم الحج ‏.‏",
      "text_en": " `Abd Allah bin `Abbas said :                      In the beginning when Hajj was prescribed, people used to trade during Hajj.  The narrator then narrated the rest of the tradition upto the words, `season of Hajj’.",
      "chain": [
        "30226",
        "20172",
        "20177",
        "11259",
        "30226",
        "17"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، عن عبد الله بن عبد الرحمن بن يحنس، عن يحيى بن أبي سفيان الأخنسي، عن جدته، حكيمة عن أم سلمة، زوج النبي صلى الله عليه وسلم أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أهل بحجة أو عمرة من المسجد الأقصى إلى المسجد الحرام غفر له ما تقدم من ذنبه وما تأخر ‏\"‏ ‏.‏ أو ‏\"‏ وجبت له الجنة ‏\"‏ ‏.‏ شك عبد الله أيتهما قال ‏.‏ قال أبو داود يرحم الله وكيعا أحرم من بيت المقدس يعني إلى مكة ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     She heard the Messenger of Allah (ﷺ) say: If anyone puts on ihram for hajj or umrah from the Aqsa mosque  to the sacred mosque , his former and latter sins will be forgiven, or he will be guaranteed Paradise. The narrator Abdullah doubted which of these words he said.Abu Dawud said: May Allah have mercy on Waki'. He put on ihram from Jerusalem (Aqsa mosque), that is, to Mecca.",
      "chain": [
        "30226",
        "20172",
        "10663",
        "12574"
      ]
    },
    {
      "hadith_no": "1793",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني حيوة، أخبرني أبو عيسى الخراساني، عن عبد الله بن القاسم، عن سعيد بن المسيب، أن رجلا، من أصحاب النبي صلى الله عليه وسلم أتى عمر بن الخطاب - رضي الله عنه - فشهد عنده أنه سمع رسول الله صلى الله عليه وسلم في مرضه الذي قبض فيه ينهى عن العمرة قبل الحج ‏.‏",
      "text_en": " Narrated Sa'id ibn al-Musayyab:                     A man from the Companions of the Prophet (ﷺ) came to Umar ibn al-Khattab (may Allah be pleased with him). He bore witness before him that when he (the Prophet) was suffering from a disease of which he died he heard the Messenger of Allah (ﷺ) prohibiting performing of umrah before hajj.",
      "chain": [
        "30226",
        "20029",
        "26010",
        "16127",
        "18563",
        "11002"
      ]
    },
    {
      "hadith_no": "1877",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عبيد الله، - يعني ابن عبد الله بن عتبة - عن ابن عباس، أن رسول الله صلى الله عليه وسلم طاف في حجة الوداع على بعير يستلم الركن بمحجن ‏.‏",
      "text_en": " Ibn ‘Abbas said The Apostle of Allaah(ﷺ) performed the circumambulation at the Farewell Pilgrimage on a Camel and touched the corner(Black Stone) with a crooked stick.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2042",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن صالح، قرأت على عبد الله بن نافع أخبرني ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجعلوا بيوتكم قبورا ولا تجعلوا قبري عيدا وصلوا على فإن صلاتكم تبلغني حيث كنتم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Do not make your houses graves, and do not make my grave a place of festivity. But invoke blessings on me, for your blessings reach me wherever you may be.",
      "chain": [
        "30226",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2061",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثني يونس، عن ابن شهاب، حدثني عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم وأم سلمة أن أبا حذيفة بن عتبة بن ربيعة بن عبد شمس كان تبنى سالما وأنكحه ابنة أخيه هند بنت الوليد بن عتبة بن ربيعة وهو مولى لامرأة من الأنصار كما تبنى رسول الله صلى الله عليه وسلم زيدا وكان من تبنى رجلا في الجاهلية دعاه الناس إليه وورث ميراثه حتى أنزل الله سبحانه وتعالى في ذلك ‏{‏ ادعوهم لآبائهم ‏}‏ إلى قوله ‏{‏ فإخوانكم في الدين ومواليكم ‏}‏ فردوا إلى آبائهم فمن لم يعلم له أب كان مولى وأخا في الدين فجاءت سهلة بنت سهيل بن عمرو القرشي ثم العامري - وهي امرأة أبي حذيفة - فقالت يا رسول الله إنا كنا نرى سالما ولدا وكان يأوي معي ومع أبي حذيفة في بيت واحد ويراني فضلا وقد أنزل الله عز وجل فيهم ما قد علمت فكيف ترى فيه فقال لها النبي صلى الله عليه وسلم ‏\"‏ أرضعيه ‏\"‏ ‏.‏ فأرضعته خمس رضعات فكان بمنزلة ولدها من الرضاعة فبذلك كانت عائشة - رضى الله عنها - تأمر بنات أخواتها وبنات إخوتها أن يرضعن من أحبت عائشة أن يراها ويدخل عليها وإن كان كبيرا خمس رضعات ثم يدخل عليها وأبت أم سلمة وسائر أزواج النبي صلى الله عليه وسلم أن يدخلن عليهن بتلك الرضاعة أحدا من الناس حتى يرضع في المهد وقلن لعائشة والله ما ندري لعلها كانت رخصة من النبي صلى الله عليه وسلم لسالم دون الناس ‏.‏",
      "text_en": " A’ishah wife of the Prophet(ﷺ) and Umm Salamah said “Abu Hudaifah bin ‘Utbah bin Rabi’ah bin ‘Abd Shams adopted Salim as his son and married him to his niece Hind, daughter of Al Walid bin  ‘Utbah bin Rabi’ah. He (Salim) was the freed slave of a woman from the Ansar (the Helpers) as the Apostle of Allaah(ﷺ) adopted Zaid as his son. In pre Islamic days when anyone adopted a man as his son, the people called him by his name and he was given a share from his inheritance. Allaah, the Exalted, revealed about this matter “Call them by (the name of) their fathers, that is juster in the sight of Allaah. And if ye know not their fathers, then (they are) your brethren in the faith and your clients. They were then called by their names of their fathers. A man, whose father was not known, remained under the protection of someone and considered brother in faith. Sahlah daughter of Suhail bin Amr Al Quraishi then came and said Apostle of Allaah(ﷺ), we used to consider Salim(our) son. He dwelled with me and Abu Hudhaifah in the same house, and he saw me in the short clothes, but Allaah the Exalted, has revealed about them what you know, then what is your opinion about him? The Prophet (ﷺ) said give him your breast feed. She gave him five breast feeds. He then became like her foster son. Hence, A’ishah(may Allaah be pleased with her) used to ask the daughters of her sisters and the daughters of her brethren to give him breast feed five times, whom A’ishah wanted to see and who wanted to visit her. Though he might be of age; he then visited her. But Umm Salamah and all other wives of the Prophet (ﷺ) refused to allow anyone to visit them on the basis of such breast feeding unless one was given breast feed during infancy. They told A’ishah by Allaah we do not know whether that was a special concession granted by the Prophet (ﷺ) to Salim exclusive of the people.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "2066",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، أخبرني يونس، عن ابن شهاب، أخبرني قبيصة بن ذؤيب، أنه سمع أبا هريرة، يقول نهى رسول الله صلى الله عليه وسلم أن يجمع بين المرأة وخالتها وبين المرأة وعمتها ‏.‏",
      "text_en": " Abu Hurairah said “The Apostle of Allaah(ﷺ) forbade that a woman and her maternal aunt and a woman and her paternal aunt are joined in marriage.”",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "2104",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني إبراهيم بن ميسرة، أن خالته، أخبرته عن امرأة، قالت هي مصدقة امرأة صدق قالت بينا أبي في غزاة في الجاهلية إذ رمضوا فقال رجل من يعطيني نعليه وأنكحه أول بنت تولد لي فخلع أبي نعليه فألقاهما إليه فولدت له جارية فبلغت وذكر نحوه ولم يذكر قصة القتير ‏.‏",
      "text_en": " Ibrahim bin Maisarah reported from his maternal aunt who reported on the authority of a woman called Mussaddaqah (a truthful woman). She said “In pre Islamic days, when my father participated in a battle the feet of the people burnt due to intense heat. Thereupon a man said “Who gives me his shoes, I shall marry him to my first daughter born to me. My father took off his shoes and there them before him. A girl was thereafter born to him and came of age.” The narrator then mentioned a similar story. But he did not mention that she had grown old.",
      "chain": [
        "30226",
        "20121",
        "11070",
        "11240"
      ]
    },
    {
      "hadith_no": "2182",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني سالم بن عبد الله، عن أبيه، أنه طلق امرأته وهي حائض فذكر ذلك عمر لرسول صلى الله عليه وسلم فتغيظ رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ مره فليراجعها ثم ليمسكها حتى تطهر ثم تحيض فتطهر ثم إن شاء طلقها طاهرا قبل أن يمس فذلك الطلاق للعدة كما أمر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (bin Umar) said that he divorced his wife while she was menstruating. ‘Umar mentioned the matter to the Messenger of Allah(ﷺ). The Messenger of Allah(ﷺ) became angry and said “Command him, he must take her back and keep her back till she is purified, then has another menstrual period and is purified. Then if he desires he may divorce her during the period of purity before he has intercourse with her. This is the divorce for waiting period as commanded by Allaah, the Exalted.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2185",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع عبد الرحمن بن أيمن، مولى عروة يسأل ابن عمر وأبو الزبير يسمع قال كيف ترى في رجل طلق امرأته حائضا قال طلق عبد الله بن عمر امرأته وهي حائض على عهد رسول الله صلى الله عليه وسلم فسأل عمر رسول الله صلى الله عليه وسلم فقال إن عبد الله بن عمر طلق امرأته وهي حائض قال عبد الله فردها على ولم يرها شيئا وقال ‏\"‏ إذا طهرت فليطلق أو ليمسك ‏\"‏ ‏.‏ قال ابن عمر وقرأ النبي صلى الله عليه وسلم ‏{‏ يا أيها النبي إذا طلقتم النساء فطلقوهن ‏}‏ في قبل عدتهن ‏.‏ قال أبو داود روى هذا الحديث عن ابن عمر يونس بن جبير وأنس بن سيرين وسعيد بن جبير وزيد بن أسلم وأبو الزبير ومنصور عن أبي وائل معناهم كلهم أن النبي صلى الله عليه وسلم أمره أن يراجعها حتى تطهر ثم إن شاء طلق وإن شاء أمسك وكذلك رواه محمد بن عبد الرحمن عن سالم عن ابن عمر وأما رواية الزهري عن سالم ونافع عن ابن عمر أن النبي صلى الله عليه وسلم أمره أن يراجعها حتى تطهر ثم تحيض ثم تطهر ثم إن شاء طلق وإن شاء أمسك وروي عن عطاء الخراساني عن الحسن عن ابن عمر نحو رواية نافع والزهري والأحاديث كلها على خلاف ما قال أبو الزبير ‏.‏",
      "text_en": " Abdur Rahman ibn Ayman, the client of Urwah, asked Ibn Umar and Abu al-Zubayr was was listening:                      What do you think if a man divorces his wife while she is menstruating? He said: Abdullah ibn Umar divorced his wife while she was menstruating during the time of the Messenger of Allah (ﷺ).So Umar asked the Messenger of Allah (ﷺ) saying: Abdullah ibn Umar divorced his wife while she was menstruating. Abdullah said: He returned her to me and did not count it (the pronouncement) anything. He said: When she is purified, he may divorce her or keep her with him. Ibn Umar said: The Prophet (ﷺ) recited the Qur'anic verse: O Prophet, when you divorce women, divorce them in the beginning of their waiting period.\"Abu Dawud said: This tradition has been narrated by Yunus b. Jubair, Anas b. Sirin b. Jubair, Zaid b. Aslam, Abu al-Zubair and Mansur from Abu Wa'il on the authority of Ibn 'Umar. They all agreed on the theme that the Prophet (ﷺ) commanded him to take her back (and keep her) till she was purified. Then if he desired, he might divorce her or keep her with him if he wanted to do so. The version narrated by al-Zuhri from Salim from Nafi' on the authority of Ibn 'Umar has: The Prophet (ﷺ) commanded him to take her back (and keep her) till she is purified, and then has menstrual discharge, and then she is purified. Then if he desires, he may divorce her and if he desires he may keep her.Abu Dawud said: A version like that of Nafi' and al-Zuhri has also been transmitted by 'Ata al-Khurasani from al-Hasan on the authority of Ibn 'Umar. All the versions of this tradition contradict the one narrated by Abu al-Zubair.",
      "chain": [
        "30226",
        "20121",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "2196",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني بعض بني أبي رافع، مولى النبي صلى الله عليه وسلم عن عكرمة مولى ابن عباس عن ابن عباس قال طلق عبد يزيد - أبو ركانة وإخوته - أم ركانة ونكح امرأة من مزينة فجاءت النبي صلى الله عليه وسلم فقالت ما يغني عني إلا كما تغني هذه الشعرة ‏.‏ لشعرة أخذتها من رأسها ففرق بيني وبينه فأخذت النبي صلى الله عليه وسلم حمية فدعا بركانة وإخوته ثم قال لجلسائه ‏\"‏ أترون فلانا يشبه منه كذا وكذا من عبد يزيد وفلانا يشبه منه - كذا وكذا ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال النبي صلى الله عليه وسلم لعبد يزيد ‏\"‏ طلقها ‏\"‏ ‏.‏ ففعل ثم قال ‏\"‏ راجع امرأتك أم ركانة وإخوته ‏\"‏ ‏.‏ فقال إني طلقتها ثلاثا يا رسول الله ‏.‏ قال ‏\"‏ قد علمت راجعها ‏\"‏ ‏.‏ وتلا ‏{‏ يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن ‏}‏ ‏.‏ قال أبو داود وحديث نافع بن عجير وعبد الله بن علي بن يزيد بن ركانة عن أبيه عن جده أن ركانة طلق امرأته البتة فردها إليه النبي صلى الله عليه وسلم أصح لأن ولد الرجل وأهله أعلم به أن ركانة إنما طلق امرأته البتة فجعلها النبي صلى الله عليه وسلم واحدة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Abd Yazid, the father of Rukanah and his brothers, divorced Umm Rukanah and married a woman of the tribe of Muzaynah. She went to the Prophet (ﷺ) and said: He is of no use to me except that he is as useful to me as a hair; and she took a hair from her head. So separate me from him. The Prophet (ﷺ) became furious. He called on Rukanah and his brothers. He then said to those who were sitting beside him. Do you see so-and-so who resembles Abdu Yazid in respect of so-and-so; and so-and-so who resembles him in respect of so-and-so? They replied: Yes. The Prophet (ﷺ) said to Abdu Yazid: Divorce her. Then he did so. He said: Take your wife, the mother of Rukanah and his brothers, back in marriage. He said: I have divorced her by three pronouncements, Messenger of Allah. He said: I know: take her back. He then recited the verse: \"O Prophet, when you divorce women, divorce them at their appointed periods.\"Abu Dawud said: The tradition narrated by Nafi' b. 'Ujair and 'Abd Allah b. Yazid b. Rukanah from his father on the authority of his grandfather reads: Rukanah divorced his wife absolutely (i.e. irrevocable divorce). The Prophet (ﷺ) restored her to him. This version is sounder (than other versions), for they (i.e. these narrators) are the children of his man, and the members of the family are more aware of his case. Rukanah divorced his wife absolutely (i.e. three divorces in one pronouncement) and the Prophet (ﷺ) made it a single divorce.",
      "chain": [
        "30226",
        "20121",
        "11070"
      ]
    },
    {
      "hadith_no": "2198",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "وصار قول ابن عباس فيما حدثنا أحمد بن صالح، ومحمد بن يحيى، - وهذا حديث أحمد - قالا حدثنا عبد الرزاق، عن معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن بن عوف، ومحمد بن عبد الرحمن بن ثوبان، عن محمد بن إياس، أن ابن عباس، وأبا، هريرة وعبد الله بن عمرو بن العاص سئلوا عن البكر، يطلقها زوجها ثلاثا فكلهم قالوا لا تحل له حتى تنكح زوجا غيره ‏.‏ قال أبو داود وروى مالك عن يحيى بن سعيد عن بكير بن الأشج عن معاوية بن أبي عياش أنه شهد هذه القصة حين جاء محمد بن إياس بن البكير إلى ابن الزبير وعاصم بن عمر فسألهما عن ذلك فقالا اذهب إلى ابن عباس وأبي هريرة فإني تركتهما عند عائشة - رضى الله عنها - ثم ساق هذا الخبر ‏.‏ قال أبو داود وقول ابن عباس هو أن الطلاق الثلاث تبين من زوجها مدخولا بها وغير مدخول بها لا تحل له حتى تنكح زوجا غيره هذا مثل خبر الصرف قال فيه ثم إنه رجع عنه يعني ابن عباس ‏.‏",
      "text_en": " Abu Dawud said “The opinion of Ibn ‘Abbas has been mentioned in the following tradition. “Ahmad bin Salih and Muhammad bin Yahya narrated this is the version of Ahmad (bin Salih)” from ‘Abd Ar Razzaq from Ma’mar from Al Zuhri from Abu Salamah din Abd Al Rahman bin ‘Awf and Muhammad bin ‘Abd Al Rahman bin Thawban from Muhammad bin Iyas that Ibn ‘Abbas, Abu Hurairah and ‘Abd Alah bin ‘Amr bin Al ‘As were asked about a virgin who is divorced three times by her husband. They all said “She is not lawful for him until she marries a man other than her former husband.”Abu Dawud said “Malik narrated from Yahya bin Sa’id from Bukair bin Al Ashajj from Mu’awiyah bin Abi ‘Ayyash who was present on this occasion when Muhammad bin Iyas bin Al Bukair came to Ibn Al Zubair and Asim in ‘Umar. He asked them about this matter. They replied “Go to Ibn ‘Abbas and Abu Hurairah, I have left them with A’ishah (may Allaah be pleased with her). He then narrated the rest of the tradition.”Abu Dawud said “The statement of Ibn ‘Abbas goes “The divorce by three pronouncements separates the wife from husband whether the marriage has been consummated or not, the previous husband is not lawful for her until she marries a man other than her husband”. This statement is like the tradition which deals with the exchange of money. In this tradition the narrator said “Ibn ‘Abbas withdrew his opinion.”\"",
      "chain": [
        "30226",
        "11222",
        "20121",
        "20115",
        "11013",
        "10567",
        "11218",
        "17"
      ]
    },
    {
      "hadith_no": "2200",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن طاوس، عن أبيه، أن أبا الصهباء، قال لابن عباس أتعلم إنما كانت الثلاث تجعل واحدة على عهد النبي صلى الله عليه وسلم وأبي بكر وثلاثا من إمارة عمر قال ابن عباس نعم ‏.‏",
      "text_en": " Tawus said:                      Abu al-Sahba' said to Ibn Abbas: Do you know that a divorce by three pronouncements was made a single one during the time of the Prophet (ﷺ), and of AbuBakr and in the early days of the caliphate of Umar? He replied: Yes.",
      "chain": [
        "30226",
        "20121",
        "11070",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "2247",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سهل بن سعد الساعدي، قال حضرت لعانهما عند النبي صلى الله عليه وسلم وأنا ابن خمس عشرة سنة ‏.‏ وساق الحديث قال فيه ثم خرجت حاملا فكان الولد يدعى إلى أمه ‏.‏",
      "text_en": " Sahl bin Sa’d Al Sa’idi said “I attended the invoking of the curses with the Messenger of Allah (ﷺ) when I was fifteen. He then narrated the rest of the tradition. In this version he said “She then came out pregnant and the child was ascribed to its mother.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "399"
      ]
    },
    {
      "hadith_no": "2262",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة، أن أعرابيا، أتى النبي صلى الله عليه وسلم فقال إن امرأتي ولدت غلاما أسود وإني أنكره ‏.‏ فذكر معناه ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     A bedouin came to the Prophet (ﷺ), and said: My wife has given birth to a black son, and I disown him. He then narrated the rest of the tradition to the same effect.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2263",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن الهاد، عن عبد الله بن يونس، عن سعيد المقبري، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول حين نزلت آية المتلاعنين ‏\"‏ أيما امرأة أدخلت على قوم من ليس منهم فليست من الله في شىء ولن يدخلها الله جنته وأيما رجل جحد ولده وهو ينظر إليه احتجب الله منه وفضحه على رءوس الأولين والآخرين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuHurayrah heard the Messenger of Allah (ﷺ) say when the verse about invoking curses came down: Any woman who brings to her family one who does not belong to it has nothing to do with Allah (i.e. expects no mercy from Allah), and Allah will not bring her into His Paradise. Allah, the Exalted, will veil Himself from any man who disowns his child when he looks at him, and disgrace him in the presence of all creatures, first and last.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11234",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2272",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثني يونس بن يزيد، قال قال محمد بن مسلم بن شهاب أخبرني عروة بن الزبير، أن عائشة، - رضى الله عنها - زوج النبي صلى الله عليه وسلم أخبرته أن النكاح كان في الجاهلية على أربعة أنحاء فنكاح منها نكاح الناس اليوم يخطب الرجل إلى الرجل وليته فيصدقها ثم ينكحها ونكاح آخر كان الرجل يقول لامرأته إذا طهرت من طمثها أرسلي إلى فلان فاستبضعي منه ويعتزلها زوجها ولا يمسها أبدا حتى يتبين حملها من ذلك الرجل الذي تستبضع منه فإذا تبين حملها أصابها زوجها إن أحب وإنما يفعل ذلك رغبة في نجابة الولد فكان هذا النكاح يسمى نكاح الاستبضاع ونكاح آخر يجتمع الرهط دون العشرة فيدخلون على المرأة كلهم يصيبها فإذا حملت ووضعت ومر ليال بعد أن تضع حملها أرسلت إليهم فلم يستطع رجل منهم أن يمتنع حتى يجتمعوا عندها فتقول لهم قد عرفتم الذي كان من أمركم وقد ولدت وهو ابنك يا فلان فتسمي من أحبت منهم باسمه فيلحق به ولدها ونكاح رابع يجتمع الناس الكثير فيدخلون على المرأة لا تمتنع ممن جاءها وهن البغايا كن ينصبن على أبوابهن رايات يكن علما لمن أرادهن دخل عليهن فإذا حملت فوضعت حملها جمعوا لها ودعوا لهم القافة ثم ألحقوا ولدها بالذي يرون فالتاطه ودعي ابنه لا يمتنع من ذلك فلما بعث الله محمدا صلى الله عليه وسلم هدم نكاح أهل الجاهلية كله إلا نكاح أهل الإسلام اليوم ‏.‏",
      "text_en": " A’ishah wife of the Prophet (ﷺ) said “Marriage in pre Islamic times was of four kinds.” One of them was the marriage contracted by the people today. A man asked another man to marry his relative (sister or daughter) to him. He fixed the dower and married her to him. Another kind of marriage was that a man asked his wife when she became pure from menstruation to send fro so and so and have sexual intercourse with him. Her husband kept himself aloof and did not have intercourse with her till It became apparent that she was pregnant from the man who had intercourse with her. When it was manifest that she was pregnant, her husband approached her if he liked. This marriage was called istibda’(to utilize man for intercourse for a noble birth). A third kind of marriage was that a group of people less than ten in number entered upon a woman and had intercourse with her. When she conceived gave birth to a child and a number of days passed after her delivery, she sent for them. No one of them could refuse to attend and they gathered before her. She said to them “You have realized your affair. I have now given birth to a child. And this is your son.  O so and so. She called the name of anyone of them she liked and the child was attributed to him. A fourth kind of marriage was that many people gathered together and entered upon a woman who did not prevent anyone who came to her. They were prostitutes. They hoisted flags at their doors which served as a sign for the one who intended to enter upon them. When she became pregnant and delivered the child , they got together before her and called for the experts of tracing relationship from physical features. They attributed the child to whom they considered and it was given to him. The child was called his son and he could not deny. When Allah sent Muhammad (ﷺ) as a Prophet, he abolished all kinds of marriages prevalent among the people of the pre Islamic times except of the Muslims practiced today.",
      "chain": [
        "30226",
        "20451",
        "20475",
        "167",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2305",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، قال سمعت المغيرة بن الضحاك، يقول أخبرتني أم حكيم بنت أسيد، عن أمها، أن زوجها، توفي وكانت تشتكي عينيها فتكتحل بالجلاء - قال أحمد الصواب بكحل الجلاء - فأرسلت مولاة لها إلى أم سلمة فسألتها عن كحل الجلاء فقالت لا تكتحلي به إلا من أمر لا بد منه يشتد عليك فتكتحلين بالليل وتمسحينه بالنهار ‏.‏ ثم قالت عند ذلك أم سلمة دخل على رسول الله صلى الله عليه وسلم حين توفي أبو سلمة وقد جعلت على عيني صبرا فقال ‏\"‏ ما هذا يا أم سلمة ‏\"‏ ‏.‏ فقلت إنما هو صبر يا رسول الله ليس فيه طيب ‏.‏ قال ‏\"‏ إنه يشب الوجه فلا تجعليه إلا بالليل وتنزعينه بالنهار ولا تمتشطي بالطيب ولا بالحناء فإنه خضاب ‏\"‏ ‏.‏ قالت قلت بأى شىء أمتشط يا رسول الله قال ‏\"‏ بالسدر تغلفين به رأسك ‏\"‏ ‏.‏",
      "text_en": " Umm Hakim, daughter of Usayd, reported on the authority of her mother that her husband died and she was suffering from sore eyes. She therefore applied collyrium (jala'). Ahmad said:                      The correct version is \"glittering collyrium (kuhl al-jala'). She sent her slave-girl to Umm Salamah, and she asked her about the use of glittering collyrium (kuhl al-jala').  She said: Do not apply it except in the case of dire need which is troubling you. In that case you can use it at night, but you should remove it in the daytime. Then Umm Salamah said: The Messenger of Allah (ﷺ) came to visit me when AbuSalamah died, and I had put the juice of aloes in my eye.  He asked : What is this, Umm Salamah?  I replied: It is only the juice of aloes and contains no perfume.  He said: It gives the face a glow, so apply it only at night and remove it in daytime, and do not comb yourself with scent or henna, for it is a dye.  I asked: What should I use when I comb myself, Messenger of Allah?  He said: Use lote-tree leaves and smear your head copiously with them.",
      "chain": [
        "30226",
        "20029"
      ]
    },
    {
      "hadith_no": "2400",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏ قال أبو داود هذا في النذر وهو قول أحمد بن حنبل ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) as saying: If anyone dies when some fast is due from him (i.e. which he could not keep) his heir must fast on his behalf.Abu Dawud said: This applies to the fast which a man vows ; and this is the opinion of Ahmad b. Hanbal.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2406",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، ووهب بن بيان، - المعنى - قالا حدثنا ابن وهب، حدثني معاوية، عن ربيعة بن يزيد، أنه حدثه عن قزعة، قال أتيت أبا سعيد الخدري وهو يفتي الناس وهم مكبون عليه فانتظرت خلوته فلما خلا سألته عن صيام رمضان في السفر فقال خرجنا مع النبي صلى الله عليه وسلم في رمضان عام الفتح فكان رسول الله صلى الله عليه وسلم يصوم ونصوم حتى بلغ منزلا من المنازل فقال ‏\"‏ إنكم قد دنوتم من عدوكم والفطر أقوى لكم ‏\"‏ ‏.‏ فأصبحنا منا الصائم ومنا المفطر - قال - ثم سرنا فنزلنا منزلا فقال ‏\"‏ إنكم تصبحون عدوكم والفطر أقوى لكم فأفطروا ‏\"‏ ‏.‏ فكانت عزيمة من رسول الله صلى الله عليه وسلم ‏.‏ قال أبو سعيد ثم لقد رأيتني أصوم مع النبي صلى الله عليه وسلم قبل ذلك وبعد ذلك ‏.‏",
      "text_en": " Narrated Qaza'ah:                     I came to Abu Sa'id al-Khudri while he was giving his legal opinion to the people who bent down on him. So I waited to see hi when he was alone. When he became alone, I asked him about keeping fast while travelling. He said: we went out along with the Prophet (ﷺ) in Ramadan in the year of conquest of Mecca. The Messenger of Allah (ﷺ) fasted and we fasted until he reached a certain stage. He said: You have come near your enemy; the breaking of fast will bring you more strength. Then morning came when some of us fasted and other broke their fast. He (Abu Sa'id al-Khudri) said: We then proceeded and alighted at a stage. He said: You are going to attack your enemy tomorrow morning ; breaking the fast will bring you more strength ; so break your fast (i.e. do not keep fast). This resolution (of breaking the fast) took place (due to the announcement) from the Messenger of Allah (ﷺ). Abu Sa'id said: Then I found myself keeping fast along with the Prophet (ﷺ) before and after that.",
      "chain": [
        "30226",
        "36063",
        "20029",
        "27",
        "11414"
      ]
    },
    {
      "hadith_no": "2454",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، حدثني ابن لهيعة، ويحيى بن أيوب، عن عبد الله بن أبي بكر بن حزم، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن حفصة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من لم يجمع الصيام قبل الفجر فلا صيام له ‏\"‏ ‏.‏ قال أبو داود رواه الليث وإسحاق بن حازم أيضا جميعا عن عبد الله بن أبي بكر مثله ووقفه على حفصة معمر والزبيدي وابن عيينة ويونس الأيلي كلهم عن الزهري ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: He who does not determine to fast before dawn does not fast.",
      "chain": [
        "30226",
        "20029",
        "20624",
        "20379",
        "11104",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2457",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني حيوة بن شريح، عن ابن الهاد، عن زميل، مولى عروة عن عروة بن الزبير، عن عائشة، قالت أهدي لي ولحفصة طعام وكنا صائمتين فأفطرنا ثم دخل رسول الله صلى الله عليه وسلم فقلنا له يا رسول الله إنا أهديت لنا هدية فاشتهيناها فأفطرنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا عليكما صوما مكانه يوما آخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Some food was presented to me and Hafsah. We were fasting, but broke our fast. Then the Messenger of Allah (ﷺ) entered upon us. We said to him: A gift was presented to us; we coveted it and we broke our fast. The Messenger of Allah (ﷺ) said: There is no harm to you; keep a fast another day in lieu of it.",
      "chain": [
        "30226",
        "20029",
        "26010",
        "11234",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2522",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا يحيى بن حسان، حدثنا الوليد بن رباح الذماري، حدثني عمي، ‏:‏ نمران بن عتبة الذماري قال ‏:‏ دخلنا على أم الدرداء ونحن أيتام فقالت ‏:‏ أبشروا فإني سمعت أبا الدرداء يقول قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ يشفع الشهيد في سبعين من أهل بيته ‏\"‏ ‏.‏ قال أبو داود ‏:‏ صوابه رباح بن الوليد ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: The intercession of a martyr will be accepted for seventy members of his family.Abu Dawud said: The correct name if the narrator is Rabah b. al-Walid (and not al-walid b. Rabah as occurred in the chain of narrators in the text of the tradition)",
      "chain": [
        "30226",
        "20300"
      ]
    },
    {
      "hadith_no": "2527",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عاصم بن حكيم، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، أن يعلى بن منية، قال ‏:‏ آذن رسول الله صلى الله عليه وسلم بالغزو وأنا شيخ كبير ليس لي خادم، فالتمست أجيرا يكفيني وأجري له سهمه، فوجدت رجلا، فلما دنا الرحيل أتاني فقال ‏:‏ ما أدري ما السهمان وما يبلغ سهمي فسم لي شيئا كان السهم أو لم يكن ‏.‏ فسميت له ثلاثة دنانير، فلما حضرت غنيمته أردت أن أجري له سهمه، فذكرت الدنانير، فجئت النبي صلى الله عليه وسلم فذكرت له أمره، فقال ‏:‏ ‏\"‏ ما أجد له في غزوته هذه في الدنيا والآخرة إلا دنانيره التي سمى ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la ibn Munyah:                     The Messenger of Allah (ﷺ) announced an expedition, and I was a very old man and I had no servant. I, therefore, sought a hireling who would serve instead of me, and I would give him his portion. So I found a man. When the time of departure arrived, he came to me and said: I do not know what would be the portions, and how much would be my portion. So offer something (as wages) to me, whether there would be any portion or not. I offered three dinars (as his wages) for him. When some booty arrived, I wanted to offer him his portion. But I remembered the dinars, so I went to the Prophet (ﷺ) and mentioned the matter to him. He said: All I can find for him regarding this expedition of his in this world and the next is three dinars which were offered him.",
      "chain": [
        "30226",
        "20029",
        "28258",
        "19154",
        "5136"
      ]
    },
    {
      "hadith_no": "2533",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ الجهاد واجب عليكم مع كل أمير برا كان أو فاجرا، والصلاة واجبة عليكم خلف كل مسلم برا كان أو فاجرا وإن عمل الكبائر، والصلاة واجبة على كل مسلم برا كان أو فاجرا وإن عمل الكبائر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Striving in the path of Allah (jihad) is incumbent on you along with every ruler, whether he is pious or impious; the prayer is obligatory on you behind every believer, pious or impious, even if he commits grave sins; the (funeral) prayer is incumbent upon every Muslim, pious and impious, even if he commits major sins.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "10884",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "2535",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا أسد بن موسى، حدثنا معاوية بن صالح، حدثني ضمرة، أن ابن زغب الإيادي، حدثه قال ‏:‏ نزل على عبد الله بن حوالة الأزدي فقال لي ‏:‏ بعثنا رسول الله صلى الله عليه وسلم لنغنم على أقدامنا فرجعنا فلم نغنم شيئا وعرف الجهد في وجوهنا فقام فينا فقال ‏:‏ ‏\"‏ اللهم لا تكلهم إلى فأضعف عنهم، ولا تكلهم إلى أنفسهم فيعجزوا عنها، ولا تكلهم إلى الناس فيستأثروا عليهم ‏\"‏ ‏.‏ ثم وضع يده على رأسي - أو قال ‏:‏ على هامتي - ثم قال ‏:‏ ‏\"‏ يا ابن حوالة إذا رأيت الخلافة قد نزلت أرض المقدسة فقد دنت الزلازل والبلابل والأمور العظام، والساعة يومئذ أقرب من الناس من يدي هذه من رأسك ‏\"‏ ‏.‏ قال أبو داود ‏:‏ عبد الله بن حوالة حمصي ‏.‏",
      "text_en": " Narrated Abdullah ibn Hawalah al-Azdi:                     The Messenger of Allah (ﷺ) sent us on foot to get spoil, but we returned without getting any. When he saw the signs of distress on our faces, he stood up on our faces and said: O Allah, do not put them under my care, for I would be too weak to care for them; do not put them in care of themselves, for they would be incapable of that, and do not put them in the care of men, for they would choose the best things for themselves. He then placed his hand on my head and said: Ibn Hawalah, when you see the caliphate has settled in the holy land, earthquakes, sorrows and serious matters will have drawn near and on that day the Last Hour will be nearer to mankind than this hand of mine is to your head.Abu Dawud said: 'Abd Allah b. Hawalah belongs to Hims.",
      "chain": [
        "30226",
        "28040",
        "20675",
        "20738"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عبد الرحمن، وعبد الله بن كعب بن مالك، قال أبو داود قال أحمد ‏:‏ كذا قال هو - يعني ابن وهب - وعنبسة - يعني ابن خالد - جميعا عن يونس قال أحمد ‏:‏ والصواب عبد الرحمن بن عبد الله أن سلمة بن الأكوع قال ‏:‏ لما كان يوم خيبر قاتل أخي قتالا شديدا، فارتد عليه سيفه فقتله فقال أصحاب رسول الله صلى الله عليه وسلم في ذلك - وشكوا فيه - ‏:‏ رجل مات بسلاحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ مات جاهدا مجاهدا ‏\"‏ ‏.‏ قال ابن شهاب ‏:‏ ثم سألت ابنا لسلمة بن الأكوع فحدثني عن أبيه بمثل ذلك، غير أنه قال فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ كذبوا مات جاهدا مجاهدا فله أجره مرتين ‏\"‏ ‏.‏",
      "text_en": " Salamah bin Al Akwa’ said “On the day of the battle of the Khaibar, my brother fought desperately. But his sword fell back on him and killed him. The Companions of the Apostle of Allaah(ﷺ) talked about him and doubted it (his martyrdom) saying “A man who died with his own weapon”. The Apostle of Allaah(ﷺ) said “he died as a warrior striving in the path of Allaah. Ibn Shihab said “I asked the son of Salamah bin Al Akwa’.” He narrated to me on the authority of his father similar to that except that he said “The Apostle of Allaah(ﷺ) said “They told a lie, he died as a warrior striving in the path of Allaah. There is a double reward for him.””",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "30002",
        "20475"
      ]
    },
    {
      "hadith_no": "2747",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، حدثنا حيى، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم خرج يوم بدر في ثلاثمائة وخمسة عشر فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم إنهم حفاة فاحملهم اللهم إنهم عراة فاكسهم اللهم إنهم جياع فأشبعهم ‏\"‏ ‏.‏ ففتح الله له يوم بدر فانقلبوا حين انقلبوا وما منهم رجل إلا وقد رجع بجمل أو جملين واكتسوا وشبعوا ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) went out on the day of Badr along with three hundred and fifteen (men). The Messenger of Allah (ﷺ) said: O Allah, they are on foot, provide mount for them; O Allah , they are naked, clothe them; O Allah, they are hungry, provide food for them. Allah then bestowed victory on them. They returned when they were clothed. There was no man of them but he returned with one or two camels; they were clothed and ate to their fill.",
      "chain": [
        "30226",
        "20029",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "2758",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن بكير بن الأشج، عن الحسن بن علي بن أبي رافع، أن أبا رافع، أخبره قال بعثتني قريش إلى رسول الله صلى الله عليه وسلم فلما رأيت رسول الله صلى الله عليه وسلم ألقي في قلبي الإسلام فقلت يا رسول الله إني والله لا أرجع إليهم أبدا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لا أخيس بالعهد ولا أحبس البرد ولكن ارجع فإن كان في نفسك الذي في نفسك الآن فارجع ‏\"‏ ‏.‏ قال فذهبت ثم أتيت النبي صلى الله عليه وسلم فأسلمت ‏.‏ قال بكير وأخبرني أن أبا رافع كان قبطيا ‏.‏ قال أبو داود هذا كان في ذلك الزمان فأما اليوم فلا يصلح ‏.‏",
      "text_en": " Narrated AbuRafi':                     The Quraysh sent me to the Messenger of Allah (ﷺ), and when I saw the Messenger of Allah (ﷺ), Islam was cast into my heart, so I said: Messenger of Allah, I swear by Allah, I shall never return to them. The Messenger of Allah (ﷺ) replied: I do not break a covenant or imprison messengers, but return, and if you feel the same as you do just now, come back. So I went away, and then came to the Prophet (ﷺ) and accepted Islam.The narrator Bukair said: He informed me that Abu Rafi' was a Copt.Abu Dawud said: This was valid in those days, but today it is not valid.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11154",
        "30"
      ]
    },
    {
      "hadith_no": "2763",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال حدثتني أم هانئ بنت أبي طالب، أنها أجارت رجلا من المشركين يوم الفتح فأتت النبي صلى الله عليه وسلم فذكرت له ذلك فقال ‏\"‏ قد أجرنا من أجرت وأمنا من أمنت ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “Umm Hani daughter of Abu Talib told me that in the year of the conquest she gave protection to a man from the polytheists. She came to the Prophet (ﷺ) and mentioned it to him. He said “We have given security to those to whom you have given it.”",
      "chain": [
        "30226",
        "20029",
        "20514",
        "11223",
        "11211",
        "17",
        "198"
      ]
    },
    {
      "hadith_no": "2768",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا سفيان، عن عمرو بن دينار، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لكعب بن الأشرف فإنه قد آذى الله ورسوله ‏\"‏ ‏.‏ فقام محمد بن مسلمة فقال أنا يا رسول الله أتحب أن أقتله قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فأذن لي أن أقول شيئا ‏.‏ قال ‏\"‏ نعم قل ‏\"‏ ‏.‏ فأتاه فقال إن هذا الرجل قد سألنا الصدقة وقد عنانا قال وأيضا لتملنه ‏.‏ قال اتبعناه فنحن نكره أن ندعه حتى ننظر إلى أى شىء يصير أمره وقد أردنا أن تسلفنا وسقا أو وسقين ‏.‏ قال كعب أى شىء ترهنوني قال وما تريد منا قال نساءكم قالوا سبحان الله أنت أجمل العرب نرهنك نساءنا فيكون ذلك عارا علينا ‏.‏ قال فترهنوني أولادكم ‏.‏ قالوا سبحان الله يسب ابن أحدنا فيقال رهنت بوسق أو وسقين ‏.‏ قالوا نرهنك اللأمة يريد السلاح قال نعم ‏.‏ فلما أتاه ناداه فخرج إليه وهو متطيب ينضخ رأسه فلما أن جلس إليه وقد كان جاء معه بنفر ثلاثة أو أربعة فذكروا له قال عندي فلانة وهي أعطر نساء الناس ‏.‏ قال تأذن لي فأشم قال نعم ‏.‏ فأدخل يده في رأسه فشمه قال أعود قال نعم فأدخل يده في رأسه فلما استمكن منه قال دونكم ‏.‏ فضربوه حتى قتلوه ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah ( may peace be upon him) said : Who will pursue Ka’b bin Al-Ashraf, for he has caused trouble to Allah and His Apostle? Muhammad bin Maslamah stood up and said: I (shall do), Messenger of Allah. Do you want that I should kill him? He said: Yes. He said: So permit me to say something (against you). He said: Yes say. He then came to him (Ka’b b. al-Ashraf) and said to him: This man has asked us for sadaqah (alms) and has put us into trouble. He (Ka’b) said: You will be more grieved. He (Muhammad bin Maslamah) said: We have followed him and we do not like to forsake him until we see what will be the consequences of his matter. We wished if you could lend us one or two wasqs.  Ka’b said: What will you mortgage with me? He asked: what do you want from us? He replied : your Women. They said: Glory be to Allah: You are the most beautiful of the Arabs.  If we mortgage our women with you, that will be a disgrace for us. He said “The mortgage your children.” They said “Glory be to Allaah, a son of us may abuse saying “You were mortgaged for one or two wasqs.” They said “We shall mortgage or coat of mail with you. By this he meant arms”. He said “Yes, when he came to him, he called him and he came out while he used perfume and his head was spreading fragrance. When he at with him and he came there accompanied by three or four persons who mentioned his perfume. He said “I have such and such woman with me. She is most fragrant of the women among the people. He (Muhammad bin Maslamah) asked “Do you permit me so that I may smell? He said “Yes. He then entered his hand through his hair and smell it.” He said “May I repeat?” He said “Yes. He again entered his hand through his hair. When he got his complete control, he said “Take him. So he struck him until they killed him.”",
      "chain": [
        "30226",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "2775",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، حدثني موسى بن يعقوب، عن ابن عثمانقال أبو داود وهو يحيى بن الحسن بن عثمان عن الأشعث بن إسحاق بن سعد، عن عامر بن سعد، عن أبيه، قال خرجنا مع رسول الله صلى الله عليه وسلم من مكة نريد المدينة فلما كنا قريبا من عزورا نزل ثم رفع يديه فدعا الله ساعة ثم خر ساجدا فمكث طويلا ثم قام فرفع يديه فدعا الله ساعة ثم خر ساجدا فمكث طويلا ثم قام فرفع يديه ساعة ثم خر ساجدا ذكره أحمد ثلاثا قال ‏\"‏ إني سألت ربي وشفعت لأمتي فأعطاني ثلث أمتي فخررت ساجدا شكرا لربي ثم رفعت رأسي فسألت ربي لأمتي فأعطاني ثلث أمتي فخررت ساجدا لربي شكرا ثم رفعت رأسي فسألت ربي لأمتي فأعطاني الثلث الآخر فخررت ساجدا لربي ‏\"‏ ‏.‏ قال أبو داود أشعث بن إسحاق أسقطه أحمد بن صالح حين حدثنا به فحدثني به عنه موسى بن سهل الرملي ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     We went out with the Messenger of Allah (ﷺ) from Mecca making for Medina. When we were near Azwara', he alighted, then raised his hands, and made supplication to Allah for a time, after which he prostrated himself, remaining a long time in prostration. Then he stood up and raised his hands for a time, after which he prostrated himself, remaining a long time in prostration.  He then stood up and raised his hands for a time, after which he prostrated himself. Ahmad mentioned it three times. He then said: I begged my Lord and made intercession for my people, and He gave me a third of my people, so I prostrated myself in gratitude to my Lord. Then I raised my head and begged my Lord for my people, and He gave me a third of my people, so I prostrated myself in gratitude to my Lord. Then I raised my head and begged my Lord for my people and He gave me the remaining third, so I prostrated myself in gratitude to my Lord.Abu Dawud said: When Ahmad b. Salih narrated this tradition to us, he omitted the name of Ash'ath b. Ishaq, but Musa b. Sahl al-Ramli narrated it to us through him.",
      "chain": [
        "30226",
        "20172",
        "20706",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "2792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني حيوة، حدثني أبو صخر، عن ابن قسيط، عن عروة بن الزبير، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر بكبش أقرن يطأ في سواد وينظر في سواد ويبرك في سواد فأتي به فضحى به فقال ‏\"‏ يا عائشة هلمي المدية ‏\"‏ ‏.‏ ثم قال ‏\"‏ اشحذيها بحجر ‏\"‏ ‏.‏ ففعلت فأخذها وأخذ الكبش فأضجعه وذبحه وقال ‏\"‏ بسم الله اللهم تقبل من محمد وآل محمد ومن أمة محمد ‏\"‏ ‏.‏ ثم ضحى به صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (Saws) ordered a horned ram with black legs, black belly and black round the eyes, and it was brought from him to sacrifice. He said: 'Aishah, get the knife then he said: Sharpen it with a stone. So I did. He took it, then take the ram he placed it on the ground and slaughtered it. He then said: In the name of Allah. O Allah, accept it for Muhammad, Muhammad's family and Muhammad's people. Then he sacrificed it.",
      "chain": [
        "30226",
        "20029",
        "26010",
        "11236",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2866",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، أخبرني ابن أبي ذئب، عن شرحبيل، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لأن يتصدق المرء في حياته بدرهم خير له من أن يتصدق بمائة عند موته ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: A man giving a dirham as sadaqah (charity) during his life is better than giving one hundred dirhams as sadaqah (charity) at the moment of his death.",
      "chain": [
        "30226",
        "20172",
        "20177",
        "38"
      ]
    },
    {
      "hadith_no": "2873",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا يحيى بن محمد المديني، حدثنا عبد الله بن خالد بن سعيد بن أبي مريم، عن أبيه، عن سعيد بن عبد الرحمن بن يزيد بن رقيش، أنه سمع شيوخا، من بني عمرو بن عوف ومن خاله عبد الله بن أبي أحمد قال قال علي بن أبي طالب حفظت عن رسول الله صلى الله عليه وسلم ‏\"‏ لا يتم بعد احتلام ولا صمات يوم إلى الليل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     I memorised (a tradition) from the Messenger of Allah (ﷺ): There is no orphanhood after puberty, and there is no silence for the whole day till the night.",
      "chain": [
        "30226"
      ]
    },
    {
      "hadith_no": "2898",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن صالح، ومخلد بن خالد، - وهذا حديث مخلد وهو الأشبع - قال حدثنا عبد الرزاق حدثنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقسم المال بين أهل الفرائض على كتاب الله فما تركت الفرائض فلأولى ذكر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Divide the property among those whose share have been prescribed in the Book of Allah, and what remains from the prescribed shares goes to the nearest male heirs.",
      "chain": [
        "30226",
        "30567",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2927",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا سفيان، عن الزهري، عن سعيد، قال كان عمر بن الخطاب يقول الدية للعاقلة ولا ترث المرأة من دية زوجها شيئا حتى قال له الضحاك بن سفيان كتب إلى رسول الله صلى الله عليه وسلم أن أورث امرأة أشيم الضبابي من دية زوجها ‏.‏ فرجع عمر ‏.‏ قال أحمد بن صالح حدثنا عبد الرزاق بهذا الحديث عن معمر عن الزهري عن سعيد وقال فيه وكان النبي صلى الله عليه وسلم استعمله على الأعراب ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Sa'id said: Umar ibn al-Khattab said: Blood-money is meant for the clan of the slain, and she will not inherit from the blood-money of her husband. Ad-Dahhak ibn Sufyan said: The Messenger of Allah (ﷺ) wrote to me that I should give a share to the wife of Ashyam ad-Dubabi from the blood-money of her husband. So Umar withdrew his opinion. Ahmad ibn Salih said: AbdurRazzaq transmitted this tradition to us from Ma'mar, from az-Zuhri on the authority of Sa'id. In this version he said: The Prophet (ﷺ) made him governor over the bedouins.",
      "chain": [
        "30226",
        "20005",
        "11013",
        "11168",
        "3"
      ]
    },
    {
      "hadith_no": "2941",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني مالك، عن ابن شهاب، عن عروة، أن عائشة، رضى الله عنها أخبرته عن بيعة، رسول الله صلى الله عليه وسلم النساء قالت ما مس رسول الله صلى الله عليه وسلم يد امرأة قط إلا أن يأخذ عليها فإذا أخذ عليها فأعطته قال ‏\"‏ اذهبي فقد بايعتك ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) never touched the hand of woman, but he received the oath of allegiance from her. When he received the oath of allegiance from her, she gave it to him, and he said: Go, I have received your oath of allegiance.",
      "chain": [
        "30226",
        "20029",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2982",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني يزيد بن هرمز، أن نجدة الحروري، حين حج في فتنة ابن الزبير أرسل إلى ابن عباس يسأله عن سهم ذي القربى ويقول لمن تراه قال ابن عباس لقربى رسول الله صلى الله عليه وسلم قسمه لهم رسول الله صلى الله عليه وسلم وقد كان عمر عرض علينا من ذلك عرضا رأيناه دون حقنا فرددناه عليه وأبينا أن نقبله ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Yazid ibn Hurmuz said that when Najdah al-Haruri performed hajj during the rule of Ibn az-Zubayr, he sent someone to Ibn Abbas to ask him about the portion of the relatives (in the fifth). He asked: For whom do you think?  Ibn Abbas replied: For the relatives of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) divided it among them. Umar presented it to us but we found it less than our right. We, therefore returned it to him and refused to accept it.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10627"
      ]
    },
    {
      "hadith_no": "2985",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني عبد الله بن الحارث بن نوفل الهاشمي، أن عبد المطلب بن ربيعة بن الحارث بن عبد المطلب، أخبره أن أباه ربيعة بن الحارث وعباس بن عبد المطلب قالا لعبد المطلب بن ربيعة وللفضل بن عباس ائتيا رسول الله صلى الله عليه وسلم فقولا له يا رسول الله قد بلغنا من السن ما ترى وأحببنا أن نتزوج وأنت يا رسول الله أبر الناس وأوصلهم وليس عند أبوينا ما يصدقان عنا فاستعملنا يا رسول الله على الصدقات فلنؤد إليك ما يؤدي العمال ولنصب ما كان فيها من مرفق ‏.‏ قال فأتى إلينا علي بن أبي طالب ونحن على تلك الحال فقال لنا إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا والله لا نستعمل منكم أحدا على الصدقة ‏\"‏ ‏.‏ فقال له ربيعة هذا من أمرك قد نلت صهر رسول الله صلى الله عليه وسلم فلم نحسدك عليه ‏.‏ فألقى علي رداءه ثم اضطجع عليه فقال أنا أبو حسن القرم والله لا أريم حتى يرجع إليكما ابناكما بجواب ما بعثتما به إلى النبي صلى الله عليه وسلم ‏.‏ قال عبد المطلب فانطلقت أنا والفضل إلى باب حجرة النبي صلى الله عليه وسلم حتى نوافق صلاة الظهر قد قامت فصلينا مع الناس ثم أسرعت أنا والفضل إلى باب حجرة النبي صلى الله عليه وسلم وهو يومئذ عند زينب بنت جحش فقمنا بالباب حتى أتى رسول الله صلى الله عليه وسلم فأخذ بأذني وأذن الفضل ثم قال أخرجا ما تصرران ثم دخل فأذن لي وللفضل فدخلنا فتواكلنا الكلام قليلا ثم كلمته أو كلمه الفضل - قد شك في ذلك عبد الله - قال كلمه بالأمر الذي أمرنا به أبوانا فسكت رسول الله صلى الله عليه وسلم ساعة ورفع بصره قبل سقف البيت حتى طال علينا أنه لا يرجع إلينا شيئا حتى رأينا زينب تلمع من وراء الحجاب بيدها تريد أن لا تعجلا وإن رسول الله صلى الله عليه وسلم في أمرنا ثم خفض رسول الله صلى الله عليه وسلم رأسه فقال لنا ‏\"‏ إن هذه الصدقة إنما هي أوساخ الناس وإنها لا تحل لمحمد ولا لآل محمد ادعوا لي نوفل بن الحارث ‏\"‏ ‏.‏ فدعي له نوفل بن الحارث فقال ‏\"‏ يا نوفل أنكح عبد المطلب ‏\"‏ ‏.‏ فأنكحني نوفل ثم قال النبي صلى الله عليه وسلم ‏\"‏ ادعوا لي محمية بن جزء ‏\"‏ ‏.‏ وهو رجل من بني زبيد كان رسول الله صلى الله عليه وسلم استعمله على الأخماس فقال رسول الله صلى الله عليه وسلم لمحمية ‏\"‏ أنكح الفضل ‏\"‏ ‏.‏ فأنكحه ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قم فأصدق عنهما من الخمس كذا وكذا ‏\"‏ ‏.‏ لم يسمه لي عبد الله بن الحارث ‏.‏",
      "text_en": " Narrated AbdulMuttalib ibn Rabi'ah ibn al-Harith:                     AbdulMuttalib ibn Rabi'ah ibn al-Harith said that his father, Rabi'ah ibn al-Harith, and Abbas ibn al-Muttalib said to AbdulMuttalib ibn Rabi'ah and al-Fadl ibn Abbas: Go to the Messenger of Allah (ﷺ) and tell him: Messenger of Allah, we are now of age as you see, and we wish to marry. Messenger of Allah, you are the kindest of the people and the most skilled in matchmaking. Our fathers have nothing with which to pay our dower. So appoint us collector of sadaqah (zakat), Messenger of Allah, and we shall give you what the other collectors give you, and we shall have the benefit accruing from it. Ali came to us while we were in this condition.  He said: The Messenger of Allah (ﷺ) said: No, I swear by Allah, he will not appoint any of you collector of sadaqah (zakat).  Rabi'ah said to him: This is your condition; you have gained your relationship with the Messenger of Allah (ﷺ) by marriage, but we did not grudge you that. Ali then put his cloak on the earth and lay on it.  He then said: I am the father of Hasan, the chief. I swear by Allah, I shall not leave this place until your sons come with a reply (to the question) for which you have sent them to the Prophet (ﷺ).  AbdulMuttalib said: So I and al-Fadl went towards the door of the apartment of the Prophet (ﷺ). We found that the noon prayer in congregation had already started. So we prayed along with the people. I and al-Fadl then hastened towards the door of the apartment of the Prophet (ﷺ). He was (staying) with Zaynab, daughter of Jahsh, that day. We stood until the Messenger of Allah (ﷺ) came. He caught my ear and the ear of al-Fadl.  He then said: Reveal what you conceal in your hearts. He then entered  and permitted me and al-Fadl (to enter). So we entered and for a little while we asked each other to talk. I then talked to him, or al-Fadl talked to him (the narrator, Abdullah was not sure).  He said: He spoke to him concerning the matter about which our fathers ordered us to ask him. The Messenger of Allah (ﷺ) remained silent for a moment and raised his eyes towards the ceiling of the room. He took so long that we thought he would not give any reply to us. Meanwhile we saw that Zaynab was signalling to us with her hand from behind the veil, asking us not to be in a hurry, and that the Messenger of Allah (ﷺ) was (thinking) about our matter.  The Messenger of Allah (ﷺ) then lowered his head and said to us: This sadaqah (zakat) is a dirt of the people. It is legal neither for Muhammad nor for the family of Muhammad. Call Nawfal ibn al-Harith to me. So Nawfal ibn al-Harith was called to him.  He said: Nawfal, marry AbdulMuttalib (to your daughter). So Nawfal married me (to his daughter).  The Prophet (ﷺ) then said: Call Mahmiyyah ibn Jaz'i to me. He was a man of Banu Zubayd, whom the Messenger of Allah (ﷺ) had appointed collector of the fifths.  The Messenger of Allah (ﷺ) said to Mahmiyyah: Marry al-Fadl (to your daughter). So he married him to her. The Messenger of Allah (ﷺ) said: Stand up and pay the dower from the fifth so-and-so on their behalf. Abdullah ibn al-Harith did not name it (i.e. the amount of the dower).",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "2986",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثنا يونس، عن ابن شهاب، أخبرني علي بن حسين، أن حسين بن علي، أخبره أن علي بن أبي طالب قال كانت لي شارف من نصيبي من المغنم يوم بدر وكان رسول الله صلى الله عليه وسلم أعطاني شارفا من الخمس يومئذ فلما أردت أن أبني بفاطمة بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع أن يرتحل معي فنأتي بإذخر أردت أن أبيعه من الصواغين فأستعين به في وليمة عرسي فبينا أنا أجمع لشارفى متاعا من الأقتاب والغرائر والحبال - وشارفاى مناخان إلى جنب حجرة رجل من الأنصار - أقبلت حين جمعت ما جمعت فإذا بشارفى قد اجتبت أسنمتهما وبقرت خواصرهما وأخذ من أكبادهما فلم أملك عينى حين رأيت ذلك المنظر فقلت من فعل هذا قالوا فعله حمزة بن عبد المطلب وهو في هذا البيت في شرب من الأنصار غنته قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء فوثب إلى السيف فاجتب أسنمتهما وبقر خواصرهما وأخذ من أكبادهما ‏.‏ قال علي فانطلقت حتى أدخل على رسول الله صلى الله عليه وسلم وعنده زيد بن حارثة قال فعرف رسول الله صلى الله عليه وسلم الذي لقيت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لك ‏\"‏ ‏.‏ قال قلت يا رسول الله ما رأيت كاليوم عدا حمزة على ناقتى فاجتب أسنمتهما وبقر خواصرهما وها هو ذا في بيت معه شرب فدعا رسول الله صلى الله عليه وسلم بردائه فارتداه ثم انطلق يمشي واتبعته أنا وزيد بن حارثة حتى جاء البيت الذي فيه حمزة فاستأذن فأذن له فإذا هم شرب فطفق رسول الله صلى الله عليه وسلم يلوم حمزة فيما فعل فإذا حمزة ثمل محمرة عيناه فنظر حمزة إلى رسول الله صلى الله عليه وسلم ثم صعد النظر فنظر إلى ركبتيه ثم صعد النظر فنظر إلى سرته ثم صعد النظر فنظر إلى وجهه ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف رسول الله صلى الله عليه وسلم أنه ثمل فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى فخرج وخرجنا معه ‏.‏",
      "text_en": " ‘Ali bin Abi Talib said “I had an old she Camel that I got as my share from the booty on the day of Badr. The Apostle of Allaah(ﷺ) also gave me an old she camel from the fifth that day. When I intended to cohabit with Fathimah daughter of the Apostle of Allaah(ﷺ), I made arrangement with a man who was a goldsmith belonging to Banu Qainuqa’ to go with me so that we may bring grass. I intended to sell it to the goldsmith there by seeking help in my wedding feast. While I was collecting for my old Camels saddles, baskets and ropes both of she Camels were seated in a corner of the apartment of a man of the Ansar. When I collected what I collected (i.e., equipment) I turned (towards them). I suddenly found that the humps of she Camels were cut off and their hips were pierced and their lives were taken out. I could not control my eyes (to weep) when I saw that scene. I said “Who has done this?” They (the people) replied “Hamzah bin ‘Abd Al Muttalib”. He is among the drunkards of the Ansar in this house. A singing girl is singing for him and his Companions. While singing she said “Oh Hamza, rise to these plumpy old she Camels. So he jumped to the sword and cut off their humps, pierced their hips and took out their livers.” ‘Ali said “I went till I entered upon the Apostle of Allaah(ﷺ) while Zaid bin Harithah was with him.” The Apostle of Allaah(ﷺ) realized what I had met with. The Apostle of Allaah(ﷺ) aid “What is the matter with you?” I said Apostle of Allaah(ﷺ), I never saw the thing that happened with me today. Hamzah wronged my she Camels, he cut off their humps, pierced their hips. Lo! He is in a house with drunkards. The Apostle of Allaah(ﷺ) asked for his cloak. It was brought to him. He then went out, I and Zaid bin Harithah followed him until we reached the house where Hamzah was. He asked permission ( to entre). He was permitted. He found drunkards there. The Apostle of Allaah(ﷺ) began to rebuke him (Hamzah) for his action. Hamzah was intoxicated and his eyes were reddish. Hamzah looked at the Apostle of Allaah(ﷺ). He then raised his eyes and looked at his knees, he then raised his eyes and looked at his navel and he then raised his eyes and looked at his face. Hamzah then said “Are you but the salves of my father? Then the Apostle of Allaah(ﷺ) knew that he was intoxicated. So the Apostle of Allaah(ﷺ) moved backward. He then went out and we also went out with him.”",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11013",
        "11045",
        "20315",
        "5"
      ]
    },
    {
      "hadith_no": "2987",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، حدثني عياش بن عقبة الحضرمي، عن الفضل بن الحسن الضمري، أن أم الحكم، أو ضباعة ابنتى الزبير بن عبد المطلب حدثته عن إحداهما أنها قالت أصاب رسول الله صلى الله عليه وسلم سبيا فذهبت أنا وأختي وفاطمة بنت رسول الله صلى الله عليه وسلم فشكونا إليه ما نحن فيه وسألناه أن يأمر لنا بشىء من السبى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سبقكن يتامى بدر لكن سأدلكن على ما هو خير لكن من ذلك تكبرن الله على أثر كل صلاة ثلاثا وثلاثين تكبيرة وثلاثا وثلاثين تسبيحة وثلاثا وثلاثين تحميدة ولا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏ قال عياش وهما ابنتا عم النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Umm Al Hakam or Duba’ah daughters of Al Zibair bin ‘Abd Al Muttalib said “Some captives of war were brought to the Apostle of Allaah(ﷺ). I and my sister Fatimah, daughter of Apostle of Allaah(ﷺ) went (to the Prophet) and complained to him about our existing condition. We asked him to order (to give) us some captives. The Apostle of Allaah(ﷺ) said “the orphans of the people who were killed in the battle of Badr came before you (and they asked for the captives). But I tell you something better than that. You should utter “Allaah is Most Great” after each prayer thirty three times, “Glory be to Allaah” thirty three times, “Praise be to Allaah” thirty three times and “there is no god but Allaah alone, He has no associate, the Kingdom belongs to Him and praise is due to Him and He has power over all things.”The narrator ‘Ayyash said “They were daughters of Uncle of the Prophet (ﷺ).”",
      "chain": [
        "30226",
        "20029",
        "26033"
      ]
    },
    {
      "hadith_no": "3135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، ح وحدثنا سليمان بن داود المهري، أخبرنا ابن وهب، - وهذا لفظه - أخبرني أسامة بن زيد الليثي، أن ابن شهاب، أخبره أن أنس بن مالك حدثهم أن شهداء أحد لم يغسلوا ودفنوا بدمائهم ولم يصل عليهم ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The martyrs of Uhud were not washed, and they were buried with their blood. No prayer was offered over them.",
      "chain": [
        "30226",
        "20029",
        "30584",
        "20029",
        "20500",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3156",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثني ابن وهب، حدثني هشام بن سعد، عن حاتم بن أبي نصر، عن عبادة بن نسى، عن أبيه، عن عبادة بن الصامت، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ خير الكفن الحلة وخير الأضحية الكبش الأقرن ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Prophet (ﷺ) said: The best shroud is a lower garment and one which covers the whole body, and the best sacrifice is a horned ram.",
      "chain": [
        "30226",
        "20029",
        "20519",
        "40"
      ]
    },
    {
      "hadith_no": "3161",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، حدثني ابن أبي ذئب، عن القاسم بن عباس، عن عمرو بن عمير، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غسل الميت فليغتسل ومن حمله فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) said: He who washes the dead should take a bath, and he who carries him should perform ablution.",
      "chain": [
        "30226",
        "20172",
        "20177",
        "10608",
        "13544",
        "13"
      ]
    },
    {
      "hadith_no": "3220",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، أخبرني عمرو بن عثمان بن هانئ، عن القاسم، قال دخلت على عائشة فقلت يا أمه اكشفي لي عن قبر النبي صلى الله عليه وسلم وصاحبيه رضى الله عنهما فكشفت لي عن ثلاثة قبور لا مشرفة ولا لاطئة مبطوحة ببطحاء العرصة الحمراء قال أبو علي يقال إن رسول الله صلى الله عليه وسلم مقدم وأبو بكر عند رأسه وعمر عند رجلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Al-Qasim ibn Muhammad ibn AbuBakr:                     I said to Aisha! Mother, show me the grave of the Messenger of Allah (ﷺ) and his two Companions (Allah be pleased with them). She showed me three graves which were neither high nor low, but were spread with soft red pebbles in an open space.Abu 'Ali said: It is said that the Messenger of Allah (ﷺ) is forward, Abu Bakr is near his hed and 'Umar is near is feet. His head is at the feet of the Messenger of Allah (ﷺ).",
      "chain": [
        "30226",
        "20172",
        "22160",
        "10535"
      ]
    },
    {
      "hadith_no": "3279",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن صالح، قال قرأت على أنس بن عياض حدثني عبد الرحمن بن حرملة، عن أم حبيب بنت ذؤيب بن قيس المزنية، - وكانت تحت رجل منهم من أسلم ثم كانت تحت ابن أخ لصفية زوج النبي صلى الله عليه وسلم قال ابن حرملة ‏:‏ فوهبت لنا أم حبيب صاعا - حدثتنا عن ابن أخي صفية عن صفية أنه صاع النبي صلى الله عليه وسلم ‏.‏ قال أنس ‏:‏ فجربته، أو قال فحزرته فوجدته مدين ونصفا بمد هشام ‏.‏",
      "text_en": " Narrated Safiyyah bint Huyayy:                     Ibn Harmalah said: Umm Habib gave us a sa' and told us narration from the nephew of Safiyyah on the authority of Safiyyah that it was the sa' of the Prophet (ﷺ). Anas ibn Ayyad said: I tested it and found its capacity two and half mudd according to the mudd of Hisham.",
      "chain": [
        "30226",
        "11878"
      ]
    },
    {
      "hadith_no": "3311",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) as saying: If anyone dies when some fast due from him has been unfulfilled, his heir must fast on his behalf.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3318",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الله بن كعب بن مالك، عن أبيه، أنه قال لرسول الله صلى الله عليه وسلم حين تيب عليه ‏:‏ إني أنخلع من مالي ‏.‏ فذكر نحوه إلى ‏:‏ ‏\"‏ خير لك ‏\"‏ ‏.‏",
      "text_en": " Narrated Ka'b bin Malik:                     To the Messenger of Allah (ﷺ) when his repentance was accepted: I should divest myself of my property. He then mentioned a similar tradition up to the words, \"better for you\".",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3335",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، ح وحدثنا أحمد بن صالح، حدثنا عنبسة، عن يونس، عن ابن شهاب، قال قال ابن المسيب إن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلف منفقة للسلعة ممحقة للبركة ‏\"‏ ‏.‏ قال ابن السرح ‏\"‏ للكسب ‏\"‏ ‏.‏ وقال عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     I heard Messenger of Allah (ﷺ) say: Swearing produces a ready sale for a commodity but blots out the blessing. The narrator Ibn al-Sarh said: \"for earning\". He also narrated this tradition from Sa'id b. al-Musayyab on the authority of Abu Hurairah from the Prophet (ﷺ).",
      "chain": [
        "30485",
        "20029",
        "30226",
        "11716",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3362",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني خارجة بن زيد بن ثابت، عن أبيه، أن النبي صلى الله عليه وسلم رخص في بيع العرايا بالتمر والرطب ‏.‏",
      "text_en": " Narrated Zaid b. Thabit:                     The Prophet (ﷺ) gave license for the sale of 'araya for dried dates and fresh dates.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11006",
        "49"
      ]
    },
    {
      "hadith_no": "3372",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثني يونس، قال سألت أبا الزناد عن بيع الثمر، قبل أن يبدو، صلاحه وما ذكر في ذلك فقال كان عروة بن الزبير يحدث عن سهل بن أبي حثمة عن زيد بن ثابت قال كان الناس يتبايعون الثمار قبل أن يبدو صلاحها فإذا جد الناس وحضر تقاضيهم قال المبتاع قد أصاب الثمر الدمان وأصابه قشام وأصابه مراض عاهات يحتجون بها فلما كثرت خصومتهم عند النبي صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم كالمشورة يشير بها ‏\"‏ فإما لا فلا تتبايعوا الثمرة حتى يبدو صلاحها ‏\"‏ ‏.‏ لكثرة خصومتهم واختلافهم ‏.‏",
      "text_en": " Yunus said:                      I asked Abu Zinad about the sale of fruits before they were clearly in good condition, and what was said about it. He replied: Urwah ibn az-Zubayr reports a tradition from Sahl ibn Abi Hathmah on the authority of Zayd ibn Thabit who said: The people used to sell fruits before they were clearly in good condition. When the people cut off the fruits, and were demanded to pay the price, the buyer said: The fruits have been smitten by duman, qusham and murad fruit diseases on which they used to dispute. When their disputes which were brought to the Prophet (ﷺ) increased, the Messenger of Allah (ﷺ) said to them as an advice: No, do not sell fruits till they are in good condition, due to a large number of their disputes and differences.",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11061",
        "10511",
        "1822",
        "49"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثنا يونس، عن ابن شهاب، قال أخبرني عامر بن سعد بن أبي وقاص، أن أبا سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم بمعنى حديث سفيان وعبد الرزاق جميعا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Said al-Khudri through a different chain of narrators from the Messenger of Allah (ﷺ) to the same effect as narrated by both Sufyan and 'Abd al-Razzaq.",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11013",
        "10554",
        "38"
      ]
    },
    {
      "hadith_no": "3427",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثني أحمد بن صالح، حدثنا ابن أبي فديك، عن عبيد الله، - يعني ابن هرير - عن أبيه، عن جده، رافع - هو ابن خديج - قال نهى رسول الله صلى الله عليه وسلم عن كسب الأمة حتى يعلم من أين هو ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     The Messenger of Allah (ﷺ) forbade earnings of a slave-girl unless it is known from where it came.",
      "chain": [
        "30226",
        "20172",
        "18048",
        "1986"
      ]
    },
    {
      "hadith_no": "3484",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معروف بن سويد الجذامي، أن على بن رباح اللخمي، حدثه أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل ثمن الكلب ولا حلوان الكاهن ولا مهر البغي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The price paid for a dog, the price given to a soothsayer, and the hire paid to a prostitute are not lawful.",
      "chain": [
        "30226",
        "20029",
        "26040",
        "13"
      ]
    },
    {
      "hadith_no": "3485",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، حدثنا معاوية بن صالح، عن عبد الوهاب بن بخت، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله حرم الخمر وثمنها وحرم الميتة وثمنها وحرم الخنزير وثمنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: Allah forbade wine and the price paid for it, and forbade dead meat and the price paid for it, and forbade swine and the price paid for it.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "12321",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3495",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا عمرو، عن المنذر بن عبيد المديني، أن القاسم بن محمد، حدثه أن عبد الله بن عمر حدثه أن رسول الله صلى الله عليه وسلم نهى أن يبيع أحد طعاما اشتراه بكيل حتى يستوفيه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) forbade to sell grain which one buys by measurement until one receives it in full.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "3595",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الله بن كعب بن مالك، أن كعب بن مالك، أخبره أنه، تقاضى ابن أبي حدرد دينا كان له عليه في عهد رسول الله صلى الله عليه وسلم في المسجد فارتفعت أصواتهما حتى سمعهما رسول الله صلى الله عليه وسلم وهو في بيته فخرج إليهما رسول الله صلى الله عليه وسلم حتى كشف سجف حجرته ونادى كعب بن مالك فقال ‏\"‏ يا كعب ‏\"‏ ‏.‏ فقال لبيك يا رسول الله ‏.‏ فأشار له بيده أن ضع الشطر من دينك قال كعب قد فعلت يا رسول الله ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ قم فاقضه ‏\"‏ ‏.‏",
      "text_en": " Ka'b bin Malik said that in the time of the Messenger of Allah (ﷺ) he made demand in the mosque for payment of a debt due to him from Ibn Abi Hadrad, and their voices rose till the Messenger of Allah (ﷺ), who was in his house, heard them. The Messenger of Allah (ﷺ) then went out to them and, removing the curtain of his apartment, he called to Ka'b bin Malik, addressing:                      \"Ka'b!\" He said: \"At your service, Messenger of Allah.\" Thereupon he made a gesture with is hand indicating: Remit half the debt due to you. Ka'b said: \"I shall do so, Messenger of Allah.\" The Prophet (ﷺ) then said: \"Get up and discharge\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني قرة بن عبد الرحمن، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أبي سعيد الخدري، أنه قال نهى رسول الله صلى الله عليه وسلم عن الشرب من ثلمة القدح وأن ينفخ في الشراب ‏.‏",
      "text_en": " Abu sa’id al-Khudri said:                      The apostle of Allah (ﷺ) forbade drinking from the broken place (of a cup) and blowing into a drink.",
      "chain": [
        "30226",
        "20029",
        "11013",
        "11004",
        "38"
      ]
    },
    {
      "hadith_no": "3822",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني عطاء بن أبي رباح، أن جابر بن عبد الله، قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أكل ثوما أو بصلا فليعتزلنا - أو ليعتزل مسجدنا - وليقعد في بيته ‏\"‏ ‏.‏ وإنه أتي ببدر فيه خضرات من البقول فوجد لها ريحا فسأل فأخبر بما فيها من البقول فقال ‏\"‏ قربوها ‏\"‏ ‏.‏ إلى بعض أصحابه كان معه فلما رآه كره أكلها قال ‏\"‏ كل فإني أناجي من لا تناجي ‏\"‏ ‏.‏ قال أحمد بن صالح ببدر فسره ابن وهب طبق",
      "text_en": " Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as sayings:                      He who eats garlic or onion must keep away from us. Or he said: must keep away from our mosque or must sit in his house. A dish containing green vegetables was brought to him, and noticing that it had an odour he asked (about it). He was told that it contained some vegetables. He then said: Bring it near, to one of his companion who was with him. When he saw it, he abominated eating it, and said: eat for I hold intimate converse with one with whom you do not. Ahmad b. Salih said: Ibn Wahb explained the word badr as meaning dish.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، أن بكر بن سوادة، حدثه أن أبا النجيب مولى عبد الله بن سعد حدثه أن أبا سعيد الخدري حدثه أنه، ذكر عند رسول الله صلى الله عليه وسلم الثوم والبصل قيل يا رسول الله وأشد ذلك كله الثوم أفتحرمه فقال النبي صلى الله عليه وسلم ‏\"‏ كلوه ومن أكله منكم فلا يقرب هذا المسجد حتى يذهب ريحه منه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The garlic and onions were mentioned before the Messenger of Allah (ﷺ). He was told: The most severe of them is garlic. Would you make it unlawful? The Prophet (ﷺ) said: Eat it, and he who eats it should not come near this mosque until its odour goes away.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "10849",
        "38"
      ]
    },
    {
      "hadith_no": "3842",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن صالح، والحسن بن علي، - واللفظ للحسن - قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وقعت الفأرة في السمن فإن كان جامدا فألقوها وما حولها وإن كان مائعا فلا تقربوه ‏\"‏ ‏.‏ قال الحسن قال عبد الرزاق وربما حدث به معمر عن الزهري عن عبيد الله بن عبد الله عن ابن عباس عن ميمونة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When a mouse falls into clarified butter, if it is sold, throw the mouse and what is around it away, but if it is in a liquid state, do not go near it. Al-Hasan said: AbdurRazzaq said: This tradition has been transmitted by Ma'mar, from az-Zuhri, from Ubaydullah ibn Abdullah ibn Abbas, from Maymunah, from the Prophet (ﷺ).",
      "chain": [
        "30226",
        "30",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3843",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا عبد الرحمن بن بوذويه، عن معمر، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن ميمونة، عن النبي صلى الله عليه وسلم بمثل حديث الزهري عن ابن المسيب ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The tradition mentioned above (No. 3833) has also been transmitted by Ibn Abbas from Maymunah, from the Prophet (ﷺ) like the tradition narrated by az-Zuhri, from Ibn al-Musayyab.",
      "chain": [
        "30226",
        "20121",
        "20115",
        "11013",
        "11004",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "3851",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني سعيد بن أبي أيوب، عن أبي عقيل القرشي، عن أبي عبد الرحمن الحبلي، عن أبي أيوب الأنصاري، قال كان رسول الله صلى الله عليه وسلم إذا أكل أو شرب قال ‏\"‏ الحمد لله الذي أطعم وسقى وسوغه وجعل له مخرجا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuAyyub al-Ansari:                     When the Messenger of Allah (ﷺ) ate or drank, he said: \"Praise be to Allah Who has given food and drink and made it easy to swallow, and provided an exit for it.",
      "chain": [
        "30226",
        "20029",
        "20375",
        "10938",
        "33"
      ]
    },
    {
      "hadith_no": "3885",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن صالح، وابن السرح، - قال أحمد حدثنا ابن وهب، وقال ابن السرح، - أخبرنا ابن وهب، حدثنا داود بن عبد الرحمن، عن عمرو بن يحيى، عن يوسف بن محمد، - وقال ابن صالح محمد بن يوسف بن ثابت بن قيس بن شماس - عن أبيه، عن جده، عن رسول الله صلى الله عليه وسلم أنه دخل على ثابت بن قيس - قال أحمد - وهو مريض فقال ‏\"‏ اكشف الباس رب الناس ‏\"‏ ‏.‏ عن ثابت بن قيس ثم أخذ ترابا من بطحان فجعله في قدح ثم نفث عليه بماء وصبه عليه ‏.‏ قال أبو داود قال ابن السرح يوسف بن محمد وهو الصواب ‏.‏",
      "text_en": " Narrated Thabit ibn Qays ibn Shammas:                     The Messenger of Allah (ﷺ) entered upon Thabit ibn Qays. The version of Ahmad (ibn Salih) has: When he was ill He (the Prophet) said: Remove the harm, O Lord of men, from Thabit ibn Qays ibn Shammas. He then took some dust of Bathan, and put it in a bowel, and then mixed it with water and blew in it, and poured it on him.Abu Dawud said: Ibn al-Sarh said: Yusuf bin Muhammad is correct (and not Muhammad bin Yusuf)",
      "chain": [
        "30226",
        "30485",
        "30007",
        "20029",
        "30485",
        "20029",
        "20192",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "3886",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني معاوية، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال كنا نرقي في الجاهلية فقلنا يا رسول الله كيف ترى في ذلك فقال ‏\"‏ اعرضوا على رقاكم لا بأس بالرقى ما لم تكن شركا ‏\"‏ ‏.‏",
      "text_en": " ‘Awf b. Malik said :                      In the pre-Islamic period we used to apply spells and we asked: Messenger of Allah ! how do you look upon it ? He replied : Submit your spells to me. There is no harm in spells so long as they involve no polytheism.",
      "chain": [
        "30226",
        "20029",
        "27",
        "10865",
        "10805"
      ]
    },
    {
      "hadith_no": "3962",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني ابن لهيعة، والليث بن سعد، عن عبيد الله بن أبي جعفر، عن بكير بن الأشج، عن نافع، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق عبدا وله مال فمال العبد له إلا أن يشترطه السيد ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar reported the Messenger of Allah (ﷺ) as saying:                      If anyone emancipates a slave who has property, the property of the slave belongs to him except that the master makes a stipulation.",
      "chain": [
        "30226",
        "20029",
        "20624",
        "20023",
        "11409",
        "11154",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3995",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الملك بن عبد الرحمن الذماري، حدثنا سفيان، حدثني محمد بن المنكدر، عن جابر، قال رأيت النبي صلى الله عليه وسلم يقرأ ‏{‏ يحسب أن ماله أخلده ‏}‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I saw the Prophet (ﷺ) reading the verse; \"does he think that his wealth would make him last for ever?\"",
      "chain": [
        "30226",
        "28369",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4006",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثنا ح، وحدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرنا هشام بن سعد، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل لبني إسرائيل ‏{‏ ادخلوا الباب سجدا وقولوا حطة تغفر لكم خطاياكم ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) said: Allah, the Exalted, said to the children of Israel : \"... but enter the gate with humility, in posture and in words, and you will be forgiven your faults (tughfar lakum)\".",
      "chain": [
        "30226",
        "30584",
        "20029",
        "20519",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4041",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، وعمرو بن الحارث، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، بهذه القصة قال حلة إستبرق ‏.‏ وقال فيه ثم أرسل إليه بجبة ديباج وقال ‏\"‏ تبيعها وتصيب بها حاجتك ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by 'Abd Allah b. 'Umar through a different chain of narrators. This version has:                      He said: A robe of silk brocade. He then sent him a Jubbah of brocade and said: You may sell it and fulfill your need.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "20377",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "4102",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، ح وحدثنا سليمان بن داود المهري، وابن السرح، وأحمد بن سعيد الهمداني، قالوا أخبرنا ابن وهب، قال أخبرني قرة بن عبد الرحمن المعافري، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، - رضى الله عنها - أنها قالت يرحم الله نساء المهاجرات الأول لما أنزل الله ‏{‏ وليضربن بخمرهن على جيوبهن ‏}‏ شققن أكنف - قال ابن صالح أكثف - مروطهن فاختمرن بها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     May Allah have mercy on the early immigrant women. When the verse \"That they should draw their veils over their bosoms\" was revealed, they tore their thick outer garments and made veils from them.",
      "chain": [
        "30226",
        "30584",
        "30485",
        "30296",
        "20029",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4109",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، عن عائشة، بهذا الحديث زاد وأخرجه فكان بالبيداء يدخل كل جمعة يستطعم ‏.‏",
      "text_en": " The tradition mentioned about has also been transmitted by 'Aishah through a different chain of narrators. This version has:                      He (the Prophet) exiled him and he lived in a desert (outside Medina). He would come every Friday asking for food.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4126",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن كثير بن فرقد، عن عبد الله بن مالك بن حذافة، حدثه عن أمه العالية بنت سبيع، أنها قالت كان لي غنم بأحد فوقع فيها الموت فدخلت على ميمونة زوج النبي صلى الله عليه وسلم فذكرت ذلك لها فقالت لي ميمونة لو أخذت جلودها فانتفعت بها ‏.‏ فقالت أويحل ذلك قالت نعم ‏.‏ مر على رسول الله صلى الله عليه وسلم رجال من قريش يجرون شاة لهم مثل الحمار فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ لو أخذتم إهابها ‏\"‏ ‏.‏ قالوا إنها ميتة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يطهرها الماء والقرظ ‏\"‏ ‏.‏",
      "text_en": " Al-Aliyah, daughter of Subay', said:                      I had some sheep at Uhud, and they began to die. I then entered upon Maymunah, wife of the Prophet (ﷺ), and mentioned it to her. Maymunah said to me: If you took their skins and made use of them, (that would be better for you). She asked: Is that lawful? She replied, Yes. Some people of the Quraysh passed by the Messenger of Allah (ﷺ) dragging a sheep of theirs as big as an ass. The Messenger of Allah (ﷺ) said to them: Would that you took its skin. They said: It died a natural death. The Messenger of Allah (ﷺ) said: Water and leaves of the mimosa flava purify it.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "20170",
        "13530",
        "19499"
      ]
    },
    {
      "hadith_no": "4157",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن ابن السباق، عن ابن عباس، قال حدثتني ميمونة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ إن جبريل عليه السلام كان وعدني أن يلقاني الليلة فلم يلقني ‏\"‏ ‏.‏ ثم وقع في نفسه جرو كلب تحت بساط لنا فأمر به فأخرج ثم أخذ بيده ماء فنضح به مكانه فلما لقيه جبريل عليه السلام قال إنا لا ندخل بيتا فيه كلب ولا صورة فأصبح النبي صلى الله عليه وسلم فأمر بقتل الكلاب حتى إنه ليأمر بقتل كلب الحائط الصغير ويترك كلب الحائط الكبير ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     Maimunah, wife of the Prophet (ﷺ) reported him as saying: Gabriel (peace be upon him) promised to visit me last night, but he did not visit me. Then it occurred to him that there was a pup under his bed. So he ordered and it was turned out. He then got water in his hand and sprinkled it on its place. When Gabriel (ﷺ) met him, he said: We do not enter a house which contains a dog or a picture. When the morning came, the Prophet (ﷺ) ordered to kill dogs. He ordered to kill the dog which guarded a small orchard, and left the dog which guarded the big orchard.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11203",
        "17"
      ]
    },
    {
      "hadith_no": "4216",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن صالح، قالا حدثنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال حدثني أنس، قال كان خاتم النبي صلى الله عليه وسلم من ورق فصه حبشي ‏.‏",
      "text_en": " Narrated Anas:                     The signet-ring of the Prophet (ﷺ) was of silver with an Abyssinian stone.",
      "chain": [
        "30367",
        "30226",
        "20029",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني سليمان بن بلال، عن شريك بن أبي نمر، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، - رضى الله تعالى عنه - عن النبي صلى الله عليه وسلم ‏.‏ قال شريك وأخبرني أبو سلمة بن عبد الرحمن أن النبي صلى الله عليه وسلم كان يتختم في يمينه ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) used to wear the signet-ring on his right hand.",
      "chain": [
        "30226",
        "20029",
        "20160",
        "11858",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "4251",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن صالح، عن عنبسة، عن يونس، عن الزهري، قال وسلاح قريب من خيبر ‏.‏",
      "text_en": " Al-Zuhri said:                      Salah is near Khaibar.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "4255",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثني يونس، عن ابن شهاب، قال حدثني حميد بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يتقارب الزمان وينقص العلم وتظهر الفتن ويلقى الشح ويكثر الهرج ‏\"‏ ‏.‏ قيل يا رسول الله أية هو قال ‏\"‏ القتل القتل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah :                     The Messenger of Allah (ﷺ) as saying: The time will become short, knowledge will be decreased, civil strife (fitan) will appear, niggardliness will be case into people's heart, and harj will be prevalent. He was asked: Messenger of Allah! what is it: He replied: Slaughter, slaughter.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "4300",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن صالح، عن عنبسة، عن يونس، عن الزهري، قال وسلاح قريب من خيبر ‏.‏",
      "text_en": " Al-Zuhri said:                      Salah is near Khaibar.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "4369",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن سعيد بن أبي هلال، عن أبي الزناد، عن عبد الله بن عبيد الله، - قال أحمد هو يعني عبد الله بن عبيد الله بن عمر بن الخطاب - عن ابن عمر أن ناسا أغاروا على إبل النبي صلى الله عليه وسلم فاستاقوها وارتدوا عن الإسلام وقتلوا راعي رسول الله صلى الله عليه وسلم مؤمنا فبعث في آثارهم فأخذوا فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏ قال ونزلت فيهم آية المحاربة وهم الذين أخبر عنهم أنس بن مالك الحجاج حين سأله ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Some people raided the camels of the Prophet (ﷺ), drove them off, and apostatised. They killed the herdsman of the Messenger of Allah (ﷺ) who was a believer. He (the Prophet) sent (people) in pursuit of them and they were caught. He had their hands and feet cut off, and their eyes put out. The verse regarding fighting against Allah and His Prophet (ﷺ) was then revealed. These were the people about whom Anas ibn Malik informed al-Hajjaj when he asked him.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "11061",
        "18"
      ]
    },
    {
      "hadith_no": "4384",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، ووهب بن بيان، قالا حدثنا ح، وحدثنا ابن السرح، قال أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، وعمرة، عن عائشة، رضى الله عنها عن النبي صلى الله عليه وسلم قال ‏\"‏ تقطع يد السارق في ربع دينار فصاعدا ‏\"‏ ‏.‏ قال أحمد بن صالح القطع في ربع دينار فصاعدا ‏.‏",
      "text_en": " ‘A’ishah reported the prophet (ﷺ) as saying :                      A thief’s hand should be cut off for a quarter of a dinar and upwards.Ahmed b. Salih said: The amputation (of a thief’s hand) is for a quarter of a dinar and upwards.",
      "chain": [
        "30226",
        "36063",
        "30485",
        "20029",
        "20475",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "4408",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني حيوة بن شريح، عن عياش بن عباس القتباني، عن شييم بن بيتان، ويزيد بن صبح الأصبحي، عن جنادة بن أبي أمية، قال كنا مع بسر بن أرطاة في البحر فأتي بسارق يقال له مصدر قد سرق بختية فقال قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏ ولولا ذلك لقطعته ‏.‏",
      "text_en": " Narrated Busr ibn Artat:                     Junadah ibn AbuUmayyah said: We were with Busr ibn Artat on the sea (on an expedition). A thief called Misdar who had stolen a bukhti she-camel was brought. He said: I heard the Messenger of Allah (ﷺ) say: Hands are not to be cut off during a warlike expedition. Had it not been so, I would have cut it off.",
      "chain": [
        "30226",
        "20029",
        "26010",
        "10871",
        "16050",
        "16115",
        "3205"
      ]
    },
    {
      "hadith_no": "4450",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال حدثنا رجل، من مزينة ح وحدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، قال قال محمد بن مسلم سمعت رجلا، من مزينة ممن يتبع العلم ويعيه - ثم اتفقا - ونحن عند سعيد بن المسيب فحدثنا عن أبي هريرة - وهذا حديث معمر وهو أتم - قال زنى رجل من اليهود وامرأة فقال بعضهم لبعض اذهبوا بنا إلى هذا النبي فإنه نبي بعث بالتخفيف فإن أفتانا بفتيا دون الرجم قبلناها واحتججنا بها عند الله قلنا فتيا نبي من أنبيائك - قال - فأتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه فقالوا يا أبا القاسم ما ترى في رجل وامرأة زنيا فلم يكلمهم كلمة حتى أتى بيت مدراسهم فقام على الباب فقال ‏\"‏ أنشدكم بالله الذي أنزل التوراة على موسى ما تجدون في التوراة على من زنى إذا أحصن ‏\"‏ ‏.‏ قالوا يحمم ويجبه ويجلد - والتجبية أن يحمل الزانيان على حمار وتقابل أقفيتهما ويطاف بهما - قال وسكت شاب منهم فلما رآه النبي صلى الله عليه وسلم سكت ألظ به النشدة فقال اللهم إذ نشدتنا فإنا نجد في التوراة الرجم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فما أول ما ارتخصتم أمر الله ‏\"‏ ‏.‏ قال زنى ذو قرابة مع ملك من ملوكنا فأخر عنه الرجم ثم زنى رجل في أسرة من الناس فأراد رجمه فحال قومه دونه وقالوا لا يرجم صاحبنا حتى تجيء بصاحبك فترجمه فاصطلحوا على هذه العقوبة بينهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فإني أحكم بما في التوراة ‏\"‏ ‏.‏ فأمر بهما فرجما ‏.‏ قال الزهري فبلغنا أن هذه الآية نزلت فيهم ‏{‏ إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا ‏}‏ كان النبي صلى الله عليه وسلم منهم ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     (This is Ma'mar's version which is more accurate.) A man and a woman of the Jews committed fornication.  Some of them said to the others: Let us go to this Prophet, for he has been sent with an easy law. If he gives a judgment lighter than stoning, we shall accept it, and argue about it with Allah, saying: It is a judgment of one of your prophets. So they came to the Prophet (ﷺ) who was sitting in the mosque among his companions.  They said: AbulQasim, what do you think about a man and a woman who committed fornication? He did not speak to them a word till he went to their school.  He stood at the gate and said: I adjure you by Allah Who revealed the Torah to Moses, what (punishment) do you find in the Torah for a person who commits fornication, if he is married?  They said: He shall be blackened with charcoal, taken round a donkey among the people, and flogged. A young man among them kept silent.  When the Prophet (ﷺ) emphatically adjured him, he said: By Allah, since you have adjured us (we inform you that) we find stoning in the Torah (is the punishment for fornication).  The Prophet (ﷺ) said: So when did you lessen the severity of Allah's command? He said:  A relative of one of our kings had committed fornication, but his stoning was suspended. Then a man of a family of common people committed fornication. He was to have been stoned, but his people intervened and said: Our man shall not be stoned until you bring your man and stone him. So they made a compromise on this punishment between them.  The Prophet (ﷺ) said: So I decide in accordance with what the Torah says. He then commanded regarding them and they were stoned to death.  Az-Zuhri said: We have been informed that this verse was revealed about them: \"It was We Who revealed the Law (to Moses): therein was guidance and light. By its standard have been judged the Jews, by the Prophet who bowed (as in Islam) to Allah's will.",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11013",
        "30226",
        "11716",
        "20475",
        "167",
        "13"
      ]
    },
    {
      "hadith_no": "4460",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا معمر، عن قتادة، عن الحسن، عن قبيصة بن حريث، عن سلمة بن المحبق، أن رسول الله صلى الله عليه وسلم قضى في رجل وقع على جارية امرأته إن كان استكرهها فهي حرة وعليه لسيدتها مثلها فإن كانت طاوعته فهي له وعليه لسيدتها مثلها ‏.‏ قال أبو داود رواه يونس بن عبيد وعمرو بن دينار ومنصور بن زاذان وسلام عن الحسن هذا الحديث بمعناه لم يذكر يونس ومنصور قبيصة ‏.‏",
      "text_en": " Narrated Salamah ibn al-Muhabbaq:                     The Messenger of Allah (ﷺ) made a decision about a man who had intercourse with his wife's slave-girl as follows. If he forced her, she is free, and he shall give her mistress a slave-girl similar to her; if she asked him to have intercourse voluntarily, she will belong to him, and he shall give her mistress a slave-girl similar to her.Abu Dawud said: This tradition has been transmitted by Yunus b. 'Ubaid, 'Amr b. Dinar, Mansur b. Zadhan and Salam from al-Hasan to the same effect. But yunus and Mansur did not mention Qabisah.",
      "chain": [
        "30226",
        "20121",
        "20115",
        "11019",
        "11016",
        "14319",
        "5071"
      ]
    },
    {
      "hadith_no": "4492",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، أن بكير بن الأشج، حدثه عن سليمان بن يسار، قال حدثني عبد الرحمن بن جابر، أن أباه، حدثه أنه، سمع أبا بردة الأنصاري، يقول سمعت رسول الله صلى الله عليه وسلم يقول فذكر معناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Burdah al-Ansari through a different chain of narrators. This version has:                      I heard the Messenger of Allah (ﷺ) say. . . He then mentioned the tradition to the same effect.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11154",
        "11005",
        "11192",
        "34"
      ]
    },
    {
      "hadith_no": "4528",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، عن معمر، عن أيوب، عن أبي قلابة، عن أنس، أن يهوديا، قتل جارية من الأنصار على حلي لها ثم ألقاها في قليب ورضخ رأسها بالحجارة فأخذ فأتي به النبي صلى الله عليه وسلم فأمر به أن يرجم حتى يموت فرجم حتى مات ‏.‏ قال أبو داود رواه ابن جريج عن أيوب نحوه ‏.‏",
      "text_en": " Narrated Anas:                     A Jew killed a girl of the Ansar for her ornaments. He then threw her in a well, and crushed her head with stones. He was then arrested and brought to the Prophet (ﷺ). He ordered regarding him that he should be stoned to death. He was then stoned till he died.Abu Dawud said: It has been transmitted by Ibn Juraij from Ayyub in a similar way.",
      "chain": [
        "30226",
        "20121",
        "20115",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4536",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، عن عمرو، - يعني ابن الحارث - عن بكير بن الأشج، عن عبيدة بن مسافع، عن أبي سعيد الخدري، قال بينما رسول الله صلى الله عليه وسلم يقسم قسما أقبل رجل فأكب عليه فطعنه رسول الله صلى الله عليه وسلم بعرجون كان معه فجرح بوجهه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ تعال فاستقد ‏\"‏ ‏.‏ فقال بل عفوت يا رسول الله ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the Messenger of Allah (ﷺ) was distributing something, a man came towards him and bent down on him. The Messenger of Allah (ﷺ) struck him with a bough and his face was wounded. The Messenger of Allah (ﷺ) said to him: Come and take retaliation. He said: no, I have forgiven, Messenger of Allah!.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11154",
        "38"
      ]
    },
    {
      "hadith_no": "4628",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال سالم بن عبد الله إن ابن عمر قال كنا نقول ورسول الله صلى الله عليه وسلم حى أفضل أمة النبي صلى الله عليه وسلم بعده أبو بكر ثم عمر ثم عثمان رضى الله عنهم أجمعين ‏.‏",
      "text_en": " Ibn ‘Umar said:                      When the Messenger of Allah (ﷺ) was alive, we used to say: The most excellent member of the community of the Prophet (ﷺ) after himself is Abu Bakr, then ‘Umar, then 'Uthman.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، قال حدثني موسى بن يعقوب، عن عبد الرحمن بن إسحاق، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن زمعة، أخبره بهذا الخبر، قال لما سمع النبي صلى الله عليه وسلم صوت عمر قال ابن زمعة خرج النبي صلى الله عليه وسلم حتى أطلع رأسه من حجرته ثم قال ‏\"‏ لا لا لا ليصل للناس ابن أبي قحافة ‏\"‏ ‏.‏ يقول ذلك مغضبا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Abd Allah b. Zam’ah through a different chain. He said:                      When the Prophet (May peace be upon him) heard ‘Umar’s voice, Ibn Zam’ah said: The Prophet (May peace be upon him) came out until he took out his head of his apartment. He then said : No, no, no; the son of Abu Quhafah should lead the people in prayer. He said it angrily.",
      "chain": [
        "30226",
        "20172",
        "20706",
        "11876",
        "11013",
        "11004",
        "192"
      ]
    },
    {
      "hadith_no": "4675",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أن أبا سلمة بن عبد الرحمن، أخبره أن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أنا أولى الناس بابن مريم الأنبياء أولاد علات وليس بيني وبينه نبي ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said :                      I heard the Messenger of Allah (May peace be upon him) say : I am the nearest of kin among the people to (Jesus) son of Mary. The Prophet are brothers, sons of one father by co-wives. There is no Prophet between me and him.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4701",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، ح وحدثنا أحمد بن صالح، - المعنى - قال حدثنا سفيان بن عيينة، عن عمرو بن دينار، سمع طاوسا، يقول سمعت أبا هريرة، يخبر عن النبي صلى الله عليه وسلم قال ‏\"‏ احتج آدم وموسى فقال موسى يا آدم أنت أبونا خيبتنا وأخرجتنا من الجنة ‏.‏ فقال آدم أنت موسى اصطفاك الله بكلامه وخط لك التوراة بيده تلومني على أمر قدره على قبل أن يخلقني بأربعين سنة فحج آدم موسى ‏\"‏ ‏.‏ قال أحمد بن صالح عن عمرو عن طاوس سمع أبا هريرة ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      Adam and Moses held a disputation. Moses said : Adam you are our father. You deprived us and caused us to come out from Paradise. Adam said : You are Moses Allah chose you for his speech and wrote the Torah for you with his hand. Do you blame me for doing a deed which Allah had decreed that I should do forty year before he created me? So Adam got the better of Moses in argument.Ahmad b. Salih said from 'Amr from Tawus who heard Abu Hurairah.",
      "chain": [
        "30175",
        "20012",
        "30226",
        "20005",
        "11081",
        "11053"
      ]
    },
    {
      "hadith_no": "4702",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثنا ابن وهب، قال أخبرني هشام بن سعد، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى قال يا رب أرنا آدم الذي أخرجنا ونفسه من الجنة فأراه الله آدم فقال أنت أبونا آدم فقال له آدم نعم ‏.‏ قال أنت الذي نفخ الله فيك من روحه وعلمك الأسماء كلها وأمر الملائكة فسجدوا لك قال نعم ‏.‏ قال فما حملك على أن أخرجتنا ونفسك من الجنة فقال له آدم ومن أنت قال أنا موسى ‏.‏ قال أنت نبي بني إسرائيل الذي كلمك الله من وراء الحجاب لم يجعل بينك وبينه رسولا من خلقه قال نعم ‏.‏ قال أفما وجدت أن ذلك كان في كتاب الله قبل أن أخلق قال نعم ‏.‏ قال ففيم تلومني في شىء سبق من الله تعالى فيه القضاء قبلي ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ فحج آدم موسى فحج آدم موسى ‏\"‏ ‏.‏",
      "text_en": " ‘Umar b. al-Khattab reported the Messenger of Allah (May peace be upon him) as saying :                      Moses said : My lord, show us Adam who caused us and himself to come out from Paradise. So Allah showed him Adam. He asked : Are you our father, Adam? Adam said to him : Yes. He said : Are you the one into whom Allah breathed of his spirit, taught you all the names, and commanded angels (to prostrate) and they prostrated to you? He replied : Yes. He asked : Then what moved you to cause us and yourself to come out from paradise? Adam asked him : And who are you? He said : Yes. He asked : Did you not find that was decreed in the book (records) of Allah before I was created? He replied : Yes. He asked : Then why do you blame me about a thing for which Divine decree had already passed before me ? The Messenger of Allah (May peace be upon him) said : So Adam got the better of Moses in argument (peace be upon him).",
      "chain": [
        "30226",
        "20029",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4857",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني عمرو، أن سعيد بن أبي هلال، حدثه أن سعيد بن أبي سعيد المقبري حدثه عن عبد الله بن عمرو بن العاص، أنه قال كلمات لا يتكلم بهن أحد في مجلسه عند قيامه ثلاث مرات إلا كفر بهن عنه ولا يقولهن في مجلس خير ومجلس ذكر إلا ختم له بهن عليه كما يختم بالخاتم على الصحيفة سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     There are some expressions which a man utters three times when he gets up from an assembly he will be forgiven for what happened in the assembly; and no one utters them in an assembly held for a noble cause or for remembrance of Allah but that is stamped with them just as a document is stamped with a signet-ring. These expressions are: Glory be to Thee, O Allah, and I begin with praise of Thee, there is no god but thou; I ask Thy pardon, and return to Thee in repentance.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "11168",
        "29"
      ]
    },
    {
      "hadith_no": "4858",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال قال عمرو وحدثني بنحو، ذلك عبد الرحمن بن أبي عمرو عن المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A SIMILAR TRADITION HAS ALSO BEEN TRANSMITTED BY ABU HURAIRAH FROM THE PROPHET(MAY PEACE BE UPON HIM) THROUGH A DIFFERENT CHAIN OF NARRATORS.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4869",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، قال قرأت على عبد الله بن نافع قال أخبرني ابن أبي ذئب، عن ابن أخي، جابر بن عبد الله عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المجالس بالأمانة إلا ثلاثة مجالس سفك دم حرام أو فرج حرام أو اقتطاع مال بغير حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: Meetings are confidential except three: those for the purpose of shedding blood unlawfully, or committing fornication, or acquiring property unjustly.",
      "chain": [
        "30226",
        "20177",
        "34"
      ]
    },
    {
      "hadith_no": "4904",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، قال أخبرني سعيد بن عبد الرحمن بن أبي العمياء، أن سهل بن أبي أمامة، حدثه أنه، دخل هو وأبوه على أنس بن مالك بالمدينة في زمان عمر بن عبد العزيز وهو أمير المدينة فإذا هو يصلي صلاة خفيفة دقيقة كأنها صلاة مسافر أو قريبا منها فلما سلم قال أبي يرحمك الله أرأيت هذه الصلاة المكتوبة أو شىء تنفلته قال إنها المكتوبة وإنها لصلاة رسول الله صلى الله عليه وسلم ما أخطأت إلا شيئا سهوت عنه - فقال - إن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ لا تشددوا على أنفسكم فيشدد عليكم فإن قوما شددوا على أنفسهم فشدد الله عليهم فتلك بقاياهم في الصوامع والديار ‏{‏ رهبانية ابتدعوها ما كتبناها عليهم ‏}‏ ‏\"‏ ‏.‏ ثم غدا من الغد فقال ألا تركب لتنظر ولتعتبر قال نعم فركبوا جميعا فإذا هم بديار باد أهلها وانقضوا وفنوا خاوية على عروشها فقال ‏\"‏ أتعرف هذه الديار ‏\"‏ ‏.‏ فقلت ما أعرفني بها وبأهلها هذه ديار قوم أهلكهم البغى والحسد إن الحسد يطفئ نور الحسنات والبغى يصدق ذلك أو يكذبه والعين تزني والكف والقدم والجسد واللسان والفرج يصدق ذلك أو يكذبه ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     Sahl ibn AbuUmamah said that he and his father (AbuUmamah) visited Anas ibn Malik at Medina during the time (rule) of Umar ibn AbdulAziz when he (Anas ibn Malik) was the governor of Medina. He was praying a very short prayer as if it were the prayer of a traveller or near it.  When he gave a greeting, my father said: May Allah have mercy on you! Tell me about this prayer: Is it obligatory or supererogatory?  He said: It is obligatory; it is the prayer performed by the Messenger of Allah (ﷺ). I did not make a mistake except in one thing that I forgot.  He said: The Messenger of Allah (ﷺ) used to say: Do not impose austerities on yourselves so that austerities will be imposed on you, for people have imposed austerities on themselves and Allah imposed austerities on them. Their survivors are to be found in cells and monasteries. (Then he quoted:) \"Monasticism, they invented it; we did not prescribe it for them.\"  Next day he went out in the morning and said: will you not go out for a ride, so that you may see something and take a lesson from it?  He said: Yes. Then all of them rode away and reached a land whose inhabitants had perished, passed away and died. The roofs of the town had fallen in.  He asked: Do you know this land?  I said: Who acquainted me with it and its inhabitants?  (Anas said:) This is the land of the people whom oppression and envy destroyed. Envy extinguishes the light of good deeds, and oppression confirms or falsifies it. The eye commits fornication, and the palm of the hand, the foot, body, tongue and private part of the body confirm it or deny it.",
      "chain": [
        "30226",
        "20029",
        "26015"
      ]
    },
    {
      "hadith_no": "4905",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا يحيى بن حسان، حدثنا الوليد بن رباح، قال سمعت نمران، يذكر عن أم الدرداء، قالت سمعت أبا الدرداء، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن العبد إذا لعن شيئا صعدت اللعنة إلى السماء فتغلق أبواب السماء دونها ثم تهبط إلى الأرض فتغلق أبوابها دونها ثم تأخذ يمينا وشمالا فإذا لم تجد مساغا رجعت إلى الذي لعن فإن كان لذلك أهلا وإلا رجعت إلى قائلها ‏\"‏ ‏.‏ قال أبو داود قال مروان بن محمد هو رباح بن الوليد سمع منه وذكر أن يحيى بن حسان وهم فيه ‏.‏",
      "text_en": " Abu al-Darda’ reported the Messenger of Allah (May peace be upon him) as saying :                      when a man cures anything, the curse goes up to heaven and the gates of heaven are locked against it. Then it comes down to the earth and its gates are locked against it. Then it goes right and left, and if it finds no place of entrance it returns to the thing which was cursed, and if it finds no place of entrance it returns to the thing which was cursed, and if it deserves what was said (it enters it), otherwise it returns to the one who uttered it.Abu Dawud said : Marwan b. Muhammad said: He is Rabah b. al-Walid who heard from him (nimran). He (Marwan b. Muhammad) said: Yahya b. Hussain  was confused in it.",
      "chain": [
        "30226",
        "20300",
        "11457"
      ]
    },
    {
      "hadith_no": "4956",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، عن معمر، عن الزهري، عن سعيد بن المسيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال له ‏\"‏ ما اسمك ‏\"‏ ‏.‏ قال حزن ‏.‏ قال ‏\"‏ أنت سهل ‏\"‏ ‏.‏ قال لا السهل يوطأ ويمتهن ‏.‏ قال سعيد فظننت أنه سيصيبنا بعده حزونة ‏.‏ قال أبو داود وغير النبي صلى الله عليه وسلم اسم العاص وعزيز وعتلة وشيطان والحكم وغراب وحباب وشهاب فسماه هشاما وسمى حربا سلما وسمى المضطجع المنبعث وأرضا تسمى عفرة سماها خضرة وشعب الضلالة سماه شعب الهدى وبنو الزنية سماهم بني الرشدة وسمى بني مغوية بني رشدة ‏.‏ قال أبو داود تركت أسانيدها للاختصار ‏.‏",
      "text_en": " Sa'id b. Musayyab told that his father said on the authority of his grandfather (Hazn):                      The Prophet (ﷺ) asked: What is your name?  He replied: Hazn (rugged).  He said: You are Sahl (smooth).  He said: No, smooth is trodden upon and disgraced.  Sa'id said: I then thought that ruggedness would remain among us after it.  AbuDawud said: The Prophet (ﷺ) changed the names al-'As, Aziz, Atalah, Shaytan, al-Hakam, Ghurab, Hubab, and Shihab and called him Hisham. He changed the name Harb (war) and called him Silm (peace). He changed the name al-Munba'ith (one who lies) and called him al-Mudtaji' (one who stands up). He changed the name of a land Afrah (barren) and called it Khadrah (green). He changed the name Shi'b ad-Dalalah (the mountain path of a stray), the name of a mountain path and called it Shi'b al-Huda (mountain path of guidance). He changed the name Banu az-Zinyah (children of fornication) and called them Banu ar-Rushdah (children of those who are on the right path), and changed the name Banu Mughwiyah (children of a woman who allures and goes astray), and called them Banu Rushdah (children of a woman who is on the right path). AbuDawud said: I omitted the chains of these for the sake of brevity.",
      "chain": [
        "30226",
        "20121",
        "20115",
        "11013",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "4978",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي أمامة بن سهل بن حنيف، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم خبثت نفسي وليقل لقست نفسي ‏\"‏ ‏.‏",
      "text_en": " Abu Umamah b. Sahl b. Hunaif quoted his father as saying :                      None of you must say Khabuthat nafsi (My heart is heaving), but one should say Laqisat nafsi (My heart is being annoyed).",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "405",
        "403"
      ]
    },
    {
      "hadith_no": "5014",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، بمعناه زاد فخشي أن يرميه، برسول الله صلى الله عليه وسلم فأجازه ‏.‏",
      "text_en": " The tradition mention above has also been transmitted by Sa’id b. al-Musayyab through a different chain of narrators to the same effect. This version adds:                      so he (‘Umar’) feared that he would refer to the Messenger of Allah (May peace be upon him); therefore he allowed him.",
      "chain": [
        "30226",
        "20121",
        "20115",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "5023",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رآني في المنام فسيراني في اليقظة ‏\"‏ ‏.‏ أو ‏\"‏ لكأنما رآني في اليقظة ولا يتمثل الشيطان بي ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said :                      I heard the Messenger of Allah (May peace be upon him) say : He who sees me in a dream will see me when awake or as if he will see me when awake, for the devil does not take my likeness.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5066",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، قال حدثني عياش بن عقبة الحضرمي، عن الفضل بن حسن الضمري، أن ابن أم الحكم، أو ضباعة ابنتى الزبير حدثه عن إحداهما، أنها قالت أصاب رسول الله صلى الله عليه وسلم سبيا فذهبت أنا وأختي وفاطمة بنت النبي صلى الله عليه وسلم إلى النبي صلى الله عليه وسلم فشكونا إليه ما نحن فيه وسألناه أن يأمر لنا بشىء من السبى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سبقكن يتامى بدر ‏\"‏ ‏.‏ ثم ذكر قصة التسبيح قال على أثر كل صلاة لم يذكر النوم ‏.‏",
      "text_en": " Umm al-Hakam or Duba’ah, daughter of al-Zubair, said :                      The Messenger of Allah (May peace be upon him) got some prisoners of war (slaves). I my sister and Fatimah, daughter of the prophet (May peace be upon him), went to the prophet (May peace be upon him). We complained to him about our condition, and asked him to command for giving us some prisoners (slaves). The Messenger of Allah (May peace be upon him) said; The orphans of Badr came before you (and took the slaves). The transmitter then mentioned the story of glorifying Allah after every prayer. He did not mention sleeping.",
      "chain": [
        "30226",
        "20029",
        "26033"
      ]
    },
    {
      "hadith_no": "5069",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا محمد بن أبي فديك، قال أخبرني عبد الرحمن بن عبد المجيد، عن هشام بن الغاز بن ربيعة، عن مكحول الدمشقي، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح أو يمسي اللهم إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وأن محمدا عبدك ورسولك أعتق الله ربعه من النار فمن قالها مرتين أعتق الله نصفه ومن قالها ثلاثا أعتق الله ثلاثة أرباعه فإن قالها أربعا أعتقه الله من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: If anyone says in the morning or in the evening: \"O Allah! in the morning we call Thee, the bearers of Thy Throne, Thy angels and all Thy creatures to witness that thou art Allah (God) than Whom alone there is no god, and that Muhammad is Thy Servant and Apostle,\" Allah will emancipate his fourth from Hell; if anyone  says twice, Allah will emancipate his half; if anyone says it thrice, Allah will emancipate three-fourth; and if he says four times, Allah will emancipate him from Hell.",
      "chain": [
        "30226",
        "20729",
        "19"
      ]
    },
    {
      "hadith_no": "5073",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا يحيى بن حسان، وإسماعيل، قالا حدثنا سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن عبد الله بن عنبسة، عن عبد الله بن غنام البياضي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح اللهم ما أصبح بي من نعمة فمنك وحدك لا شريك لك فلك الحمد ولك الشكر ‏.‏ فقد أدى شكر يومه ومن قال مثل ذلك حين يمسي فقد أدى شكر ليلته ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Ghannam:                     The Prophet (ﷺ) said: If anyone says in the morning: \"O Allah! whatever favour has come to me, it comes from Thee alone Who has no partner; to Thee praise is due and thanksgiving,'! he will have expressed full thanksgiving for the day; and if anyone says the same in the evening, he will have expressed full thanksgiving for the night.",
      "chain": [
        "30226",
        "20300",
        "20208",
        "20160",
        "11162",
        "18560"
      ]
    },
    {
      "hadith_no": "5075",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، قال أخبرني عمرو، أن سالما الفراء، حدثه أن عبد الحميد مولى بني هاشم حدثه أن أمه حدثته وكانت، تخدم بعض بنات النبي صلى الله عليه وسلم أن بنت النبي، صلى الله عليه وسلم حدثتها أن النبي صلى الله عليه وسلم كان يعلمها فيقول ‏\"‏ قولي حين تصبحين سبحان الله وبحمده لا قوة إلا بالله ما شاء الله كان وما لم يشأ لم يكن أعلم أن الله على كل شىء قدير وأن الله قد أحاط بكل شىء علما فإنه من قالهن حين يصبح حفظ حتى يمسي ومن قالهن حين يمسي حفظ حتى يصبح ‏\"‏ ‏.‏",
      "text_en": " Narrated Daughter of the Prophet:                     AbdulHamid, a client of Banu Hashim, said that his mother who served some of the daughters of the Prophet (ﷺ) told him that one of the daughters of the Prophet (ﷺ) said that the Prophet (ﷺ) used to teach her saying: Say in the morning: Glory be to Allah, and I begin with praise of Him; there is no power but in Allah ; what Allah wills comes to pass and what He does not will does not come to pass; I know that Allah is Omnipotent and that Allah has comprehended everything in knowledge\" ; for whoever says it in the morning will be guarded till the evening, and whoever says it in the evening will be guarded till the morning.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "18602"
      ]
    },
    {
      "hadith_no": "5086",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، قال أخبرني سليمان بن بلال، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا كان في سفر فأسحر يقول ‏\"‏ سمع سامع بحمد الله ونعمته وحسن بلائه علينا اللهم صاحبنا فأفضل علينا ‏\"‏ ‏.‏ عائذا بالله من النار ‏.‏",
      "text_en": " Abu Hurairah said; When the Messenger of Allah (May peace be upon him) was on a journey, he would say at daybreak:                      Let a hearer hear beginning with praise of Allah and His good favours and blessing to us. Our Lord, accompany us and show favour to us, and I seek refuge in Allah from Hell.",
      "chain": [
        "30226",
        "20029",
        "20160",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5098",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت ما رأيت رسول الله صلى الله عليه وسلم قط مستجمعا ضاحكا حتى أرى منه لهواته إنما كان يتبسم وكان إذا رأى غيما أو ريحا عرف ذلك في وجهه فقلت يا رسول الله الناس إذا رأوا الغيم فرحوا رجاء أن يكون فيه المطر وأراك إذا رأيته عرفت في وجهك الكراهية فقال ‏\"‏ يا عائشة ما يؤمنني أن يكون فيه عذاب قد عذب قوم بالريح وقد رأى قوم العذاب فقالوا هذا عارض ممطرنا ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah, wife of the prophet (May peace be upon him), said :                      I never saw the Messenger of Allah (May peace be upon him) laugh fully to such an extent that I could see his uvula. He would only smile, and when he saw clouds or wind, his face showed signs (of fear). I asked him: Messenger of Allah! When the people see the cloud, they rejoice, hoping for that it may contain rain, and I notice that when you see it, (the signs of) abomination on your face. He replied: ‘A’ishah! What gives me safety from the fact that it might contain punishment? A people were punished by the wind. When those people saw the punishment, they said: this is a cloud which would give us rain.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "20390",
        "11005"
      ]
    },
    {
      "hadith_no": "5132",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن وهب بن منبه، عن أخيه، عن معاوية، اشفعوا تؤجروا فإني لأريد الأمر فأؤخره كيما تشفعوا فتؤجروا فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ اشفعوا تؤجروا ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     Make intercession, you will be rewarded, for I purposely delay a matter so that you intercede and then you are rewarded. The Messenger of Allah (ﷺ) said: If you make intercession, you will be rewarded.",
      "chain": [
        "30226",
        "30485",
        "20005",
        "11081",
        "11102",
        "11447"
      ]
    },
    {
      "hadith_no": "5266",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم ‏\"‏ إن نملة قرصت نبيا من الأنبياء فأمر بقرية النمل فأحرقت فأوحى الله إليه في أن قرصتك نملة أهلكت أمة من الأمم تسبح ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported Messenger of Allah (May peace be upon him) as saying :                      An ant stung a prophet. He ordered a colony of ants to be burned. Allah revealed to him : because an ant stung you, you have perished a community which glorifies Me.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    }
  ],
  "total_hadiths": 178
}