{
  "id": "30221",
  "name": "Yahya bin Musa Khat يحيى بن موسى خت",
  "full_name": "Yahya bin Musa Khat يحيى بن موسى خت",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Bulkh",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Hadani",
      "al-Bulki",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20254",
      "name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20617",
      "name": "Yahya bin Yaman al-Jly يحيى بن يمان العجلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "872",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن منصور، حدثنا فليح، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يصلي الصبح بغلس فينصرفن نساء المؤمنين، لا يعرفن من الغلس، أو لا يعرف بعضهن بعضا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
      "chain": [
        "30221",
        "30116",
        "20169",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1256",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، عن سفيان، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت لما غسلنا بنت النبي صلى الله عليه وسلم قال لنا ونحن نغسلها ‏\"‏ ابدأن بميامنها ومواضع الوضوء ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     When we washed the deceased daughter of the Prophet, he said to us, while we were washing her, \"Start the bath from the right side and from the parts which are washed in ablution.\"",
      "chain": [
        "30221",
        "20032",
        "20012",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1519",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم أتي بلحم تصدق به على بريرة فقال ‏\"‏ هو عليها صدقة، وهو لنا هدية ‏\"‏‏.‏ وقال أبو داود أنبأنا شعبة، عن قتادة، سمع أنسا، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     Some meat was presented to the Prophet (p.b.u.h) and it had been given to Barira (the freed slave-girl of Aisha) in charity. He said, \"This meat is a thing of charity for Barira but it is a gift for us.\"",
      "chain": [
        "30221",
        "20032",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1771",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم أذن‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That the Prophet allowed people who provided the pilgrims with water to stay at Mecca during the nights of Mina.",
      "chain": [
        "30221",
        "20277",
        "11070",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2073",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن داود  عليه السلام  كان لا يأكل إلا من عمل يده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Prophet David used not to eat except from the earnings of his manual labor.\"",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2075",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا هشام بن عروة، عن أبيه، عن الزبير بن العوام  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لأن يأخذ أحدكم أحبله خير له من أن يسأل الناس ‏\"‏‏.‏",
      "text_en": " Narrated Az-Zubair bin Al-Awwam:                     The Prophet said, \"One would rather take a rope and cut wood and carry it than ask others).",
      "chain": [
        "30221",
        "20032",
        "11065",
        "10511",
        "7"
      ]
    },
    {
      "hadith_no": "2434",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني أبو هريرة  رضى الله عنه  قال لما فتح الله على رسوله صلى الله عليه وسلم مكة قام في الناس، فحمد الله، وأثنى عليه ثم قال ‏\"‏ إن الله حبس عن مكة الفيل، وسلط عليها رسوله والمؤمنين، فإنها لا تحل لأحد كان قبلي، وإنها أحلت لي ساعة من نهار، وإنها لا تحل لأحد بعدي، فلا ينفر صيدها ولا يختلى شوكها، ولا تحل ساقطتها إلا لمنشد، ومن قتل له قتيل فهو بخير النظرين، إما أن يفدى، وإما أن يقيد ‏\"‏‏.‏ فقال العباس إلا الإذخر، فإنا نجعله لقبورنا وبيوتنا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏‏.‏ فقام أبو شاه  رجل من أهل اليمن  فقال اكتبوا لي يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏‏.‏ قلت للأوزاعي ما قوله اكتبوا لي يا رسول الله قال هذه الخطبة التي سمعها من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     When Allah gave victory to His Apostle over the people of Mecca, Allah's Apostle stood up among the people and after glorifying Allah, said, \"Allah has prohibited fighting in Mecca and has given authority to His Apostle and the believers over it, so fighting was illegal for anyone before me, and was made legal for me for a part of a day, and it will not be legal for anyone after me. Its game should not be chased, its thorny bushes should not be uprooted, and picking up its fallen things is not allowed except for one who makes public announcement for it, and he whose relative is murdered has the option either to accept a compensation for it or to retaliate.\" Al-`Abbas said, \"Except Al-Idhkhir, for we use it in our graves and houses.\" Allah's Apostle said, \"Except Al-Idhkhir.\" Abu Shah, a Yemenite, stood up and said, \"O Allah's Apostle! Get it written for me.\" Allah's Apostle said, \"Write it for Abu Shah.\" (The sub-narrator asked Al-Auza'i): What did he mean by saying, \"Get it written, O Allah's Apostle?\" He replied, \"The speech which he had heard from Allah's Apostle .\"",
      "chain": [
        "30221",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2448",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا زكرياء بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن، فقال ‏\"‏ اتق دعوة المظلوم، فإنها ليس بينها وبين الله حجاب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet sent Mu`adh to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no screen between his invocation and Allah.\"",
      "chain": [
        "30221",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3407",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  قال أرسل ملك الموت إلى موسى  عليهما السلام  فلما جاءه صكه، فرجع إلى ربه، فقال أرسلتني إلى عبد لا يريد الموت‏.‏ قال ارجع إليه، فقل له يضع يده على متن ثور، فله بما غطت يده بكل شعرة سنة‏.‏ قال أى رب، ثم ماذا قال ثم الموت‏.‏ قال فالآن‏.‏ قال فسأل الله أن يدنيه من الأرض المقدسة رمية بحجر‏.‏ قال أبو هريرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو كنت ثم لأريتكم قبره إلى جانب الطريق تحت الكثيب الأحمر ‏\"‏‏.‏ قال وأخبرنا معمر عن همام حدثنا أبو هريرة عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Angel of Death was sent to Moses when he came to Moses, Moses slapped him on the eye. The angel returned to his Lord and said, \"You have sent me to a Slave who does not want to die.\" Allah said, \"Return to him and tell him to put his hand on the back of an ox and for every hair that will come under it, he will be granted one year of life.\" Moses said, \"O Lord! What will happen after that?\" Allah replied, \"Then death.\" Moses said, \"Let it come now.\" Moses then requested Allah to let him die close to the Sacred Land so much so that he would be at a distance of a stone's throw from it.\" Abu Huraira added, \"Allah's Apostle said, 'If I were there, I would show you his grave below the red sand hill on the side of the road.\"",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3649",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني بسر بن عبيد الله الحضرمي، قال حدثني أبو إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير، وكنت أسأله عن الشر مخافة أن يدركني‏.‏ فقلت يا رسول الله إنا كنا في جاهلية وشر، فجاءنا الله بهذا الخير، فهل بعد هذا الخير من شر قال ‏\"‏ نعم ‏\"‏‏.‏ قلت وهل بعد ذلك الشر من خير قال ‏\"‏ نعم، وفيه دخن ‏\"‏‏.‏ قلت وما دخنه قال ‏\"‏ قوم يهدون بغير هديي تعرف منهم وتنكر ‏\"‏‏.‏ قلت فهل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة إلى أبواب جهنم، من أجابهم إليها قذفوه فيها ‏\"‏‏.‏ قلت يا رسول الله صفهم لنا فقال ‏\"‏ هم من جلدتنا، ويتكلمون بألسنتنا ‏\"‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏‏.‏ قلت فإن لم يكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها، ولو أن تعض بأصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa bin Al-Yaman:                     The people used to ask Allah's Apostle about good, but I used to ask him about evil for fear that it might overtake me. Once I said, \"O Allah's Apostle! We were in ignorance and in evil and Allah has bestowed upon us the present good; will there by any evil after this good?\" He said, \"Yes.\" I asked, \"Will there be good after that evil?\" He said, \"Yes, but it would be tained with Dakhan (i.e. Little evil).\" I asked, \"What will its Dakhan be?\" He said, \"There will be some people who will lead (people) according to principles other than my tradition. You will see their actions and disapprove of them.\" I said, \"Will there by any evil after that good?\" He said, \"Yes, there will be some people who will invite others to the doors of Hell, and whoever accepts their invitation to it will be thrown in it (by them).\" I said, \"O Allah's Apostle! Describe those people to us.\" He said, \"They will belong to us and speak our language\" I asked, \"What do you order me to do if such a thing should take place in my life?\" He said, \"Adhere to the group of Muslims and their Chief.\" I asked, \"If there is neither a group (of Muslims) nor a chief (what shall I do)?\" He said, \"Keep away from all those different sects, even if you had to bite (i.e. eat) the root of a tree, till you meet Allah while you are still in that state.\"",
      "chain": [
        "30221",
        "20733",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "6449",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من الكسل والهرم والمغرم والمأثم، اللهم إني أعوذ بك من عذاب النار وفتنة النار وعذاب القبر، وشر فتنة الغنى، وشر فتنة الفقر، ومن شر فتنة المسيح الدجال، اللهم اغسل خطاياى بماء الثلج والبرد، ونق قلبي من الخطايا، كما ينقى الثوب الأبيض من الدنس، وباعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to say, \"O Allah! I seek refuge with You from laziness from geriatric old age, from being in debt, and from committing sins. O Allah! I seek refuge with You from the punishment of the Fire, the afflictions of the grave, the punishment in the grave, and the evil of the affliction of poverty and from the evil of the affliction caused by Al-Masih Ad-Dajjal. O Allah! Wash away my sins with the water of snow and hail, and cleanse my heart from the sins as a white garment is cleansed of filth, and let there be a far away distance between me and my sins as You have set far away the East and the West from each other.\"",
      "chain": [
        "30221",
        "20032",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6506",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن موسى، حدثنا وكيع، حدثنا إسماعيل، عن قيس، قال سمعت خبابا، وقد اكتوى يومئذ سبعا في بطنه وقال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت بالموت، إن أصحاب محمد صلى الله عليه وسلم مضوا ولم تنقصهم الدنيا بشىء، وإنا أصبنا من الدنيا ما لا نجد له موضعا إلا التراب‏.‏",
      "text_en": " Narrated Qais:                     I heard Khabbab, who had branded his `Abdomen with seven brands, saying, \"Had Allah's Apostle not forbidden us to invoke Allah for death, I would have invoked Allah for death. The companions of Muhammad have left this world without taking anything of their reward in it (i.e., they will have perfect reward in the Hereafter), but we have collected of the worldly wealth what we cannot spend but on earth (i.e. on building houses).",
      "chain": [
        "30221",
        "20032",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "hadith_no": "7221",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثني يحيى بن موسى، حدثنا يزيد بن هارون، أخبرنا شعبة، عن قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ المدينة يأتيها الدجال، فيجد الملائكة يحرسونها، فلا يقربها الدجال  قال  ولا الطاعون، إن شاء الله ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Ad-Dajjal will come to Medina and find the angels guarding it. So Allah willing, neither Ad-Dajjal, nor plague will be able to come near it.\"",
      "chain": [
        "30221",
        "20472",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا عبد الرزاق، أخبرني ابن جريج، أخبرنا عمرو بن دينار، أن أبا معبد، مولى ابن عباس أخبره أن ابن عباس أخبره أن رفع الصوت للذكر حين ينصرف الناس من المكتوبة كان ذلك على عهد رسول الله صلى الله عليه وسلم وأن ابن عباس قال كنت أعلم إذا انصرفوا بذلك وأسمعه ‏.‏",
      "text_en": " Ibn Abbas said :                      To raise the voice for making the mention of Allah after the people had finished their obligatory prayer was for in vogue the time of the Messenger of Allah (May peace be upon him).Ibn ‘Abbas said : I used to know by it when they finished the prayer and would listen to it (making the mention of Allah).",
      "chain": [
        "30221",
        "20121",
        "11070",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1365",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا نوح بن حبيب، ويحيى بن موسى، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن عكرمة بن خالد، عن ابن عباس، قال ‏:‏ بت عند خالتي ميمونة فقام النبي صلى الله عليه وسلم يصلي من الليل فصلى ثلاث عشرة ركعة منها ركعتا الفجر، حزرت قيامه في كل ركعة بقدر ‏{‏ يا أيها المزمل ‏}‏ لم يقل نوح ‏:‏ منها ركعتا الفجر ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     I spent a night with my maternal aunt Maymunah. The Prophet (ﷺ) got up to pray at night. He prayed thirteen rak'ahs including two rak'ahs of the dawn prayer. I guessed that he stood in every rak'ah as long as one could recite Surah al-Muzzammil (73).",
      "chain": [
        "38671",
        "30221",
        "20121",
        "20115",
        "11433",
        "11709",
        "17"
      ]
    },
    {
      "hadith_no": "1399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى البلخي، وهارون بن عبد الله، قالا أخبرنا عبد الله بن يزيد، أخبرنا سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال أقرئني يا رسول الله ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من ذوات الراء ‏\"‏ ‏.‏ فقال كبرت سني واشتد قلبي وغلظ لساني ‏.‏ قال ‏\"‏ فاقرأ ثلاثا من ذوات حم ‏\"‏ ‏.‏ فقال مثل مقالته ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من المسبحات ‏\"‏ ‏.‏ فقال مثل مقالته فقال الرجل يا رسول الله أقرئني سورة جامعة ‏.‏ فأقرأه النبي صلى الله عليه وسلم ‏{‏ إذا زلزلت الأرض ‏}‏ حتى فرغ منها ‏.‏ فقال الرجل والذي بعثك بالحق لا أزيد عليها أبدا ثم أدبر الرجل فقال النبي صلى الله عليه وسلم ‏\"‏ أفلح الرويجل ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     A man came to the Messenger of Allah (ﷺ) and said: Teach me to read the Qur'an, Messenger of Allah.  He said: Read three surahs which begin with A.L.R.  He said: My age is advanced, my mind has become dull (i.e. memory has grown weak), and my tongue has grown heavy). So he said: Then read three surahs which begin with H.M. He repeated the same words.  So he said: Read three surahs which begin with the \"Glorification of Allah\". But he repeated the same excuse.  The man then said: Teach me a comprehensive surah, Messenger of Allah. The Prophet (ﷺ) taught him Surah (99). \"When the Earth is shaken with her earthquake\". When he finished it, the man said: By Him Who sent you with truth, I shall never add anything to it. Then man then went away.  The Prophet (ﷺ) said twice:  The man received salvation.",
      "chain": [
        "30221",
        "30524",
        "23033",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "1587",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن علي، ويحيى بن موسى، قالا حدثنا عبد الرزاق، عن معمر، عن أيوب، بإسناده ومعناه إلا أنه قال قلنا يا رسول الله إن أصحاب الصدقة يعتدون ‏.‏ قال أبو داود رفعه عبد الرزاق عن معمر ‏.‏",
      "text_en": " The aforesaid tradition has also been narrated by Ayyub through a different chain of narrators to the same effect. This version adds We said Messenger of Allah(ﷺ) the collectors of sadaqah collect more than is due from us. Abu Dawud said ‘Abd Al Razzaq narrated this tradition from Ma’mar attributing it to the Prophet(ﷺ).",
      "chain": [
        "30115",
        "30221",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "2379",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الله المخرمي، ويحيى بن موسى البلخي، قالا حدثنا يحيى بن عيسى، عن الأعمش، قال ما رأيت أحدا من أصحابنا يكره الكحل للصائم وكان إبراهيم يرخص أن يكتحل الصائم بالصبر ‏.‏",
      "text_en": " Al-A'mash said:                      I did not see any of our companions who abominated the use of collyrium by a man who fasting. Ibrahim would permit the man who was fasting to apply collyrium with aloes.",
      "chain": [
        "30271",
        "30221",
        "11060"
      ]
    },
    {
      "hadith_no": "3177",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن موسى البلخي، أخبرنا عبد الرزاق، أخبرنا معمر، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن بن عوف، عن ثوبان، أن رسول الله صلى الله عليه وسلم أتي بدابة وهو مع الجنازة فأبى أن يركبها فلما انصرف أتي بدابة فركب فقيل له فقال ‏\"‏ إن الملائكة كانت تمشي فلم أكن لأركب وهم يمشون فلما ذهبوا ركبت ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     An animal was brought to the Messenger of Allah (ﷺ) while he was going with a funeral. He refused to ride on it. When the funeral was away, the animal was brought to him and he rode on it. He was asked about it. He said: The angels were on their feet. I was not to ride while they were walking. When they went away, I rode.",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11449",
        "10567",
        "130"
      ]
    },
    {
      "hadith_no": "3222",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا عبد الرزاق، أخبرنا معمر، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا عقر في الإسلام ‏\"‏ ‏.‏ قال عبد الرزاق كانوا يعقرون عند القبر بقرة أو شاة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: There is no slaughtering (at the grave) in Islam.'Abd al-Razzaq said: They used to slaughter cows or sheep at grave.",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3599",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا محمد بن عبيد، حدثني سفيان، - يعني العصفري - عن أبيه، عن حبيب بن النعمان الأسدي، عن خريم بن فاتك، قال صلى رسول الله صلى الله عليه وسلم صلاة الصبح فلما انصرف قام قائما فقال ‏\"‏ عدلت شهادة الزور بالإشراك بالله ‏\"‏ ‏.‏ ثلاث مرار ثم قرأ ‏{‏ فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور * حنفاء لله غير مشركين به ‏}‏ ‏.‏",
      "text_en": " Narrated Khuraym Ibn Fatik:                     The Messenger of Allah (ﷺ) offered the morning prayer. When he finished it, he stood up and said three times: False witness has been made equivalent to attributing a partner to Allah. He then recited: \"So avoid the abomination of idols and avoid speaking falsehood as people pure of faith to Allah, not associating anything with Him.",
      "chain": [
        "30221",
        "30213",
        "15349",
        "18155",
        "4127"
      ]
    },
    {
      "hadith_no": "3819",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا إبراهيم بن عيينة، عن عمرو بن منصور، عن الشعبي، عن ابن عمر، قال أتي النبي صلى الله عليه وسلم بجبنة في تبوك فدعا بسكين فسمى وقطع ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) was brought a piece of cheese in Tabuk. He called for a knife, mentioned Allah's name and cut it.",
      "chain": [
        "30221",
        "20018",
        "38433",
        "11052",
        "18"
      ]
    },
    {
      "hadith_no": "4452",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا أبو أسامة، قال مجالد أخبرنا عن عامر، عن جابر بن عبد الله، قال جاءت اليهود برجل وامرأة منهم زنيا فقال ائتوني بأعلم رجلين منكم فأتوه بابنى صوريا فنشدهما ‏\"‏ كيف تجدان أمر هذين في التوراة ‏\"‏ ‏.‏ قالا نجد في التوراة إذا شهد أربعة أنهم رأوا ذكره في فرجها مثل الميل في المكحلة رجما ‏.‏ قال ‏\"‏ فما يمنعكما أن ترجموهما ‏\"‏ ‏.‏ قالا ذهب سلطاننا فكرهنا القتل فدعا رسول الله صلى الله عليه وسلم بالشهود فجاءوا بأربعة فشهدوا أنهم رأوا ذكره في فرجها مثل الميل في المكحلة فأمر رسول الله صلى الله عليه وسلم برجمهما ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah said:                      The Jews brought a man and a woman of them who had committed fornication. He said: Bring me two learned men or yours. So they brought the two sons of Suriya. He adjured them and said: How do you think about the matter if these two persons bear witness to the effect that they have seen his sexual organ in her female organ (penetrated) like a collyrium stick when enclosed in its case, they will be stoned to death. He asked: What is there which prevents you from stoning them: They replied : Our rule has gone, so we disapproved of killing. The Messenger of Allah (ﷺ) then called four witnesses. They brought four witnesses. Who testified that they had seen his sexual organ (penetrated) in her female organ like a collyrium stick when enclosed in its case. The Prophet (ﷺ) then gave orders for stoning them.",
      "chain": [
        "30221",
        "20318",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5074",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا وكيع، ح وحدثنا عثمان بن أبي شيبة، - المعنى - حدثنا ابن نمير، قالا حدثنا عبادة بن مسلم الفزاري، عن جبير بن أبي سليمان بن جبير بن مطعم، قال سمعت ابن عمر، يقول لم يكن رسول الله صلى الله عليه وسلم يدع هؤلاء الدعوات حين يمسي وحين يصبح ‏\"‏ اللهم إني أسألك العافية في الدنيا والآخرة اللهم إني أسألك العفو والعافية في ديني ودنياى وأهلي ومالي اللهم استر عورتي ‏\"‏ ‏.‏ وقال عثمان ‏\"‏ عوراتي وآمن روعاتي اللهم احفظني من بين يدى ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي ‏\"‏ ‏.‏ قال أبو داود قال وكيع يعني الخسف ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) never failed to utter these supplications in the evening and in the morning: O Allah, I ask  Thee for security in this world and in the Hereafter: O Allah! I ask Thee for forgiveness and security in my religion and my worldly affairs, in my family and my property; O Allah! conceal my fault or faults (according to Uthman's version), and keep me safe from the things which I fear; O Allah! guard me in front of me and behind me, on my right hand and on my left, and from above me: and I seek in Thy greatness from receiving unexpected harm from below me.\" AbuDawud said: Waki' said: That is to say, swallowing by the earth.",
      "chain": [
        "30221",
        "20032",
        "30212",
        "19849",
        "12036",
        "18"
      ]
    },
    {
      "hadith_no": "28",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا إبراهيم بن موسى الرازي، حدثنا خالد بن عبد الله، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال رأيت النبي صلى الله عليه وسلم مضمض واستنشق من كف واحد فعل ذلك ثلاثا ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن عباس ‏.‏ قال أبو عيسى وحديث عبد الله بن زيد حسن غريب ‏.‏ وقد روى مالك وابن عيينة وغير واحد هذا الحديث عن عمرو بن يحيى ولم يذكروا هذا الحرف أن النبي صلى الله عليه وسلم مضمض واستنشق من كف واحد ‏.‏ وإنما ذكره خالد بن عبد الله ‏.‏ وخالد بن عبد الله ثقة حافظ عند أهل الحديث ‏.‏ وقال بعض أهل العلم المضمضة والاستنشاق من كف واحد يجزئ وقال بعضهم تفريقهما أحب إلينا ‏.‏ وقال الشافعي إن جمعهما في كف واحد فهو جائز وإن فرقهما فهو أحب إلينا ‏.‏",
      "text_en": " Abdullah bin Zaid said:                     \"1 saw the Prophet rinse his mouth and sniff water in his nose using one hand, he did that thrice,\"",
      "chain": [
        "30221",
        "30309",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "31",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، عن إسرائيل، عن عامر بن شقيق، عن أبي وائل، عن عثمان بن عفان، أن النبي صلى الله عليه وسلم كان يخلل لحيته ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Uthman bin Affan narrated that :                     the Prophet would go through his beard.\"",
      "chain": [
        "30221",
        "20121",
        "20311",
        "15261",
        "11353",
        "4"
      ]
    },
    {
      "hadith_no": "145",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن سليمان، حدثنا هشيم، عن محمد بن خالد القرشي، عن داود بن حصين، عن عكرمة، عن ابن عباس، أنه سئل عن التيمم، فقال إن الله قال في كتابه حين ذكر الوضوء‏:‏ ‏(‏فاغسلوا وجوهكم وأيديكم إلى المرافق‏)‏، وقال في التيمم‏:‏ ‏(‏فامسحوا بوجوهكم وأيديكم‏)‏ وقال‏:‏ ‏(‏والسارق والسارقة فاقطعوا أيديهما‏)‏ فكانت السنة في القطع الكفين، إنما هو الوجه والكفان، يعني التيمم‏\"‏‏.‏",
      "text_en": " Ikrimah narrated that :                     Ibn Abbas was asked ahout Tayammum. He said: \"When Allah mentioned Wudu in His Book, He said: \"So wash your faces and your hands (forearms) up to the elbows.\" And He said about Tayammum: \"And rub therewith your faces and hands\" And He said: \"And the male thief and the female thief; cut off their hands.\" So the Sunnah for cutting is the two hands. So it is only the face and the hands, meaning, Tayammum.\"",
      "chain": [
        "30221",
        "30252",
        "20468",
        "38496",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "201",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الله بن وهب، عن يونس، عن ابن شهاب، قال قال أبو هريرة لا ينادي بالصلاة إلا متوضئ ‏.‏ قال أبو عيسى وهذا أصح من الحديث الأول ‏.‏ قال أبو عيسى وحديث أبي هريرة لم يرفعه ابن وهب وهو أصح من حديث الوليد بن مسلم ‏.‏ والزهري لم يسمع من أبي هريرة ‏.‏ واختلف أهل العلم في الأذان على غير وضوء فكرهه بعض أهل العلم وبه يقول الشافعي وإسحاق ‏.‏ ورخص في ذلك بعض أهل العلم وبه يقول سفيان الثوري وابن المبارك وأحمد ‏.‏",
      "text_en": " Ibn Shihab narrated that :                     Abu Hurairah said: \"None should call (for the prayer except for one with Wudu.\"",
      "chain": [
        "30221",
        "20029",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا إسرائيل، أخبرني سماك بن حرب، سمع جابر بن سمرة، يقول كان مؤذن رسول الله صلى الله عليه وسلم يمهل فلا يقيم حتى إذا رأى رسول الله صلى الله عليه وسلم قد خرج أقام الصلاة حين يراه ‏.‏ قال أبو عيسى حديث جابر بن سمرة هو حديث حسن صحيح ‏.‏ وحديث إسرائيل عن سماك لا نعرفه إلا من هذا الوجه ‏.‏ وهكذا قال بعض أهل العلم إن المؤذن أملك بالأذان والإمام أملك بالإقامة ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     The Mu'adh-dhin of Allah's Messenger would wait and he would not call the Iqamah until he saw the Allah's Messenger had come out, he would call the Iqamah when he saw him.\"",
      "chain": [
        "30221",
        "20121",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "243",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن عرفة، ويحيى بن موسى، قالا حدثنا أبو معاوية، عن حارثة بن أبي الرجال، عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا افتتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث عائشة إلا من هذا الوجه ‏.‏ وحارثة قد تكلم فيه من قبل حفظه ‏.‏ وأبو الرجال اسمه محمد بن عبد الرحمن المديني ‏.‏",
      "text_en": " Aishah narrated:                     \"When the Prophet opened the Salat he would say: (Subhanaka allahumma wa bihamdika wa tabara asmuka, wa ta'ala jadduka wa la ilaha ghairuk.)\" 'Glorious You are O Allah, and with You praise, and blessed is You Name, and exalted is Your majesty, and none has the right to be worshipped but You.'",
      "chain": [
        "36540",
        "30221",
        "20354",
        "12046",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "283",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع طاوسا، يقول قلنا لابن عباس في الإقعاء على القدمين قال هي السنة ‏.‏ فقلنا إنا لنراه جفاء بالرجل قال بل هي سنة نبيكم صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث من أصحاب النبي صلى الله عليه وسلم لا يرون بالإقعاء بأسا وهو قول بعض أهل مكة من أهل الفقه والعلم ‏.‏ قال وأكثر أهل العلم يكرهون الإقعاء بين السجدتين ‏.‏",
      "text_en": " Tawus said:                     \"We asked Ibn Abbas about squatting (sitting) on the heels. He said: 'It is the Sunnah.' We said: 'We think that it is difficult for a man.' He said: 'Rather, it is Sunnah of your Prophet.'\"",
      "chain": [
        "30221",
        "20121",
        "11070",
        "11263",
        "11053"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا أبو معاوية، حدثنا خالد بن إلياس، عن صالح، مولى التوأمة عن أبي هريرة، قال كان النبي صلى الله عليه وسلم ينهض في الصلاة على صدور قدميه ‏.‏ قال أبو عيسى حديث أبي هريرة عليه العمل عند أهل العلم يختارون أن ينهض الرجل في الصلاة على صدور قدميه ‏.‏ وخالد بن إلياس هو ضعيف عند أهل الحديث ‏.‏ قال ويقال خالد بن إياس أيضا ‏.‏ وصالح مولى التوأمة هو صالح بن أبي صالح ‏.‏ وأبو صالح اسمه نبهان وهو مدني ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger would get up during his Salat on the tips of his feet.\"",
      "chain": [
        "30221",
        "20354",
        "22048",
        "12184",
        "13"
      ]
    },
    {
      "hadith_no": "294",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، ويحيى بن موسى، وغير، واحد، قالوا حدثنا عبد الرزاق، عن معمر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان إذا جلس في الصلاة وضع يده اليمنى على ركبته ورفع إصبعه التي تلي الإبهام اليمنى يدعو بها ويده اليسرى على ركبته باسطها عليه ‏.‏ قال وفي الباب عن عبد الله بن الزبير ونمير الخزاعي وأبي هريرة وأبي حميد ووائل بن حجر ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن غريب لا نعرفه من حديث عبيد الله بن عمر إلا من هذا الوجه ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين يختارون الإشارة في التشهد وهو قول أصحابنا ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"When the Prophet would sit during the Salat, he would place his right hand on his knee, and raise his finger, the one that is next to the [right] thumb, supplicating with it, and his left hand was spread flat on his left knee.\"",
      "chain": [
        "30277",
        "30221",
        "20121",
        "20115",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا محمد بن أبي معشر، مثله ‏.‏ قال أبو عيسى حديث أبي هريرة قد روي عنه، من غير هذا الوجه ‏.‏ وقد تكلم بعض أهل العلم في أبي معشر من قبل حفظه واسمه نجيح مولى بني هاشم ‏.‏ قال محمد لا أروي عنه شيئا وقد روى عنه الناس ‏.‏ قال محمد وحديث عبد الله بن جعفر المخرمي عن عثمان بن محمد الأخنسي عن سعيد المقبري عن أبي هريرة أقوى من حديث أبي معشر وأصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     (Another chain with a similar narration)",
      "chain": [
        "30221"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن عمران بن موسى، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي رافع، أنه مر بالحسن بن علي وهو يصلي وقد عقص ضفرته في قفاه فحلها فالتفت إليه الحسن مغضبا فقال أقبل على صلاتك ولا تغضب فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذلك كفل الشيطان ‏\"‏ ‏.‏ قال وفي الباب عن أم سلمة وعبد الله بن عباس ‏.‏ قال أبو عيسى حديث أبي رافع حديث حسن ‏.‏ والعمل على هذا عند أهل العلم كرهوا أن يصلي الرجل وهو معقوص شعره ‏.‏ قال أبو عيسى وعمران بن موسى هو القرشي المكي وهو أخو أيوب بن موسى ‏.‏",
      "text_en": " Abu Rafi narrated that :                     He passed by Al-Hasan bin Ali while he was performing Salat and he had gathered his locks at the back of his head, so he (Abu Rafi) undid them, and Al-Hasan turned to him angrily. He said: \"Resume your Salat and do not be angry, for indeed I heard Allah's Messenger (S) saying: 'That is the seat of Ash-Shaitan.'\"",
      "chain": [
        "30221",
        "20121",
        "11070",
        "28454",
        "11168",
        "11212",
        "479"
      ]
    },
    {
      "hadith_no": "411",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا شبابة بن سوار، حدثنا عمر بن الرماح البلخي، عن كثير بن زياد، عن عمرو بن عثمان بن يعلى بن مرة، عن أبيه، عن جده، أنهم كانوا مع النبي صلى الله عليه وسلم في مسير فانتهوا إلى مضيق وحضرت الصلاة فمطروا السماء من فوقهم والبلة من أسفل منهم فأذن رسول الله صلى الله عليه وسلم وهو على راحلته وأقام - أو أقام - فتقدم على راحلته فصلى بهم يومئ إيماء يجعل السجود أخفض من الركوع ‏.‏ قال أبو عيسى هذا حديث غريب تفرد به عمر بن الرماح البلخي لا يعرف إلا من حديثه ‏.‏ وقد روى عنه غير واحد من أهل العلم ‏.‏ وكذلك روي عن أنس بن مالك أنه صلى في ماء وطين على دابته ‏.‏ والعمل على هذا عند أهل العلم وبه يقول أحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Uthman bin Ya'la bin Murrah narrated from his father, from his grand-father that :                     They were with the Prophet (S) on a journey. They wound up in a narrow area when Salat became due. Then it began raining from the sky above them, and it was wet beneath them. So Allah's Messenger (S) called the Adhan while he was on his mount, and then the Iqamah, going forward on his mount. He let them in Salat by making gestures, making his prostrations lower than his bowing.",
      "chain": [
        "30221",
        "20426",
        "14330",
        "10581",
        "4"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، ومحمود بن غيلان، وأحمد بن إبراهيم الدورقي، وغير، واحد، قالوا حدثنا أبو داود الطيالسي، حدثنا محمد بن مسلم بن مهران، سمع جده، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ رحم الله امرأ صلى قبل العصر أربعا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب حسن ‏.‏",
      "text_en": " Ibn Umar narrated that :                     The Prophet (S) said: \"May Allah have mercy upon a man who prays four before Al-Asr.\"",
      "chain": [
        "30221",
        "30277",
        "30494",
        "20547",
        "167",
        "18"
      ]
    },
    {
      "hadith_no": "504",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا أبو داود الطيالسي، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن أنس، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال وفي الباب عن سلمة بن الأكوع وجابر والزبير بن العوام ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ وهو الذي أجمع عليه أكثر أهل العلم أن وقت الجمعة إذا زالت الشمس كوقت الظهر ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ ورأى بعضهم أن صلاة الجمعة إذا صليت قبل الزوال أنها تجوز أيضا ‏.‏ وقال أحمد ومن صلاها قبل الزوال فإنه لم ير عليه إعادة ‏.‏",
      "text_en": " (Another chain) from Anas, :                     from the Prophet, similarly.",
      "chain": [
        "30221",
        "20547",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "556",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عباد بن تميم، عن عمه، أن رسول الله صلى الله عليه وسلم خرج بالناس يستسقي فصلى بهم ركعتين جهر بالقراءة فيهما وحول رداءه ورفع يديه واستسقى واستقبل القبلة ‏.‏ قال وفي الباب عن ابن عباس وأبي هريرة وأنس وآبي اللحم ‏.‏ قال أبو عيسى حديث عبد الله بن زيد حديث حسن صحيح ‏.‏ وعلى هذا العمل عند أهل العلم وبه يقول الشافعي وأحمد وإسحاق ‏.‏ وعم عباد بن تميم هو عبد الله بن زيد بن عاصم المازني ‏.‏",
      "text_en": " Abbad bin Tamim narrated from his uncle:                     \"The Messenger of Allah went out with the people to seek rain. So he led them in prayer for two Rak'ah, reciting aloud in them, turning his upper wrap around, raising his hands, requesting rain, and facing the Qiblah.\"",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11013",
        "639"
      ]
    },
    {
      "hadith_no": "576",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، عن ابن أبي ذئب، عن يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على رسول الله صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏ قال أبو عيسى حديث زيد بن ثابت حديث حسن صحيح ‏.‏ وتأول بعض أهل العلم هذا الحديث فقال إنما ترك النبي صلى الله عليه وسلم السجود لأن زيد بن ثابت حين قرأ فلم يسجد لم يسجد النبي صلى الله عليه وسلم ‏.‏ وقالوا السجدة واجبة على من سمعها فلم يرخصوا في تركها ‏.‏ وقالوا إن سمع الرجل وهو على غير وضوء فإذا توضأ سجد ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يقول إسحاق ‏.‏ وقال بعض أهل العلم إنما السجدة على من أراد أن يسجد فيها والتمس فضلها ورخصوا في تركها إن أراد ذلك ‏.‏ واحتجوا بالحديث المرفوع حديث زيد بن ثابت حيث قال قرأت على النبي صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏ فقالوا لو كانت السجدة واجبة لم يترك النبي صلى الله عليه وسلم زيدا حتى كان يسجد ويسجد النبي صلى الله عليه وسلم ‏.‏ واحتجوا بحديث عمر أنه قرأ سجدة على المنبر فنزل فسجد ثم قرأها في الجمعة الثانية فتهيأ الناس للسجود فقال إنها لم تكتب علينا إلا أن نشاء ‏.‏ فلم يسجد ولم يسجدوا ‏.‏ فذهب بعض أهل العلم إلى هذا ‏.‏ وهو قول الشافعي وأحمد ‏.‏",
      "text_en": " Zaid bin Thabit narrated:                     \"I recited Surat An-Najm to the Messenger of Allah, and he did not prostrate for it.\"",
      "chain": [
        "30221",
        "20032",
        "20177",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "631",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا هارون بن صالح الطلحي المدني، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من استفاد مالا فلا زكاة عليه حتى يحول عليه الحول عند ربه ‏\"‏ ‏.‏ وفي الباب عن سراء بنت نبهان الغنوية ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Messenger of Allah said: \"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed (while it is in his possession).\"",
      "chain": [
        "30221",
        "28327",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "703",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا أبو داود الطيالسي، حدثنا هشام الدستوائي، عن قتادة، عن أنس بن مالك، عن زيد بن ثابت، قال تسحرنا مع النبي صلى الله عليه وسلم ثم قمنا إلى الصلاة ‏.‏ قال قلت كم كان قدر ذلك قال قدر خمسين آية ‏.‏",
      "text_en": " Anas (bin Malik) narrated that :                     Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"",
      "chain": [
        "30221",
        "20547",
        "20295",
        "11019",
        "19",
        "49"
      ]
    },
    {
      "hadith_no": "774",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى، ومحمد بن رافع النيسابوري، ومحمود بن غيلان، ويحيى بن موسى، قالوا حدثنا عبد الرزاق، عن معمر، عن يحيى بن أبي كثير، عن إبراهيم بن عبد الله بن قارظ، عن السائب بن يزيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وسعد وشداد بن أوس وثوبان وأسامة بن زيد وعائشة ومعقل بن سنان ويقال ابن يسار وأبي هريرة وابن عباس وأبي موسى وبلال ‏.‏ قال أبو عيسى وحديث رافع بن خديج حديث حسن ‏.‏ وذكر عن أحمد بن حنبل أنه قال أصح شيء في هذا الباب حديث رافع بن خديج ‏.‏ وذكر عن علي بن عبد الله أنه قال أصح شيء في هذا الباب حديث ثوبان وشداد بن أوس لأن يحيى بن أبي كثير روى عن أبي قلابة الحديثين جميعا حديث ثوبان وحديث شداد بن أوس ‏.‏ وقد كره قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم الحجامة للصائم حتى أن بعض أصحاب النبي صلى الله عليه وسلم احتجم بالليل منهم أبو موسى الأشعري وابن عمر وبهذا يقول ابن المبارك ‏.‏ قال أبو عيسى سمعت إسحاق بن منصور يقول قال عبد الرحمن بن مهدي من احتجم وهو صائم فعليه القضاء ‏.‏ قال إسحاق بن منصور وهكذا قال أحمد بن حنبل وإسحاق بن إبراهيم ‏.‏ وقال أبو عيسى وأخبرني الحسن بن محمد الزعفراني قال قال الشافعي قد روي عن النبي صلى الله عليه وسلم أنه احتجم وهو صائم وروي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ ولا أعلم واحدا من هذين الحديثين ثابتا ولو توقى رجل الحجامة وهو صائم كان أحب إلى ولو احتجم صائم لم أر ذلك أن يفطره ‏.‏ قال أبو عيسى هكذا كان قول الشافعي ببغداد وأما بمصر فمال إلى الرخصة ولم ير بالحجامة للصائم بأسا واحتج بأن النبي صلى الله عليه وسلم احتجم في حجة الوداع وهو محرم صائم ‏.‏",
      "text_en": " Rafi bin Khadi narrated that:                     The Prophet said: \"The cupper and the one cupped have broke the fast.\"",
      "chain": [
        "11222",
        "30375",
        "30277",
        "30221",
        "20121",
        "20115",
        "11449",
        "10888",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "802",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا يحيى بن اليمان، عن معمر، عن محمد بن المنكدر، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ الفطر يوم يفطر الناس والأضحى يوم يضحي الناس ‏\"‏ ‏.‏ قال أبو عيسى سألت محمدا قلت له محمد بن المنكدر سمع من عائشة قال نعم يقول في حديثه سمعت عائشة ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح من هذا الوجه ‏.‏",
      "text_en": " Aishah narrated that:                     The Messenger of Allah said: \"Al-Fitr is the day that the people break the fast, and Al-Adha is the day that the people sacrifice.\"",
      "chain": [
        "30221",
        "20115",
        "11048",
        "53"
      ]
    },
    {
      "hadith_no": "852",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا هارون بن صالح الطلحي، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن ابن عمر، قال اغتسل النبي صلى الله عليه وسلم لدخوله مكة بفخ ‏.‏ قال أبو عيسى هذا حديث غير محفوظ ‏.‏ والصحيح ما روى نافع عن ابن عمر أنه كان يغتسل لدخول مكة ‏.‏ وبه يقول الشافعي يستحب الاغتسال لدخول مكة ‏.‏ وعبد الرحمن بن زيد بن أسلم ضعيف في الحديث ضعفه أحمد بن حنبل وعلي بن المديني وغيرهما ولا نعرف هذا الحديث مرفوعا إلا من حديثه ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet performed Ghusl for entered Makkah at Fakhkh.\"",
      "chain": [
        "30221",
        "38674",
        "28327",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "934",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن موسى، وابن أبي عمر، قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن عمرو بن أوس، عن عبد الرحمن بن أبي بكر، أن النبي صلى الله عليه وسلم أمر عبد الرحمن بن أبي بكر أن يعمر عائشة من التنعيم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Amr bin Aws narrated from Abdur-Rahman bin Abi Bakr:                     \"The Prophet ordered Abdur-RAhman bin Abi Bakr to (accompany) Aishah to perform Umrah from At-Tan'im.\"",
      "chain": [
        "30221",
        "30421",
        "20005",
        "11081",
        "11437",
        "107"
      ]
    },
    {
      "hadith_no": "1059",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، وهارون بن عبد الله البزاز، قالا حدثنا أبو داود الطيالسي، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن أبي الأسود الديلي، قال قدمت المدينة فجلست إلى عمر بن الخطاب فمروا بجنازة فأثنوا عليها خيرا فقال عمر وجبت ‏.‏ فقلت لعمر وما وجبت قال أقول كما قال رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من مسلم يشهد له ثلاثة إلا وجبت له الجنة ‏\"‏ ‏.‏ قال قلنا واثنان قال ‏\"‏ واثنان ‏\"‏ ‏.‏ قال ولم نسأل رسول الله صلى الله عليه وسلم عن الواحد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو الأسود الديلي اسمه ظالم بن عمرو بن سفيان ‏.‏",
      "text_en": " Abu Al-Aswad Ad-Dill narrated:                     \"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"",
      "chain": [
        "30221",
        "20547",
        "20424",
        "11432",
        "11114"
      ]
    },
    {
      "hadith_no": "1280",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا عمر بن زيد الصنعاني، عن أبي الزبير، عن جابر، قال نهى النبي صلى الله عليه وسلم عن أكل الهر وثمنه ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وعمر بن زيد لا نعرف كبير أحد روى عنه غير عبد الرزاق ‏.‏",
      "text_en": " Narrated Jabir:                     \"The Messenger of Allah (ﷺ) prohibited eating the cat and from its price.\"[Abu 'Eisa said:] This Hadith is Gharib. We do not know of any major (known) narrators who reports from 'Umar bin Zaid (one of the narrators) besides 'Abdur-Razzaq.",
      "chain": [
        "30221",
        "20121",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1405",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا محمود بن غيلان، ويحيى بن موسى، قالا حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، حدثني أبو سلمة، حدثني أبو هريرة، قال لما فتح الله على رسوله مكة قام في الناس فحمد الله وأثنى عليه ثم قال ‏\"‏ ومن قتل له قتيل فهو بخير النظرين إما أن يعفو وإما أن يقتل ‏\"‏ ‏.‏ قال وفي الباب عن وائل بن حجر وأنس وأبي شريح خويلد بن عمرو ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"When Allah granted His Messenger (ﷺ) victory over Makkah, he stood (to deliver an address) among the people. He thanked and praised Allah, then he said: 'And from whomever (one of his relatives) was killed, then he has two options to choose from: Either to pardon or that he be killed.'\"",
      "chain": [
        "30277",
        "30221",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثني يحيى بن موسى، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثني عمارة بن عبد الله، قال سمعت عطاء بن يسار، يقول سألت أبا أيوب الأنصاري كيف كانت الضحايا على عهد رسول الله صلى الله عليه وسلم فقال كان الرجل يضحي بالشاة عنه وعن أهل بيته فيأكلون ويطعمون حتى تباهى الناس فصارت كما ترى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعمارة بن عبد الله هو مدني وقد روى عنه مالك بن أنس ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول أحمد وإسحاق واحتجا بحديث النبي صلى الله عليه وسلم أنه ضحى بكبش فقال ‏\"‏ هذا عمن لم يضح من أمتي ‏\"‏ ‏.‏ وقال بعض أهل العلم لا تجزئ الشاة إلا عن نفس واحدة وهو قول عبد الله بن المبارك وغيره من أهل العلم ‏.‏",
      "text_en": " Narrated 'Ata bin Yasar:                     \"I asked Abu Abyub [Al-Ansari] how the slaughtering was done during the time of the Messenger of Allah (ﷺ). He said: 'A man would sacrifice a sheep for himself and the people in his household. They would eat from it and feed others, until the people (later) would boast about it and it became as you see now.\"",
      "chain": [
        "30221",
        "20254",
        "20504",
        "11020"
      ]
    }
  ],
  "total_hadiths": 88
}