{
  "id": "30220",
  "name": "Yahya bin Sulaiman bin Yahya يحيى بن سليمان بن يحيى بن سعيد",
  "full_name": "Yahya bin Sulaiman bin Yahya يحيى بن سليمان بن يحيى بن سعيد",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "238",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  ت  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Kufa",
      "Egypt"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "38429",
      "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "114",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، قال لما اشتد بالنبي صلى الله عليه وسلم وجعه قال ‏\"‏ ائتوني بكتاب أكتب لكم كتابا لا تضلوا بعده ‏\"‏‏.‏ قال عمر إن النبي صلى الله عليه وسلم غلبه الوجع وعندنا كتاب الله حسبنا فاختلفوا وكثر اللغط‏.‏ قال ‏\"‏ قوموا عني، ولا ينبغي عندي التنازع ‏\"‏‏.‏ فخرج ابن عباس يقول إن الرزية كل الرزية ما حال بين رسول الله صلى الله عليه وسلم وبين كتابه‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Abdullah:                     Ibn `Abbas said, \"When the ailment of the Prophet became worse, he said, 'Bring for me (writing) paper and I will write for you a statement after which you will not go astray.' But `Umar said, 'The Prophet is seriously ill, and we have got Allah's Book with us and that is sufficient for us.' But the companions of the Prophet differed about this and there was a hue and cry. On that the Prophet said to them, 'Go away (and leave me alone). It is not right that you should quarrel in front of me.\" Ibn `Abbas came out saying, \"It was most unfortunate (a great disaster) that Allah's Apostle was prevented from writing that statement for them because of their disagreement and noise. (Note: It is apparent from this Hadith that Ibn `Abbas had witnessed the event and came out saying this statement. The truth is not so, for Ibn `Abbas used to say this statement on narrating the Hadith and he had not witnessed the event personally. See Fath Al-Bari Vol. 1, p.220 footnote.) (See Hadith No. 228, Vol. 4).",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، أنه سمع عثمان بن عفان، يقول عند قول الناس فيه حين بنى مسجد الرسول صلى الله عليه وسلم إنكم أكثرتم، وإني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا  قال بكير حسبت أنه قال  يبتغي به وجه الله، بنى الله له مثله في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah Al-Khaulani:                     I heard `Uthman bin `Affan saying, when people argued too much about his intention to reconstruct the mosque of Allah's Apostle, \"You have talked too much. I heard the Prophet saying, 'Whoever built a mosque, (Bukair thought that `Asim, another sub-narrator, added, \"Intending Allah's Pleasure\"), Allah would build for him a similar place in Paradise.' \"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11103",
        "11706",
        "4"
      ]
    },
    {
      "hadith_no": "682",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثنا ابن وهب، قال حدثني يونس، عن ابن شهاب، عن حمزة بن عبد الله، أنه أخبره عن أبيه، قال لما اشتد برسول الله صلى الله عليه وسلم وجعه قيل له في الصلاة فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إن أبا بكر رجل رقيق، إذا قرأ غلبه البكاء‏.‏ قال ‏\"‏ مروه فيصلي ‏\"‏ فعاودته‏.‏ قال ‏\"‏ مروه فيصلي، إنكن صواحب يوسف ‏\"‏‏.‏ تابعه الزبيدي وابن أخي الزهري وإسحاق بن يحيى الكلبي عن الزهري‏.‏ وقال عقيل ومعمر عن الزهري عن حمزة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hamza bin `Abdullah:                     My father said, \"When Allah's Apostle became seriously ill, he was told about the prayer. He said, 'Tell Abu Bakr to lead the people in the prayer.' `Aisha said, 'Abu Bakr is a softhearted man and he would be overpowered by his weeping if he recited the Qur'an.' He said to them, 'Tell him (Abu Bakr) to lead the prayer. The same reply was given to him. He said again, 'Tell him to lead the prayer. You (women) are the companions of Joseph.\"",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى، فإذا أردت أن تنصرف فاركع ركعة توتر لك ما صليت ‏\"‏‏.‏ قال القاسم ورأينا أناسا منذ أدركنا يوترون بثلاث، وإن كلا لواسع أرجو أن لا يكون بشىء منه بأس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1101",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد، أن حفص بن عاصم، حدثه قال سافر ابن عمر  رضى الله عنهما  فقال صحبت النبي صلى الله عليه وسلم فلم أره يسبح في السفر، وقال الله جل ذكره ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
      "text_en": " Narrated Hafs bin `Asim:                     Ibn `Umar went on a journey and said, \"I accompanied the Prophet and he did not offer optional prayers during the journey, and Allah says: 'Verily! In Allah's Apostle you have a good example to follow.' \" (33.21)",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11420",
        "18"
      ]
    },
    {
      "hadith_no": "1233",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، أن ابن عباس، والمسور بن مخرمة، وعبد الرحمن بن أزهر  رضى الله عنهم  أرسلوه إلى عائشة  رضى الله عنها  فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد صلاة العصر وقل لها إنا أخبرنا أنك تصلينهما وقد بلغنا أن النبي صلى الله عليه وسلم نهى عنها‏.‏ وقال ابن عباس وكنت أضرب الناس مع عمر بن الخطاب عنهما‏.‏ فقال كريب فدخلت على عائشة  رضى الله عنها  فبلغتها ما أرسلوني‏.‏ فقالت سل أم سلمة‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة‏.‏ فقالت أم سلمة  رضى الله عنها  سمعت النبي صلى الله عليه وسلم ينهى عنها ثم رأيته يصليهما حين صلى العصر، ثم دخل على وعندي نسوة من بني حرام من الأنصار فأرسلت إليه الجارية فقلت قومي بجنبه قولي له تقول لك أم سلمة يا رسول الله سمعتك تنهى عن هاتين وأراك تصليهما‏.‏ فإن أشار بيده فاستأخري عنه‏.‏ ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر وإنه أتاني ناس من عبد القيس فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏‏.‏",
      "text_en": " Narrated Kuraib:                     I was sent to Aisha by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar . They told me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr prayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the Prophet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to beat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha said, \"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They then told me to go to Um Salama with the same question with which t sent me to `Aisha. Um Salama replied, \"I heard the Prophet forbidding them. Later I saw him offering them immediately after he prayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the tribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand beside him and tell him that Um Salama says to you, \"O Allah's Apostle! I have heard you forbidding the offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves his hand then wait for him.' The slave girl did that. The Prophet beckoned her with his hand and she waited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have asked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to me and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that I have just prayed) are for those (missed) ones.",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2201",
        "2216"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، حدثنا الثوري، عن هشام، عن فاطمة، عن أسماء، قالت دخلت على عائشة  رضى الله عنها  وهي تصلي قائمة والناس قيام فقلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية‏.‏ فقالت برأسها أى نعم‏.‏",
      "text_en": " Narrated Asma':                     I went to `Aisha and she was standing praying and the people, too, were standing (praying). So I said, \"What is the matter with the people?\" She beckoned with her head towards the sky. I said, \"(Is there) a sign?\" She nodded intending to say, \"Yes.\"",
      "chain": [
        "30220",
        "20029",
        "20012",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1373",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أنه سمع أسماء بنت أبي بكر  رضى الله عنهما  تقول قام رسول الله صلى الله عليه وسلم خطيبا فذكر فتنة القبر التي يفتتن فيها المرء، فلما ذكر ذلك ضج المسلمون ضجة‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     Allah's Apostle once stood up delivering a sermon and mentioned the trial which people will face in the grave. When he mentioned that, the Muslims started shouting loudly.",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن صالح، ويحيى بن سليمان، قالا حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال طاف النبي صلى الله عليه وسلم في حجة الوداع على بعير، يستلم الركن بمحجن‏.‏ تابعه الدراوردي عن ابن أخي الزهري عن عمه‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     In his Last Hajj the Prophet performed Tawaf of the Ka`ba riding a camel and pointed a bent-headed stick towards the Corner (Black Stone).",
      "chain": [
        "30226",
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1860",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عروة، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خمس من الدواب كلهن فاسق، يقتلهن في الحرم الغراب والحدأة والعقرب والفأرة والكلب العقور ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle said, \"Five kinds of animals are harmful and could be killed in the Haram (Sanctuary). These are: the crow, the kite, the scorpion, the mouse and the rabid dog.\"",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1989",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب  أو قرئ عليه  قال أخبرني عمرو، عن بكير، عن كريب، عن ميمونة  رضى الله عنها  أن الناس، شكوا في صيام النبي صلى الله عليه وسلم يوم عرفة، فأرسلت إليه بحلاب وهو واقف في الموقف، فشرب منه، والناس ينظرون‏.‏",
      "text_en": " Narrated Maimuna:                     The people doubted whether the Prophet was fasting on the day of `Arafat or not, so I sent milk while he was standing at `Arafat, he drank it and the people were looking at him.",
      "chain": [
        "30220",
        "20377",
        "11154",
        "11211",
        "61"
      ]
    },
    {
      "hadith_no": "2189",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، أخبرنا ابن جريج، عن عطاء، وأبي الزبير، عن جابر  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن بيع الثمر حتى يطيب، ولا يباع شىء منه إلا بالدينار والدرهم إلا العرايا‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet forbade the selling of fruits unless they get ripe, and none of them should be sold except for Dinar or Dirham (i.e. money), except the 'Araya trees (the dates of which could be sold for dates).",
      "chain": [
        "30220",
        "20029",
        "11070",
        "11029",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2462",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني مالك،‏.‏ وأخبرني يونس، عن ابن شهاب، أخبرني عبيد الله بن عبد الله بن عتبة، أن ابن عباس، أخبره عن عمر  رضى الله عنهم  قال حين توفى الله نبيه صلى الله عليه وسلم إن الأنصار اجتمعوا في سقيفة بني ساعدة، فقلت لأبي بكر انطلق بنا‏.‏ فجئناهم في سقيفة بني ساعدة‏.‏",
      "text_en": " Narrated `Umar:                     When Allah took away the soul of His Prophet at his death, the Ansar assembled In the shed of Bani Sa`ida. I said to Abu Bakr, \"Let us go.\" So, we come to them (i.e. to Ansar) at the shed of Bani Sa`ida. (See Hadith No. 19, Vol. 5 for details)",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3201",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of someone's death or wife (i.e. birth), but they are two signs amongst the Signs of Allah. So, if you see them (i.e. eclipse) offer the Prayer (of eclipse).",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "3227",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، عن سالم، عن أبيه، قال وعد النبي صلى الله عليه وسلم جبريل فقال إنا لا ندخل بيتا فيه صورة ولا كلب‏.‏",
      "text_en": " Narrated Salim's father:                     Once Gabriel promised the Prophet (that he would visit him, but Gabriel did not come) and later on he said, \"We, angels, do not enter a house which contains a picture or a dog.\"",
      "chain": [
        "30220",
        "20029",
        "3",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3351",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن بكيرا، حدثه عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال دخل النبي صلى الله عليه وسلم البيت فوجد فيه صورة إبراهيم وصورة مريم فقال ‏\"‏ أما لهم، فقد سمعوا أن الملائكة لا تدخل بيتا فيه صورة، هذا إبراهيم مصور فما له يستقسم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet entered the Ka`ba and found in it the pictures of (Prophet) Abraham and Mary. On that he said' \"What is the matter with them ( i.e. Quraish)? They have already heard that angels do not enter a house in which there are pictures; yet this is the picture of Abraham. And why is he depicted as practicing divination by arrows?\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، هو ابن محمد أن زيد بن أسلم، حدثه عن أبيه، قال سألني ابن عمر عن بعض، شأنه  يعني عمر  فأخبرته‏.‏ فقال، ما رأيت أحدا قط بعد رسول الله صلى الله عليه وسلم من حين قبض كان أجد وأجود حتى انتهى من عمر بن الخطاب‏.‏",
      "text_en": " Narrated Aslam:                     Ibn `Umar asked me about some matters concerning `Umar. He said, \"Since Allah's Apostle died. I have never seen anybody more serious, hard working and generous than `Umar bin Al-Khattab (till the end of his life.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "3740",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد أنه سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were with the Prophet while he was holding `Umar bin Al-Khattab by the hand.",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "3786",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، عن يونس، عن الزهري، عن سالم، عن ابن عمر، عن أخته، حفصة أن النبي صلى الله عليه وسلم قال لها ‏\"‏ إن عبد الله رجل صالح ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar from Hafsa his sister:                     That the Prophet had said to her, \"`Abdullah is a pious man.\"",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3885",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه أن القاسم كان يمشي بين يدى الجنازة ولا يقوم لها، ويخبر عن عائشة قالت كان أهل الجاهلية يقومون لها، يقولون إذا رأوها كنت في أهلك ما أنت‏.‏ مرتين‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Qasim:                     Al-Qasim used to walk in front of the funeral procession. He used not to get up for the funeral procession (in case it passed by him). And he narrated from `Aisha that she said, \"The people of the pre-lslamic period of ignorance used to stand up for the funeral procession. When they saw it they used to say twice: 'You were noble in your family. What are you now?\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3912",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد، قال فأخبرني جدي، زيد بن عبد الله بن عمر عن أبيه، قال بينما هو في الدار خائفا، إذ جاءه العاص بن وائل السهمي أبو عمرو، عليه حلة حبرة، وقميص مكفوف بحرير، وهو من بني سهم، وهم حلفاؤنا في الجاهلية فقال له ما بالك قال زعم قومك أنهم سيقتلوني إن أسلمت‏.‏ قال لا سبيل إليك‏.‏ بعد أن قالها أمنت، فخرج العاص، فلقي الناس قد سال بهم الوادي فقال أين تريدون فقالوا نريد هذا ابن الخطاب الذي صبا‏.‏ قال لا سبيل إليه‏.‏ فكر الناس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While `Umar was at home in a state of fear, there came Al-`As bin Wail As-Sahmi Abu `Amr, wearing an embroidered cloak and a shirt having silk hems. He was from the tribe of Bani Sahm who were our allies during the pre-Islamic period of ignorance. Al-`As said to `Umar \"What is wrong with you?\" He said, \"Your people claim that they would kill me if I become a Muslim.\" Al-`As said, \"Nobody will harm you after I have given protection to you.\" So Al-`As went out and met the people streaming in the whole valley. He said, \"Where are you going?\" They said, \"We want Ibn Al-Khattab who has embraced Islam.\" Al-`As said, \"There is no way for anybody to touch him.\" So the people retreated.",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11217"
      ]
    },
    {
      "hadith_no": "3914",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، أن سالما، حدثه عن عبد الله بن عمر، قال ما سمعت عمر، لشىء قط يقول إني لأظنه كذا‏.‏ إلا كان كما يظن، بينما عمر جالس إذ مر به رجل جميل فقال لقد أخطأ ظني، أو إن هذا على دينه في الجاهلية، أو لقد كان كاهنهم، على الرجل، فدعي له، فقال له ذلك، فقال ما رأيت كاليوم استقبل به رجل مسلم، قال فإني أعزم عليك إلا ما أخبرتني‏.‏ قال كنت كاهنهم في الجاهلية‏.‏ قال فما أعجب ما جاءتك به جنيتك قال بينما أنا يوما في السوق جاءتني أعرف فيها الفزع، فقالت ألم تر الجن وإبلاسها ويأسها من بعد إنكاسها ولحوقها بالقلاص وأحلاسها قال عمر صدق، بينما أنا عند آلهتهم إذ جاء رجل بعجل فذبحه، فصرخ به صارخ، لم أسمع صارخا قط أشد صوتا منه يقول يا جليح، أمر نجيح رجل فصيح يقول لا إله إلا أنت‏.‏ فوثب القوم قلت لا أبرح حتى أعلم ما وراء هذا ثم نادى يا جليح، أمر نجيح، رجل فصيح، يقول لا إله إلا الله‏.‏ فقمت فما نشبنا أن قيل هذا نبي‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     I never heard `Umar saying about something that he thought it would be so-and-so, but he was quite right. Once, while `Umar was sitting, a handsome man passed by him, `Umar said, \"If I am not wrong, this person is still on his religion of the pre-lslamic period of ignorance or he was their foreteller. Call the man to me.\" When the man was called to him, he told him of his thought. The man said, \"I have never seen such a day on which a Muslim is faced with such an accusation.\" `Umar said, \"I am determined that you should tell me the truth.\" He said, \"I was a foreteller in the pre-lslamic period of ignorance.\" Then `Umar said, \"Tell me the most astonishing thing your female Jinn has told you of.\" He said, \"One-day while I was in the market, she came to me scared and said, 'Haven't you seen the Jinns and their despair and they were overthrown after their defeat (and prevented from listening to the news of the heaven) so that they (stopped going to the sky and) kept following camel-riders (i.e. 'Arabs)?\" `Umar said, \"He is right.\" and added, \"One day while I was near their idols, there came a man with a calf and slaughtered it as a sacrifice (for the idols). An (unseen) creature shouted at him, and I have never heard harsher than his voice. He was crying, 'O you bold evil-doer! A matter of success! An eloquent man is saying: None has the right to be worshipped except you (O Allah).' On that the people fled, but I said, 'I shall not go away till I know what is behind this.' Then the cry came again: 'O you bold evil-doer! A matter of success! An eloquent man is saying: None has the right to be worshipped except Allah.' I then went away and a few days later it was said, \"A prophet has appeared.\"",
      "chain": [
        "30220",
        "20029",
        "3",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3976",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، حدثنا مالك،‏.‏ وأخبرني يونس، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله، أن ابن عباس، أخبره أن عبد الرحمن بن عوف رجع إلى أهله وهو بمنى، في آخر حجة حجها عمر، فوجدني، فقال عبد الرحمن فقلت يا أمير المؤمنين إن الموسم يجمع رعاع الناس، وإني أرى أن تمهل حتى تقدم المدينة، فإنها دار الهجرة والسنة، وتخلص لأهل الفقه وأشراف الناس وذوي رأيهم‏.‏ قال عمر لأقومن في أول مقام أقومه بالمدينة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     During the last Hajj led by `Umar, `Abdur-Rahman bin `Auf returned to his family at Mina and met me there. `AbdurRahman said (to `Umar), \"O chief of the believers! The season of Hajj is the season when there comes the scum of the people (besides the good amongst them), so I recommend that you should wait till you go back to Medina, for it is the place of Migration and Sunna (i.e. the Prophet's tradition), and there you will be able to refer the matter to the religious scholars and the nobles and the people of wise opinions.\" `Umar said, \"I will speak of it in Medina on my very first sermon I will deliver there.\"",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4413",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو،‏.‏ وقال بكر بن مضر عن عمرو بن الحارث، عن بكير، أن كريبا، مولى ابن عباس حدثه أن ابن عباس وعبد الرحمن بن أزهر والمسور بن مخرمة أرسلوا إلى عائشة  رضى الله عنها  فقالوا اقرأ عليها السلام منا جميعا، وسلها عن الركعتين بعد العصر، وإنا أخبرنا أنك تصليها، وقد بلغنا أن النبي صلى الله عليه وسلم نهى عنها، قال ابن عباس وكنت أضرب مع عمر الناس عنهما‏.‏ قال كريب فدخلت عليها، وبلغتها ما أرسلوني، فقالت سل أم سلمة‏.‏ فأخبرتهم، فردوني إلى أم سلمة بمثل ما أرسلوني إلى عائشة، فقالت أم سلمة سمعت النبي صلى الله عليه وسلم ينهى عنهما، وإنه صلى العصر ثم دخل على وعندي نسوة من بني حرام من الأنصار، فصلاهما، فأرسلت إليه الخادم فقلت قومي إلى جنبه فقولي تقول أم سلمة يا رسول الله ألم أسمعك تنهى عن هاتين الركعتين فأراك تصليهما‏.‏ فإن أشار بيده فاستأخري‏.‏ ففعلت الجارية، فأشار بيده، فاستأخرت عنه، فلما انصرف قال ‏\"‏ يا بنت أبي أمية، سألت عن الركعتين بعد العصر، إنه أتاني أناس من عبد القيس بالإسلام من قومهم، فشغلوني عن الركعتين اللتين بعد الظهر، فهما هاتان ‏\"‏‏.‏",
      "text_en": " Narrated Bukair:                     That Kuraib, the freed slave of Ibn `Abbas told him that Ibn `Abbas, `Abdur-Rahman bin Azhar and Al-Miswar bin Makhrama sent him to `Aisha saying, \"Pay her our greetings and ask her about our offering of the two-rak`at after `Asr Prayer, and tell her that we have been informed that you offer these two rak`at while we have heard that the Prophet had forbidden their offering.\" Ibn `Abbas said, \"I and `Umar used to beat the people for their offering them.\" Kuraib added, \"I entered upon her and delivered their message to her.' She said, 'Ask Um Salama.' So, I informed them (of `Aisha's answer) and they sent me to Um Salama for the same purpose as they sent me to `Aisha. Um Salama replied, 'I heard the Prophet forbidding the offering of these two rak`at. Once the Prophet offered the `Asr prayer, and then came to me. And at that time some Ansari women from the Tribe of Banu Haram were with me. Then (the Prophet ) offered those two rak`at, and I sent my (lady) servant to him, saying, 'Stand beside him and say (to him): Um Salama says, 'O Allah's Apostle! Didn't I hear you forbidding the offering of these two rak`at (after the `Asr prayer yet I see you offering them?' And if he beckons to you with his hand, then wait behind.' So the lady slave did that and the Prophet beckoned her with his hand, and she stayed behind, and when the Prophet finished his prayer, he said, 'O the daughter of Abu Umaiya (i.e. Um Salama), You were asking me about these two rak`at after the `Asr prayer. In fact, some people from the tribe of `Abdul Qais came to me to embrace Islam and busied me so much that I did not offer the two rak`at which were offered after Zuhr compulsory prayer, and these two rak`at (you have seen me offering) make up for those.\"",
      "chain": [
        "30220",
        "20029",
        "20374",
        "20377",
        "11154"
      ]
    },
    {
      "hadith_no": "4446",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن سليمان، قال أخبرني ابن وهب، قال حدثني عمر بن محمد، أن أباه، حدثه عن ابن عمر  رضى الله عنهما  قال كنا نتحدث بحجة الوداع والنبي صلى الله عليه وسلم بين أظهرنا، ولا ندري ما حجة الوداع، فحمد الله وأثنى عليه ثم ذكر المسيح الدجال فأطنب في ذكره وقال ‏\"‏ ما بعث الله من نبي إلا أنذر أمته، أنذره نوح والنبيون من بعده، وإنه يخرج فيكم، فما خفي عليكم من شأنه فليس يخفى عليكم أن ربكم ليس على ما يخفى عليكم ثلاثا، إن ربكم ليس بأعور، وإنه أعور عين اليمنى، كأن عينه عنبة طافية ‏\"‏‏.‏   ‏\"‏ ألا إن الله حرم عليكم دماءكم وأموالكم، كحرمة يومكم هذا، في بلدكم هذا، في شهركم هذا، ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، ثلاثا، ويلكم، أو ويحكم، انظروا لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We were talking about Hajjat-ul-Wada`, while the Prophet was amongst us. We did not know what Hajjat-ul-Wada` signified. The Prophet praised Allah and then mentioned Al-Masih Ad-Dajjal and described him extensively, saying, \"Allah did not send any prophet but that prophet warned his nation of Al-Masih Ad-Dajjal. Noah and the prophets following him warned (their people) of him. He will appear amongst you (O Muhammad's followers), and if it happens that some of his qualities may be hidden from you, but your Lord's State is clear to you and not hidden from you. The Prophet said it thrice. Verily, your Lord is not blind in one eye, while he (i.e. Ad-Dajjal) is blind in the right eye which looks like a grape bulging out (of its cluster). No doubt,! Allah has made your blood and your properties sacred to one another like the sanctity of this day of yours, in this town of yours, in this month of yours.\" The Prophet added: No doubt! Haven't I conveyed Allah's Message to you? \" They replied, \"Yes,\" The Prophet said thrice, \"O Allah! Be witness for it.\" The Prophet added, \"Woe to you!\" (or said), \"May Allah be merciful to you! Do not become infidels after me (i.e. my death) by cutting the necks (throats) of one another.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "4651",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة  رضى الله عنها  سقطت قلادة لي بالبيداء ونحن داخلون المدينة، فأناخ النبي صلى الله عليه وسلم ونزل، فثنى رأسه في حجري راقدا، أقبل أبو بكر فلكزني لكزة شديدة وقال حبست الناس في قلادة‏.‏ فبي الموت لمكان رسول الله صلى الله عليه وسلم وقد أوجعني، ثم إن النبي صلى الله عليه وسلم استيقظ وحضرت الصبح فالتمس الماء فلم يوجد فنزلت ‏{‏يا أيها الذين آمنوا إذا قمتم إلى الصلاة‏}‏ الآية‏.‏ فقال أسيد بن حضير لقد بارك الله للناس فيكم يا آل أبي بكر، ما أنتم إلا بركة لهم‏.‏",
      "text_en": " Narrated Aisha:                     A necklace of mine was lost at Al-Baida' and we were on our way to Medina. The Prophet made his camel kneel down and dismounted and laid his head on my lap and slept. Abu Bakr came to me and hit me violently on the chest and said, \"You have detained the people because of a necklace.\" I kept as motionless as a dead person because of the position of Allah's Apostle ; (on my lap) although Abu Bakr had hurt me (with the slap). Then the Prophet woke up and it was the time for the morning (prayer). Water was sought, but in vain; so the following Verse was revealed:-- \"O you who believe! When you intend to offer prayer..\" (5.6) Usaid bin Hudair said, \"Allah has blessed the people for your sake, O the family of Abu Bakr. You are but a blessing for them.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4825",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد بن زيد بن عبد الله بن عمر، أن أباه، حدثه أن عبد الله بن عمر  رضى الله عنهما  قال قال النبي  صلى الله عليه وسلم  ‏\"‏ مفاتيح الغيب خمس ‏\"‏ ثم قرأ ‏{‏إن الله عنده علم الساعة‏}‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The keys of the Unseen are five.\" And then he recited: 'Verily, the knowledge of the Hour is with Allah (alone).' (31.34)",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "5015",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة، رضى الله عنه سئل النبي صلى الله عليه وسلم عن الحمر فقال ‏\"‏ لم ينزل على فيها شىء إلا هذه الآية الجامعة الفاذة ‏{‏فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet was asked about donkeys and he replied, \"Nothing has been revealed to me regarding donkeys except this comprehensive Verse which includes everything: \"So whoever does good equal to the weight of an atom (or a smallest ant) shall see it; And whoever, does evil equal to the weight of an atom or a smallest ant) shall see it.' (99.7-8)",
      "chain": [
        "30220",
        "20029",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5182",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "قال يحيى بن سليمان حدثنا ابن وهب، عن يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن النكاح في الجاهلية كان على أربعة أنحاء فنكاح منها نكاح الناس اليوم، يخطب الرجل إلى الرجل وليته أو ابنته، فيصدقها ثم ينكحها، ونكاح آخر كان الرجل يقول لامرأته إذا طهرت من طمثها أرسلي إلى فلان فاستبضعي منه‏.‏ ويعتزلها زوجها، ولا يمسها أبدا، حتى يتبين حملها من ذلك الرجل الذي تستبضع منه، فإذا تبين حملها أصابها زوجها إذا أحب، وإنما يفعل ذلك رغبة في نجابة الولد، فكان هذا النكاح نكاح الاستبضاع، ونكاح آخر يجتمع الرهط ما دون العشرة فيدخلون على المرأة كلهم يصيبها‏.‏ فإذا حملت ووضعت، ومر عليها ليالي بعد أن تضع حملها، أرسلت إليهم فلم يستطع رجل منهم أن يمتنع حتى يجتمعوا عندها تقول لهم قد عرفتم الذي كان من أمركم، وقد ولدت فهو ابنك يا فلان‏.‏ تسمي من أحبت باسمه، فيلحق به ولدها، لا يستطيع أن يمتنع به الرجل‏.‏ ونكاح الرابع يجتمع الناس الكثير فيدخلون على المرأة لا تمتنع ممن جاءها وهن البغايا كن ينصبن على أبوابهن رايات تكون علما فمن أرادهن دخل عليهن، فإذا حملت إحداهن ووضعت حملها جمعوا لها ودعوا لهم القافة ثم ألحقوا ولدها بالذي يرون فالتاط به، ودعي ابنه لا يمتنع من ذلك، فلما بعث محمد صلى الله عليه وسلم بالحق هدم نكاح الجاهلية كله، إلا نكاح الناس اليوم‏.‏",
      "text_en": "",
      "chain": [
        "30220",
        "20029",
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "5550",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن نافع، مولى أبي قتادة وأبي صالح مولى التوأمة سمعت أبا قتادة، قال كنت مع النبي صلى الله عليه وسلم فيما بين مكة والمدينة وهم محرمون وأنا رجل حل على فرس، وكنت رقاء على الجبال، فبينا أنا على ذلك إذ رأيت الناس متشوفين لشىء، فذهبت أنظر، فإذا هو حمار وحش فقلت لهم ما هذا قالوا لا ندري‏.‏ قلت هو حمار وحشي‏.‏ فقالوا هو ما رأيت‏.‏ وكنت نسيت سوطي فقلت لهم ناولوني سوطي‏.‏ فقالوا لا نعينك عليه‏.‏ فنزلت فأخذته، ثم ضربت في أثره، فلم يكن إلا ذاك، حتى عقرته، فأتيت إليهم فقلت لهم قوموا فاحتملوا‏.‏ قالوا لا نمسه‏.‏ فحملته حتى جئتهم به، فأبى بعضهم، وأكل بعضهم، فقلت أنا أستوقف لكم النبي صلى الله عليه وسلم فأدركته فحدثته الحديث فقال لي ‏\"‏ أبقي معكم شىء منه ‏\"‏‏.‏ قلت نعم‏.‏ فقال ‏\"‏ كلوا فهو طعم أطعمكموها الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     I was with the Prophet (on a journey) between Mecca and Medina, and all of them, (i.e. the Prophet and his companions) were in the state of Ihram, while I was not in that state. I was riding my horse and I used to be fond of ascending mountains. So while I was doing so I noticed that the people were looking at something. I went to see what it was, and behold it was an onager. I asked my companions, \"What is that?\" They said, \"We do not know.\" I said, \"It is an onager.' They said, \"It is what you have seen.\" I had left my whip, so I said to them, \"Hand to me my whip.\" They said, \"We will not help you in that (in hunting the onager).\" I got down, took my whip and chased the animal (on my horse) and did not stop till I killed it. I went to them and said, \"Come on, carry it!\" But they said, \"We will not even touch it.\" At last I alone carried it and brought it to them. Some of them ate of it and some refused to eat of it. I said (to them), \"I will ask the Prophet about it (on your behalf).\" When I met the Prophet, I told him the whole story. He said to me, \"Has anything of it been left with you?\" I said, \"Yes.\" He said, \"Eat, for it is a meal Allah has offered to you.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "20390",
        "391"
      ]
    },
    {
      "hadith_no": "5782",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني يحيى بن سليمان، حدثني ابن وهب، قال حدثني مالك، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الحمى من فيح جهنم فأطفئوها بالماء ‏\"‏‏.‏ قال نافع وكان عبد الله يقول اكشف عنا الرجز‏.‏",
      "text_en": " Narrated Nazi':                     `Abdullah bin `Umar said, \"The Prophet said, 'Fever is from the heat of Hell, so put it out (cool it) with water.' \" Nafi` added: `Abdullah used to say, \"O Allah! Relieve us from the punishment,\" (when he suffered from fever).",
      "chain": [
        "30220",
        "20029",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6026",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر  هو ابن محمد  عن سالم، عن أبيه، قال وعد النبي صلى الله عليه وسلم جبريل فراث عليه حتى اشتد على النبي صلى الله عليه وسلم فخرج النبي صلى الله عليه وسلم فلقيه، فشكا إليه ما وجد، فقال له ‏\"‏ إنا لا ندخل بيتا فيه صورة ولا كلب ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     Once Gabriel promised to visit the Prophet but he delayed and the Prophet got worried about that. At last he came out and found Gabriel and complained to him of his grief (for his delay). Gabriel said to him, \"We do not enter a place in which there is a picture or a dog.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6159",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة  رضى الله عنها  قالت ما رأيت النبي صلى الله عليه وسلم مستجمعا قط ضاحكا حتى أرى منه لهواته، إنما كان يتبسم‏.‏",
      "text_en": " Narrated `Aisha:                     I never saw the Prophet laughing to an extent that one could see his palate, but he always used to smile only.",
      "chain": [
        "30220",
        "20029",
        "20377",
        "20390",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "6310",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني أنس بن مالك، أنه كان ابن عشر سنين مقدم رسول الله صلى الله عليه وسلم المدينة، فخدمت رسول الله صلى الله عليه وسلم عشرا حياته، وكنت أعلم الناس بشأن الحجاب حين أنزل، وقد كان أبى بن كعب يسألني عنه، وكان أول ما نزل في مبتنى رسول الله صلى الله عليه وسلم بزينب ابنة جحش، أصبح النبي صلى الله عليه وسلم بها عروسا فدعا القوم، فأصابوا من الطعام ثم خرجوا، وبقي منهم رهط عند رسول الله صلى الله عليه وسلم فأطالوا المكث فقام رسول الله صلى الله عليه وسلم فخرج وخرجت معه كى يخرجوا، فمشى رسول الله صلى الله عليه وسلم ومشيت معه حتى جاء عتبة حجرة عائشة، ثم ظن رسول الله صلى الله عليه وسلم أنهم خرجوا فرجع ورجعت معه، حتى دخل على زينب فإذا هم جلوس لم يتفرقوا، فرجع رسول الله صلى الله عليه وسلم ورجعت معه، حتى بلغ عتبة حجرة عائشة، فظن أن قد خرجوا، فرجع ورجعت معه، فإذا هم قد خرجوا، فأنزل آية الحجاب، فضرب بيني وبينه سترا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that he was a boy of ten at the time when the Prophet emigrated to Medina. He added: I served Allah's Apostle for ten years (the last part of his life time) and I know more than the people about the occasion whereupon the order of Al-Hijab was revealed (to the Prophet). Ubai b n Ka`b used to ask me about it. It was revealed (for the first time) during the marriage of Allah's Apostle with Zainab bint Jahsh. In the morning, the Prophet was a bride-groom of her and he Invited the people, who took their meals and went away, but a group of them remained with Allah's Apostle and they prolonged their stay. Allah's Apostle got up and went out, and I too, went out along with him till he came to the lintel of `Aisha's dwelling place. Allah's Apostle thought that those people had left by then, so he returned, and I too, returned with him till he entered upon Zainab and found that they were still sitting there and had not yet gone. The Prophet went out again, and so did I with him till he reached the lintel of `Aisha's dwelling place, and then he thought that those people must have left by then, so he returned, and so did I with him, and found those people had gone. At that time the Divine Verse of Al-Hijab was revealed, and the Prophet set a screen between me and him (his family).",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "6337",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were in the company of the Prophet and he was holding the hand of `Umar bin Al-Khattab.",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "6714",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد أنه سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب فقال له عمر يا رسول الله لأنت أحب إلى من كل شىء إلا من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا والذي نفسي بيده حتى أكون أحب إليك من نفسك ‏\"‏‏.‏ فقال له عمر فإنه الآن والله لأنت أحب إلى من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الآن يا عمر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were with the Prophet and he was holding the hand of `Umar bin Al-Khattab. `Umar said to Him, \"O Allah's Apostle! You are dearer to me than everything except my own self.\" The Prophet said, \"No, by Him in Whose Hand my soul is, (you will not have complete faith) till I am dearer to you than your own self.\" Then `Umar said to him, \"However, now, by Allah, you are dearer to me than my own self.\" The Prophet said, \"Now, O `Umar, (now you are a believer).",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "6930",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت أقبل أبو بكر فلكزني لكزة شديدة وقال حبست الناس في قلادة‏.‏ فبي الموت لمكان رسول الله صلى الله عليه وسلم وقد أوجعني‏.‏ نحوه‏.‏",
      "text_en": " Narrated Aisha:                     Abu Bakr came to towards me and struck me violently with his fist and said, \"You have detained the people because of your necklace.\" But I remained motionless as if I was dead lest I should awake Allah's Apostle although that hit was very painful.",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "6935",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، أن بكيرا، حدثه قال بينما أنا جالس، عند سليمان بن يسار إذ جاء عبد الرحمن بن جابر فحدث سليمان بن يسار، ثم أقبل علينا سليمان بن يسار فقال حدثني عبد الرحمن بن جابر، أن أباه، حدثه أنه، سمع أبا بردة الأنصاري، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تجلدوا فوق عشرة أسواط إلا في حد من حدود الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda Al-Ansari:                     I heard the Prophet saying, \"Do not flog anyone more than ten stripes except if he is involved in a crime necessitating Allah's legal Punishment.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11192",
        "34"
      ]
    },
    {
      "hadith_no": "7018",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، قال حدثني عمر، أن أباه، حدثه عن عبد الله بن عمر  وذكر الحرورية  فقال قال النبي صلى الله عليه وسلم ‏\"‏ يمرقون من الإسلام مروق السهم من الرمية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Regarding Al-Harauriyya: The Prophet said, \"They will go out of Islam as an arrow darts out of the game's body.'",
      "chain": [
        "30220",
        "20029",
        "3"
      ]
    },
    {
      "hadith_no": "7477",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، عن يزيد، عن أبي الخير، سمع عبد الله بن عمرو، أن أبا بكر الصديق  رضى الله عنه  قال للنبي صلى الله عليه وسلم يا رسول الله علمني دعاء أدعو به في صلاتي‏.‏ قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا، ولا يغفر الذنوب إلا أنت، فاغفر لي من عندك مغفرة، إنك أنت الغفور الرحيم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Abu Bakr As-Siddiq said to the Prophet \"O Allah's Apostle! Teach me an invocation with which I may invoke Allah in my prayers.\" The Prophet said, \"Say: O Allah! I have wronged my soul very much (oppressed myself), and none forgives the sins but You; so please bestow Your Forgiveness upon me. No doubt, You are the Oft-Forgiving, Most Merciful.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "20304",
        "11410",
        "29"
      ]
    },
    {
      "hadith_no": "7612",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الله يقول لأهل الجنة يا أهل الجنة‏.‏ فيقولون لبيك ربنا وسعديك والخير في يديك‏.‏ فيقول هل رضيتم فيقولون وما لنا لا نرضى يا رب وقد أعطيتنا ما لم تعط أحدا من خلقك‏.‏ فيقول ألا أعطيكم أفضل من ذلك‏.‏ فيقولون يا رب وأى شىء أفضل من ذلك فيقول أحل عليكم رضواني فلا أسخط عليكم بعده أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Allah will say to the people of Paradise, \"O the people of Paradise!\" They will say, 'Labbaik, O our Lord, and Sa`daik, and all the good is in Your Hands!' Allah will say, \"Are you satisfied?' They will say, 'Why shouldn't we be satisfied, O our Lord as You have given us what You have not given to any of Your created beings?' He will say, 'Shall I not give you something better than that?' They will say, 'O our Lord! What else could be better than that?' He will say, 'I bestow My Pleasure on you and will never be angry with you after that.' \"",
      "chain": [
        "30220",
        "20029",
        "20001",
        "11163",
        "11020",
        "38"
      ]
    }
  ],
  "total_hadiths": 41
}