{
  "id": "30226",
  "name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
  "full_name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "248",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  د  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20451",
      "name": "Anbs'h bin Khalid bin Yazid عنبسة بن خالد بن يزيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38655",
      "name": "Musa bin Sahl bin Qadim موسى بن سهل بن قادم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "950",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرنا عمرو، أن محمد بن عبد الرحمن الأسدي، حدثه عن عروة، عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث، فاضطجع على الفراش وحول وجهه، ودخل أبو بكر فانتهرني وقال مزمارة الشيطان عند النبي صلى الله عليه وسلم فأقبل عليه رسول الله  عليه السلام  فقال ‏\"‏ دعهما ‏\"‏ فلما غفل غمزتهما فخرجتا‏.‏ وكان يوم عيد يلعب السودان بالدرق والحراب، فإما سألت النبي صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏‏.‏ فقلت نعم‏.‏ فأقامني وراءه خدي على خده، وهو يقول ‏\"‏ دونكم يا بني أرفدة ‏\"‏‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاذهبي ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath (a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). The Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke to me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Apostle (p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I signaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing with shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would like to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got tired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the affirmative and he told me to leave.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1046",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثني الليث، عن عقيل، عن ابن شهاب، ح وحدثني أحمد بن صالح، قال حدثنا عنبسة، قال حدثنا يونس، عن ابن شهاب، حدثني عروة، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خسفت الشمس في حياة النبي صلى الله عليه وسلم فخرج إلى المسجد فصف الناس وراءه، فكبر فاقترأ رسول الله صلى الله عليه وسلم قراءة طويلة، ثم كبر فركع ركوعا طويلا، ثم قال سمع الله لمن حمده‏.‏ فقام ولم يسجد، وقرأ قراءة طويلة، هي أدنى من القراءة الأولى، ثم كبر وركع ركوعا طويلا، وهو أدنى من الركوع الأول، ثم قال سمع الله لمن حمده، ربنا ولك الحمد‏.‏ ثم سجد، ثم قال في الركعة الآخرة مثل ذلك، فاستكمل أربع ركعات في أربع سجدات، وانجلت الشمس قبل أن ينصرف، ثم قام فأثنى على الله بما هو أهله ثم قال ‏\"‏ هما آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتموهما فافزعوا إلى الصلاة ‏\"‏‏.‏ وكان يحدث كثير بن عباس أن عبد الله بن عباس  رضى الله عنهما  كان يحدث يوم خسفت الشمس بمثل حديث عروة عن عائشة‏.‏ فقلت لعروة إن أخاك يوم خسفت بالمدينة لم يزد على ركعتين مثل الصبح‏.‏ قال أجل لأنه أخطأ السنة‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet (p.b.u.h) In the lifetime of the Prophet the sun eclipsed and he went to the Mosque and the people aligned behind him. He said the Takbir (starting the prayer) and prolonged the recitation (from the Qur'an) and then said Takbir and performed a prolonged bowing; then he (lifted his head and) said, \"Sami allahu liman hamidah\" (Allah heard him who sent his praises to Him). He then did not prostrate but stood up and recited a prolonged recitation which was shorter than the first recitation. He again said Takbir and then bowed a prolonged bowing but shorter than the first one and then said, \"Sami`a l-lahu Lyman hamidah Rabbana walak-lhamd, (Allah heard him who sent his praises to Him. O our Sustainer! All the praises are for You)\" and then prostrated and did the same in the second rak`a; thus he completed four bowing and four prostrations. The sun (eclipse) had cleared before he finished the prayer. (After the prayer) he stood up, glorified and praised Allah as He deserved and then said, \"The sun and the moon are two of the signs of Allah. They do not eclipse because of the death or the life (i.e. birth) of someone. When you see them make haste for the prayer.\" Narrated Az-Zuhri: I said to 'Ursa, \"When the sun eclipsed at Medina your brother (`Abdullah bin Az- Zubair) offered only a two-rak`at prayer like that of the morning (Fajr) prayer.\" 'Ursa replied, \"Yes, for he missed the Prophet's tradition (concerning this matter).\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، قال أيوب وسمعت حفصة بنت سيرين، قالت حدثتنا أم عطية  رضى الله عنها  أنهن جعلن رأس بنت رسول الله صلى الله عليه وسلم ثلاثة قرون نقضنه ثم غسلنه ثم جعلنه ثلاثة قرون‏.‏",
      "text_en": " Narrated Hafsa bint Seereen:                     Um 'Atiyya said that they had entwined the hair of the daughter of Allah's Apostle in three braids. They first undid her hair, washed and then entwined it in three braids.\"",
      "chain": [
        "30226",
        "20029",
        "11070",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه  رضى الله عنه  سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مهل أهل المدينة ذو الحليفة، ومهل أهل الشأم مهيعة وهي الجحفة، وأهل نجد قرن ‏\"‏‏.‏ قال ابن عمر  رضى الله عنهما  زعموا أن النبي صلى الله عليه وسلم قال ولم أسمعه ‏\"‏ ومهل أهل اليمن يلملم ‏\"‏‏.‏",
      "text_en": " Narrated Salim bin `Abdullah from his father:                     I heard Allah's Apostle saying, \"The Miqat for the people of Medina is Dhul-Hulaifa; for the people of Sham is Mahita; (i.e. Al-Juhfa); and for the people of Najd is Qarn. And said Ibn `Umar, \"They claim, but I did not hear personally, that the Prophet said, \"The Miqat for the people of Yemen is Yalamlam.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن صالح، ويحيى بن سليمان، قالا حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال طاف النبي صلى الله عليه وسلم في حجة الوداع على بعير، يستلم الركن بمحجن‏.‏ تابعه الدراوردي عن ابن أخي الزهري عن عمه‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     In his Last Hajj the Prophet performed Tawaf of the Ka`ba riding a camel and pointed a bent-headed stick towards the Corner (Black Stone).",
      "chain": [
        "30226",
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1930",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا يونس، عن ابن شهاب، عن عروة، وأبي، بكر قالت عائشة  رضى الله عنها  كان النبي صلى الله عليه وسلم يدركه الفجر ‏{‏جنبا‏}‏ في رمضان، من غير حلم فيغتسل ويصوم‏.‏",
      "text_en": " Narrated `Aisha:                     (At times) in Ramadan the Prophet used to take a bath in the morning not because of a wet dream and would continue his fast.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10511",
        "2",
        "53"
      ]
    },
    {
      "hadith_no": "3342",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "قال عبدان أخبرنا عبد الله، أخبرنا يونس، عن الزهري، ح حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال أنس كان أبو ذر  رضى الله عنه  يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقف بيتي وأنا بمكة، فنزل جبريل، ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا فأفرغها في صدري، ثم أطبقه ثم أخذ بيدي، فعرج بي إلى السماء، فلما جاء إلى السماء الدنيا، قال جبريل لخازن السماء افتح‏.‏ قال من هذا قال هذا جبريل‏.‏ قال معك أحد قال معي محمد‏.‏ قال أرسل إليه قال نعم، فافتح‏.‏ فلما علونا السماء إذا رجل عن يمينه أسودة، وعن يساره أسودة، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا يا جبريل قال هذا آدم، وهذه الأسودة عن يمينه، وعن شماله نسم بنيه، فأهل اليمين منهم أهل الجنة، والأسودة التي عن شماله أهل النار، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى، ثم عرج بي جبريل، حتى أتى السماء الثانية، فقال لخازنها افتح‏.‏ فقال له خازنها مثل ما قال الأول، ففتح ‏\"‏‏.‏ قال أنس فذكر أنه وجد في السموات إدريس وموسى وعيسى وإبراهيم، ولم يثبت لي كيف منازلهم، غير أنه قد ذكر أنه وجد آدم في السماء الدنيا، وإبراهيم في السادسة‏.‏ وقال أنس فلما مر جبريل بإدريس‏.‏ قال مرحبا بالنبي الصالح والأخ الصالح‏.‏ فقلت من هذا قال هذا إدريس، ثم مررت بموسى فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال هذا موسى‏.‏ ثم مررت بعيسى، فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال عيسى‏.‏ ثم مررت بإبراهيم، فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا قال هذا إبراهيم‏.‏ قال وأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال النبي صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع صريف الأقلام ‏\"‏‏.‏ قال ابن حزم وأنس بن مالك  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ ففرض الله على خمسين صلاة، فرجعت بذلك حتى أمر بموسى، فقال موسى ما الذي فرض على أمتك قلت فرض عليهم خمسين صلاة‏.‏ قال فراجع ربك، فإن أمتك لا تطيق ذلك‏.‏ فرجعت فراجعت ربي فوضع شطرها، فرجعت إلى موسى، فقال راجع ربك، فذكر مثله، فوضع شطرها، فرجعت إلى موسى، فأخبرته فقال راجع ربك، فإن أمتك لا تطيق ذلك، فرجعت فراجعت ربي فقال هي خمس، وهى خمسون، لا يبدل القول لدى‏.‏ فرجعت إلى موسى، فقال راجع ربك‏.‏ فقلت قد استحييت من ربي، ثم انطلق، حتى أتى السدرة المنتهى، فغشيها ألوان لا أدري ما هي، ثم أدخلت ‏{‏الجنة‏}‏ فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك ‏\"‏‏.‏",
      "text_en": " Narrated Anas (ra):                      Abu Dhar (ra) used to say that Allah's  Messenger () said, \"While I was at Makkah, the roof of my house was opened and Jibril descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith, and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the heaven. When Jibril reached the nearest heaven, he said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'who is it?' Jibril answered, 'Jibril'. He asked, 'Is there anyone with you?' Jibril replied, 'Muhammad () is with me.' He asked, 'Has he been called?', Jibril said, 'Yes'. So, the gate was opened and we went over the nearest heaven, and there we saw a man sitting with Aswida (a large number of people) of his right and Aswida on his left. When he looked towards his right, he laughed and when he looked towards his left he wept. He said (to me), 'Welcome, O pious Prophet and pious son'. I said, 'Who is this man O Jibril?' Jibril replied, 'He is Adam, and the people on his right and left are the souls of his offspring. Those on the right are the people of Paradise, and those on the left are the people of the (Hell) Fire. So, when he looks to the right, he laughs, and when he looks to the left he weeps.' Then Jibril ascended with me till he reached the second heaven and said to the gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven has said, and he opened the gate.\"Anas added: Abu Dhar mentioned that Prophet () met Idris, Musa (Moses), 'Isa (Jesus) and Ibrahim (Abraham) over the heavens, but he did not specify their places (i.e., on which heavens each of them was), but he mentioned that he (the Prophet ()) had met Adam on the nearest heaven, and Ibrahim on the sixth. Anas said, \"When Jibril and the Prophet () passed by Idris, the latter said, 'Welcome, O pious Prophet and pious brother!' the Prophet () asked, 'Who is he?' Jibril said, 'He is Idris.' \" The Prophet () added, \"Then I passed by Musa who said, 'Welcome, O pious Prophet  and pious brother!' I said, 'Who is he?' Jibril said, 'He is Musa.' Then I passed by 'Isa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' He replied, 'He is 'Isa.' Then I passed by the Prophet Ibrahim who said, 'Welcome, O pious Prophet and pious son!' I said, 'Who is he?' Jibril replied, 'He is Ibrahim'.\"Narrated Ibn 'Abbas and Abu Haiyya Al-Ansari: The Prophet () said, \"Then Jibril ascended with me to a place where I heard the creaking of pens.\" Ibn Hazm and Anas bin Malik state the Prophet () said, \"Allah enjoined fifty Salat (prayers) on me. When I returned with this order of Allah, I passed by Musa who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty Salat (prayers) on them.' On the Musa said to me, 'Go back to your Lord (and appeal for reduction), for your followers will not be able to bear it.' So, I returned to my Lord and asked for some reduction, and He reduced it to half. When I passed by Musa again and informed him about it, he once more said to me, 'Go back to your Lord, for your followers will not be able to bear it.' So, I returned to my Lord similarly as before, and half of it was reduced. I again passed by Musa and he said to me, 'Go back to your Lord, for your followers will not be able to bear it.' I again returned to my Lord and He said, 'These are five (Salat-prayers) and they are all (equal to) fifty (in reward), for My Word does not change.' I returned to Musa, he again told me to return to my Lord (for further reduction) but I said to him 'I feel shy of asking my Lord now.' Then Jibril took me till we reached Sidrat-ul-Muntaha (i.e., lote tree of utmost boundary) which was shrouded in colors indescribable. Then I was admitted into Paradise where I found small tents (made) of pearls and its earth was musk (a kind of perfume).\"",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "hadith_no": "3372",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحن أحق من إبراهيم إذ قال ‏{‏رب أرني كيف تحيي الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏ ويرحم الله لوطا، لقد كان يأوي إلى ركن شديد ولو لبثت في السجن طول ما لبث يوسف لأجبت الداعي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We are more liable to be in doubt than Abraham when he said, 'My Lord! Show me how You give life to the dead.\" . He (i.e. Allah) slid: 'Don't you believe then?' He (i.e. Abraham) said: \"Yes, but (I ask) in order to be stronger in Faith.\" (2.260) And may Allah send His Mercy on Lot! He wished to have a powerful support. If I were to stay in prison for such a long time as Joseph did I would have accepted the offer (of freedom without insisting on having my guiltless less declared).",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3937",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب  وكان قائد كعب حين عمي  قال سمعت كعب بن مالك يحدث حين تخلف عن النبي صلى الله عليه وسلم في غزوة تبوك‏.‏ بطوله، قال ابن بكير في حديثه ولقد شهدت مع النبي صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام، وما أحب أن لي بها مشهد بدر وإن كانت بدر، أذكر في الناس منها‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     Who was Ka`b's guide when Ka`b turned blind: I heard Ka`b bin Malik narrating: When he remained behind (i.e. did not Join) the Prophet in the Ghazwa of Tabuk. Ibn Bukair, in his narration stated that Ka`b said, \" I witnessed the Al-`Aqaba pledge of allegiance at night with the Prophet when we jointly agreed to support Islam with all our efforts I would not like to have attended the Badr battle instead of that 'Aqaba pledge although Badr is more well-known than it, amongst the people.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4053",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن الزهري، أخبرنا علي بن حسين، أن حسين بن علي  عليهم السلام  أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني مما أفاء الله عليه من الخمس يومئذ، فلما أردت أن أبتني بفاطمة  عليها السلام  بنت النبي صلى الله عليه وسلم واعدت رجلا صواغا في بني قينقاع أن يرتحل معي فنأتي بإذخر، فأردت أن أبيعه من الصواغين فنستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، حتى جمعت ما جمعت فإذا أنا بشارفى قد أجبت أسنمتها، وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت المنظر، قلت من فعل هذا قالوا فعله حمزة بن عبد المطلب، وهو في هذا البيت، في شرب من الأنصار، عنده قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء، فوثب حمزة إلى السيف، فأجب أسنمتهما، وبقر خواصرهما، وأخذ من أكبادهما قال علي فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، وعرف النبي صلى الله عليه وسلم الذي لقيت فقال ‏\"‏ ما لك ‏\"‏‏.‏ قلت يا رسول الله، ما رأيت كاليوم، عدا حمزة على ناقتى، فأجب أسنمتهما، وبقر خواصرهما وها هو ذا في بيت معه شرب، فدعا النبي صلى الله عليه وسلم بردائه، فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة، حتى جاء البيت الذي فيه حمزة، فاستأذن عليه فأذن له، فطفق النبي صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة ثمل محمرة عيناه، فنظر حمزة إلى النبي صلى الله عليه وسلم ثم صعد النظر، فنظر إلى ركبته، ثم صعد النظر، فنظر إلى وجهه، ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف النبي صلى الله عليه وسلم أنه ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى، فخرج وخرجنا معه‏.‏",
      "text_en": " Narrated `Ali:                     I had a she-camel which I got in my share from the booty of the battle of Badr, and the Prophet had given me another she camel from the Khumus which Allah had bestowed on him that day. And when I intended to celebrate my marriage to Fatima, the daughter of the Prophet, I made an arrangement with a goldsmith from Bani Qainuqa 'that he should go with me to bring Idhkhir (i.e. a kind of grass used by gold-smiths) which I intended to sell to gold-smiths in order to spend its price on the marriage banquet. While I was collecting ropes and sacks of pack saddles for my two she-camels which were kneeling down beside an Ansari's dwelling and after collecting what I needed, I suddenly found that the humps of the two she-camels had been cut off and their flanks had been cut open and portions of their livers had been taken out. On seeing that, I could not help weeping. I asked, \"Who has done that?\" They (i.e. the people) said, \"Hamza bin `Abdul Muttalib has done it. He is present in this house with some Ansari drinkers, a girl singer, and his friends. The singer said in her song, \"O Hamza, get at the fat she-camels!\" On hearing this, Hamza rushed to his sword and cut of the camels' humps and cut their flanks open and took out portions from their livers.\" Then I came to the Prophet, with whom Zaid bin Haritha was present. The Prophet noticed my state and asked, \"What is the matter?\" I said, \"O Allah's Apostle, I have never experienced such a day as today! Hamza attacked my two she-camels, cut off their humps and cut their flanks open, and he is still present in a house along some drinkers.\" The Prophet asked for his cloak, put it on, and proceeded, followed by Zaid bin Haritha and myself, till he reached the house where Hamza was. He asked the permission to enter, and he was permitted. The Prophet started blaming Hamza for what he had done. Hamza was drunk and his eyes were red. He looked at the Prophet then raised his eyes to look at his knees and raised his eves more to look at his face and then said, \"You are not but my father's slaves.\" When the Prophet understood that Hamza was drunk, he retreated, walking backwards went out and we left with him.",
      "chain": [
        "30349",
        "20025",
        "30226",
        "11716",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "4060",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد  هو ابن صالح  حدثنا عنبسة، حدثنا يونس، قال ابن شهاب ثم سألت الحصين بن محمد  وهو أحد بني سالم وهو من سراتهم  عن حديث، محمود بن الربيع عن عتبان بن مالك، فصدقة‏.‏",
      "text_en": " Narrated Ibn Shihab:                     I asked Al-Husain bin Muhammad who was one of the sons of Salim and one of the nobles amongst them, about the narration of Mahmud bin Ar-Rabi 'from `Itban bin Malik, and he confirmed it.",
      "chain": [
        "30226",
        "11716",
        "20475"
      ]
    },
    {
      "hadith_no": "4579",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة، وسعيد، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن أحق بالشك من إبراهيم إذ قال ‏{‏رب أرني كيف تحيي الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We have more right to be in doubt than Abraham when he said, 'My Lord! Show me how You give life to the dead.' He said, 'Do you not believe?' He said, 'Yes (I believe) but to be stronger in Faith.' \"(2.260)",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثني ابن وهب، قال أخبرني يونس، قال أحمد حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن كعب، قال أخبرني عبد الله بن كعب  وكان قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أن أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك بعض مالك، فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik talking about the Verse:-- 'And to the three (He also forgave) who remained behind.' (9.118) saying in the last portion of his talk, \"(I said), 'As a part (sign) of my repentance, I would like to give up all my property in the cause of Allah and His Apostle,' The Prophet said to me, 'Keep some of your wealth as it is good for you.\" (To the three (He also forgave) who remained behind till for them the earth, vast as it is, was straitened...\" (9.118)",
      "chain": [
        "30226",
        "20029",
        "20475",
        "30007",
        "11716",
        "20475",
        "11013",
        "1134",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4756",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبدان، حدثنا عبد الله، أخبرنا يونس، ح وحدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال ابن المسيب قال أبو هريرة أتي رسول الله صلى الله عليه وسلم ليلة أسري به بإيلياء بقدحين من خمر ولبن، فنظر إليهما فأخذ اللبن قال جبريل الحمد لله الذي هداك للفطرة، لو أخذت الخمر غوت أمتك‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle was presented with two cups one containing wine and the other milk on the night of his night journey at Jerusalem. He looked at it and took the milk. Gabriel said, \"Thanks to Allah Who guided you to the Fitra (i.e. Islam); if you had taken the wine, your followers would have gone astray.",
      "chain": [
        "30349",
        "20025",
        "20475",
        "30226",
        "11716",
        "20475",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "4757",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أبو سلمة سمعت جابر بن عبد الله  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لما كذبني قريش قمت في الحجر، فجلى الله لي بيت المقدس فطفقت أخبرهم عن آياته وأنا أنظر إليه ‏\"‏‏.‏ زاد يعقوب بن إبراهيم حدثنا ابن أخي ابن شهاب عن عمه ‏\"‏ لما كذبني قريش حين أسري بي إلى بيت المقدس ‏\"‏‏.‏ نحوه‏.‏ ‏{‏قاصفا‏}‏ ريح تقصف كل شىء‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"When the Quraish disbelieved me (concerning my night journey), I stood up in Al- Hijr (the unroofed portion of the Ka`ba) and Allah displayed Bait-ul-Maqdis before me, and I started to inform them (Quraish) about its signs while looking at it.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "5182",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "قال يحيى بن سليمان حدثنا ابن وهب، عن يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن النكاح في الجاهلية كان على أربعة أنحاء فنكاح منها نكاح الناس اليوم، يخطب الرجل إلى الرجل وليته أو ابنته، فيصدقها ثم ينكحها، ونكاح آخر كان الرجل يقول لامرأته إذا طهرت من طمثها أرسلي إلى فلان فاستبضعي منه‏.‏ ويعتزلها زوجها، ولا يمسها أبدا، حتى يتبين حملها من ذلك الرجل الذي تستبضع منه، فإذا تبين حملها أصابها زوجها إذا أحب، وإنما يفعل ذلك رغبة في نجابة الولد، فكان هذا النكاح نكاح الاستبضاع، ونكاح آخر يجتمع الرهط ما دون العشرة فيدخلون على المرأة كلهم يصيبها‏.‏ فإذا حملت ووضعت، ومر عليها ليالي بعد أن تضع حملها، أرسلت إليهم فلم يستطع رجل منهم أن يمتنع حتى يجتمعوا عندها تقول لهم قد عرفتم الذي كان من أمركم، وقد ولدت فهو ابنك يا فلان‏.‏ تسمي من أحبت باسمه، فيلحق به ولدها، لا يستطيع أن يمتنع به الرجل‏.‏ ونكاح الرابع يجتمع الناس الكثير فيدخلون على المرأة لا تمتنع ممن جاءها وهن البغايا كن ينصبن على أبوابهن رايات تكون علما فمن أرادهن دخل عليهن، فإذا حملت إحداهن ووضعت حملها جمعوا لها ودعوا لهم القافة ثم ألحقوا ولدها بالذي يرون فالتاط به، ودعي ابنه لا يمتنع من ذلك، فلما بعث محمد صلى الله عليه وسلم بالحق هدم نكاح الجاهلية كله، إلا نكاح الناس اليوم‏.‏",
      "text_en": "",
      "chain": [
        "30220",
        "20029",
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "5637",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال سمعت أبا سلمة بن عبد الرحمن، وابن المسيب، يقولان قال أبو هريرة  رضى الله عنه  إن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن، ولا يشرب الخمر حين يشربها وهو مؤمن، ولا يسرق السارق حين يسرق وهو مؤمن ‏\"‏‏.‏ قال ابن شهاب وأخبرني عبد الملك بن أبي بكر بن عبد الرحمن بن الحارث بن هشام أن أبا بكر كان يحدثه عن أبي هريرة ثم يقول كان أبو بكر يلحق معهن ‏\"‏ ولا ينتهب نهبة ذات شرف، يرفع الناس إليه أبصارهم فيها حين ينتهبها وهو مؤمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a believer; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the time of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman bin Al- Harith bin Hisham told me that Abu Bakr used to narrate that narration to him on the authority of Abu Huraira. He used to add that Abu Bakr used to mention, besides the above cases, \"And he who robs (takes illegally something by force) while the people are looking at him, is not a believer at the time he is robbing (taking).",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6435",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم فأيما مؤمن سببته فاجعل ذلك له قربة إليك يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet saying, \"O Allah! If I should ever abuse a believer, please let that be a means of bringing him near to You on the Day of Resurrection.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "6666",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن ابن المسيب، أنه كان يحدث عن أصحاب النبي، صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ يرد على الحوض رجال من أصحابي فيحلئون عنه فأقول يا رب أصحابي‏.‏ فيقول إنك لا علم لك بما أحدثوا بعدك، إنهم ارتدوا على أدبارهم القهقرى ‏\"‏‏.‏ وقال شعيب عن الزهري كان أبو هريرة يحدث عن النبي صلى الله عليه وسلم فيجلون‏.‏ وقال عقيل فيحلئون‏.‏ وقال الزبيدي عن الزهري عن محمد بن علي عن عبيد الله بن أبي رافع عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn Al-Musaiyab:                     The companions of the Prophet said, \"Some men from my companions will come to my Lake-Fount and they will be driven away from it, and I will say, 'O Lord, my companions!' It will be said, 'You have no knowledge of what they innovated after you left: they turned apostate as renegades (reverted from Islam).",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "6772",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن، عن عبد الله بن كعب بن مالك، وكان، قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏على الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أني أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     In the last part of his narration about the three who remained behind (from the battle of Tabuk). (I said) \"As a proof of my true repentance (for not joining the Holy battle of Tabuk), I shall give up all my property for the sake of Allah and His Apostle (as an expiation for that sin).\" The Prophet said (to me), \"Keep some of your wealth, for that is better for you.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "6996",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا يونس، عن ابن شهاب، عن ابن المسيب، وأبي، سلمة بن عبد الرحمن أن أبا هريرة  رضى الله عنه  قال اقتتلت امرأتان من هذيل، فرمت إحداهما الأخرى بحجر قتلتها وما في بطنها، فاختصموا إلى النبي صلى الله عليه وسلم فقضى أن دية جنينها غرة عبد أو وليدة، وقضى دية المرأة على عاقلتها‏.‏",
      "text_en": " Narrated Abu Huraira:                     Two women from Hudhail fought with each other and one of them hit the other with a stone that killed her and what was in her womb. The relatives of the killer and the relatives of the victim submitted their case to the Prophet who judged that the Diya for the fetus was a male or female slave, and the Diya for the killed woman was to be paid by the 'Asaba (near relatives) of the killer.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7446",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عطاء بن أبي رباح، عن جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل ثوما أو بصلا، فليعتزلنا أو ليعتزل مسجدنا، وليقعد في بيته ‏\"‏‏.‏ وإنه أتي ببدر  قال ابن وهب يعني طبقا  فيه خضرات من بقول، فوجد لها ريحا فسأل عنها  أخبر بما فيها من البقول  فقال قربوها فقربوها إلى بعض أصحابه كان معه، فلما رآه كره أكلها قال ‏\"‏ كل، فإني أناجي من لا تناجي ‏\"‏‏.‏ وقال ابن عفير عن ابن وهب بقدر فيه خضرات‏.‏ ولم يذكر الليث وأبو صفوان عن يونس قصة القدر، فلا أدري هو من قول الزهري أو في الحديث‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"Whoever has eaten garlic or onion, should keep away from us, or should keep away from our mosque and should stay at home.\" Ibn Wahb said, \"Once a plate full of cooked vegetables was brought to the Prophet at Badr. Detecting a bad smell from it, he asked about the dish and was informed of the kinds of vegetables in contained. He then said, \"Bring it near,\" and so it was brought near to one of his companions who was with him. When the Prophet saw it, he disliked eating it and said (to his companion), \"Eat, for I talk in secret to ones whom you do not talk to.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "7464",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد، حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا عمرو، عن ابن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة بنت عبد الرحمن وكانت في حجر عائشة زوج النبي صلى الله عليه وسلم عن عائشة أن النبي صلى الله عليه وسلم بعث رجلا على سرية، وكان يقرأ لأصحابه في صلاته فيختم ب  ‏{‏قل هو الله أحد‏}‏ فلما رجعوا ذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء يصنع ذلك ‏\"‏‏.‏ فسألوه فقال لأنها صفة الرحمن، وأنا أحب أن أقرأ بها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخبروه أن الله يحبه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet sent (an army unit) under the command of a man who used to lead his companions in the prayers and would finish his recitation with (the Sura 112): 'Say (O Muhammad): \"He is Allah, the One.\" ' (112.1) When they returned (from the battle), they mentioned that to the Prophet. He said (to them), \"Ask him why he does so.\" They asked him and he said, \"I do so because it mentions the qualities of the Beneficent and I love to recite it (in my prayer).\" The Prophet; said (to them), \"Tell him that Allah loves him.\"",
      "chain": [
        "30213",
        "30226",
        "20029",
        "20377",
        "11169",
        "10959"
      ]
    },
    {
      "hadith_no": "7471",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقبض الله الأرض يوم القيامة، ويطوي السماء بيمينه ثم يقول أنا الملك أين ملوك الأرض ‏\"‏‏.‏ وقال شعيب والزبيدي وابن مسافر وإسحاق بن يحيى عن الزهري عن أبي سلمة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"On the Day of Resurrection Allah will hold the whole earth and fold the heaven with His right hand and say, 'I am the King: where are the kings of the earth?\" '",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "7569",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وقال أحمد بن صالح حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ننزل غدا إن شاء الله بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏ يريد المحصب‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If Allah will, tomorrow we will encamp in Khaif Bani Kinana, the place where the pagans took the oath of Kufr (disbelief) against the Prophet. He meant Al-Muhassab. (See Hadith No. 659, Vol. 2)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7656",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا علي، حدثنا هشام، أخبرنا معمر، عن الزهري، ح وحدثني أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني يحيى بن عروة بن الزبير، أنه سمع عروة بن الزبير، قالت عائشة  رضى الله عنها  سأل أناس النبي صلى الله عليه وسلم عن الكهان فقال ‏\"‏ إنهم ليسوا بشىء ‏\"‏‏.‏ فقالوا يا رسول الله فإنهم يحدثون بالشىء يكون حقا‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الحق يخطفها الجني فيقرقرها في أذن وليه كقرقرة الدجاجة، فيخلطون فيه أكثر من مائة كذبة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Some people asked the Prophet regarding the soothsayers. He said, \"They are nothing.\" They said, \"O Allah's Apostle! Some of their talks come true.\" The Prophet said, \"That word which happens to be true is what a Jinn snatches away by stealth (from the Heaven) and pours it in the ears of his friend (the foreteller) with a sound like the cackling of a hen. The soothsayers then mix with that word, one hundred lies.\"",
      "chain": [
        "5",
        "11065",
        "20115",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "11545",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن عبد العزيز بن مسلم، عن أبي معقل، عن أنس بن مالك، قال رأيت رسول الله صلى الله عليه وسلم يتوضأ وعليه عمامة قطرية فأدخل يده من تحت العمامة فمسح مقدم رأسه ولم ينقض العمامة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I saw the Messenger (ﷺ) perform ablution. He had a Qutri turban. He inserted his hand beneath the turban and wiped over the forelock, and did not untie the turban.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "20253",
        "19384",
        "19"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، حدثني عباد بن زياد، أن عروة بن المغيرة بن شعبة، أخبره أنه، سمع أباه المغيرة، يقول عدل رسول الله صلى الله عليه وسلم وأنا معه في غزوة تبوك قبل الفجر فعدلت معه فأناخ النبي صلى الله عليه وسلم فتبرز ثم جاء فسكبت على يده من الإداوة فغسل كفيه ثم غسل وجهه ثم حسر عن ذراعيه فضاق كما جبته فأدخل يديه فأخرجهما من تحت الجبة فغسلهما إلى المرفق ومسح برأسه ثم توضأ على خفيه ثم ركب فأقبلنا نسير حتى نجد الناس في الصلاة قد قدموا عبد الرحمن بن عوف فصلى بهم حين كان وقت الصلاة ووجدنا عبد الرحمن وقد ركع بهم ركعة من صلاة الفجر فقام رسول الله صلى الله عليه وسلم فصف مع المسلمين فصلى وراء عبد الرحمن بن عوف الركعة الثانية ثم سلم عبد الرحمن فقام رسول الله صلى الله عليه وسلم في صلاته ‏.‏ ففزع المسلمون فأكثروا التسبيح لأنهم سبقوا النبي صلى الله عليه وسلم بالصلاة فلما سلم رسول الله صلى الله عليه وسلم قال لهم ‏\"‏ قد أصبتم ‏\"‏ ‏.‏ أو ‏\"‏ قد أحسنتم ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah reported:                      I was in the company of the Messenger of Allah (ﷺ) in the expedition of Tabuk. He abandoned the main road before the dawn prayer, and I also did the same along with him. The Prophet (ﷺ) made his camel kneel down and (went to ) relieve himself. He then came back and I poured water upon his hands from the skin-vessel. He then washed his hands and face. He tried to get his forearms out (of the gown), but the sleeves of the gown were too narrow, so he entered back both his hands, and brought them out from beneath the gown. He washed his forearms up to the elbows and wiped his head and wiped over his socks.80 He then mounted (his camel) and we began to proceed until we found people  offering the prayer. They brought forward ‘Abd al-Rahman b. ‘Awf who was leading them in prayer. The Prophet(ﷺ) stood in the row side by side with other Muslims. He performed the second rak’ah of the prayer behind ‘Abd al-Rahman b. ‘Awf. Then ‘Abd al-Rahman uttered salutation. The Prophet(ﷺ) stood to perform the remaining rak’ah of the prayer. The Muslims were alarmed. They began to utter tasbih (Subhan Allah) presuming that they had offered prayer before the Prophet (ﷺ) had done. When he uttered the salutation (i.e. finished his prayer), he said: You were right, or (he said) you did well.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10927",
        "11373"
      ]
    },
    {
      "hadith_no": "214",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن شهاب، حدثني بعض، من أرضى أن سهل بن سعد الساعدي، أخبره أن أبى بن كعب أخبره أن رسول الله صلى الله عليه وسلم إنما جعل ذلك رخصة للناس في أول الإسلام لقلة الثياب ثم أمر بالغسل ونهى عن ذلك ‏.‏ قال أبو داود يعني ‏\"‏ الماء من الماء ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b reported :                      The Messenger of Allah (May peace be upon him) made a concession in the early days of Islam on account of the paucity of clothes that one should not take a bath if one has sexual intercourse (and has no seminal emission). But later on her commanded to take a bath in such a case and prohibited its omission.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11013",
        "399",
        "39"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الماء من الماء ‏\"‏ ‏.‏ وكان أبو سلمة يفعل ذلك ‏.‏",
      "text_en": " Aba Sa’id al-Khudri reported :                      The Messenger of Allah (May peace be upon him) said : water (bath) is necessary only when there is seminal emission. And Abu Salamah followed it.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11013",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال عروة عن عائشة، أن أم سليم الأنصارية، - وهي أم أنس بن مالك - قالت يا رسول الله إن الله عز وجل لا يستحيي من الحق أرأيت المرأة إذا رأت في النوم ما يرى الرجل أتغتسل أم لا قالت عائشة فقال النبي صلى الله عليه وسلم ‏\"‏ نعم فلتغتسل إذا وجدت الماء ‏\"‏ ‏.‏ قالت عائشة فأقبلت عليها فقلت أف لك وهل ترى ذلك المرأة فأقبل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ تربت يمينك يا عائشة ومن أين يكون الشبه ‏\"‏ ‏.‏ قال أبو داود وكذلك روى عقيل والزبيدي ويونس وابن أخي الزهري عن الزهري وإبراهيم بن أبي الوزير عن مالك عن الزهري ووافق الزهري مسافع الحجبي قال عن عروة عن عائشة ‏.‏ وأما هشام بن عروة فقال عن عروة عن زينب بنت أبي سلمة عن أم سلمة أن أم سليم جاءت إلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘A’ishah reported on the authority of Umm Sulaim al-Ansariyah, who was the mother of Anas b. Malik, said:                      Messenger of Allah. Allah is not ashamed of truth what do you think, if a woman sees what a man sees in dream, should she take a bath or not? The prophet (ﷺ) replied: Yes, she should take a bath if she finds the liquid (vaginal secretion) ‘A’ishah said : Then I came upon her and said her : Woe to you! Does a woman see that (sexual dream)? In the meantime, the Messenger of Allah (ﷺ) came upon me and said: May your right hand be covered with dust! How can there be the resemblance (i.e., between the child and the mother)?Abu Dawud said: A similar version has been narrated by Zubaid, ‘Uqail, Yunus, cousin of Al-Zuhri, Ibn Abi-Wazir, on the authority of al-Zuhr, musan, al-Hajabi, like al-Zuhri, narrated on the authority of ‘Urwah from ‘A’ishah, but  Hisham b. ‘Urwah narrated from ‘Urwah on the authority of Zainab daughter of Abu Salamah from Umm Salamah saying. Umm Sulaim came to the Messenger of Allah (ﷺ).",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرتني عمرة بنت عبد الرحمن، عن أم حبيبة، بهذا الحديث قالت عائشة رضي الله عنها ‏.‏ فكانت تغتسل لكل صلاة ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain of narrators. According to this version. 'Aishah said:                      She would wash herself for every prayer.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11455",
        "59"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، حدثه عن عمار بن ياسر، أنه كان يحدث أنهم تمسحوا وهم مع رسول الله صلى الله عليه وسلم بالصعيد لصلاة الفجر فضربوا بأكفهم الصعيد ثم مسحوا وجوههم مسحة واحدة ثم عادوا فضربوا بأكفهم الصعيد مرة أخرى فمسحوا بأيديهم كلها إلى المناكب والآباط من بطون أيديهم ‏.‏",
      "text_en": " Narrated Ammar ibn Yasir:                     They (the Companions of the Prophet) wiped with pure earth (their hands and face) to offer the dawn prayer in the company of the Messenger of Allah (ﷺ). They struck the ground with their palms and wiped their faces once. Then they repeated and struck the ground with their palms once again and wiped their arms completely up to the shoulders and up to the armpits with the inner side of their hands.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11004",
        "25"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، حدثني حمزة بن عبد الله بن عمر، قال قال ابن عمر كنت أبيت في المسجد في عهد رسول الله صلى الله عليه وسلم وكنت فتى شابا عزبا وكانت الكلاب تبول وتقبل وتدبر في المسجد فلم يكونوا يرشون شيئا من ذلك ‏.‏",
      "text_en": " Ibn 'Umar said:                      I used to sleep in the mosque in the lifetime of the Messenger of Allah (ﷺ) when I was young and bachelor. The dogs would urinate frequently visit the mosque, and no one would sprinkle over it.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11818"
      ]
    },
    {
      "hadith_no": "435",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حين قفل من غزوة خيبر فسار ليلة حتى إذا أدركنا الكرى عرس وقال لبلال ‏\"‏ اكلأ لنا الليل ‏\"‏ ‏.‏ قال فغلبت بلالا عيناه وهو مستند إلى راحلته فلم يستيقظ النبي صلى الله عليه وسلم ولا بلال ولا أحد من أصحابه حتى إذا ضربتهم الشمس فكان رسول الله صلى الله عليه وسلم أولهم استيقاظا ففزع رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا بلال ‏\"‏ ‏.‏ فقال أخذ بنفسي الذي أخذ بنفسك بأبي أنت وأمي يا رسول الله فاقتادوا رواحلهم شيئا ثم توضأ النبي صلى الله عليه وسلم وأمر بلالا فأقام لهم الصلاة وصلى بهم الصبح فلما قضى الصلاة قال ‏\"‏ من نسي صلاة فليصلها إذا ذكرها فإن الله تعالى قال ‏{‏ أقم الصلاة للذكرى ‏}‏ ‏\"‏ ‏.‏ قال يونس وكان ابن شهاب يقرؤها كذلك ‏.‏ قال أحمد قال عنبسة - يعني عن يونس - في هذا الحديث لذكري ‏.‏ وقال أحمد الكرى النعاس ‏.‏",
      "text_en": " Abu Hurairah reported:                      When the Messenger of Allah (ﷺ) returned from the Battle of Khaibar, he travelled during the night. When we felt sleep, he halted for rest. Addressing Bilal he said: Keep vigilance at night for us. But Bilal who was leaning against the saddle of his mount was dominated by sleep. Neither the Prophet (ﷺ) nor Bilal nor any of his Companions could get up till the sunshine struck them. The Messenger of Allah (ﷺ) got up first of all. The Messenger of Allah (ﷺ) was embarrassed and said: O Bilal ! He replied: He who detained your soul, detained my soul, Messenger of Allah, my parents be sacrificed for you. Then they drove their mounts to a little distance. The Prophet (ﷺ) perfumed ablution and commanded Bilal who made announcement for the prayer. He (the Prophet) led them in the Fajr prayer. When he finished prayer, he said: If anyone forget saying prayer, he should observe it when he recalls it, for Allah has said (in the Qur'an): \"Establish prayer for my remembrance\". Yunus said: Ibn Shihab used to recite this verse in a similar way (i.e. instead of reciting the word li-dhikri - for the sake of My remembrance - he would recite li-dhikra - when you remember). Ahmad (one of the narrator) said: 'Anbasah (a reporter) reported on the authority of Yunus the word li-dhikri (for the sake of my remembrance). Ahmad said: The word nu'as (occurring in this tradition) means \"drowsiness\".",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "444",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباس العنبري، ح وحدثنا أحمد بن صالح، - وهذا لفظ عباس - أن عبد، الله بن يزيد حدثهم عن حيوة بن شريح عن عياش بن عباس - يعني القتباني - أن كليب بن صبح حدثهم أن الزبرقان حدثه عن عمه عمرو بن أمية الضمري قال كنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره فنام عن الصبح حتى طلعت الشمس فاستيقظ رسول الله صلى الله عليه وسلم فقال ‏\"‏ تنحوا عن هذا المكان ‏\"‏ ‏.‏ قال ثم أمر بلالا فأذن ثم توضئوا وصلوا ركعتى الفجر ثم أمر بلالا فأقام الصلاة فصلى بهم صلاة الصبح ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Umayyah ad-Damri:                     We were in the company of the Messenger of Allah (ﷺ) during one of his journeys. He overslept abandoning the morning prayer until the sun had arisen. The Messenger of Allah (ﷺ) awoke and said: Go away from this place. He then commanded Bilal to call for prayer. He called for prayer. They (the people) performed ablution and offered two rak'ahs of the morning prayer (sunnah prayer). He then commanded Bilal (to utter the iqamah, i.e. to summon the people to attend the prayer). He announced the prayer (i.e. uttered the iqamah) and he led them in the morning prayer.",
      "chain": [
        "30437",
        "30226",
        "26010",
        "10871",
        "16091",
        "4011"
      ]
    },
    {
      "hadith_no": "481",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن بكر بن سوادة الجذامي، عن صالح بن خيوان، عن أبي سهلة السائب بن خلاد، - قال أحمد - من أصحاب النبي صلى الله عليه وسلم أن رجلا أم قوما فبصق في القبلة ورسول الله صلى الله عليه وسلم ينظر فقال رسول الله صلى الله عليه وسلم حين فرغ ‏\"‏ لا يصلي لكم ‏\"‏ ‏.‏ فأراد بعد ذلك أن يصلي لهم فمنعوه وأخبروه بقول رسول الله صلى الله عليه وسلم فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ نعم ‏\"‏ ‏.‏ وحسبت أنه قال ‏\"‏ إنك آذيت الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSahlah as-Sa'ib ibn Khallad:                     A man led the people in prayer. He spat towards qiblah while the Messenger of Allah (ﷺ) was looking at him. The Messenger of Allah said to the people when he finished his prayer: He should not lead you in prayer (henceforth).  Thenceforth he intended to lead them in prayer, but they forbade him and informed him of the prohibition of the Messenger of Allah (ﷺ). He mentioned it to the Messenger of Allah (ﷺ) who said to him: Yes. The narrator said: I think he (the Prophet) said: You did harm to Allah and His Apostle.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "10849",
        "18427",
        "277"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يحيى بن أزهر، وابن، لهيعة عن الحجاج بن شداد، عن أبي صالح الغفاري، عن علي، بمعنى سليمان بن داود قال فلما خرج ‏.‏ مكان فلما برز ‏.‏",
      "text_en": " Abu Salih narrated this tradition with a different chain of transmitters to the same effect as reported by Sulaiman b. Dawud. But this version has the word KHARAJA (he went out) instead of BARAZA (proceeded).",
      "chain": [
        "30226",
        "20029",
        "20624"
      ]
    },
    {
      "hadith_no": "572",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، أخبرني يونس، عن ابن شهاب، أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أقيمت الصلاة فلا تأتوها تسعون وأتوها تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏ قال أبو داود كذا قال الزبيدي وابن أبي ذئب وإبراهيم بن سعد ومعمر وشعيب بن أبي حمزة عن الزهري ‏\"‏ وما فاتكم فأتموا ‏\"‏ ‏.‏ وقال ابن عيينة عن الزهري وحده ‏\"‏ فاقضوا ‏\"‏ ‏.‏ وقال محمد بن عمرو عن أبي سلمة عن أبي هريرة وجعفر بن ربيعة عن الأعرج عن أبي هريرة ‏\"‏ فأتموا ‏\"‏ ‏.‏ وابن مسعود عن النبي صلى الله عليه وسلم وأبو قتادة وأنس عن النبي صلى الله عليه وسلم كلهم قالوا ‏\"‏ فأتموا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      I heard the Messenger of Allah( may peace be upon him) say: When the iqamah is pronounced for prayer, do not come to it running, but come walking(slowly). You should observe tranquility. The part of the prayer you get(along with the imam) offer it, and the part you miss complete it(afterwards).Abu Dawud said: The version narrated by al-Zubaidi, Ibn Abi Dhi’b, Ibrahim b. Sa’d, Ma’mar, Shu’aib b. Abi Hamzah on the authority of al-Zuhri has the words: “the part you miss then complete it”. Ibn ‘Uyainah alone narrated from al-Zuhri the words “then offer it afterwards”. And Muhammad b. ‘Amr narrated from Abu Salamah on the authority of Abu Hurairah, and Ja’far b. Rabi’ah narrated from al-A’raj on the authority of Abu Hurairah the words “then complete it”. And Ibn Mas’ud narrated from the Prophet(ﷺ) and Abu Qatadah and Anas reported from the Prophet( may peace be upon him) the words” then complete it”.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "578",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، قال قرأت على ابن وهب قال أخبرني عمرو، عن بكير، أنه سمع عفيف بن عمرو بن المسيب، يقول حدثني رجل، من بني أسد بن خزيمة أنه سأل أبا أيوب الأنصاري فقال يصلي أحدنا في منزله الصلاة ثم يأتي المسجد وتقام الصلاة فأصلي معهم فأجد في نفسي من ذلك شيئا ‏.‏ فقال أبو أيوب سألنا عن ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ ذلك له سهم جمع ‏\"‏ ‏.‏",
      "text_en": " A man from Banu Asad b. Khuzaimah asked Abu Ayyub al-Ansari:                      if one of us prays in his house, then comes to the mosque and finds that the iqamah is being called, and if I pray along with them ( in congregation), I feel something inside about it. Abu Ayyub replied: We asked the Prophet (ﷺ) about it. He said: That is a share from the spoils received by the warriors (i.e. he will receive double the reward of the prayer).",
      "chain": [
        "30226",
        "20377",
        "11154"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة المكتوبة واجبة خلف كل مسلم برا كان أو فاجرا وإن عمل الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah(ﷺ) as saying:                      The obligatory prayer is essential behind every Muslim, pious or impious, even if he has committed a sins.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "10884",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "816",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، عن ابن أبي هلال، عن معاذ بن عبد الله الجهني، أن رجلا، من جهينة أخبره أنه سمع النبي صلى الله عليه وسلم يقرأ في الصبح ‏{‏ إذا زلزلت الأرض ‏}‏ في الركعتين كلتيهما فلا أدري أنسي رسول الله صلى الله عليه وسلم أم قرأ ذلك عمدا ‏.‏",
      "text_en": " Narrated Mu'adh ibn Abdullah al-Juhani:                     A man of Juhaynah told him that he had heard the Prophet (ﷺ) reciting \"When the earth is shaken\" (Surah 99) in both rak'ahs of the morning prayer. But I do not know whether he had forgotten, or whether he recited it on purpose.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169"
      ]
    },
    {
      "hadith_no": "831",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، وابن، لهيعة عن بكر بن سوادة، عن وفاء بن شريح الصدفي، عن سهل بن سعد الساعدي، قال خرج علينا رسول الله صلى الله عليه وسلم يوما ونحن نقترئ فقال ‏\"‏ الحمد لله كتاب الله واحد وفيكم الأحمر وفيكم الأبيض وفيكم الأسود اقرءوه قبل أن يقرأه أقوام يقيمونه كما يقوم السهم يتعجل أجره ولا يتأجله ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa’d al-Sa’idi said:                      The Messenger of Allah(ﷺ) one day came out to us while we were reciting the Qur’an. He said: Praise be to Allah. The Book of Allah is one, and among you are the red, and among you are the white and among you are the black. Recite it before there appear people who will recite it and straighten it as an arrow is straightened. They will get their reward for it in this world and will not get it in the Hereafter.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "20624",
        "10849",
        "399"
      ]
    },
    {
      "hadith_no": "873",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا معاوية بن صالح، عن عمرو بن قيس، عن عاصم بن حميد، عن عوف بن مالك الأشجعي، قال قمت مع رسول الله صلى الله عليه وسلم ليلة فقام فقرأ سورة البقرة لا يمر بآية رحمة إلا وقف فسأل ولا يمر بآية عذاب إلا وقف فتعوذ - قال - ثم ركع بقدر قيامه يقول في ركوعه ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم سجد بقدر قيامه ثم قال في سجوده مثل ذلك - ثم قام فقرأ بآل عمران ثم قرأ سورة سورة ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i:                     I stood up to pray along with the Messenger of Allah (ﷺ); he got up and recited Surat al-Baqarah (Surah 2). When he came to a verse which spoke of mercy, he stopped and made supplication, and when he came to verse which spoke of punishment, he stopped and sought refuge in Allah, then he bowed and paused as long as he stood (reciting Surah al-Baqarah), and said while bowing, \"Glory be to the Possessor of greatness, the Kingdom, grandeur and majesty.\"  :Then he prostrated himself and paused as long as he stood up and recited Surat Aal Imran (Surah 3) and then recited many surahs one after another.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "213",
        "3051"
      ]
    },
    {
      "hadith_no": "875",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، ومحمد بن سلمة، قالوا حدثنا ابن وهب، أخبرنا عمرو، - يعني ابن الحارث - عن عمارة بن غزية، عن سمى، مولى أبي بكر أنه سمع أبا صالح، ذكوان يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The nearest a servant come to his Lord is when he is prostrating himself, so make supplication often.",
      "chain": [
        "30226",
        "30485",
        "20672",
        "20029",
        "20377",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، ح حدثنا أحمد بن السرح، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، عن عمارة بن غزية، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يقول في سجوده ‏\"‏ اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره ‏\"‏ ‏.‏ زاد ابن السرح ‏\"‏ علانيته وسره ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The prophet (ﷺ) used to say when prostrating himself: “O Allah. Forgive me all my sins, small and great, first and last. “ the narrator Ibn al-sarh added: “open and secret.”",
      "chain": [
        "30226",
        "20029",
        "20029",
        "20379",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، أن أبا هريرة، قال قام رسول الله صلى الله عليه وسلم إلى الصلاة وقمنا معه فقال أعرابي في الصلاة اللهم ارحمني ومحمدا ولا ترحم معنا أحدا فلما سلم رسول الله صلى الله عليه وسلم قال للأعرابي ‏\"‏ لقد تحجرت واسعا ‏\"‏ ‏.‏ يريد رحمة الله عز وجل ‏.‏",
      "text_en": " Abu Hurairah said; The Messenger of Allah (May peace be upon him) got up for the prayer and we also stood up along with him. A Bedouin said said during prayer; O Allah, show mercy to me and to Muhammed and do not show mercy to anyone along with us. When the Messenger of Allah (May peace be upon him) uttered the salutation, he said to the Bedouin; you narrowed down a vast (thing). By this he meant the mercy of Allah.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "888",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، وابن، رافع قالا حدثنا عبد الله بن إبراهيم بن عمر بن كيسان، حدثني أبي، عن وهب بن مانوس، قال سمعت سعيد بن جبير، يقول سمعت أنس بن مالك، يقول ما صليت وراء أحد بعد رسول الله صلى الله عليه وسلم أشبه صلاة برسول الله صلى الله عليه وسلم من هذا الفتى يعني عمر بن عبد العزيز ‏.‏ قال فحزرنا في ركوعه عشر تسبيحات وفي سجوده عشر تسبيحات ‏.‏ قال أبو داود قال أحمد بن صالح قلت له مانوس أو مابوس قال أما عبد الرزاق فيقول مابوس وأما حفظي فمانوس وهذا لفظ ابن رافع ‏.‏ قال أحمد عن سعيد بن جبير عن أنس بن مالك ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I did not offer behind anyone after the Messenger of Allah (ﷺ) a prayer like the prayer offered by the Messenger of Allah (ﷺ) than this youth, i.e. Umar ibn AbdulAziz. We estimated reciting glorification ten times in his bowing, and in his prostration ten times.Abu Dawud said: Ahmad b. Salih said: I asked him ('Abd Allah) whether the name Manus is correct of Mabus. He replied: 'Abd al-Razzaq used to say Mabus, but I remember Manus (i.e. the narrator Wahb b. Manus). These are the words of Ibn Rafi'. It has also been narrated by Ahmad from Sa'id b. Jubair on the authority of Anas b. Malik.",
      "chain": [
        "30226",
        "28276",
        "11050",
        "19"
      ]
    },
    {
      "hadith_no": "909",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال سمعت أبا الأحوص، يحدثنا في مجلس سعيد بن المسيب قال قال أبو ذر قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الله عز وجل مقبلا على العبد وهو في صلاته ما لم يلتفت فإذا التفت انصرف عنه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: Allah, the Most High, continues to turn favourably towards a servant while he is engaged in prayer as long as he does not look to the side (by turning the neck), but if he does so, He turns away from him.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "23"
      ]
    },
    {
      "hadith_no": "1044",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني سليمان بن بلال، عن إبراهيم بن أبي النضر، عن أبيه، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة المرء في بيته أفضل من صلاته في مسجدي هذا إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Prophet (ﷺ) said: The prayer a man offers in his house is more excellent than his prayer in this mosque of mine except obligatory prayer.",
      "chain": [
        "30226",
        "20029",
        "20160",
        "11153",
        "49"
      ]
    }
  ],
  "total_hadiths": 178
}