{
  "id": "30234",
  "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن خالد بن جنادة",
  "full_name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن خالد بن جنادة",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "128",
      "date_gregorian": "NA",
      "date_display": [
        "128 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "191",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-'Atqi",
      "al-Masri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]"
      },
      {
        "en": "Fiqh",
        "ar": "فقه",
        "ckb": "فیقهـ"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Egypt",
        "ar": "مصر",
        "ckb": "میسر"
      }
    ],
    "tags_display": [
      {
        "en": "al-'Atqi",
        "ar": "al-'Atqi",
        "ckb": "al-'Atqi"
      },
      {
        "en": "al-Masri",
        "ar": "al-Masri",
        "ckb": "al-Masri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "22220",
      "name": "Naf' bin 'Abdur Rahman نافع بن عبد الرحمن بن أبي نعيم",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "19177",
      "name": "Yazid bin 'Abdul Malik bin al-Mughira يزيد بن عبد الملك بن المغيرة بن نوفل",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30228",
      "name": "Asbgh bin al-Frj bin Sa'id أصبغ بن الفرج بن سعيد",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30338",
      "name": "Sa'id bin 'Isa سعيد بن عيسى",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "30491",
      "name": "Muhammad bin Salmah bin محمد بن سلمة",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "36017",
      "name": "al-Harith bin Mskyn bin Muhammad الحارث بن مسكين بن محمد",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "31573",
      "name": "'Abdur Rahman bin Abi al-Ghmr عبد الرحمن بن أبي الغمر",
      "grade": "3rd Century AH",
      "grade_display": {
        "en": "3rd Century AH",
        "ar": "القرن الثالث الهجري",
        "ckb": "سەدەی سێیەمی كۆچی"
      }
    },
    {
      "id": "36056",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Hakam محمد بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30412",
      "name": "'Isa bin Hammad bin Muslim, Zaghba عيسى بن حماد بن مسلم أبو موسى زغبة",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-an-nasai-20",
      "hadith_no": "20",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، واللفظ، له عن ابن القاسم، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن رافع بن إسحاق، أنه سمع أبا أيوب الأنصاري، وهو بمصر يقول والله ما أدري كيف أصنع بهذه الكراييس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ذهب أحدكم إلى الغائط أو البول فلا يستقبل القبلة ولا يستدبرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Ishaq that he heard Abu Ayyub Al-Ansari say - when he was in Egypt:                      \"By Allah, I do not know what I should do with these Karais (toilets). The Messenger of Allah (ﷺ) said: 'When any one of you goes to defecate or urinate, let him not face toward the Qiblah, nor turn his back towards it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11151",
        "12089",
        "33"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-71",
      "hadith_no": "71",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، قال كان الرجال والنساء يتوضئون في زمان رسول الله صلى الله عليه وسلم جميعا ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"Men and women used to perform Wudu' together during the time of the Messenger of Allah (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-75",
      "hadith_no": "75",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، ح وأخبرنا سليمان بن منصور، قال أنبأنا عبد الله بن المبارك، - واللفظ له - عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله وإلى رسوله فهجرته إلى الله وإلى رسوله ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab (may Allah be pleased with him) said:                      \"The Messenger of Allah said: 'Actions are only done with intentions, and every man shall have what he intended. Thus he whose emigration was for Allah and His Messenger, his emigration was for Allah and His Messenger, and he whose emigration was to achieve some worldly benefit or to take some woman in marriage, his emigration was for that which he intended.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-97",
      "hadith_no": "97",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عمرو بن يحيى المازني، عن أبيه، أنه قال لعبد الله بن زيد بن عاصم - وكان من أصحاب النبي صلى الله عليه وسلم وهو جد عمرو بن يحيى - هل تستطيع أن تريني كيف كان رسول الله صلى الله عليه وسلم يتوضأ قال عبد الله بن زيد نعم ‏.‏ فدعا بوضوء فأفرغ على يديه فغسل يديه مرتين مرتين ثم تمضمض واستنشق ثلاثا ثم غسل وجهه ثلاثا ثم غسل يديه مرتين مرتين إلى المرفقين ثم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏",
      "text_en": " It was narrated from 'Amr bin Yahya Al-Mazini that his father said to 'Abdullah bin Zaid bin 'Asim - who was one of the Companions of the Prophet (ﷺ) and the grandfather of 'Amr bin Yahya:                      \"Can you show me how the Messenger of Allah (ﷺ) used to perform Wudu'? 'Abdullah bin Zaid said: \"Yes. He called for (water for) Wudu' and poured some onto his hand, washing each hand twice. Then he rinsed his mouth and nose three times, then he washed his face three times, then he washed each hand twice, up to the elbow. Then he wiped his head with his hands, back and forth, starting at the front of his head and moving his hands to the nape of his neck, then bringing them back to the place he started. Then he washed his feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11210",
        "11232"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-164",
      "hadith_no": "164",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هارون بن عبد الله، حدثنا معن، أنبأنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال أنبأنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، أنه سمع عروة بن الزبير، يقول دخلت على مروان بن الحكم فذكرنا ما يكون منه الوضوء فقال مروان من مس الذكر الوضوء ‏.‏ فقال عروة ما علمت ذلك ‏.‏ فقال مروان أخبرتني بسرة بنت صفوان أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا مس أحدكم ذكره فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair said:                      \"I entered upon Mawan bin Al-Hakam and we mentioned the things for which Wudu' is done. Marwan said: 'Wudu' should be done after touching the penis.' 'Urwah said: 'I did not know that.' Marwan said: 'Busrah bint Safwan told me that she heard the Messenger of Allah (ﷺ) say: \"And if any one of you touches his penis, let him do Wudu'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "10511"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-187",
      "hadith_no": "187",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر حتى إذا كانوا بالصهباء وهي من أدنى خيبر صلى العصر ثم دعا بالأزواد فلم يؤت إلا بالسويق فأمر به فثري فأكل وأكلنا ثم قام إلى المغرب فتمضمض وتمضمضنا ثم صلى ولم يتوضأ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-545",
      "hadith_no": "545",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عتبة بن عبد الله، قال قرأت على مالك بن أنس والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا عليه لاستهموا ولو يعلم الناس ما في التهجير لاستبقوا إليه ولو علموا ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"If the people knew what (virtue) there was in the call to prayer and the first row, and they not find any way to get to do that [1] other than by drawing lots, they would do that. If they knew what (virtue) there was in coming early to prayer, they would compete to be first in the Masjid. If they knew what (virtue) there was in Al-'Atamah and Subh, they would come to them even if they had to crawl.\"[1] Indicating the two mentioned items: that is the call to prayer and praying in the first row.",
      "usc_msa_ref": "",
      "chain": [
        "20342",
        "30234",
        "20001",
        "11428",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-594",
      "hadith_no": "594",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن أبي الزبير المكي، عن أبي الطفيل، عامر بن واثلة أن معاذ بن جبل، أخبره أنهم، خرجوا مع رسول الله صلى الله عليه وسلم عام تبوك فكان رسول الله صلى الله عليه وسلم يجمع بين الظهر والعصر والمغرب والعشاء فأخر الصلاة يوما ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج فصلى المغرب والعشاء ‏.‏",
      "text_en": " It was narrated from Abu At-Tufail 'Amir bin Wathilah that Mu'adh bin Jabal told him that they went out with the Messenger of Allah (ﷺ) in the year of Tabuk, and the Messenger of Allah (ﷺ) was joining Zuhr and 'Asr, and Maghrib and 'Isha'. He delayed the prayer one day then he went out and prayed Zuhr and 'Asr together, then he went in and came out again and prayed Maghrib and 'Isha'.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11263",
        "32"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-651",
      "hadith_no": "651",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال قال حدثني عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة الأنصاري المازني، عن أبيه، أنه أخبره أن أبا سعيد الخدري قال له إني أراك تحب الغنم والبادية فإذا كنت في غنمك أو باديتك فأذنت بالصلاة فارفع صوتك فإنه لا يسمع مدى صوت المؤذن جن ولا إنس ولا شىء إلا شهد له يوم القيامة ‏.‏ قال أبو سعيد سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin 'Abdur-Rahman bin Abi Sa'sa'ah Al-Ansari Al-Mazini narrated that his father told him that Abu Sa'eed Al-Khudri said to him:                      \"I see that you love sheep and the desert. When you are with your sheep or in the desert and you call the Adhan for prayer, then raise your voice, for no human, Jinn or anything else hears the voice of the Mu'adhdhin as far as it reaches, but it will bear witness for him on the Day of Resurrection.\" Abu Sa'eed said: \"I heard it from the Messenger of Allah (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-749",
      "hadith_no": "749",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم دخل الكعبة هو وأسامة بن زيد وبلال وعثمان بن طلحة الحجبي فأغلقها عليه قال عبد الله بن عمر فسألت بلالا حين خرج ماذا صنع رسول الله صلى الله عليه وسلم قال جعل عمودا عن يساره وعمودين عن يمينه وثلاثة أعمدة وراءه - وكان البيت يومئذ على ستة أعمدة - ثم صلى وجعل بينه وبين الجدار نحوا من ثلاثة أذرع ‏.‏",
      "text_en": " Narrated Abdullah bin Umar:                     It was narrated from Abdullah bin Umar that the Messenger of Allah (ﷺ) entered the Ka'bah with Usamah bin Zaid, Bilal and Uthman bin Talha  al Hajabi, and locked the door behind him. Abdullah bin Umar said: \"I asked Bilal when he came out: \" What did the Messenger of Allah (ﷺ) do?\" He said: \"He stood with one pillar to his left, two pillars to his right and three pillars behind him - at that time the House stood on six pillars - and he prayed with approximately three forearm's length between him and the wall.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-788",
      "hadith_no": "788",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح قال وحدثنا الحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع، ‏.‏ أن عتبان بن مالك، كان يؤم قومه وهو أعمى وأنه قال لرسول الله صلى الله عليه وسلم إنها تكون الظلمة والمطر والسيل وأنا رجل ضرير البصر فصل يا رسول الله في بيتي مكانا أتخذه مصلى ‏.‏ فجاء رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي لك ‏\"‏ ‏.‏ فأشار إلى مكان من البيت فصلى فيه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Mahmiid bin Ar-Rabi' that 'Itbk bin Milk used to lead his people in prayer, and he was blind. He said to theMessenger of Allah (ﷺ):                     \"Sometimes it is dark or rainy or there is a flood, and I am a blindman; 0 Messenger of Allah (ﷺ), (come and) pray in a place in my house that I may take as a prayer-place.\" He said: \"Where would you likeme to pray for you?\" He showed him a place in his house, and the Messenger of Allah (ﷺ) prayed there.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11013",
        "5278",
        "251"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-934",
      "hadith_no": "934",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أن الحارث بن هشام، سأل رسول الله صلى الله عليه وسلم كيف يأتيك الوحى فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحيانا يأتيني في مثل صلصلة الجرس وهو أشده على فيفصم عني وقد وعيت ما قال وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول ‏\"‏ ‏.‏ قالت عائشة ولقد رأيته ينزل عليه في اليوم الشديد البرد فيفصم عنه وإن جبينه ليتفصد عرقا ‏.‏",
      "text_en": " It was narrated from Aishah that:                     Al-Harith bin Hisham asked the Messenger of Allah (ﷺ): 'How does the Revelation come to you?' He said: 'Like the ringing of a bell, and this is the hardest on me. When it departs I remember what he said. And sometimes the Angel appears to me in the form of a man and speaks to me, and I remember what he said.\" Aishah said: \"I saw him when the Revelation came to him on a very cold day, and his forhead was dripping with sweat.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-937",
      "hadith_no": "937",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، - رضى الله عنه - يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان على غير ما أقرؤها عليه وكان رسول الله صلى الله عليه وسلم أقرأنيها فكدت أن أعجل عليه ثم أمهلته حتى انصرف ثم لببته بردائه فجئت به إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على غير ما أقرأتنيها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأ القراءة التي سمعته يقرأ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت إن هذا القرآن أنزل على سبعة أحرف ‏{‏ فاقرءوا ما تيسر منه ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that AbdurRahman bin Abdul-Qari said:                     \"I heard Umar bin Al-Khattab, may Allah be pleased with him, say: 'I heard Hisham bin Hakim bin Hizam reciting Surat Al-Furqan, in a way that I had not been taught, and the Messenger of Allah (ﷺ) had taught me. I was about to interrupt him (in his prayer), but I left him alone until he had finished. Then I grabbed him by his garment and brought him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, I heard this man reciting Surat Al-Furqan in a way that you did not teach me.' The Messenger of Allah (ﷺ) said to him: 'Recite.' So he recited it in the way that I had heard him recite. Then the Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then he said to me: 'Recite.' So I recited it and he said: 'It was revealed like this. This Quran has been revealed in seven different modes, so recite as much of the Quran as may be easy for you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10511",
        "3195",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1062",
      "hadith_no": "1062",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني نعيم بن عبد الله، عن علي بن يحيى الزرقي، عن أبيه، عن رفاعة بن رافع، قال كنا يوما نصلي وراء رسول الله صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قال رجل وراءه ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه ‏.‏ فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من المتكلم آنفا ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أولا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi said:                     \"We were praying behind the Messenger of Allah (ﷺ) one day and when he raised his head from bowing he said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him).' A man behind him said: 'Rabbana wa lakal-hamd, hamdan kathiran tayyiban mubarakan fih. (O our Lord, and to You be praise, much blessed and pure praise.)' When the Messenger of Allah (ﷺ) had finished, he said: \"Who is the one who spoke just now?\" The man said: 'I did, O Messenger of Allah.' The Messenger of Allah (ﷺ) said: 'I saw thirty-some angels rushing to see which of them would write it down first.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1095",
      "hadith_no": "1095",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة، عن أبي سعيد الخدري، قال بصرت عيناى رسول الله صلى الله عليه وسلم على جبينه وأنفه أثر الماء والطين من صبح ليلة إحدى وعشرين ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"My two eyes saw the traces of water and mud on the forehead and nose of the Messenger of Allah (ﷺ), from his praying Qiyam on the night of the twenty-first.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1225",
      "hadith_no": "1225",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني أيوب، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم انصرف من اثنتين فقال له ذو اليدين أقصرت الصلاة أم نسيت يا رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق ذو اليدين ‏\"‏ ‏.‏ فقال الناس نعم ‏.‏ فقام رسول الله صلى الله عليه وسلم فصلى اثنتين ثم سلم ثم كبر فسجد مثل سجوده أو أطول ثم رفع رأسه ثم سجد مثل سجوده أو أطول ثم رفع ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Messenger of Allah (ﷺ) finished praying two rak'ahs,and Dhul-Yadain said to him: \"Has the prayer been shortened or did you forget, O Messenger of Allah?\" The Messenger of Allah (ﷺ) said: \"Is Dhul-Yadain speaking the truth?\" The people said: \"Yes.\" So the Messenger of Allah (ﷺ) stood up and prayed two, then he said the takbir and prostrated as usual or longer than that. Then he raised his head, then he prostrated as usual or longer than that, then he sat up.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11015",
        "11035",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1285",
      "hadith_no": "1285",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، - وعبد الله بن زيد الذي أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله عز وجل أن نصلي عليك يا رسول الله فكيف نصلي عليك فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما علمتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud Al-Ansari siad:                     \"The Messenger of Allah (ﷺ) came to us in the Majlis of Sa'd bin 'Ubadah and Bashir bin Sa'd said to him: 'Allah has commanded us to send Salah upon you, O Messenger of Allah; so how should we send salah upon you?' The Messenger of Allah (ﷺ) remained silent until we wished that he had not asked him. Then he said: 'Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)\" And the salam is as you know.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11225",
        "402"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1294",
      "hadith_no": "1294",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك فقال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته ‏\"‏ ‏.‏ في حديث الحارث ‏\"‏ كما صليت على آل إبراهيم وبارك على محمد وأزواجه وذريته ‏\"‏ ‏.‏ قالا جميعا ‏\"‏ كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال أبو عبد الرحمن أنبأنا قتيبة بهذا الحديث مرتين ولعله أن يكون قد سقط عليه منه شطر ‏.‏",
      "text_en": " It was narrated that 'Amr bin Sulam Az-Zuraqi said:                     \"Abu Humaid As-Sa'idi told me that they said: 'O Messenger of Allah (ﷺ), how should we send salah upon you?' The Messenger of Allah (ﷺ) said: 'Say: Allahumma sali 'ala Muhammadin wa azwajihi wa dhuriyatihi ( O Allah, send salah upon Muhamad and his wives and progeny)- in the narration of Al-Harith (one of the two who narrated it)-kama salaita 'ala Ibraim wa barik 'alaMuhammad wa azwajihi wa dhuriyatti (as You sent salah upon Irahim and send blessings upon Muhammad and his wives and progeny)- both of them said that- kama barakta 'ala ali Ibrahima innaka hamidun majid (as You sent blessings upon Ibrahim, You are indeed worthy of praise, Full of glory.)\" Abu Abdur-Rahman (An-Nasa'i) said: Qutaibah informed us of this hadith two times, and perhaps he had missed a part of it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1493",
      "hadith_no": "1493",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال خسفت الشمس فصلى رسول الله صلى الله عليه وسلم والناس معه فقام قياما طويلا قرأ نحوا من سورة البقرة - قال - ثم ركع ركوعا طويلا ثم رفع فقام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم سجد ثم قام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم رفع فقام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم سجد ثم انصرف وقد تجلت الشمس فقال ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا يخسفان لموت أحد ولا لحياته فإذا رأيتم ذلك فاذكروا الله عز وجل ‏\"‏ ‏.‏ قالوا يا رسول الله رأيناك تناولت شيئا في مقامك هذا ثم رأيناك تكعكعت ‏.‏ قال ‏\"‏ إني رأيت الجنة أو أريت الجنة فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا ورأيت النار فلم أر كاليوم منظرا قط ورأيت أكثر أهلها النساء ‏\"‏ ‏.‏ قالوا لم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏ ‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير ويكفرن الإحسان لو أحسنت إلى إحداهن الدهر ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abbas said:                     \"There was an eclipse of the sun and the Messenger of Allah (ﷺ) prayed and the people with him. He stood for long time reciting something like Surah Al-Baqarah, then he raised (his head) and stood for a long time, then he raised (his head) and stood for a long time which was shorter than the first time. Then he bowed for a long time, which was shorter than the first time, then he prostrated. Then he got up and stood for a long time, which was shorter than the first time, then he bowed for a long time, which was shorter than the first time, then he raised (his head) and stood for a long time, which was shorter than the first time. Then he bowed for a long time, which was shorter than the first time, then he prostrated, then he finished (his prayer) and the sun had been clear. He said: 'The sun and the moon are two of the signs of Allah (SWT) and they do not become eclipsed for the death or birth of anyone. If you see that then remember Allah (SWT) the Mighty and Sublime.' They said: 'O Messenger of Allah (ﷺ), we saw you stretching out your hand when you were standing, then we saw you moving backward. He said: 'I saw Paradise-or it was shown to me- and I reached out to a take a bunch of its fruits. If I ha taken it you would have eaten from it for as long as this world lasts. And I saw Hell and I have never seen anything like it, and I saw that most of its inhabitants are women.' They said: \"Why, O Messenger of Allah (ﷺ)? He said: 'Because of their ingratitude.' It was said: 'Are they ungrateful to Allah?' He said: 'They are ungrateful to their husbands and they are ungrateful for kind treatment. If you are kind to one of them for a lifetime, then she sees (one) bad thing from you, she will say: I have never seen anything good from you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11163",
        "11020",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1577",
      "hadith_no": "1577",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قلت لصاحبك أنصت والإمام يخطب فقد لغوت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"If you say to your companion: 'Be quiet and listen' when the imam is delivering the Khutbah, you have engaged in idle speech.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1620",
      "hadith_no": "1620",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني مخرمة بن سليمان، عن كريب، أن عبد الله بن عباس، أخبره أنه، بات عند ميمونة أم المؤمنين - وهي خالته - فاضطجع في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل أو قبله قليلا أو بعده قليلا استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتيم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي قال عبد الله بن عباس فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاءه المؤذن فصلى ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Kuraib that 'Abdullah bin 'Abbas told him:                     He slept at the house of Maimunah the wife of the Prophet (ﷺ), who was his maternal aunt. He said: \"I laid down across the mattress an the Messenger of Allah (ﷺ) and his wife lay along it. The Prophet (ﷺ) slept until midnight, or a little before or a little after. The Prophet (ﷺ) woke up and began to rub the sleep from his face with his hand. Then he recited the last ten verses of Surah Al Imran. Then he got up and went to a water skin that was hanging up and performed wudu from it, and he performed wudu well, then he stood up and prayed.\" Abdullah bin 'Abbas said: \"I stood up and did what he had done, then I went and stood beside him. The Messenger of Allah (ﷺ) put his right hand on my neck, and took old of my right hand and tweaked it. Then he prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then he prayed witr.Then he lay down until the Mu'adhdhin came to him and he prayed two brief rak'ahs.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1648",
      "hadith_no": "1648",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني عبد الله بن يزيد، وأبو النضر، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم كان يصلي وهو جالس فيقرأ وهو جالس فإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأ وهو قائم ثم ركع ثم سجد ثم يفعل في الركعة الثانية مثل ذلك ‏.‏",
      "text_en": " It was narrated from Aishah that :                     The Prophet (ﷺ) used to pray when he was sitting. He would recite while sitting, then when there were thirty or forty verses left, he would stand up and recite while standing, then he bowed and prostrated, then he would do likewise in the second rak'ah.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "1945",
        "20390",
        "10567",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1694",
      "hadith_no": "1694",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، وعبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin 'Umar that:                     A man asked the Messenger of Allah (ﷺ) about prayer at night and the Messenger of Allah (ﷺ) said: \"Prayer at night is two by two, then if one of you fears that dawn will break, pray one rak'ah to make the total number that he prayed odd.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "11183",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1697",
      "hadith_no": "1697",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن سعيد بن أبي سعيد المقبري، عن أبي سلمة بن عبد الرحمن، أنه أخبره أنه، سأل عائشة أم المؤمنين كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان قالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا غيره على إحدى عشرة ركعة يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي ثلاثا قالت عائشة فقلت يا رسول الله أتنام قبل أن توتر قال ‏\"‏ يا عائشة إن عيني تنام ولا ينام قلبي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin Abdur-Rahman that :                     He asked Aishah, the Mother of the Believers, about how the Messenger of Allah (ﷺ) used to pray in Ramadan. She said: \"The Messenger of Allah (ﷺ) did not pray more than eleven rak'ahs during Ramadan or at any other time. He would pray four, and do not ask how beautiful or how long they were. Then he would pray four, and do not ask how beautiful or how long they were. Then he would pray three.\" Aishah said: \"I said: 'O Messenger of Allah, do you sleep before you pray witr?' He said: 'O Aishah, my eyes sleep but my heart does not.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11168",
        "10567"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1773",
      "hadith_no": "1773",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني نافع، عن عبد الله بن عمر، أن حفصة أم المؤمنين، أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن من الأذان لصلاة الصبح وبدا الصبح صلى ركعتين خفيفتين قبل أن تقام الصلاة ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Umar that Hafsah, the Mother of the Believers, told him:                     that when the Muaddhin fell silent following the call to Subh prayer and dawn had broken, he would pray two brief rak'ahs before getting up to pray.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1835",
      "hadith_no": "1835",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، ح وأنبأنا قتيبة، قال حدثنا المغيرة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله تعالى إذا أحب عبدي لقائي أحببت لقاءه وإذا كره لقائي كرهت لقاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: Allah, the Most High, said: If My slave loves to meet Me, I love to meet him, and if he hates to meet Me, I hate to meet him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "30367",
        "166",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2038",
      "hadith_no": "2038",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن علقمة بن أبي علقمة، عن أمه، أنها سمعت عائشة، تقول ‏:‏ قام رسول الله صلى الله عليه وسلم ذات ليلة فلبس ثيابه ثم خرج - قالت - فأمرت جاريتي بريرة تتبعه فتبعته حتى جاء البقيع، فوقف في أدناه ما شاء الله أن يقف، ثم انصرف فسبقته بريرة فأخبرتني، فلم أذكر له شيئا حتى أصبحت، ثم ذكرت ذلك له فقال ‏:‏ ‏\"‏ إني بعثت إلى أهل البقيع لأصلي عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Alqamah bin Abi 'Alqamah, from his mother, that she heard 'Aishah say:                     \"The Messenger of Allah got up one night and got dressed, then he went out. I told my slave girl Barirah to follow him, so she followed him until he came to Al-Baqi. Then he stood near if for as long as Allah willed that he should stand, then he left. Barirah came back before he did and told me, but I did not mention anything until morning came, then I mentioned that to him. He said: 'I was sent to the people of Al-Baqi' to pray for them.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11208",
        "19521"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2072",
      "hadith_no": "2072",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا مات أحدكم عرض على مقعده بالغداة والعشي إن كان من أهل الجنة فمن أهل الجنة وإن كان من أهل النار فمن أهل النار فيقال هذا مقعدك حتى يبعثك الله عز وجل يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah said:                     \"When one of you dies, he is shown his place morning and evening. If he is one of  the people of Paradise then he is one of the people of Paradise, and if he is one of the people of Hell. It is said: 'This is your place, until Allah, the Mighty and Sublime, raises you up on the Day of Resurrection.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2121",
      "hadith_no": "2121",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم ذكر رمضان فقال ‏\"‏ لا تصوموا حتى تروا الهلال ولا تفطروا حتى تروه فإن غم عليكم فاقدروا له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah mentioned Ramadan and said:                     \"Do not fast until you see the crescent, and do not stop fasting until you see it, and if it is obscured from you (too cloudy), then work it out.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2200",
      "hadith_no": "2200",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever spends the nights of Ramadan n prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11013",
        "10561",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2306",
      "hadith_no": "2306",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن عائشة، قالت إن حمزة قال لرسول الله صلى الله عليه وسلم يا رسول الله أصوم في السفر وكان كثير الصيام ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Hamzah said to the Messenger of Allah: 'O Messenger of Allah, should I fast while traveling?' He used to fast a great deal. The Messenger of Allah said to him: \"If you wish then fast and if you wish then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2341",
      "hadith_no": "2341",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عائشة، وحفصة، مثله لا يصوم إلا من أجمع الصيام قبل الفجر ‏.‏",
      "text_en": " Something similar was narrated from 'Aishah and Hafsah:                     \"There is no fast except for one who intends to fast before dawn.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11013",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2343",
      "hadith_no": "2343",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أنه كان يقول لا يصوم إلا من أجمع الصيام قبل الفجر ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he used to say:                     \"None should fast except the one who intended to fast before dawn.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2471",
      "hadith_no": "2471",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"The Muslim does not have to pay Sadaqah on his slave or his horse.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11183",
        "11005",
        "11204",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2474",
      "hadith_no": "2474",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة المازني، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمس أوسق من التمر صدقة وليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa 'eed Al-Khudri that the Messenger of Allah said:                      \"No Sadaqah is due on lessthan five Awsuq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadaqah is due on less than five Dhawd (head) of camels.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2503",
      "hadith_no": "2503",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر من رمضان على الناس صاعا من تمر أو صاعا من شعير على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah enjoined Zakatul-Fitr at the end of Ramadan upon the people; a Sa' of dates or a Sa' of barley, upon everyone, free or slave, male or female, of the Muslims.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2596",
      "hadith_no": "2596",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال أنبأنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن رجل، من بني أسد قال نزلت أنا وأهلي، ببقيع الغرقد فقالت لي أهلي اذهب إلى رسول الله صلى الله عليه وسلم فسله لنا شيئا نأكله ‏.‏ فذهبت إلى رسول الله صلى الله عليه وسلم فوجدت عنده رجلا يسأله ورسول الله صلى الله عليه وسلم يقول ‏\"‏ لا أجد ما أعطيك ‏\"‏ ‏.‏ فولى الرجل عنه وهو مغضب وهو يقول لعمري إنك لتعطي من شئت ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليغضب على أن لا أجد ما أعطيه من سأل منكم وله أوقية أو عدلها فقد سأل إلحافا ‏\"‏ ‏.‏ قال الأسدي فقلت للقحة لنا خير من أوقية - والأوقية أربعون درهما - فرجعت ولم أسأله فقدم على رسول الله صلى الله عليه وسلم بعد ذلك شعير وزبيب فقسم لنا منه حتى أغنانا الله عز وجل ‏.‏",
      "text_en": " It was narrated from  'Ata'bin Yasar that a man from Banu Asad said:                     \"My wife and I stopped at Baqi Al-Gharqad, and my wife said to me: 'Go to the Messenger of Allah and ask him to give us something to eat. ' So I went to the Messenger of Allah and found a man with him asking him (for something), and the Messenger of Allah was saying: 'I do not have anything to give to you.' The man turned away angrily, saying: 'You only give to those you want. 'The Messenger of Allah said: 'He is angry with me because I did not have anything to give him.  Whoever asks of you and he has an Uqiyah or its equivalent, then he has been too demanding in asking.\"' Al-Asadi said: I said: 'Our milch-camel is worth more than an Uqiyah, 'and an Uqiyah is forty Dirhams. \"So I went back and did not ask him for anything. Then the Messenger of Allah got some barley and raisins after that, and he gave us a share of them, until Allah, the Mighty and Sublime, made us independent of means.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11163",
        "11020"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2615",
      "hadith_no": "2615",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثنا مالك، عن زيد بن أسلم، عن أبيه، قال سمعت عمر، يقول حملت على فرس في سبيل الله عز وجل فأضاعه الذي كان عنده وأردت أن أبتاعه منه وظننت أنه بائعه برخص فسألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا تشتره وإن أعطاكه بدرهم فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Aslam that his father said:                     \"I heard 'Umar say: 'I gave a horse to someone to ride in the cause of Allah, the Mighty and Sublime, and the one who kept it neglected it. I wanted to buy it back from him, and I thought that he would sell it at a cheap price. I asked the Messenger for Allah about that and he said: Do not buy it, even if he gives it to you for a Dirham. The one who takes back his charity is like the dog that goes back to its own vomit. \"'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11163",
        "11416",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2641",
      "hadith_no": "2641",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن سليمان بن يسار، عن عبد الله بن عباس، قال كان الفضل بن عباس رديف رسول الله صلى الله عليه وسلم فجاءته امرأة من خثعم تستفتيه وجعل الفضل ينظر إليها وتنظر إليه وجعل رسول الله صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر فقالت يا رسول الله إن فريضة الله في الحج على عباده أدركت أبي شيخا كبيرا لا يستطيع أن يثبت على الراحلة أفأحج عنه قال ‏\"‏ نعم ‏\"‏ ‏.‏ وذلك في حجة الوداع ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas:                     \"Al-Fadl bin 'Abbas was riding behind the Messenger of Allah when a woman from Khath'am came and asked him a question. Al-Fadl started looking at her and she at him, and the Messenger of Allah turned Al-Fadl's face to the other side. She said: 'O Messenger of Allah! The command of Allah has come for His slaves to perform Hajj, but my father is an old man and cannot sit firmly in the saddle; should I perform Hajj on his behalf ?, He said: 'Yes That happened during the Farwell Pilgrimage.''(Shih)",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "11005",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2661",
      "hadith_no": "2661",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أناخ بالبطحاء التي بذي الحليفة وصلى بها ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar:                     That the Messenger of Allah stopped in the valley that is in Dhul-Hulaifah and prayed there. (sahih)",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2663",
      "hadith_no": "2663",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن أسماء بنت عميس، أنها ولدت محمد بن أبي بكر الصديق بالبيداء فذكر أبو بكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ مرها فلتغتسل ثم لتهل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma bin 'Umais that:                     she gave birth to Muhammad bin Abi Bakr As-Siddiq in Al-Baida, Abu Bakr told the Messenger of Allah about that, and he said: \"Tell her to perform Gusl then begin the Talbiyah.''",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10530",
        "10535",
        "69"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2666",
      "hadith_no": "2666",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن دينار، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بزعفران أو بورس ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah forbade the Muhrim to wear clothes dyed with saffron or Wars.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11183",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2764",
      "hadith_no": "2764",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم في حجة الوداع فأهللنا بعمرة ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان معه هدى فليهلل بالحج مع العمرة ثم لا يحل حتى يحل منهما جميعا ‏\"‏ ‏.‏ فقدمت مكة وأنا حائض فلم أطف بالبيت ولا بين الصفا والمروة فشكوت ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ انقضي رأسك وامتشطي وأهلي بالحج ودعي العمرة ‏\"‏ ‏.‏ ففعلت فلما قضيت الحج أرسلني رسول الله صلى الله عليه وسلم مع عبد الرحمن بن أبي بكر إلى التنعيم فاعتمرت قال ‏\"‏ هذه مكان عمرتك ‏\"‏ ‏.‏ فطاف الذين أهلوا بالعمرة بالبيت وبين الصفا والمروة ثم حلوا ثم طافوا طوافا آخر بعد أن رجعوا من منى لحجهم وأما الذين جمعوا الحج والعمرة فإنما طافوا طوافا واحدا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"We set out with the Messenger of Allah for the Farewell Pligrimage and we entered Ihram for 'Umrah, then the Messenger of Allah said: 'Whoever has a Hadi with him, let him enter Ihram for both Hajj and 'Umrah, then do not exit Ihram until he exits Ihram for them both.' I came to Makkah and I had my menses, so I did not circumambulate the House or (Perform Sa'i) between As-Safa and Al-Marwah. I complained about that to the Messenger of Allah and he said: 'Undo your hair, and comb it, and enter Ihram for Hajj, and leave 'Umrah.' When I had completed Hajj, the Messenger of Allah sent me with 'Abdur-Rahman bin Abi Bakr to At-Tan'im, and I performed 'Umrah. He said: 'This is the place of your 'Umrah.' Then those who had entered Ihram for 'Umar circumambulated the House and (performed Sa'i) between As-Safa and Al-Marwah. Then they exited Ihram, then they performed Tawaf again, after they came back from Mina for their Hajj. As for those who combined Hajj and 'Umrah, they only performed one Tawaf.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2781",
      "hadith_no": "2781",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، حدثني مالك، عن نافع، عن عبد الله بن عمر، عن حفصة، زوج النبي صلى الله عليه وسلم أنها قالت يا رسول الله ما شأن الناس قد حلوا بعمرة ولم تحلل أنت من عمرتك قال ‏\"‏ إني لبدت رأسي وقلدت هديي فلا أحل حتى أنحر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah, the wif3e of the Prophet, that she said:                     \"O Messenger of Allah, why is it that the people have exited Ihram for Umrah but you have not exited your Ihram for Umrah? He said: \"I have matted my hair and garlanded my Hadi, so I will not exit Ihram until I have offered the sacrifice.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2818",
      "hadith_no": "2818",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، قال أخبرني محمد بن إبراهيم بن الحارث، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، أنه أخبره عن البهزي، أن رسول الله صلى الله عليه وسلم خرج يريد مكة وهو محرم حتى إذا كانوا بالروحاء إذا حمار وحش عقير فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ دعوه فإنه يوشك أن يأتي صاحبه ‏\"‏ ‏.‏ فجاء البهزي وهو صاحبه إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله صلى الله عليه وسلم شأنكم بهذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر فقسمه بين الرفاق ثم مضى حتى إذا كان بالأثاية بين الرويثة والعرج إذا ظبى حاقف في ظل وفيه سهم فزعم أن رسول الله صلى الله عليه وسلم أمر رجلا يقف عنده لا يريبه أحد من الناس حتى يجاوزه ‏.‏",
      "text_en": " It was narrated from Al-Bahzi that:                     the Messenger of Allah set out for Makkah and was in Ihram. When they were in Ar-Rawha, they saw a wounded onager. Mention of that was made to the messenger of Allah and he said: \"Leave it, for soon its owner will come.\" Then Al-Bahzi, who was its owner, came to the Messenger of Allah, it is up to you what you want to do with this onager.\" The Messenger of Allah Commanded Abu Bakr to share it out among the company then he moved on, and when he was in Al-Uthayah, between Ar-Ruwaythah and Al-Arj, They was a gazelle sleeping in the Shade with an arrow in it. It was said that the Messenger of Allah told a man to stand by it and not let anyone disturb it until everyone had passed by.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "10573"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2851",
      "hadith_no": "2851",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الكريم بن مالك الجزري، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أنه كان مع رسول الله صلى الله عليه وسلم محرما فآذاه القمل في رأسه فأمره رسول الله صلى الله عليه وسلم أن يحلق رأسه وقال ‏\"‏ صم ثلاثة أيام أو أطعم ستة مساكين مدين مدين أو انسك شاة أى ذلك فعلت أجزأ عنك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kab bin Ujra:                     That he was with the Messenger of Allah in Ihram and he suffered an infestation of head lice. The Messenger of Allah commanded him to shave his head and told him: \"Fast for three days, or fed six poor persons two Mudds earch, or sacrifice a sheep. Whichever one of these you do will be sufficient for you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "18655",
        "11028",
        "11196",
        "4052"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2900",
      "hadith_no": "2900",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن محمد بن أبي بكر الصديق، أخبر عبد الله بن عمر، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألم ترى أن قومك حين بنوا الكعبة اقتصروا عن قواعد إبراهيم عليه السلام ‏\"‏ ‏.‏ فقلت يا رسول الله ألا تردها على قواعد إبراهيم عليه السلام قال ‏\"‏ لولا حدثان قومك بالكفر ‏\"‏ ‏.‏ فقال عبد الله بن عمر لئن كانت عائشة سمعت هذا من رسول الله صلى الله عليه وسلم ما أرى ترك استلام الركنين اللذين يليان الحجر إلا أن البيت لم يتمم على قواعد إبراهيم عليه السلام ‏.‏",
      "text_en": " It was narrated from Aishah that the Messenger of Allah said:                     \"Don't you see that when your people (re)built the Kabah, they did not build it on all the foundations laid by Ibrahim, peace be upon him?\" I said: \"O Messenger of Allah, why do you not rebuild it on the foundation of Ihrahim, peace be upon him?\" He said: \"Were it not for the fact that your people have recently left disbelief (I would have done so).\" Abdullah bin Umar said: \"Aishah heard this from the Messenger of Allah, for I see that he would not touch the two corners facing Al-Hijr because the House not built on the foundations of Ihrahim, peace be upon him?\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "11011",
        "18",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2925",
      "hadith_no": "2925",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم إني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ ب ‏{‏ الطور * وكتاب مسطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Salamah said:                     \"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2944",
      "hadith_no": "2944",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم رمل من الحجر إلى الحجر حتى انتهى إليه ثلاثة أطواف ‏.‏",
      "text_en": " It was narrated that Jabir bin Abdullah said:                     \"I saw the Messenger of Allah walking rapidly from the Stone to the Stone, until he had finished three circuits.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10898",
        "11442",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2972",
      "hadith_no": "2972",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن جعفر بن محمد، عن أبيه، عن جابر، أن رسول الله صلى الله عليه وسلم كان إذا وقف على الصفا يكبر ثلاثا ويقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏ يصنع ذلك ثلاث مرات ويدعو ويصنع على المروة مثل ذلك ‏.‏",
      "text_en": " It was narrated from Jabir that:                     when the Messenger of Allah stood on top of As-Safa, he recited the Takbir three times and said: \"La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).\"  He did three times, and supplicated, and did the same a top Al-Marwah.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10898",
        "11442",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2981",
      "hadith_no": "2981",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، رضى الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا نزل من الصفا مشى حتى إذا انصبت قدماه في بطن الوادي سعى حتى يخرج منه ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah, may Allah be pleased with him, that:                     when the Messenger of Allah came down from As-Safa he would walk until he reached the bottom of the valley, then he would hasten until he came out of it.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10898",
        "11442",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2995",
      "hadith_no": "2995",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن محمد بن عمرو بن حلحلة الدؤلي، عن محمد بن عمران الأنصاري، عن أبيه، قال عدل إلى عبد الله بن عمر وأنا نازل، تحت سرحة بطريق مكة فقال ما أنزلك تحت هذه الشجرة فقلت أنزلني ظلها ‏.‏ قال عبد الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كنت بين الأخشبين من منى ونفخ - بيده نحو المشرق - فإن هناك واديا يقال له السربة - وفي حديث الحارث يقال له السرر - به سرحة سر تحتها سبعون نبيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bn Imran Al-Ansari that his father said:                     \"Abdullah bin Umar came to me when I had stopped beneath a large tree on the way to Makkah. He said: 'Why did you stop beneath this tree?' I said: 'Because of its shade.' Abdullah said: 'The Messenger of Allah said: If you are between the two mountains of Mina - and he pointed with his hand toward the east - there is a valley there called As-Surrabah according to the narration of Al-Harith: Called As-Surar - in which there is large tree beneath which seventy prophets were born.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11220",
        "12479"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3050",
      "hadith_no": "3050",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، عن عطاء بن أبي رباح، أن مولى، لأسماء بنت أبي بكر أخبره قال جئت مع أسماء بنت أبي بكر منى بغلس فقلت لها لقد جئنا منى بغلس ‏.‏ فقالت قد كنا نصنع هذا مع من هو خير منك ‏.‏",
      "text_en": " It was narrated from Ata bin Abi Rabah that a freed slave of Asma bin Abi Bakr told him:                     \"I came with Asma bint Abi Bakr to Mina at the end of the night and I said to her: 'We have come to Mina at the end of the night.' She said: 'We sued to do this one who was better than you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11062",
        "11029"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3122",
      "hadith_no": "3122",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تكفل الله عز وجل لمن جاهد في سبيله لا يخرجه إلا الجهاد في سبيله وتصديق كلمته بأن يدخله الجنة أو يرده إلى مسكنه الذي خرج منه مع ما نال من أجر أو غنيمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Allah, the Mighty and Sublime, has guaranteed to the one who strives in His cause, only going out for Jihad in His cause, and believing in His Word, that He will admit him to Paradise, or bring him back to his home from which he emerged, with whatever he has earned of reward, or spoils of war.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3156",
      "hadith_no": "3156",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، عن سعيد بن أبي سعيد، عن عبد الله بن أبي قتادة، عن أبيه، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت إن قتلت في سبيل الله صابرا محتسبا مقبلا غير مدبر أيكفر الله عني خطاياى قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ فلما ولى الرجل ناداه رسول الله صلى الله عليه وسلم أو أمر به فنودي له فقال رسول الله صلى الله عليه وسلم ‏\"‏ كيف قلت ‏\"‏ ‏.‏ فأعاد عليه قوله فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إلا الدين كذلك قال لي جبريل عليه السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Abi Qatadah that his father said:                      \"A man came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, if I am killed in the cause of Allah with patience and seeking reward, facing the enemy and not running away, do you think that Allah will forgive my sins?' The Messenger of Allah (ﷺ) said: 'Yes.' When the man turned away, the Messenger of Allah (ﷺ) called him back and said: 'What did you say?' He repeated his question, and the Messenger of Allah (ﷺ) said: 'Yes, except debt. Jibril told me.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11168",
        "11804",
        "391"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3166",
      "hadith_no": "3166",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يضحك الله إلى رجلين يقتل أحدهما الآخر كلاهما يدخل الجنة يقاتل هذا في سبيل الله فيقتل ثم يتوب الله على القاتل فيقاتل فيستشهد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Allah laughs at two men, one of whom killed the other but they both entered Paradise. The first one fought in the cause of Allah and was killed, then Allah accepted the repentance of the one who killed him, and he fought and was martyred.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3171",
      "hadith_no": "3171",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا ذهب إلى قباء يدخل على أم حرام بنت ملحان فتطعمه وكانت أم حرام بنت ملحان تحت عبادة بن الصامت فدخل عليها رسول الله صلى الله عليه وسلم يوما فأطعمته وجلست تفلي رأسه فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله يركبون ثبج هذا البحر ملوك على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ شك إسحاق ‏.‏ فقلت يا رسول الله ادع الله أن يجعلني منهم فدعا لها رسول الله صلى الله عليه وسلم ثم نام - وقال الحارث فنام - ثم استيقظ فضحك فقلت له ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله ملوك على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ كما قال في الأول فقلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ فركبت البحر في زمان معاوية فصرعت عن دابتها حين خرجت من البحر فهلكت ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"When the Messenger of Allah (ﷺ) went to Quba' he used to come to Umm Haram bint Milhan and she would feed him. Umm Haram was married to 'Ubadah bint As-Samit. The Messenger of Allah (ﷺ entered upon her and she fed him and checked his head for lice. The Messenger of Allah (ﷺ) fell asleep, then he woke up smiling. She said: 'What is making you smile, O Messenger of Allah?' He said: 'Some people of my Ummah were shown to me, fighting in the cause of Allah and riding across the sea like kings on thrones.' I said: 'O Messenger of Allah, pray to Allah to make me one of them.' So the Messenger of Allah, pray to Allah to make me one of them.' So the Messenger of Allah (ﷺ) prayed for her then he slept again.'\" (One of narrators) Al-Harith, said (in his narration): \"He slept then he woke up smiling. I said to him: 'What is making you smile, O Messenger of Allah?' He said: 'Some people of my Ummah were shown to me, fighting in the cause of Allah and riding across the sea like kings on thrones,' as he had said the first time. I said: 'O Messenger of Allah, pray to Allah to make me one of them.' He said: 'You will be one of the first.' And she traveled by sea at the time of Mu'awiyah, then she fell from her mount when she came out of the sea and died.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11151",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3183",
      "hadith_no": "3183",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله عز وجل نودي في الجنة يا عبد الله هذا خير فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ فقال أبو بكر رضى الله عنه هل على من دعي من هذه الأبواب من ضرورة فهل يدعى أحد من هذه الأبواب كلها قال ‏\"‏ نعم وأرجو أن تكون منهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the prophet (ﷺ) said:                      \"Whoever spends on a pair (of things) in the cause of Allah will be called in Paradise: 'O slave of Allah, here is prosperity.' Whoever is one of the people of Salah, he will be called from the gate of Paradise, Whoever is one of the people of jihad, he will be called from the gate of paradise. Whoever is one of the people of charity, he will be called from the gate of Paradise. Whoever is one of the people who fast, he will be called from the gate of Ar-Rayyan.\" Abu Bakr, may Allah be pleased with him, said: \"O Messenger of Allah, no distress or need will befall the one who is called from those gates. Will there be anyone who will be called from all these gates?\" The Messenger of Allah (ﷺ) said: \"Yes, and I hope that you will be one of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10561",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3240",
      "hadith_no": "3240",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يخطب أحدكم على خطبة أخيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     It was narrated from Abu Hurairah that the Prophet said: \"None of you should propose marriage to a woman when someone else has already proposed to her.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11222",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3245",
      "hadith_no": "3245",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - عن ابن القاسم، عن مالك، عن عبد الله بن يزيد، عن أبي سلمة بن عبد الرحمن، عن فاطمة بنت قيس، أن أبا عمرو بن حفص، طلقها البتة وهو غائب فأرسل إليها وكيله بشعير فسخطته ‏.‏ فقال والله ما لك علينا من شىء ‏.‏ فجاءت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ ليس لك نفقة ‏\"‏ ‏.‏ فأمرها أن تعتد في بيت أم شريك ثم قال ‏\"‏ تلك امرأة يغشاها أصحابي فاعتدي عند ابن أم مكتوم فإنه رجل أعمى تضعين ثيابك فإذا حللت فآذنيني ‏\"‏ ‏.‏ قالت فلما حللت ذكرت له أن معاوية بن أبي سفيان وأبا جهم خطباني فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أبو جهم فلا يضع عصاه عن عاتقه وأما معاوية فصعلوك لا مال له ولكن انكحي أسامة بن زيد ‏\"‏ ‏.‏ فكرهته ثم قال ‏\"‏ انكحي أسامة بن زيد ‏\"‏ ‏.‏ فنكحته فجعل الله عز وجل فيه خيرا واغتبطت به ‏.‏",
      "text_en": " It was narrated from Fatimah bint Qais that Abu 'Amr bin Hafs issued a final divorce to her while he was absent. His deputy sent some barley to her but she did not like it. He said:                      \"By Allah, you have no rights over us.\" She went to the Messenger of Allah and told him about that, and he said: \"You have no right to maintenance.\" He told her to observe her 'Iddah in the house of Umm Sharik, then he said: \"She is a woman whose house is frequented by my Companions. Observe your 'Iddah in the house of Ibn Umm Maktum, for he is a blind man and you can take off your garment. And when your 'Iddah is over, let me know.\" She said: \"When my 'Iddah was over I told him that Mu'awiyah bin Abi Sufyan and Abu Jahm had proposed marriage to me. The Messenger of Allah said: 'As for Abu Jahm, his stick never leaves his shoulder, and as for Mu'awiyah he is a poor man who has no wealth. Rather you should marry Usamah bin Zaid.' I did not like the idea, then he said: 'Marry Usamah bin Zaid.' So I married him and Allah created a lot of good in him, and others felt jealous of my good fortune.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "1945",
        "10567",
        "224"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3275",
      "hadith_no": "3275",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن نبيه بن وهب، أن أبان بن عثمان، قال سمعت عثمان بن عفان، رضى الله عنه يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan, may Allah be pleased with him, said:                      \"The Messenger of Allah said: 'The Muhrim should not get married, or arrange a marriage for someone else, or propose marriage.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11014",
        "19965",
        "10582",
        "4"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3307",
      "hadith_no": "3307",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن أبي بكر، عن عمرة، عن عائشة، قالت كان فيما أنزل الله عز وجل - وقال الحارث فيما أنزل من القرآن - عشر رضعات معلومات يحرمن ثم نسخن بخمس معلومات فتوفي رسول الله صلى الله عليه وسلم وهي مما يقرأ من القرآن ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"One of the things that Allah, the Mighty and Sublime, revealed\" -(one of the narrators) Al-Harith said (in his narration): \"One of the things that were revealed in the Qur'an\"- \"was that ten known breast-feedings make marriage prohibited, then that was abrogated and changed to five known breast-feedings. Then the Messenger of Allah passed away when this was something that was still being recited in the Qur'an.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "11455",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3337",
      "hadith_no": "3337",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن نافع، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال مالك حدثني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الشغار والشغار أن يزوج الرجل الرجل ابنته على أن يزوجه ابنته وليس بينهما صداق ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah forbade Ash-Shighar. Ash-Shighar means when a man marries his daughter to another man, on the condition that that man marries his daughter to him, and no dowry is exchanged between them.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11014",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3351",
      "hadith_no": "3351",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - عن ابن القاسم، عن مالك، عن حميد الطويل، عن أنس بن مالك، أن عبد الرحمن بن عوف، جاء إلى النبي صلى الله عليه وسلم وبه أثر الصفرة فسأله رسول الله صلى الله عليه وسلم فأخبره أنه تزوج امرأة من الأنصار فقال رسول الله صلى الله عليه وسلم ‏\"‏ كم سقت إليها ‏\"‏ ‏.‏ قال زنة نواة من ذهب ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that 'Abdur-Rahman bin 'Awf came to the Prophet with traces of yellow perfume on him. The Messenger of Allah asked him (about that) and he told him that he had married a woman from among the Ansar. The Messenger of Allah said:                      \"How much did you give her?\" He said: \"A Nawah (five Dirhams) of gold.\" The Messenger of Allah said: \"Give a Walimah (wedding feast) even if it is with one sheep.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3366",
      "hadith_no": "3366",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - قال أنبأنا ابن القاسم، عن مالك، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم نهى عن متعة النساء يوم خيبر وعن لحوم الحمر الإنسية ‏.‏",
      "text_en": " It was narrated from 'Abdullah and Al-Hasan, the sons of Muhammad bin 'Ali, from their father, from 'Ali bin Abi Talib, that the Messenger of Allah on the Day of Khaibar forbade temporary marriage to women, and (he also forbade) the meat of tame donkeys.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3390",
      "hadith_no": "3390",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، عن نافع، عن ابن عمر، أنه طلق امرأته وهي حائض في عهد رسول الله صلى الله عليه وسلم فسأل عمر بن الخطاب رضى الله عنه رسول الله صلى الله عليه وسلم عن ذلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ مره فليراجعها ثم ليمسكها حتى تطهر ثم تحيض ثم تطهر ثم إن شاء أمسك بعد وإن شاء طلق قبل أن يمس فتلك العدة التي أمر الله عز وجل أن تطلق لها النساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he divorced his wife while she was menstruating, during the time of the Messenger of Allah. 'Umar bin Al-Khattab, may Allah be pleased with him, asked the Messenger of Allah about that, and the Messenger of Allah said:                      \"Tell him to take her back and keep her until she becomes pure, then menstruates again and becomes pure again. Then if he wishes he may keep her, or if he wishes, he may divorce her before he touches (has intercourse with) her. This is the time when Allah, the Mighty and Sublime, has stated that women may be divorced.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3402",
      "hadith_no": "3402",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني ابن شهاب، أن سهل بن سعد الساعدي، أخبره أن عويمرا العجلاني جاء إلى عاصم بن عدي فقال أرأيت يا عاصم لو أن رجلا وجد مع امرأته رجلا أيقتله فيقتلونه أم كيف يفعل سل لي يا عاصم رسول الله صلى الله عليه وسلم عن ذلك ‏.‏ فسأل عاصم رسول الله صلى الله عليه وسلم فكره رسول الله صلى الله عليه وسلم المسائل وعابها حتى كبر على عاصم ما سمع من رسول الله صلى الله عليه وسلم فلما رجع عاصم إلى أهله جاءه عويمر فقال يا عاصم ماذا قال لك رسول الله صلى الله عليه وسلم فقال عاصم لعويمر لم تأتني بخير قد كره رسول الله صلى الله عليه وسلم المسألة التي سألت عنها ‏.‏ فقال عويمر والله لا أنتهي حتى أسأل عنها رسول الله صلى الله عليه وسلم ‏.‏ فأقبل عويمر حتى أتى رسول الله صلى الله عليه وسلم وسط الناس فقال يا رسول الله أرأيت رجلا وجد مع امرأته رجلا أيقتله فتقتلونه أم كيف يفعل فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد نزل فيك وفي صاحبتك فاذهب فائت بها ‏\"‏ ‏.‏ قال سهل فتلاعنا وأنا مع الناس عند رسول الله صلى الله عليه وسلم فلما فرغ عويمر قال كذبت عليها يا رسول الله إن أمسكتها ‏.‏ فطلقها ثلاثا قبل أن يأمره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Sahl bin Sa'd As-Sa'idi narrated that 'Uwaimir Al-'Ajlani came to 'Asim bin 'Adiy and said:                      \"What do you think, O 'Asim! If a man finds another man with his wife, should he kill him, and be killed in retaliation, or what should he do? O 'Asim! Ask the Messenger of Allah about that for me.\" So 'Asim asked the Messenger of Allah about that, and the Messenger of Allah disapproved of the question, and criticized the asking of too many questions until 'Asim felt upset. When 'Asim went back to his people, 'Uwaimir came to him and said: \"O 'Asim, what did the Messenger of Allah say to you?\" 'Asim said: \"You have not brought me any good. The Messenger of Allah disapproved of the question you asked.\" 'Uwaimir said: \"By Allah, I will go and ask the Messenger of Allah.\" So he went to the Messenger of Allah and found him in the midst of the people. He said: \"O Messenger of Allah, what do you think if a man finds another man with his wife -should he kill him, and be killed in retaliation or what should he do?\" The Messenger of Allah said: \"Something has been revealed concerning you and your wife, so go and bring her here.\" Sahl said: \"So they engaged in the procedure of Li'an, and I was among the people in the presence of the Messenger of Allah. When 'Uwaimir finished he said: \"I would have been telling lies about her, O Messenger of Allah, if I keep her.\" So he divorced her thrice before the Messenger of Allah told him to do so.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11013",
        "399"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3437",
      "hadith_no": "3437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن مسلمة، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال أخبرني مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر بن الخطاب، رضى الله عنه - وفي حديث الحارث أنه سمع عمر يقول - قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab, may Allah be pleased with him, said that the Messenger of Allah said:                      \"Actions are but by intentions, and each man will have but that which he intended. Whoever emigrated for the sake of Allah and His Messenger, his emigration was for the sake of Allah and His Messenger, and whoever emigrated for the sake of some worldly gain or to marry some woman, his emigration was for that for which he emigrated.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20164",
        "20001",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3447",
      "hadith_no": "3447",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، عن ربيعة، عن القاسم بن محمد، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان في بريرة ثلاث سنن إحدى السنن أنها أعتقت فخيرت في زوجها وقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق ‏\"‏ ‏.‏ ودخل رسول الله صلى الله عليه وسلم والبرمة تفور بلحم فقرب إليه خبز وأدم من أدم البيت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألم أر برمة فيها لحم ‏\"‏ ‏.‏ فقالوا بلى يا رسول الله ذلك لحم تصدق به على بريرة وأنت لا تأكل الصدقة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو عليها صدقة وهو لنا هدية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah, the wife of the Prophet, said:                      Three Sunan were established because of Barirah. One of those Sunan was that she was set free and was given the choice concerning her husband; the Messenger of Allah said: 'Al Wala' is to the one who set the slave free;' and the Messenger of Allah entered when some meat was being cooked in a pot, but bread and some condiments were brought to him. He said: 'Do I not see a pot in which some meat is being cooked?' They said: 'Yes, O Messenger of Allah, that is meat that was given in charity to Barirah and you do not eat (food given in) charity.' The Messenger of Allah said: 'It is charity for her and a gift for us.'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11162",
        "10535"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3462",
      "hadith_no": "3462",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، أنها أخبرته عن حبيبة بنت سهل، أنها كانت تحت ثابت بن قيس بن شماس وأن رسول الله صلى الله عليه وسلم خرج إلى الصبح فوجد حبيبة بنت سهل عند بابه في الغلس فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذه ‏\"‏ ‏.‏ قالت أنا حبيبة بنت سهل يا رسول الله ‏.‏ قال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قالت لا أنا ولا ثابت بن قيس ‏.‏ لزوجها فلما جاء ثابت بن قيس قال له رسول الله صلى الله عليه وسلم ‏\"‏ هذه حبيبة بنت سهل قد ذكرت ما شاء الله أن تذكر ‏\"‏ ‏.‏ فقالت حبيبة يا رسول الله كل ما أعطاني عندي ‏.‏ فقال رسول الله صلى الله عليه وسلم لثابت ‏\"‏ خذ منها ‏\"‏ ‏.‏ فأخذ منها وجلست في أهلها ‏.‏",
      "text_en": " It was narrated from Yahya bin Sa'eed, from 'Amrah bint 'Abdur-Rahman, that she told him about Habibah bint Sahl:                      \"She was married to Thabit bin Qais bin Shammas. The Messenger of Allah went out to pray As-Subh and he found Habibah bint Sahl at his door at the end of the night. The Messenger of Allah said: 'Who is this?' She said: 'I am Habibah bint Sahl, O Messenger of Allah.' He said: 'What is the matter?' She said: 'I cannot live with Thabit bin Qais' -her husband. When Thabit bin Qais came, the Messenger of Allah said to him: 'Here is Habibah bint Sahl and she has said what Allah willed she should say.' Habibah said: 'O Messenger of Allah, everything that he gave me is with me.' The Messenger of Allah said: 'Take it from her.' So he took it from her and she stayed with her family.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11062",
        "11455",
        "1264"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3506",
      "hadith_no": "3506",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - قالا أنبأنا ابن القاسم، عن مالك، عن هشام بن عروة، عن أبيه، عن المسور بن مخرمة، أن سبيعة الأسلمية، نفست بعد وفاة زوجها بليال فجاءت رسول الله صلى الله عليه وسلم فاستأذنت أن تنكح فأذن لها فنكحت ‏.‏",
      "text_en": " It was narrated from Al-Miswar bin Makhramah that Subai'ah Al-Aslamiyyah gave birth one day after her husband died. She came to the Messenger of Allah and asked his permission to marry, and he gave her permission to marry and she married.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11065",
        "10511",
        "2201"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3510",
      "hadith_no": "3510",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - قال أنبأنا ابن القاسم، عن مالك، عن عبد ربه بن سعيد، عن أبي سلمة، قال سئل ابن عباس وأبو هريرة عن المتوفى، عنها زوجها وهي حامل قال ابن عباس آخر الأجلين ‏.‏ وقال أبو هريرة إذا ولدت فقد حلت ‏.‏ فدخل أبو سلمة إلى أم سلمة فسألها عن ذلك، فقالت ولدت سبيعة الأسلمية بعد وفاة زوجها بنصف شهر فخطبها رجلان أحدهما شاب والآخر كهل فحطت إلى الشاب فقال الكهل لم تحلل ‏.‏ وكان أهلها غيبا فرجا إذا جاء أهلها أن يؤثروه بها فجاءت رسول الله صلى الله عليه وسلم فقال ‏\"‏ قد حللت فانكحي من شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                      \"Ibn 'Abbas and Abu Hurairah were asked about the woman whose husband dies when she is pregnant. Ibn 'Abbas said: '(She should wait) for the longer of the two periods.' Abu Hurairah said: 'When she gives birth it becomes permissible for her to marry.' Abu Salamah went to Umm Salamah and asked her about that, and she said: 'Subai'ah Al-Aslamiyyah gave birth half a month after her husband died, and two men proposed to her. One was young and one was old, and she was inclined toward the young one. So the old one said: It is not permissible for you to marry. Her family was not there, and he hoped that if he went to her family they would marry her to him. She went to the Messenger of Allah and he said: It is permissible for you to marry, so marry whomever you want.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11191",
        "10567"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3514",
      "hadith_no": "3514",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، عن ابن القاسم، عن مالك، عن يحيى بن سعيد، عن سليمان بن يسار، أن عبد الله بن عباس، وأبا، سلمة بن عبد الرحمن اختلفا في المرأة تنفس بعد وفاة زوجها بليال فقال عبد الله بن عباس آخر الأجلين ‏.‏ وقال أبو سلمة إذا نفست فقد حلت ‏.‏ فجاء أبو هريرة فقال أنا مع ابن أخي ‏.‏ يعني أبا سلمة بن عبد الرحمن ‏.‏ فبعثوا كريبا مولى ابن عباس إلى أم سلمة يسألها عن ذلك فجاءهم فأخبرهم أنها قالت ولدت سبيعة بعد وفاة زوجها بليال فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ قد حللت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Yasar that 'Abdullah bin 'Abbas and Abu Salamah bin 'Abdur-Rahman disagreed concerning a woman who gave birth one day after her husband died. 'Abdullah bin 'Abbas said:                      \"(She should wait) for the longer of the two periods.\" Abu Salamah said: \"When she has given birth, it becomes permissible for her to remarry.\" Abu Hurairah came and said: \"I agree with my brother's son\" -meaning Abu Salamah bin 'Abdur-Rahman. They sent Kuraib, the freed slave of Ibn 'Abbas, to Umm Salamah to ask her about that. He came back to them and told them that she said: \"Subai'ah gave birth one day after her husband died;\" she mentioned that to the Messenger of Allah and he said: \"It has become permissible for you to marry.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11062",
        "11005",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3533",
      "hadith_no": "3533",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - قال أنبأنا ابن القاسم، عن مالك، عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب فدعت أم حبيبة بطيب فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid bin Nafi' that Zainab bint Abi Salamah told him these three Hadiths. Zainab said:                      \"I entered upon Umm Habibah, the wife of the Prophet, when her father Abu Sufyan bin Harb died. Umm Habibah called for some perfume and put some on a young girl, then she put some on her cheeks. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3563",
      "hadith_no": "3563",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخيل لرجل أجر ولرجل ستر وعلى رجل وزر فأما الذي هي له أجر فرجل ربطها في سبيل الله فأطال لها في مرج أو روضة فما أصابت في طيلها ذلك في المرج أو الروضة كان له حسنات ولو أنها قطعت طيلها ذلك فاستنت شرفا أو شرفين كانت آثارها ‏\"‏ ‏.‏ وفي حديث الحارث ‏\"‏ وأرواثها حسنات له ولو أنها مرت بنهر فشربت منه ولم يرد أن تسقى كان ذلك حسنات فهي له أجر ورجل ربطها تغنيا وتعففا ولم ينس حق الله عز وجل في رقابها ولا ظهورها فهي لذلك ستر ورجل ربطها فخرا ورياء ونواء لأهل الإسلام فهي على ذلك وزر ‏\"‏ ‏.‏ وسئل النبي صلى الله عليه وسلم عن الحمير فقال ‏\"‏ لم ينزل على فيها شىء إلا هذه الآية الجامعة الفاذة ‏{‏ فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"Horses may bring reward to a man, or they may be a means of protection, or they may be a burden (of sin). As for that which brings reward, it is a man who keeps it for the cause of Allah and ties it with a long rope in a pasture or a garden; whatever it eats or drinks in that pasture or garden will count as good deeds for him. If it breaks its rope and jumps over one or two hills, its footsteps\" -and according to the Hadith of Al-Harith, \"its dung will count as good deeds for him. If it passes by a river and drinks from it, even though (its owner) did not intend to give it water from that river, that will also bring him reward. If a man keeps a horse in order to earn an independent living and avoid asking others for help, and he does not forget his duty toward Allah with regard to their (the horses') necks and backs, then they will be a means of protection for him. If a man keeps horses out of pride, to show off before others and to fight the Muslims, then that will be a burden (of sin) for him.\" The Prophet was asked about donkeys and he said: \"Nothing has been revealed to me concerning them except this Verse which is comprehensive in meaning: 'So whosoever does good equal to the weight of an atom (or a small ant) shall see it. And whosoever does evil equal to the weight of an atom (or a small ant) shall see it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11163",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3569",
      "hadith_no": "3569",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثنا مالك، عن ابن شهاب، عن حمزة، وسالم، ابنى عبد الله بن عمر عن عبد الله بن عمر، رضى الله عنهما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشؤم في الدار والمرأة والفرس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said:                      \"Omens are in houses, women and horses.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11013",
        "11011",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3584",
      "hadith_no": "3584",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم سابق بين الخيل التي قد أضمرت من الحفياء وكان أمدها ثنية الوداع وسابق بين الخيل التي لم تضمر من الثنية إلى مسجد بني زريق وأن عبد الله كان ممن سابق بها ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah organized a race for horses that had been made lean, from Al-Hafya' and its finish line was Thaniyyat Al-Wada', and he organized another race for horses that had not been made lean, from Ath-Thaniyyah to the Masjid of Banu Zuraiq, and 'Abdullah was among those who took part in the race.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3616",
      "hadith_no": "3616",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما حق امرئ مسلم له شىء يوصى فيه يبيت ليلتين إلا ووصيته مكتوبة عنده ‏\"‏‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah said:                      \"It is not befitting for a Muslim who has anything concerning which a will should be made, to abide for two nights without having a written will with him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3649",
      "hadith_no": "3649",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أن رجلا، قال لرسول الله صلى الله عليه وسلم إن أمي افتلتت نفسها وإنها لو تكلمت تصدقت أفأتصدق عنها فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏‏.‏ فتصدق عنها‏.‏",
      "text_en": " It was narrated from 'Aishah that a man said to the Messenger of Allah:                      \"My mother died unexpectedly; if she had been able to speak she would have given charity. Should I give charity on her behalf?\" The Messenger of Allah said: \"Yes.\" So he gave charity on her behalf.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3650",
      "hadith_no": "3650",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أنبأنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن سعيد بن عمرو بن شرحبيل بن سعيد بن سعد بن عبادة، عن أبيه، عن جده، قال خرج سعد بن عبادة مع النبي صلى الله عليه وسلم في بعض مغازيه وحضرت أمه الوفاة بالمدينة فقيل لها أوصي‏.‏ فقالت فيم أوصي المال مال سعد‏.‏ فتوفيت قبل أن يقدم سعد فلما قدم سعد ذكر ذلك له فقال يا رسول الله هل ينفعها أن أتصدق عنها فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏‏.‏ فقال سعد حائط كذا وكذا صدقة عنها لحائط سماه‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Amr bin Shurahbil bin Sa'eed bin Sa'd bin 'Ubadah, from his father, that his grandfather said:                      \"Sa'd bin 'Ubadah went out with the Prophet on one of his campaigns, and death came to his mother in Al-Madinah. It was said to her (as she was dying): 'Make a will.' She said: 'To whom shall I make a will? The wealth belongs to Sa'd.' Then she died before Sa'd came. When Sa'd came, he was told about that and he said: 'O Messenger of Allah, will it benefit her if I give in charity on her behalf?' The Prophet said: 'Yes.' Sa'd said: 'Such and such a garden is given in charity on her behalf' -regarding a garden that he named.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11509",
        "10602"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3673",
      "hadith_no": "3673",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، ومحمد بن النعمان، يحدثانه عن النعمان بن بشير، أن أباه، أتى به رسول الله صلى الله عليه وسلم فقال إني نحلت ابني غلاما كان لي فقال رسول الله ‏\"‏ أكل ولدك نحلته ‏\"‏ ‏.‏ قال لا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فارجعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that his father brought him to the Messenger of Allah and said:                      \"I have given my son a slave of mine as a present.\" The Messenger of Allah said: \"Have you given a present to all of your children?\" He said: \"No.\" The Messenger of Allah said: \"Then take (your present) back.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10561",
        "274"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3745",
      "hadith_no": "3745",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن ابن شهاب، عن أبي سلمة، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما رجل أعمر عمرى له ولعقبه فإنها للذي يعطاها لا ترجع إلى الذي أعطاها لأنه أعطى عطاء وقعت فيه المواريث ‏\"‏ ‏.‏",
      "text_en": " Malik narrated from Ibn Shihab, from Abu Salamah, from Jabir that the Messenger of Allah said:                      \"Any man who is given a gift on the basis of 'Umra, it belongs to him and to his descendants. It belongs to the one to whom he gave it, and it cannot be taken back by the one who gave it, because he has given a gift, and it comes to the heirs of the one to whom it was given.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10567",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3827",
      "hadith_no": "3827",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ثور بن زيد، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، قال كنا مع رسول الله صلى الله عليه وسلم عام خيبر فلم نغنم إلا الأموال والمتاع والثياب فأهدى رجل من بني الضبيب يقال له رفاعة بن زيد لرسول الله صلى الله عليه وسلم غلاما أسود يقال له مدعم فوجه رسول الله صلى الله عليه وسلم إلى وادي القرى حتى إذا كنا بوادي القرى بينا مدعم يحط رحل رسول الله صلى الله عليه وسلم فجاءه سهم فأصابه فقتله فقال الناس هنيئا لك الجنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفسي بيده إن الشملة التي أخذها يوم خيبر من المغانم لتشتعل عليه نارا ‏\"‏ ‏.‏ فلما سمع الناس بذلك جاء رجل بشراك أو بشراكين إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك أو شراكان من نار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"We were with the Messenger of Allah in the year of Khaibar, and we did not get any spoils of war except for wealth, goods and clothes. Then a man from Banu Ad-Dubaib, who was called Rifa'ah bin Zaid, gave the Messenger of Allah a black slave who was called Mid'am. The Messenger of Allah set out for Wadi Al-Qura. When we were in Wadi Al-Qura, while Mid'am was unloading the luggage of the Messenger of Allah, an arrow came and killed him. The people said: 'Congratulations! You will go to Paradise,' but the Messenger of Allah said: 'No, by the One in Whose hand is my soul! The cloak that he took from the spoils of war on the Day of Khaibar is burning him with fire.' When the people heard that, a man brought one or two shoelaces to the Messenger of Allah and the Messenger of Allah said: 'One or two shoelaces of fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11155",
        "11165",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3893",
      "hadith_no": "3893",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة‏.‏‏ ورواه محمد بن عبد الرحمن بن لبيبة عن سعيد بن المسيب فقال عن سعد بن أبي وقاص‏.‏‏",
      "text_en": " It was narrated from Sa'eed bin Al-Musayyab that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11013",
        "11002"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4151",
      "hadith_no": "4151",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، قال أخبرني عبادة بن الوليد بن عبادة، قال حدثني أبي، عن عبادة، قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في اليسر والعسر والمنشط والمكره وأن لا ننازع الأمر أهله وأن نقول - أو نقوم - بالحق حيثما كنا لا نخاف لومة لائم ‏.‏",
      "text_en": " It was narrated that 'Ubadah said:                     \"We pledged to the Messenger of Allah to hear and obey both in times of hardship and ease, when we felt energetic and when we felt tired, that we would   not contend with the orders of whomever was entrusted with it, that we would speak the truth or stand firm in the way of truth wherever we may be, and that we would not fear the blame of the blamers.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "12201",
        "631"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4235",
      "hadith_no": "4235",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، قال مر رسول الله صلى الله عليه وسلم بشاة ميتة كان أعطاها مولاة لميمونة زوج النبي صلى الله عليه وسلم فقال ‏\"‏ هلا انتفعتم بجلدها ‏\"‏ ‏.‏ قالوا يا رسول الله إنها ميتة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما حرم أكلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah passed by a dead sheep that he had given to a freed slave woman of Maimunah, the wife of the Prophet. He said: 'Why don't you make use of its hide?' They said: 'O Messenger of Allah, it is dead meat.' The Messenger of Allah said: 'It is only forbidden to eat it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4252",
      "hadith_no": "4252",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بشر بن عمر، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن يزيد بن عبد الله بن قسيط، عن محمد بن عبد الرحمن، عن أمه، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر أن يستمتع بجلود الميتة إذا دبغت ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     the Messenger of Allah ordered that the hides of dead animals be made use of if they had been tanned. (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20211",
        "20001",
        "36017",
        "30234",
        "20001",
        "11236",
        "11105",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4419",
      "hadith_no": "4419",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نحر بعض بدنه بيده ونحر بعضها غيره ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     the Messenger of Allah slaughtered some of his sacrificial animals with his won hand, and someone else slaughtered some of them. (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10898",
        "11442",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4426",
      "hadith_no": "4426",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن أبي الزبير، عن جابر بن عبد الله، أنه أخبره أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الضحايا بعد ثلاث ثم قال ‏\"‏ كلوا وتزودوا وادخروا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     the Messenger of Allah forbade eating the meat of the sacrificial animals after three days then he said: \"Eat, take some with you (if traveling). And store some.\" ( Sahih)",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11263",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4465",
      "hadith_no": "4465",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ المتبايعان كل واحد منهما بالخيار على صاحبه ما لم يفترقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Malik, from Nafi from'Abdullah bin 'Umar that the Messenger of Allah said:                     \"The two parties to a transaction both have the choice so long as they both chosen to conclude the transaction.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4509",
      "hadith_no": "4509",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن محمد بن يحيى بن حبان، وأبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن الملامسة والمنابذة ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah forbade Mulamash and Munabadha.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11222",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4526",
      "hadith_no": "4526",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمار حتى تزهي ‏.‏ قيل يا رسول الله وما تزهي قال ‏\"‏ حتى تحمر ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت إن منع الله الثمرة فبم يأخذ أحدكم مال أخيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     the Messenger of Allah forbade selling fruits before they ripen. It was said: \"O Messenger of Allah what does ripen mean?\" he said: 'when they turn red.\" And the Messenger of Allah said: \"What do you think if Allah withholds the fruits (causes it not to ripen), why would any one of you take his brother's wealth?\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4553",
      "hadith_no": "4553",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد المجيد بن سهيل، عن سعيد بن المسيب، عن أبي سعيد الخدري، وعن أبي هريرة، أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر فجاء بتمر جنيب فقال رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏ ‏.‏ قال لا والله يا رسول الله إنا لنأخذ الصاع من هذا بصاعين والصاعين بالثلاث ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعل بع الجمع بالدراهم ثم ابتع بالدراهم جنيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al'Khudri and Abu Hurairah that:                     the Messenger of Allah appointed a man in charge of kharibar and he brought some Janib dates. The messenger of Allah said; \"Are all the dates if khaibar like this?\" He said: \"No (by Allah, O Messenger of Allah) we take a Sa of these for two for three Sas (of other types of  dates).\" The messenger of Allah said: \"do not do that Sell the mixed dates for Dirhams then buy the Janib dates with the Dirhams\" ,\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11705",
        "11002",
        "38",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4595",
      "hadith_no": "4595",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبعه حتى يستوفيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: 'Whoever buys food, let him not sell it until he has taken possession of it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4596",
      "hadith_no": "4596",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said:                     \"Whoever buys food let him not sell it until he has taken possession of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11183",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4605",
      "hadith_no": "4605",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، عن عبد الله بن عمر، قال كنا في زمان رسول الله صلى الله عليه وسلم نبتاع الطعام فيبعث علينا من يأمرنا بانتقاله من المكان الذي ابتعنا فيه إلى مكان سواه قبل أن نبيعه ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                     \"During the time the Messenger of Allah we used to buy food, and he sent someone to tell us to remove it from the place where we had bought it, to another place, b before selling\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4625",
      "hadith_no": "4625",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم نهى عن بيع حبل الحبلة وكان بيعا يتبايعه أهل الجاهلية كان الرجل يبتاع جزورا إلى أن تنتج الناقة ثم تنتج التي في بطنها ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah forbade selling the offspring of the offspring of a pregnant animal (Habal Al-Habalah), which was a transaction practiced by the people of the Jahiliyyah, whereby a man would buy camel to slaughter, but he would wait until the she-camel had produced offspring and the offspring in her belly had then produced offspring.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4691",
      "hadith_no": "4691",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، واللفظ، له عن ابن القاسم، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مطل الغني ظلم وإذا أتبع أحدكم على مليء فليتبع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Wrongdoing is when a rich man takes a long time to repay a debt, and if one of you is referred to a rich man (to help repay debt), he should accept that referral.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4711",
      "hadith_no": "4711",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، قال حدثني مالك، عن أبي ليلى بن عبد الله بن عبد الرحمن بن سهل، عن سهل بن أبي حثمة، أنه أخبره ورجال، من كبراء قومه أن عبد، الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في فقير أو عين فأتى يهود وقال أنتم والله قتلتموه قالوا والله ما قتلناه ‏.‏ فأقبل حتى قدم على قومه فذكر لهم ثم أقبل هو وأخوه حويصة وهو أكبر منه وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال رسول الله صلى الله عليه وسلم لمحيصة ‏\"‏ كبر كبر ‏\"‏ ‏.‏ يريد السن فتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب إليهم رسول الله صلى الله عليه وسلم في ذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ أتحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا بمسلمين ‏.‏ فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم بمائة ناقة حتى أدخلت عليهم الدار ‏.‏ قال سهل لقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " It was narrated from Abu Laila bin 'Abdullah bin 'Abdur-Rahman bin Sahl, from Sahl bin Abi Hathmah, that:                     he informed him, ans some men among the elders of his people, that \"Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah, and he told him that 'Abdullah bin Sahl had been killed and thrown into a pit or well. He came to the Jews and said: \"By Allah, you killed him.\" They said: \"By Allah, we did not kill him.\" Then he went baack to his people and told them about that. Then he and his brother Huwayysah, who was older than him, and 'Abdur-Rahman bin Sahl, came (to the prophet). Muhayysah, who was the one who had been at Khaibar, bnegan to speak, but the Messenger of Allah said: \"Let the elder speak first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your companion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the Jews swear an oath for you?\" They said: \"They are not Muslims.\" So the Messenger of Allah paid it himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4718",
      "hadith_no": "4718",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن يحيى بن سعيد، عن بشير بن يسار، أنه أخبره أن عبد الله بن سهل الأنصاري ومحيصة بن مسعود خرجا إلى خيبر فتفرقا في حوائجهما فقتل عبد الله بن سهل فقدم محيصة فأتى هو وأخوه حويصة وعبد الرحمن بن سهل إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن ليتكلم لمكانه من أخيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر كبر ‏\"‏ ‏.‏ فتكلم حويصة ومحيصة فذكروا شأن عبد الله بن سهل فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون خمسين يمينا وتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قال مالك قال يحيى فزعم بشير أن رسول الله صلى الله عليه وسلم وداه من عنده ‏.‏ خالفهم سعيد بن عبيد الطائي ‏.‏",
      "text_en": " It was narrated from Bushair bin Yasar that:                     'Abdullah bin Sahl Al-Ansari and Muhayysah bin Mas'ud went out to Khaibar, where they went their separate ways to go about their business. 'Abdullah bin Sahl was killed, and Muhayysah came (to Madinah) and went with his brother Huwayysah and 'Abdur-Rahman bin Sahl to the Messenger of Allah. 'Abdur-Rahaman started to speak, because of his position as brother (of the slain man) but the Messenger of Allah said: \"Let the elders speak first.\" So Huyysah and Muhayysah spoken, and told him about what happened to 'Abdullah bin Sahl. The Messenger of Allah said to them: \"Will you sewer fifty oaths, then you will receive compensation or be entitled to retaliate?\" (In his narration) Malik said: \"Yahya said: 'Bushair said that the Messenger of Allah paid the blood money himself, but Sa'eed bin 'Ubaid At-Ta'l disagreed with them (in reporting that).''",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4820",
      "hadith_no": "4820",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم قضى في الجنين يقتل في بطن أمه بغرة عبد أو وليدة فقال الذي قضى عليه كيف أغرم من لا شرب ولا أكل ولا استهل ولا نطق فمثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هذا من الكهان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Al-Musayyab that:                     the Messenger of Allah ruled that for a fetus which is killed in the mother's womb, a male or female slave be given (as Diyah). The one against whom he passed this ruling said: \"How can I pay blood money for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.\" The Messenger of Allah said: \"This is one of the soothsayers.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11013",
        "11002"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4857",
      "hadith_no": "4857",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، قال الكتاب الذي كتبه رسول الله صلى الله عليه وسلم لعمرو بن حزم في العقول ‏\"‏ إن في النفس مائة من الإبل وفي الأنف إذا أوعي جدعا مائة من الإبل وفي المأمومة ثلث النفس وفي الجائفة مثلها وفي اليد خمسون وفي العين خمسون وفي الرجل خمسون وفي كل إصبع مما هنالك عشر من الإبل وفي السن خمس وفي الموضحة خمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from' Abdullah bin Abi Bakr bin Muhammad bin 'Amr bin Hazm that his rather said:                     \"The letter which the Messenger of Allah wrote to 'Amr bin Hazm concerning blood money: 'For a soul, one hundred camels; for the nose if it is cut off completely, one hundred camels, for a blow to thread that reaches the brain, one third of the Diyah for a soul; for a stab wound that penetrates deeply, likewise; for a hand fifty; for an eye, fifty, for a foot, fifty; for every fingers, Ten  camels for a tooth, five; and for a wound that exposes the bone, five.",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11104",
        "11239"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4927",
      "hadith_no": "4927",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت ما طال على ولا نسيت القطع في ربع دينار فصاعدا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"It has not been too long and I have not forgotten yet. Cutting off (the hand of the thief) is for one-quarter of a Dinar or more.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11062",
        "11455",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4930",
      "hadith_no": "4930",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن محمد بن أبي بكر، عن عمرة، قالت قالت عائشة القطع في ربع دينار فصاعدا ‏.‏",
      "text_en": " It was narrated that 'Amrah said:                     \"Aishah said: 'Cutting off (the hand of the thief) is for one-quarter of a Dinar or more.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11516",
        "11455"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5025",
      "hadith_no": "5025",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا قتيبة عن مالك عن ابن شهاب ح والحارث بن مسكين قراءة عليه وأنا أسمع عن ابن القاسم قال حدثني مالك عن ابن شهاب عن حميد بن عبد الرحمن عن أبي هريرة  أن النبي صلى الله عليه وسلم قال من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "text_en": " It was narrated from Abu Hurairah that :                     The Prophet [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in hope of reward, his previous sins will be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11013",
        "36017",
        "30234",
        "20001",
        "11013",
        "10561",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5028",
      "hadith_no": "5028",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن سلمة قال حدثنا ابن القاسم عن مالك قال حدثني أبو سهيل عن أبيه أنه سمع طلحة بن عبيد الله يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد ثائر الرأس يسمع دوي صوته ولا يفهم ما يقول حتى دنا فإذا هو يسأل عن الإسلام قال له رسول الله صلى الله عليه وسلم خمس صلوات في اليوم والليلة قال هل علي غيرهن قال لا إلا أن تطوع قال رسول الله صلى الله عليه وسلم وصيام شهر رمضان قال هل علي غيره قال لا إلا أن تطوع وذكر له رسول الله صلى الله عليه وسلم الزكاة فقال هل علي غيرها قال لا إلا أن تطوع فأدبر الرجل وهو يقول لا أزيد على هذا ولا أنقص منه فقال رسول الله صلى الله عليه وسلم أفلح إن صدق",
      "text_en": " Abu Suhail narrated from his father,:                     That he heard Talhah bin 'Ubaidullah say: \"A man from Najd with unkempt hair came to the Messenger of Allah [SAW]; he was speaking loudly but his speech could not be understood until he came close. He was asking about Islam. The Messenger of Allah [SAW] said: 'Five prayers every day and night.' He said: 'Do I have to do any more than that? He said: 'No, not unless you do it voluntarily.' The Messenger of Allah [SAW] said: 'Fasting the month of Ramadan.' He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' Then the Messenger of Allah [SAW] told him about Zakah. He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' The man left saying, 'I will not do any more than that or any less.' The Messenger of Allah [SAW] said: 'He will succeed, if he is telling the truth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "6"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5033",
      "hadith_no": "5033",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا هارون بن عبد الله قال حدثنا معن قال حدثنا مالك ح والحارث بن مسكين قراءة عليه وأنا أسمع عن ابن القاسم أخبرني مالك واللفظ له عن ابن شهاب عن سالم عن أبيه  أن رسول الله صلى الله عليه وسلم مر على رجل يعظ أخاه في الحياء فقال دعه فإن الحياء من الإيمان",
      "text_en": " It was narrated from Salim, from his father, that:                     The Messenger of Allah [SAW] passed by a man who was censuring his brother about modesty. He said: \"Let him be, for modesty is part of faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "11013",
        "11011",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5036",
      "hadith_no": "5036",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا هارون بن عبد الله قال حدثنا معن ح والحارث بن مسكين قراءة عليه وأنا أسمع عن ابن القاسم قالا حدثنا مالك عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة عن أبيه عن أبي سعيد الخدري قال  قال رسول الله صلى الله عليه وسلم يوشك أن يكون خير مال مسلم غنم يتبع بها شعف الجبال ومواقع القطر يفر بدينه من الفتن",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] said: 'Soon the best wealth of a Muslim will be the sheep which follows in the mountain peaks and places where rainfall is to be found, fleeing with his religion from the tribulations.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "36017",
        "30234",
        "20001",
        "11518",
        "11514",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5269",
      "hadith_no": "5269",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن نافع، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، قال نهاني رسول الله صلى الله عليه وسلم عن القراءة في الركوع ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me from reciting Qur'an while bowing.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11014",
        "11150",
        "11181",
        "5"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5391",
      "hadith_no": "5391",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن ابن شهاب، عن سليمان بن يسار، عن عبد الله بن عباس، قال كان الفضل بن عباس رديف رسول الله صلى الله عليه وسلم فجاءته امرأة من خثعم تستفتيه فجعل الفضل ينظر إليها وتنظر إليه وجعل رسول الله صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر فقالت يا رسول الله إن فريضة الله عز وجل على عباده في الحج أدركت أبي شيخا كبيرا لا يستطيع أن يثبت على الراحلة أفأحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏ وذلك في حجة الوداع‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Abbas said:                     \"Al-Fadl bin 'Abbas was riding behind the Messenger of Allah [SAW] when a woman from Khath'am came to ask him a question. Al-Fadl started looking at her, and she at him, and the Messenger of Allah [SAW] turned the face of Al-Fadl the other way. She said: 'O Messenger of Allah, the command of Allah, the Mighty and Sublime, to His slaves to perform Hajj has come while my father is an old man, and he cannot sit firmly in the saddle; can I perform Hajj on his behalf?' He said: 'Yes.' That was during the Farewell Pilgrimage.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11013",
        "11005",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5514",
      "hadith_no": "5514",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يدعو يقول في دعائه ‏\"‏ اللهم إني أعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] used to say in his supplication: \"Allahumma, inni a'udhu bika min 'adhabi jahannama, wa a'udhu bika min 'adhabil-qabri, wa a'udhu bika min fitnatil-masihid-dajjali, wa a'udhu bika min fitnatil-mahya wal-mamat (O Allah, I seek refuge with You from the torment of Hell, and I seek refuge in You from the torment of the grave, and I seek refuge in You from the tribulation of the Al-Masihid-Dajjal, and I seek refuge with You from the trials of life and death.)\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5671",
      "hadith_no": "5671",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا قتيبة، عن مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شرب الخمر في الدنيا ثم لم يتب منها حرمها في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] said: \"Whoever drinks Khamr in this world and does not repent from that, will be denied it in the Hereafter.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5699",
      "hadith_no": "5699",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، أخبرني مالك، عن نافع، عن ابن عمر، قال كل مسكر خمر وكل مسكر حرام ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Every intoxicant is Khamr and every intoxicant is unlawful.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5708",
      "hadith_no": "5708",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن السائب بن يزيد، أنه أخبره أن عمر بن الخطاب خرج عليهم فقال إني وجدت من فلان ريح شراب فزعم أنه شراب الطلاء وأنا سائل عما شرب فإن كان مسكرا جلدته فجلده عمر بن الخطاب رضى الله عنه الحد تاما ‏.‏",
      "text_en": " It was narrated from As-Sa'ib that :                     'Umar bin Al-Khattab went out t them and said: \"I noticed the smell of drink on so-and-so, and he said that he had drunk At-Tila' (thickened juice of grapes). I am asking about what he drank. If it was an intoxicant I will flog him.\" So 'Umar bin Al-Khattab, may Allah be pleased with him, flogged him, carrying out the Hadd punishment in full.",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11013",
        "3048",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 114,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}