{
  "id": "30234",
  "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن خالد بن جنادة",
  "full_name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن خالد بن جنادة",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "128",
      "date_gregorian": "NA",
      "date_display": [
        "128 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "191",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-'Atqi",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22220",
      "name": "Naf' bin 'Abdur Rahman نافع بن عبد الرحمن بن أبي نعيم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19177",
      "name": "Yazid bin 'Abdul Malik bin al-Mughira يزيد بن عبد الملك بن المغيرة بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30228",
      "name": "Asbgh bin al-Frj bin Sa'id أصبغ بن الفرج بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30338",
      "name": "Sa'id bin 'Isa سعيد بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30491",
      "name": "Muhammad bin Salmah bin محمد بن سلمة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36017",
      "name": "al-Harith bin Mskyn bin Muhammad الحارث بن مسكين بن محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31573",
      "name": "'Abdur Rahman bin Abi al-Ghmr عبد الرحمن بن أبي الغمر",
      "grade": "3rd Century AH"
    },
    {
      "id": "36056",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Hakam محمد بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30412",
      "name": "'Isa bin Hammad bin Muslim, Zaghba عيسى بن حماد بن مسلم أبو موسى زغبة",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "20",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، واللفظ، له عن ابن القاسم، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن رافع بن إسحاق، أنه سمع أبا أيوب الأنصاري، وهو بمصر يقول والله ما أدري كيف أصنع بهذه الكراييس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ذهب أحدكم إلى الغائط أو البول فلا يستقبل القبلة ولا يستدبرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Ishaq that he heard Abu Ayyub Al-Ansari say - when he was in Egypt:                      \"By Allah, I do not know what I should do with these Karais (toilets). The Messenger of Allah (ﷺ) said: 'When any one of you goes to defecate or urinate, let him not face toward the Qiblah, nor turn his back towards it.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11151",
        "12089",
        "33"
      ]
    },
    {
      "hadith_no": "71",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، قال كان الرجال والنساء يتوضئون في زمان رسول الله صلى الله عليه وسلم جميعا ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"Men and women used to perform Wudu' together during the time of the Messenger of Allah (ﷺ).\"",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "75",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، ح وأخبرنا سليمان بن منصور، قال أنبأنا عبد الله بن المبارك، - واللفظ له - عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله وإلى رسوله فهجرته إلى الله وإلى رسوله ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab (may Allah be pleased with him) said:                      \"The Messenger of Allah said: 'Actions are only done with intentions, and every man shall have what he intended. Thus he whose emigration was for Allah and His Messenger, his emigration was for Allah and His Messenger, and he whose emigration was to achieve some worldly benefit or to take some woman in marriage, his emigration was for that which he intended.\"",
      "chain": [
        "30459",
        "20022",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "3"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عمرو بن يحيى المازني، عن أبيه، أنه قال لعبد الله بن زيد بن عاصم - وكان من أصحاب النبي صلى الله عليه وسلم وهو جد عمرو بن يحيى - هل تستطيع أن تريني كيف كان رسول الله صلى الله عليه وسلم يتوضأ قال عبد الله بن زيد نعم ‏.‏ فدعا بوضوء فأفرغ على يديه فغسل يديه مرتين مرتين ثم تمضمض واستنشق ثلاثا ثم غسل وجهه ثلاثا ثم غسل يديه مرتين مرتين إلى المرفقين ثم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏",
      "text_en": " It was narrated from 'Amr bin Yahya Al-Mazini that his father said to 'Abdullah bin Zaid bin 'Asim - who was one of the Companions of the Prophet (ﷺ) and the grandfather of 'Amr bin Yahya:                      \"Can you show me how the Messenger of Allah (ﷺ) used to perform Wudu'? 'Abdullah bin Zaid said: \"Yes. He called for (water for) Wudu' and poured some onto his hand, washing each hand twice. Then he rinsed his mouth and nose three times, then he washed his face three times, then he washed each hand twice, up to the elbow. Then he wiped his head with his hands, back and forth, starting at the front of his head and moving his hands to the nape of his neck, then bringing them back to the place he started. Then he washed his feet.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "164",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هارون بن عبد الله، حدثنا معن، أنبأنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال أنبأنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، أنه سمع عروة بن الزبير، يقول دخلت على مروان بن الحكم فذكرنا ما يكون منه الوضوء فقال مروان من مس الذكر الوضوء ‏.‏ فقال عروة ما علمت ذلك ‏.‏ فقال مروان أخبرتني بسرة بنت صفوان أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا مس أحدكم ذكره فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair said:                      \"I entered upon Mawan bin Al-Hakam and we mentioned the things for which Wudu' is done. Marwan said: 'Wudu' should be done after touching the penis.' 'Urwah said: 'I did not know that.' Marwan said: 'Busrah bint Safwan told me that she heard the Messenger of Allah (ﷺ) say: \"And if any one of you touches his penis, let him do Wudu'.\"",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "10511"
      ]
    },
    {
      "hadith_no": "187",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر حتى إذا كانوا بالصهباء وهي من أدنى خيبر صلى العصر ثم دعا بالأزواد فلم يؤت إلا بالسويق فأمر به فثري فأكل وأكلنا ثم قام إلى المغرب فتمضمض وتمضمضنا ثم صلى ولم يتوضأ ‏.‏",
      "text_en": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "hadith_no": "545",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عتبة بن عبد الله، قال قرأت على مالك بن أنس والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا عليه لاستهموا ولو يعلم الناس ما في التهجير لاستبقوا إليه ولو علموا ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"If the people knew what (virtue) there was in the call to prayer and the first row, and they not find any way to get to do that [1] other than by drawing lots, they would do that. If they knew what (virtue) there was in coming early to prayer, they would compete to be first in the Masjid. If they knew what (virtue) there was in Al-'Atamah and Subh, they would come to them even if they had to crawl.\"[1] Indicating the two mentioned items: that is the call to prayer and praying in the first row.",
      "chain": [
        "20342",
        "30234",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن أبي الزبير المكي، عن أبي الطفيل، عامر بن واثلة أن معاذ بن جبل، أخبره أنهم، خرجوا مع رسول الله صلى الله عليه وسلم عام تبوك فكان رسول الله صلى الله عليه وسلم يجمع بين الظهر والعصر والمغرب والعشاء فأخر الصلاة يوما ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج فصلى المغرب والعشاء ‏.‏",
      "text_en": " It was narrated from Abu At-Tufail 'Amir bin Wathilah that Mu'adh bin Jabal told him that they went out with the Messenger of Allah (ﷺ) in the year of Tabuk, and the Messenger of Allah (ﷺ) was joining Zuhr and 'Asr, and Maghrib and 'Isha'. He delayed the prayer one day then he went out and prayed Zuhr and 'Asr together, then he went in and came out again and prayed Maghrib and 'Isha'.",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11263",
        "32"
      ]
    },
    {
      "hadith_no": "651",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال قال حدثني عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة الأنصاري المازني، عن أبيه، أنه أخبره أن أبا سعيد الخدري قال له إني أراك تحب الغنم والبادية فإذا كنت في غنمك أو باديتك فأذنت بالصلاة فارفع صوتك فإنه لا يسمع مدى صوت المؤذن جن ولا إنس ولا شىء إلا شهد له يوم القيامة ‏.‏ قال أبو سعيد سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin 'Abdur-Rahman bin Abi Sa'sa'ah Al-Ansari Al-Mazini narrated that his father told him that Abu Sa'eed Al-Khudri said to him:                      \"I see that you love sheep and the desert. When you are with your sheep or in the desert and you call the Adhan for prayer, then raise your voice, for no human, Jinn or anything else hears the voice of the Mu'adhdhin as far as it reaches, but it will bear witness for him on the Day of Resurrection.\" Abu Sa'eed said: \"I heard it from the Messenger of Allah (ﷺ).\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "38"
      ]
    },
    {
      "hadith_no": "749",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم دخل الكعبة هو وأسامة بن زيد وبلال وعثمان بن طلحة الحجبي فأغلقها عليه قال عبد الله بن عمر فسألت بلالا حين خرج ماذا صنع رسول الله صلى الله عليه وسلم قال جعل عمودا عن يساره وعمودين عن يمينه وثلاثة أعمدة وراءه - وكان البيت يومئذ على ستة أعمدة - ثم صلى وجعل بينه وبين الجدار نحوا من ثلاثة أذرع ‏.‏",
      "text_en": " Narrated Abdullah bin Umar:                     It was narrated from Abdullah bin Umar that the Messenger of Allah (ﷺ) entered the Ka'bah with Usamah bin Zaid, Bilal and Uthman bin Talha  al Hajabi, and locked the door behind him. Abdullah bin Umar said: \"I asked Bilal when he came out: \" What did the Messenger of Allah (ﷺ) do?\" He said: \"He stood with one pillar to his left, two pillars to his right and three pillars behind him - at that time the House stood on six pillars - and he prayed with approximately three forearm's length between him and the wall.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "788",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح قال وحدثنا الحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع، ‏.‏ أن عتبان بن مالك، كان يؤم قومه وهو أعمى وأنه قال لرسول الله صلى الله عليه وسلم إنها تكون الظلمة والمطر والسيل وأنا رجل ضرير البصر فصل يا رسول الله في بيتي مكانا أتخذه مصلى ‏.‏ فجاء رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي لك ‏\"‏ ‏.‏ فأشار إلى مكان من البيت فصلى فيه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Mahmiid bin Ar-Rabi' that 'Itbk bin Milk used to lead his people in prayer, and he was blind. He said to theMessenger of Allah (ﷺ):                     \"Sometimes it is dark or rainy or there is a flood, and I am a blindman; 0 Messenger of Allah (ﷺ), (come and) pray in a place in my house that I may take as a prayer-place.\" He said: \"Where would you likeme to pray for you?\" He showed him a place in his house, and the Messenger of Allah (ﷺ) prayed there.",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "934",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أن الحارث بن هشام، سأل رسول الله صلى الله عليه وسلم كيف يأتيك الوحى فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحيانا يأتيني في مثل صلصلة الجرس وهو أشده على فيفصم عني وقد وعيت ما قال وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول ‏\"‏ ‏.‏ قالت عائشة ولقد رأيته ينزل عليه في اليوم الشديد البرد فيفصم عنه وإن جبينه ليتفصد عرقا ‏.‏",
      "text_en": " It was narrated from Aishah that:                     Al-Harith bin Hisham asked the Messenger of Allah (ﷺ): 'How does the Revelation come to you?' He said: 'Like the ringing of a bell, and this is the hardest on me. When it departs I remember what he said. And sometimes the Angel appears to me in the form of a man and speaks to me, and I remember what he said.\" Aishah said: \"I saw him when the Revelation came to him on a very cold day, and his forhead was dripping with sweat.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "937",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، - رضى الله عنه - يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان على غير ما أقرؤها عليه وكان رسول الله صلى الله عليه وسلم أقرأنيها فكدت أن أعجل عليه ثم أمهلته حتى انصرف ثم لببته بردائه فجئت به إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على غير ما أقرأتنيها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأ القراءة التي سمعته يقرأ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت إن هذا القرآن أنزل على سبعة أحرف ‏{‏ فاقرءوا ما تيسر منه ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that AbdurRahman bin Abdul-Qari said:                     \"I heard Umar bin Al-Khattab, may Allah be pleased with him, say: 'I heard Hisham bin Hakim bin Hizam reciting Surat Al-Furqan, in a way that I had not been taught, and the Messenger of Allah (ﷺ) had taught me. I was about to interrupt him (in his prayer), but I left him alone until he had finished. Then I grabbed him by his garment and brought him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, I heard this man reciting Surat Al-Furqan in a way that you did not teach me.' The Messenger of Allah (ﷺ) said to him: 'Recite.' So he recited it in the way that I had heard him recite. Then the Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then he said to me: 'Recite.' So I recited it and he said: 'It was revealed like this. This Quran has been revealed in seven different modes, so recite as much of the Quran as may be easy for you.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "hadith_no": "1062",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني نعيم بن عبد الله، عن علي بن يحيى الزرقي، عن أبيه، عن رفاعة بن رافع، قال كنا يوما نصلي وراء رسول الله صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قال رجل وراءه ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه ‏.‏ فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من المتكلم آنفا ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أولا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi said:                     \"We were praying behind the Messenger of Allah (ﷺ) one day and when he raised his head from bowing he said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him).' A man behind him said: 'Rabbana wa lakal-hamd, hamdan kathiran tayyiban mubarakan fih. (O our Lord, and to You be praise, much blessed and pure praise.)' When the Messenger of Allah (ﷺ) had finished, he said: \"Who is the one who spoke just now?\" The man said: 'I did, O Messenger of Allah.' The Messenger of Allah (ﷺ) said: 'I saw thirty-some angels rushing to see which of them would write it down first.'\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "1095",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة، عن أبي سعيد الخدري، قال بصرت عيناى رسول الله صلى الله عليه وسلم على جبينه وأنفه أثر الماء والطين من صبح ليلة إحدى وعشرين ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"My two eyes saw the traces of water and mud on the forehead and nose of the Messenger of Allah (ﷺ), from his praying Qiyam on the night of the twenty-first.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "1225",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني أيوب، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم انصرف من اثنتين فقال له ذو اليدين أقصرت الصلاة أم نسيت يا رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق ذو اليدين ‏\"‏ ‏.‏ فقال الناس نعم ‏.‏ فقام رسول الله صلى الله عليه وسلم فصلى اثنتين ثم سلم ثم كبر فسجد مثل سجوده أو أطول ثم رفع رأسه ثم سجد مثل سجوده أو أطول ثم رفع ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Messenger of Allah (ﷺ) finished praying two rak'ahs,and Dhul-Yadain said to him: \"Has the prayer been shortened or did you forget, O Messenger of Allah?\" The Messenger of Allah (ﷺ) said: \"Is Dhul-Yadain speaking the truth?\" The people said: \"Yes.\" So the Messenger of Allah (ﷺ) stood up and prayed two, then he said the takbir and prostrated as usual or longer than that. Then he raised his head, then he prostrated as usual or longer than that, then he sat up.\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، - وعبد الله بن زيد الذي أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله عز وجل أن نصلي عليك يا رسول الله فكيف نصلي عليك فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما علمتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud Al-Ansari siad:                     \"The Messenger of Allah (ﷺ) came to us in the Majlis of Sa'd bin 'Ubadah and Bashir bin Sa'd said to him: 'Allah has commanded us to send Salah upon you, O Messenger of Allah; so how should we send salah upon you?' The Messenger of Allah (ﷺ) remained silent until we wished that he had not asked him. Then he said: 'Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)\" And the salam is as you know.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11225",
        "402"
      ]
    },
    {
      "hadith_no": "1294",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك فقال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته ‏\"‏ ‏.‏ في حديث الحارث ‏\"‏ كما صليت على آل إبراهيم وبارك على محمد وأزواجه وذريته ‏\"‏ ‏.‏ قالا جميعا ‏\"‏ كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال أبو عبد الرحمن أنبأنا قتيبة بهذا الحديث مرتين ولعله أن يكون قد سقط عليه منه شطر ‏.‏",
      "text_en": " It was narrated that 'Amr bin Sulam Az-Zuraqi said:                     \"Abu Humaid As-Sa'idi told me that they said: 'O Messenger of Allah (ﷺ), how should we send salah upon you?' The Messenger of Allah (ﷺ) said: 'Say: Allahumma sali 'ala Muhammadin wa azwajihi wa dhuriyatihi ( O Allah, send salah upon Muhamad and his wives and progeny)- in the narration of Al-Harith (one of the two who narrated it)-kama salaita 'ala Ibraim wa barik 'alaMuhammad wa azwajihi wa dhuriyatti (as You sent salah upon Irahim and send blessings upon Muhammad and his wives and progeny)- both of them said that- kama barakta 'ala ali Ibrahima innaka hamidun majid (as You sent blessings upon Ibrahim, You are indeed worthy of praise, Full of glory.)\" Abu Abdur-Rahman (An-Nasa'i) said: Qutaibah informed us of this hadith two times, and perhaps he had missed a part of it.",
      "chain": [
        "30367",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "hadith_no": "1493",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال خسفت الشمس فصلى رسول الله صلى الله عليه وسلم والناس معه فقام قياما طويلا قرأ نحوا من سورة البقرة - قال - ثم ركع ركوعا طويلا ثم رفع فقام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم سجد ثم قام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم رفع فقام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم سجد ثم انصرف وقد تجلت الشمس فقال ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا يخسفان لموت أحد ولا لحياته فإذا رأيتم ذلك فاذكروا الله عز وجل ‏\"‏ ‏.‏ قالوا يا رسول الله رأيناك تناولت شيئا في مقامك هذا ثم رأيناك تكعكعت ‏.‏ قال ‏\"‏ إني رأيت الجنة أو أريت الجنة فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا ورأيت النار فلم أر كاليوم منظرا قط ورأيت أكثر أهلها النساء ‏\"‏ ‏.‏ قالوا لم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏ ‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير ويكفرن الإحسان لو أحسنت إلى إحداهن الدهر ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abbas said:                     \"There was an eclipse of the sun and the Messenger of Allah (ﷺ) prayed and the people with him. He stood for long time reciting something like Surah Al-Baqarah, then he raised (his head) and stood for a long time, then he raised (his head) and stood for a long time which was shorter than the first time. Then he bowed for a long time, which was shorter than the first time, then he prostrated. Then he got up and stood for a long time, which was shorter than the first time, then he bowed for a long time, which was shorter than the first time, then he raised (his head) and stood for a long time, which was shorter than the first time. Then he bowed for a long time, which was shorter than the first time, then he prostrated, then he finished (his prayer) and the sun had been clear. He said: 'The sun and the moon are two of the signs of Allah (SWT) and they do not become eclipsed for the death or birth of anyone. If you see that then remember Allah (SWT) the Mighty and Sublime.' They said: 'O Messenger of Allah (ﷺ), we saw you stretching out your hand when you were standing, then we saw you moving backward. He said: 'I saw Paradise-or it was shown to me- and I reached out to a take a bunch of its fruits. If I ha taken it you would have eaten from it for as long as this world lasts. And I saw Hell and I have never seen anything like it, and I saw that most of its inhabitants are women.' They said: \"Why, O Messenger of Allah (ﷺ)? He said: 'Because of their ingratitude.' It was said: 'Are they ungrateful to Allah?' He said: 'They are ungrateful to their husbands and they are ungrateful for kind treatment. If you are kind to one of them for a lifetime, then she sees (one) bad thing from you, she will say: I have never seen anything good from you.'\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "1577",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قلت لصاحبك أنصت والإمام يخطب فقد لغوت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"If you say to your companion: 'Be quiet and listen' when the imam is delivering the Khutbah, you have engaged in idle speech.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1620",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني مخرمة بن سليمان، عن كريب، أن عبد الله بن عباس، أخبره أنه، بات عند ميمونة أم المؤمنين - وهي خالته - فاضطجع في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل أو قبله قليلا أو بعده قليلا استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتيم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي قال عبد الله بن عباس فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاءه المؤذن فصلى ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Kuraib that 'Abdullah bin 'Abbas told him:                     He slept at the house of Maimunah the wife of the Prophet (ﷺ), who was his maternal aunt. He said: \"I laid down across the mattress an the Messenger of Allah (ﷺ) and his wife lay along it. The Prophet (ﷺ) slept until midnight, or a little before or a little after. The Prophet (ﷺ) woke up and began to rub the sleep from his face with his hand. Then he recited the last ten verses of Surah Al Imran. Then he got up and went to a water skin that was hanging up and performed wudu from it, and he performed wudu well, then he stood up and prayed.\" Abdullah bin 'Abbas said: \"I stood up and did what he had done, then I went and stood beside him. The Messenger of Allah (ﷺ) put his right hand on my neck, and took old of my right hand and tweaked it. Then he prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then he prayed witr.Then he lay down until the Mu'adhdhin came to him and he prayed two brief rak'ahs.\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1648",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني عبد الله بن يزيد، وأبو النضر، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم كان يصلي وهو جالس فيقرأ وهو جالس فإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأ وهو قائم ثم ركع ثم سجد ثم يفعل في الركعة الثانية مثل ذلك ‏.‏",
      "text_en": " It was narrated from Aishah that :                     The Prophet (ﷺ) used to pray when he was sitting. He would recite while sitting, then when there were thirty or forty verses left, he would stand up and recite while standing, then he bowed and prostrated, then he would do likewise in the second rak'ah.",
      "chain": [
        "20672",
        "30234",
        "20001",
        "1945",
        "20390",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1694",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، وعبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin 'Umar that:                     A man asked the Messenger of Allah (ﷺ) about prayer at night and the Messenger of Allah (ﷺ) said: \"Prayer at night is two by two, then if one of you fears that dawn will break, pray one rak'ah to make the total number that he prayed odd.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "1697",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن سعيد بن أبي سعيد المقبري، عن أبي سلمة بن عبد الرحمن، أنه أخبره أنه، سأل عائشة أم المؤمنين كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان قالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا غيره على إحدى عشرة ركعة يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي ثلاثا قالت عائشة فقلت يا رسول الله أتنام قبل أن توتر قال ‏\"‏ يا عائشة إن عيني تنام ولا ينام قلبي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin Abdur-Rahman that :                     He asked Aishah, the Mother of the Believers, about how the Messenger of Allah (ﷺ) used to pray in Ramadan. She said: \"The Messenger of Allah (ﷺ) did not pray more than eleven rak'ahs during Ramadan or at any other time. He would pray four, and do not ask how beautiful or how long they were. Then he would pray four, and do not ask how beautiful or how long they were. Then he would pray three.\" Aishah said: \"I said: 'O Messenger of Allah, do you sleep before you pray witr?' He said: 'O Aishah, my eyes sleep but my heart does not.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11168",
        "10567"
      ]
    },
    {
      "hadith_no": "1773",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني نافع، عن عبد الله بن عمر، أن حفصة أم المؤمنين، أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن من الأذان لصلاة الصبح وبدا الصبح صلى ركعتين خفيفتين قبل أن تقام الصلاة ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Umar that Hafsah, the Mother of the Believers, told him:                     that when the Muaddhin fell silent following the call to Subh prayer and dawn had broken, he would pray two brief rak'ahs before getting up to pray.",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1835",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، ح وأنبأنا قتيبة، قال حدثنا المغيرة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله تعالى إذا أحب عبدي لقائي أحببت لقاءه وإذا كره لقائي كرهت لقاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: Allah, the Most High, said: If My slave loves to meet Me, I love to meet him, and if he hates to meet Me, I hate to meet him.\"'",
      "chain": [
        "36017",
        "30234",
        "20001",
        "30367",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2038",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن علقمة بن أبي علقمة، عن أمه، أنها سمعت عائشة، تقول ‏:‏ قام رسول الله صلى الله عليه وسلم ذات ليلة فلبس ثيابه ثم خرج - قالت - فأمرت جاريتي بريرة تتبعه فتبعته حتى جاء البقيع، فوقف في أدناه ما شاء الله أن يقف، ثم انصرف فسبقته بريرة فأخبرتني، فلم أذكر له شيئا حتى أصبحت، ثم ذكرت ذلك له فقال ‏:‏ ‏\"‏ إني بعثت إلى أهل البقيع لأصلي عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Alqamah bin Abi 'Alqamah, from his mother, that she heard 'Aishah say:                     \"The Messenger of Allah got up one night and got dressed, then he went out. I told my slave girl Barirah to follow him, so she followed him until he came to Al-Baqi. Then he stood near if for as long as Allah willed that he should stand, then he left. Barirah came back before he did and told me, but I did not mention anything until morning came, then I mentioned that to him. He said: 'I was sent to the people of Al-Baqi' to pray for them.\"'",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11208",
        "19521"
      ]
    },
    {
      "hadith_no": "2072",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا مات أحدكم عرض على مقعده بالغداة والعشي إن كان من أهل الجنة فمن أهل الجنة وإن كان من أهل النار فمن أهل النار فيقال هذا مقعدك حتى يبعثك الله عز وجل يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah said:                     \"When one of you dies, he is shown his place morning and evening. If he is one of  the people of Paradise then he is one of the people of Paradise, and if he is one of the people of Hell. It is said: 'This is your place, until Allah, the Mighty and Sublime, raises you up on the Day of Resurrection.\"'",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2121",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم ذكر رمضان فقال ‏\"‏ لا تصوموا حتى تروا الهلال ولا تفطروا حتى تروه فإن غم عليكم فاقدروا له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah mentioned Ramadan and said:                     \"Do not fast until you see the crescent, and do not stop fasting until you see it, and if it is obscured from you (too cloudy), then work it out.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2200",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever spends the nights of Ramadan n prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2306",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن عائشة، قالت إن حمزة قال لرسول الله صلى الله عليه وسلم يا رسول الله أصوم في السفر وكان كثير الصيام ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Hamzah said to the Messenger of Allah: 'O Messenger of Allah, should I fast while traveling?' He used to fast a great deal. The Messenger of Allah said to him: \"If you wish then fast and if you wish then do not fast.\"'",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2341",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عائشة، وحفصة، مثله لا يصوم إلا من أجمع الصيام قبل الفجر ‏.‏",
      "text_en": " Something similar was narrated from 'Aishah and Hafsah:                     \"There is no fast except for one who intends to fast before dawn.\" (Daif)",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11013",
        "53"
      ]
    },
    {
      "hadith_no": "2343",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أنه كان يقول لا يصوم إلا من أجمع الصيام قبل الفجر ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he used to say:                     \"None should fast except the one who intended to fast before dawn.\"",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2471",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"The Muslim does not have to pay Sadaqah on his slave or his horse.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "2474",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة المازني، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمس أوسق من التمر صدقة وليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa 'eed Al-Khudri that the Messenger of Allah said:                      \"No Sadaqah is due on lessthan five Awsuq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadaqah is due on less than five Dhawd (head) of camels.",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "38"
      ]
    },
    {
      "hadith_no": "2503",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر من رمضان على الناس صاعا من تمر أو صاعا من شعير على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah enjoined Zakatul-Fitr at the end of Ramadan upon the people; a Sa' of dates or a Sa' of barley, upon everyone, free or slave, male or female, of the Muslims.",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2596",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال أنبأنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن رجل، من بني أسد قال نزلت أنا وأهلي، ببقيع الغرقد فقالت لي أهلي اذهب إلى رسول الله صلى الله عليه وسلم فسله لنا شيئا نأكله ‏.‏ فذهبت إلى رسول الله صلى الله عليه وسلم فوجدت عنده رجلا يسأله ورسول الله صلى الله عليه وسلم يقول ‏\"‏ لا أجد ما أعطيك ‏\"‏ ‏.‏ فولى الرجل عنه وهو مغضب وهو يقول لعمري إنك لتعطي من شئت ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليغضب على أن لا أجد ما أعطيه من سأل منكم وله أوقية أو عدلها فقد سأل إلحافا ‏\"‏ ‏.‏ قال الأسدي فقلت للقحة لنا خير من أوقية - والأوقية أربعون درهما - فرجعت ولم أسأله فقدم على رسول الله صلى الله عليه وسلم بعد ذلك شعير وزبيب فقسم لنا منه حتى أغنانا الله عز وجل ‏.‏",
      "text_en": " It was narrated from  'Ata'bin Yasar that a man from Banu Asad said:                     \"My wife and I stopped at Baqi Al-Gharqad, and my wife said to me: 'Go to the Messenger of Allah and ask him to give us something to eat. ' So I went to the Messenger of Allah and found a man with him asking him (for something), and the Messenger of Allah was saying: 'I do not have anything to give to you.' The man turned away angrily, saying: 'You only give to those you want. 'The Messenger of Allah said: 'He is angry with me because I did not have anything to give him.  Whoever asks of you and he has an Uqiyah or its equivalent, then he has been too demanding in asking.\"' Al-Asadi said: I said: 'Our milch-camel is worth more than an Uqiyah, 'and an Uqiyah is forty Dirhams. \"So I went back and did not ask him for anything. Then the Messenger of Allah got some barley and raisins after that, and he gave us a share of them, until Allah, the Mighty and Sublime, made us independent of means.\"",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثنا مالك، عن زيد بن أسلم، عن أبيه، قال سمعت عمر، يقول حملت على فرس في سبيل الله عز وجل فأضاعه الذي كان عنده وأردت أن أبتاعه منه وظننت أنه بائعه برخص فسألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا تشتره وإن أعطاكه بدرهم فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Aslam that his father said:                     \"I heard 'Umar say: 'I gave a horse to someone to ride in the cause of Allah, the Mighty and Sublime, and the one who kept it neglected it. I wanted to buy it back from him, and I thought that he would sell it at a cheap price. I asked the Messenger for Allah about that and he said: Do not buy it, even if he gives it to you for a Dirham. The one who takes back his charity is like the dog that goes back to its own vomit. \"'",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2641",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن سليمان بن يسار، عن عبد الله بن عباس، قال كان الفضل بن عباس رديف رسول الله صلى الله عليه وسلم فجاءته امرأة من خثعم تستفتيه وجعل الفضل ينظر إليها وتنظر إليه وجعل رسول الله صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر فقالت يا رسول الله إن فريضة الله في الحج على عباده أدركت أبي شيخا كبيرا لا يستطيع أن يثبت على الراحلة أفأحج عنه قال ‏\"‏ نعم ‏\"‏ ‏.‏ وذلك في حجة الوداع ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas:                     \"Al-Fadl bin 'Abbas was riding behind the Messenger of Allah when a woman from Khath'am came and asked him a question. Al-Fadl started looking at her and she at him, and the Messenger of Allah turned Al-Fadl's face to the other side. She said: 'O Messenger of Allah! The command of Allah has come for His slaves to perform Hajj, but my father is an old man and cannot sit firmly in the saddle; should I perform Hajj on his behalf ?, He said: 'Yes That happened during the Farwell Pilgrimage.''(Shih)",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "2661",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أناخ بالبطحاء التي بذي الحليفة وصلى بها ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar:                     That the Messenger of Allah stopped in the valley that is in Dhul-Hulaifah and prayed there. (sahih)",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2663",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن أسماء بنت عميس، أنها ولدت محمد بن أبي بكر الصديق بالبيداء فذكر أبو بكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ مرها فلتغتسل ثم لتهل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma bin 'Umais that:                     she gave birth to Muhammad bin Abi Bakr As-Siddiq in Al-Baida, Abu Bakr told the Messenger of Allah about that, and he said: \"Tell her to perform Gusl then begin the Talbiyah.''",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10530",
        "10535",
        "69"
      ]
    },
    {
      "hadith_no": "2666",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن دينار، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بزعفران أو بورس ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah forbade the Muhrim to wear clothes dyed with saffron or Wars.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "2764",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم في حجة الوداع فأهللنا بعمرة ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان معه هدى فليهلل بالحج مع العمرة ثم لا يحل حتى يحل منهما جميعا ‏\"‏ ‏.‏ فقدمت مكة وأنا حائض فلم أطف بالبيت ولا بين الصفا والمروة فشكوت ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ انقضي رأسك وامتشطي وأهلي بالحج ودعي العمرة ‏\"‏ ‏.‏ ففعلت فلما قضيت الحج أرسلني رسول الله صلى الله عليه وسلم مع عبد الرحمن بن أبي بكر إلى التنعيم فاعتمرت قال ‏\"‏ هذه مكان عمرتك ‏\"‏ ‏.‏ فطاف الذين أهلوا بالعمرة بالبيت وبين الصفا والمروة ثم حلوا ثم طافوا طوافا آخر بعد أن رجعوا من منى لحجهم وأما الذين جمعوا الحج والعمرة فإنما طافوا طوافا واحدا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"We set out with the Messenger of Allah for the Farewell Pligrimage and we entered Ihram for 'Umrah, then the Messenger of Allah said: 'Whoever has a Hadi with him, let him enter Ihram for both Hajj and 'Umrah, then do not exit Ihram until he exits Ihram for them both.' I came to Makkah and I had my menses, so I did not circumambulate the House or (Perform Sa'i) between As-Safa and Al-Marwah. I complained about that to the Messenger of Allah and he said: 'Undo your hair, and comb it, and enter Ihram for Hajj, and leave 'Umrah.' When I had completed Hajj, the Messenger of Allah sent me with 'Abdur-Rahman bin Abi Bakr to At-Tan'im, and I performed 'Umrah. He said: 'This is the place of your 'Umrah.' Then those who had entered Ihram for 'Umar circumambulated the House and (performed Sa'i) between As-Safa and Al-Marwah. Then they exited Ihram, then they performed Tawaf again, after they came back from Mina for their Hajj. As for those who combined Hajj and 'Umrah, they only performed one Tawaf.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2781",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، حدثني مالك، عن نافع، عن عبد الله بن عمر، عن حفصة، زوج النبي صلى الله عليه وسلم أنها قالت يا رسول الله ما شأن الناس قد حلوا بعمرة ولم تحلل أنت من عمرتك قال ‏\"‏ إني لبدت رأسي وقلدت هديي فلا أحل حتى أنحر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah, the wif3e of the Prophet, that she said:                     \"O Messenger of Allah, why is it that the people have exited Ihram for Umrah but you have not exited your Ihram for Umrah? He said: \"I have matted my hair and garlanded my Hadi, so I will not exit Ihram until I have offered the sacrifice.\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2818",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، قال أخبرني محمد بن إبراهيم بن الحارث، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، أنه أخبره عن البهزي، أن رسول الله صلى الله عليه وسلم خرج يريد مكة وهو محرم حتى إذا كانوا بالروحاء إذا حمار وحش عقير فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ دعوه فإنه يوشك أن يأتي صاحبه ‏\"‏ ‏.‏ فجاء البهزي وهو صاحبه إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله صلى الله عليه وسلم شأنكم بهذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر فقسمه بين الرفاق ثم مضى حتى إذا كان بالأثاية بين الرويثة والعرج إذا ظبى حاقف في ظل وفيه سهم فزعم أن رسول الله صلى الله عليه وسلم أمر رجلا يقف عنده لا يريبه أحد من الناس حتى يجاوزه ‏.‏",
      "text_en": " It was narrated from Al-Bahzi that:                     the Messenger of Allah set out for Makkah and was in Ihram. When they were in Ar-Rawha, they saw a wounded onager. Mention of that was made to the messenger of Allah and he said: \"Leave it, for soon its owner will come.\" Then Al-Bahzi, who was its owner, came to the Messenger of Allah, it is up to you what you want to do with this onager.\" The Messenger of Allah Commanded Abu Bakr to share it out among the company then he moved on, and when he was in Al-Uthayah, between Ar-Ruwaythah and Al-Arj, They was a gazelle sleeping in the Shade with an arrow in it. It was said that the Messenger of Allah told a man to stand by it and not let anyone disturb it until everyone had passed by.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الكريم بن مالك الجزري، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أنه كان مع رسول الله صلى الله عليه وسلم محرما فآذاه القمل في رأسه فأمره رسول الله صلى الله عليه وسلم أن يحلق رأسه وقال ‏\"‏ صم ثلاثة أيام أو أطعم ستة مساكين مدين مدين أو انسك شاة أى ذلك فعلت أجزأ عنك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kab bin Ujra:                     That he was with the Messenger of Allah in Ihram and he suffered an infestation of head lice. The Messenger of Allah commanded him to shave his head and told him: \"Fast for three days, or fed six poor persons two Mudds earch, or sacrifice a sheep. Whichever one of these you do will be sufficient for you.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2900",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن محمد بن أبي بكر الصديق، أخبر عبد الله بن عمر، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألم ترى أن قومك حين بنوا الكعبة اقتصروا عن قواعد إبراهيم عليه السلام ‏\"‏ ‏.‏ فقلت يا رسول الله ألا تردها على قواعد إبراهيم عليه السلام قال ‏\"‏ لولا حدثان قومك بالكفر ‏\"‏ ‏.‏ فقال عبد الله بن عمر لئن كانت عائشة سمعت هذا من رسول الله صلى الله عليه وسلم ما أرى ترك استلام الركنين اللذين يليان الحجر إلا أن البيت لم يتمم على قواعد إبراهيم عليه السلام ‏.‏",
      "text_en": " It was narrated from Aishah that the Messenger of Allah said:                     \"Don't you see that when your people (re)built the Kabah, they did not build it on all the foundations laid by Ibrahim, peace be upon him?\" I said: \"O Messenger of Allah, why do you not rebuild it on the foundation of Ihrahim, peace be upon him?\" He said: \"Were it not for the fact that your people have recently left disbelief (I would have done so).\" Abdullah bin Umar said: \"Aishah heard this from the Messenger of Allah, for I see that he would not touch the two corners facing Al-Hijr because the House not built on the foundations of Ihrahim, peace be upon him?\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "11011",
        "18",
        "53"
      ]
    },
    {
      "hadith_no": "2925",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم إني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ ب ‏{‏ الطور * وكتاب مسطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Salamah said:                     \"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2944",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم رمل من الحجر إلى الحجر حتى انتهى إليه ثلاثة أطواف ‏.‏",
      "text_en": " It was narrated that Jabir bin Abdullah said:                     \"I saw the Messenger of Allah walking rapidly from the Stone to the Stone, until he had finished three circuits.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "2972",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن جعفر بن محمد، عن أبيه، عن جابر، أن رسول الله صلى الله عليه وسلم كان إذا وقف على الصفا يكبر ثلاثا ويقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏ يصنع ذلك ثلاث مرات ويدعو ويصنع على المروة مثل ذلك ‏.‏",
      "text_en": " It was narrated from Jabir that:                     when the Messenger of Allah stood on top of As-Safa, he recited the Takbir three times and said: \"La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).\"  He did three times, and supplicated, and did the same a top Al-Marwah.",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10898",
        "11442",
        "34"
      ]
    }
  ],
  "total_hadiths": 114
}