{
  "id": "30238",
  "name": "N'ym bin Hmad bin Mua'wiya نعيم بن حماد بن معاوية بن الحارث",
  "full_name": "N'ym bin Hmad bin Mua'wiya نعيم بن حماد بن معاوية بن الحارث",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "228",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  مق  د  ت  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Khuza'i",
      "Egypt"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28607",
      "name": "Nwh bin Abi Maryam نوح بن أبي مريم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20458",
      "name": "Muhammad bin Maymun, Abu Hamza محمد بن ميمون المروزي أبو حمزة السكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-392",
      "hadith_no": "392",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا نعيم، قال حدثنا ابن المبارك، عن حميد الطويل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله‏.‏ فإذا قالوها وصلوا صلاتنا، واستقبلوا قبلتنا، وذبحوا ذبيحتنا، فقد حرمت علينا دماؤهم وأموالهم إلا بحقها، وحسابهم على الله ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"I have been ordered to fight the people till they say: 'None has the right to be worshipped but Allah.' And if they say so, pray like our prayers, face our Qibla and slaughter as we slaughter, then their blood and property will be sacred to us and we will not interfere with them except legally and their reckoning will be with Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30238",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3782",
      "hadith_no": "3782",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "وقال نعيم عن ابن المبارك، أخبرنا معمر، عن الزهري، أخبرني مولى، لأسامة بن زيد‏.‏ أن الحجاج بن أيمن ابن أم أيمن،، وكان، أيمن ابن أم أيمن أخا أسامة لأمه، وهو رجل من الأنصار، فرآه ابن عمر لم يتم ركوعه ولا سجوده فقال أعد‏.‏",
      "text_en": " The freed slave of Usama bin Zaid said, \"Al-Hajjaj bin Aiman bin Um Aiman and Aiman Ibn      Um Aiman was Usama's brother from the maternal side, and he was one of     the Ansar. He was seen by Ibn 'Umar not performing his bowing and      prostrations in a perfect manner. So Ibn 'Umar told him to repeat his      prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30238",
        "20025",
        "20115",
        "11013"
      ]
    },
    {
      "id": "sahih-bukhari-3897",
      "hadith_no": "3897",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا نعيم بن حماد، حدثنا هشيم، عن حصين، عن عمرو بن ميمون، قال رأيت في الجاهلية قردة اجتمع عليها قردة قد زنت، فرجموها فرجمتها معهم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     During the pre-lslamic period of ignorance I saw a she-monkey surrounded by a number of monkeys. They were all stoning it, because it had committed illegal sexual intercourse. I too, stoned it along with them.",
      "usc_msa_ref": "188",
      "chain": [
        "30238",
        "20468",
        "15097",
        "11382"
      ]
    },
    {
      "id": "sahih-bukhari-4383",
      "hadith_no": "4383",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمود، حدثنا عبد الرزاق، أخبرنا معمر، وحدثني نعيم، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن سالم، عن أبيه، قال بعث النبي صلى الله عليه وسلم خالد بن الوليد إلى بني جذيمة، فدعاهم إلى الإسلام فلم يحسنوا أن يقولوا أسلمنا‏.‏ فجعلوا يقولون صبأنا، صبأنا‏.‏ فجعل خالد يقتل منهم ويأسر، ودفع إلى كل رجل منا أسيره، حتى إذا كان يوم أمر خالد أن يقتل كل رجل منا أسيره فقلت والله لا أقتل أسيري، ولا يقتل رجل من أصحابي أسيره، حتى قدمنا على النبي صلى الله عليه وسلم فذكرناه، فرفع النبي صلى الله عليه وسلم يده فقال ‏\"‏ اللهم إني أبرأ إليك مما صنع خالد ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet sent Khalid bin Al-Walid to the tribe of Jadhima and Khalid invited them to Islam but they could not express themselves by saying, \"Aslamna (i.e. we have embraced Islam),\" but they started saying \"Saba'na! Saba'na (i.e. we have come out of one religion to another).\" Khalid kept on killing (some of) them and taking (some of) them as captives and gave every one of us his Captive. When there came the day then Khalid ordered that each man (i.e. Muslim soldier) should kill his captive, I said, \"By Allah, I will not kill my captive, and none of my companions will kill his captive.\" When we reached the Prophet, we mentioned to him the whole story. On that, the Prophet raised both his hands and said twice, \"O Allah! I am free from what Khalid has done.\"",
      "usc_msa_ref": "628",
      "chain": [
        "30277",
        "20121",
        "20115",
        "30238",
        "20025",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-74",
      "hadith_no": "74",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن الحلواني، قال حدثنا نعيم بن حماد، قال أبو إسحاق إبراهيم بن محمد بن سفيان وحدثنا محمد بن يحيى، قال حدثنا نعيم بن حماد، حدثنا أبو داود الطيالسي، عن شعبة، عن يونس بن عبيد، قال كان عمرو بن عبيد يكذب في الحديث ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30238",
        "11222",
        "30238",
        "20547",
        "20020",
        "11075",
        "24341"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1663",
      "hadith_no": "1663",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا نعيم بن حماد، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن المقدام بن معديكرب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ للشهيد عند الله ست خصال يغفر له في أول دفعة ويرى مقعده من الجنة ويجار من عذاب القبر ويأمن من الفزع الأكبر ويوضع على رأسه تاج الوقار الياقوتة منها خير من الدنيا وما فيها ويزوج اثنتين وسبعين زوجة من الحور العين ويشفع في سبعين من أقاربه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب ‏.‏",
      "text_en": " Narrated Al-Miqdam bin Ma'diykarib:                     That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30238",
        "20644",
        "11422"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2267-2",
      "hadith_no": "2267",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثنا نعيم بن حماد، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنكم في زمان من ترك منكم عشر ما أمر به هلك ثم يأتي زمان من عمل منهم بعشر ما أمر به نجا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث نعيم بن حماد عن سفيان بن عيينة ‏.‏ قال وفي الباب عن أبي ذر وأبي سعيد ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet(s.a.w) said:                     \"You are in a time when whoever abandons a tenth of what he has been ordered, then he is ruined. Then, there will come a time in which whoever does a tenth of what he has been ordered shall be saved.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30238",
        "20005",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1846",
      "hadith_no": "1846",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا نعيم بن حماد، حدثنا ابن المبارك، عن عيسى بن عمر بن موسى، عن نافع، عن ابن عمر، عن النبي  صلى الله عليه وسلم  أنه كان إذا اعتكف طرح له فراشه - أو يوضع له سريره وراء أصطوانة التوبة ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that:                      When the Prophet (ﷺ) observedI’tikaf, his bedding would be spread for him, or his bed would beplaced there for him, behind the Pillar or Repentance.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30238",
        "20025",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1896",
      "hadith_no": "1896",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا نعيم بن حماد، حدثنا ابن المبارك، حدثنا أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، عن النبي  صلى الله عليه وسلم  أنه أخذ من العسل العشر ‏.‏",
      "text_en": " Abdullah bin 'Amr narrated that:                     the Prophet took one-tenth of honey (as Zakat).",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30238",
        "20025",
        "50",
        "19934",
        "19911",
        "29"
      ]
    }
  ],
  "total_hadiths": 9
}