{
  "id": "30233",
  "name": "Sa'id bin Kathir bin 'Afayr سعيد بن كثير بن عفير",
  "full_name": "Sa'id bin Kathir bin 'Afayr سعيد بن كثير بن عفير",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "146",
      "date_gregorian": "NA",
      "date_display": [
        "146 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "226",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  قد  س  -  صدوق ]"
    ],
    "tags": [
      "Ansar",
      "Client",
      "al-Sa'di",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20275",
      "name": "K'hms bin al-Mnhal al-Sdwsy كهمس بن المنهال السدوسي أبو عثمان البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20379",
      "name": "Yahya bin Ayoub al-Ghafiqi يحيى بن أيوب الغافقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20185",
      "name": "Y'aqub bin 'Abdur Rahman يعقوب بن عبد الرحمن الإسكندراني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36009",
      "name": "Ahmed bin Yahya bin al-Wzyr أحمد بن يحيى بن الوزير",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36039",
      "name": "'Abdur Rahman bin 'Abdullah b. 'Abdul Ha عبد الرحمن بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36661",
      "name": "Abu al-Ahwas, Muhammad bin al-Haytham محمد بن الهيثم بن حماد أبو الأحوص قاضي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31932",
      "name": "Bkar bin Qtybh bin Asad بكار بن قتيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30347",
      "name": "'Abdullah bin Hmad عبد الله بن حماد بن أيوب",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30493",
      "name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36000",
      "name": "Ahmed bin Hmad bin Muslim أحمد بن حماد بن مسلم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "71",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال قال حميد بن عبد الرحمن سمعت معاوية، خطيبا يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين، وإنما أنا قاسم والله يعطي، ولن تزال هذه الأمة قائمة على أمر الله لا يضرهم من خالفهم حتى يأتي أمر الله ‏\"‏‏.‏",
      "text_en": " Narrated Muawiya:                     I heard Allah's Apostle saying, \"If Allah wants to do good to a person, He makes him comprehend the religion. I am just a distributor, but the grant is from Allah. (And remember) that this nation (true Muslims) will keep on following Allah's teachings strictly and they will not be harmed by any one going on a different path till Allah's order (Day of Judgment) is established.\"",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "hadith_no": "82",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، عن حمزة بن عبد الله بن عمر، أن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم أتيت بقدح لبن، فشربت حتى إني لأرى الري يخرج في أظفاري، ثم أعطيت فضلي عمر بن الخطاب ‏\"‏‏.‏ قالوا فما أولته يا رسول الله قال ‏\"‏ العلم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"While I was sleeping, I saw that a cup full of milk was brought to me and I drank my fill till I noticed (the milk) its wetness coming out of my nails. Then I gave the remaining milk to `Umar Ibn Al-Khattab\" The companions of the Prophet asked, \"What have you interpreted (about this dream)? \"O Allah's Apostle ,!\" he replied, \"(It is religious) knowledge.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "116",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن سالم، وأبي، بكر بن سليمان بن أبي حثمة أن عبد الله بن عمر، قال صلى بنا النبي صلى الله عليه وسلم العشاء في آخر حياته، فلما سلم قام فقال ‏\"‏ أرأيتكم ليلتكم هذه، فإن رأس مائة سنة منها لا يبقى ممن هو على ظهر الأرض أحد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once the Prophet led us in the `Isha' prayer during the last days of his life and after finishing it (the prayer) (with Taslim) he said: \"Do you realize (the importance of) this night?\" Nobody present on the surface of the earth tonight will be living after the completion of one hundred years from this night.\"",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "11011",
        "11547",
        "18"
      ]
    },
    {
      "hadith_no": "425",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أن عتبان بن مالك  وهو من أصحاب رسول الله صلى الله عليه وسلم ممن شهد بدرا من الأنصار  أنه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله، قد أنكرت بصري، وأنا أصلي لقومي، فإذا كانت الأمطار سال الوادي الذي بيني وبينهم، لم أستطع أن آتي مسجدهم فأصلي بهم، ووددت يا رسول الله أنك تأتيني فتصلي في بيتي، فأتخذه مصلى‏.‏ قال فقال له رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل إن شاء الله ‏\"‏‏.‏ قال عتبان فغدا رسول الله صلى الله عليه وسلم وأبو بكر حين ارتفع النهار، فاستأذن رسول الله صلى الله عليه وسلم فأذنت له، فلم يجلس حتى دخل البيت ثم قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ قال فأشرت له إلى ناحية من البيت، فقام رسول الله صلى الله عليه وسلم فكبر، فقمنا فصفنا، فصلى ركعتين ثم سلم، قال وحبسناه على خزيرة صنعناها له‏.‏ قال فثاب في البيت رجال من أهل الدار ذوو عدد فاجتمعوا، فقال قائل منهم أين مالك بن الدخيشن أو ابن الدخشن فقال بعضهم ذلك منافق لا يحب الله ورسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل ذلك، ألا تراه قد قال لا إله إلا الله‏.‏ يريد بذلك وجه الله ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال فإنا نرى وجهه ونصيحته إلى المنافقين‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال ابن شهاب ثم سألت الحصين بن محمد الأنصاري  وهو أحد بني سالم وهو من سراتهم  عن حديث محمود بن الربيع، فصدقه بذلك‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     who was one of the companions of Allah's Apostle and one of the Ansar's who took part in the battle of Badr: I came to Allah's Apostle and said, \"O Allah's Apostle I have weak eyesight and I lead my people in prayers. When it rains the water flows in the valley between me and my people so I cannot go to their mosque to lead them in prayer. O Allah's Apostle! I wish you would come to my house and pray in it so that I could take that place as a Musalla. Allah's Apostle said. \"Allah willing, I will do so.\" Next day after the sun rose high, Allah's Apostle and Abu Bakr came and Allah's Apostle asked for permission to enter. I gave him permission and he did not sit on entering the house but said to me, \"Where do you like me to pray?\" I pointed to a place in my house. So Allah's Apostle stood there and said, 'Allahu Akbar', and we all got up and aligned behind him and offered a two-rak`at prayer and ended it with Taslim. We requested him to stay for a meal called \"Khazira\" which we had prepared for him. Many members of our family gathered in the house and one of them said, \"Where is Malik bin Al-Dukhaishin or Ibn Al-Dukhshun?\" One of them replied, \"He is a hypocrite and does not love Allah and His Apostle.\" Hearing that, Allah's Apostle said, \"Do not say so. Haven't you seen that he said, 'None has the right to be worshipped but Allah' for Allah's sake only?\" He said, \"Allah and His Apostle know better. We have seen him helping and advising hypocrites.\" Allah's Apostle said, \"Allah has forbidden the (Hell) fire for those who say, 'None has the right to be worshipped but Allah' for Allah's sake only.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "855",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثنا ابن وهب، عن يونس، عن ابن شهاب، زعم عطاء أن جابر بن عبد الله، زعم أن النبي صلى الله عليه وسلم قال ‏\"‏ من أكل ثوما أو بصلا فليعتزلنا  أو قال  فليعتزل مسجدنا، وليقعد في بيته ‏\"‏‏.‏ وأن النبي صلى الله عليه وسلم أتي بقدر فيه خضرات من بقول، فوجد لها ريحا فسأل فأخبر بما فيها من البقول فقال ‏\"‏ قربوها ‏\"‏ إلى بعض أصحابه كان معه، فلما رآه كره أكلها قال ‏\"‏ كل فإني أناجي من لا تناجي ‏\"‏‏.‏وقال أحمد بن صالح عن ابن وهب أتي ببدر‏.‏ قال ابن وهب يعني طبقا فيه خضرات‏.‏ ولم يذكر الليث وأبو صفوان عن يونس قصة القدر، فلا أدري هو من قول الزهري أو في الحديث‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"Whoever eats garlic or onion should keep away from our mosque or should remain in his house.\" (Jabir bin `Abdullah, in another narration said, \"Once a big pot containing cooked vegetables was brought. On finding unpleasant smell coming from it, the Prophet asked, 'What is in it?' He was told all the names of the vegetables that were in it. The Prophet ordered that it should be brought near to some of his companions who were with him. When the Prophet saw it he disliked to eat it and said, 'Eat. (I don't eat) for I converse with those whom you don't converse with (i.e. the angels).",
      "chain": [
        "30233",
        "20029",
        "20475"
      ]
    },
    {
      "hadith_no": "1047",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثنا الليث، حدثني عقيل، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته‏.‏ أن رسول الله صلى الله عليه وسلم صلى يوم خسفت الشمس، فقام فكبر، فقرأ قراءة طويلة، ثم ركع ركوعا طويلا، ثم رفع رأسه، فقال سمع الله لمن حمده‏.‏ وقام كما هو، ثم قرأ قراءة طويلة، وهى أدنى من القراءة الأولى، ثم ركع ركوعا طويلا، وهى أدنى من الركعة الأولى، ثم سجد سجودا طويلا، ثم فعل في الركعة الآخرة مثل ذلك، ثم سلم وقد تجلت الشمس، فخطب الناس، فقال في كسوف الشمس والقمر ‏\"‏ إنهما آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتموهما فافزعوا إلى الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) On the day when the sun Khasafat (eclipsed) Allah's Apostle prayed; he stood up and said Takbir and recited a prolonged recitation, then he performed a prolonged bowing, then he raised his head and said, \"Sami`a l-lahu Lyman Hamidah,\" and then remained standing and recited a prolonged recitation which was shorter than the first. Then he performed a prolonged bowing which was shorter than the first. Then he prostrated and prolonged the prostration and he did the same in the second rak`a as in the first and then finished the prayer with Taslim. By that time the sun (eclipse) had cleared He addressed the people and said, \"The sun and the moon are two of the signs of Allah; they do not eclipse (Yakhsifan) because of the death or the life (i.e. birth) of someone. So when you see them make haste for the prayer.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "1243",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا الليث، مثله‏.‏ وقال نافع بن يزيد عن عقيل، ما يفعل به وتابعه شعيب وعمرو بن دينار ومعمر‏.‏",
      "text_en": " Narrated Al-Laith as above.:",
      "chain": [
        "30233",
        "20023",
        "20629"
      ]
    },
    {
      "hadith_no": "1516",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا ابن وهب، عن يونس، عن ابن شهاب، حدثني عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال وجد النبي صلى الله عليه وسلم شاة ميتة أعطيتها مولاة لميمونة من الصدقة، قال النبي صلى الله عليه وسلم ‏\"‏ هلا انتفعتم بجلدها ‏\"‏‏.‏ قالوا إنها ميتة‏.‏ قال ‏\"‏ إنما حرم أكلها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet saw a dead sheep which had been given in charity to a freed slave-girl of Maimuna, the wife of the Prophet . The Prophet said, \"Why don't you get the benefit of its hide?\" They said, \"It is dead.\" He replied, \"Only to eat (its meat) is illegal.\"",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2038",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن علي بن الحسين  رضى الله عنهما  أن صفية، زوج النبي صلى الله عليه وسلم أخبرته‏.‏ حدثنا عبد الله بن محمد حدثنا هشام أخبرنا معمر عن الزهري عن علي بن الحسين كان النبي صلى الله عليه وسلم في المسجد، وعنده أزواجه، فرحن، فقال لصفية بنت حيى ‏\"‏ لا تعجلي حتى أنصرف معك ‏\"‏‏.‏ وكان بيتها في دار أسامة، فخرج النبي صلى الله عليه وسلم معها، فلقيه رجلان من الأنصار، فنظرا إلى النبي صلى الله عليه وسلم ثم أجازا وقال لهما النبي صلى الله عليه وسلم ‏\"‏ تعاليا، إنها صفية بنت حيى ‏\"‏‏.‏ قالا سبحان الله يا رسول الله‏.‏ قال ‏\"‏ إن الشيطان يجري من الإنسان مجرى الدم، وإني خشيت أن يلقي في أنفسكما شيئا ‏\"‏‏.‏",
      "text_en": " Narrated `Ali bin Al-Husain (from Safiya the Prophet's wife):                     The wives of the Prophet were with him in the mosque (while he was in I`tikaf) and then they departed and the Prophet said to Safiya bint Huyai, \"Don't hurry up, for I shall accompany you,\" (and her dwelling was in the house of Usama). The Prophet went out and in the meantime two Ansari men met him and they looked at the Prophet and passed by. The Prophet said to them, \"Come here. She is (my wife) Safiya bint Huyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's Apostle! (we never expect anything bad from you).\" The Prophet replied, \"Satan circulates in the human being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in your minds.\"",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "2144",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني عامر بن سعد، أن أبا سعيد  رضى الله عنه  أخبره أن رسول الله صلى الله عليه وسلم نهى عن المنابذة، وهى طرح الرجل ثوبه بالبيع إلى الرجل، قبل أن يقلبه، أو ينظر إليه، ونهى عن الملامسة، والملامسة لمس الثوب لا ينظر إليه‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Allah's Apostle forbade the selling by Munabadha, i.e. to sell one's garment by casting it to the buyer not allowing him to examine or see it. Similarly he forbade the selling by Mulamasa. Mulamasa is to buy a garment, for example, by merely touching it, not looking at it.",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10554",
        "38"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال وزعم عروة أن مروان بن الحكم، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ أحب الحديث إلى أصدقه‏.‏ فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بهم ‏\"‏‏.‏ وقد كان رسول الله صلى الله عليه وسلم انتظرهم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد فإن إخوانكم هؤلاء قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب بذلك فليفعل، ومن أحب منكم أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك لرسول الله صلى الله عليه وسلم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن، فارجعوا حتى يرفعوا إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم، ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakam and Al-Miswar bin Makhrama:                     When the delegates of the tribe of Hawazin after embracing Islam, came to Allah's Apostle, he got up. They appealed to him to return their properties and their captives. Allah's Apostle said to them, \"The most beloved statement to me is the true one. So, you have the option of restoring your properties or your captives, for I have delayed distributing them.\" The narrator added, Allah's Apostle c had been waiting for them for more than ten days on his return from Taif. When they realized that Allah's Apostle would return to them only one of two things, they said, \"We choose our captives.\" So, Allah's Apostle got up in the gathering of the Muslims, praised Allah as He deserved, and said, \"Then after! These brethren of yours have come to you with repentance and I see it proper to return their captives to them. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you wants to stick to his share till we pay him from the very first booty which Allah will give us then he can do so.\" The people replied, \"We agree to give up our shares willingly as a favor for Allah's Apostle.\" Then Allah's Apostle said, \"We don't know who amongst you has agreed and who hasn't. Go back and your chiefs may tell us your opinion.\" So, all of them returned and their chiefs discussed the matter with them and then they (i.e. their chiefs) came to Allah's Apostle to tell him that they (i.e. the people) had given up their shares gladly and willingly.",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "858",
        "2201"
      ]
    },
    {
      "hadith_no": "2475",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، حدثنا عقيل، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن، ولا يشرب الخمر حين يشرب وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا ينتهب نهبة يرفع الناس إليه فيها أبصارهم حين ينتهبها وهو مؤمن ‏\"‏‏.‏ وعن سعيد وأبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم مثله إلا النهبة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at the time, he is doing it, and when a drinker of an alcoholic liquor drinks it, then he is not a believer at the time of drinking it, and when a thief steals, then he is not a believer at the time of stealing, and when a robber robs, and the people look at him, then he is not a believer at the time of doing robbery.",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "2903",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن سهل، قال لما كسرت بيضة النبي صلى الله عليه وسلم على رأسه وأدمي وجهه، وكسرت رباعيته، وكان علي يختلف بالماء في المجن، وكانت فاطمة تغسله، فلما رأت الدم يزيد على الماء كثرة عمدت إلى حصير، فأحرقتها وألصقتها على جرحه، فرقأ الدم‏.‏",
      "text_en": " Narrated Sahl:                     When the helmet of the Prophet was smashed on his head and blood covered his face and one of his front teeth got broken, `Ali brought the water in his shield and Fatima the Prophet's daughter) washed him. But when she saw that the bleeding increased more by the water, she took a mat, burnt it, and placed the ashes on the wound of the Prophet and so the blood stopped oozing out.",
      "chain": [
        "30233",
        "20185",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3101",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن علي بن حسين، أن صفية، زوج النبي صلى الله عليه وسلم أخبرته أنها جاءت رسول الله صلى الله عليه وسلم تزوره، وهو معتكف في المسجد في العشر الأواخر من رمضان ثم قامت تنقلب فقام معها رسول الله صلى الله عليه وسلم حتى إذا بلغ قريبا من باب المسجد عند باب أم سلمة زوج النبي صلى الله عليه وسلم مر بهما رجلان من الأنصار، فسلما على رسول الله صلى الله عليه وسلم، ثم نفذا فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ على رسلكما ‏\"‏‏.‏ قالا سبحان الله يا رسول الله‏.‏ وكبر عليهما ذلك‏.‏ فقال ‏\"‏ إن الشيطان يبلغ من الإنسان مبلغ الدم، وإني خشيت أن يقذف في قلوبكما شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Safiya:                     (the wife of the Prophet) That she came to visit Allah's Apostle while he was in I`tikaf (i.e. seclusion in the Mosque during the last ten days of Ramadan). When she got up to return, Allah's Apostle got up with her and accompanied her, and when he reached near the gate of the Mosque close to the door (of the house) of Um Salama, the wife of the Prophet, two Ansari men passed by them and greeted Allah's Apostle and then went away. Allah's Apostle addressed them saying, \"Don't hurry! (She is my wife),\" They said, \"Glorified be Allah! O Allah's Apostle (You are far away from any suspicion),\" and his saying was hard on them. Allah's Apostle said, \"Satan circulates in the mind of a person as blood does (in his body). I was afraid that Satan might put some (evil) thoughts in your minds.\"",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "3132",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال وزعم عروة أن مروان بن الحكم، ومسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قال حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ أحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى وإما المال، وقد كنت استأنيت بهم ‏\"‏‏.‏ وقد كان رسول الله صلى الله عليه وسلم انتظر آخرهم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين‏.‏ قالوا فإنا نختار سبينا، فقام رسول الله صلى الله عليه وسلم في المسلمين فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم هؤلاء قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، من أحب أن يطيب فليفعل، ومن أحب منكم أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله لهم‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن، فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏ فرجع الناس، فكلمهم عرفاؤهم، ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا فأذنوا‏.‏ فهذا الذي بلغنا عن سبى هوازن‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakim and Miswar bin Makhrama:                     When the Hawazin delegation came to Allah's Apostle after they had embraced Islam and requested him to return their properties and war prisoners to them, Allah's Apostle said, \"To me the best talk is the truest, so you may choose either of two things; the war prisoners or the wealth, for I have delayed their distribution.\" Allah's Apostle had waited for them for over ten days when he returned from Ta'if. So, when those people came to know that Allah's Apostle was not going to return to them except one of the two things the said, \"We choose our war Prisoners 'Allah's Apostle stood up amongst the Muslims, and after glorifying Allah as He deserved, he said, \"Now then, these brothers of yours have come to us with repentance, and I see it logical that I should return their captives to them, so whoever of you likes to do that as a favor then he can do it, and whoever amongst you likes to stick to his share, let him give up his prisoners and we will compensate him from the very first Fai' (i.e. war booty received without fight) which Allah will give us.\" On that, all the people said. 'O Allah's Apostles We have agreed willingly to do so (return the captives)\" Then Allah's Apostle said to them \"I do not know who amongst you has agreed to this and who has not. You should return and let your leaders inform me of your agreement.\" The people returned and their leaders spoke to them, and then came to Allah's Apostle and said, \"All the people have agreed willingly to do so and have given the permission to return the war prisoners (without Compensation)\" (Az-Zuhri, the sub-narrator states) This is what has been related to us about the captives of Hawazin.",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "858"
      ]
    },
    {
      "hadith_no": "3306",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا سعيد بن عفير، عن ابن وهب، قال حدثني يونس، عن ابن شهاب، عن عروة، يحدث عن عائشة  رضى الله عنها أن النبي صلى الله عليه وسلم قال للوزغ الفويسق‏.‏ ولم أسمعه أمر بقتله‏.‏ وزعم سعد بن أبي وقاص أن النبي صلى الله عليه وسلم أمر بقتله‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet called the Salamander, a mischief-doer. I have not heard him ordering that it should be killed. Sa`d bin Waqqas claims that the Prophet ordered that it should be killed.",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3864",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا الليث، قال كتب إلى هشام عن أبيه، عن عائشة  رضى الله عنها  قالت ما غرت على امرأة للنبي صلى الله عليه وسلم ما غرت على خديجة، هلكت قبل أن يتزوجني، لما كنت أسمعه يذكرها، وأمره الله أن يبشرها ببيت من قصب، وإن كان ليذبح الشاة فيهدي في خلائلها منها ما يسعهن‏.‏",
      "text_en": " Narrated `Aisha:                     I did not feel jealous of any of the wives of the Prophet as much as I did of Khadija (although) she died before he married me, for I often heard him mentioning her, and Allah had told him to give her the good tidings that she would have a palace of Qasab (i.e. pipes of precious stones and pearls in Paradise), and whenever he slaughtered a sheep, he would send her women-friends a good share of it.",
      "chain": [
        "30233",
        "20023",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4363",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني ليث، حدثني عقيل، عن ابن شهاب،‏.‏ وحدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب،، قال محمد بن شهاب وزعم عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم، فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بكم ‏\"‏‏.‏ وكان أنظرهم رسول الله صلى الله عليه وسلم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب منكم أن يكون على حظه، حتى نعطيه إياه من أول ما يفيء الله علينا، فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏ هذا الذي بلغني عن سبى هوازن‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegate of Hawazin came to Allah's Apostle declaring their conversion to Islam and asked him to return their properties and captives, Allah's Apostle got up and said to them, \"There Is involved in this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So choose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. have not distributed the booty).\" Allah's Apostle had delayed the distribution of their booty over ten nights after his return from Ta'if. So when they came to know that Allah's Apostle was not going to return to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Apostle got up amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have come to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to do that as a favor then he can do it. And whoever of you likes to stick to his share till we give him from the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that (i.e. return the captives) willingly as a favor, 'O Allah's Apostle!\" Allah's Apostle said, \"We do not know which of you have agreed to it and which have not; so go back and let your chiefs forward us your decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to Allah's Apostle and informed him that all of them had agreed (to give up their captives) with pleasure, and had given their permission (i.e. that the captives be returned to their people). (The sub-narrator said, \"That is what has reached me about the captives of Hawazin tribe.\")",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "4486",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عائشة، زوج النبي صلى الله عليه وسلم قالت لما ثقل رسول الله صلى الله عليه وسلم واشتد به وجعه استأذن أزواجه أن يمرض في بيتي، فأذن له، فخرج وهو بين الرجلين تخط رجلاه في الأرض، بين عباس بن عبد المطلب وبين رجل آخر‏.‏ قال عبيد الله فأخبرت عبد الله بالذي قالت عائشة، فقال لي عبد الله بن عباس هل تدري من الرجل الآخر الذي لم تسم عائشة قال قلت لا‏.‏ قال ابن عباس هو علي‏.‏ وكانت عائشة زوج النبي صلى الله عليه وسلم تحدث أن رسول الله صلى الله عليه وسلم لما دخل بيتي واشتد به وجعه قال ‏\"‏ هريقوا على من سبع قرب لم تحلل أوكيتهن لعلي أعهد إلى الناس ‏\"‏‏.‏ فأجلسناه في مخضب لحفصة زوج النبي صلى الله عليه وسلم، ثم طفقنا نصب عليه من تلك القرب، حتى طفق يشير إلينا بيده أن قد فعلتن قالت ثم خرج إلى الناس فصلى لهم وخطبهم‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) \"When the ailment of Allah's Apostle became aggravated, he requested his wives to permit him to be (treated) nursed in my house, and they gave him permission. He came out (to my house), walking between two men with his feet dragging on the ground, between `Abbas bin `Abdul--Muttalib and another man\" 'Ubaidullah said, \"I told `Abdullah of what `Aisha had said, `Abdullah bin `Abbas said to me, 'Do you know who is the other man whom `Aisha did not name?' I said, 'No.' Ibn `Abbas said, 'It was `Ali bin Abu Talib.\" `Aisha, the wife of the Prophet used to narrate saying, \"When Allah's Apostle entered my house and his disease became aggravated, he said, \" Pour on me the water of seven water skins, the mouths of which have not been untied, so that I may give advice to the people.' So we let him sit in a big basin belonging to Hafsa, the wife of the Prophet and then started to pour water on him from these water skins till he started pointing to us with his hands intending to say, 'You have done your job.\" `Aisha added, \"Then he went out to the people and led them in prayer and preached to them.\" `Aisha and `Abdullah bin `Abbas said, \"When Allah's Apostle became ill seriously, he started covering his face with his woolen sheet, and when he felt short of breath, he removed it from hi; face and said, 'That is so! Allah's (curse be on the Jews and the Christians, as they took the graves of their prophets as (places of worship),' intending to warn (the Muslims ) of what they had done.\" `Aisha added, \"I argued with Allah's Apostle repeatedly about that matter (i.e. his order that Abu Bakr should lead the people in prayer in his place when he was ill), and what made me argue so much, was, that it never occurred to my mind that after the Prophet, the people would ever love a man who had taken his place, and I felt that anybody standing in his place, would be a bad omen to the people, so I wanted Allah's Apostle to give up the idea of choosing Abu Bakr (to lead the people in prayer).",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "4491",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال حدثني أنس بن مالك  رضى الله عنه  أن المسلمين، بينا هم في صلاة الفجر من يوم الاثنين وأبو بكر يصلي لهم لم يفجأهم إلا رسول الله صلى الله عليه وسلم قد كشف ستر حجرة عائشة، فنظر إليهم وهم في صفوف الصلاة‏.‏ ثم تبسم يضحك، فنكص أبو بكر على عقبيه ليصل الصف، وظن أن رسول الله صلى الله عليه وسلم يريد أن يخرج إلى الصلاة فقال أنس وهم المسلمون أن يفتتنوا في صلاتهم فرحا برسول الله صلى الله عليه وسلم فأشار إليهم بيده رسول الله صلى الله عليه وسلم أن أتموا صلاتكم، ثم دخل الحجرة وأرخى الستر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While the Muslims were offering the Fajr prayer on Monday and Abu Bakr was leading them in prayer, suddenly Allah's Apostle lifted the curtain of `Aisha's dwelling and looked at them while they were in the rows of the prayers and smiled. Abu Bakr retreated to join the row, thinking that Allah's Apostle wanted to come out for the prayer. The Muslims were about to be put to trial in their prayer (i.e. were about to give up praying) because of being overjoyed at seeing Allah's Apostle. But Allah's Apostle beckoned them with his hand to complete their prayer and then entered the dwelling and let fall the curtain.",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4701",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، وأخبرني حميد بن عبد الرحمن، أن أبا هريرة  رضى الله عنه  قال بعثني أبو بكر في تلك الحجة في مؤذنين، بعثهم يوم النحر يؤذنون بمنى أن لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏ قال حميد بن عبد الرحمن ثم أردف رسول الله صلى الله عليه وسلم بعلي بن أبي طالب، وأمره أن يؤذن ببراءة‏.‏ قال أبو هريرة فأذن معنا علي يوم النحر في أهل منى ببراءة، وأن لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏",
      "text_en": " Narrated Humaid bin `Abdur-Rahman:                     Abu Huraira said, \"During that Hajj (in which Abu Bakr was the chief of the pilgrims) Abu Bakr sent me along with announcers on the Day of Nahr ( 10th of Dhul-Hijja) in Mina to announce: \"No pagans shall perform, Hajj after this year, and none shall perform the Tawaf around the Ka`ba in a naked state.\" Humaid bin `Abdur Rahman added: Then Allah's Apostle sent `Ali bin Abi Talib (after Abu Bakr) and ordered him to recite aloud in public Surat Bara'a. Abu Huraira added, \"So `Ali, along with us, recited Bara'a (loudly) before the people at Mina on the Day of Nahr and announced; \"No pagan shall perform Hajj after this year and none shall perform the Tawaf around the Ka`ba in a naked state.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "4860",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد بن مسافر، عن ابن شهاب، عن أبي سلمة، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يقبض الله الأرض، ويطوي السموات بيمينه، ثم يقول أنا الملك، أين ملوك الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"Allah will hold the whole earth, and roll all the heavens up in His Right Hand, and then He will say, 'I am the King; where are the kings of the earth?\"'",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5042",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال حدثني عبيد الله بن عبد الله، أن ابن عباس  رضى الله عنهما  حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرأني جبريل على حرف فراجعته، فلم أزل أستزيده ويزيدني حتى انتهى إلى سبعة أحرف ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle said, \"Gabriel recited the Qur'an to me in one way. Then I requested him (to read it in another way), and continued asking him to recite it in other ways, and he recited it in several ways till he ultimately recited it in seven different ways.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "5043",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال حدثني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، حدثاه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته فإذا هو يقرأ على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم فكدت أساوره في الصلاة فتصبرت حتى سلم فلببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرأ‏.‏ قال أقرأنيها رسول الله صلى الله عليه وسلم‏.‏ فقلت كذبت فإن رسول الله صلى الله عليه وسلم قد أقرأنيها على غير ما قرأت، فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ بسورة الفرقان على حروف لم تقرئنيها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله اقرأ يا هشام ‏\"‏‏.‏ فقرأ عليه القراءة التي سمعته يقرأ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت ‏\"‏‏.‏ ثم قال ‏\"‏ اقرأ يا عمر ‏\"‏‏.‏ فقرأت القراءة التي أقرأني، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت، إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Hisham bin Hakim reciting Surat Al-Furqan during the lifetime of Allah's Apostle and I listened to his recitation and noticed that he recited in several different ways which Allah's Apostle had not taught me. I was about to jump over him during his prayer, but I controlled my temper, and when he had completed his prayer, I put his upper garment around his neck and seized him by it and said, \"Who taught you this Sura which I heard you reciting?\" He replied, \"Allah's Apostle taught it to me.\" I said, \"You have told a lie, for Allah's Apostle has taught it to me in a different way from yours.\" So I dragged him to Allah's Apostle and said (to Allah's Apostle), \"I heard this person reciting Surat Al-Furqan in a way which you haven't taught me!\" On that Allah's Apostle said, \"Release him, (O `Umar!) Recite, O Hisham!\" Then he recited in the same way as I heard him reciting. Then Allah's Apostle said, \"It was revealed in this way,\" and added, \"Recite, O `Umar!\" I recited it as he had taught me. Allah's Apostle then said, \"It was revealed in this way. This Qur'an has been revealed to be recited in seven different ways, so recite of it whichever (way) is easier for you (or read as much of it as may be easy for you).",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10511",
        "2201",
        "3195",
        "3"
      ]
    },
    {
      "hadith_no": "5315",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، أخبرته أن امرأة رفاعة القرظي جاءت إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن رفاعة طلقني فبت طلاقي، وإني نكحت بعده عبد الرحمن بن الزبير القرظي، وإنما معه مثل الهدبة‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لعلك تريدين أن ترجعي إلى رفاعة، لا، حتى يذوق عسيلتك وتذوقي عسيلته ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The wife of Rifa`a Al-Qurazi came to Allah's Apostle and said, \"O Allah's Apostle! Rifa`a divorced me irrevocably. After him I married `Abdur-Rahman bin Az-Zubair Al-Qurazi who proved to be impotent.\" Allah's Apostle said to her, \"Perhaps you want to return to Rifa`a? Nay (you cannot return to Rifa`a) until you and `Abdur-Rahman consummate your marriage.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5367",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه ذكر التلاعن عند النبي صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا، ثم انصرف، فأتاه رجل من قومه يشكو إليه أنه وجد مع امرأته رجلا، فقال عاصم ما ابتليت بهذا إلا لقولي، فذهب به إلى النبي صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر، وكان الذي ادعى عليه أنه وجده عند أهله خدلا آدم كثير اللحم فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏‏.‏ فجاءت شبيها بالرجل الذي ذكر زوجها أنه وجده، فلاعن النبي صلى الله عليه وسلم بينهما‏.‏ قال رجل لابن عباس في المجلس هي التي قال النبي صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏‏.‏ فقال لا تلك امرأة كانت تظهر في الإسلام السوء قال أبو صالح وعبد الله بن يوسف خدلا‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     Ibn `Abbas; said, \"Once Lian was mentioned before the Prophet whereupon `Asim bin Adi said something and went away. Then a man from his tribe came to him, complaining that he had found a man width his wife. `Asim said, 'I have not been put to task except for my statement (about Lian).' `Asim took the man to the Prophet and the man told him of the state in which he had found his wife. The man was pale, thin, and of lank hair, while the other man whom he claimed he had seen with his wife, was brown, fat and had much flesh on his calves. The Prophet invoked, saying, 'O Allah! Reveal the truth.' So that lady delivered a child resembling the man whom her husband had mentioned he had found her with. The Prophet then made them carry out Lian.\" Then a man from that gathering asked Ibn `Abbas, \"Was she the same lady regarding which the Prophet had said, 'If I were to stone to death someone without witness, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was another lady who, though being a Muslim, used to arouse suspicion by her outright misbehavior. \"",
      "chain": [
        "30233",
        "20023",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "5410",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد بن مسافر، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خير الصدقة ما كان عن ظهر غنى، وابدأ بمن تعول ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The best alms is that which you give when you are rich, and you should start first to support your dependants.\"",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "5412",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني مالك بن أوس بن الحدثان، وكان، محمد بن جبير بن مطعم ذكر لي ذكرا من حديثه، فانطلقت حتى دخلت على مالك بن أوس فسألته فقال مالك انطلقت حتى أدخل على عمر، إذ أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن والزبير وسعد يستأذنون قال نعم‏.‏ فأذن لهم  قال  فدخلوا وسلموا فجلسوا، ثم لبث يرفا قليلا فقال لعمر هل لك في علي وعباس قال نعم‏.‏ فأذن لهما، فلما دخلا سلما وجلسا، فقال عباس يا أمير المؤمنين اقض بيني وبين هذا‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين اقض بينهما، وأرح أحدهما من الآخر‏.‏ فقال عمر اتئدوا أنشدكم بالله الذي به تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله كان خص رسوله صلى الله عليه وسلم في هذا المال بشىء لم يعطه أحدا غيره، قال الله ‏{‏ما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل‏}‏ إلى قوله ‏{‏قدير‏}‏‏.‏ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم والله ما احتازها دونكم ولا استأثر بها عليكم، لقد أعطاكموها وبثها فيكم، حتى بقي منها هذا المال، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي، فيجعله مجعل مال الله، فعمل بذلك رسول الله صلى الله عليه وسلم حياته، أنشدكم بالله، هل تعلمون ذلك قالوا نعم‏.‏ قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قالا نعم‏.‏ ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فقبضها أبو بكر يعمل فيها بما عمل به فيها رسول الله صلى الله عليه وسلم وأنتما حينئذ  وأقبل على علي وعباس  تزعمان أن أبا بكر كذا وكذا، والله يعلم أنه فيها صادق بار راشد تابع للحق، ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر، فقبضتها سنتين أعمل فيها بما عمل رسول الله صلى الله عليه وسلم وأبو بكر، ثم جئتماني وكلمتكما واحدة وأمركما جميع، جئتني تسألني نصيبك من ابن أخيك، وأتى هذا يسألني نصيب امرأته من أبيها، فقلت إن شئتما دفعته إليكما على أن عليكما عهد الله وميثاقه لتعملان فيها بما عمل به رسول الله صلى الله عليه وسلم وبما عمل به فيها أبو بكر، وبما عملت به فيها، منذ وليتها، وإلا فلا تكلماني فيها فقلتما ادفعها إلينا بذلك‏.‏ فدفعتها إليكما بذلك، أنشدكم بالله هل دفعتها إليهما بذلك فقال الرهط نعم‏.‏ قال فأقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك قالا نعم‏.‏ قال أفتلتمسان مني قضاء غير ذلك، فوالذي بإذنه تقوم السماء والأرض لا أقضي فيها قضاء غير ذلك، حتى تقوم الساعة، فإن عجزتما عنها فادفعاها فأنا أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus bin Al-Hadathan:                     Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, Yarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are seeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, and sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and `Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. `Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and his companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand fast ! Do you know that Allah's Apostle said. 'We (Apostles) do not bequeath anything to our heirs, but whatever we leave is to be given in charity.' And by that Allah's Apostles meant himself?\" The group said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both by Allah, do you know that Allah's Apostle said that?\" They said, 'Yes \" `Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of this property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah has bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either cavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to Allah's Apostle. But by Allah he neither withheld it from you, nor did he keep it for himself and deprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. And out of this property Allah's Apostle used to provide his family with their yearly needs, and whatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. Allah's Apostle kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you know that?\" They said, \"Yes.\" Then `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \"Yes.\" `Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of Allah's Apostle. So he took charge of that property and did with it the same what Allah's Apostle used to do, and both of you knew all about it then.\" Then `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! But Allah knows that he was honest, sincere, pious and right (in that matter). Then Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Apostle and Abu Bakr.' So I kept this property in my possession for the first two years of my rule, and I used to do the same with it as Allah's Apostle and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me with the same claim and the same problem. (O `Abbas!) You came to me demanding your share from (the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from (the inheritance of) her father. So I said to you, 'If you wish I will hand over this property to you, on condition that you both promise me before Allah that you will manage it in the same way as Allah's Apostle and Abu Bakr did, and as I have done since the beginning of my rule; otherwise you should not speak to me about it.' So you both said, 'Hand over this property to us on this condition.' And on this condition I handed it over to you. I beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" `Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you both on that condition?\" They both said, \"Yes.\" `Umar added, \"Do you want me now to give a decision other than that? By Him with Whose permission (order) both the Heaven and the Earth stand fast, I will never give any decision other than that till the Hour is established! But if you are unable to manage it (that property), then return it to me and I will be sufficient for it on your behalf . \"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "5030",
        "11058"
      ]
    },
    {
      "hadith_no": "5509",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال أخبرني أبو سلمة، قال أخبرني جابر بن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم بمر الظهران نجني الكباث فقال ‏\"‏ عليكم بالأسود منه، فإنه أيطب ‏\"‏‏.‏ فقال أكنت ترعى الغنم قال ‏\"‏ نعم، وهل من نبي إلا رعاها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     We were with Allah's Apostle collecting Al-Kabath at Mar-Az-Zahran. The Prophet said, \"Collect the black ones, for they are better.\" Somebody said, (O Allah's Apostle!) Have you ever shepherded sheep?\" He said, \"There has been no prophet but has shepherded them. \"",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "5781",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني سعيد بن عفير، حدثنا يعقوب بن عبد الرحمن القاري، عن أبي حازم، عن سهل بن سعد الساعدي، قال لما كسرت على رأس رسول الله صلى الله عليه وسلم البيضة، وأدمي وجهه، وكسرت رباعيته، وكان علي يختلف بالماء في المجن، وجاءت فاطمة تغسل عن وجهه الدم، فلما رأت فاطمة  عليها السلام  الدم يزيد على الماء كثرة عمدت إلى حصير فأحرقتها وألصقتها على جرح رسول الله صلى الله عليه وسلم فرقأ الدم‏.‏",
      "text_en": " Narrated Sahl bin Saud As-Sa`idi:                     When the helmet broke on the head of the Prophet and his face became covered with blood and his incisor tooth broke (i.e. during the battle of Uhud), `Ali used to bring water in his shield while Fatima was washing the blood off his face. When Fatima saw that the bleeding increased because of the water, she took a mat (of palm leaves), burnt it, and stuck it (the burnt ashes) on the wound of Allah's Apostle, whereupon the bleeding stopped.",
      "chain": [
        "30233",
        "20185",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5817",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا الليث، قال حدثنا عبد الرحمن بن خالد، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قضى في امرأتين من هذيل اقتتلتا، فرمت إحداهما الأخرى بحجر، فأصاب بطنها وهى حامل، فقتلت ولدها الذي في بطنها فاختصموا إلى النبي صلى الله عليه وسلم فقضى أن دية ما في بطنها غرة عبد أو أمة، فقال ولي المرأة التي غرمت كيف أغرم يا رسول الله من لا شرب، ولا أكل، ولا نطق، ولا استهل، فمثل ذلك يطل فقال النبي صلى الله عليه وسلم ‏\"‏ إنما هذا من إخوان الكهان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle gave his verdict about two ladies of the Hudhail tribe who had fought each other and one of them had hit the other with a stone. The stone hit her `Abdomen and as she was pregnant, the blow killed the child in her womb. They both filed their case with the Prophet and he judged that the blood money for what was in her womb. was a slave or a female slave. The guardian of the lady who was fined said, \"O Allah's Apostle! Shall I be fined for a creature that has neither drunk nor eaten, neither spoke nor cried? A case like that should be nullified.\" On that the Prophet said, \"This is one of the brothers of soothsayers.",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5831",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني ابن وهب، عن يونس، عن ابن شهاب، قال أخبرني سالم بن عبد الله، وحمزة، أن عبد الله بن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا عدوى، ولا طيرة، إنما الشؤم في ثلاث في الفرس، والمرأة، والدار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"there is neither 'Adha nor Tiyara, and an evil omen is only in three: a horse, a woman and a house.\" (See the foot-note of Hadith No. 649)",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5849",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن سالم بن عبد الله، أن أباه، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا رجل يجر إزاره، خسف به، فهو يتجلل في الأرض إلى يوم القيامة ‏\"‏‏.‏ تابعه يونس عن الزهري‏.‏ ولم يرفعه شعيب عن الزهري‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"While a man was dragging his Izar on the ground (behind him), suddenly Allah made him sink into the earth and he will go on sinking into it till the Day of Resurrection.\"",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6136",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ ما أظن فلانا وفلانا يعرفان من ديننا شيئا ‏\"‏‏.‏ قال الليث كانا رجلين من المنافقين‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"I do not think that so-and-so and so-and-so know anything of our religion.\" (And Al-Laith said, \"These two persons were among the hypocrites.\")",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6422",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، أخبرني سعيد بن المسيب، وعروة بن الزبير، في رجال من أهل العلم أن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يقول وهو صحيح ‏\"‏ لن يقبض نبي قط حتى يرى مقعده من الجنة ثم يخير ‏\"‏‏.‏ فلما نزل به ورأسه على فخذي، غشي عليه ساعة، ثم أفاق فأشخص بصره إلى السقف ثم قال ‏\"‏ اللهم الرفيق الأعلى ‏\"‏‏.‏ قلت إذا لا يختارنا، وعلمت أنه الحديث الذي كان يحدثنا، وهو صحيح‏.‏ قالت فكانت تلك آخر كلمة تكلم بها ‏\"‏ اللهم الرفيق الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle was healthy, he used to say, \"No prophet dies till he is shown his place in Paradise, and then he is given the option (to live or die).\" So when death approached him(during his illness), and while his head was on my thigh, he became unconscious for a while, and when he recovered, he fixed his eyes on the ceiling and said, \"O Allah! (Let me join) the Highest Companions (see Qur'an 4:69),\" I said, \"So, he does not choose us.\" Then I realized that it was the application of the statement he used to relate to us when he was healthy. So that was his last utterance (before he died), i.e. \"O Allah! (Let me join) the Highest Companions.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11002",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6660",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني ابن وهب، عن يونس، قال ابن شهاب حدثني أنس بن مالك  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏(‏إن قدر حوضي كما بين أيلة وصنعاء من اليمن، وإن فيه من الأباريق كعدد نجوم السماء‏)‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"The width of my Lake-Fount is equal to the distance between Aila (a town in Sham) and Sana' (the capital of Yemen) and it has as many (numerous) jugs as the number of stars of the sky.\"",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "6728",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال قال سالم قال ابن عمر سمعت عمر، يقول قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏‏.‏ قال عمر فوالله ما حلفت بها منذ سمعت النبي صلى الله عليه وسلم ذاكرا ولا آثرا‏.‏ قال مجاهد ‏{‏أو أثرة من علم‏}‏ يأثر علما‏.‏ تابعه عقيل والزبيدي وإسحاق الكلبي عن الزهري‏.‏ وقال ابن عيينة ومعمر عن الزهري عن سالم عن ابن عمر سمع النبي صلى الله عليه وسلم عمر‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard `Umar saying, \"Allah's Apostle said to me, 'Allah forbids you to swear by your fathers.\" `Umar said, \"By Allah! Since I heard that from the Prophet , I have not taken such an oath, neither intentionally, nor by reporting the oath of someone else.\"",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "11011",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "6914",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن ابن المسيب، وأبي، سلمة أن أبا هريرة، قال أتى رسول الله صلى الله عليه وسلم رجل من الناس وهو في المسجد فناداه يا رسول الله إني زنيت‏.‏ يريد نفسه، فأعرض عنه النبي صلى الله عليه وسلم فتنحى لشق وجهه الذي أعرض قبله فقال يا رسول الله إني زنيت‏.‏ فأعرض عنه، فجاء لشق وجه النبي صلى الله عليه وسلم الذي أعرض عنه، فلما شهد على نفسه أربع شهادات دعاه النبي صلى الله عليه وسلم فقال ‏\"‏ أبك جنون ‏\"‏‏.‏ قال لا يا رسول الله‏.‏ فقال ‏\"‏ أحصنت ‏\"‏‏.‏ قال نعم يا رسول الله‏.‏ قال ‏\"‏ اذهبوا فارجموه ‏\"‏‏.‏   قال ابن شهاب أخبرني من، سمع جابرا، قال فكنت فيمن رجمه، فرجمناه بالمصلى، فلما أذلقته الحجارة جمز حتى أدركناه بالحرة فرجمناه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man from among the people, came to Allah's Apostle while Allah's Apostle was sitting in the mosque, and addressed him, saying, \"O Allah's Apostle! I have committed an illegal sexual intercourse.\" The Prophet turned his face away from him. The man came to that side to which the Prophet had turned his face, and said, \"O Allah's Apostle! I have committed an illegal intercourse.\" The Prophet turned his face to the other side, and the man came to that side, and when he confessed four times, the Prophet called him and said, \"Are you mad?\" He said, \"No, O Allah's Apostle!\" The Prophet said, \"Are you married?\" He said, \"Yes, O Allah's Apostle.\" The Prophet said (to the people), \"Take him away and stone him to death.\" Ibn Shihab added, \"I was told by one who heard Jabir, that Jabir said, 'I was among those who stoned the man, and we stoned him at the Musalla (`Id praying Place), and when the stones troubled him, he jumped quickly and ran away, but we overtook him at Al-Harra and stoned him to death (there).' \"",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7089",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن عفير، حدثني الليث، حدثني عقيل، عن ابن شهاب، أخبرني خارجة بن زيد بن ثابت، أن أم العلاء  امرأة من الأنصار بايعت رسول الله صلى الله عليه وسلم  أخبرته أنهم اقتسموا المهاجرين قرعة‏.‏ قالت فطار لنا عثمان بن مظعون، وأنزلناه في أبياتنا، فوجع وجعه الذي توفي فيه، فلما توفي غسل وكفن في أثوابه دخل رسول الله صلى الله عليه وسلم فقلت رحمة الله عليك أبا السائب، فشهادتي عليك لقد أكرمك الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وما يدريك أن الله أكرمه ‏\"‏‏.‏ فقلت بأبي أنت يا رسول الله فمن يكرمه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما هو فوالله لقد جاءه اليقين، والله إني لأرجو له الخير، ووالله ما أدري وأنا رسول الله ماذا يفعل بي ‏\"‏‏.‏ فقالت والله لا أزكي بعده أحدا أبدا‏.‏",
      "text_en": " Narrated Kharija bin Zaid bin Thabit:                     Um Al-`Ala an Ansari woman who had given a pledge of allegiance to Allah's Apostle told me:, \"The Muhajirln (emigrants) were distributed amongst us by drawing lots, and we got `Uthman bin Maz'un in our share. We made him stay with us in our house. Then he suffered from a disease which proved fatal. When he died and was given a bath and was shrouded in his clothes. Allah's Apostle came, I said, (addressing the dead body), 'O Aba As-Sa'ib! May Allah be Merciful to you! I testify that Allah has honored you.' Allah's Apostle said, 'How do you know that Allah has honored him?\" I replied, 'Let my father be sacrificed for you, O Allah's Apostle! On whom else shall Allah bestow. His honor?' Allah's Apostle said, 'As for him, by Allah, death has come to him. By Allah, I wish him all good (from Allah). By Allah, in spite of the fact that I am Allah's Apostle, I do not know what Allah will do to me.\", Um Al-`Ala added, \"By Allah, I will never attest the righteousness of anybody after that.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11006"
      ]
    },
    {
      "hadith_no": "7095",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن عفير، حدثني الليث، حدثني عقيل، عن ابن شهاب، أخبرني أبو أمامة بن سهل، عن أبي سعيد الخدري  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بينا أنا نائم رأيت الناس عرضوا على، وعليهم قمص، فمنها ما يبلغ الثدى، ومنها ما يبلغ دون ذلك، وعرض على عمر بن الخطاب وعليه قميص يجتره ‏\"‏‏.‏ قالوا فما أولته يا رسول الله قال ‏\"‏ الدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"While I was sleeping, I saw (in a dream) the people being displayed before me, wearing shirts, some of which (were so short that it) reached as far as their breasts and some reached below that. Then `Umar bin Al-Khattab was shown to me and he was wearing a shirt which he was dragging (behind him).\" They asked. What have you interpreted (about the dream)? O Allah's Apostle?\" He said, \"The religion.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "15659",
        "38"
      ]
    },
    {
      "hadith_no": "7099",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا الليث، حدثني عقيل، عن ابن شهاب، أخبرني سعيد بن المسيب، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بعثت بجوامع الكلم، ونصرت بالرعب، وبينا أنا نائم أتيت بمفاتيح خزائن الأرض، فوضعت في يدي ‏\"‏‏.‏ قال محمد وبلغني أن جوامع الكلم أن الله يجمع الأمور الكثيرة التي كانت تكتب في الكتب قبله في الأمر الواحد والأمرين‏.‏ أو نحو ذلك‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"I have been sent with Jawami al-Kalim (i.e., the shortest expression carrying the widest meanings), and I was made victorious with awe (caste into the hearts of the enemy), and while I was sleeping, the keys of the treasures of the earth were brought to me and were put in my hand.\" Muhammad said, Jawami'-al-Kalim means that Allah expresses in one or two statements or thereabouts the numerous matters that used to be written in the books revealed before (the coming of) the Prophet .",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "7107",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن عفير، حدثني الليث، قال حدثني عقيل، عن ابن شهاب، أخبرني سعيد، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم رأيتني على قليب وعليها دلو، فنزعت منها ما شاء الله، ثم أخذها ابن أبي قحافة فنزع منها ذنوبا أو ذنوبين، وفي نزعه ضعف والله يغفر له، ثم استحالت غربا، فأخذها عمر بن الخطاب، فلم أر عبقريا من الناس ينزع نزع عمر بن الخطاب، حتى ضرب الناس بعطن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While I was sleeping, I saw myself standing at a well over which there was a bucket. I pulled out from it as many buckets of water as Allah wished, and then Ibn Abi Quhafa (Abu Bakr) took the bucket from me and pulled out one or two full buckets, and there was weakness in his pull--may Allah forgive him. Then the bucket turned into a very large one and `Umar bin Al-Khattab took it. I have never seen any strong man among the people, drawing water with such strength as `Umar did, till the people (drank to their satisfaction and) watered their camels to their fill; whereupon the camels sat beside the water.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "7109",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن عفير، حدثني الليث، حدثني عقيل، عن ابن شهاب، قال أخبرني سعيد بن المسيب، أن أبا هريرة، قال بينا نحن جلوس عند رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم رأيتني في الجنة، فإذا امرأة تتوضأ إلى جانب قصر، قلت لمن هذا القصر قالوا لعمر بن الخطاب‏.‏ فذكرت غيرته فوليت مدبرا ‏\"‏‏.‏ قال أبو هريرة فبكى عمر بن الخطاب ثم قال أعليك بأبي أنت وأمي يا رسول الله أغار",
      "text_en": " Narrated Abu Huraira:                     We were sitting with Allah's Apostle, he said, \"While I was sleeping, I saw myself in Paradise. Suddenly I saw a woman performing ablution beside a palace. I asked, \"For whom is this palace?\" They (the angels) replied, \"It is for `Umar bin Al-Khattab.\" Then I remembered `Umar's ghira and went back hurriedly.\" On hearing that, `Umar started weeping and said, \" Let my father and mother be sacrificed for you. O Allah's Apostle! How dare I think of my Ghira being offended by you?",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "7311",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا سعيد بن عفير، حدثني الليث، حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن أبي سلمة، وسعيد بن المسيب، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ والذي نفسي بيده لولا أن رجالا يكرهون أن يتخلفوا بعدي ولا أجد ما أحملهم ما تخلفت، لوددت أني أقتل في سبيل الله، ثم أحيا ثم أقتل، ثم أحيا ثم أقتل، ثم أحيا ثم أقتل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"By Him in Whose Hands my life is! Were it not for some men who dislike to be left behind and for whom I do not have means of conveyance, I would not stay away (from any Holy Battle). I would love to be martyred in Allah's Cause and come to life and then get, martyred and then come to life and then get martyred and then get resurrected and then get martyred.",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "6368",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنيه أبو بكر بن إسحاق، حدثنا سعيد بن عفير، حدثني سليمان بن بلال، حدثني  شريك بن عبد الله بن أبي نمر، سمعت سعيد بن المسيب، يقول حدثني أبو موسى الأشعري، ها هنا - وأشار لي سليمان إلى مجلس سعيد ناحية المقصورة - قال أبو موسى خرجت أريد رسول الله صلى الله عليه وسلم فوجدته قد سلك في الأموال فتبعته فوجدته قد دخل مالا فجلس في القف وكشف عن ساقيه ودلاهما في البئر ‏.‏ وساق الحديث بمعنى حديث يحيى بن حسان ولم يذكر قول سعيد فأولتها قبورهم ‏.‏",
      "text_en": "",
      "chain": [
        "30233",
        "20160",
        "11858",
        "11002",
        "41"
      ]
    },
    {
      "hadith_no": "3374",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني أحمد بن يحيى بن الوزير بن سليمان، قال حدثنا سعيد بن كثير بن عفير، قال أنبأنا سليمان بن بلال، عن يحيى بن سعيد، عن حميد الطويل، عن أنس، قال رأى رسول الله صلى الله عليه وسلم على - كأنه يعني عبد الرحمن بن عوف - أثر صفرة فقال ‏\"‏ مهيم ‏\"‏ ‏.‏ قال تزوجت امرأة من الأنصار ‏.‏ فقال ‏\"‏ أولم ولو بشاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Messenger of Allah saw a trace of yellow perfume on me\" -as if he meant 'Abdur-Rahman bin 'Awf- \"and said: 'What's this for?' He said: 'I have married a woman from among the Ansar.' He said: 'Give a Walimah (wedding feast) even if it is with one sheep.'\"",
      "chain": [
        "30233",
        "20160",
        "11062",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3388",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن يحيى بن الوزير، قال حدثنا سعيد بن كثير بن عفير، قال أخبرني سليمان بن بلال، عن يحيى بن سعيد، عن حميد الطويل، عن أنس، أنه سمعه يقول آخى رسول الله صلى الله عليه وسلم بين قريش والأنصار فآخى بين سعد بن الربيع وعبد الرحمن بن عوف فقال له سعد إن لي مالا فهو بيني وبينك شطران ولي امرأتان فانظر أيهما أحب إليك فأنا أطلقها فإذا حلت فتزوجها ‏.‏ قال بارك الله لك في أهلك ومالك دلوني - أى - على السوق ‏.‏ فلم يرجع حتى رجع بسمن وأقط قد أفضله ‏.‏ قال ورأى رسول الله صلى الله عليه وسلم على أثر صفرة فقال ‏\"‏ مهيم ‏\"‏ ‏.‏ فقلت تزوجت امرأة من الأنصار ‏.‏ فقال ‏\"‏ أولم ولو بشاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid At-Tawil that he heard Anas say:                      \"The Messenger of Allah established the bond of brotherhood between (some of) the Quraish and (some of) the Ansar, and he established the bond of brotherhood between Sa'd bin Ar-Rabi' and 'Abdur-Rahman bin 'Awf. Sa'd said to him: 'I have wealth, which I will share equally between you and me. And I have two wives, so look and see which one you like better, and I will divorce her, and when her 'Iddah is over you can marry her.' He said: 'May Allah bless your family and your wealth for you. Show me -i.e., where the market is.' And he did not come back until he brought some ghee, and cottage cheese that he had left over. He said: 'The Messenger of Allah saw traces of yellow perfume on me and he said: 'What is this for?' I said: 'I have married a woman from among the Ansar.' He said: 'Give a Walimah (wedding feast) even if it is with one sheep.'\"",
      "chain": [
        "36009",
        "30233",
        "20160",
        "11062",
        "11279",
        "19"
      ]
    }
  ],
  "total_hadiths": 47
}