{
  "id": "30237",
  "name": "'Amr bin Khalid al-Hirani عمرو بن خالد بن فروخ بن سعيد",
  "full_name": "'Amr bin Khalid al-Hirani عمرو بن خالد بن فروخ بن سعيد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "229",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hiran",
      "Jazira",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Khuza'i",
      "al-Hirani",
      "al-Jazri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28102",
      "name": "al-Hasan bin 'Umar/'Amr الحسن بن عمر - أبو المليح الرقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20446",
      "name": "'Atab bin Bashayr عتاب بن بشير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20672",
      "name": "Muhammad bin Salmah محمد بن سلمة بن عبد الله الباهلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26017",
      "name": "Dmam bin Isma'il bin Malik ضمام بن إسماعيل بن مالك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20465",
      "name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20185",
      "name": "Y'aqub bin 'Abdur Rahman يعقوب بن عبد الرحمن الإسكندراني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-12",
      "hadith_no": "12",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا الليث، عن يزيد، عن أبي الخير، عن عبد الله بن عمرو  رضى الله عنهما  أن رجلا، سأل النبي صلى الله عليه وسلم أى الإسلام خير قال ‏\"‏ تطعم الطعام، وتقرأ السلام على من عرفت ومن لم تعرف ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah bin 'Amr:                          A man asked the Prophet , \"What sort of deeds or (what qualities of)      Islam are good?\" The Prophet replied, 'To feed (the poor) and greet      those whom you know and those whom you do not Know (See      Hadith No. 27).",
      "usc_msa_ref": "11",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-40",
      "hadith_no": "40",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن البراء، أن النبي صلى الله عليه وسلم كان أول ما قدم المدينة نزل على أجداده  أو قال أخواله  من الأنصار، وأنه صلى قبل بيت المقدس ستة عشر شهرا، أو سبعة عشر شهرا، وكان يعجبه أن تكون قبلته قبل البيت، وأنه صلى أول صلاة صلاها صلاة العصر، وصلى معه قوم، فخرج رجل ممن صلى معه، فمر على أهل مسجد، وهم راكعون فقال أشهد بالله لقد صليت مع رسول الله صلى الله عليه وسلم قبل مكة، فداروا كما هم قبل البيت، وكانت اليهود قد أعجبهم إذ كان يصلي قبل بيت المقدس، وأهل الكتاب، فلما ولى وجهه قبل البيت أنكروا ذلك‏.‏ قال زهير حدثنا أبو إسحاق عن البراء في حديثه هذا أنه مات على القبلة قبل أن تحول رجال وقتلوا، فلم ندر ما نقول فيهم، فأنزل الله تعالى ‏{‏وما كان الله ليضيع إيمانكم‏}‏",
      "text_en": "      Narrated Al-Bara' (bin 'Azib):                          When the Prophet came to Medina, he stayed first with his grandfathers     or maternal uncles from Ansar. He offered his prayers facing      Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he      wished that he could pray facing the Ka'ba (at Mecca). The first      prayer which he offered facing the Ka'ba was the 'Asr prayer in the      company of some people. Then one of those who had offered that prayer      with him came out and passed by some people in a mosque who were      bowing during their prayers (facing Jerusalem). He said addressing      them, \"By Allah, I testify that I have prayed with Allah's Apostle      facing Mecca (Ka'ba).' Hearing that, those people changed their      direction towards the Ka'ba immediately. Jews and the people of the      scriptures used to be pleased to see the Prophet facing Jerusalem in      prayers but when he changed his direction towards the Ka'ba, during      the prayers, they disapproved of it.     Al-Bara' added, \"Before we changed our direction towards the Ka'ba      (Mecca) in prayers, some Muslims had died or had been killed and we      did not know what to say about them (regarding their prayers.) Allah      then revealed: And Allah would never make your faith (prayers) to be      lost (i.e. the prayers of those Muslims were valid).' \" (2:143).",
      "usc_msa_ref": "",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-203",
      "hadith_no": "203",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد الحراني، قال حدثنا الليث، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء، فصب عليه حين فرغ من حاجته، فتوضأ ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Once Allah's Apostle went out to answer the call of nature and I followed him with a tumbler containing water, and when he finished, I poured water and he performed ablution and passed wet hands over his Khuffs (socks made from thick fabric or leather).",
      "usc_msa_ref": "",
      "chain": [
        "30237",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "id": "sahih-bukhari-232",
      "hadith_no": "232",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا زهير، قال حدثنا عمرو بن ميمون بن مهران، عن سليمان بن يسار، عن عائشة، أنها كانت تغسل المني من ثوب النبي صلى الله عليه وسلم، ثم أراه فيه بقعة أو بقعا‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \"I used to wash it off the clothes of Allah's Apostle and he would go for the prayers while water spots were still visible on them.",
      "usc_msa_ref": "232",
      "chain": [
        "30237",
        "20321",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-725",
      "hadith_no": "725",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا زهير، عن حميد، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ أقيموا صفوفكم فإني أراكم من وراء ظهري ‏\"‏‏.‏ وكان أحدنا يلزق منكبه بمنكب صاحبه وقدمه بقدمه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Straighten your rows for I see you from behind my back.\" Anas added, \"Everyone of us used to put his shoulder with the shoulder of his companion and his foot with the foot of his companion.\"",
      "usc_msa_ref": "692",
      "chain": [
        "30237",
        "20321",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1701",
      "hadith_no": "1701",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت عبد الرحمن بن يزيد، يقول حج عبد الله  رضى الله عنه  فأتينا المزدلفة حين الأذان بالعتمة، أو قريبا من ذلك، فأمر رجلا فأذن وأقام، ثم صلى المغرب، وصلى بعدها ركعتين، ثم دعا بعشائه فتعشى، ثم أمر  أرى رجلا  فأذن وأقام  قال عمرو لا أعلم الشك إلا من زهير  ثم صلى العشاء ركعتين، فلما طلع الفجر قال إن النبي صلى الله عليه وسلم كان لا يصلي هذه الساعة إلا هذه الصلاة، في هذا المكان، من هذا اليوم‏.‏ قال عبد الله هما صلاتان تحولان عن وقتهما صلاة المغرب بعد ما يأتي الناس المزدلفة، والفجر حين يبزغ الفجر‏.‏ قال رأيت النبي صلى الله عليه وسلم يفعله‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     `Abdullah;- performed the Hajj and we reached Al-Muzdalifa at or about the time of the `Isha' prayer. He ordered a man to pronounce the Adhan and Iqama and then he offered the Maghrib prayer and offered two rak`at after it. Then he asked for his supper and took it, and then, I think, he ordered a man to pronounce the Adhan and Iqama (for the `Isha' prayer). (`Amr, a sub-narrator said: The intervening statement 'I think', was said by the sub-narrator Zuhair) (i.e. not by `Abdur-Rahman). Then `Abdullah offered two rak`at of `Isha' prayer. When the day dawned, `Abdullah said, \"The Prophet never offered any prayer at this hour except this prayer at this time and at this place and on this day.\" `Abdullah added, \"These two prayers are shifted from their actual times -- the Maghrib prayer (is offered) when the people reached Al-Muzdalifa and the Fajr (morning) prayer at the early dawn.\" `Abdullah added, \"I saw the Prophet doing that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30237",
        "20321",
        "11049",
        "20395"
      ]
    },
    {
      "id": "sahih-bukhari-2300",
      "hadith_no": "2300",
      "source": "Sahih Bukhari",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أن النبي صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته، فبقي عتود فذكره للنبي صلى الله عليه وسلم فقال ‏\"ضح به أنت.\"",
      "text_en": " Narrated `Uqba bin Amir:                     that the Prophet had given him sheep to distribute among his companions and a male kid was left (after the distribution). When he informed the Prophet of it, he said (to him), \"Offer it as a sacrifice on your behalf.\"",
      "usc_msa_ref": "497",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-2347",
      "hadith_no": "2347",
      "source": "Sahih Bukhari",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، عن رافع بن خديج، قال حدثني عماى، أنهم كانوا يكرون الأرض على عهد النبي صلى الله عليه وسلم بما ينبت على الأربعاء أو شىء يستثنيه صاحب الأرض فنهى النبي صلى الله عليه وسلم عن ذلك فقلت لرافع فكيف هي بالدينار والدرهم فقال رافع ليس بها بأس بالدينار والدرهم‏.‏ وقال الليث وكان الذي نهي عن ذلك ما لو نظر فيه ذوو الفهم بالحلال والحرام لم يجيزوه، لما فيه من المخاطرة‏.‏",
      "text_en": " Narrated Hanzla bin Qais:                     Rafi` bin Khadij said, \"My two uncles told me that they (i.e. the companions of the Prophet) used to rent the land in the lifetime of the Prophet for the yield on the banks of water streams (rivers) or for a portion of the yield stipulated by the owner of the land. The Prophet forbade it.\" I said to Rafi`, \"What about renting the land for Dinars and Dirhams?\" He replied, \"There is no harm in renting for Dinars- Dirhams. Al-Laith said, \"If those who have discernment for distinguishing what is legal from what is illegal looked into what has been forbidden concerning this matter they would not permit it, for it is surrounded with dangers.\"",
      "usc_msa_ref": "",
      "chain": [
        "30237",
        "20023",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-2930",
      "hadith_no": "2930",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء، وسأله، رجل أكنتم فررتم يا أبا عمارة يوم حنين قال لا، والله ما ولى رسول الله صلى الله عليه وسلم، ولكنه خرج شبان أصحابه وأخفاؤهم حسرا ليس بسلاح، فأتوا قوما رماة، جمع هوازن وبني نصر، ما يكاد يسقط لهم سهم، فرشقوهم رشقا ما يكادون يخطئون، فأقبلوا هنالك إلى النبي صلى الله عليه وسلم وهو على بغلته البيضاء، وابن عمه أبو سفيان بن الحارث بن عبد المطلب يقود به، فنزل واستنصر ثم قال أنا النبي لا كذب أنا ابن عبد المطلب ثم صف أصحابه‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     A man asked Al-Bara', \"O Abu '`Umara! Did you all flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah! Allah's Apostle did not flee, but his young unarmed companions passed by the archers of the tribe of Hawazin and Bani Nasr whose arrows hardly missed a target, and they threw arrows at them hardly missing a shot. So the Muslims retreated towards the Prophet while he was riding his white mule which was being led by his cousin Abu Sufyan bin Al-Harith bin `Abdul Muttalib. The Prophet dismounted and invoked Allah for victory; then he said, 'I am the Prophet, without a lie; I am the son of `Abdul Muttalib, and then he arranged his companions in rows.\"",
      "usc_msa_ref": "181",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-3039",
      "hadith_no": "3039",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  يحدث قال جعل النبي صلى الله عليه وسلم على الرجالة يوم أحد  وكانوا خمسين رجلا  عبد الله بن جبير فقال ‏\"‏ إن رأيتمونا تخطفنا الطير، فلا تبرحوا مكانكم هذا حتى أرسل إليكم، وإن رأيتمونا هزمنا القوم وأوطأناهم فلا تبرحوا حتى أرسل إليكم ‏\"‏ فهزموهم‏.‏ قال فأنا والله رأيت النساء يشتددن قد بدت خلاخلهن وأسوقهن رافعات ثيابهن، فقال أصحاب عبد الله بن جبير الغنيمة  أى قوم  الغنيمة، ظهر أصحابكم فما تنتظرون فقال عبد الله بن جبير أنسيتم ما قال لكم رسول الله صلى الله عليه وسلم قالوا والله لنأتين الناس فلنصيبن من الغنيمة‏.‏ فلما أتوهم صرفت وجوههم فأقبلوا منهزمين، فذاك إذ يدعوهم الرسول في أخراهم، فلم يبق مع النبي صلى الله عليه وسلم غير اثنى عشر رجلا، فأصابوا منا سبعين، وكان النبي صلى الله عليه وسلم وأصحابه أصاب من المشركين يوم بدر أربعين ومائة سبعين أسيرا وسبعين قتيلا، فقال أبو سفيان أفي القوم محمد ثلاث مرات، فنهاهم النبي صلى الله عليه وسلم أن يجيبوه ثم قال أفي القوم ابن أبي قحافة ثلاث مرات، ثم قال أفي القوم ابن الخطاب ثلاث مرات، ثم رجع إلى أصحابه فقال أما هؤلاء فقد قتلوا‏.‏ فما ملك عمر نفسه فقال كذبت والله يا عدو الله، إن الذين عددت لأحياء كلهم، وقد بقي لك ما يسوؤك‏.‏ قال يوم بيوم بدر، والحرب سجال، إنكم ستجدون في القوم مثلة لم آمر بها ولم تسؤني، ثم أخذ يرتجز أعل هبل، أعل هبل‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ألا تجيبوا له ‏\"‏‏.‏ قالوا يا رسول الله، ما نقول قال ‏\"‏ قولوا الله أعلى وأجل ‏\"‏‏.‏ قال إن لنا العزى ولا عزى لكم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا تجيبوا له ‏\"‏‏.‏ قال قالوا يا رسول الله، ما نقول قال ‏\"‏ قولوا الله مولانا ولا مولى لكم ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     The Prophet appointed `Abdullah bin Jubair as the commander of the infantry men (archers) who were fifty on the day (of the battle) of Uhud. He instructed them, \"Stick to your place, and don't leave it even if you see birds snatching us, till I send for you; and if you see that we have defeated the infidels and made them flee, even then you should not leave your place till I send for you.\" Then the infidels were defeated. By Allah, I saw the women fleeing lifting up their clothes revealing their leg-bangles and their legs. So, the companions of `Abdullah bin Jubair said, \"The booty! O people, the booty ! Your companions have become victorious, what are you waiting for now?\" `Abdullah bin Jubair said, \"Have you forgotten what Allah's Apostle said to you?\" They replied, \"By Allah! We will go to the people (i.e. the enemy) and collect our share from the war booty.\" But when they went to them, they were forced to turn back defeated. At that time Allah's Apostle in their rear was calling them back. Only twelve men remained with the Prophet and the infidels martyred seventy men from us. On the day (of the battle) of Badr, the Prophet and his companions had caused the 'Pagans to lose 140 men, seventy of whom were captured and seventy were killed. Then Abu Sufyan asked thrice, \"Is Muhammad present amongst these people?\" The Prophet ordered his companions not to answer him. Then he asked thrice, \"Is the son of Abu Quhafa present amongst these people?\" He asked again thrice, \"Is the son of Al-Khattab present amongst these people?\" He then returned to his companions and said, \"As for these (men), they have been killed.\" `Umar could not control himself and said (to Abu Sufyan), \"You told a lie, by Allah! O enemy of Allah! All those you have mentioned are alive, and the thing which will make you unhappy is still there.\" Abu Sufyan said, \"Our victory today is a counterbalance to yours in the battle of Badr, and in war (the victory) is always undecided and is shared in turns by the belligerents, and you will find some of your (killed) men mutilated, but I did not urge my men to do so, yet I do not feel sorry for their deed\" After that he started reciting cheerfully, \"O Hubal, be high! (1) On that the Prophet said (to his companions), \"Why don't you answer him back?\" They said, \"O Allah's Apostle What shall we say?\" He said, \"Say, Allah is Higher and more Sublime.\" (Then) Abu Sufyan said, \"We have the (idol) Al `Uzza, and you have no `Uzza.\" The Prophet said (to his companions), \"Why don't you answer him back?\" They asked, \"O Allah's Apostle! What shall we say?\" He said, \"Says Allah is our Helper and you have no helper.\"",
      "usc_msa_ref": "276",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-4005",
      "hadith_no": "4005",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء  رضى الله عنه  يقول حدثني أصحاب، محمد صلى الله عليه وسلم ممن شهد بدرا أنهم كانوا عدة أصحاب طالوت الذين جازوا معه النهر، بضعة عشر وثلاثمائة‏.‏ قال البراء لا والله ما جاوز معه النهر إلا مؤمن‏.‏",
      "text_en": " Narrated Al-Bara:                     The companions of (the Prophet) Muhammad who took part in Badr, told me that their number was that of Saul's (i.e. Talut's) companions who crossed the river (of Jordan) with him and they were over three-hundred-and-ten men. By Allah, none crossed the river with him but a believer. (See Qur'an 2:249)",
      "usc_msa_ref": "293",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-4008",
      "hadith_no": "4008",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، عن عمرو بن ميمون، عن عبد الله بن مسعود  رضى الله عنه  قال استقبل النبي صلى الله عليه وسلم الكعبة فدعا على نفر من قريش، على شيبة بن ربيعة، وعتبة بن ربيعة والوليد بن عتبة، وأبي جهل بن هشام‏.‏ فأشهد بالله لقد رأيتهم صرعى، قد غيرتهم الشمس، وكان يوما حارا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet faced the Ka`ba and invoked evil on some people of Quraish, on Shaiba bin Rabi`a, `Utba bin Rabi`a, Al-Walid bin `Utba and Abu Jahl bin Hisham. I bear witness, by Allah, that I saw them all dead, putrefied by the sun as that day was a very hot day.",
      "usc_msa_ref": "297",
      "chain": [
        "30237",
        "20321",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4035",
      "hadith_no": "4035",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  قال جعل النبي صلى الله عليه وسلم على الرماة يوم أحد عبد الله بن جبير، فأصابوا منا سبعين، وكان النبي صلى الله عليه وسلم وأصحابه أصابوا من المشركين يوم بدر أربعين ومائة سبعين أسيرا وسبعين قتيلا‏.‏ قال أبو سفيان يوم بيوم بدر، والحرب سجال‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     On the day of Uhud the Prophet appointed `Abdullah bin Jubair as chief of the archers, and seventy among us were injured and martyred. On the day (of the battle) of Badr, the Prophet and his companions had inflicted 140 casualties on the pagans, 70 were taken prisoners, and 70 were killed. Abu Sufyan said, \"This is a day of (revenge) for the day of Badr and the issue of war is undecided .\"",
      "usc_msa_ref": "322",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-4116",
      "hadith_no": "4116",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  قال جعل النبي صلى الله عليه وسلم على الرجالة يوم أحد عبد الله بن جبير، وأقبلوا منهزمين، فذاك إذ يدعوهم الرسول في أخراهم‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet appointed `Abdullah bin Jubair as the commander of the cavalry archers on the day of the battle of Uhud. Then they returned defeated, and that what is referred to by Allah's Statement:-- \"And the Apostle (Muhammad) in your rear was calling you.\" (3.153)",
      "usc_msa_ref": "396",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-4134",
      "hadith_no": "4134",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكني أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     One day the Prophet went out and offered the (funeral) prayer for the people (i.e. martyrs) of Uhud as he used to offer a funeral prayer for any dead person, and then (after returning) he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness upon you, and I am looking at my Tank just now, and I have been given the keys of the treasures of the world (or the keys of the world). By Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will compete with each other for (the pleasures of) this world.\"",
      "usc_msa_ref": "411",
      "chain": [
        "30237",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-4350",
      "hadith_no": "4350",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا عاصم، عن أبي عثمان، قال حدثني مجاشع، قال أتيت النبي صلى الله عليه وسلم بأخي بعد الفتح قلت يا رسول الله، جئتك بأخي لتبايعه على الهجرة‏.‏ قال ‏\"‏ ذهب أهل الهجرة بما فيها ‏\"‏‏.‏ فقلت على أى شىء تبايعه قال ‏\"‏ أبايعه على الإسلام والإيمان والجهاد ‏\"‏‏.‏",
      "text_en": " Narrated Majashi:                     I took my brother to the Prophet after the Conquest (of Mecca) and said, \"O Allah's Apostle! I have come to you with my brother so that you may take a pledge of allegiance from him for migration.\" The Prophet said, The people of migration (i.e. those who migrated to Medina before the Conquest) enjoyed the privileges of migration (i.e. there is no need for migration anymore).\" I said to the Prophet, \"For what will you take his pledge of allegiance?\" The Prophet said, \"I will take his pledge of allegiance for Islam, Belief, and for Jihad (i.e. fighting in Allah's Cause).",
      "usc_msa_ref": "598",
      "chain": [
        "30237",
        "20321",
        "11080",
        "11113"
      ]
    },
    {
      "id": "sahih-bukhari-4448",
      "hadith_no": "4448",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال حدثني زيد بن أرقم، أن النبي صلى الله عليه وسلم غزا تسع عشرة غزوة، وأنه حج بعد ما هاجر حجة واحدة لم يحج بعدها حجة الوداع‏.‏ قال أبو إسحاق وبمكة أخرى‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     The Prophet fought nineteen Ghazwas and performed only one Hajj after he migrated (to Medina), and did not perform another Hajj after it, and that was Hajj-ul-Wada`,' Abu 'Is-haq said, \"He performed when he was in Mecca.\"",
      "usc_msa_ref": "686",
      "chain": [
        "30237",
        "20321",
        "11049",
        "384"
      ]
    },
    {
      "id": "sahih-bukhari-4603",
      "hadith_no": "4603",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  قال جعل النبي صلى الله عليه وسلم على الرجالة يوم أحد عبد الله بن جبير، وأقبلوا منهزمين، فذاك إذ يدعوهم الرسول في أخراهم، ولم يبق مع النبي صلى الله عليه وسلم غير اثنى عشر رجلا‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     The Prophet appointed `Abdullah bin Jubair as the commander of the infantry during the battle of Uhud. They returned defeated, and that is what is meant by:-- \"And the Apostle was calling them back in the rear. None remained with the Prophet then, but twelve men.\"",
      "usc_msa_ref": "84",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-4677",
      "hadith_no": "4677",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد بن أبي حبيب، قال عطاء سمعت جابر بن عبد الله  رضى الله عنهما  سمعت النبي صلى الله عليه وسلم قال ‏\"‏ قاتل الله اليهود، لما حرم الله عليهم شحومها جملوه ثم باعوه فأكلوها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"May Allah curse the Jews! When Allah forbade them to eat the fat of animals, they melted it and sold it, and utilized its price! \"",
      "usc_msa_ref": "157",
      "chain": [
        "30237",
        "20023",
        "11411",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-4952",
      "hadith_no": "4952",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير بن معاوية، حدثنا أبو إسحاق، قال سمعت زيد بن أرقم، قال خرجنا مع النبي صلى الله عليه وسلم في سفر أصاب الناس فيه شدة، فقال عبد الله بن أبى لأصحابه لا تنفقوا على من عند رسول الله حتى ينفضوا من حوله‏.‏ وقال لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل‏.‏ فأتيت النبي صلى الله عليه وسلم فأخبرته فأرسل إلى عبد الله بن أبى فسأله، فاجتهد يمينه ما فعل، قالوا كذب زيد رسول الله صلى الله عليه وسلم فوقع في نفسي مما قالوا شدة، حتى أنزل الله عز وجل تصديقي في ‏{‏إذا جاءك المنافقون‏}‏ فدعاهم النبي صلى الله عليه وسلم ليستغفر لهم فلووا رءوسهم‏.‏ وقوله ‏{‏خشب مسندة‏}‏ قال كانوا رجالا أجمل شىء‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     We went out with the Prophet : on a journey and the people suffered from lack of provisions. So `Abdullah bin Ubai said to his companions, \"Don't spend on those who are with Allah's Apostle, that they may disperse and go away from him.\" He also said, \"If we return to Medina, surely, the more honorable will expel therefrom the meaner. So I went to the Prophet and informed him of that. He sent for `Abdullah bin Ubai and asked him, but `Abdullah bin Ubai swore that he did not say so. The people said, \"Zaid told a lie to 'Allah's Apostle.\" What they said distressed me very much. Later Allah revealed the confirmation of my statement in his saying:-- '(When the hypocrites come to you.' (63.1) So the Prophet called them that they might ask Allah to forgive them, but they turned their heads aside. (Concerning Allah's saying: 'Pieces of wood propped up,' Zaid said; They were the most handsome men.)",
      "usc_msa_ref": "",
      "chain": [
        "30237",
        "20321",
        "11049",
        "384"
      ]
    },
    {
      "id": "sahih-bukhari-5063",
      "hadith_no": "5063",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، عن البراء، قال كان رجل يقرأ سورة الكهف وإلى جانبه حصان مربوط بشطنين فتغشته سحابة فجعلت تدنو وتدنو وجعل فرسه ينفر فلما أصبح أتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ تلك السكينة تنزلت بالقرآن ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     A man was reciting Surat Al-Kahf and his horse was tied with two ropes beside him. A cloud came down and spread over that man, and it kept on coming closer and closer to him till his horse started jumping (as if afraid of something). When it was morning, the man came to the Prophet, and told him of that experience. The Prophet said, \"That was As-Sakina (tranquility) which descended because of (the recitation of) the Qur'an.\"",
      "usc_msa_ref": "531",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-5613",
      "hadith_no": "5613",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه أن النبي صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته ضحايا، فبقي عتود فذكره للنبي صلى الله عليه وسلم فقال ‏\"‏ ضح أنت به ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     that the Prophet gave him some sheep to distribute among his companions to slaughter as sacrifices (`Id--al--Adha). A kid was left and he told the Prophet of that whereupon he said to him, \"Slaughter it as a sacrifice (on your behalf).",
      "usc_msa_ref": "462",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-6670",
      "hadith_no": "6670",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة  رضى الله عنه  أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف على المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     Once the Prophet went out and offered the funeral prayers for the martyrs of Uhud, and then went to the pulpit and said, \"I am a predecessor for you and I am a witness for you: and by Allah, I am looking at my Fount just now, and the keys of the treasures of the earth (or the keys of the earth) have been given to me: and by Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will strive and struggle against each other over these treasures of the world.\"",
      "usc_msa_ref": "590",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-354",
      "hadith_no": "354",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عمرو بن خالد، حدثنا ابن لهيعة، عن قرة، عن ابن شهاب، عن سالم، عن أبيه، أن النبي  صلى الله عليه وسلم  نهى أن يصلى على قارعة الطريق أو يضرب الخلاء عليها أو يبال فيها ‏.‏",
      "text_en": " Salim narrated from his father that:                     The Prophet forbade praying in the middle of the road, or defecating there, or urinating.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30237",
        "20624",
        "11301",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-701",
      "hadith_no": "701",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن أبان البلخي، حدثنا عبد الرزاق، أنبأنا إسرائيل، عن عمرو بن خالد، عن زيد بن علي، عن أبيه، عن جده، عن علي بن أبي طالب، قال انكسرت إحدى زندى فسألت النبي  صلى الله عليه وسلم  فأمرني أن أمسح على الجبائر ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abu Talib said:                     \"I broke one of my forearms and I asked the Prophet about that. He told me to wipe over the bandages.\" (Maudu')Another chain with similar meaning.",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20121",
        "20311",
        "30237",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1163",
      "hadith_no": "1163",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عمرو بن خالد، حدثنا ابن لهيعة، عن محمد بن زيد بن مهاجر، عن محمد بن المنكدر، عن جابر بن عبد الله، أن النبي  صلى الله عليه وسلم  كان إذا صعد المنبر سلم ‏.‏",
      "text_en": " It wasnarrated from Jabir that whenever the Prophet (ﷺ) ascendedthepulpit he would greet (the people with Salam).",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30237",
        "20624",
        "11217",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1529",
      "hadith_no": "1529",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الرحمن المحاربي، حدثنا عباد بن كثير، عن عمرو بن خالد، عن حبيب بن أبي ثابت، عن عاصم بن ضمرة، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من غسل ميتا وكفنه وحنطه وحمله وصلى عليه ولم يفش عليه ما رأى خرج من خطيئته مثل يوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:                     “Whoeverwashes a deceased person, shrouds him, embalms him, carrieshim andoffers the funeral prayer for him, and does not disclose whathe hasseen, he will emerge from his sins as on the day his motherborehim.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20333",
        "24224",
        "30237",
        "11331",
        "19871",
        "5"
      ]
    }
  ],
  "total_hadiths": 27
}