{
  "id": "30232",
  "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
  "full_name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "144",
      "date_gregorian": "NA",
      "date_display": [
        "144 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]",
      "Fiqh",
      "Hadith"
    ],
    "tags": [
      "Ally B.Jumah",
      "Client",
      "al-Masri",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20507",
      "name": "'Abdullah bin 'Umar bin Hafs bin 'Asim عبد الله بن عمر بن حفص بن عاصم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20154",
      "name": "Isma'il bin Ibrahim bin 'Uqba إسماعيل بن إبراهيم بن عقبة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10887",
      "name": "Ibrahim bin Suwayd al-Nkh'y إبراهيم بن سويد النخعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20179",
      "name": "Muhammad bin Matraf محمد بن مطرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30516",
      "name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36001",
      "name": "Ahmed bin Sa'd bin al-Hakam أحمد بن سعد بن الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38092",
      "name": "Ishaq bin Ibrahim bin Swyd إسحاق بن إبراهيم بن سويد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38198",
      "name": "Hameedd bin Zanjuya حميد بن مخلد بن قتيبة - بن زنجويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38420",
      "name": "'Umar bin al-Khtab al-Sjstany عمر بن الخطاب السجستاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "28034",
      "name": "Ishaq bin al-Sabah al-Kundi al-Ash'athi إسحاق بن الصباح الكندي الأشعثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36057",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Rahim محمد بن عبد الله بن عبد الرحيم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30292",
      "name": "Ahmed bin al-Hasan bin Junaydab أحمد بن الحسن بن جنيدب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30275",
      "name": "Muhammad bin Mskyn bin Nmylh محمد بن مسكين بن نميلة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36039",
      "name": "'Abdur Rahman bin 'Abdullah b. 'Abdul Ha عبد الرحمن بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38661",
      "name": "Maymun bin al-'Abbas ميمون بن العباس",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30268",
      "name": "Muhammad bin Khlf al-Hdady محمد بن خلف الحدادي أبو بكر البغدادي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "28676",
      "name": "Abu al-Hasan al-Sqlany أبو الحسن العسقلاني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38259",
      "name": "Sahl bin Znjlh سهل بن زنجلة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36618",
      "name": "al-Qasim bin Salam القاسم بن سلام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38697",
      "name": "Yahya bin Ayoub bin Bady يحيى بن أيوب بن بادي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36066",
      "name": "Yahya bin 'Uthman bin Salah يحيى بن عثمان بن صالح",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "103",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال أخبرنا نافع بن عمر، قال حدثني ابن أبي مليكة، أن عائشة، زوج النبي صلى الله عليه وسلم كانت لا تسمع شيئا لا تعرفه إلا راجعت فيه حتى تعرفه، وأن النبي صلى الله عليه وسلم قال ‏\"‏ من حوسب عذب ‏\"‏‏.‏ قالت عائشة فقلت أو ليس يقول الله تعالى ‏{‏فسوف يحاسب حسابا يسيرا‏}‏ قالت فقال ‏\"‏ إنما ذلك العرض، ولكن من نوقش الحساب يهلك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abu Mulaika:                     Whenever `Aisha (the wife of the Prophet) heard anything which she did not understand, she used to ask again till she understood it completely. Aisha said: \"Once the Prophet said, \"Whoever will be called to account (about his deeds on the Day of Resurrection) will surely be punished.\" I said, \"Doesn't Allah say: \"He surely will receive an easy reckoning.\" (84.8) The Prophet replied, \"This means only the presentation of the accounts but whoever will be argued about his account, will certainly be ruined.\"",
      "chain": [
        "30232",
        "20203",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال أخبرنا محمد بن جعفر، قال أخبرني زيد  هو ابن أسلم  عن عياض بن عبد الله، عن أبي سعيد الخدري، قال خرج رسول الله صلى الله عليه وسلم في أضحى  أو فطر  إلى المصلى، فمر على النساء فقال ‏\"‏ يا معشر النساء تصدقن، فإني أريتكن أكثر أهل النار ‏\"‏‏.‏ فقلن وبم يا رسول الله قال ‏\"‏ تكثرن اللعن، وتكفرن العشير، ما رأيت من ناقصات عقل ودين أذهب للب الرجل الحازم من إحداكن ‏\"‏‏.‏ قلن وما نقصان ديننا وعقلنا يا رسول الله قال ‏\"‏ أليس شهادة المرأة مثل نصف شهادة الرجل ‏\"‏‏.‏ قلن بلى‏.‏ قال ‏\"‏ فذلك من نقصان عقلها، أليس إذا حاضت لم تصل ولم تصم ‏\"‏‏.‏ قلن بلى‏.‏ قال ‏\"‏ فذلك من نقصان دينها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Once Allah's Apostle went out to the Musalla (to offer the prayer) o `Id-al-Adha or Al-Fitr prayer. Then he passed by the women and said, \"O women! Give alms, as I have seen that the majority of the dwellers of Hell-fire were you (women).\" They asked, \"Why is it so, O Allah's Apostle ?\" He replied, \"You curse frequently and are ungrateful to your husbands. I have not seen anyone more deficient in intelligence and religion than you. A cautious sensible man could be led astray by some of you.\" The women asked, \"O Allah's Apostle! What is deficient in our intelligence and religion?\" He said, \"Is not the evidence of two women equal to the witness of one man?\" They replied in the affirmative. He said, \"This is the deficiency in her intelligence. Isn't it true that a woman can neither pray nor fast during her menses?\" The women replied in the affirmative. He said, \"This is the deficiency in her religion.\"",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "393",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "قال ابن أبي مريم أخبرنا يحيى، حدثنا حميد، حدثنا أنس، عن النبي صلى الله عليه وسلم‏.‏ وقال علي بن عبد الله حدثنا خالد بن الحارث قال حدثنا حميد قال سأل ميمون بن سياه أنس بن مالك قال يا أبا حمزة، ما يحرم دم العبد وماله فقال من شهد أن لا إله إلا الله، واستقبل قبلتنا، وصلى صلاتنا، وأكل ذبيحتنا، فهو المسلم، له ما للمسلم، وعليه ما على المسلم‏.‏",
      "text_en": " Narrated Maimun bin Siyah that he asked Anas bin Malik, \"O Abu Hamza! What makes the life and property of a person sacred?\" He replied, \"Whoever says, 'None has the right to be worshipped but Allah', faces our Qibla during the prayers, prays like us and eats our slaughtered animal, then he is a Muslim, and has got the same rights and obligations as other Muslims have.\"",
      "chain": [
        "30232",
        "30020",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن أبي مريم، قال أخبرنا يحيى بن أيوب، قال حدثني حميد، قال سمعت أنسا، بهذا‏.‏",
      "text_en": " Narrated Anas:                     as above (395).",
      "chain": [
        "30232",
        "20379",
        "11279"
      ]
    },
    {
      "hadith_no": "745",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا ابن أبي مريم، قال أخبرنا نافع بن عمر، قال حدثني ابن أبي مليكة، عن أسماء بنت أبي بكر، أن النبي صلى الله عليه وسلم صلى صلاة الكسوف، فقام فأطال القيام، ثم ركع فأطال الركوع، ثم قام فأطال القيام، ثم ركع فأطال الركوع ثم رفع، ثم سجد فأطال السجود، ثم رفع، ثم سجد فأطال السجود، ثم قام فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال القيام ثم ركع فأطال الركوع ثم رفع فسجد فأطال السجود، ثم رفع، ثم سجد فأطال السجود ثم انصرف فقال ‏\"‏ قد دنت مني الجنة حتى لو اجترأت عليها لجئتكم بقطاف من قطافها، ودنت مني النار حتى قلت أى رب وأنا معهم فإذا امرأة  حسبت أنه قال  تخدشها هرة قلت ما شأن هذه قالوا حبستها حتى ماتت جوعا، لا أطعمتها، ولا أرسلتها تأكل ‏\"‏‏.‏ قال نافع حسبت أنه قال ‏\"‏ من خشيش أو خشاش الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     The Prophet once offered the eclipse prayer. He stood for a long time and then did a prolonged bowing. He stood up straight again and kept on standing for a long time, then bowed a long bowing and then stood up straight and then prostrated a prolonged prostration and then lifted his head and prostrated a prolonged prostration. And then he stood up for a long time and then did a prolonged bowing and then stood up straight again and kept on standing for a long time. Then he bowed a long bowing and then stood up straight and then prostrated a prolonged prostration and then lifted his head and went for a prolonged prostration. On completion o the prayer, he said, \"Paradise became s near to me that if I had dared, I would have plucked one of its bunches for you and Hell became so near to me that said, 'O my Lord will I be among those people?' Then suddenly I saw a woman and a cat was lacerating her with it claws. On inquiring, it was said that the woman had imprisoned the cat till it died of starvation and she neither fed it no freed it so that it could feed itself.\"",
      "chain": [
        "30232",
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "918",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا محمد بن جعفر، قال أخبرني يحيى بن سعيد، قال أخبرني ابن أنس، أنه سمع جابر بن عبد الله، قال كان جذع يقوم إليه النبي صلى الله عليه وسلم فلما وضع له المنبر سمعنا للجذع مثل أصوات العشار حتى نزل النبي صلى الله عليه وسلم فوضع يده عليه‏.‏ قال سليمان عن يحيى أخبرني حفص بن عبيد الله بن أنس أنه سمع جابرا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to stand by a stem of a date-palm tree (while delivering a sermon). When the pulpit was placed for him we heard that stem crying like a pregnant she-camel till the Prophet got down from the pulpit and placed his hand over it.",
      "chain": [
        "30232",
        "20173",
        "11062",
        "34"
      ]
    },
    {
      "hadith_no": "938",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كانت فينا امرأة تجعل على أربعاء في مزرعة لها سلقا، فكانت إذا كان يوم جمعة تنزع أصول السلق فتجعله في قدر، ثم تجعل عليه قبضة من شعير تطحنها، فتكون أصول السلق عرقه، وكنا ننصرف من صلاة الجمعة فنسلم عليها، فتقرب ذلك الطعام إلينا فنلعقه، وكنا نتمنى يوم الجمعة لطعامها ذلك‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was a woman amongst us who had a farm and she used to sow Silq (a kind of vegetable) on the edges of streams in her farm. On Fridays she used to pull out the Silq from its roots and put the roots in a utensil. Then she would put a handful of powdered barley over it and cook it. The roots of the Silq were a substitute for meat. After finishing the Jumua prayer we used to greet her and she would give us that food which we would eat with our hands, and because of that meal, we used to look forward to Friday.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "941",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كنا نصلي مع النبي صلى الله عليه وسلم الجمعة ثم تكون القائلة‏.‏",
      "text_en": " Narrated Sahl:                     We used to offer the Jumua prayer with the Prophet and then take the afternoon nap.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "956",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يخرج يوم الفطر والأضحى إلى المصلى، فأول شىء يبدأ به الصلاة ثم ينصرف، فيقوم مقابل الناس، والناس جلوس على صفوفهم، فيعظهم ويوصيهم ويأمرهم، فإن كان يريد أن يقطع بعثا قطعه، أو يأمر بشىء أمر به، ثم ينصرف‏.‏ قال أبو سعيد فلم يزل الناس على ذلك حتى خرجت مع مروان وهو أمير المدينة في أضحى أو فطر، فلما أتينا المصلى إذا منبر بناه كثير بن الصلت، فإذا مروان يريد أن يرتقيه قبل أن يصلي، فجبذت بثوبه فجبذني فارتفع، فخطب قبل الصلاة، فقلت له غيرتم والله‏.‏ فقال أبا سعيد، قد ذهب ما تعلم‏.‏ فقلت ما أعلم والله خير مما لا أعلم‏.‏ فقال إن الناس لم يكونوا يجلسون لنا بعد الصلاة فجعلتها قبل الصلاة‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet used to proceed to the Musalla on the days of Id-ul-Fitr and Id-ul-Adha; the first thing to begin with was the prayer and after that he would stand in front of the people and the people would keep sitting in their rows. Then he would preach to them, advise them and give them orders, (i.e. Khutba). And after that if he wished to send an army for an expedition, he would do so; or if he wanted to give and order, he would do so, and then depart. The people followed this tradition till I went out with Marwan, the Governor of Medina, for the prayer of Id-ul-Adha or Id-ul-Fitr. When we reached the Musalla, there was a pulpit made by Kathir bin As-Salt. Marwan wanted to get up on that pulpit before the prayer. I got hold of his clothes but he pulled them and ascended the pulpit and delivered the Khutba before the prayer. I said to him, \"By Allah, you have changed (the Prophet's tradition).\" He replied, \"O Abu Sa`id! Gone is that which you know.\" I said, \"By Allah! What I know is better than what I do not know.\" Marwan said, \"People do not sit to listen to our Khutba after the prayer, so I delivered the Khutba before the prayer.\"",
      "chain": [
        "30232",
        "20173",
        "15",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1034",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال أخبرنا محمد بن جعفر، قال أخبرني حميد، أنه سمع أنسا، يقول كانت الريح الشديدة إذا هبت عرف ذلك في وجه النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     Whenever a strong wind blew, anxiety appeared on the face of the Prophet (fearing that wind might be a sign of Allah's wrath).",
      "chain": [
        "30232",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1388",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا محمد بن جعفر، قال أخبرني هشام، عن أبيه، عن عائشة  رضى الله عنها ‏.‏ أن رجلا، قال للنبي صلى الله عليه وسلم إن أمي افتلتت نفسها، وأظنها لو تكلمت تصدقت، فهل لها أجر إن تصدقت عنها قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     A man said to the Prophet (p.b.u.h), \"My mother died suddenly and I thought that if she had lived she would have given alms. So, if I give alms now on her behalf, will she get the reward?\" The Prophet replied in the affirmative.",
      "chain": [
        "30232",
        "20173",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1485",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله، عن أبي سعيد الخدري  رضى الله عنه  خرج رسول الله صلى الله عليه وسلم في أضحى أو فطر إلى المصلى ثم انصرف فوعظ الناس وأمرهم بالصدقة فقال ‏\"‏ أيها الناس تصدقوا ‏\"‏‏.‏ فمر على النساء فقال ‏\"‏ يا معشر النساء تصدقن، فإني رأيتكن أكثر أهل النار ‏\"‏‏.‏ فقلن وبم ذلك يا رسول الله قال ‏\"‏ تكثرن اللعن وتكفرن العشير، ما رأيت من ناقصات عقل ودين أذهب للب الرجل الحازم من إحداكن يا معشر النساء ‏\"‏‏.‏ ثم انصرف فلما صار إلى منزله جاءت زينب امرأة ابن مسعود تستأذن عليه فقيل يا رسول الله هذه زينب فقال ‏\"‏ أى الزيانب ‏\"‏‏.‏ فقيل امرأة ابن مسعود‏.‏ قال ‏\"‏ نعم ائذنوا لها ‏\"‏‏.‏ فأذن لها قالت يا نبي الله إنك أمرت اليوم بالصدقة، وكان عندي حلي لي، فأردت أن أتصدق به، فزعم ابن مسعود أنه وولده أحق من تصدقت به عليهم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ابن مسعود، زوجك وولدك أحق من تصدقت به عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     On `Id ul Fitr or `Id ul Adha Allah's Apostle (p.b.u.h) went out to the Musalla. After finishing the prayer, he delivered the sermon and ordered the people to give alms. He said, \"O people! Give alms.\" Then he went towards the women and said. \"O women! Give alms, for I have seen that the majority of the dwellers of Hell-Fire were you (women).\" The women asked, \"O Allah's Apostle! What is the reason for it?\" He replied, \"O women! You curse frequently, and are ungrateful to your husbands. I have not seen anyone more deficient in intelligence and religion than you. O women, some of you can lead a cautious wise man astray.\" Then he left. And when he reached his house, Zainab, the wife of Ibn Mas`ud, came and asked permission to enter It was said, \"O Allah's Apostle! It is Zainab.\" He asked, 'Which Zainab?\" The reply was that she was the wife of Ibn Mas'ub. He said, \"Yes, allow her to enter.\" And she was admitted. Then she said, \"O Prophet of Allah! Today you ordered people to give alms and I had an ornament and intended to give it as alms, but Ibn Mas`ud said that he and his children deserved it more than anybody else.\" The Prophet replied, \"Ibn Mas`ud had spoken the truth. Your husband and your children had more right to it than anybody else.\"",
      "chain": [
        "30232",
        "20173",
        "15",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1507",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا عبد الله بن وهب، قال أخبرني يونس بن يزيد، عن الزهري، عن سالم بن عبد الله، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ فيما سقت السماء والعيون أو كان عثريا العشر، وما سقي بالنضح نصف العشر ‏\"‏‏.‏ قال أبو عبد الله هذا تفسير الأول لأنه لم يوقت في الأول  يعني حديث ابن عمر  وفيما سقت السماء العشر وبين في هذا ووقت، والزيادة مقبولة، والمفسر يقضي على المبهم إذا رواه أهل الثبت، كما روى الفضل بن عباس أن النبي صلى الله عليه وسلم لم يصل في الكعبة‏.‏ وقال بلال قد صلى‏.‏ فأخذ بقول بلال وترك قول الفضل‏.‏",
      "text_en": " Narrated Salim bin `Abdullah from his father:                     The Prophet said, \"On a land irrigated by rain water or by natural water channels or if the land is wet due to a near by water channel Ushr (i.e. one-tenth) is compulsory (as Zakat); and on the land irrigated by the well, half of an Ushr (i.e. one-twentieth) is compulsory (as Zakat on the yield of the land).\"",
      "chain": [
        "30232",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1631",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، أن عمر بن الخطاب  رضى الله عنه  قال للركن أما والله إني لأعلم أنك حجر لا تضر ولا تنفع، ولولا أني رأيت النبي صلى الله عليه وسلم استلمك ما استلمتك‏.‏ فاستلمه، ثم قال فما لنا وللرمل إنما كنا راءينا به المشركين، وقد أهلكهم الله‏.‏ ثم قال شىء صنعه النبي صلى الله عليه وسلم فلا نحب أن نتركه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father who said:                     \"`Umar bin Al-Khattab addressed the Corner (Black Stone) saying, 'By Allah! I know that you are a stone and can neither benefit nor harm. Had I not seen the Prophet touching (and kissing) you, I would never have touched (and kissed) you.' Then he kissed it and said, 'There is no reason for us to do Ramal (in Tawaf) except that we wanted to show off before the pagans, and now Allah has destroyed them.' `Umar added, '(Nevertheless), the Prophet did that and we do not want to leave it (i.e. Ramal).'",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1697",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا إبراهيم بن سويد، حدثني عمرو بن أبي عمرو، مولى المطلب أخبرني سعيد بن جبير، مولى والبة الكوفي حدثني ابن عباس  رضى الله عنهما  أنه دفع مع النبي صلى الله عليه وسلم يوم عرفة فسمع النبي صلى الله عليه وسلم وراءه زجرا شديدا وضربا وصوتا للإبل فأشار بسوطه إليهم وقال ‏\"‏ أيها الناس عليكم بالسكينة، فإن البر ليس بالإيضاع ‏\"‏‏.‏ أوضعوا أسرعوا‏.‏ خلالكم من التخلل بينكم، وفجرنا خلالهما‏.‏ بينهما‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     I proceeded along with the Prophet on the day of `Arafat (9th Dhul-Hijja). The Prophet heard a great hue and cry and the beating of camels behind him. So he beckoned to the people with his lash, \"O people! Be quiet. Hastening is not a sign of righteousness.\"",
      "chain": [
        "30232",
        "10887",
        "11209",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1830",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني حميد، أنه سمع أنسا  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم إذا قدم من سفر، فأبصر درجات المدينة أوضع ناقته، وإن كانت دابة حركها‏.‏ قال أبو عبد الله زاد الحارث بن عمير عن حميد حركها من حبها‏.‏",
      "text_en": " Narrated Humaid:                     Anas said, \"Whenever Allah's Apostle returned from a journey, he, on seeing the high places of Medina, would make his she-camel proceed faster; and if it were another animal, even then he used to make it proceed faster.\" Narrated Humaid that the Prophet used to make it proceed faster out of his love for Medina.",
      "chain": [
        "30232",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1834",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، قال كنت مع عبد الله بن عمر  رضى الله عنهما  بطريق مكة، فبلغه عن صفية بنت أبي عبيد شدة وجع فأسرع السير، حتى كان بعد غروب الشفق نزل، فصلى المغرب والعتمة، جمع بينهما، ثم قال إني رأيت النبي صلى الله عليه وسلم إذا جد به السير أخر المغرب، وجمع بينهما‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     I was with Ibn `Umar on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was seriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet had to hasten when traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and the `Isha prayers together).",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا ابن أبي حازم، عن أبيه، عن سهل بن سعد، ح‏.‏ حدثني سعيد بن أبي مريم، حدثنا أبو غسان، محمد بن مطرف قال حدثني أبو حازم، عن سهل بن سعد، قال أنزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ ولم ينزل من الفجر، فكان رجال إذا أرادوا الصوم ربط أحدهم في رجله الخيط الأبيض والخيط الأسود، ولم يزل يأكل حتى يتبين له رؤيتهما، فأنزل الله بعد ‏{‏من الفجر‏}‏ فعلموا أنه إنما يعني الليل والنهار‏.‏",
      "text_en": " Narrated Sahl bin Saud:                     When the following verses were revealed: 'Eat and drink until the white thread appears to you, distinct from the black thread' and of dawn was not revealed, some people who intended to fast, tied black and white threads to their legs and went on eating till they differentiated between the two. Allah then revealed the words, 'of dawn', and it became clear that meant night and day.",
      "chain": [
        "30232",
        "20165",
        "11172",
        "399",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1951",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال حدثني زيد، عن عياض، عن أبي سعيد  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أليس إذا حاضت لم تصل، ولم تصم فذلك نقصان دينها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"Isn't it true that a woman does not pray and does not fast on menstruating? And that is the defect (a loss) in her religion.\"",
      "chain": [
        "30232",
        "20173",
        "15",
        "38"
      ]
    },
    {
      "hadith_no": "2351",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم بقدح فشرب منه، وعن يمينه غلام أصغر القوم، والأشياخ عن يساره فقال ‏\"‏ يا غلام أتأذن لي أن أعطيه الأشياخ ‏\"‏‏.‏ قال ما كنت لأوثر بفضلي منك أحدا يا رسول الله‏.‏ فأعطاه إياه‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A tumbler (full of milk or water) was brought to the Prophet who drank from it, while on his right side there was sitting a boy who was the youngest of those who were present and on his left side there were old men. The Prophet asked, \"O boy, will you allow me to give it (i.e. the rest of the drink) to the old men?\" The boy said, \"O Allah's Apostle! I will not give preference to anyone over me to drink the rest of it from which you have drunk.\" So, the Prophet gave it to him.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2364",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا نافع بن عمر، عن ابن أبي مليكة، عن أسماء بنت أبي بكر  رضى الله عنهما  أن النبي صلى الله عليه وسلم صلى صلاة الكسوف، فقال ‏\"‏ دنت مني النار حتى قلت أى رب، وأنا معهم فإذا امرأة  حسبت أنه قال  تخدشها هرة قال ما شأن هذه قالوا حبستها حتى ماتت جوعا ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     The Prophet prayed the eclipse prayer, and then said, \"Hell was displayed so close that I said, 'O my Lord ! Am I going to be one of its inhabitants?\"' Suddenly he saw a woman. I think he said, who was being scratched by a cat. He said, \"What is wrong with her?\" He was told, \"She had imprisoned it (i.e. the cat) till it died of hunger.\"",
      "chain": [
        "30232",
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "2539",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا ابن أبي مريم، قال أخبرني الليث، عن عقيل، عن ابن شهاب، ذكر عروة أن مروان، والمسور بن مخرمة، أخبراه أن النبي صلى الله عليه وسلم قام حين جاءه وفد هوازن، فسألوه أن يرد إليهم أموالهم وسبيهم فقال ‏\"‏ إن معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما المال، وإما السبى، وقد كنت استأنيت بهم ‏\"‏‏.‏ وكان النبي صلى الله عليه وسلم انتظرهم بضع عشرة ليلة حين قفل من الطائف، فلما تبين لهم أن النبي صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام النبي صلى الله عليه وسلم في الناس، فأثنى على الله بما هو أهله، ثم قال ‏\"‏ أما بعد فإن إخوانكم جاءونا تائبين، وإني رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس طيبنا ذلك‏.‏ قال ‏\"‏ إنا لا ندري من أذن منكم ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس، فكلمهم عرفاؤهم، ثم رجعوا إلى النبي صلى الله عليه وسلم فأخبروه أنهم طيبوا وأذنوا، فهذا الذي بلغنا عن سبى هوازن‏.‏ وقال أنس قال عباس للنبي صلى الله عليه وسلم فاديت نفسي، وفاديت عقيلا‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegates of the tribe of Hawazin came to the Prophet and they requested him to return their properties and captives. The Prophet stood up and said to them, \"I have other people with me in this matter (as you see) and the most beloved statement to me is the true one; you may choose either the properties or the prisoners as I have delayed their distribution.\" The Prophet had waited for them for more than ten days since his arrival from Ta'if. So, when it became evident to them that the Prophet was not going to return them except one of the two, they said, \"We choose our prisoners.\" The Prophet got up amongst the people and glorified and praised Allah as He deserved and said, \"Then after, these brethren of yours have come to us with repentance, and I see it logical to return them the captives. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you likes to stick to his share till we recompense him from the very first war booty which Allah will give us, then he can do so (i.e. give up the present captives).\" The people unanimously said, \"We do that (return the captives) willingly.\" The Prophet said, \"We do not know which of you has agreed to it and which have not, so go back and let your leaders forward us your decision.\" So, all the people then went back and discussed the matter with their leaders who returned and informed the Prophet that all the people had willingly given their consent to return the captives. This is what has reached us about the captives of Hawazin. Narrated Anas that `Abbas said to the Prophet, \"I paid for my ransom and `Aqil's ransom.\"",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "hadith_no": "2569",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل  رضى الله عنه  أن النبي صلى الله عليه وسلم أرسل إلى امرأة من المهاجرين، وكان لها غلام نجار قال لها ‏\"‏ مري عبدك فليعمل لنا أعواد المنبر ‏\"‏‏.‏ فأمرت عبدها، فذهب فقطع من الطرفاء، فصنع له منبرا، فلما قضاه أرسلت إلى النبي صلى الله عليه وسلم أنه قد قضاه، قال صلى الله عليه وسلم ‏\"‏ أرسلي به إلى ‏\"‏‏.‏ فجاءوا به فاحتمله النبي صلى الله عليه وسلم فوضعه حيث ترون‏.‏",
      "text_en": " Narrated Sahl:                     The Prophet sent for a woman from the emigrants and she had a slave who was a carpenter. The Prophet said to her \"Order your slave to prepare the wood (pieces) for the pulpit.\" So, she ordered her slave who went and cut the wood from the tamarisk and prepared the pulpit, for the Prophet. When he finished the pulpit, the woman informed the Prophet that it had been finished. The Prophet asked her to send that pulpit to him, so they brought it. The Prophet lifted it and placed it at the place in which you see now.\"",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2583",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا الليث، قال حدثني عقيل، عن ابن شهاب، قال ذكر عروة أن المسور بن مخرمة، رضى الله عنهما ومروان أخبراه أن النبي صلى الله عليه وسلم حين جاءه وفد هوازن قام في الناس، فأثنى على الله بما هو أهله، ثم قال ‏\"‏ أما بعد، فإن إخوانكم جاءونا تائبين، وإني رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا ‏\"‏‏.‏ فقال الناس طيبنا لك‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama and Marwan:                     When the delegates of the tribe of Hawazin came to the Prophet he stood up amongst the people, Glorified and Praised Allah as He deserved, and said, \"Then after: Your brethren have come to you with repentance and I see it logical to return to them their captives; so whoever amongst you likes to do that as a favor, then he can do it, and whoever of you like to stick to his share till we give him his right from the very first Fai (war booty) (1) which Allah will bestow on us, then (he can do so).\" The people replied, \"We do that (to return the captives) willingly as a favor for your sake.\"",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "hadith_no": "2658",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ أليس شهادة المرأة مثل نصف شهادة الرجل ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فذلك من نقصان عقلها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Isn't the witness of a woman equal to half of that of a man?\" The women said, \"Yes.\" He said, \"This is because of the deficiency of a woman's mind.\"",
      "chain": [
        "30232",
        "20173",
        "15",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه أن أناسا، من بني عمرو بن عوف كان بينهم شىء، فخرج إليهم النبي صلى الله عليه وسلم في أناس من أصحابه يصلح بينهم، فحضرت الصلاة، ولم يأت النبي صلى الله عليه وسلم، فجاء بلال، فأذن بلال بالصلاة، ولم يأت النبي صلى الله عليه وسلم فجاء إلى أبي بكر فقال إن النبي صلى الله عليه وسلم حبس، وقد حضرت الصلاة فهل لك أن تؤم الناس فقال نعم إن شئت‏.‏ فأقام الصلاة فتقدم أبو بكر، ثم جاء النبي صلى الله عليه وسلم يمشي في الصفوف، حتى قام في الصف الأول، فأخذ الناس بالتصفيح حتى أكثروا، وكان أبو بكر لا يكاد يلتفت في الصلاة، فالتفت فإذا هو بالنبي صلى الله عليه وسلم وراءه فأشار إليه بيده، فأمره يصلي كما هو، فرفع أبو بكر يده، فحمد الله، ثم رجع القهقرى وراءه حتى دخل في الصف، وتقدم النبي صلى الله عليه وسلم فصلى بالناس، فلما فرغ أقبل على الناس فقال ‏\"‏ يا أيها الناس ما لكم إذا نابكم شىء في صلاتكم أخذتم بالتصفيح، إنما التصفيح للنساء، من نابه شىء في صلاته فليقل سبحان الله، فإنه لا يسمعه أحد إلا التفت، يا أبا بكر ما منعك حين أشرت إليك لم تصل بالناس ‏\"‏‏.‏ فقال ما كان ينبغي لابن أبي قحافة أن يصلي بين يدى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was a dispute amongst the people of the tribe of Bani `Amr bin `Auf. The Prophet went to them along with some of his companions in order to make peace between them. The time for the prayer became due but the Prophet did not turn up; Bilal pronounced the Adhan (i.e. call) for the prayer but the Prophet did not turn up, so Bilal went to Abu Bakr and said, \"The time for the prayer is due and the Prophet i detained, would you lead the people in the prayer?\" Abu Bakr replied, \"Yes, you wish.\" So, Bilal pronounced the Iqama of the prayer and Abu Bakr went ahead (to lead the prayer), but the Prophet came walking among the rows till he joined the first row. The people started clapping and they clapped too much, and Abu Bakr used not to look hither and thither in the prayer, but he turned round and saw the Prophet standing behind him. The Prophet beckoned him with his hand to keep on praying where he was. Abu Bakr raised his hand and praised Allah and then retreated till he came in the (first) row, and the Prophet went ahead and lead the people in the prayer. When the Prophet finished the prayer, he turned towards the people and said, \"O people! When something happens to you during the prayer, you start clapping. Really clapping is (permissible) for women only. If something happens to one of you in his prayer, he should say: 'Subhan Allah', (Glorified be Allah), for whoever hears him (saying so) will direct his attention towards him. O Abu Bakr! What prevented you from leading the people in the prayer when I beckoned to you (to continue)?\" Abu Bakr replied, \"It did not befit the son of Abu Quhafa to lead the prayer in front of the Prophet.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2974",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثني الليث، قال أخبرني عقيل، عن ابن شهاب، قال أخبرني ثعلبة بن أبي مالك القرظي، أن قيس بن سعد الأنصاري   رضى الله عنه  وكان صاحب لواء رسول الله صلى الله عليه وسلم أراد الحج فرجل‏.‏",
      "text_en": " Narrated Tha`laba bin Abi Malik Al-Qurazi:                     When Qais bin Sa`d Al-Ansari, who used to carry the flag of the Prophet, intended to perform Hajj, he combed his hair.",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "5004",
        "172"
      ]
    },
    {
      "hadith_no": "3000",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد  هو ابن أسلم  عن أبيه، قال كنت مع عبد الله بن عمر  رضى الله عنهما  بطريق مكة، فبلغه عن صفية بنت أبي عبيد شدة وجع، فأسرع السير حتى إذا كان بعد غروب الشفق، ثم نزل فصلى المغرب والعتمة، يجمع بينهما، وقال إني رأيت النبي صلى الله عليه وسلم إذا جد به السير أخر المغرب وجمع بينهما‏.‏",
      "text_en": " Narrated Aslam:                     While I was in the company of `Abdullah bin `Umar on the way to Mecca, he received the news of the severe illness of Safiya bint Abi Ubaid (i.e. his wife), so he proceeded at greater speed, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha 'prayers together and said, \" I saw the Prophet delaying the Maghrib prayer to offer it along with the `Isha' when he was in a hurry on a journey.\"",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "3100",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا نافع، سمعت ابن أبي مليكة، قال قالت عائشة  رضى الله عنها توفي النبي صلى الله عليه وسلم في بيتي، وفي نوبتي، وبين سحري ونحري، وجمع الله بين ريقي وريقه‏.‏ قالت دخل عبد الرحمن بسواك، فضعف النبي صلى الله عليه وسلم عنه، فأخذته فمضغته ثم سننته به‏.‏",
      "text_en": " Narrated Ibn Abu Mulaika:                     `Aisha said, \"The Prophet died in my house on the day of my turn while he was leaning on my chest closer to my neck, and Allah made my saliva mix with his Saliva.\" `Aisha added, \"`AbdurRahman came with a Siwak and the Prophet was too weak to use it so I took it, chewed it and then (gave it to him and he) cleaned his teeth with it.\"",
      "chain": [
        "30232",
        "11014",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "3210",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد، حدثنا ابن أبي مريم، أخبرنا الليث، حدثنا ابن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة بن الزبير، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الملائكة تنزل في العنان  وهو السحاب  فتذكر الأمر قضي في السماء، فتسترق الشياطين السمع، فتسمعه فتوحيه إلى الكهان، فيكذبون معها مائة كذبة من عند أنفسهم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I heard Allah's Apostle saying, \"The angels descend, the clouds and mention this or that matter decreed in the Heaven. The devils listen stealthily to such a matter, come down to inspire the soothsayers with it, and the latter would add to it one-hundred lies of their own.\"",
      "chain": [
        "30213",
        "30232",
        "20023",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3242",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني سعيد بن المسيب، أن أبا هريرة  رضى الله عنه  قال بينا نحن عند رسول الله صلى الله عليه وسلم إذ قال ‏\"‏ بينا أنا نائم رأيتني في الجنة، فإذا امرأة تتوضأ إلى جانب قصر، فقلت لمن هذا القصر فقالوا لعمر بن الخطاب، فذكرت غيرته، فوليت مدبرا ‏\"‏‏.‏ فبكى عمر وقال أعليك أغار يا رسول الله‏.‏",
      "text_en": " Narrated Abu Huraira:                     While we were in the company of the Prophet, he said, \"While I was asleep, I saw myself in Paradise and there I beheld a woman making ablution beside a palace, I asked, To whom does this palace belong? 'They said, To `Umar bin Al-Khattab.' Then I remembered `Umar's Ghaira (concerning women), and so I quickly went away from that palace.\" (When `Umar heard this from the Prophet), he wept and said, \"Do you think it is likely that I feel Ghaira because of you, O Allah's Apostle?\"",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا محمد بن مطرف، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ في الجنة ثمانية أبواب، فيها باب يسمى الريان لا يدخله إلا الصائمون ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Paradise has eight gates, and one of them is called Ar-Raiyan through which none will enter but those who observe fasting.\" The Prophet also said, \"If a person spends two different kinds of something (for Allah's Cause), he will be called from the gates of Paradise.\"",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لتتبعن سنن من قبلكم شبرا بشبر، وذراعا بذراع، حتى لو سلكوا جحر ضب لسلكتموه ‏\"‏‏.‏ قلنا يا رسول الله، اليهود والنصارى قال ‏\"‏ فمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"You will follow the wrong ways, of your predecessors so completely and literally that if they should go into the hole of a mastigure, you too will go there.\" We said, \"O Allah's Apostle! Do you mean the Jews and the Christians?\" He replied, \"Whom else?\" (Meaning, of course, the Jews and the Christians.)",
      "chain": [
        "30232",
        "20179",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3724",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني سعيد بن المسيب، أن أبا هريرة  رضى الله عنه  قال بينا نحن عند رسول الله صلى الله عليه وسلم إذ قال ‏\"‏ بينا أنا نائم رأيتني في الجنة، فإذا امرأة تتوضأ إلى جانب قصر، فقلت لمن هذا القصر قالوا لعمر فذكرت غيرته فوليت مدبرا ‏\"‏‏.‏ فبكى وقال أعليك أغار يا رسول الله",
      "text_en": " Narrated Abu Huraira:                     While we were with Allah's Apostle he said, \"While I was sleeping, I saw myself in Paradise, and suddenly I saw a woman performing ablution beside a palace. I asked, 'For whom is this palace?' They replied, 'It is for `Umar.' Then I remembered `Umar's Ghira (self-respect) and went away quickly.\" `Umar wept and said, O Allah's Apostle! How dare I think of my ghira (self-respect) being offended by you?",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3811",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا نافع بن عمر، حدثني ابن أبي مليكة، قيل لابن عباس هل لك في أمير المؤمنين معاوية، فإنه ما أوتر إلا بواحدة‏.‏ قال إنه فقيه‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     Somebody said to Ibn `Abbas, \"Can you speak to the chief of the believers Muwaiya, as he does not pray except one rak`a as witr?\" Ibn `Abbas replied, \"He is a Faqih (i.e. a learned man who can give religious verdicts) .\"",
      "chain": [
        "30232",
        "20203",
        "11090"
      ]
    },
    {
      "hadith_no": "4262",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر بن أبي كثير، قال أخبرني حميد، أنه سمع أنسا  رضى الله عنه  يقول أقام النبي صلى الله عليه وسلم بين خيبر والمدينة ثلاث ليال يبنى عليه بصفية، فدعوت المسلمين إلى وليمته، وما كان فيها من خبز ولا لحم، وما كان فيها إلا أن أمر بلالا بالأنطاع فبسطت، فألقى عليها التمر والأقط والسمن، فقال المسلمون إحدى أمهات المؤمنين، أو ما ملكت يمينه قالوا إن حجبها فهى إحدى أمهات المؤمنين، وإن لم يحجبها فهى مما ملكت يمينه‏.‏ فلما ارتحل وطأ لها خلفه، ومد الحجاب‏.‏",
      "text_en": " Narrated Anas:                     The Prophet stayed for three rights between Khaibar and Medina and was married to Safiya. I invited the Muslim to h s marriage banquet and there wa neither meat nor bread in that banquet but the Prophet ordered Bilal to spread the leather mats on which dates, dried yogurt and butter were put. The Muslims said amongst themselves, \"Will she (i.e. Safiya) be one of the mothers of the believers, (i.e. one of the wives of the Prophet ) or just (a lady captive) of what his right-hand possesses\" Some of them said, \"If the Prophet makes her observe the veil, then she will be one of the mothers of the believers (i.e. one of the Prophet's wives), and if he does not make her observe the veil, then she will be his lady slave.\" So when he departed, he made a place for her behind him (on his and made her observe the veil.",
      "chain": [
        "30232",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4282",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد، عن أبيه، أنه سمع عمر بن الخطاب  رضى الله عنه  يقول أما والذي نفسي بيده، لولا أن أترك آخر الناس ببانا ليس لهم شىء، ما فتحت على قرية إلا قسمتها كما قسم النبي صلى الله عليه وسلم خيبر، ولكني أتركها خزانة لهم يقتسمونها‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     By Him in Whose Hand my soul is, were I not afraid that the other Muslims might be left in poverty, I would divide (the land of) whatever village I may conquer (among the fighters), as the Prophet divided the land of Khaibar. But I prefer to leave it as a (source of) a common treasury for them to distribute it revenue amongst themselves.",
      "chain": [
        "30232",
        "20173",
        "15",
        "2281",
        "3"
      ]
    },
    {
      "hadith_no": "4524",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال ابن أبي مريم أخبرنا يحيى بن أيوب، حدثني حميد، سمعت أنسا، عن عمر‏.‏",
      "text_en": "",
      "chain": [
        "30232",
        "20379",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4552",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، محمد بن مطرف حدثني أبو حازم، عن سهل بن سعد، قال وأنزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ ولم ينزل ‏{‏من الفجر‏}‏ وكان رجال إذا أرادوا الصوم ربط أحدهم في رجليه الخيط الأبيض والخيط الأسود، ولا يزال يأكل حتى يتبين له رؤيتهما، فأنزل الله بعده ‏{‏من الفجر‏}‏ فعلموا أنما يعني الليل من النهار‏.‏",
      "text_en": " Narrated Sahl bin Sa`d The Verse \"And eat and drink until the white thread appears to you distinct:                     from the black thread.\" was revealed, but: '... of dawn' was not revealed (along with it) so some men, when intending to fast, used to tie their legs, one with white thread and the other with black thread and would keep on eating till they could distinguish one thread from the other. Then Allah revealed' ... of dawn,' whereupon they understood that meant the night and the day.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4581",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال حدثني شريك بن أبي نمر، أن عطاء بن يسار، وعبد الرحمن بن أبي عمرة الأنصاري، قالا سمعنا أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ ليس المسكين الذي ترده التمرة والتمرتان ولا اللقمة ولا اللقمتان‏.‏ إنما المسكين الذي يتعفف واقرءوا إن شئتم يعني قوله ‏{‏لا يسألون الناس إلحافا‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The poor person is not the one for whom a date or two or a morsel or two (of food is sufficient but the poor person is he who does not (beg or) ask the people (for something) or show his poverty at all. Recite if you wish, (Allah's Statement): \"They do not beg of people at all.\" (2.273)",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11020",
        "1238"
      ]
    },
    {
      "hadith_no": "4609",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رجالا من المنافقين على عهد رسول الله صلى الله عليه وسلم كان إذا خرج رسول الله صلى الله عليه وسلم إلى الغزو تخلفوا عنه، وفرحوا بمقعدهم خلاف رسول الله صلى الله عليه وسلم فإذا قدم رسول الله صلى الله عليه وسلم اعتذروا إليه وحلفوا، وأحبوا أن يحمدوا بما لم يفعلوا، فنزلت ‏{‏لا يحسبن الذين يفرحون‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     During the lifetime of Allah's Apostle, some men among the hypocrites used to remain behind him (i.e. did not accompany him) when he went out for a Ghazwa and they would be pleased to stay at home behind Allah's Apostle When Allah's Apostle returned (from the battle) they would put forward (false) excuses and take oaths, wishing to be praised for what they had not done. So there was revealed:-- \"Think not that those who rejoice in what they have done, and love to be praised for what they have not done..\" (3.188)",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4612",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة، فتحدث رسول الله صلى الله عليه وسلم مع أهله ساعة ثم رقد، فلما كان ثلث الليل الآخر قعد فنظر إلى السماء فقال ‏{‏إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏، ثم قام فتوضأ واستن، فصلى إحدى عشرة ركعة، ثم أذن بلال فصلى ركعتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I stayed overnight in the house of my aunt Maimuna. Allah's Apostle talked with his wife for a while and then went to bed. When it was the last third of the night, he got up and looked towards the sky and said: \"Verily! In the creation of the Heavens and the Earth and in the alteration of night and day, there are indeed signs for men of understanding.\" (3.190) Then he stood up, performed ablution, brushed his teeth with a Siwak, and then prayed eleven rak`at. Then Bilal pronounced the Adhan (i.e. call for the Fajr prayer). The Prophet then offered two rak`at (Sunna) prayer and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "4776",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا سعيد بن أبي مريم، أخبرنا المغيرة، قال حدثني أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنه ليأتي الرجل العظيم السمين يوم القيامة لا يزن عند الله جناح بعوضة وقال اقرءوا ‏{‏فلا نقيم لهم يوم القيامة وزنا‏}‏ ‏\"‏‏.‏ وعن يحيى بن بكير عن المغيرة بن عبد الرحمن عن أبي الزناد مثله‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"On the Day of Resurrection, a huge fat man will come who will not weigh, the weight of the wing of a mosquito in Allah's Sight.\" and then the Prophet added, 'We shall not give them any weight on the Day of Resurrection ' (18.105)",
      "chain": [
        "30561",
        "30232",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5118",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، أخبرنا حميد بن أبي حميد الطويل، أنه سمع أنس بن مالك  رضى الله عنه  يقول جاء ثلاثة رهط إلى بيوت أزواج النبي صلى الله عليه وسلم يسألون عن عبادة النبي صلى الله عليه وسلم فلما أخبروا كأنهم تقالوها فقالوا وأين نحن من النبي صلى الله عليه وسلم قد غفر له ما تقدم من ذنبه وما تأخر‏.‏ قال أحدهم أما أنا فإني أصلي الليل أبدا‏.‏ وقال آخر أنا أصوم الدهر ولا أفطر‏.‏ وقال آخر أنا أعتزل النساء فلا أتزوج أبدا‏.‏ فجاء رسول الله صلى الله عليه وسلم فقال ‏\"‏ أنتم الذين قلتم كذا وكذا أما والله إني لأخشاكم لله وأتقاكم له، لكني أصوم وأفطر، وأصلي وأرقد وأتزوج النساء، فمن رغب عن سنتي فليس مني ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A group of three men came to the houses of the wives of the Prophet asking how the Prophet worshipped (Allah), and when they were informed about that, they considered their worship insufficient and said, \"Where are we from the Prophet as his past and future sins have been forgiven.\" Then one of them said, \"I will offer the prayer throughout the night forever.\" The other said, \"I will fast throughout the year and will not break my fast.\" The third said, \"I will keep away from the women and will not marry forever.\" Allah's Apostle came to them and said, \"Are you the same people who said so-and-so? By Allah, I am more submissive to Allah and more afraid of Him than you; yet I fast and break my fast, I do sleep and I also marry women. So he who does not follow my tradition in religion, is not from me (not one of my followers).",
      "chain": [
        "30232",
        "20173",
        "19"
      ]
    },
    {
      "hadith_no": "5176",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، أن امرأة، عرضت نفسها على النبي صلى الله عليه وسلم فقال له رجل يا رسول الله زوجنيها‏.‏ فقال ‏\"‏ ما عندك ‏\"‏‏.‏ قال ما عندي شىء‏.‏ قال ‏\"‏ اذهب فالتمس ولو خاتما من حديد ‏\"‏‏.‏ فذهب ثم رجع فقال لا والله ما وجدت شيئا، ولا خاتما من حديد، ولكن هذا إزاري ولها نصفه  قال سهل وما له رداء‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ وما تصنع بإزارك إن لبسته لم يكن عليها منه شىء، وإن لبسته لم يكن عليك منه شىء ‏\"‏‏.‏ فجلس الرجل حتى إذا طال مجلسه قام فرآه النبي صلى الله عليه وسلم فدعاه أو دعي له فقال ‏\"‏ ماذا معك من القرآن ‏\"‏‏.‏ فقال معي سورة كذا وسورة كذا لسور يعددها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أملكناكها بما معك من القرآن ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A woman presented herself to the Prophet (for marriage). A man said to him, \"O Allah's Apostle! (If you are not in need of her) marry her to me.\" The Prophet said, \"What have you got?\" The man said, \"I have nothing.\" The Prophet said (to him), \"Go and search for something) even if it were an iron ring.\" The man went and returned saying, \"No, I have not found anything, not even an iron ring; but this is my (Izar) waist sheet, and half of it is for her.\" He had no Rida' (upper garment). The Prophet said, \"What will she do with your waist sheet? If you wear it, she will have nothing over her; and if she wears it, you will have nothing over you.\" So the man sat down and when he had sat a long time, he got up (to leave). When the Prophet saw him (leaving), he called him back, or the man was called (for him), and he said to the man, \"How much of the Qur'an do you know (by heart)?\" The man replied I know such Sura and such Sura (by heart),\" naming the Suras The Prophet said, \"I have married her to you for what you know of the Qur'an .\"",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5237",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال لما عرس أبو أسيد الساعدي دعا النبي صلى الله عليه وسلم وأصحابه، فما صنع لهم طعاما ولا قربه إليهم إلا امرأته أم أسيد، بلت تمرات في تور من حجارة من الليل، فلما فرغ النبي صلى الله عليه وسلم من الطعام أماثته له فسقته، تتحفه بذلك‏.‏",
      "text_en": " Narrated Sahl:                     When Abu Usaid As-Sa`idi got married, he invited the Prophet and his companions. None prepared the food for them and brought it to them but his wife. She soaked some dates in water in a stone pot overnight, and when the Prophet had finished his food, she provided him with that drink (of soaked dates).",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5441",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، أخبرني حميد، أنه سمع أنسا، يقول قام النبي صلى الله عليه وسلم يبني بصفية فدعوت المسلمين إلى وليمته أمر بالأنطاع فبسطت فألقي عليها التمر والأقط والسمن‏.‏ وقال عمرو عن أنس بنى بها النبي صلى الله عليه وسلم ثم صنع حيسا في نطع‏.‏",
      "text_en": " Narrated Anas:                     The Prophet halted to consummate his marriage with Safiyya. I invited the Muslims to his wedding banquet. He ordered that leather dining sheets be spread. Then dates, dried yoghurt and butter were put on those sheets. Anas added: The Prophet consummated his marriage with Safiyya (during a journey) whereupon Hais (sweet dish) was served on a leather dining sheet.",
      "chain": [
        "30232",
        "20173",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5465",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، أنه سأل سهلا هل رأيتم في زمان النبي صلى الله عليه وسلم النقي قال لا‏.‏ فقلت فهل كنتم تنخلون الشعير قال لا ولكن كنا ننفخه‏.‏",
      "text_en": " Narrated Abu Hazim:                     that he asked Sahl, \"Did you use white flour during the lifetime of the Prophet ?\" Sahl replied, \"No. Hazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of the barley).",
      "chain": [
        "30232",
        "20179",
        "11172"
      ]
    },
    {
      "hadith_no": "5499",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن إبراهيم بن عبد الرحمن بن عبد الله بن أبي ربيعة، عن جابر بن عبد الله، رضى الله عنهما قال كان بالمدينة يهودي وكان يسلفني في تمري إلى الجداد، وكانت لجابر الأرض التي بطريق رومة فجلست، فخلا عاما فجاءني اليهودي عند الجداد، ولم أجد منها شيئا، فجعلت أستنظره إلى قابل فيأبى، فأخبر بذلك النبي صلى الله عليه وسلم فقال لأصحابه ‏\"‏ امشوا نستنظر لجابر من اليهودي ‏\"‏‏.‏ فجاءوني في نخلي فجعل النبي صلى الله عليه وسلم يكلم اليهودي فيقول أبا القاسم لا أنظره‏.‏ فلما رأى النبي صلى الله عليه وسلم قام فطاف في النخل، ثم جاءه فكلمه فأبى فقمت فجئت بقليل رطب فوضعته بين يدى النبي صلى الله عليه وسلم فأكل ثم قال ‏\"‏ أين عريشك يا جابر ‏\"‏‏.‏ فأخبرته فقال ‏\"‏ افرش لي فيه ‏\"‏‏.‏ ففرشته فدخل فرقد، ثم استيقظ فجئته بقبضة أخرى فأكل منها، ثم قام فكلم اليهودي فأبى عليه فقام في الرطاب في النخل الثانية ثم قال ‏\"‏ يا جابر جد واقض ‏\"‏‏.‏ فوقف في الجداد فجددت منها ما قضيته وفضل منه فخرجت حتى جئت النبي صلى الله عليه وسلم فبشرته فقال ‏\"‏ أشهد أني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     There was a Jew in Medina who used to lend me money up to the season of plucking dates. (Jabir had a piece of land which was on the way to Ruma). That year the land was not promising, so the payment of the debt was delayed one year. The Jew came to me at the time of plucking, but gathered nothing from my land. I asked him to give me one year respite, but he refused. This news reached the Prophet whereupon he said to his companions, \"Let us go and ask the Jew for respite for Jabir.\" All of them came to me in my garden, and the Prophet started speaking to the Jew, but he Jew said, \"O Abu Qasim! I will not grant him respite.\" When the Prophet saw the Jew's attitude, he stood up and walked all around the garden and came again and talked to the Jew, but the Jew refused his request. I got up and brought some ripe fresh dates and put it in front of the Prophet. He ate and then said to me, \"Where is your hut, O Jabir?\" I informed him, and he said, \"Spread out a bed for me in it.\" I spread out a bed, and he entered and slept. When he woke up, I brought some dates to him again and he ate of it and then got up and talked to the Jew again, but the Jew again refused his request. Then the Prophet got up for the second time amidst the palm trees loaded with fresh dates, and said, \"O Jabir! Pluck dates to repay your debt.\" The Jew remained with me while I was plucking the dates, till I paid him all his right, yet there remained extra quantity of dates. So I went out and proceeded till I reached the Prophet and informed him of the good news, whereupon he said, \"I testify that I am Allah's Apostle.\"",
      "chain": [
        "30232",
        "20179",
        "11172",
        "34"
      ]
    },
    {
      "hadith_no": "5697",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  قال ذكر للنبي صلى الله عليه وسلم امرأة من العرب، فأمر أبا أسيد الساعدي أن يرسل إليها فأرسل إليها، فقدمت فنزلت في أجم بني ساعدة، فخرج النبي صلى الله عليه وسلم حتى جاءها فدخل عليها فإذا امرأة منكسة رأسها، فلما كلمها النبي صلى الله عليه وسلم قالت أعوذ بالله منك‏.‏ فقال ‏\"‏ قد أعذتك مني ‏\"‏‏.‏ فقالوا لها أتدرين من هذا قالت لا‏.‏ قالوا هذا رسول الله صلى الله عليه وسلم جاء ليخطبك‏.‏ قالت كنت أنا أشقى من ذلك‏.‏ فأقبل النبي صلى الله عليه وسلم يومئذ حتى جلس في سقيفة بني ساعدة هو وأصحابه، ثم قال ‏\"‏ اسقنا يا سهل ‏\"‏‏.‏ فخرجت لهم بهذا القدح فأسقيتهم فيه، فأخرج لنا سهل ذلك القدح فشربنا منه‏.‏ قال ثم استوهبه عمر بن عبد العزيز بعد ذلك فوهبه له‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     An Arab lady was mentioned to the Prophet so he asked Abu Usaid As-Sa`idi to send for her, and he sent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet came out and went to her and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet spoke to her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said to her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Apostle who has come to command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the Prophet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give us water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: Sahl took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul `Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    }
  ],
  "total_hadiths": 131
}