{
  "id": "30248",
  "name": "Da'ud bin Rshyd داود بن رشيد",
  "full_name": "Da'ud bin Rshyd داود بن رشيد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "239",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Hashim",
      "Client",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28578",
      "name": "Ma'mar bin Suliaman معمر بن سليمان النخعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20239",
      "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20657",
      "name": "Salah bin 'Umar al-Wasti صالح بن عمر الواسطي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20667",
      "name": "'Umar bin Ayoub al-Bdy عمر بن أيوب العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38042",
      "name": "Ahmed bin 'Ali bin Sa'id أحمد بن علي بن سعيد",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30273",
      "name": "Muhammad bin 'Ubaidullah محمد بن عبيد الله بن يزيد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6800",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن أبي غسان، محمد بن مطرف عن زيد بن أسلم، عن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة مسلمة، أعتق الله بكل عضو منه عضوا من النار، حتى فرجه بفرجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of his body for freeing the corresponding parts of the slave's body, even his private parts will be saved from the Fire) because of freeing the slave's private parts.\"",
      "chain": [
        "30272",
        "30248",
        "20733",
        "20179",
        "11163",
        "11045",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن ابن جابر، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثنا عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله وأن عيسى عبد الله وابن أمته وكلمته ألقاها إلى مريم وروح منه وأن الجنة حق وأن النار حق أدخله الله من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ubadah b. Samit that the messenger of Allah (may peace be upon him) observed:                      He who said:\" There is no god but Allah, He is One and there is no associate with Him, that Muhammad is his servant and His messenger, that Christ is servant and the son of His slave-girl and he (Christ) His word which He communicated to Mary and is His Spirit, that Paradise is a fact and Hell is a fact,\" Allah would make him (he who affirms these truths enter Paradise through any one of its eight doors which he would like.",
      "chain": [
        "30248",
        "20733",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "312",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا داود بن رشيد، حدثنا صالح بن عمر، حدثنا أبو مالك الأشجعي، عن أنس بن مالك، قال سألت امرأة رسول الله صلى الله عليه وسلم عن المرأة ترى في منامها ما يرى الرجل في منامه فقال ‏\"‏ إذا كان منها ما يكون من الرجل فلتغتسل ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      A woman asked the Messenger of Allah (way peace be upon him) about a woman who sees in her dream what a man sees in his dream (sexual dream). He (the Holy Prophet) said: If she experiences what a man experiences, she should take a bath.",
      "chain": [
        "30248",
        "10766",
        "19"
      ]
    },
    {
      "hadith_no": "454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن سعيد، - وهو ابن عبد العزيز - عن عطية بن قيس، عن قزعة، عن أبي سعيد الخدري، قال لقد كانت صلاة الظهر تقام فيذهب الذاهب إلى البقيع فيقضي حاجته ثم يتوضأ ثم يأتي ورسول الله صلى الله عليه وسلم في الركعة الأولى مما يطولها ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The noon prayer would start and one would go to al-Baqi' and after having relieved himself he would perform ablution and then come, while the Messenger of Allah (may peace be upon him) would be in the first rak'ah, because he would prolong it so much.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "10877",
        "38"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، عن الأوزاعي، عن أبي عمار، - اسمه شداد بن عبد الله - عن أبي أسماء، عن ثوبان، قال كان رسول الله صلى الله عليه وسلم إذا انصرف من صلاته استغفر ثلاثا وقال ‏\"‏ اللهم أنت السلام ومنك السلام تباركت ذا الجلال والإكرام ‏\"‏ ‏.‏ قال الوليد فقلت للأوزاعي كيف الاستغفار قال تقول أستغفر الله أستغفر الله ‏.‏",
      "text_en": " Thauban reported:                      When the Messenger of Allah (may peace be upon him) finished his prayer. he begged forgiveness three times and said: O Allah! Thou art Peace, and peace comes from Thee; Blessed art Thou, O Possessor of Glory and Honour. Walid reported: I said to Auza'i: How Is the seeking of forgiveness? He replied: You should say:, I beg forgiveness from Allah, 1 beg forgiveness from Allah.\"",
      "chain": [
        "30248",
        "20733",
        "20024",
        "130"
      ]
    },
    {
      "hadith_no": "1888",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا داود بن رشيد، حدثنا يحيى بن سعيد، حدثنا طلحة، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم لأبي موسى ‏\"‏ لو رأيتني وأنا أستمع لقراءتك البارحة لقد أوتيت مزمارا من مزامير آل داود ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya b. Qurra reported 'Abdullah b. Mughaffal al-Muzani as saying:                      The Apostle of Allah (may peace be upon him) recited on his ride Surat al Fath during a journey in the year of the Conquest (of Mecca), and he repeated (the words) in his recitation. Mu'awiya said: If I were not afraid that the people would crowd around me, I would have given a demonstration of (the Prophet's) recitation before you.",
      "chain": [
        "30248",
        "20031",
        "11356",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1958",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا داود بن رشيد، وإسماعيل بن سالم، جميعا عن هشيم، - قال داود حدثنا هشيم، - أخبرنا منصور، عن قتادة، قال أخبرنا أبو العالية، عن ابن عباس، قال سمعت غير، واحد، من أصحاب رسول الله صلى الله عليه وسلم منهم عمر بن الخطاب وكان أحبهم إلى أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد الفجر حتى تطلع الشمس وبعد العصر حتى تغرب الشمس ‏.‏",
      "text_en": "",
      "chain": [
        "30248",
        "30415",
        "20468",
        "20468",
        "11067",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "2116",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن الأوزاعي، حدثني إسحاق، بن عبد الله بن أبي طلحة عن أنس بن مالك، قال أصابت الناس سنة على عهد رسول الله صلى الله عليه وسلم فبينا رسول الله صلى الله عليه وسلم يخطب الناس على المنبر يوم الجمعة إذ قام أعرابي فقال يا رسول الله هلك المال وجاع العيال ‏.‏ وساق الحديث بمعناه ‏.‏ وفيه قال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏ ‏.‏ قال فما يشير بيده إلى ناحية إلا تفرجت حتى رأيت المدينة في مثل الجوبة وسال وادي قناة شهرا ‏.‏ ولم يجئ أحد من ناحية إلا أخبر بجود ‏.‏",
      "text_en": " Anas b. Malik reported:                      The people were in the grip of famine during the lifetime of the Messenger of Allah (may peace be upon him), and (once) as the Messenger of Allah (may peace be upon him) was delivering the sermon standing on the pulpit on Friday, a bedouin stood up and said: Messenger of Allah, the animals died and the children suffered starvation. The rest of the hadith is the same (and the words are) that he (the Holy Prophet) said: O Allah, send down rain in our suburbs but not on us. He (the narrator) said: To whichever directions he pointed with his hands, the clouds broke up and I saw Medina like the opening of a (courtyard) and the stream of Qanat flowed for one month, and none came from any part (of Arabia) but with the news of heavy rainfall.",
      "chain": [
        "30248",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2188",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا داود بن رشيد، حدثنا إسماعيل ابن علية، حدثنا أيوب، عن عبد الله بن، أبي مليكة قال كنت جالسا إلى جنب ابن عمر ونحن ننتظر جنازة أم أبان بنت عثمان وعنده عمرو بن عثمان فجاء ابن عباس يقوده قائد فأراه أخبره بمكان ابن عمر، فجاء حتى جلس إلى جنبي فكنت بينهما فإذا صوت من الدار فقال ابن عمر - كأنه يعرض على عمرو أن يقوم فينهاهم - سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الميت ليعذب ببكاء أهله ‏\"‏ ‏.‏ قال فأرسلها عبد الله مرسلة ‏.‏ فقال ابن عباس كنا مع أمير المؤمنين عمر بن الخطاب حتى إذا كنا بالبيداء إذا هو برجل نازل في شجرة فقال لي اذهب فاعلم لي من ذاك الرجل ‏.‏ فذهبت فإذا هو صهيب ‏.‏ فرجعت إليه فقلت إنك أمرتني أن أعلم لك من ذاك وإنه صهيب ‏.‏ قال مره فليلحق بنا ‏.‏ فقلت إن معه أهله ‏.‏ قال وإن كان معه أهله - وربما قال أيوب مره فليلحق بنا - فلما قدمنا لم يلبث أمير المؤمنين أن أصيب فجاء صهيب يقول واأخاه واصاحباه ‏.‏ فقال عمر ألم تعلم أو لم تسمع - قال أيوب أو قال أولم تعلم أولم تسمع - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببعض بكاء أهله ‏\"‏ ‏.‏ قال فأما عبد الله فأرسلها مرسلة وأما عمر فقال ببعض ‏.‏ فقمت فدخلت على عائشة فحدثتها بما، قال ابن عمر فقالت لا والله ما قال رسول الله صلى الله عليه وسلم قط ‏\"‏ إن الميت يعذب ببكاء أحد ‏\"‏ ‏.‏ ولكنه قال ‏\"‏ إن الكافر يزيده الله ببكاء أهله عذابا وإن الله لهو أضحك وأبكى ولا تزر وازرة وزر أخرى ‏\"‏ ‏.‏ قال أيوب قال ابن أبي مليكة حدثني القاسم بن محمد قال لما بلغ عائشة قول عمر وابن عمر قالت إنكم لتحدثوني عن غير كاذبين ولا مكذبين ولكن السمع يخطئ ‏.‏",
      "text_en": " 'Abdullah b. Abu Mulaika reported:                      I was sitting by the side of Ibn 'Umar, and we were waiting for the bier of Umm Aban, daughter of 'Uthman, and there was also 'Amr b. 'Uthman. In the meanwhile there came Ibn 'Abbas led by a guide. I conceive that he was informed of the place of Ibn 'Umar. So he came till he sat by my side. While I was between them (Ibn 'Abbas and Ibn 'Umar) there came the noise (of wailing) from the house. Upon this Ibn 'Umar said (that is, he pointed out to 'Amr that he should stand and forbid them, for): I heard the Messenger of Allah (may peace be upon him) as saying: The dead is punished because of the lamentation of his family. 'Abdullah made it general (what was said for a particular occasion). Ibn 'Abbas said: When we were with the Commander of the believers, 'Umar b. Khattab, we reached Baida', and there was a man under the shadow of the tree. He said to me: Go and inform me who is that person. So I went and (found) that he was Suhaib. I returned to him and said: You commanded me to find out for you who that was, and he is Suhaib. He (Hadrat 'Umar) said: Command him to see us. I said: He has family along with him. He said: (That is of no account) even if he has family along with him. So he (the narrator) told him to see (the Commander of the believers and his party). When we came (to Medina), it was before long that the Commander of the believers was wounded, and Suhaib came weeping and crying: Alas for the brother, alas for the companion. Upon this 'Umar said: Didn't you know, or didn't you hear, that the Messenger of Allah (may peace be upon him) said:\" The dead is punished because of the lamentation of his family\"? Then 'Abdullah made it general and 'Umar told it of certain occasions. So I ('Abdullah b. Abu Mulaika) stood up and went to 'A'isha and told her what Ibn 'Umar had said. Upon this she said: I swear by Allah that Allah's Messenger (may peace be upon him) never said that dead would be punished because of his family's lamenting (for him). What he said was that Allah would increase the punishment of the unbeliever because of his family's lamenting for him. Verily it is Allah Who has caused laughter and weeping. No bearer of a burden will bear another's burden. Ibn Abu Mulaika said that al-Qasim b. Muhammad said that when the words of 'Umar and Ibn 'Umar were conveyed to 'A'isha, she said: You have narrated it to me from those who are neither liar nor those suspected of lying but (sometimes) hearing misleads.",
      "chain": [
        "30248",
        "20208",
        "11015",
        "11090"
      ]
    },
    {
      "hadith_no": "2686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن سعيد بن عبد العزيز، عن إسماعيل، بن عبيد الله عن أم الدرداء، عن أبي الدرداء، - رضى الله عنه - قال خرجنا مع رسول الله صلى الله عليه وسلم في شهر رمضان في حر شديد حتى إن كان أحدنا ليضع يده على رأسه من شدة الحر وما فينا صائم إلا رسول الله صلى الله عليه وسلم وعبد الله بن رواحة ‏.‏",
      "text_en": " Abu Darda' (Allah be pleased with him) reported:                      We set out during the month of Ramadan with the Messenger of Allah (may peace be upon him) in such an intense heat that one of us would place his hand over his head (in order to protect himself) against the excessive heat, and none among us was observing the fast, except the Messenger of Allah (may peace be upon him) and 'Abdullah b. Rawaha.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3869",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن محمد بن مطرف أبي غسان، المدني عن زيد بن أسلم، عن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة أعتق الله بكل عضو منها عضوا من أعضائه من النار حتى فرجه بفرجه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace benpon him) as saying:                      He who emancipates a slave, Allah will set free from Hell every limb (of his body) for every limb of his (slave's) body, even his private parts.",
      "chain": [
        "30248",
        "20733",
        "20179",
        "11163",
        "11045",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا داود بن رشيد، حدثنا مروان بن معاوية، أخبرنا عمر بن حمزة بن عبد، الله بن عمر حدثنا سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما أهل دار اتخذوا كلبا إلا كلب ماشية أو كلب صائد نقص من عملهم كل يوم قيراطان‏\"‏ ‏.‏",
      "text_en": " Salim b. Abdullah reported on the authority of his father that Allah's Messenger (may peace be upon him) said:                      Whosover amongst the owners of the house keeps a dog other than one meant for watching the herd or for hunting loses two qirat of his deeds every day.",
      "chain": [
        "30248",
        "20201",
        "11899",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4911",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - حدثنا عبد الرحمن بن، يزيد بن جابر أخبرني مولى بني فزارة، - وهو رزيق بن حيان - أنه سمع مسلم بن، قرظة ابن عم عوف بن مالك الأشجعي يقول سمعت عوف بن مالك الأشجعي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خيار أئمتكم الذين تحبونهم ويحبونكم وتصلون عليهم ويصلون عليكم وشرار أئمتكم الذين تبغضونهم ويبغضونكم وتلعنونهم ويلعنونكم ‏\"‏ ‏.‏ قالوا قلنا يا رسول الله أفلا ننابذهم عند ذلك قال ‏\"‏ لا ما أقاموا فيكم الصلاة لا ما أقاموا فيكم الصلاة ألا من ولي عليه وال فرآه يأتي شيئا من معصية الله فليكره ما يأتي من معصية الله ولا ينزعن يدا من طاعة ‏\"‏ ‏.‏ قال ابن جابر فقلت - يعني لرزيق - حين حدثني بهذا الحديث آلله يا أبا المقدام لحدثك بهذا أو سمعت هذا من مسلم بن قرظة يقول سمعت عوفا يقول سمعت رسول الله صلى الله عليه وسلم قال فجثا على ركبتيه واستقبل القبلة فقال إي والله الذي لا إله إلا هو لسمعته من مسلم بن قرظة يقول سمعت عوف بن مالك يقول سمعت رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated on the authority of Auf b. Malik al-Ashja'i who said that he heard the Messenger of Allah (may peace be upon him) say:                      The best of your rulers are those whom you love and who love you, upon whom you invoke God's blessings and who invoke His blessing upon you. And the worst of your rulers are those whom you hate and who hate you, who curse you and whom you curse. (Those present) said: Shouldn't we overthrow them at this? He said: No, as long as they establish prayer among you. No, as long as they establish prayer among you. Mind you! One who has a governor appointed over him and he finds that the governor indulges in an act of disobedience to God, he should condemn the governor's act, in disobedience to God, but should not withdraw himself from his obedience. Ibn Jabir said: Ruzaiq narrated to me this hadith. I asked him: Abu Miqdam, have you heard it from Muslim b. Qaraza or did he describe it to you and he heard it from 'Auf (b. Malik) and he transmitted this tradition of Allah's Messenger (may peace be upon him)? Upon this Ruzaiq sat upon his knees and facing the Qibla said: By Allah, besides Whom there is no other God, I heard it from Muslim b. Qaraza and he said that te had heard it from Auf (b. Malik) and he said that he had heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30248",
        "20733",
        "20395",
        "10963",
        "3051"
      ]
    },
    {
      "hadith_no": "5057",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه داود بن رشيد، حدثنا الوليد، عن بكر بن مضر، عن عمرو بن الحارث، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This tradition has also been narrated on the same authority through another chain of transmitters.",
      "chain": [
        "30248",
        "20733",
        "20374",
        "20377",
        "189"
      ]
    },
    {
      "hadith_no": "5557",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا داود بن رشيد، حدثنا عمر بن أيوب الموصلي، حدثنا إبراهيم بن نافع،عن سليمان الأحول، عن طاوس، عن عبد الله بن عمرو، قال رأى النبي صلى الله عليهوسلم على ثوبين معصفرين فقال ‏\"‏ أأمك أمرتك بهذا ‏\"‏ ‏.‏ قلت أغسلهما ‏.‏ قال ‏\"‏ بلأحرقهما ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr reported:                      Allah's Apostle (may peace be upon him) saw me in two clothes dyed in saffron, whereupon he said: Has your mother ordered you to do so? And I said: I will wash them. He said: But burn them.",
      "chain": [
        "30248",
        "20667",
        "11053",
        "29"
      ]
    },
    {
      "hadith_no": "541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، قال قال أبو عمرو ح وحدثنا داود بن رشيد، حدثنا الوليد، - وهذا لفظه - عن الأوزاعي، عن الزهري، عن أبي سلمة، عن أبي هريرة، أن الصلاة، كانت تقام لرسول الله صلى الله عليه وسلم فيأخذ الناس مقامهم قبل أن يأخذ النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah reported:                      when the Iqamah was pronounced for prayer during the time of the Messenger of Allah (ﷺ), the people would take their seats before the prophet (ﷺ) came to his seat.",
      "chain": [
        "37534",
        "20733",
        "20024",
        "30248",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1111",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا داود بن رشيد، حدثنا خالد بن حيان الرقي، حدثنا سليمان بن عبد الله بن الزبرقان، عن يعلى بن شداد بن أوس، قال شهدت مع معاوية بيت المقدس فجمع بنا فنظرت فإذا جل من في المسجد أصحاب النبي صلى الله عليه وسلم فرأيتهم محتبين والإمام يخطب ‏.‏ قال أبو داود كان ابن عمر يحتبي والإمام يخطب وأنس بن مالك وشريح وصعصعة بن صوحان وسعيد بن المسيب وإبراهيم النخعي ومكحول وإسماعيل بن محمد بن سعد ونعيم بن سلامة قال لا بأس بها ‏.‏ قال أبو داود ولم يبلغني أن أحدا كرهها إلا عبادة بن نسى ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\tYa'la b. Shaddad b. Aws said:                      I came to Mu'awiyah in Jerusalem. He led us in the Friday prayer. I saw that most of the people in the mosque were the Companions of the Prophet (ﷺ). I saw them sitting in ihtiba condition, i.e. sitting on hips erecting the feet and sticking them to the stomach and holding them with hands or tying them with a cloth to the back, while the imam was giving sermon.Abu Dawud said: Ibn 'Umar used to sit in ihtiba position while the imam gave the Friday sermon. Anas b. Malik, Shuraih, Sa'sa'ah b. Sawhan, Sa'id b. al-Musayyib, Ibrahim al-Nakha'i, Makhul, Isma'il, Ismail b. Muhammad b. Sa'd, and Nu'aim b. Sulamah said: There is no harm in sitting in ihtiba position.Abu Dawud said: I do not know whether anyone considered it disapproved except 'Ubadah b. Nasayy.",
      "chain": [
        "30248",
        "28149",
        "28227",
        "12606"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، عن سعيد بن عبد العزيز، عن مكحول، عن كثير بن مرة أبي شجرة، عن نعيم بن همار، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يقول الله عز وجل يا ابن آدم لا تعجزني من أربع ركعات في أول نهارك أكفك آخره ‏\"‏ ‏.‏",
      "text_en": " Narrated Nu'aym ibn Hammar:                     I heard the Messenger of Allah (ﷺ) say: Allah, the Exalted, says: Son of Adam, do not be helpless in performing four rak'ahs for Me at the beginning of the day: I will supply what you need till the end of it.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "11066",
        "19940",
        "5314"
      ]
    },
    {
      "hadith_no": "1997",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا داود بن رشيد، حدثنا يحيى بن زكريا، حدثنا محمد بن إسحاق، عن أبان بن صالح، وعن ابن أبي نجيح، عن مجاهد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام في عمرة القضاء ثلاثا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) stayed (at Mecca) for three days during umrah for atonement ('Umrat al-Qada')",
      "chain": [
        "30248",
        "11107",
        "19897",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا داود بن رشيد، حدثنا شعيب بن إسحاق، عن الأوزاعي، عن يحيى بن أبي كثير، قال حدثني أبو قلابة، قال حدثني ثابت بن الضحاك، قال ‏:‏ نذر رجل على عهد رسول الله صلى الله عليه وسلم أن ينحر إبلا ببوانة، فأتى النبي صلى الله عليه وسلم فقال ‏:‏ إني نذرت أن أنحر إبلا ببوانة ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ هل كان فيها وثن من أوثان الجاهلية يعبد ‏\"‏ ‏.‏ قالوا ‏:‏ لا ‏.‏ قال ‏:‏ ‏\"‏ هل كان فيها عيد من أعيادهم ‏\"‏ ‏.‏ قالوا ‏:‏ لا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ أوف بنذرك، فإنه لا وفاء لنذر في معصية الله ولا فيما لا يملك ابن آدم ‏\"‏ ‏.‏",
      "text_en": " Narrated Thabit ibn ad-Dahhak:                     In the time of the Prophet (ﷺ) a man took a vow to slaughter a camel at Buwanah. So he came to the Prophet (ﷺ) and said: I have taken a vow to sacrifice a camel at Buwanah. The Prophet (ﷺ) asked: Did the place contain any idol worshipped in pre-Islamic times? They (the people) said: No. He asked: Was any pre-Islamic festival observed there? They replied: No. The Prophet (ﷺ) said: Fulfil your vow, for a vow to do an act of disobedience to Allah must not be fulfilled, neither must one do something over which a human being has no control.",
      "chain": [
        "30248",
        "20239",
        "20024",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "4509",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا داود بن رشيد، حدثنا عباد بن العوام، ح وحدثنا هارون بن عبد الله، حدثنا سعيد بن سليمان، حدثنا عباد، عن سفيان بن حسين، عن الزهري، عن سعيد، وأبي، سلمة - قال هارون - عن أبي هريرة، أن امرأة، من اليهود أهدت إلى النبي صلى الله عليه وسلم شاة مسمومة - قال - فما عرض لها النبي صلى الله عليه وسلم ‏.‏ قال أبو داود هذه أخت مرحب اليهودية التي سمت النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A Jewess presented a poisoned sheep to the Prophet (ﷺ), but the Prophet (ﷺ) did not interfere with he.Abu Dawud said: The Jewess who poisoned the Prophet (ﷺ) was sister of Marhab.",
      "chain": [
        "30248",
        "20431",
        "30524",
        "30252",
        "20431",
        "20655",
        "11013",
        "11168",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4538",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، عن الأوزاعي، أنه سمع حصنا، أنه سمع أبا سلمة، يخبر عن عائشة، رضى الله عنها عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ على المقتتلين أن ينحجزوا الأول فالأول وإن كانت امرأة ‏\"‏ ‏.‏ قال أبو داود بلغني أن عفو النساء في القتل جائز إذا كانت إحدى الأولياء وبلغني عن أبي عبيد في قوله ‏\"‏ ينحجزوا ‏\"‏ ‏.‏ يكفوا عن القود ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) Said: The disputants should refrain from taking retaliation. The one who is nearer should forgive first and then the one who is next to him, even if (the one who forgives) were a woman.Abu Dawud said: I have been informed that forgiving by women in the case of murder is permissible if a woman were one of the heirs (of the slain). I have been told on the authority of Abu 'Ubaid about the meaning of the word yanhajizu, that is, they should refrain from retaliation.",
      "chain": [
        "30248",
        "20733",
        "20024",
        "53"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا حفص بن غياث، عن الأعمش، عن أبي صالح، عن أبي هريرة، وعن أبي سفيان، عن جابر، قالا جاء سليك الغطفاني ورسول الله  صلى الله عليه وسلم  يخطب فقال له النبي  صلى الله عليه وسلم  ‏\"‏ أصليت ركعتين قبل أن تجيء ‏\"‏ قال لا ‏.‏ قال ‏\"‏ فصل ركعتين وتجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “Sulaik Al-Ghatafani came while theMessenger of Allah (ﷺ) was delivering the sermon. The Prophet (ﷺ)said to him: ‘Did you perform two Rak’ah before you came?’ Hesaid:‘No.’ He said: ‘Then perform two Rak’ah, but make thembrief.’”",
      "chain": [
        "30248",
        "20317",
        "11060",
        "11161",
        "13",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "1749",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أيوب بن محمد الرقي، وداود بن رشيد، قالا حدثنا معمر بن سليمان، حدثنا عبد الله بن بشر، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     ‘The cupper and the one for whom cupping is done both breaktheirfast.”",
      "chain": [
        "38120",
        "30248",
        "28578",
        "25140",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3411",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا هشام بن عمار، وداود بن رشيد، ومحمد بن الصباح، قالوا حدثنا الوليد بن مسلم، حدثنا وحشي بن حرب بن وحشي بن حرب، عن أبيه، عن جده، وحشي، أنهم قالوا يا رسول الله إنا نأكل ولا نشبع ‏.‏ قال ‏\"‏ فلعلكم تأكلون متفرقين ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ فاجتمعوا على طعامكم واذكروا اسم الله عليه يبارك لكم فيه ‏\"‏ ‏.‏",
      "text_en": " Wahshibin Harb bin Wahshi bin Harb narrated from his father, fromhisgrandfather, that they said:                      “O Messenger of Allah, we eat and donot feel full.” He said: “Perhaps you eat separately?” Theysaid:“Yes.” He said: “Gather to eat together, and mention theName of Allahover it, then it will be blessed for you.”",
      "chain": [
        "30288",
        "30248",
        "30269",
        "20733"
      ]
    }
  ],
  "total_hadiths": 25
}