{
  "id": "30242",
  "name": "Ahmed bin Manay' أحمد بن منيع",
  "full_name": "Ahmed bin Manay' أحمد بن منيع",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": [
        "160 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "244",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Shawwal, ",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Baghvi",
      "Baghdad",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20388",
      "name": "Marwan bin Shuja' al-Jazri مروان بن شجاع الجزري الخصيفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5013",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن أبي داود أبو جعفر المنادي، حدثنا روح، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال لأبى بن كعب ‏\"‏ إن الله أمرني أن أقرئك القرآن ‏\"‏‏.‏ قال آلله سماني لك قال ‏\"‏ نعم ‏\"‏‏.‏ قال وقد ذكرت عند رب العالمين قال ‏\"‏ نعم ‏\"‏‏.‏ فذرفت عيناه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Prophet said to Ubai bin Ka`b, \"Allah has ordered me to recite Qur'an to you.\" Ubai said, \"Did Allah mention me by name to you?\" The Prophet said, \"Yes.\" Ubai said, \"Have I been mentioned by the Lord of the Worlds?\" The Prophet said, \"Yes.\" Then Ubai burst into tears.",
      "chain": [
        "30242",
        "20229",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5742",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني الحسين، حدثنا أحمد بن منيع، حدثنا مروان بن شجاع، حدثنا سالم الأفطس، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال ‏\"‏ الشفاء في ثلاثة شربة عسل، وشرطة محجم، وكية نار، وأنهى أمتي عن الكى ‏\"‏‏.‏ رفع الحديث ورواه القمي عن ليث عن مجاهد عن ابن عباس عن النبي صلى الله عليه وسلم في العسل والحجم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (The Prophet said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire (cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.\"",
      "chain": [
        "11278",
        "30242",
        "20388",
        "11691",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2898",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أحمد بن منيع، ويعقوب الدورقي، قالا حدثنا هشيم، أخبرنا منصور، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت كنت أطيب النبي صلى الله عليه وسلم قبل أن يحرم ويوم النحر قبل أن يطوف بالبيت بطيب فيه مسك ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I used to perfume the Apostle of Allah (may peace be upon him) with a perfume containing musk before entering upon the state of Ihram and on the day of sacrifice (10th of Dhu'l-Hijja) and (at the conclusion of Ihram) before circumambulating the House (for Tawaf-i-Ifada).",
      "chain": [
        "30242",
        "30400",
        "20468",
        "11067",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن منيع، عن عباد بن عباد، ح وحدثنا مسدد، حدثنا حماد بن زيد، - المعنى - عن واصل، عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ يصبح على كل سلامى من ابن آدم صدقة تسليمه على من لقي صدقة وأمره بالمعروف صدقة ونهيه عن المنكر صدقة وإماطته الأذى عن الطريق صدقة وبضعة أهله صدقة ويجزئ من ذلك كله ركعتان من الضحى ‏\"‏ ‏.‏ قال أبو داود وحديث عباد أتم ولم يذكر مسدد الأمر والنهى زاد في حديثه وقال كذا وكذا وزاد ابن منيع في حديثه قالوا يا رسول الله أحدنا يقضي شهوته وتكون له صدقة قال ‏\"‏ أرأيت لو وضعها في غير حلها ألم يكن يأثم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Prophet (ﷺ) as saying: In the morning alms are due for every bone in man's body. His salutation to everyone he meets is alms, his enjoining good is alms, his forbidding what is evil is alms, the removal of harmful thing from the way is alms, to have sexual intercourse with one's wife if alms, and two rak'ahs which one prays in the Duha serve instead of that.Abu Dawud said: The tradition narrated by 'Abbad is more perfect (than the version narrated by Musaddad). Musaddad did not mention in his version \"the command (of good) and the prohibition (of evil)\". Instead, he added in his version saying: \"Such and such.\" Ibn Ma'na added in his version: \"They (the people) said: Messenger of Allah, how is that one of us fulfills his desire and still there are alms for him (i.e. is rewarded)? He replied: What do you think if you had unlawful sexual intercourse, would he not have been a sinner ?",
      "chain": [
        "30242",
        "20243",
        "30175",
        "20022",
        "10726",
        "11316",
        "23"
      ]
    },
    {
      "hadith_no": "1792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن شوكر، وأحمد بن منيع، قالا حدثنا هشيم، عن يزيد بن أبي زياد، - قال ابن منيع أخبرنا يزيد بن أبي زياد المعنى، - عن مجاهد، عن ابن عباس، قال أهل النبي صلى الله عليه وسلم بالحج فلما قدم طاف بالبيت وبين الصفا والمروة - وقال ابن شوكر ولم يقصر ثم اتفقا - ولم يحل من أجل الهدى وأمر من لم يكن ساق الهدى أن يطوف وأن يسعى ويقصر ثم يحل ‏.‏ زاد ابن منيع في حديثه أو يحلق ثم يحل ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) raised his voice in talbiyah for hajj. When he came (to Mecca) he went round the House (the Ka'bah) and ran between as-Safa and al-Marwah. The narrator Ibn Shawkar said: He did not clip his hair, nor did he take off his ihram due to sacrificial animals. But he commanded those who did not bring sacrificial animals with them to go round the Ka'bah, to run between as-Safa and al-Marwah, to clip their hair, and then put off their ihram. The narrator Ibn Mani' added: Or shave their heads, then take off their ihram.\"",
      "chain": [
        "36538",
        "30242",
        "20468",
        "10844",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "2089",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أسباط بن محمد، حدثنا الشيباني، عن عكرمة، عن ابن عباس، - قال الشيباني وذكره عطاء أبو الحسن السوائي ولا أظنه إلا عن ابن عباس، - في هذه الآية ‏{‏ لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن ‏}‏ قال كان الرجل إذا مات كان أولياؤه أحق بامرأته من ولي نفسها إن شاء بعضهم زوجها أو زوجوها وإن شاءوا لم يزوجوها فنزلت هذه الآية في ذلك ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     About the Qur'anic verse: \"It is not lawful for you forcibly to inherit the woman (of your deceased kinsmen), nor (that) ye should put constraint upon them. When a man died, his relatives had more right to his wife then her own guardian. If any one of them wanted to marry her, he did so; or they married her (to some other person), and if they did not want to marry her, they did so. So this verse was revealed about the matter.",
      "chain": [
        "30242",
        "20408",
        "11352",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2322",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، عن ابن أبي زائدة، عن عيسى بن دينار، عن أبيه، عن عمرو بن الحارث بن أبي ضرار، عن ابن مسعود، قال لما صمنا مع النبي صلى الله عليه وسلم تسعا وعشرين أكثر مما صمنا معه ثلاثين ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We kept fast for twenty-nine days along with the Prophet (ﷺ) more often than we kept fast for thirty days.",
      "chain": [
        "30242",
        "20366",
        "25226",
        "5201",
        "16"
      ]
    },
    {
      "hadith_no": "2882",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، أخبرنا عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، قال يا رسول الله إن أمي توفيت أفينفعها إن تصدقت عنها فقال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن لي مخرفا وإني أشهدك أني قد تصدقت به عنها ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     A man said: Messenger of Allah, my mother has died ; will it benefit her if I give sadaqah on her behalf ? He said: Yes. He said: I have a garden, and I call you to witness that I have given it as sadaqah on her behalf.",
      "chain": [
        "30242",
        "20229",
        "11244",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3588",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد الله بن المبارك، حدثنا مصعب بن ثابت، عن عبد الله بن الزبير، قال قضى رسول الله صلى الله عليه وسلم أن الخصمين يقعدان بين يدى الحكم ‏.‏",
      "text_en": " Narrated Abdullah ibn az-Zubayr:                     The Messenger of Allah (ﷺ) gave the decision that the two adversaries should be made to sit in front of the judge.",
      "chain": [
        "30242",
        "20025",
        "28564",
        "106"
      ]
    },
    {
      "hadith_no": "4146",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وأحمد بن منيع، قالا حدثنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن عائشة، رضى الله عنها قالت كان وسادة رسول الله صلى الله عليه وسلم - قال ابن منيع - التي ينام عليها بالليل - ثم اتفقا - من أدم حشوها ليف ‏.‏",
      "text_en": " Narrated 'Aishah:                     The pillow of the Messenger of Allah (ﷺ) on which he slept at night (according to the version on Ibn Mani') was of leather stuffed with palm fibre (according to the agreed version).",
      "chain": [
        "30203",
        "30242",
        "20354",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4431",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كامل، حدثنا يزيد، - يعني ابن زريع - ح وحدثنا أحمد بن منيع، عن يحيى بن زكريا، - وهذا لفظه - عن داود، عن أبي نضرة، عن أبي سعيد، قال لما أمر النبي صلى الله عليه وسلم برجم ماعز بن مالك خرجنا به إلى البقيع فوالله ما أوثقناه ولا حفرنا له ولكنه قام لنا ‏.‏ - قال أبو كامل قال - فرميناه بالعظام والمدر والخزف فاشتد واشتددنا خلفه حتى أتى عرض الحرة فانتصب لنا فرميناه بجلاميد الحرة حتى سكت - قال - فما استغفر له ولا سبه ‏.‏",
      "text_en": " Abu Sa’id said:                      When the Prophet (May peace e upon him) commanded to stone Ma’iz b. Malik, we took him out to Baql. I swear by Allah, we did not tie him, nor did we dig a pit for him. But he was standing before us. The narrator Abu Kamil said: So we threw at him bones, clods of mud and pieces of earthenware. He ran away and we ran after him till he came to a side of the Harrah. He stood there before us and we threw at him big stones of the Harrah until he died. He (the Prophet) did not ask forgiveness for him, nor did he speak ill of him.",
      "chain": [
        "30559",
        "20304",
        "30242",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4794",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو قطن، أخبرنا مبارك، عن ثابت، عن أنس، قال ما رأيت رجلا التقم أذن رسول الله صلى الله عليه وسلم فينحي رأسه حتى يكون الرجل هو الذي ينحي رأسه وما رأيت رجلا أخذ بيده فترك يده حتى يكون الرجل هو الذي يدع يده ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I never said that when any man brought his mouth to the ear of the Messenger of Allah (ﷺ) and he withdrew his head until the man himself withdrew his head, and I never saw that when any man took him by his hand and he withdrew his hand, until the man himself withdrew his hand.",
      "chain": [
        "30242",
        "20563",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5143",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو النضر، حدثنا الليث بن سعد، عن يزيد بن عبد الله بن أسامة بن الهاد، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أبر البر صلة المرء أهل ود أبيه بعد أن يولي ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (May peace be upon him) as saying:                      One of the finest acts of kindness is for a man to treat his father’s friends in a kindly way after he has departed.",
      "chain": [
        "30242",
        "20390",
        "20023",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "5243",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، ح وحدثنا أحمد بن منيع، عن عباد بن عباد، - وهذا لفظه وهو أتم - عن واصل، عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ يصبح على كل سلامى من ابن آدم صدقة تسليمه على من لقي صدقة وأمره بالمعروف صدقة ونهيه عن المنكر صدقة وإماطته الأذى عن الطريق صدقة وبضعته أهله صدقة ‏\"‏ ‏.‏ قالوا يا رسول الله يأتي شهوته وتكون له صدقة قال ‏\"‏ أرأيت لو وضعها في غير حقها أكان يأثم ‏\"‏ ‏.‏ قال ‏\"‏ ويجزئ من ذلك كله ركعتان من الضحى ‏\"‏ ‏.‏ قال أبو داود لم يذكر حماد الأمر والنهى ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: In the morning alms are due from every bone in man's fingers and toes.  Salutation to everyone he meets is alms; enjoining good is alms; forbidding what is disreputable is alms; removing what is harmful from the road is alms; having sexual intercourse with his wife is alms. The people asked: He fulfils his desire, Messenger of Allah; is  it alms? He replied: Tell me if he fulfilled his desire where he had no right, would he commit a sin ? He then said: Two rak'ahs which one prays in the forenoon serve instead of all that.Abu Dawud said: Hammad did not mention enjoining good and forbidding what is disreputable.",
      "chain": [
        "30175",
        "20022",
        "30242",
        "20243",
        "10726",
        "11316",
        "23"
      ]
    },
    {
      "hadith_no": "5251",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن موسى الطحان، قال حدثنا عبد الرحمن بن سابط، عن العباس بن عبد المطلب، أنه قال لرسول الله صلى الله عليه وسلم إنا نريد أن نكنس زمزم وإن فيها من هذه الجنان - يعني الحيات الصغار - فأمر النبي صلى الله عليه وسلم بقتلهن ‏.‏",
      "text_en": " Narrated Al-Abbas ibn AbdulMuttalib:                     Al-Abbas said to the Messenger of Allah (ﷺ): We wish to sweep out Zamzam, but in it there are some of these Jinnan, meaning small snakes; so the Messenger of Allah (ﷺ) ordered that they should be killed.",
      "chain": [
        "30242",
        "20201",
        "10646",
        "100"
      ]
    },
    {
      "hadith_no": "56",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن منيع، وعلي بن حجر، قالا حدثنا إسماعيل ابن علية، عن أبي ريحانة، عن سفينة، أن النبي صلى الله عليه وسلم كان يتوضأ بالمد ويغتسل بالصاع ‏.‏ قال وفي الباب عن عائشة وجابر وأنس بن مالك ‏.‏ قال أبو عيسى حديث سفينة حديث حسن صحيح ‏.‏ وأبو ريحانة اسمه عبد الله بن مطر ‏.‏ وهكذا رأى بعض أهل العلم الوضوء بالمد والغسل بالصاع ‏.‏ وقال الشافعي وأحمد وإسحاق ليس معنى هذا الحديث على التوقيت أنه لا يجوز أكثر منه ولا أقل منه وهو قدر ما يكفي ‏.‏",
      "text_en": " Safinah narrated:                     \"The Prophet would perform Wudu with a Mudd, and he would perform Ghusl with a Sa.\"",
      "chain": [
        "30242",
        "20387",
        "20208",
        "10696",
        "438"
      ]
    },
    {
      "hadith_no": "71",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، وأحمد بن منيع، قالا حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن أم قيس بنت محصن، قالت دخلت بابن لي على النبي صلى الله عليه وسلم لم يأكل الطعام فبال عليه فدعا بماء فرشه عليه ‏.‏ قال وفي الباب عن علي وعائشة وزينب ولبابة بنت الحارث وهي أم الفضل بن عباس بن عبد المطلب وأبي السمح وعبد الله بن عمرو وأبي ليلى وابن عباس ‏.‏ قال أبو عيسى وهو قول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم مثل أحمد وإسحاق قالوا ينضح بول الغلام ويغسل بول الجارية وهذا ما لم يطعما فإذا طعما غسلا جميعا ‏.‏",
      "text_en": " Umm Qais bin Mihsan narrated:                     \"I entered upon the Prophet with a son of mine who was not yet eating food. He urinated on him, so he called for water which he sprinkled over it.\"",
      "chain": [
        "30367",
        "30242",
        "20005",
        "11013",
        "11004",
        "827"
      ]
    },
    {
      "hadith_no": "110",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد الله بن المبارك، أخبرنا يونس بن يزيد، عن الزهري، عن سهل بن سعد، عن أبى بن كعب، قال إنما كان الماء من الماء رخصة في أول الإسلام ثم نهي عنها ‏.‏",
      "text_en": " Ubayy bin Ka'b narrated:                     \"Water is for water,' was only permitted in the beginning of Islam. Then it was prohibited.\"",
      "chain": [
        "30242",
        "20025",
        "20475",
        "11013",
        "399",
        "39"
      ]
    },
    {
      "hadith_no": "111",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد الله بن المبارك، أخبرنا معمر، عن الزهري، بهذا الإسناد مثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإنما كان الماء من الماء في أول الإسلام ثم نسخ بعد ذلك ‏.‏ وهكذا روى غير واحد من أصحاب النبي صلى الله عليه وسلم منهم أبى بن كعب ورافع بن خديج ‏.‏ والعمل على هذا عند أكثر أهل العلم على أنه إذا جامع الرجل امرأته في الفرج وجب عليهما الغسل وإن لم ينزلا ‏.‏",
      "text_en": " Ma'mar narrated :                     a similar narration (as Hadith no. 110) from, Az-Zuhri, with this chain.",
      "chain": [
        "30242",
        "20025",
        "20115",
        "11013"
      ]
    },
    {
      "hadith_no": "113",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا حماد بن خالد الخياط، عن عبد الله بن عمر، هو العمري عن عبيد الله بن عمر، عن القاسم بن محمد، عن عائشة، قالت سئل رسول الله صلى الله عليه وسلم عن الرجل يجد البلل ولا يذكر احتلاما قال ‏\"‏ يغتسل ‏\"‏ ‏.‏ وعن الرجل يرى أنه قد احتلم ولم يجد بللا قال ‏\"‏ لا غسل عليه ‏\"‏ ‏.‏ قالت أم سلمة يا رسول الله هل على المرأة ترى ذلك غسل قال ‏\"‏ نعم إن النساء شقائق الرجال ‏\"‏ ‏.‏ قال أبو عيسى وإنما روى هذا الحديث عبد الله بن عمر عن عبيد الله بن عمر حديث عائشة في الرجل يجد البلل ولا يذكر احتلاما ‏.‏ وعبد الله بن عمر ضعفه يحيى بن سعيد من قبل حفظه في الحديث ‏.‏ وهو قول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين إذا استيقظ الرجل فرأى بلة أنه يغتسل ‏.‏ وهو قول سفيان الثوري وأحمد ‏.‏ وقال بعض أهل العلم من التابعين إنما يجب عليه الغسل إذا كانت البلة بلة نطفة ‏.‏ وهو قول الشافعي وإسحاق ‏.‏ وإذا رأى احتلاما ولم ير بلة فلا غسل عليه عند عامة أهل العلم",
      "text_en": " Aishah narrated:                     \"The Prophet was asked about a man who finds wetness and he does not remember having a wet dream. So he said: 'He is to perform Ghusl. And (he was asked) about a man who had a wet dream but does not find any wetness, so he said: 'No Ghusl is required of him.' Umm Salamah said: 'O Messenger of Al1ah! Is the woman required to perfonn Ghusl if she sees that?' He replied: 'Yes. Indeed women are he partners of men.'\"",
      "chain": [
        "30242",
        "20537",
        "20507",
        "11201",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن منيع، قال حدثنا أبو معاوية، عن عمرو بن ميمون بن مهران، عن سليمان بن يسار، عن عائشة، أنها غسلت منيا من ثوب رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن ابن عباس ‏.‏ وحديث عائشة أنها غسلت منيا من ثوب رسول الله صلى الله عليه وسلم - ليس بمخالف لحديث الفرك لأنه وإن كان الفرك يجزئ فقد يستحب للرجل أن لا يرى على ثوبه أثره ‏.‏ قال ابن عباس المني بمنزلة المخاط فأمطه عنك ولو بإذخرة ‏.‏",
      "text_en": " Sulaiman bin Yasar narrated from Aishah, that :                     she washed Mani from the garment of Allah's Messenger.",
      "chain": [
        "30242",
        "20354",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، والحسن بن الصباح البزار، وأحمد بن محمد بن موسى المعنى، واحد، قالوا حدثنا إسحاق بن يوسف الأزرق، عن سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل فسأله عن مواقيت الصلاة فقال ‏\"‏ أقم معنا إن شاء الله ‏\"‏ ‏.‏ فأمر بلالا فأقام حين طلع الفجر ثم أمره فأقام حين زالت الشمس فصلى الظهر ثم أمره فأقام فصلى العصر والشمس بيضاء مرتفعة ثم أمره بالمغرب حين وقع حاجب الشمس ثم أمره بالعشاء فأقام حين غاب الشفق ثم أمره من الغد فنور بالفجر ثم أمره بالظهر فأبرد وأنعم أن يبرد ثم أمره بالعصر فأقام والشمس آخر وقتها فوق ما كانت ثم أمره فأخر المغرب إلى قبيل أن يغيب الشفق ثم أمره بالعشاء فأقام حين ذهب ثلث الليل ثم قال ‏\"‏ أين السائل عن مواقيت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا ‏.‏ فقال ‏\"‏ مواقيت الصلاة كما بين هذين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ قال وقد رواه شعبة عن علقمة بن مرثد أيضا ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     \"A man came to the Prophet to ask him about the times for Salat. So he said: 'Stay with us, In sha Allah.' So he ordered Bilal to call the Iqamah when Fajr began, then he ordered him to call the Iqamah when the Sun passed the zenith, then he prayed Zuhr. Then he ordered him to call the Iqamah to pray Asr while the sun was elevated and white. Then he ordered him (to call the Iqamah for) Maghrib when the (top) edge of the sun had set. Then he ordered him to call the Iqamah for Isha when the horizon (twilight) had vanished. Then he ordered him in the morning (to give the call for Fajr prayer), when the light of Fajr glowed. Then he ordered (him to call the Iqamah for) Zuhr, so he waited well until it had cooled. Then he ordered (him to call the Iqamah for) Asr, so he calIed the Iqamah while the sun was later in its position than what it was (the day before). Then he ordered him to delay Maghrib until right before the twilight had disappeared. Then he ordered (him to call the Iqamah for) Isha, so he called the Iqamah when a third of the night had passed. Then he said: 'Where is the one who asked about he times for the Salat?' So the man said, 'It is I.' So he said: 'The times [or the Salat are what are between these two.'\"",
      "chain": [
        "30242",
        "30244",
        "30304",
        "20411",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا عوف، قال أحمد وحدثنا عباد بن عباد، هو المهلبي وإسماعيل ابن علية جميعا عن عوف، عن سيار بن سلامة، هو أبو المنهال الرياحي عن أبي برزة، قال كان النبي صلى الله عليه وسلم يكره النوم قبل العشاء والحديث بعدها ‏.‏ قال وفي الباب عن عائشة وعبد الله بن مسعود وأنس ‏.‏ قال أبو عيسى حديث أبي برزة حديث حسن صحيح ‏.‏ وقد كره أكثر أهل العلم النوم قبل صلاة العشاء والحديث بعدها ورخص في ذلك بعضهم ‏.‏ وقال عبد الله بن المبارك أكثر الأحاديث على الكراهية ‏.‏ ورخص بعضهم في النوم قبل صلاة العشاء في رمضان ‏.‏ وسيار بن سلامة هو أبو المنهال الرياحي ‏.‏",
      "text_en": " Abu Barzah narrated:                     \"The Prophet would dislike to sleep before Isha and to talk after it.\"",
      "chain": [
        "30242",
        "20468",
        "11298",
        "30007",
        "20243",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن علقمة، عن عمر بن الخطاب، قال كان رسول الله صلى الله عليه وسلم يسمر مع أبي بكر في الأمر من أمر المسلمين وأنا معهما ‏.‏ وفي الباب عن عبد الله بن عمرو وأوس بن حذيفة وعمران بن حصين ‏.‏ قال أبو عيسى حديث عمر حديث حسن ‏.‏ وقد روى هذا الحديث الحسن بن عبيد الله عن إبراهيم عن علقمة عن رجل من جعفي يقال له قيس أو ابن قيس عن عمر عن النبي صلى الله عليه وسلم هذا الحديث في قصة طويلة ‏.‏ وقد اختلف أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم في السمر بعد صلاة العشاء الآخرة فكره قوم منهم السمر بعد صلاة العشاء ورخص بعضهم إذا كان في معنى العلم وما لا بد منه من الحوائج وأكثر الحديث على الرخصة ‏.‏ وقد روي عن النبي صلى الله عليه وسلم قال ‏\"‏ لا سمر إلا لمصل أو مسافر ‏\"‏ ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated:                     \"Allah's Messenger would talk during the night with Abu Bakr about matters concerning the Muslims while I was with them.\"",
      "chain": [
        "30242",
        "20354",
        "11060",
        "11051",
        "11017",
        "3"
      ]
    },
    {
      "hadith_no": "172",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يعقوب بن الوليد المدني، عن عبد الله بن عمر، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوقت الأول من الصلاة رضوان الله والوقت الآخر عفو الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روى ابن عباس عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال وفي الباب عن علي وابن عمر وعائشة وابن مسعود ‏.‏ قال أبو عيسى حديث أم فروة لا يروى إلا من حديث عبد الله بن عمر العمري وليس هو بالقوي عند أهل الحديث واضطربوا عنه في هذا الحديث وهو صدوق وقد تكلم فيه يحيى بن سعيد من قبل حفظه ‏.‏",
      "text_en": " Ibn Umar narrated that :                     Allah's Messenger said: \"The beginning of the time for Salat is pleasing to Allah, and the end of its time is pardoned by Allah.\"",
      "chain": [
        "30242",
        "22243",
        "20507",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "183",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا منصور، وهو ابن زاذان عن قتادة، قال أخبرنا أبو العالية، عن ابن عباس، قال سمعت غير، واحد، من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب وكان من أحبهم إلى أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد الفجر حتى تطلع الشمس وعن الصلاة بعد العصر حتى تغرب الشمس ‏.‏ قال وفي الباب عن علي وابن مسعود وأبي سعيد وعقبة بن عامر وأبي هريرة وابن عمر وسمرة بن جندب وعبد الله بن عمرو ومعاذ بن عفراء والصنابحي ولم يسمع من النبي صلى الله عليه وسلم وسلمة بن الأكوع وزيد بن ثابت وعائشة وكعب بن مرة وأبي أمامة وعمرو بن عبسة ويعلى بن أمية ومعاوية ‏.‏ قال أبو عيسى حديث ابن عباس عن عمر حديث حسن صحيح ‏.‏ وهو قول أكثر الفقهاء من أصحاب النبي صلى الله عليه وسلم ومن بعدهم أنهم كرهوا الصلاة بعد صلاة الصبح حتى تطلع الشمس وبعد صلاة العصر حتى تغرب الشمس وأما الصلوات الفوائت فلا بأس أن تقضى بعد العصر وبعد الصبح ‏.‏ قال علي بن المديني قال يحيى بن سعيد قال شعبة لم يسمع قتادة من أبي العالية إلا ثلاثة أشياء حديث عمر أن النبي صلى الله عليه وسلم نهى عن الصلاة بعد العصر حتى تغرب الشمس وبعد الصبح حتى تطلع الشمس وحديث ابن عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينبغي لأحد أن يقول أنا خير من يونس بن متى ‏\"‏ ‏.‏ وحديث علي ‏\"‏ القضاة ثلاثة ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"I head more than one of the Companions of the Prophet; Umar bin Al-Khattab among, and he was one of the most beloved among them to me - (narrating) that Allah's Messenger prohibited the Salat after Fajr until the sun had risen, and the Salat after Asr until the sun had set.\"",
      "chain": [
        "30242",
        "20468",
        "11067",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا أبو إسرائيل، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن بلال، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ لا تثوبن في شيء من الصلوات إلا في صلاة الفجر ‏\"‏ ‏.‏ قال وفي الباب عن أبي محذورة ‏.‏ قال أبو عيسى حديث بلال لا نعرفه إلا من حديث أبي إسرائيل الملائي ‏.‏ وأبو إسرائيل لم يسمع هذا الحديث من الحكم بن عتيبة قال إنما رواه عن الحسن بن عمارة عن الحكم بن عتيبة ‏.‏ وأبو إسرائيل اسمه إسماعيل بن أبي إسحاق وليس هو بذاك القوي عند أهل الحديث ‏.‏ وقد اختلف أهل العلم في تفسير التثويب فقال بعضهم التثويب أن يقول في أذان الفجر الصلاة خير من النوم وهو قول ابن المبارك وأحمد ‏.‏ وقال إسحاق في التثويب غير هذا قال التثويب المكروه هو شيء أحدثه الناس بعد النبي صلى الله عليه وسلم إذا أذن المؤذن فاستبطأ القوم قال بين الأذان والإقامة قد قامت الصلاة حى على الصلاة حى على الفلاح ‏.‏ قال وهذا الذي قال إسحاق هو التثويب الذي قد كرهه أهل العلم والذي أحدثوه بعد النبي صلى الله عليه وسلم ‏.‏ والذي فسر ابن المبارك وأحمد أن التثويب أن يقول المؤذن في أذان الفجر الصلاة خير من النوم وهو قول صحيح ويقال له التثويب أيضا وهو الذي اختاره أهل العلم ورأوه ‏.‏ وروي عن عبد الله بن عمر أنه كان يقول في صلاة الفجر الصلاة خير من النوم ‏.‏ وروي عن مجاهد قال دخلت مع عبد الله بن عمر مسجدا وقد أذن فيه ونحن نريد أن نصلي فيه فثوب المؤذن فخرج عبد الله بن عمر من المسجد وقال اخرج بنا من عند هذا المبتدع ‏.‏ ولم يصل فيه ‏.‏ قال وإنما كره عبد الله التثويب الذي أحدثه الناس بعد ‏.‏",
      "text_en": " BilaI narrated:                     \"Allah's Messenger said [to me]: 'Do not say the Tathwlb for any prayer except the Fair prayer.'\"",
      "chain": [
        "30242",
        "20355",
        "11069",
        "11196",
        "24"
      ]
    },
    {
      "hadith_no": "219",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يعلى بن عطاء، حدثنا جابر بن يزيد بن الأسود العامري، عن أبيه، قال شهدت مع النبي صلى الله عليه وسلم حجته فصليت معه صلاة الصبح في مسجد الخيف ‏.‏ قال فلما قضى صلاته وانحرف إذا هو برجلين في أخرى القوم لم يصليا معه فقال ‏\"‏ على بهما ‏\"‏ ‏.‏ فجيء بهما ترعد فرائصهما فقال ‏\"‏ ما منعكما أن تصليا معنا ‏\"‏ ‏.‏ فقالا يا رسول الله إنا كنا قد صلينا في رحالنا ‏.‏ قال فلا تفعلا إذا صليتما في رحالكما ثم أتيتما مسجد جماعة فصليا معهم فإنها لكما نافلة ‏\"‏ ‏.‏ قال وفي الباب عن محجن الديلي ويزيد بن عامر ‏.‏ قال أبو عيسى حديث يزيد بن الأسود حديث حسن صحيح ‏.‏ وهو قول غير واحد من أهل العلم وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق قالوا إذا صلى الرجل وحده ثم أدرك الجماعة فإنه يعيد الصلوات كلها في الجماعة وإذا صلى الرجل المغرب وحده ثم أدرك الجماعة قالوا فإنه يصليها معهم ويشفع بركعة ‏.‏ والتي صلى وحده هي المكتوبة عندهم ‏.‏",
      "text_en": " Jabir hin Yazid hin Al-Aswad [Al-Amir] narrated that his father said:                     \"I attended Hajj with the Prophet. I prayed the Subh (Fajr) prayer with him in Masjid AI-Khaif.\" He said: \"When the Prophet finished, he turned (from the Qiblah) and saw two men at the back of the people who had not prayed with him. He said, 'Bring them to me.' So I brought then while they were shuddering with fear. He said: 'What prevented you from praying with us?\" They said: 'O Messenger of Allah!' We prayed at our camp.' So he said: 'Do not do that; when you pray in your camp then you come to a Masjid with a congregation, then pray with them. That will be a voluntary prayer for you.'\"",
      "chain": [
        "30242",
        "20468",
        "10986",
        "18112"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، حدثنا سعيد بن إياس الجريري، عن قيس بن عباية، عن ابن عبد الله بن مغفل، قال سمعني أبي، وأنا في الصلاة، أقول‏:‏ ‏(‏بسم الله الرحمن الرحيم‏)‏ فقال لي أى بنى محدث إياك والحدث ‏.‏ قال ولم أر أحدا من أصحاب رسول الله صلى الله عليه وسلم كان أبغض إليه الحدث في الإسلام يعني منه ‏.‏ قال وقد صليت مع النبي صلى الله عليه وسلم ومع أبي بكر ومع عمر ومع عثمان فلم أسمع أحدا منهم يقولها فلا تقلها إذا أنت صليت فقل‏:‏ ‏(‏الحمد لله رب العالمين‏)‏ ‏.‏ قال أبو عيسى حديث عبد الله بن مغفل حديث حسن ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وعثمان وعلي وغيرهم ومن بعدهم من التابعين وبه يقول سفيان الثوري وابن المبارك وأحمد وإسحاق لا يرون أن يجهر ب  ‏(‏بسم الله الرحمن الرحيم ‏)‏ قالوا ويقولها في نفسه ‏.‏",
      "text_en": " Ibn Abdullah bin Mughaffal narrated:                     \"While I was praying, I said: Bismillahir-Rahmanir-Rahim \"In the Name of Allah, the Merciful, the Beneficent.\" My father heard me and said: \"O my son this is a newly invented matter, beware of the newly-invented.'\" He (Ibn Abdullah) said: \"I have not seen any one of the Companions of Allah's Messenger who hated a newly invented matter in Islam more than him. And he said: 'Ihave performed Salat with the Prophet, and with Abu Bakr, and Umar, and with Uthman. I did not hear any one of them saying it. So do not say it. When you are performing Salat say: Al-Hamdu lilahi Rabbil-Alamin \"All praise is due to Allah the Lord of all that exists.'\"",
      "chain": [
        "30242",
        "20208",
        "11286",
        "19938"
      ]
    },
    {
      "hadith_no": "258",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو بكر بن عياش، حدثنا أبو حصين، عن أبي عبد الرحمن السلمي، قال قال لنا عمر بن الخطاب رضى الله عنه إن الركب سنت لكم فخذوا بالركب ‏.‏ قال وفي الباب عن سعد وأنس وأبي حميد وأبي أسيد وسهل بن سعد ومحمد بن مسلمة وأبي مسعود ‏.‏ قال أبو عيسى حديث عمر حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم لا اختلاف بينهم في ذلك إلا ما روي عن ابن مسعود وبعض أصحابه أنهم كانوا يطبقون ‏.‏ والتطبيق منسوخ عند أهل العلم ‏.‏",
      "text_en": " Abu Abdur-Rahman As-Sulami said:                     \"Umar bin Al-Khattab [may Allah be pleased with him] said to us: 'The knees are the Sunnah for you, so hold the knees.'\"",
      "chain": [
        "30242",
        "20373",
        "11371",
        "11359",
        "3"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود الأنصاري البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم فيها الرجل يعني صلبه في الركوع والسجود ‏\"‏ ‏.‏ قال وفي الباب عن علي بن شيبان وأنس وأبي هريرة ورفاعة الزرقي ‏.‏ قال أبو عيسى حديث أبي مسعود الأنصاري حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم يرون أن يقيم الرجل صلبه في الركوع والسجود ‏.‏ وقال الشافعي وأحمد وإسحاق من لم يقم صلبه في الركوع والسجود فصلاته فاسدة لحديث النبي صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏ وأبو معمر اسمه عبد الله بن سخبرة ‏.‏ وأبو مسعود الأنصاري البدري اسمه عقبة بن عمرو ‏.‏",
      "text_en": " Abu Mas'ud Al-Ansari [Al-Badri] narrated that :                     Allah's Messenger said: \"The Salat is not acceptable if a man is not at rest - meaning his back - while bowing and prostrating.\"",
      "chain": [
        "30242",
        "20354",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "298",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن عاصم الأحول، عن عبد الله بن الحارث، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا سلم لا يقعد إلا مقدار ما يقول ‏\"‏ اللهم أنت السلام ومنك السلام تباركت ذا الجلال والإكرام ‏\"‏ ‏.‏",
      "text_en": " Aishah narrated:                     \"When Allah's Messenger said the Salam he would not remain seated except long enough to say: (Allahumma antas-salam, wa minkas-salam, tabarakta dhal jalali wal-Ikram) 'O Allah! You are the One free of defects, and perfection is from You. Blessed are You, Possessor of Majesty and Honor.'\"",
      "chain": [
        "30242",
        "20354",
        "11080",
        "912",
        "53"
      ]
    },
    {
      "hadith_no": "307",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن سماك بن حرب، عن جابر بن سمرة، أن رسول الله صلى الله عليه وسلم كان يقرأ في الظهر والعصر بالسماء ذات البروج والسماء والطارق وشبههما ‏.‏ قال وفي الباب عن خباب وأبي سعيد وأبي قتادة وزيد بن ثابت والبراء بن عازب ‏.‏ قال أبو عيسى حديث جابر بن سمرة حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قرأ في الظهر قدر تنزيل السجدة ‏.‏ وروي عنه أنه كان يقرأ في الركعة الأولى من الظهر قدر ثلاثين آية وفي الركعة الثانية قدر خمس عشرة آية ‏.‏ وروي عن عمر أنه كتب إلى أبي موسى أن اقرأ في الظهر بأوساط المفصل ‏.‏ ورأى بعض أهل العلم أن القراءة في صلاة العصر كنحو القراءة في صلاة المغرب يقرأ بقصار المفصل ‏.‏ وروي عن إبراهيم النخعي أنه قال تعدل صلاة العصر بصلاة المغرب في القراءة ‏.‏ وقال إبراهيم تضاعف صلاة الظهر على صلاة العصر في القراءة أربع مرار ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"For Zuhr and Asr, Allah's Messenger would recite: By the heavens, holding the Buruj and (By the heavens and At-Tariq) and similar to them.\"",
      "chain": [
        "30242",
        "20472",
        "20021",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "338",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يونس بن عبيد، ومنصور بن زاذان، عن حميد بن هلال، عن عبد الله بن الصامت، قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى الرجل وليس بين يديه كآخرة الرحل أو كواسطة الرحل قطع صلاته الكلب الأسود والمرأة والحمار ‏\"‏ ‏.‏ فقلت لأبي ذر ما بال الأسود من الأحمر من الأبيض فقال يا ابن أخي سألتني كما سألت رسول الله صلى الله عليه وسلم فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد والحكم بن عمرو الغفاري وأبي هريرة وأنس ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إليه قالوا يقطع الصلاة الحمار والمرأة والكلب الأسود ‏.‏ قال أحمد الذي لا أشك فيه أن الكلب الأسود يقطع الصلاة وفي نفسي من الحمار والمرأة شيء ‏.‏ قال إسحاق لا يقطعها شيء إلا الكلب الأسود ‏.‏",
      "text_en": " Abu Dharr said that :                     Allah's Messenger said: \"When a man performs Salat, and there is nothing in front of him like the post of a saddle, or a camel saddle, then his Salat is severed by (passing of) a black dog, a woman, and a donkey.\" It was said to Abu Dharr: \"What is the problem with the black dog rather than the red or white one?\" He said: \"O my nephew! I asked Allah's Messenger just as you have asked me. He said: 'The black dog is a Shaitan (devil).'\"",
      "chain": [
        "30242",
        "20468",
        "11075",
        "11444",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "364",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا ابن أبي ليلى، عن الشعبي، قال صلى بنا المغيرة بن شعبة فنهض في الركعتين فسبح به القوم وسبح بهم فلما صلى بقية صلاته سلم ثم سجد سجدتى السهو وهو جالس ثم حدثهم أن رسول الله صلى الله عليه وسلم فعل بهم مثل الذي فعل ‏.‏ قال وفي الباب عن عقبة بن عامر وسعد وعبد الله ابن بحينة ‏.‏ قال أبو عيسى حديث المغيرة بن شعبة قد روي من غير وجه عن المغيرة بن شعبة ‏.‏ قال أبو عيسى وقد تكلم بعض أهل العلم في ابن أبي ليلى من قبل حفظه ‏.‏ قال أحمد لا يحتج بحديث ابن أبي ليلى ‏.‏ وقال محمد بن إسماعيل ابن أبي ليلى هو صدوق ولا أروي عنه لأنه لا يدري صحيح حديثه من سقيمه وكل من كان مثل هذا فلا أروي عنه شيئا ‏.‏ وقد روي هذا الحديث من غير وجه عن المغيرة بن شعبة رواه سفيان عن جابر عن المغيرة بن شبيل عن قيس بن أبي حازم عن المغيرة بن شعبة ‏.‏ وجابر الجعفي قد ضعفه بعض أهل العلم تركه يحيى بن سعيد وعبد الرحمن بن مهدي وغيرهما ‏.‏ والعمل على هذا عند أهل العلم أن الرجل إذا قام في الركعتين مضى في صلاته وسجد سجدتين منهم من رأى قبل التسليم ومنهم من رأى بعد التسليم ‏.‏ ومن رأى قبل التسليم فحديثه أصح لما روى الزهري ويحيى بن سعيد الأنصاري عن عبد الرحمن الأعرج عن عبد الله ابن بحينة ‏.‏",
      "text_en": " Ash-Sha'bi narrated:                     \"Al-Mughirah bin Shu'bah led us in Salat, and he continued after the two Rak'ah, so the people said: 'Subhan Allah' and he said: 'Subhan Allah' to them. When he finished his Salat he said the Taslim then performed two prostrations of As-Sahw while he was sitting. Then he narrated to them that Allah's Messenger did the same with them as he had done.\"",
      "chain": [
        "30242",
        "20468",
        "11196",
        "11052"
      ]
    },
    {
      "hadith_no": "375",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا خالد، وهو الحذاء عن عبد الله بن شقيق، عن عائشة، قال سألتها عن صلاة، رسول الله صلى الله عليه وسلم عن تطوعه قالت كان يصلي ليلا طويلا قائما وليلا طويلا قاعدا فإذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ وهو جالس ركع وسجد وهو جالس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bun Shaqiq narrated from Aishah, he said:                     \"I asked her about the voluntary Salat of Allah's Messenger (S), she said: 'He would pray long into the night standing, and long into the night sitting. So when he recited and he was standing, he would bow and prostrate whole he was standing, and when he recited while he was sitting, he bowed and prostrated while he was sitting.'\"",
      "chain": [
        "30242",
        "20468",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "381",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عباد بن العوام، أخبرنا ميمون أبو حمزة، عن أبي صالح، مولى طلحة عن أم سلمة، قالت رأى النبي صلى الله عليه وسلم غلاما لنا يقال له أفلح إذا سجد نفخ فقال ‏\"‏ يا أفلح ترب وجهك ‏\"‏ ‏.‏ قال أحمد بن منيع وكره عباد بن العوام النفخ في الصلاة وقال إن نفخ لم يقطع صلاته ‏.‏ قال أحمد بن منيع وبه نأخذ ‏.‏ قال أبو عيسى وروى بعضهم عن أبي حمزة هذا الحديث وقال مولى لنا يقال له رباح ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The Prophet (S) saw a boy of ours - called Aflah - blowing when he prostrated. So he said: 'O Aflah! Put your face in the dirt.'\"",
      "chain": [
        "30242",
        "20431",
        "19060",
        "19290",
        "56"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، عن هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم سجدهما بعد السلام ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه أيوب وغير واحد عن ابن سيرين ‏.‏ وحديث ابن مسعود حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا إذا صلى الرجل الظهر خمسا فصلاته جائزة وسجد سجدتى السهو وإن لم يجلس في الرابعة ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعضهم إذا صلى الظهر خمسا ولم يقعد في الرابعة مقدار التشهد فسدت صلاته ‏.‏ وهو قول سفيان الثوري وبعض أهل الكوفة ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Prophet (S) performed two prostrations after the Salam.\"",
      "chain": [
        "30242",
        "20468",
        "11311",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "396",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، حدثنا هشام الدستوائي، عن يحيى بن أبي كثير، عن عياض يعني ابن هلال، قال قلت لأبي سعيد أحدنا يصلي فلا يدري كيف صلى فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى أحدكم فلم يدر كيف صلى فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏ قال وفي الباب عن عثمان وابن مسعود وعائشة وأبي هريرة ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن ‏.‏ وقد روي هذا الحديث عن أبي سعيد من غير هذا الوجه ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إذا شك أحدكم في الواحدة والثنتين فليجعلهما واحدة وإذا شك في الثنتين والثلاث فليجعلهما ثنتين ويسجد في ذلك سجدتين قبل أن يسلم ‏\"‏ ‏.‏ والعمل على هذا عند أصحابنا ‏.‏ وقال بعض أهل العلم إذا شك في صلاته فلم يدر كم صلى فليعد ‏.‏",
      "text_en": " Iyad bin Hilal said:                     \"I said to Abu Sa'eed: 'One of us performs Salat and we do not know how (much) we prayed.' So he said: 'Allah's Messenger (S) said: \"When one of you performs Salat and he does now know how (much) he prayed then let him perform two prostrations while he is sitting.\"",
      "chain": [
        "30242",
        "20208",
        "20295",
        "11449"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، عن أبي مالك الأشجعي، قال قلت لأبي يا أبة إنك قد صليت خلف رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان وعلي بن أبي طالب ها هنا بالكوفة نحوا من خمس سنين أكانوا يقنتون قال أى بنى محدث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم ‏.‏ وقال سفيان الثوري إن قنت في الفجر فحسن وإن لم يقنت فحسن ‏.‏ واختار أن لا يقنت ‏.‏ ولم ير ابن المبارك القنوت في الفجر ‏.‏ قال أبو عيسى وأبو مالك الأشجعي اسمه سعد بن طارق بن أشيم ‏.‏",
      "text_en": " Abu Malik Al-Ashjai narrated:                     \"I said to my father: 'O my father! You offered Salat behind Allah's Messenger (S), Abu Bakr, Umar, Uthman, and Ali bin Abi Talib here in Al-Kufah for about five years. Did they say the Qunut?' He said: 'It is a newly invented matter my son.'\"",
      "chain": [
        "30242",
        "20472",
        "10766"
      ]
    },
    {
      "hadith_no": "405",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم خلف رسول الله صلى الله عليه وسلم في الصلاة يكلم الرجل منا صاحبه إلى جنبه حتى نزلت ‏:‏ ‏(‏وقوموا لله قانتين ‏)‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏ قال وفي الباب عن ابن مسعود ومعاوية بن الحكم ‏.‏ قال أبو عيسى حديث زيد بن أرقم حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم ‏.‏ قالوا إذا تكلم الرجل عامدا في الصلاة أو ناسيا أعاد الصلاة ‏.‏ وهو قول سفيان الثوري وابن المبارك وأهل الكوفة ‏.‏ وقال بعضهم إذا تكلم عامدا في الصلاة أعاد الصلاة وإن كان ناسيا أو جاهلا أجزأه ‏.‏ وبه يقول الشافعي ‏.‏",
      "text_en": " Zaid bin Arqam narrated:                     \"We used to talk behind Allah's Messenger (S) during the Salat, a man among us would talk to his companions next to him until (the following) was revealed: And stand before Allah with obedience. (2:238) So we were ordered to be silent and prohibited from talking.\"",
      "chain": [
        "30242",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثنا عمرو بن دينار، قال سمعت عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏ قال وفي الباب عن ابن بحينة وعبد الله بن عمرو وعبد الله بن سرجس وابن عباس وأنس ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏ وهكذا روى أيوب وورقاء بن عمر وزياد بن سعد وإسماعيل بن مسلم ومحمد بن جحادة عن عمرو بن دينار عن عطاء بن يسار عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وروى حماد بن زيد وسفيان بن عيينة عن عمرو بن دينار فلم يرفعاه ‏.‏ والحديث المرفوع أصح عندنا ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا أقيمت الصلاة أن لا يصلي الرجل إلا المكتوبة ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقد روي هذا الحديث عن أبي هريرة عن النبي صلى الله عليه وسلم من غير هذا الوجه رواه عياش بن عباس القتباني المصري عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     Allah's Messenger (S) said: \"When the Iqamah has been called for the Salat then there is no Salat except the obligatory.\"",
      "chain": [
        "30242",
        "20229",
        "11244",
        "11081",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "425",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، عن أيوب، عن نافع، عن ابن عمر، قال صليت مع النبي صلى الله عليه وسلم ركعتين قبل الظهر وركعتين بعدها ‏.‏ قال وفي الباب عن علي وعائشة ‏.‏ قال أبو عيسى حديث ابن عمر حديث صحيح ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"I prayed two Rak'ah with the Prophet (S) before Az-Zuhr and two Rak'ah after it.\"",
      "chain": [
        "30242",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، عن أيوب، عن نافع، عن ابن عمر، قال صليت مع النبي صلى الله عليه وسلم ركعتين بعد المغرب في بيته ‏.‏ قال وفي الباب عن رافع بن خديج وكعب بن عجرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"I prayed two Rak'ah after Al-Maghrib with the Prophet (S) in his house.\"",
      "chain": [
        "30242",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو بكر بن عياش، حدثنا أبو حصين، عن يحيى بن وثاب، عن مسروق، أنه سأل عائشة عن وتر، رسول الله صلى الله عليه وسلم فقالت من كل الليل قد أوتر أوله وأوسطه وآخره فانتهى وتره حين مات إلى السحر ‏.‏ قال أبو عيسى أبو حصين اسمه عثمان بن عاصم الأسدي ‏.‏ قال وفي الباب عن علي وجابر وأبي مسعود الأنصاري وأبي قتادة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وهو الذي اختاره بعض أهل العلم الوتر من آخر الليل ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The Prophet would perform Witr with thirteen [Rak'ah]. When he was older and became weak he performed Witr with seven.\"",
      "chain": [
        "30242",
        "20373",
        "11371",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "467",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يحيى بن زكريا بن أبي زائدة، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ بادروا الصبح بالوتر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Prophet said: \"Precede the morning with Al-Witr.\"",
      "chain": [
        "30242",
        "20366",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "492",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان بن عيينة، عن الزهري، عن سالم، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ من أتى الجمعة فليغتسل ‏\"‏ ‏.‏ قال وفي الباب عن عمر وأبي سعيد وجابر والبراء وعائشة وأبي الدرداء ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏",
      "text_en": " Salim narrated from his father, from his grandfather, that he heard :                     the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"",
      "chain": [
        "30242",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سريج بن النعمان، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن أنس بن مالك، أن النبي صلى الله عليه وسلم كان يصلي الجمعة حين تميل الشمس ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"The Prophet would pray the Friday prayer when the sun was declining.\"",
      "chain": [
        "30242",
        "30250",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "515",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا حصين، قال سمعت عمارة بن، رويبة الثقفي، وبشر بن مروان، يخطب فرفع يديه في الدعاء فقال عمارة قبح الله هاتين اليديتين القصيرتين لقد رأيت رسول الله صلى الله عليه وسلم وما يزيد على أن يقول هكذا وأشار هشيم بالسبابة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Husain narrated:                     \"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.",
      "chain": [
        "30242",
        "20468",
        "15097"
      ]
    },
    {
      "hadith_no": "516",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا حماد بن خالد الخياط، عن ابن أبي ذئب، عن الزهري، عن السائب بن يزيد، قال كان الأذان على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر إذا خرج الإمام وإذا أقيمت الصلاة فلما كان عثمان رضى الله عنه زاد النداء الثالث على الزوراء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " As-Sa'ib bin Yazid narrated:                     \"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"",
      "chain": [
        "30242",
        "20537",
        "20177",
        "11013",
        "3048"
      ]
    }
  ],
  "total_hadiths": 276
}