{
  "id": "30255",
  "name": "'Aabad bin Musa al-Khtly عباد بن موسى الختلي",
  "full_name": "'Aabad bin Musa al-Khtly عباد بن موسى الختلي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "230",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20162",
      "name": "Talha bin Yahya bin al-Nu'man طلحة بن يحيى بن النعمان بن أبي عياش",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38042",
      "name": "Ahmed bin 'Ali bin Sa'id أحمد بن علي بن سعيد",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6372",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا عباد بن موسى، حدثنا إسماعيل بن جعفر، عن إسرائيل، عن أبي إسحاق، عن سعيد بن جبير، قال سئل ابن عباس مثل من أنت حين قبض النبي صلى الله عليه وسلم قال أنا يومئذ مختون‏.‏ قال وكانوا لا يختنون الرجل حتى يدرك‏.‏",
      "text_en": "      Narrated Said bin Jubair:                      Ibn 'Abbas was asked, \"How old were you when     the Prophet died?\" He replied. \"At that time I had been circumcised.\"      At that time, people did not circumcise the boys till they attained      the age of puberty. Sa'id bin Jubair said, \"Ibn 'Abbas said, 'When the     Prophet died, I had already been circumcised. \"",
      "chain": [
        "30272",
        "30255",
        "20155",
        "20311",
        "11049",
        "11050"
      ]
    },
    {
      "hadith_no": "5608",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، وعباد بن موسى، قالا حدثنا طلحة بن يحيى، -وهو الأنصاري ثم الزرقي - عن يونس، عن ابن شهاب، عن أنس بن مالك، أن رسولالله صلى الله عليه وسلم لبس خاتم فضة في يمينه فيه فص حبشي كان يجعل فصهمما يلي كفه ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) wore a silver ring on his right hand which had an Abyssinian stone in it, and he kept its stone towards the palm.",
      "chain": [
        "30203",
        "30255",
        "11863",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "6239",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، وعباد بن موسى، قالا حدثنا طلحة بن يحيى، عن  يونس بن يزيد، عن ابن شهاب، بالإسنادين جميعا مثل حديث عقيل ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shihab through the same chain of transmitters.",
      "chain": [
        "30203",
        "30255",
        "11863",
        "20475"
      ]
    },
    {
      "hadith_no": "6330",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عباد بن موسى، حدثنا إبراهيم بن سعد، أخبرني أبي، عن محمد بن جبير، بن مطعم عن أبيه، أن امرأة، سألت رسول الله صلى الله عليه وسلم شيئا فأمرها أن ترجع إليه فقالت يا رسول الله أرأيت إن جئت فلم أجدك قال أبي كأنها تعني الموت ‏.‏ قال ‏\"‏ فإن لم تجديني فأتي أبا بكر ‏\"‏ ‏.‏  وحدثنيه حجاج بن الشاعر، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن أبيه، أخبرني  محمد بن جبير بن مطعم، أن أباه، جبير بن مطعم أخبره أن امرأة أتت رسول الله صلى الله عليه وسلم فكلمته في شىء فأمرها بأمر ‏.‏ بمثل حديث عباد بن موسى ‏.‏",
      "text_en": " Muhammad b. Jubair b. Mut'im reported on the authority of his father that a woman asked Allah's Messenger (may peace be upon him) about something but lit, told her to come to him on some other occasion, whereupon she said:                      What in your opinion (should I do) if I come to you but do not find you, and it seemed as if she meant that he might die. Thereupon he said: If you do not find me, then come to Abu Bakr. This hadith has been narrated on the authority of Jubair b. Mut'im through another chain of transmitters (and the words are) that a woman came to Allah's Messenger (may peace be upon him) and discussed with him something and he gave a command as we find in the above-mentioned narration.",
      "chain": [
        "30255",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "160",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، وعباد بن موسى، قالا حدثنا هشيم، عن يعلى بن عطاء، عن أبيه، - قال عباد - قال أخبرني أوس بن أبي أوس الثقفي، أن رسول الله صلى الله عليه وسلم توضأ ومسح على نعليه وقدميه ‏.‏ وقال عباد رأيت رسول الله صلى الله عليه وسلم أتى كظامة قوم - يعني الميضأة ولم يذكر مسدد الميضأة والكظامة ثم اتفقا - فتوضأ ومسح على نعليه وقدميه ‏.‏",
      "text_en": " Narrated Aws ibn AbuAws ath-Thaqafi:                     The Messenger of Allah (ﷺ) performed ablution and wiped over his shoes and feet.  Abbad (a sub-narrator) said: The Messenger of Allah (ﷺ) came to the well of a people. Musaddad did not mention the words Midat (a place where ablution is performed), and Kazamah (well). Then both agreed on the wording:\"He performed ablution and wiped over his shoes and feet.\"",
      "chain": [
        "30175",
        "30255",
        "20468",
        "10986",
        "20431"
      ]
    },
    {
      "hadith_no": "498",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباد بن موسى الختلي، وزياد بن أيوب، - وحديث عباد أتم - قالا حدثنا هشيم، عن أبي بشر، - قال زياد أخبرنا أبو بشر، - عن أبي عمير بن أنس، عن عمومة، له من الأنصار قال اهتم النبي صلى الله عليه وسلم للصلاة كيف يجمع الناس لها فقيل له انصب راية عند حضور الصلاة فإذا رأوها آذن بعضهم بعضا فلم يعجبه ذلك قال فذكر له القنع - يعني الشبور - وقال زياد شبور اليهود فلم يعجبه ذلك وقال ‏\"‏ هو من أمر اليهود ‏\"‏ ‏.‏ قال فذكر له الناقوس فقال ‏\"‏ هو من أمر النصارى ‏\"‏ ‏.‏ فانصرف عبد الله بن زيد بن عبد ربه وهو مهتم لهم رسول الله صلى الله عليه وسلم فأري الأذان في منامه - قال - فغدا على رسول الله صلى الله عليه وسلم فأخبره فقال له يا رسول الله إني لبين نائم ويقظان إذ أتاني آت فأراني الأذان ‏.‏ قال وكان عمر بن الخطاب - رضى الله عنه - قد رآه قبل ذلك فكتمه عشرين يوما - قال - ثم أخبر النبي صلى الله عليه وسلم فقال له ‏\"‏ ما منعك أن تخبرني ‏\"‏ ‏.‏ فقال سبقني عبد الله بن زيد فاستحييت فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فانظر ما يأمرك به عبد الله بن زيد فافعله ‏\"‏ ‏.‏ قال فأذن بلال ‏.‏ قال أبو بشر فأخبرني أبو عمير أن الأنصار تزعم أن عبد الله بن زيد لولا أنه كان يومئذ مريضا لجعله رسول الله صلى الله عليه وسلم مؤذنا ‏.‏",
      "text_en": " Narrated AbuUmayr ibn Anas:                     AbuUmayr reported on the authority of his uncle who was from the Ansar (the helpers of the Prophet): The Prophet (ﷺ) was anxious as to how to gather the people for prayer.  The people told him: Hoist a flag at the time of prayer; when they see it, they will inform one another. But he (the Prophet) did not like it. Then someone mentioned to him the horn.  Ziyad said: A horn of the Jews. He (the Prophet) did not like it. He said: This is the matter of the Jews. Then they mentioned to him the bell of the Christians.  He said: This is the matter of the Christians.  Abdullah ibn Zayd returned anxiously from there because of the anxiety of the Apostle (ﷺ). He was then taught the call to prayer in his dream. Next day he came to the Messenger of Allah (ﷺ) and informed him about it.  He said: Messenger of Allah, I was between sleep and wakefulness; all of a sudden a newcomer came (to me) and taught me the call to prayer. Umar ibn al-Khattab had also seen it in his dream before, but he kept it hidden for twenty days.  The Prophet (ﷺ) said to me (Umar): What did prevent you from saying it to me?  He said: Abdullah ibn Zayd had already told you about it before me: hence I was ashamed.  Then the Messenger of Allah (ﷺ) said: Bilal, stand up, see what Abdullah ibn Zayd tells you (to do), then do it. Bilal then called them to prayer.  AbuBishr reported on the authority of AbuUmayr: The Ansar thought that if Abdullah ibn Zayd had not been ill on that day, the Messenger of Allah (ﷺ) would have made him mu'adhdhin.",
      "chain": [
        "30255",
        "30249",
        "20468",
        "11419",
        "11339",
        "11419"
      ]
    },
    {
      "hadith_no": "861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباد بن موسى الختلي، حدثنا إسماعيل، - يعني ابن جعفر - أخبرني يحيى بن علي بن يحيى بن خلاد بن رافع الزرقي، عن أبيه، عن جده، عن رفاعة بن رافع، أن رسول الله صلى الله عليه وسلم فقص هذا الحديث قال فيه ‏\"‏ فتوضأ كما أمرك الله جل وعز ثم تشهد فأقم ثم كبر فإن كان معك قرآن فاقرأ به وإلا فاحمد الله وكبره وهلله ‏\"‏ ‏.‏ وقال فيه ‏\"‏ وإن انتقصت منه شيئا انتقصت من صلاتك ‏\"‏ ‏.‏",
      "text_en": " Rifa’ah b. Rafi has also narrated this tradition through a different chain from the Messenger of Allah(ﷺ). This version goes:                      Then perform ablution in a way Allah, the exalted, has command you, then say the shahadah and get up and say the takbir. Then if you know any of the Qur’an, recite it; otherwise say: “Praise be to Allah”; “Allah is most great”; “ There is no god but Allah” He ( the narrator) also said in this version: If some defect remains in this, that detect will remain in your prayer.",
      "chain": [
        "30255",
        "20155",
        "29225",
        "323"
      ]
    },
    {
      "hadith_no": "1396",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا عباد بن موسى، أخبرنا إسماعيل بن جعفر، عن إسرائيل، عن أبي إسحاق، عن علقمة، والأسود، قالا أتى ابن مسعود رجل فقال إني أقرأ المفصل في ركعة ‏.‏ فقال أهذا كهذ الشعر ونثرا كنثر الدقل لكن النبي صلى الله عليه وسلم كان يقرأ النظائر السورتين في ركعة الرحمن والنجم في ركعة واقتربت والحاقة في ركعة والطور والذاريات في ركعة وإذا وقعت ون في ركعة وسأل سائل والنازعات في ركعة وويل للمطففين وعبس في ركعة والمدثر والمزمل في ركعة وهل أتى ولا أقسم بيوم القيامة في ركعة ‏.‏ وعم يتساءلون والمرسلات في ركعة والدخان وإذا الشمس كورت في ركعة ‏.‏ قال أبو داود هذا تأليف ابن مسعود رحمه الله ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     Alqamah and al-Aswad said: A man came to Ibn Mas'ud. He said: I recite the mufassal surahs in one rak'ah. You might recite it quickly as one recites verse (poetry) quickly, or as the dried dates fall down (from the tree).  But the Prophet (ﷺ) used to recite two equal surahs in one rak'ah; he would recite (for instance) surahs an-Najm (53) and ar-Rahman (55) in one rak'ah, surahs Iqtarabat (54) and al-Haqqah (69) in one rak'ah, surahs at-Tur (52) and adh-Dhariyat (51) in one rak'ah, surahs al-Waqi'ah (56) and Nun (68) in one rak'ah, surahs al-Ma'arij (70) and  an-Nazi'at (79) in one rak'ah, surahs al-Mutaffifin (83) and Abasa (80) in one rak'ah, surahs al-Muddaththir (74) and al-Muzzammil (73) in one rak'ah, surahs al-Insan (76) and al-Qiyamah (75) in one rak'ah, surahs an-Naba' (78) and  al-Mursalat (77) in one rak'ah, and surahs ad-Dukhan (44) and at-Takwir (81) in one rak'ah.Abu Dawud said: This is the arrangement of Ibn Mas'ud himself",
      "chain": [
        "30255",
        "20155",
        "20311",
        "11049",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1634",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عباد بن موسى الأنباري الختلي، حدثنا إبراهيم، - يعني ابن سعد - قال أخبرني أبي، عن ريحان بن يزيد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ قال أبو داود رواه سفيان عن سعد بن إبراهيم كما قال إبراهيم ورواه شعبة عن سعد قال ‏\"‏ لذي مرة قوي ‏\"‏ ‏.‏ والأحاديث الأخر عن النبي صلى الله عليه وسلم بعضها ‏\"‏ لذي مرة قوي ‏\"‏ ‏.‏ وبعضها ‏\"‏ لذي مرة سوي ‏\"‏ ‏.‏ وقال عطاء بن زهير إنه لقي عبد الله بن عمرو فقال إن الصدقة لا تحل لقوي ولا لذي مرة سوي ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr :                     The Prophet (ﷺ) said: Sadaqah may not be given to a rich man or to one who has strength and is sound in limbs.Abu Dawud said: This tradition has been transmitted by Sufyan from Sa'd bin Ibrahim like the tradition narrated by Ibrahim. The version of Shu'bah from Sa'd has: \"for a man who has strength and is robust.\" The other version of this tradition from the Prophet (ﷺ) have the words \"for a man who has strength and is robust.\" Others have \"for a man who has strength and is sound in limbs.\" 'Ata bin Zuhair said that he had met 'Abd Allah bin 'Amr who said: \"Sadaqah is not lawful for a strong man nor for a man who has strength and is sound in limbs.\"",
      "chain": [
        "30255",
        "20150",
        "11063",
        "29"
      ]
    },
    {
      "hadith_no": "2280",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عباد بن موسى، أن إسماعيل بن جعفر، حدثهم عن إسرائيل، عن أبي إسحاق، عن هانئ، وهبيرة، عن علي، قال لما خرجنا من مكة تبعتنا بنت حمزة تنادي يا عم يا عم ‏.‏ فتناولها علي فأخذ بيدها وقال دونك بنت عمك ‏.‏ فحملتها فقص الخبر قال وقال جعفر ابنة عمي وخالتها تحتي ‏.‏ فقضى بها النبي صلى الله عليه وسلم لخالتها وقال ‏\"‏ الخالة بمنزلة الأم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When we came out from Mecca, Hamzah's daughter pursued us crying: My uncle. Ali lifted her and took her by the hand. (Addressing Fatimah he said:) Take your uncle's daughter. She then lifted her. The narrator then transmitted the rest of the tradition. Ja'far said: She is my uncle's daughter. Her maternal aunt is my wife. The Prophet (ﷺ) decided in favour of her maternal aunt, and said: The maternal aunt is like mother.",
      "chain": [
        "30255",
        "20155",
        "20311",
        "11049",
        "5"
      ]
    },
    {
      "hadith_no": "3205",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عباد بن موسى، حدثنا إسماعيل، - يعني ابن جعفر - عن إسرائيل، عن أبي إسحاق، عن أبي بردة، عن أبيه، قال أمرنا رسول الله صلى الله عليه وسلم أن ننطلق إلى أرض النجاشي فذكر حديثه قال النجاشي أشهد أنه رسول الله صلى الله عليه وسلم وأنه الذي بشر به عيسى ابن مريم ولولا ما أنا فيه من الملك لأتيته حتى أحمل نعليه ‏.‏",
      "text_en": " Narrated Abu Burdah:                     On the authority of his father: The Messenger of Allah (ﷺ) commanded us to proceed to the land of Negus. Mentioning the rest of the tradition he said that Negus said: I bear witness that he is the Messenger of Allah (ﷺ), and it is he about whom Christ son of Mary gave good news. It I were not in the land which I am, I would come to him and carry his shoes.",
      "chain": [
        "30255",
        "20155",
        "20311",
        "11049",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3670",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عباد بن موسى الختلي، أخبرنا إسماعيل، - يعني ابن جعفر - عن إسرائيل، عن أبي إسحاق، عن عمرو، عن عمر بن الخطاب، قال لما نزل تحريم الخمر قال عمر اللهم بين لنا في الخمر بيانا شفاء فنزلت الآية التي في البقرة ‏{‏ يسألونك عن الخمر والميسر قل فيهما إثم كبير ‏}‏ الآية قال فدعي عمر فقرئت عليه قال اللهم بين لنا في الخمر بيانا شفاء فنزلت الآية التي في النساء ‏{‏ يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ‏}‏ فكان منادي رسول الله صلى الله عليه وسلم إذا أقيمت الصلاة ينادي ألا لا يقربن الصلاة سكران فدعي عمر فقرئت عليه فقال اللهم بين لنا في الخمر بيانا شفاء فنزلت هذه الآية ‏{‏ فهل أنتم منتهون ‏}‏ قال عمر انتهينا ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     When the prohibition of wine (was yet to be) declared, Umar said: O Allah, give us a satisfactory explanation about wine.  So the following verse of Surat al-Baqarah revealed; \"They ask thee concerning wine and gambling. Say: In them is great sin....\" Umar was then called and it was recited to him.  He said: O Allah, give us a satisfactory explanation about wine.  Then the following verse of Surat an-Nisa' was revealed: \"O ye who believe! approach not prayers with a mind befogged....\" Thereafter the herald of the Messenger of Allah (ﷺ) would call when the (congregational) prayer was performed: Beware, one who is drunk should not come to prayer. Umar was again called and it was recited to him).  He said: O Allah, give us a satisfactory explanation about wine. This verse was revealed: \"Will ye not then abstain?\"  Umar said: We abstained.",
      "chain": [
        "30255",
        "20155",
        "20311",
        "11049",
        "11081",
        "3"
      ]
    },
    {
      "hadith_no": "4361",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عباد بن موسى الختلي، أخبرنا إسماعيل بن جعفر المدني، عن إسرائيل، عن عثمان الشحام، عن عكرمة، قال حدثنا ابن عباس، أن أعمى، كانت له أم ولد تشتم النبي صلى الله عليه وسلم وتقع فيه فينهاها فلا تنتهي ويزجرها فلا تنزجر - قال - فلما كانت ذات ليلة جعلت تقع في النبي صلى الله عليه وسلم وتشتمه فأخذ المغول فوضعه في بطنها واتكأ عليها فقتلها فوقع بين رجليها طفل فلطخت ما هناك بالدم فلما أصبح ذكر ذلك لرسول الله صلى الله عليه وسلم فجمع الناس فقال ‏\"‏ أنشد الله رجلا فعل ما فعل لي عليه حق إلا قام ‏\"‏ ‏.‏ فقام الأعمى يتخطى الناس وهو يتزلزل حتى قعد بين يدى النبي صلى الله عليه وسلم فقال يا رسول الله أنا صاحبها كانت تشتمك وتقع فيك فأنهاها فلا تنتهي وأزجرها فلا تنزجر ولي منها ابنان مثل اللؤلؤتين وكانت بي رفيقة فلما كانت البارحة جعلت تشتمك وتقع فيك فأخذت المغول فوضعته في بطنها واتكأت عليها حتى قتلتها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا اشهدوا أن دمها هدر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     A blind man had a slave-mother who used to abuse the Prophet (ﷺ) and disparage him. He forbade her but she did not stop. He rebuked her but she did not give up her habit. One night she began to slander the Prophet (ﷺ) and abuse him. So he took a dagger, placed it on her belly, pressed it, and killed her. A child who came between her legs was smeared with the blood that was there. When the morning came, the Prophet (ﷺ) was informed about it.  He assembled the people and said: I adjure by Allah the man who has done this action and I adjure him by my right to him that he should stand up. Jumping over the necks of the people and trembling the man stood up.  He sat before the Prophet (ﷺ) and said: Messenger of Allah! I am her master; she used to abuse you and disparage you. I forbade her, but she did not stop, and I rebuked her, but she did not abandon her habit. I have two sons like pearls from her, and she was my companion. Last night she began to abuse and disparage you. So I took a dagger, put it on her belly and pressed it till I killed her.  Thereupon the Prophet (ﷺ) said: Oh be witness, no retaliation is payable for her blood.",
      "chain": [
        "30255",
        "20155",
        "20311",
        "10703",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5141",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، وقال، أخبرنا ح، وحدثنا عباد بن موسى، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر أن يلعن الرجل والديه ‏\"‏ ‏.‏ قيل يا رسول الله كيف يلعن الرجل والديه قال ‏\"‏ يلعن أبا الرجل فيلعن أباه ويلعن أمه فيلعن أمه ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr (b. al-As) reported the Messenger of Allah (May peace be upon him) as saying:                      A man’s reviling of his parents is one of the grave sins. He was asked : Messenger of Allah! How does a man revile his parents? He replied: He reviles the father of a man who then reviles his father, and he reviles a man’s mother and he reviles his.",
      "chain": [
        "20173",
        "30255",
        "20150",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا عباد بن موسى، قال حدثنا إسماعيل بن جعفر، قال حدثني إسرائيل، عن عثمان الشحام، قال كنت أقود رجلا أعمى فانتهيت إلى عكرمة فأنشأ يحدثنا قال حدثني ابن عباس أن أعمى كان على عهد رسول الله صلى الله عليه وسلم وكانت له أم ولد وكان له منها ابنان وكانت تكثر الوقيعة برسول الله صلى الله عليه وسلم وتسبه فيزجرها فلا تنزجر وينهاها فلا تنتهي فلما كان ذات ليلة ذكرت النبي صلى الله عليه وسلم فوقعت فيه فلم أصبر أن قمت إلى المغول فوضعته في بطنها فاتكأت عليه فقتلتها فأصبحت قتيلا فذكر ذلك للنبي صلى الله عليه وسلم فجمع الناس وقال ‏\"‏ أنشد الله رجلا لي عليه حق فعل ما فعل إلا قام ‏\"‏ ‏.‏ فأقبل الأعمى يتدلدل فقال يا رسول الله أنا صاحبها كانت أم ولدي وكانت بي لطيفة رفيقة ولي منها ابنان مثل اللؤلؤتين ولكنها كانت تكثر الوقيعة فيك وتشتمك فأنهاها فلا تنتهي وأزجرها فلا تنزجر فلما كانت البارحة ذكرتك فوقعت فيك فقمت إلى المغول فوضعته في بطنها فاتكأت عليها حتى قتلتها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا اشهدوا أن دمها هدر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas narrated that :                     There was a blind man during the time of the Messenger of Allah [SAW] who had an Umm Walad by whom he had two sons. She used to slander and defame the Messenger of Allah [SAW] a great deal, and he would rebuke her, but she would not pay heed, and he would forbid her to do that, but she ignored him. (The blind man said) One night I mentioned the Prophet [SAW], and she slandered him. I could not bear it so I went and got a dagger which I thrust into her stomach and leaned upon it, and killed her. In the morning she was found slain. Mention of that was made to the Prophet [SAW] and he gathered the people and said: \"I adjure by Allah; a man over whom I have the right, that he should obey me, and he did what he did, to stand up.\" The blind man started to tremble and said: \"O Messenger of Allah [SAW], I am the one who killed her. She was my Umm Walad and she was kind and gentle toward me, and I have two sons like pearls from her, but she used to slander and defame you a great deal. I forbade her, but she did not stop, and I rebuked her, but she did not pay heed. Finally, I mentioned your name and she slandered you, so I went and got a dagger which I thrust into her stomach, and leaned on it until I killed her. The Messenger of Allah [SAW] said: \"I bear witness that her blood is permissible.\"",
      "chain": [
        "11524",
        "30255",
        "20155",
        "20311",
        "10703",
        "17"
      ]
    },
    {
      "hadith_no": "5197",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا عباد بن موسى، قال حدثنا طلحة بن يحيى، قال أخبرني يونس بن يزيد، عن ابن شهاب، عن أنس بن مالك، قال كان لرسول الله صلى الله عليه وسلم خاتم فضة يتختم به في يمينه فصه حبشي يجعل فصه مما يلي كفه ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah [SAW] had a ring of silver which he wore on his right hand. It had an Ethiopian stone (Fass), and he used to wear the stone (Fass) next to his palm.\"",
      "chain": [
        "30255",
        "11863",
        "20475",
        "11013",
        "19"
      ]
    }
  ],
  "total_hadiths": 16
}