{
  "id": "30252",
  "name": "Sa'id bin Sulaiman al-Dabi سعيد بن سليمان - سعدويه الضبي",
  "full_name": "Sa'id bin Sulaiman al-Dabi سعيد بن سليمان  - سعدويه الضبي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "225",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Wasti",
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20235",
      "name": "Sulaiman bin Khatir al-'Abdi سليمان بن كثير العبدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20236",
      "name": "Sulaiman bin al-Mughira al-Qaysy سليمان بن المغيرة القيسي مولاهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20437",
      "name": "'Abd Rabah bin Nafi',Abu Shahab al-Hanat عبد ربه بن نافع أبو شهاب الحناط",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20674",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم بن سوسن الطائفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20594",
      "name": "'Ali bin Hashim bin al-Burayd علي بن هاشم بن البريد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "15551",
      "name": "Mnswr bin Abi al-Aswad منصور بن أبي الأسود الليثي الكوفي يقال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20118",
      "name": "Yunus bin Bukayr al-Shaybani يونس بن بكير بن واصل الشيباني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30514",
      "name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30274",
      "name": "Muhammad bin Abi Ghalb محمد بن أبي غالب القومسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "38392",
      "name": "'Ali bin al-Hasan al-Hrthmy علي بن الحسن الهرثمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-171",
      "hadith_no": "171",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال أخبرنا سعيد بن سليمان، قال حدثنا عباد، عن ابن عون، عن ابن سيرين، عن أنس، أن رسول الله صلى الله عليه وسلم لما حلق رأسه كان أبو طلحة أول من أخذ من شعره‏.‏",
      "text_en": " Narrated Anas:                     When Allah's Apostle got his head shaved, Abu- Talha was the first to take some of his hair.",
      "usc_msa_ref": "172",
      "chain": [
        "30272",
        "30252",
        "20431",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-953",
      "hadith_no": "953",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، قال حدثنا هشيم، قال أخبرنا عبيد الله بن أبي بكر بن أنس، عن أنس، قال كان رسول الله صلى الله عليه وسلم لا يغدو يوم الفطر حتى يأكل تمرات‏.‏ وقال مرجى بن رجاء حدثني عبيد الله قال حدثني أنس عن النبي صلى الله عليه وسلم ويأكلهن وترا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some dates. Anas also narrated: The Prophet used to eat odd number of dates.",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1345",
      "hadith_no": "1345",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن سليمان، حدثنا الليث، حدثنا ابن شهاب، عن عبد الرحمن بن كعب، أن جابر بن عبد الله  رضى الله عنهما  أخبره أن النبي صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet buried every two martyrs in of Uhud in one grave.",
      "usc_msa_ref": "429",
      "chain": [
        "30252",
        "20023",
        "11013",
        "1134",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-2684",
      "hadith_no": "2684",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا سعيد بن سليمان، حدثنا مروان بن شجاع، عن سالم الأفطس، عن سعيد بن جبير، قال سألني يهودي من أهل الحيرة أى الأجلين قضى موسى قلت لا أدري حتى أقدم على حبر العرب فأسأله‏.‏ فقدمت، فسألت ابن عباس فقال قضى أكثرهما وأطيبهما، إن رسول الله صلى الله عليه وسلم إذا قال فعل‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     A Jew from Hira asked me which one of the two periods Musa (i.e. Prophet Moses) completed. I said, \"I don't know, (but wait) till I see the most learned 'Arab and inquire him about it.\" So, I went to Ibn `Abbas and asked him. He replied, \"Moses completed the longer and better period.\" Ibn `Abbas added, \"No doubt, an apostle of Allah always does what he says.\"",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "30252",
        "20388",
        "11691",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-4269",
      "hadith_no": "4269",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن سليمان، حدثنا عباد، عن الشيباني، قال سمعت ابن أبي أوفى  رضى الله عنهما  أصابتنا مجاعة يوم خيبر، فإن القدور لتغلي  قال وبعضها نضجت  فجاء منادي النبي صلى الله عليه وسلم لا تأكلوا من لحوم الحمر شيئا وأهريقوها‏.‏ قال ابن أبي أوفى فتحدثنا أنه إنما نهى عنها لأنها لم تخمس‏.‏ وقال بعضهم نهى عنها البتة، لأنها كانت تأكل العذرة‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     We where afflicted with severe hunger on the day of Khaibar. While the cooking pots were boiling and some of the food was well-cooked, the announcer of the Prophet came to say, \"Do not eat anything the donkey-meat and upset the cooking pots.\" We then thought that the Prophet had prohibited such food because the Khumus had not been taken out of it. Some others said, \"He prohibited the meat of donkeys from the point of view of principle, because donkeys used to eat dirty things.\"",
      "usc_msa_ref": "531",
      "chain": [
        "30252",
        "20431",
        "11352",
        "5115"
      ]
    },
    {
      "id": "sahih-bukhari-4690",
      "hadith_no": "4690",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، أخبرنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، قال قلت لابن عباس  رضى الله عنهما  سورة الأنفال قال نزلت في بدر‏.‏ الشوكة الحد ‏{‏مردفين‏}‏ فوجا بعد فوج، ردفني وأردفني جاء بعدي ‏{‏ذوقوا‏}‏ باشروا وجربوا وليس هذا من ذوق الفم ‏{‏فيركمه‏}‏ يجمعه‏.‏ ‏{‏شرد‏}‏ فرق ‏{‏وإن جنحوا‏}‏ طلبوا ‏{‏يثخن‏}‏ يغلب‏.‏ وقال مجاهد ‏{‏مكاء‏}‏ إدخال أصابعهم في أفواههم و‏{‏تصدية‏}‏ الصفير ‏{‏ليثبتوك‏}‏ ليحبسوك‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-4931",
      "hadith_no": "4931",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، قال قلت لابن عباس سورة التوبة قال التوبة هي الفاضحة، ما زالت تنزل ومنهم ومنهم، حتى ظنوا أنها لم تبق أحدا منهم إلا ذكر فيها‏.‏ قال قلت سورة الأنفال‏.‏ قال نزلت في بدر‏.‏ قال قلت سورة الحشر‏.‏ قال نزلت في بني النضير‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I asked Ibn `Abbas about Surat Al-Tauba, and he said, \"Surat Al-Tauba? It is exposure (of all the evils of the infidels and the hypocrites). And it continued revealing (that the oft-repeated expression): '...and of them ...and of them.' till they started thinking that none would be left unmentioned therein.\" I said, \"What about) Surat Al-Anfal?\" He replied, \"Surat Al-Anfal was revealed in connection with the Badr Battle.\" I said, \"(What about) Surat Al-Hashr?\" He replied, \"It was revealed in connection with Bani an-Nadir.\"",
      "usc_msa_ref": "404",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-6875",
      "hadith_no": "6875",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا سعيد بن سليمان، حدثنا الليث، عن ابن شهاب، عن عروة، عن عائشة  رضى الله عنها أن قريشا، أهمتهم المرأة المخزومية التي سرقت فقالوا من يكلم رسول الله صلى الله عليه وسلم ومن يجترئ عليه إلا أسامة حب رسول الله صلى الله عليه وسلم‏.‏ فكلم رسول الله صلى الله عليه وسلم فقال ‏\"‏ أتشفع في حد من حدود الله ‏\"‏‏.‏ ثم قام فخطب قال ‏\"‏ يا أيها الناس إنما ضل من قبلكم أنهم كانوا إذا سرق الشريف تركوه، وإذا سرق الضعيف فيهم أقاموا عليه الحد، وايم الله لو أن فاطمة بنت محمد سرقت لقطع محمد يدها ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Quraish people became very worried about the Makhzumiya lady who had committed theft. They said, \"Nobody can speak (in favor of the lady) to Allah's Apostle and nobody dares do that except Usama who is the favorite of Allah's Apostle. \" When Usama spoke to Allah's Apostle about that matter, Allah's Apostle said, \"Do you intercede (with me) to violate one of the legal punishment of Allah?\" Then he got up and addressed the people, saying, \"O people! The nations before you went astray because if a noble person committed theft, they used to leave him, but if a weak person among them committed theft, they used to inflict the legal punishment on him. By Allah, if Fatima, the daughter of Muhammad committed theft, Muhammad will cut off her hand.!\"",
      "usc_msa_ref": "779",
      "chain": [
        "30252",
        "20023",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-7028",
      "hadith_no": "7028",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا سعيد بن سليمان، حدثنا عباد، عن إسماعيل، سمعت قيسا، سمعت سعيد بن زيد، يقول لقد رأيتني وإن عمر موثقي على الإسلام، ولو انقض أحد مما فعلتم بعثمان كان محقوقا أن ينقض‏.‏",
      "text_en": " Narrated Qais:                     I heard Sa`id bin Zaid saying, \"I have seen myself tied and forced by `Umar to leave Islam (Before `Umar himself embraced Islam). And if the mountain of Uhud were to collapse for the evil which you people had done to `Uthman, then Uhud would have the right to do so.\" (See Hadith No. 202, Vol. 5)",
      "usc_msa_ref": "75",
      "chain": [
        "30252",
        "20431",
        "11418",
        "11046",
        "11"
      ]
    },
    {
      "id": "sahih-bukhari-7038",
      "hadith_no": "7038",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏ فقال رجل يا رسول الله أنصره إذا كان مظلوما، أفرأيت إذا كان ظالما كيف أنصره قال ‏\"‏ تحجزه أو تمنعه من الظلم، فإن ذلك نصره ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"Help your brother whether he is an oppressor or an oppressed,\" A man said, \"O Allah's Apostle! I will help him if he is oppressed, but if he is an oppressor, how shall I help him?\" The Prophet said, \"By preventing him from oppressing (others), for that is how to help him.\"",
      "usc_msa_ref": "84",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-7480",
      "hadith_no": "7480",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني سعيد بن سليمان، عن ابن المبارك، عن موسى بن عقبة، عن سالم، عن عبد الله، قال أكثر ما كان النبي صلى الله عليه وسلم يحلف ‏\"‏ لا ومقلب القلوب ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet frequently used to swear, \"No, by the One Who turns the hearts.\"",
      "usc_msa_ref": "488",
      "chain": [
        "30252",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4482",
      "hadith_no": "4482",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا إسماعيل، بن سالم عن علقمة بن وائل، عن أبيه، قال أتي رسول الله صلى الله عليه وسلم برجل قتل رجلا فأقاد ولي المقتول منه فانطلق به وفي عنقه نسعة يجرها فلما أدبر قال رسول الله صلى الله عليه وسلم ‏\"‏ القاتل والمقتول في النار ‏\"‏ ‏.‏ فأتى رجل الرجل فقال له مقالة رسول الله صلى الله عليه وسلم فخلى عنه ‏.‏ قال إسماعيل بن سالم فذكرت ذلك لحبيب بن أبي ثابت فقال حدثني ابن أشوع أن النبي صلى الله عليه وسلم إنما سأله أن يعفو عنه فأبى ‏.‏",
      "text_en": " 'Alaqama b. Wa'il reported on the authority of his father that a person was brought to the Messenger of Allah (may peace be upon him) who had killed another person, and the heir of the person slain had dragged him (to the Holy Prophet) with a strap around his neck. As he turned away Allah's Messenger (may peace be upon him) said:                      The killer and the killed are (doomed) to fire. A person came to the other person (the heir of the deceased) and he reported to him the words of the Messenger of Allah (may peace be upon him), and so he let him off. Isma'il b. Salim said: I made a mention of it to Habib b. Abu Thabit and he said: Ibn Ashwa' reported to me that Allah's Apostle (may peace be upon him) had asked him to pardon him, but he refused.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30252",
        "20468",
        "30415",
        "10801"
      ]
    },
    {
      "id": "sunan-abi-daud-1282",
      "hadith_no": "1282",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الرحيم البزاز، أخبرنا سعيد بن سليمان، حدثنا منصور بن أبي الأسود، عن المختار بن فلفل، عن أنس بن مالك، قال صليت الركعتين قبل المغرب على عهد رسول الله صلى الله عليه وسلم ‏.‏ قال قلت لأنس أرآكم رسول الله صلى الله عليه وسلم قال نعم رآنا فلم يأمرنا ولم ينهنا ‏.‏",
      "text_en": " Narrated Anas b. Malik :                     I offered two rak'ahs of prayer before the Maghrib prayer (i.e. obligatory) during the time of the Messenger of Allah (ﷺ). I (narrator al-Mukhtar b. Fulful) asked Anas: Did the Messenger of Allah (ﷺ) se you ? He replied: Yes, but he neither commanded us nor forbade us (to do so).",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "30252",
        "15551",
        "10962",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-1607",
      "hadith_no": "1607",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا سعيد بن سليمان، حدثنا عباد، عن سفيان بن حسين، عن الزهري، عن أبي أمامة بن سهل، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن الجعرور ولون الحبيق أن يؤخذا في الصدقة ‏.‏ قال الزهري لونين من تمر المدينة ‏.‏ قال أبو داود وأسنده أيضا أبو الوليد عن سليمان بن كثير عن الزهري ‏.‏",
      "text_en": " Abu Umamah bin Sahl reported on the authority of his father:                      The Messenger of Allah (ﷺ) prohibited to accept ja'rur and habiq dates as zakat. Az-Zuhri said: These are two kinds of the dates of Medina.Abu Dawud said: This has also been transmited by Abu al-Walid from Sulaiman bin Kathir from Az-Zuhri.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30252",
        "20431",
        "20655",
        "11013",
        "405",
        "403"
      ]
    },
    {
      "id": "sunan-abi-daud-2338",
      "hadith_no": "2338",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الرحيم أبو يحيى البزاز، حدثنا سعيد بن سليمان، حدثنا عباد، عن أبي مالك الأشجعي، حدثنا حسين بن الحارث الجدلي، - من جديلة قيس أن أمير مكة خطب ثم قال عهد إلينا رسول الله صلى الله عليه وسلم أن ننسك للرؤية فإن لم نره وشهد شاهدا عدل نسكنا بشهادتهما فسألت الحسين بن الحارث من أمير مكة قال لا أدري ‏.‏ ثم لقيني بعد فقال هو الحارث بن حاطب أخو محمد بن حاطب ثم قال الأمير إن فيكم من هو أعلم بالله ورسوله مني وشهد هذا من رسول الله صلى الله عليه وسلم ‏.‏ وأومأ بيده إلى رجل قال الحسين فقلت لشيخ إلى جنبي من هذا الذي أومأ إليه الأمير قال هذا عبد الله بن عمر ‏.‏ وصدق كان أعلم بالله منه فقال بذلك أمرنا رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Husayn ibn al-Harith al-Jadli from the tribe of Jadilah Qays said: The governor of Mecca delivered a speech and said: The Messenger of Allah (ﷺ) took a pledge from us that we should perform the rites of hajj after sighting the moon. If we do not sight it and two reliable persons bear witness, we should perform the rites of hajj on the basis of their witness.  I then asked al-Husayn ibn al-Harith: Who was the governor of Mecca?  He replied: I do not know. He then met me later on and told me: He was al-Harith ibn Hatib, brother of Muhammad ibn Hatib. The governor then said: There is among you a man who is more acquainted with Allah and His Apostle than I. He witnessed this from the Messenger of Allah (ﷺ). He then pointed with his hand to a man. Al-Husayn said: I asked an old man beside me: Who is that man to whom the governor has alluded?  He said: \"This is Abdullah ibn Umar, and he spoke the truth. He was more acquainted with Allah than he. He (Abdullah ibn Umar) said: For this is what the Messenger of Allah (ﷺ) commanded us (to do).",
      "usc_msa_ref": "",
      "chain": [
        "30252",
        "20431",
        "10766"
      ]
    },
    {
      "id": "sunan-abi-daud-4509",
      "hadith_no": "4509",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا داود بن رشيد، حدثنا عباد بن العوام، ح وحدثنا هارون بن عبد الله، حدثنا سعيد بن سليمان، حدثنا عباد، عن سفيان بن حسين، عن الزهري، عن سعيد، وأبي، سلمة - قال هارون - عن أبي هريرة، أن امرأة، من اليهود أهدت إلى النبي صلى الله عليه وسلم شاة مسمومة - قال - فما عرض لها النبي صلى الله عليه وسلم ‏.‏ قال أبو داود هذه أخت مرحب اليهودية التي سمت النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A Jewess presented a poisoned sheep to the Prophet (ﷺ), but the Prophet (ﷺ) did not interfere with he.Abu Dawud said: The Jewess who poisoned the Prophet (ﷺ) was sister of Marhab.",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "20431",
        "30524",
        "30252",
        "20431",
        "20655",
        "11013",
        "11168",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4540",
      "hadith_no": "4540",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن أبي غالب، حدثنا سعيد بن سليمان، عن سليمان بن كثير، حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم فذكر معنى حديث سفيان ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) as saying: He then mentioned the rest of the tradition to the same effect as mentioned by Sufyan.",
      "usc_msa_ref": "",
      "chain": [
        "30274",
        "30252",
        "20235",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4591",
      "hadith_no": "4591",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "قال أبو داود حدثت عن سعيد بن سليمان، عن سليمان بن كثير، حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل في عميا أو رميا يكون بينهم بحجر أو بسوط فعقله عقل خطإ ومن قتل عمدا فقود يديه فمن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone is killed blindly or, when people are throwing stones, by a stone or a whip, his blood-wit is the blood-wit for an accidental murder. But if anyone is killed intentionally, retaliation is due. If anyone tries to prevent it, the curse of Allah, of angels, and of all the people will rest on him.",
      "usc_msa_ref": "",
      "chain": [
        "30252",
        "20235",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-5260",
      "hadith_no": "5260",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سعيد بن سليمان، عن علي بن هاشم، حدثنا ابن أبي ليلى، عن ثابت البناني، عن عبد الرحمن بن أبي ليلى، عن أبيه، أن رسول الله صلى الله عليه وسلم سئل عن حيات البيوت فقال ‏\"‏ إذا رأيتم منهن شيئا في مساكنكم فقولوا أنشدكن العهد الذي أخذ عليكن نوح أنشدكن العهد الذي أخذ عليكن سليمان أن لا تؤذونا فإن عدن فاقتلوهن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman Ibn AbuLayla:                     The Messenger of Allah (ﷺ) was asked about the house-snakes. He said: When you see one of them in your dwelling, say: I adjure you by the covenant which Noah made with you, and I adjure you by the covenant which Solomon made with you not to harm us. Then if they come back, kill them.",
      "usc_msa_ref": "",
      "chain": [
        "30252",
        "20594",
        "20727",
        "11269",
        "11196",
        "1937"
      ]
    },
    {
      "id": "jami-al-tirmidhi-145",
      "hadith_no": "145",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن سليمان، حدثنا هشيم، عن محمد بن خالد القرشي، عن داود بن حصين، عن عكرمة، عن ابن عباس، أنه سئل عن التيمم، فقال إن الله قال في كتابه حين ذكر الوضوء‏:‏ ‏(‏فاغسلوا وجوهكم وأيديكم إلى المرافق‏)‏، وقال في التيمم‏:‏ ‏(‏فامسحوا بوجوهكم وأيديكم‏)‏ وقال‏:‏ ‏(‏والسارق والسارقة فاقطعوا أيديهما‏)‏ فكانت السنة في القطع الكفين، إنما هو الوجه والكفان، يعني التيمم‏\"‏‏.‏",
      "text_en": " Ikrimah narrated that :                     Ibn Abbas was asked ahout Tayammum. He said: \"When Allah mentioned Wudu in His Book, He said: \"So wash your faces and your hands (forearms) up to the elbows.\" And He said about Tayammum: \"And rub therewith your faces and hands\" And He said: \"And the male thief and the female thief; cut off their hands.\" So the Sunnah for cutting is the two hands. So it is only the face and the hands, meaning, Tayammum.\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30252",
        "20468",
        "38496",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3371",
      "hadith_no": "3371",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا سعيد بن سليمان، حدثنا عباد بن العوام، حدثنا سفيان بن حسين، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال بعث النبي صلى الله عليه وسلم أبا بكر وأمره أن ينادي بهؤلاء الكلمات ثم أتبعه عليا فبينا أبو بكر في بعض الطريق إذ سمع رغاء ناقة رسول الله صلى الله عليه وسلم القصواء فخرج أبو بكر فزعا فظن أنه رسول الله صلى الله عليه وسلم فإذا هو علي فدفع إليه كتاب رسول الله صلى الله عليه وسلم وأمر عليا أن ينادي بهؤلاء الكلمات فانطلقا فحجا فقام علي أيام التشريق فنادى ذمة الله ورسوله بريئة من كل مشرك فسيحوا في الأرض أربعة أشهر ولا يحجن بعد العام مشرك ولا يطوفن بالبيت عريان ولا يدخل الجنة إلا مؤمن وكان علي ينادي فإذا عيي قام أبو بكر فنادى بها ‏.‏ قال أبو عيسى وهذا حديث حسن غريب من هذا الوجه من حديث ابن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) dispatched Abu Bakr ordering him to announce these statements. Then 'Ali followed him. When Abu Bakr was at a particular road, he heard the heavy breathing of Al-Qiswa, the she camel of the Messenger of Allah (ﷺ), so Abu Bakr appeared frightened because he thought that it was the Messenger of Allah (ﷺ). When he saw that it was 'Ali, he gave him the letter of the Messenger of Allah (ﷺ), and told 'Ali to announce the statements. So he left to perform Hajj. During the day of At-Tashriq 'Ali stood to announce: 'The protection of Allah and His Messenger is removed from every idolater. So travel in the land for four months. There is to be no idolater performing Hajj after this year, nor may anyone perform Tawaf around the House while naked. None shall enter Paradise but a believer.' 'Ali was making the announcement, so when he became exhausted Abu Bakr would announce it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "30252",
        "20431",
        "20655",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1854",
      "hadith_no": "1854",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا سعيد بن سليمان، قال أنبأنا هشيم، قال أنبأنا منصور، - هو ابن زاذان - عن الحسن، عن عمران بن حصين، قال الميت يعذب بنياحة أهله عليه ‏.‏ فقال له رجل أرأيت رجلا مات بخراسان وناح أهله عليه ها هنا أكان يعذب بنياحة أهله قال صدق رسول الله صلى الله عليه وسلم وكذبت أنت ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain said:                     \"The deceased is punished due to his family's wailing for him.\" A man said to him: \"A man died in Khurasan and his family wailed for him here; will he be punished due to his family's wailing?\" He said: \"The Messenger of Allah spoke the truth and you are a liar.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30252",
        "20468",
        "11444",
        "11016",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-2414",
      "hadith_no": "2414",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الحسن بن محمد الزعفراني، قال حدثنا سعيد بن سليمان، عن شريك، عن الحر بن صياح، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يصوم ثلاثة أيام من كل شهر يوم الاثنين من أول الشهر والخميس الذي يليه ثم الخميس الذي يليه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah used to fast three days of each month: Monday at the beginning of the month, the following Thursday, then the Thursday after that.",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "30252",
        "20587",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4612",
      "hadith_no": "4612",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا سعيد بن سليمان، عن عباد بن العوام، عن سعيد بن أبي عروبة، عن أبي رجاء، - قال عثمان هو محمد بن سيف - عن مطر الوراق، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس على رجل بيع فيما لا يملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said: 'No man is bound by a transaction involving the sale of something that he does not possess.'''",
      "usc_msa_ref": "",
      "chain": [
        "11524",
        "30252",
        "20431",
        "11073",
        "11440",
        "10719",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4789",
      "hadith_no": "4789",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا سعيد بن سليمان، قال أنبأنا سليمان بن كثير، قال حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل في عميا أو رميا تكون بينهم بحجر أو سوط أو بعصا فعقله عقل خطإ ومن قتل عمدا فقود يده فمن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه صرف ولا عدل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'Whoever is killed in the blind or by something thrown, while between them is a rock, a wipe, or a stick, then the blood money of be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels, and all the people, and neither Sarf nor Adl will be accepted from him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "30252",
        "20235",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5064",
      "hadith_no": "5064",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا سعيد بن سليمان، قال حدثنا أبو شهاب، قال حدثنا الأعمش، عن أبي وائل، قال خطبنا ابن مسعود فقال كيف تأمروني أقرأ على قراءة زيد بن ثابت بعد ما قرأت من في رسول الله صلى الله عليه وسلم بضعا وسبعين سورة وإن زيدا مع الغلمان له ذؤابتان ‏.‏",
      "text_en": " It was narrated that Abu Wa'il said:                     \"Ibn Mas'ud addressed us and said: 'How do you want me to recite? According to the recitation of Zaid bin Thabit, when I learned seventy-odd Surahs from the mouth of the Messenger of Allah [SAW] while Zaid was with the other boys with two braids?'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30252",
        "11613",
        "11060",
        "11353"
      ]
    },
    {
      "id": "sunan-an-nasai-5494",
      "hadith_no": "5494",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا سعيد بن سليمان، قال حدثنا عباد، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم يتعوذ من عين الجان وعين الإنس فلما نزلت المعوذتان أخذ بهما وترك ما سوى ذلك ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah [SAW] used to seek refuge from the evil eye of the Jinn and the evil eye of humans. When Al-Mu'awwadhatan were revealed, he started to recite them and stopped reciting anything else.\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "30252",
        "20431",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-388",
      "hadith_no": "388",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن بن سلمة حدثنا أبو حاتم، حدثنا سعيد بن سليمان الواسطي، عن شريك، نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "30252",
        "20587"
      ]
    },
    {
      "id": "sunan-ibn-majah-1034",
      "hadith_no": "1034",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سعيد بن سليمان، حدثنا عبد الحميد بن سليمان، أخو فليح حدثنا أبو حازم، قال كان سهل بن سعد الساعدي يقدم فتيان قومه يصلون بهم فقيل له تفعل ولك من القدم ما لك قال إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الإمام ضامن فإن أحسن فله ولهم وإن أساء - يعني - فعليه ولا عليهم ‏\"‏ ‏.‏",
      "text_en": " Abu Hazimsaid:                      “Sahl bin Sa’d As-Sa’idi used to give preference totheyoung to lead his people in prayer. It was said to him: “Do you dothat, when you have such seniority (in Islam)?” He said: “I heardtheMessenger of Allah (ﷺ) say: ‘The Imam is responsible. If hedoeswell, then he will have the reward and so will they, but if hedoesbadly, then that will be counted against him but not againstthem.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30252",
        "11172",
        "399"
      ]
    },
    {
      "id": "sunan-ibn-majah-1920",
      "hadith_no": "1920",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا سعيد بن سليمان، حدثنا محمد بن مسلم، حدثنا إبراهيم بن ميسرة، عن طاوس، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لم نر للمتحابين مثل النكاح ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     the Messenger of Allah said: “There is nothing like marriage, for two who love one another.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30252",
        "167",
        "11240",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3640",
      "hadith_no": "3640",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سعيد بن سليمان، عن عباد، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال كان رسول الله  صلى الله عليه وسلم  يتعوذ من عين الجان وأعين الإنس فلما نزلت المعوذتان أخذهما وترك ما سوى ذلك ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)usedto seek refuge from the evil eye of the jinn and of mankind. WhentheMu’awwidhatain* were revealed, he started to recite them andstopped reciting anything else.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30252",
        "20431",
        "11286",
        "10721",
        "38"
      ]
    }
  ],
  "total_hadiths": 31
}