{
  "id": "30264",
  "name": "al-Fadl bin Sahl bin Ibrahim الفضل بن سهل بن إبراهيم الأعرج",
  "full_name": "al-Fadl bin Sahl bin Ibrahim الفضل بن سهل بن إبراهيم الأعرج",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "255",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad",
      "Khurasan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "al-Baghdadi",
      "Khurasan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20383",
      "name": "al-Hasan bin Musa al-'Ashayb الحسن بن موسى الأشيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20578",
      "name": "al-Ahwas bin Jawab الأحوص بن جواب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30283",
      "name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20440",
      "name": "'Abdur Rahman bin Ghazwan,Qard Abu Nuh عبد الرحمن بن غزوان - قراد أبو نوح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30278",
      "name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30527",
      "name": "Yahya bin Ghylan bin Abd يحيى بن غيلان بن عبد الله بن أسماء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20384",
      "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30250",
      "name": "Surayj bin al-Nu'man al-Juhari سريج بن النعمان الجوهري اللؤلؤي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20392",
      "name": "al-Walid bin Salah al-Nakhas/al-Nahas الوليد بن صالح النخاس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "694",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا الفضل بن سهل، قال حدثنا الحسن بن موسى الأشيب، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يصلون لكم، فإن أصابوا فلكم، وإن أخطئوا فلكم وعليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If the Imam leads the prayer correctly then he and you will receive the rewards but if he makes a mistake (in the prayer) then you will receive the reward for the prayer and the sin will be his.\"",
      "chain": [
        "30264",
        "20383",
        "20439",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2969",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الفضل بن سهل، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن محمد، عن أنس بن مالك  رضى الله عنه  قال فزع الناس فركب رسول الله صلى الله عليه وسلم فرسا لأبي طلحة بطيئا، ثم خرج يركض وحده، فركب الناس يركضون خلفه، فقال ‏\"‏ لم تراعوا، إنه لبحر ‏\"‏‏.‏ فما سبق بعد ذلك اليوم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the people got frightened, so Allah's Apostle rode a slow horse belonging to Abu Talha, and he set out all alone, making the horse gallop. Then the people rode, making their horses gallop after him. On his return he said, \"Don't be afraid (there is nothing to be afraid of) (and I have found) this horse a very fast one.\" That horse was never excelled in running hence forward. (Qastalani Vol. 5)",
      "chain": [
        "30264",
        "20384",
        "11272",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "4665",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الفضل بن سهل، حدثنا أبو النضر، حدثنا أبو خيثمة، حدثنا أبو الجويرية، عن ابن عباس  رضى الله عنهما  قال كان قوم يسألون رسول الله صلى الله عليه وسلم استهزاء، فيقول الرجل من أبي ويقول الرجل تضل ناقته أين ناقتي فأنزل الله فيهم هذه الآية ‏{‏يا أيها الذين آمنوا لا تسألوا عن أشياء إن تبد لكم تسؤكم‏}‏ حتى فرغ من الآية كلها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Some people were asking Allah's Apostle questions mockingly. A man would say, \"Who is my father?\" Another man whose she-camel had gone astray would say, \"Where is my she-camel? \"So Allah revealed this Verse in this connection: \"O you who believe! Ask not about things which, if made plain to you, may cause you trouble.\" (5.101)",
      "chain": [
        "30264",
        "20390",
        "20321",
        "11685",
        "17"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني الفضل بن سهل، قال سألت معلى الرازي عن محمد بن سعيد الذي، روى عنه، عباد فأخبرني عن عيسى بن يونس، قال كنت على بابه وسفيان عنده فلما خرج سألته عنه فأخبرني أنه كذاب ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "20347"
      ]
    },
    {
      "hadith_no": "46",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني الفضل بن سهل، قال حدثنا يزيد بن هارون، قال أخبرني خليفة بن موسى، قال دخلت على غالب بن عبيد الله فجعل يملي على حدثني مكحول، حدثني مكحول، فأخذه البول فقام فنظرت في الكراسة فإذا فيها حدثني أبان عن أنس وأبان عن فلان فتركته وقمت ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "20472",
        "11066",
        "20577"
      ]
    },
    {
      "hadith_no": "71",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني الفضل بن سهل، قال حدثنا عفان بن مسلم، حدثنا همام، قال قدم علينا أبو داود الأعمى فجعل يقول حدثنا البراء، قال وحدثنا زيد بن أرقم، ‏.‏ فذكرنا ذلك لقتادة فقال كذب ما سمع منهم إنما كان ذلك سائلا يتكفف الناس زمن طاعون الجارف ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "30106",
        "20297",
        "400",
        "384"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني الفضل بن سهل، قال حدثني يحيى بن معين، حدثنا حجاج، حدثنا ابن أبي ذئب، عن شرحبيل بن سعد، وكان، متهما ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "30020",
        "20219",
        "20177",
        "11101"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني الفضل بن سهل، حدثنا وليد بن صالح، قال قال عبيد الله بن عمرو قال زيد يعني ابن أبي أنيسة لا تأخذوا عن أخي، ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "20392",
        "30024",
        "11340"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع، والفضل بن سهل الأعرج، قالا حدثنا شبابة بن سوار، حدثنا عاصم، - وهو ابن محمد العمري - عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ وهو يأرز بين المسجدين كما تأرز الحية في جحرها ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Umar ('Abdullah b. 'Umar) that the Messenger of Allah (may peace be upon him) observed:                      Verily Islam started as something strange and it would again revert (to its old position) of being strange just as it started, and it would recede between the two mosques just as the serpent crawls back into its hole.",
      "chain": [
        "30375",
        "30264",
        "20426",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "4453",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني الفضل بن سهل الأعرج، حدثنا يحيى بن غيلان، حدثنا يزيد بن زريع، عن سليمان التيمي، عن أنس، قال إنما سمل النبي صلى الله عليه وسلم أعين أولئك لأنهم سملوا أعين الرعاء ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) pierced their eyes because they had pierced the eyes of the shepherds.",
      "chain": [
        "30264",
        "30527",
        "20304",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3797",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا الفضل بن سهل، حدثنا إبراهيم بن عبد الرحمن بن مهدي، حدثني بريه بن عمر بن سفينة، عن أبيه، عن جده، قال أكلت مع رسول الله صلى الله عليه وسلم لحم حبارى ‏.‏",
      "text_en": " Narrated Safinah:                     I ate the flesh of a bustard along with the Prophet (ﷺ).",
      "chain": [
        "30264",
        "34018",
        "28014",
        "18774"
      ]
    },
    {
      "hadith_no": "73",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الفضل بن سهل الأعرج البغدادي، حدثنا يحيى بن غيلان، قال حدثنا يزيد بن زريع، حدثنا سليمان التيمي، عن أنس بن مالك، قال إنما سمل النبي صلى الله عليه وسلم أعينهم لأنهم سملوا أعين الرعاة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعلم أحدا ذكره غير هذا الشيخ عن يزيد بن زريع ‏.‏ وهو معنى قوله ‏:‏ ‏(‏ والجروح قصاص ‏)‏ ‏.‏ وقد روي عن محمد بن سيرين قال إنما فعل بهم النبي صلى الله عليه وسلم هذا قبل أن تنزل الحدود ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"Allah's Messenger only poked out their eyes because they had poked out the eyes of the camel driver.\" Abu 'Eisa said: This Hadfth is Gharib. We do not know anyone who mentioned it other than this shaikh, from Yazid bin Zurai. And it is in accordance with the meaning of Allah's saying: \"And wounds equal for equal\"It has been reported that Muhammad bin Sirin said: \"The Prophet only did this to them before the legislated punishments were revealed.\"",
      "chain": [
        "30264",
        "30527",
        "20304",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "1828",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الفضل بن سهل الأعرج البغدادي، حدثنا إبراهيم بن عبد الرحمن بن مهدي، عن إبراهيم بن عمر بن سفينة، عن أبيه، عن جده، قال أكلت مع رسول الله صلى الله عليه وسلم لحم حبارى ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وإبراهيم بن عمر بن سفينة روى عنه ابن أبي فديك ويقال بريه بن عمر بن سفينة ‏.‏",
      "text_en": " Narrated Ibrahim bin 'Umar bin Safinah:                     From his father, from his grandfather that he said: \"I ate bustard meat with the Messenger of Allah (ﷺ).\"[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except from this route. Ibn Abi Fudaik reported from Ibrahim bin 'Umar bin Safinah and he has been called Buraih bin 'Umar bin Safinah.",
      "chain": [
        "30264",
        "34018",
        "28014",
        "18774"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الفضل بن سهل الأعرج البغدادي، وغير، واحد، قالوا حدثنا يونس بن محمد، عن سلام بن أبي مطيع، عن قتادة، عن الحسن، عن سمرة بن جندب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحسب المال والكرم التقوى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث سمرة ‏.‏ لا نعرفه إلا من هذا الوجه من حديث سلام بن أبي مطيع وهو ثقة ‏.‏",
      "text_en": " Narrated Al-Hasan:                     from Samurah that the Prophet (ﷺ) said: \"Al-Hasab is wealth and Al-Karam is Taqwa.\"",
      "chain": [
        "30264",
        "20393",
        "20550",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "3980",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الفضل بن سهل أبو العباس الأعرج البغدادي، حدثنا عبد الرحمن بن غزوان أبو نوح، أخبرنا يونس بن أبي إسحاق، عن أبي بكر بن أبي موسى، عن أبيه، قال خرج أبو طالب إلى الشام وخرج معه النبي صلى الله عليه وسلم في أشياخ من قريش فلما أشرفوا على الراهب هبطوا فحلوا رحالهم فخرج إليهم الراهب وكانوا قبل ذلك يمرون به فلا يخرج إليهم ولا يلتفت ‏.‏ قال فهم يحلون رحالهم فجعل يتخللهم الراهب حتى جاء فأخذ بيد رسول الله صلى الله عليه وسلم قال هذا سيد العالمين هذا رسول رب العالمين يبعثه الله رحمة للعالمين ‏.‏ فقال له أشياخ من قريش ما علمك فقال إنكم حين أشرفتم من العقبة لم يبق شجر ولا حجر إلا خر ساجدا ولا يسجدان إلا لنبي وإني أعرفه بخاتم النبوة أسفل من غضروف كتفه مثل التفاحة ‏.‏ ثم رجع فصنع لهم طعاما فلما أتاهم به وكان هو في رعية الإبل قال أرسلوا إليه فأقبل وعليه غمامة تظله فلما دنا من القوم وجدهم قد سبقوه إلى فىء الشجرة فلما جلس مال فىء الشجرة عليه فقال انظروا إلى فىء الشجرة مال عليه ‏.‏ قال فبينما هو قائم عليهم وهو يناشدهم أن لا يذهبوا به إلى الروم فإن الروم إذا رأوه عرفوه بالصفة فيقتلونه فالتفت فإذا بسبعة قد أقبلوا من الروم فاستقبلهم فقال ما جاء بكم قالوا جئنا أن هذا النبي خارج في هذا الشهر فلم يبق طريق إلا بعث إليه بأناس وإنا قد أخبرنا خبره بعثنا إلى طريقك هذا فقال هل خلفكم أحد هو خير منكم قالوا إنما أخبرنا خبره بطريقك هذا ‏.‏ قال أفرأيتم أمرا أراد الله أن يقضيه هل يستطيع أحد من الناس رده قالوا لا ‏.‏ قال فبايعوه وأقاموا معه قال أنشدكم الله أيكم وليه قالوا أبو طالب فلم يزل يناشده حتى رده أبو طالب وبعث معه أبو بكر بلالا وزوده الراهب من الكعك والزيت ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash'ari:                     \"Abu Talib departed to Ash-Sham, and the Prophet (ﷺ) left with him, along with some older men from the Quraish. When they came across the monk they stopped there and began setting up their camp, and the monk came out to them. Before that they used to pass by him and he wouldn't come out nor pay attention to them.\" He said: \"They were setting up their camp when the monk was walking amidst them, until he came and took the hand of the Messenger of Allah (ﷺ). Then he said: 'This is the master of the men and jinn, this is the Messenger of the Lord of the worlds. Allah will raise him as a mercy to the men and jinn.' So some of the older people from the Quraish said: 'What do you know?' He said: 'When you people came along from the road, not a rock nor a tree was left, except that it prostrated, and they do not prostrate except for a Prophet. And I can recognize him by the seal of the Prophethood which is below his shoulder blade, like an apple.' Then he went back, and made them some food, and when he brought it to them, he [the Prophet (ﷺ)] was tending to the camels. So he said: 'Send for him.' So he came, and there was a cloud over him that was shading him. When he came close to the people, he found that they had beaten him to the tree's shade. So when he sat down, the shade of the tree leaned towards him. He (the monk) said: 'Look at the shade of the tree leaning towards him.'\" He said: \"So while he was standing over them, telling them not to take him to Rome with him - because if the Romans were to see him, they would recognize him by his description, and they would kill him - he turned, and there were seven people who had come from Rome. So he faced them and said: 'Why have you come?' They said: 'We came because this Prophet is going to appear during this month, and there isn't a road left except that people have been sent to it, and we have been informed of him, and we have been send to this road of yours.' So he said: 'Is there anyone better than you behind you?' They said: 'We only have news of him from this road of yours.' He said: 'Do you think that if there is a matter which Allah wishes to bring about, there is anyone among the people who can turn it away?' They said: 'No.'\" He said: \"So they gave him their pledge, and they stayed with him. And he said: 'I ask you by Allah, which of you is his guardian?' They said: 'Abu Talib.' So he kept adjuring him until Abu Talib returned him (back to Makkah) and he sent Abu Bakr and Bilal with him. And the monk gave him provisions of Ka'k (a type of bread) and olive oil.\"",
      "chain": [
        "30264",
        "10846",
        "11900",
        "41"
      ]
    },
    {
      "hadith_no": "992",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا الفضل بن سهل، قال حدثني أبو الجواب، قال حدثنا عمار بن رزيق، عن أبي إسحاق، عن إبراهيم بن مهاجر، عن مجاهد، عن ابن عمر، قال رمقت رسول الله صلى الله عليه وسلم عشرين مرة يقرأ في الركعتين بعد المغرب وفي الركعتين قبل الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"I watched the Messenger of Allah (ﷺ)- twenty times- reciting in the two rak'ahs after maghrib 'Say: O you disbelievers' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30264",
        "20578",
        "20595",
        "11049",
        "10739",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "2481",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الفضل بن سهل، قال حدثنا أبو النضر، هاشم بن القاسم قال حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الذي لا يؤدي زكاة ماله يخيل إليه ماله يوم القيامة شجاعا أقرع له زبيبتان - قال - فيلتزمه أو يطوقه - قال - يقول أنا كنزك أنا كنزك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: The one who does not pay Zakah on his wealth, his wealth will appear to him on the Day of Resurrection like a bald-headed Shuja 'a [2] with two dots above its eyes. It will hold onto him or encircle him and will say: I am your hoarded treasure, I am your hoarded treasure.\"'",
      "chain": [
        "30264",
        "20390",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "2482",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الفضل بن سهل، قال حدثنا حسن بن موسى الأشيب، قال حدثنا عبد الرحمن بن عبد الله بن دينار المدني، عن أبيه، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من آتاه الله عز وجل مالا فلم يؤد زكاته مثل له ماله يوم القيامة شجاعا أقرع له زبيبتان يأخذ بلهزمتيه يوم القيامة فيقول أنا مالك أنا كنزك ‏\"‏ ‏.‏ ثم تلا هذه الآية ‏{‏ ولا يحسبن الذين يبخلون بما آتاهم الله من فضله ‏}‏ الآية ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"If Allah gives a person wealth and he does not pay Zakah on it, his wealth will appear to him on the Day of Resurrection as a bald-heated Shuja'a with two dots above its eyes. It will take hold of the corners of his mouth on the Day of Resurrection and will say: 'I am your wealth, I am your hoarded treasure.' The he recited this verse: 'And let not those who covetously withhold of that which Allah has bestowed on them of His Bounty (wealth) and think that it is good for them (and so they do not pay the obligatory Zakah).\"'",
      "chain": [
        "30264",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4043",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا الفضل بن سهل الأعرج، قال حدثنا يحيى بن غيلان، - ثقة مأمون - قال حدثنا يزيد بن زريع، عن سليمان التيمي، عن أنس، قال إنما سمل النبي صلى الله عليه وسلم أعين أولئك لأنهم سملوا أعين الرعاة ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Prophet [SAW] only had the eyes of those people gouged out, because they had gouged out the eyes of the herdsmen.\"",
      "chain": [
        "30264",
        "30527",
        "20304",
        "11289",
        "19"
      ]
    }
  ],
  "total_hadiths": 19
}