{
  "id": "30265",
  "name": "al-Fadl bin Y'aqub bin Ibrahim الفضل بن يعقوب الرخامي",
  "full_name": "al-Fadl bin Y'aqub bin Ibrahim الفضل بن يعقوب الرخامي",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "258",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  ق  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30346",
      "name": "'Abdullah bin Ja'far al-Raqqi عبد الله بن جعفر الرقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30209",
      "name": "Muhammad bin Sabiq al-Tamimi محمد بن سابق التميمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20418",
      "name": "al-Hasan bin Muhammad bin A'yn الحسن بن محمد بن أعين",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "26005",
      "name": "Habib bin Abi Habib al-Masri حبيب بن أبي حبيب المصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28182",
      "name": "Rwad bin al-Jrah Abu Asam رواد بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31",
      "name": "Hussain ibn 'Ali ibn Abi Talib ( حسين بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3159",
      "hadith_no": "3159",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير، عن جبير بن حية، قال بعث عمر الناس في أفناء الأمصار يقاتلون المشركين، فأسلم الهرمزان فقال إني مستشيرك في مغازي هذه‏.‏ قال نعم، مثلها ومثل من فيها من الناس من عدو المسلمين مثل طائر له رأس وله جناحان وله رجلان، فإن كسر أحد الجناحين نهضت الرجلان بجناح والرأس، فإن كسر الجناح الآخر نهضت الرجلان والرأس، وإن شدخ الرأس ذهبت الرجلان والجناحان والرأس، فالرأس كسرى، والجناح قيصر، والجناح الآخر فارس، فمر المسلمين فلينفروا إلى كسرى‏.‏ وقال بكر وزياد جميعا عن جبير بن حية قال فندبنا عمر واستعمل علينا النعمان بن مقرن، حتى إذا كنا بأرض العدو، وخرج علينا عامل كسرى في أربعين ألفا، فقام ترجمان فقال ليكلمني رجل منكم‏.‏ فقال المغيرة سل عما شئت‏.‏ قال ما أنتم قال نحن أناس من العرب كنا في شقاء شديد وبلاء شديد، نمص الجلد والنوى من الجوع، ونلبس الوبر والشعر، ونعبد الشجر والحجر، فبينا نحن كذلك، إذ بعث رب السموات ورب الأرضين تعالى ذكره وجلت عظمته إلينا نبيا من أنفسنا، نعرف أباه وأمه، فأمرنا نبينا رسول ربنا صلى الله عليه وسلم أن نقاتلكم حتى تعبدوا الله وحده أو تؤدوا الجزية، وأخبرنا نبينا صلى الله عليه وسلم عن رسالة ربنا أنه من قتل منا صار إلى الجنة في نعيم لم ير مثلها قط، ومن بقي منا ملك رقابكم‏.‏ فقال النعمان ربما أشهدك الله مثلها مع النبي صلى الله عليه وسلم فلم يندمك ولم يخزك، ولكني شهدت القتال مع رسول الله صلى الله عليه وسلم كان إذا لم يقاتل في أول النهار انتظر حتى تهب الأرواح وتحضر الصلوات‏.‏",
      "text_en": " Narrated Jubair bin Haiya:                     `Umar sent the Muslims to the great countries to fight the pagans. When Al-Hurmuzan embraced Islam, `Umar said to him. \"I would like to consult you regarding these countries which I intend to invade.\" Al-Hurmuzan said, \"Yes, the example of these countries and their inhabitants who are the enemies. of the Muslims, is like a bird with a head, two wings and two legs; If one of its wings got broken, it would get up over its two legs, with one wing and the head; and if the other wing got broken, it would get up with two legs and a head, but if its head got destroyed, then the two legs, two wings and the head would become useless. The head stands for Khosrau, and one wing stands for Caesar and the other wing stands for Faris. So, order the Muslims to go towards Khosrau.\" So, `Umar sent us (to Khosrau) appointing An-Nu`man bin Muqrin as our commander. When we reached the land of the enemy, the representative of Khosrau came out with forty-thousand warriors, and an interpreter got up saying, \"Let one of you talk to me!\" Al-Mughira replied, \"Ask whatever you wish.\" The other asked, \"Who are you?\" Al-Mughira replied, \"We are some people from the Arabs; we led a hard, miserable, disastrous life: we used to suck the hides and the date stones from hunger; we used to wear clothes made up of fur of camels and hair of goats, and to worship trees and stones. While we were in this state, the Lord of the Heavens and the Earths, Elevated is His Remembrance and Majestic is His Highness, sent to us from among ourselves a Prophet whose father and mother are known to us. Our Prophet, the Messenger of our Lord, has ordered us to fight you till you worship Allah Alone or give Jizya (i.e. tribute); and our Prophet has informed us that our Lord says:-- \"Whoever amongst us is killed (i.e. martyred), shall go to Paradise to lead such a luxurious life as he has never seen, and whoever amongst us remain alive, shall become your master.\" (Al-Mughira, then blamed An-Nu`man for delaying the attack and) An-Nu' man said to Al-Mughira, \"If you had participated in a similar battle, in the company of Allah's Apostle he would not have blamed you for waiting, nor would he have disgraced you. But I accompanied Allah's Apostle in many battles and it was his custom that if he did not fight early by daytime, he would wait till the wind had started blowing and the time for the prayer was due (i.e. after midday).",
      "usc_msa_ref": "386",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225"
      ]
    },
    {
      "id": "sahih-bukhari-4204",
      "hadith_no": "4204",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني فضل بن يعقوب، حدثنا الحسن بن محمد بن أعين أبو علي الحراني، حدثنا زهير، حدثنا أبو إسحاق، قال أنبأنا البراء بن عازب  رضى الله عنهما أنهم كانوا مع رسول الله صلى الله عليه وسلم يوم الحديبية ألفا وأربعمائة أو أكثر، فنزلوا على بئر فنزحوها، فأتوا رسول الله صلى الله عليه وسلم فأتى البئر، وقعد على شفيرها ثم قال ‏\"‏ ائتوني بدلو من مائها ‏\"‏‏.‏ فأتي به فبصق فدعا ثم قال ‏\"‏ دعوها ساعة ‏\"‏‏.‏ فأرووا أنفسهم وركابهم حتى ارتحلوا‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     That they were in the company of Allah's Apostle on the day of Al-Hudaibiya and their number was 1400 or more. They camped at a well and drew its water till it was dried. When they informed Allah's Apostle of that, he came and sat over its edge and said, \"Bring me a bucket of its water.\" When it was brought, he spat and invoked (Allah) and said, \"Leave it for a while.\" Then they quenched their thirst and watered their riding animals (from that well) till they departed.",
      "usc_msa_ref": "472",
      "chain": [
        "30265",
        "20418",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-5217",
      "hadith_no": "5217",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا محمد بن سابق، حدثنا إسرائيل، عن هشام بن عروة، عن أبيه، عن عائشة، أنها زفت امرأة إلى رجل من الأنصار فقال نبي الله صلى الله عليه وسلم ‏\"‏ يا عائشة ما كان معكم لهو فإن الأنصار يعجبهم اللهو ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          that she prepared a lady for a man from the Ansar as his bride and the     Prophet said, \"O 'Aisha! Haven't you got any amusement (during the      marriage ceremony) as the Ansar like amusement?\"",
      "usc_msa_ref": "92",
      "chain": [
        "30265",
        "30209",
        "20311",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-7624",
      "hadith_no": "7624",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير بن حية، عن جبير بن حية، قال المغيرة أخبرنا نبينا، صلى الله عليه وسلم عن رسالة، ربنا ‏\"‏ أنه من قتل منا صار إلى الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Our Prophet has informed us our Lord's Message that whoever of us is martyred, will go to Paradise.",
      "usc_msa_ref": "621",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "id": "sunan-abi-daud-1894",
      "hadith_no": "1894",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن السرح، والفضل بن يعقوب، - وهذا لفظه - قالا حدثنا سفيان، عن أبي الزبير، عن عبد الله بن باباه، عن جبير بن مطعم، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ لا تمنعوا أحدا يطوف بهذا البيت ويصلي أى ساعة شاء من ليل أو نهار ‏\"‏ ‏.‏ قال الفضل إن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا بني عبد مناف لا تمنعوا أحدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Jubayr ibn Mut'im:                     The Prophet (ﷺ) said: Do not prevent anyone from going round this House (the Ka'bah) and from praying any moment he desires by day or by night. The narrator Fadl (ibn Ya'qub) said: The Messenger of Allah (ﷺ) said: Banu Abdu Munaf, do not stop anyone.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30265",
        "20005",
        "11263",
        "10642"
      ]
    },
    {
      "id": "sunan-abi-daud-3432",
      "hadith_no": "3432",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الأعلى، عن محمد بن إسحاق، حدثنا العلاء بن عبد الرحمن الحرقي، عن ابن ماجدة السهمي، عن عمر بن الخطاب، - رضى الله عنه - عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Abu Majidah quoted 'Umar b. al-Khattab as saying:                      I heard the Prophet (ﷺ) say ... narrating the tradition to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30265",
        "20246",
        "11107",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-889",
      "hadith_no": "889",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الفضل بن يعقوب الجزري، حدثنا عبد الأعلى، عن محمد بن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن عائشة، قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ كل صلاة لا يقرأ فيها بأم الكتاب فهي خداج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Aishah said:                      “I heard the Messenger of Allah (ﷺ) say: ‘Every prayer in which the Ummul-Kitab (the Mother of the Book) is not recited is deficient.’”",
      "usc_msa_ref": "",
      "chain": [
        "30265",
        "20246",
        "11107",
        "19826",
        "11250",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2277",
      "hadith_no": "2277",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا الفضل بن يعقوب الرخامي، حدثنا حبيب بن أبي حبيب أبو محمد، كاتب مالك بن أنس حدثنا عبد الله بن عامر الأسلمي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  نهى عن بيع العربان ‏.‏ قال أبو عبد الله العربان أن يشتري الرجل دابة بمائة دينار فيعطيه دينارين أربونا فيقول إن لم أشتر الدابة فالديناران لك ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather that :                     the Prophet (ﷺ) forbade the deal involving earnest money. (Hasan)Abu 'Abdullah said: Earnest money refers to when a man buys an animal for one hundred Dinar, then he gives the seller two Dinar in advance and says: \"If I do not buy the animal, then the two Dinar are yours.\"  And it was said that it refers, and Allah knows best, to when a man buys something, and gives the seller a Dirham or less or more, and says: \"If I take it (all well and good), and if I do not, then the Dirham is yours.\"",
      "usc_msa_ref": "",
      "chain": [
        "30265",
        "22097",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 8
}