{
  "id": "30271",
  "name": "Muhammad bin 'Abdullah bin al-Muburak محمد بن عبد الله بن المبارك",
  "full_name": "Muhammad bin 'Abdullah bin al-Muburak محمد بن عبد الله بن المبارك",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  د  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20383",
      "name": "al-Hasan bin Musa al-'Ashayb الحسن بن موسى الأشيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20553",
      "name": "Safwan bin 'Isa al-Zhry صفوان بن عيسى الزهري أبو محمد البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30278",
      "name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20382",
      "name": "Hajayn bin al-Muthna حجين بن المثني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20440",
      "name": "'Abdur Rahman bin Ghazwan,Qard Abu Nuh عبد الرحمن بن غزوان - قراد أبو نوح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30282",
      "name": "Yahya bin Yusuf يحيى بن يوسف",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5331",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن عبد الله بن المبارك المخرمي، حدثنا قراد أبو نوح، حدثنا جرير بن حازم، عن أيوب، عن عكرمة، عن ابن عباس، رضى الله عنهما قال جاءت امرأة ثابت بن قيس بن شماس إلى النبي صلى الله عليه وسلم فقالت يا رسول الله ما أنقم على ثابت في دين ولا خلق، إلا أني أخاف الكفر‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتردين عليه حديقته ‏\"‏‏.‏ فقالت نعم‏.‏ فردت عليه، وأمره ففارقها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The wife of Thabit bin Qais bin Shammas came to the Prophet and said, \"O Allah's Apostle! I do not blame Thabit for any defects in his character or his religion, but I am afraid that I (being a Muslim) may become unthankful for Allah's Blessings.\" On that, Allah's Apostle said (to her), 'Will you return his garden to him?\" She said, \"Yes.\" So she returned his garden to him and the Prophet told him to divorce her.",
      "chain": [
        "30271",
        "20440",
        "11272",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا أسود بن عامر، حدثنا شريك، وهذا، لفظه ح وحدثنا محمد بن عبد الله، - يعني المخرمي - حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن المغيرة، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا أتى الخلاء أتيته بماء في تور أو ركوة فاستنجى ‏.‏ قال أبو داود في حديث وكيع ثم مسح يده على الأرض ثم أتيته بإناء آخر فتوضأ ‏.‏ قال أبو داود وحديث الأسود بن عامر أتم ‏.‏",
      "text_en": " Narrated Abu Hurayrah :                     When the Prophet (sal Allaahu alayhi wa sallam ) went to the privy, I took to him water in a small vessel  or a skin, and he cleansed himself. He then wiped his hand on the ground. I then took to him another vessel  and he performed ablution.Abu Dawud said : The tradition is transmitted by al-Aswad b. 'Amir is more perfect.",
      "chain": [
        "38072",
        "20380",
        "20587",
        "30271",
        "20032",
        "11858",
        "18002",
        "166",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "2379",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الله المخرمي، ويحيى بن موسى البلخي، قالا حدثنا يحيى بن عيسى، عن الأعمش، قال ما رأيت أحدا من أصحابنا يكره الكحل للصائم وكان إبراهيم يرخص أن يكتحل الصائم بالصبر ‏.‏",
      "text_en": " Al-A'mash said:                      I did not see any of our companions who abominated the use of collyrium by a man who fasting. Ibrahim would permit the man who was fasting to apply collyrium with aloes.",
      "chain": [
        "30271",
        "30221",
        "11060"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عبد الله المخرمي، حدثنا عبد الرحمن بن مهدي، حدثنا عمران القطان، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم استخلف ابن أم مكتوم على المدينة مرتين ‏.‏",
      "text_en": " Narrated Anas:                     The Prophet (ﷺ) appointed Ubn Umm Makthum as a governor of Medina (in his absence) twice.",
      "chain": [
        "30271",
        "20033",
        "20718",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "50",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن أبي زرعة، عن أبي هريرة، أن النبي صلى الله عليه وسلم توضأ فلما استنجى دلك يده بالأرض ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) performed Wudu', and when he had performed Istinja' he rubbed his hand on the ground.",
      "chain": [
        "30271",
        "20032",
        "20587",
        "18002",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "575",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا الفضل بن عنبسة، قال حدثنا وهيب، عن ابن طاوس، عن أبيه، قال قالت عائشة رضى الله عنها أوهم عمر - رضى الله عنه - إنما نهى رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تتحروا بصلاتكم طلوع الشمس ولا غروبها فإنها تطلع بين قرنى شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Tawus that his father said:                      \"'Aishah, may Allah be please with her, said: 'Umar, may Allah be please with him, is not correct, rather the Messenger of Allah (ﷺ) only prohibited, as he said: 'Do no deliberately seek to pray when the sun is rising or when it is setting, for it rises between the horns of a Shaitan.\"",
      "chain": [
        "30271",
        "30366",
        "20299",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "815",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا أبو هشام، قال حدثنا أبان، قال حدثنا قتادة، قال حدثنا أنس، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ راصوا صفوفكم وقاربوا بينها وحاذوا بالأعناق فوالذي نفس محمد بيده إني لأرى الشياطين تدخل من خلل الصف كأنها الحذف ‏\"‏ ‏.‏",
      "text_en": " Anas narrated that the Prophet (ﷺ) said:                      \"Make your rows solid and close together, and keep your necks in line. By the One in Whose Hand is the soul of Muhammad! I can see the shaitan entering through the gaps in the rows as if they are small sheep.\"",
      "chain": [
        "30271",
        "20577",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا يحيى بن آدم، قال حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما رسول الله صلى الله عليه وسلم وعنده جبريل عليه السلام إذ سمع نقيضا فوقه فرفع جبريل عليه السلام بصره إلى السماء فقال هذا باب قد فتح من السماء ما فتح قط ‏.‏ قال فنزل منه ملك فأتى النبي صلى الله عليه وسلم فقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لم تقرأ حرفا منهما إلا أعطيته ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"When Jibril was with the Messenger of Allah (ﷺ), he heard a sound from above like a door opening. Jibril, peace be upon him, looked up toward the sky and said: 'This is a gate in Heaven that has been opened, but it was never opened before.\" He said: \"An Angel came down from it and came to the Prophet (ﷺ) and said: 'Receive the glad tidings of two lights that have been given to you and were never given to any prophet before you: The Opening of the Book (Al-Fatihah) and the last verses of Surat Al-Baqarah. You will never recite a single letter of them but you will be granted it.'\"",
      "chain": [
        "30271",
        "20364",
        "20327",
        "20595",
        "11361",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا وكيع، عن مسعر، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شك أحدكم في صلاته فليتحر ويسجد سجدتين بعد ما يفرغ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'If one of you is not sure about his prayer, let him estimate and prostrate twice after he has finished.\"",
      "chain": [
        "30271",
        "20032",
        "20359",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1273",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا أبو معاوية، قال حدثنا الأعمش، عن أبي صالح، عن سعد، قال مر على رسول الله صلى الله عليه وسلم وأنا أدعو بأصابعي فقال ‏\"‏ أحد أحد ‏\"‏ ‏.‏ وأشار بالسبابة ‏.‏",
      "text_en": " It was narrated from Sa'd who said:                     \"The Messenger of Allah (ﷺ) passed by m when I was supplicating with my fingers and he said: 'Make it one, make it one' and pointed with his forefinger.\"",
      "chain": [
        "30271",
        "20354",
        "11060",
        "11161",
        "9"
      ]
    },
    {
      "hadith_no": "2619",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا أبو هشام، - واسمه المغيرة بن سلمة - قال حدثنا الربيع بن مسلم، قال حدثنا محمد بن زياد، عن أبي هريرة، قال خطب رسول الله صلى الله عليه وسلم الناس فقال ‏\"‏ إن الله عز وجل قد فرض عليكم الحج ‏\"‏ ‏.‏ فقال رجل في كل عام فسكت عنه حتى أعاده ثلاثا فقال ‏\"‏ لو قلت نعم لوجبت ولو وجبت ما قمتم بها ذروني ما تركتكم فإنما هلك من كان قبلكم بكثرة سؤالهم واختلافهم على أنبيائهم فإذا أمرتكم بالشىء فخذوا به ما استطعتم وإذا نهيتكم عن شىء فاجتنبوه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah addressed the people and said: 'Allah, the Mighty and Sublime, has enjoined upon you Hajj.' A man said: 'Every year?' He remained silent until he had repeated it three times. Then he said: 'If I said yes, it would be obligatory, and if it were obligatory you would not be able to do it. Leave me alone so long as I have left you alone. Those who came before you were destroyed because they asked too many questions and differed with their prophets. If I command you to do something then follow it as much as you can, and if I forbid you to do something then avoid it.\"'",
      "chain": [
        "30271",
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2732",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا حجين بن المثنى، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر، رضى الله عنهما قال تمتع رسول الله صلى الله عليه وسلم في حجة الوداع بالعمرة إلى الحج وأهدى وساق معه الهدى بذي الحليفة وبدأ رسول الله صلى الله عليه وسلم فأهل بالعمرة ثم أهل بالحج وتمتع الناس مع رسول الله صلى الله عليه وسلم بالعمرة إلى الحج فكان من الناس من أهدى فساق الهدى ومنهم من لم يهد فلما قدم رسول الله صلى الله عليه وسلم مكة قال للناس ‏\"‏ من كان منكم أهدى فإنه لا يحل من شىء حرم منه حتى يقضي حجه ومن لم يكن أهدى فليطف بالبيت وبالصفا والمروة وليقصر وليحلل ثم ليهل بالحج ثم ليهد ومن لم يجد هديا فليصم ثلاثة أيام في الحج وسبعة إذا رجع إلى أهله ‏\"‏ ‏.‏ فطاف رسول الله صلى الله عليه وسلم حين قدم مكة واستلم الركن أول شىء ثم خب ثلاثة أطواف من السبع ومشى أربعة أطواف ثم ركع حين قضى طوافه بالبيت فصلى عند المقام ركعتين ثم سلم فانصرف فأتى الصفا فطاف بالصفا والمروة سبعة أطواف ثم لم يحل من شىء حرم منه حتى قضى حجه ونحر هديه يوم النحر وأفاض فطاف بالبيت ثم حل من كل شىء حرم منه وفعل مثل ما فعل رسول الله صلى الله عليه وسلم من أهدى وساق الهدى من الناس ‏.‏",
      "text_en": " It was narrated from Salim bin 'Abdullah that 'Abdullah bin 'Umar said;\"during the Farewell Pilgrimage, the Messenger of Allah benefited from performing 'Umrah and then Hajj, and he brought a Hadi (sacrificial animal )with him from dhul-Hulaifah. The Messenger of Allah entered Ihram for 'Umrah frist, them for Hajj, and the people also benefited by entering Ihram for 'Umrah first, then for Hajj. Some of the people brought the Hadi and carried it along with them, and other s did not. When the Messenger of Allah came to Makkah, he said to the people:                      'Whoever among you has brought a Hadi, nothing is permissible for him that became forbidden when he entered Ihram, until he has finished his Hajj, Whoever did not find a Hadi, let him fast for three days during the Hajj, and for seven when he returns to his family, the Messenger of Allah performed Tawaf when he came to Makkah and touched the corner (where the Black Stone is) first of all, then he walked rapidly during the first three of the seven circles, and walked daring the last four. After he finished circumambulating the House he prayed two Rak'ahs at Maqam Ibrahim. Then he went to As-Safa and walked seven rounds between As-Safa and Al-Marwah. And he did not do any action that was forbidden because of Ihram until he had completed his Hajj and slaughtered his Hadi on the Day of sacrifice. Then he hastened onward (toard Makkah) and circumambulated the House. Then everything that had been forbidden because of Ihram became permissible. And those who had brought the Hadi with them did the same as the Messenger of Allah did.",
      "chain": [
        "30271",
        "20382",
        "20023",
        "11207",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كنت أغار على اللاتي وهبن أنفسهن للنبي صلى الله عليه وسلم فأقول أوتهب الحرة نفسها فأنزل الله عز وجل ‏{‏ ترجي من تشاء منهن وتؤوي إليك من تشاء ‏}‏ قلت والله ما أرى ربك إلا يسارع لك في هواك ‏.‏",
      "text_en": " Narrated 'Aishah:                     It was narrated that 'Aishah said: \"I used to feel jealous of those (women) who offered themselves (in marriage) to the Prophet and I said: 'Would a free woman offer herself?' Then Allah, the Mighty and Sublime, revealed: 'You can postpone whom you will of them, and you may receive whom you will.' I said: 'By Allah, I see that your Lord is quick to respond to your wishes.'\"",
      "chain": [
        "30271",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3835",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا يحيى بن آدم، قال حدثنا ابن المبارك، عن يونس، عن الزهري، عن أبي سلمة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر في معصية وكفارته كفارة يمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah said: 'There is no vow to commit an act of disobedience, and its expiation is the expiation for an oath.'\"",
      "chain": [
        "30271",
        "20364",
        "20025",
        "20475",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "4873",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا أبو معاوية، قال حدثنا الأعمش، ح وأنبأنا أحمد بن حرب، عن أبي معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لعن الله السارق يسرق البيضة فتقطع يده ويسرق الحبل فتقطع يده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah, may Allah be pleased with him, said:                     \"The Messenger of Allah said; 'Allah curses the thief who steals an egg and had his hand cut off, and who steals a rope and has his hand cut off.\"",
      "chain": [
        "30271",
        "20354",
        "11060",
        "38011",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 15
}