{
  "id": "30278",
  "name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
  "full_name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": [
        "150 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "211",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Accused Liar] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Hanfi",
      "Baghdad",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "36688",
      "name": "Yahya bin Ma'la bin Mansur يحيى بن معلى بن منصور أبو عوانة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25287",
      "name": "Muhammad bin Maymun al-Z'frany محمد بن ميمون الزعفراني أبو النضر الكوفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20744",
      "name": "al-Hythm bin Hameed al-Ghsany الهيثم بن حميد الغساني مولاهم أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "20505",
      "name": "'Abdullah bin Ja'far bin 'Abdur Rahman عبد الله بن جعفر بن عبد الرحمن - المخرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24396",
      "name": "Muhammad bin Dinar al-Azdy محمد بن دينار الأزدي ثم الطاحي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "36688",
      "name": "Yahya bin Ma'la bin Mansur يحيى بن معلى بن منصور أبو عوانة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "38072",
      "name": "Abu Thaur al-Kalbi إبراهيم بن خالد أبو ثور الكلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30262",
      "name": "'Ali bin al-Hythm al-Bghdady علي بن الهيثم البغدادي صاحب الطعام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30264",
      "name": "al-Fadl bin Sahl bin Ibrahim الفضل بن سهل بن إبراهيم الأعرج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30514",
      "name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "309",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا معلى بن منصور، عن علي بن مسهر، عن الشيباني، عن عكرمة، قال كانت أم حبيبة تستحاض فكان زوجها يغشاها ‏.‏ قال أبو داود وقال يحيى بن معين معلى ثقة ‏.‏ وكان أحمد بن حنبل لا يروي عنه لأنه كان ينظر في الرأى ‏.‏",
      "text_en": " 'Ikrimah said:                      Umm Habibah had a prolonged flow of blood ; her husband used to cohabit with her.Abu Dawud said: Yahya b. Ma'in has pronounced Mu'alla (a narrator of this tradition) as trustworthy. But Ahmad b. Hanbal would not report (traditions) from him because he exercised personal opinion.",
      "chain": [
        "38072",
        "30278",
        "20345",
        "11352",
        "11023",
        "72"
      ]
    },
    {
      "hadith_no": "2107",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا حجاج بن أبي يعقوب الثقفي، حدثنا معلى بن منصور، حدثنا ابن المبارك، حدثنا معمر، عن الزهري، عن عروة، عن أم حبيبة، أنها كانت تحت عبيد الله بن جحش فمات بأرض الحبشة فزوجها النجاشي النبي صلى الله عليه وسلم وأمهرها عنه أربعة آلاف وبعث بها إلى رسول الله صلى الله عليه وسلم مع شرحبيل ابن حسنة ‏.‏ قال أبو داود حسنة هي أمه ‏.‏",
      "text_en": " Urwah reported on the authority of Umm Habibah that she was married to Abdullah ibn Jahsh who died in Abyssinia, so the Negus married her to the Prophet (ﷺ) giving her on his behalf a dower of four thousand (dirhams). He sent her to the Messenger of Allah (ﷺ) with Shurahbil ibn Hasanah. AbuDawud said:                      Hasanah is his mother.",
      "chain": [
        "30278",
        "20025",
        "20115",
        "11013",
        "10511",
        "59"
      ]
    },
    {
      "hadith_no": "3758",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا معلى، - يعني ابن منصور - عن محمد بن ميمون، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تؤخر الصلاة لطعام ولا لغيره ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: Prayer should not be postponed for taking meals nor for any other thing.",
      "chain": [
        "30163",
        "30278",
        "20458",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو يحيى، محمد بن عبد الرحيم البغدادي حدثنا معلى بن منصور، حدثنا عبد الله بن جعفر المخرمي، هو من ولد المسور بن مخرمة عن عثمان بن محمد الأخنسي، عن سعيد المقبري، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم وسوء ذات البين فإنها الحالقة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب من هذا الوجه ‏.‏ ومعنى قوله ‏\"‏ وسوء ذات البين ‏\"‏ ‏.‏ إنما يعني العداوة والبغضاء وقوله ‏\"‏ الحالقة ‏\"‏ ‏.‏ يقول إنها تحلق الدين ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"Beware of evil with each other, for indeed it is the Haliqah.\"",
      "chain": [
        "30278",
        "19835",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3185",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا معلى بن منصور، حدثنا محمد بن دينار، عن سعد بن أوس، عن مصدع أبي يحيى، عن ابن عباس، عن أبى بن كعب، أن النبي صلى الله عليه وسلم قرأ ‏(‏في عين حمئة ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه والصحيح ما روي عن ابن عباس قراءته ‏.‏ ويروى أن ابن عباس وعمرو بن العاصي اختلفا في قراءة هذه الآية وارتفعا إلى كعب الأحبار في ذلك فلو كانت عنده رواية عن النبي صلى الله عليه وسلم لاستغنى بروايته ولم يحتج إلى كعب ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     from Ubay bin Ka'b that the Prophet (ﷺ) recited: \"Fi 'Ainin Hami'ah\" (18:86)",
      "chain": [
        "30221",
        "30278",
        "24396",
        "20722",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "603",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا معلى بن منصور، وبشر بن آدم، قالا حدثنا عيسى بن يونس، عن عيسى بن سنان، عن الضحاك بن عبد الرحمن بن عرزب، عن أبي موسى الأشعري، أن رسول الله  صلى الله عليه وسلم  توضأ ومسح على الجوربين والنعلين ‏.‏ قال المعلى في حديثه لا أعلمه إلا قال والنعلين ‏.‏",
      "text_en": " It was narrated from Abu Musa Al-Ash'ari that:                     The Messenger of Allah performed ablution and wiped over his socks and his sandals.",
      "chain": [
        "11222",
        "30278",
        "30125",
        "20347",
        "14307",
        "18452",
        "41"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معلى بن منصور، عن عبد الله بن جعفر، عن عثمان بن محمد، عن المقبري، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من جعل قاضيا بين الناس فقد ذبح بغير سكين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoever is appointed judge between the people, he has been slaughtered without a knife.”",
      "chain": [
        "30201",
        "30278",
        "108",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3074",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معلى بن منصور، ح وحدثنا إسحاق بن منصور، وأحمد بن سنان، قالا حدثنا عبد الرحمن بن مهدي، قالا حدثنا مالك بن أنس، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب، عن أم سلمة، أنها مرضت فأمرها رسول الله  صلى الله عليه وسلم  أن تطوف من وراء الناس وهي راكبة ‏.‏ قالت فرأيت رسول الله  صلى الله عليه وسلم  يصلي إلى البيت وهو يقرأ ‏{والطور * وكتاب مسطور}‏ ‏.‏ قال ابن ماجه هذا حديث أبي بكر ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that she fell sick, so the MessengerofAllah (ﷺ) told her to perform Tawaf from behind the people,riding.She said:                      “I saw the Messenger of Allah (ﷺ) praying facingtheHouse, and reciting: “By the Tur (Mount), And by the BookInscribed.’” [52:1-2]",
      "chain": [
        "30201",
        "30278",
        "30313",
        "30297",
        "20033",
        "20001",
        "11105",
        "10511",
        "57",
        "56"
      ]
    }
  ],
  "total_hadiths": 8
}