{
  "id": "30284",
  "name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني",
  "full_name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": [
        "140 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "212",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Recitation/Quran",
      "Fiqh"
    ],
    "tags": [
      "al-Ghasani",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28042",
      "name": "Isma'il bin 'Abdullah إسماعيل بن عبد الله بن سماعه",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20398",
      "name": "Sdqh bin Khalid al-Amwy صدقة بن خالد الأموي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20454",
      "name": "Muhammad bin Harb al-Khulani محمد بن حرب الخولاني الأبرش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20641",
      "name": "Haql bin Ziyad هقل بن زياد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27507",
      "name": "Khalid bin Yazid bin Salah خالد بن يزيد بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20674",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم بن سوسن الطائفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20401",
      "name": "Mua'wiya bin Salam",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "26016",
      "name": "Salmah bin al-'Ayyar سلمة بن العيار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30388",
      "name": "Muhammad bin Yusuf al-Baykandi محمد بن يوسف البيكندي البخاري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37520",
      "name": "Abd al-Salam bin Atyq عبد السلام بن عتيق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37532",
      "name": "Muhammad bin al-Walid bin Hbyrh محمد بن الوليد بن هبيرة الهاشمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38313",
      "name": "'Abdullah bin Muhammad bin 'Amr عبد الله بن محمد بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37500",
      "name": "Ahmed bin Abd al-Wahd أحمد بن عبد الواحد بن واقد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37530",
      "name": "Muhammad bin 'Abdur Rahman bin al-As'ath محمد بن عبد الرحمن بن الأشعث",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37544",
      "name": "Yazid bin Muhammad يزيد بن محمد بن عبد الصمد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37538",
      "name": "Harun bin Muhammad bin Bkar هارون بن محمد بن بكار بن بلال",
      "grade": "3rd Century AH"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30226",
      "name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30587",
      "name": "Sulaiman bin 'Abdur Rahman سليمان بن عبد الرحمن بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38032",
      "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30586",
      "name": "Muhammad bin 'Abdul Malik bin Zunjwiya محمد بن عبد الملك بن زنجويه الغزال",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30288",
      "name": "Hisham bin 'Ammar bin Nasayr هشام بن عمار بن نصير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37540",
      "name": "Hisham bin Khalid bin Yazid al-Azraq هشام بن خالد بن زيد بن مروان الأزرق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30535",
      "name": "Ahmed bin Yusuf bin Khalid أحمد بن يوسف بن خالد حمدان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36580",
      "name": "'Abbas bin 'Abdullah al-Tarfaqi عباس بن عبد الله الترقفي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31877",
      "name": "Muhammad bin 'Awn bin Abi 'Awn محمد بن عون بن أبي عون الزيادي",
      "grade": "3rd Century AH"
    },
    {
      "id": "38705",
      "name": "Yahya bin 'Uthman bin Sa'id bin Kathir يحيى بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "77",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن يوسف، قال حدثنا أبو مسهر، قال حدثني محمد بن حرب، حدثني الزبيدي، عن الزهري، عن محمود بن الربيع، قال عقلت من النبي صلى الله عليه وسلم مجة مجها في وجهي وأنا ابن خمس سنين من دلو‏.‏",
      "text_en": " Narrated Mahmud bin Rabi`a:                     When I was a boy of five, I remember, the Prophet took water from a bucket (used far getting water out of a well) with his mouth and threw it on my face.",
      "chain": [
        "30388",
        "30284",
        "30373",
        "20459",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "4031",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا أبو مسهر، حدثني يحيى بن حمزة، حدثني أبو عمرو الأوزاعي، عن أبي النجاشي، مولى رافع بن خديج عن رافع، أن ظهير بن رافع، - وهو عمه - قال أتاني ظهير فقال لقد نهى رسول الله صلى الله عليه وسلم عن أمر كان بنا رافقا ‏.‏ فقلت وما ذاك ما قال رسول الله صلى الله عليه وسلم فهو حق ‏.‏ قال سألني كيف تصنعون بمحاقلكم فقلت نؤاجرها يا رسول الله على الربيع أو الأوسق من التمر أو الشعير ‏.‏ قال ‏\"‏ فلا تفعلوا ازرعوها أو أزرعوها أو أمسكوها ‏\"‏ ‏.‏",
      "text_en": " Rafi (Allah be pleased with him) reported that Zuhair b. Rafi (who was his uncle) came to me and said:                      Allah's Messenger (may peace be upon him) forbade a practice which was useful for us. I said: What is this? (I believe) that whatrver Allah's Messenger (may peace be upon him) says is absolutely true. He (Zuhair) said that he (the Holy Prophet) asked me: What do you do with your cultivable lands? I said: Allah's Messenger, we rent those irrigated by canals for dry dates or barley. He said: Don't do that. Cultivate them or let them be cultivated (by others) or retain them yourself.",
      "chain": [
        "30313",
        "30284",
        "20402",
        "20024"
      ]
    },
    {
      "hadith_no": "5225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا أبو مسهر، حدثنا يحيى بن حمزة، حدثني  الزبيدي، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن ثوبان، مولى رسول الله صلى الله عليه وسلم قال قال لي رسول الله صلى الله عليه وسلم في حجة الوداع ‏\"‏ أصلح هذا اللحم ‏\"‏ ‏.‏ قال فأصلحته فلم يزل يأكل منه حتى بلغ المدينة ‏.‏  وحدثنيه عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن المبارك، حدثنا يحيى، بن حمزة بهذا الإسناد ولم يقل في حجة الوداع ‏.‏",
      "text_en": " Thauban, the freed slave of Allah's Messenger (may peace be upon him), reported:                      Allah's Messenger (may peace be upon him) said to me on the occasion of Hajjat-al-Wada' (the Farewell Pilgrimage): Make the flesh usable. So I made it usable (for him) and he ate it constantly until he reached Medina. This hadith has been narrated on the authority of Yabya b. Hamza with the same chain of transmitters, but he did not say: On the occasion of Hajjat-al-Wada'.",
      "chain": [
        "30313",
        "30284",
        "20402",
        "20459",
        "10942"
      ]
    },
    {
      "hadith_no": "6738",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنيه أبو بكر بن إسحاق، حدثنا أبو مسهر، حدثنا سعيد بن عبد العزيز، بهذا الإسناد غير أن مروان أتمهما حديثا ‏.‏",
      "text_en": "",
      "chain": [
        "30284"
      ]
    },
    {
      "hadith_no": "350",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الوليد الدمشقي، حدثنا أبو مسهر، عن سعيد بن عبد العزيز، في ‏\"‏ غسل واغتسل ‏\"‏ ‏.‏ قال قال سعيد غسل رأسه وغسل جسده ‏.‏",
      "text_en": " Explaining the  meaning of the words ghassala and ightasala (that occur in tradition 345) Sa'id (b. 'Abd al-'Aziz) said:                      One should wash one's head and body well (And not that one should make one's wife wash).",
      "chain": [
        "30174",
        "30284"
      ]
    },
    {
      "hadith_no": "706",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا كثير بن عبيد يعني المذحجي، حدثنا أبو حيوة، عن سعيد، بإسناده ومعناه زاد فقال ‏\"‏ قطع صلاتنا قطع الله أثره ‏\"‏ ‏.‏ قال أبو داود ورواه أبو مسهر عن سعيد قال فيه ‏\"‏ قطع صلاتنا ‏\"‏ ‏.‏",
      "text_en": " This tradition as also been reported by Sa’id through the same chain of narrators and to the same effect. He added:                      He cut off our prayer, may Allah cut off his walking.Abu Dawud said: This version narrated by Mushir on the authority of Sa’id has: He cut off our prayer.",
      "chain": [
        "38462",
        "30002",
        "30284",
        "11168"
      ]
    },
    {
      "hadith_no": "847",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا الوليد، ح وحدثنا محمود بن خالد، حدثنا أبو مسهر، ح وحدثنا ابن السرح، حدثنا بشر بن بكر، ح وحدثنا محمد بن مصعب، حدثنا عبد الله بن يوسف، كلهم عن سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة بن يحيى، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم كان يقول حين يقول سمع الله لمن حمده ‏\"‏ اللهم ربنا لك الحمد ملء السماء ‏\"‏ ‏.‏ قال مؤمل ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد لا مانع لما أعطيت ‏\"‏ ‏.‏ زاد محمود ‏\"‏ ولا معطي لما منعت ‏\"‏ ‏.‏ ثم اتفقوا - ‏\"‏ ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏ قال بشر ‏\"‏ ربنا لك الحمد ‏\"‏ ‏.‏ لم يقل محمود ‏\"‏ اللهم ‏\"‏ ‏.‏ قال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-Khuri said:                      When the Messenger of Allah (ﷺ) said: “ Allah listens to him who praises Him,” he also said: O Allah, our Lord, to thee be the praise in all heavens. Mu’ammil said( in his version); “ In all the heavens, and in all the earth, and in all that it pleases Thee to create afterwards. O thou Who art worthy of praise and glory, most worthy of what a servant says, and we are all thy servants, no one can withhold what thou givest or give what Thou withholdest. “The narrators then were agreed on the words: “And riches cannot avail a wealthy person with Thee.”",
      "chain": [
        "38659",
        "20733",
        "37534",
        "30284",
        "30485",
        "20413",
        "28536",
        "30355",
        "20638",
        "10877",
        "11302",
        "38"
      ]
    },
    {
      "hadith_no": "2331",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عبد الواحد، حدثنا أبو مسهر، قال كان سعيد - يعني ابن عبد العزيز - يقول سره أوله ‏.‏ قال أبو داود وقال بعضهم سره وسطه وقالوا آخره ‏.‏",
      "text_en": " Narrated Ahmad b. 'Abd al-Wahid:                     On the authority of Abu Mushir. He said: Sa'id, that is, Ibn 'Abd al-'Aziz said: The meaning of the word sirraha is \"in the beginning of it (the month)\"",
      "chain": [
        "30284",
        "20638",
        "30002"
      ]
    },
    {
      "hadith_no": "2494",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد السلام بن عتيق، حدثنا أبو مسهر، حدثنا إسماعيل بن عبد الله، - يعني ابن سماعة - حدثنا الأوزاعي، حدثني سليمان بن حبيب، عن أبي أمامة الباهلي، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ثلاثة كلهم ضامن على الله عز وجل رجل خرج غازيا في سبيل الله فهو ضامن على الله حتى يتوفاه فيدخله الجنة أو يرده بما نال من أجر وغنيمة ورجل راح إلى المسجد فهو ضامن على الله حتى يتوفاه فيدخله الجنة أو يرده بما نال من أجر وغنيمة ورجل دخل بيته بسلام فهو ضامن على الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Umamat Al Bahili reported the Apostle of Allaah(ﷺ) as saying “There are three persons who are in the security of Allaah, the Exalted.” “A man who goes out on an expedition to fight in the path of Allaah, the Exalted, is in the security of Allaah, until He takes him unto Him(i.e., he dies) and brings him into Paradise or brings him(alive) with reward and booty he obtains and a man who goes to the mosque is in the security of Allaah, until he takes him unto Him(i.e., he dies), and he brings him into Paradise or brings him with reward and spoils he obtains; and a man who enters his house after giving salutation is in the security of Allaah, the Exalted.”",
      "chain": [
        "37520",
        "30284",
        "20024",
        "11692",
        "4048"
      ]
    },
    {
      "hadith_no": "3665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمود بن خالد، حدثنا أبو مسهر، حدثني عباد بن عباد الخواص، عن يحيى بن أبي عمرو السيباني، عن عمرو بن عبد الله السيباني، عن عوف بن مالك الأشجعي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقص إلا أمير أو مأمور أو مختال ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i:                     I heard the Messenger of Allah (ﷺ) say: Only a ruler, or one put in charge, or one who is presumptuous, gives instructions.",
      "chain": [
        "37534",
        "30284",
        "20243",
        "19154",
        "18802",
        "3051"
      ]
    },
    {
      "hadith_no": "475",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو جعفر السمناني، حدثنا أبو مسهر، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن أبي الدرداء، وأبي، ذر عن رسول الله صلى الله عليه وسلم ‏\"‏ عن الله، عز وجل أنه قال ابن آدم اركع لي من أول النهار أربع ركعات أكفك آخره ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Jubair narrated from Abu Ad-Darda, or Abu Dharr, that :                     Allah's Messenger narrated that Allah, Blessed and Most High said: \"Son of Adam: Perform four Rak'ah for Me in the beginning of the day it will suffice you for the latter part of it.\"",
      "chain": [
        "30284",
        "20736",
        "11422",
        "4097",
        "37",
        "23"
      ]
    },
    {
      "hadith_no": "2317",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن نصر النيسابوري، وغير، واحد، قالوا حدثنا أبو مسهر، عن إسماعيل بن عبد الله بن سماعة، عن الأوزاعي، عن قرة، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حسن إسلام المرء تركه ما لا يعنيه ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه من حديث أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed among the excellence of a person's Islam is that he leaves what does not concern him.\"",
      "chain": [
        "30284",
        "20024",
        "11301",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال أخبرنا الحبيب الأمين، عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ فرددها ثلاث مرات فقدمنا أيدينا فبايعناه فقلنا يا رسول الله قد بايعناك فعلام قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وأسر كلمة خفية أن لا تسألوا الناس شيئا ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik Al-Ashja'i said:                      \"We were with the Messenger of Allah (ﷺ) and he said: 'Will you not pledge to the Messenger of Allah (ﷺ)?' And he repeated it three times. So we stretched forth our hands to give our pledge. We said: 'O Messenger of Allah, we are willing to give you our pledge, but on what?' He said: 'That you will worship Allah and not associate anything with him, and (offer) the five daily prayers.' And he said, very quietly: 'And you will not ask the people for anything.'\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن ابن الديلمي، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن سليمان بن داود صلى الله عليه وسلم لما بنى بيت المقدس سأل الله عز وجل خلالا ثلاثة سأل الله عز وجل حكما يصادف حكمه فأوتيه وسأل الله عز وجل ملكا لا ينبغي لأحد من بعده فأوتيه وسأل الله عز وجل حين فرغ من بناء المسجد أن لا يأتيه أحد لا ينهزه إلا الصلاة فيه أن يخرجه من خطيئته كيوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:                      \"When Sulaiman bin Dawud finished building BAir Al-Maqdis, he asked Allah for three things: Judgement that was in harmony with His judgement, and he was given that. And he asked Allah for a dominion that no one after him would have, and he was given that. And when he finished building the Masjid he asked Allah, the Mighty and Sublime, that no one should come to it, intending only to pray there, but he would emerge free of sin as the day his mother bore him.\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "5136",
        "29"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن منصور، وهارون بن محمد بن بكار بن بلال، - واللفظ له - قالا حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن يحيى بن الحارث، عن أبي الأشعث الصنعاني، عن أوس بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غسل واغتسل وغدا وابتكر ودنا من الإمام ولم يلغ كان له بكل خطوة عمل سنة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws that:                     The Prophet (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, comes early to the masjid and sits near the imam, and does not engage in idle talk, he will have for every step he takes (the reward of) a year's worth of good deeds, fasting it and praying Qiyam during it.\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "19894",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "4785",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن عبد الرحمن بن أشعث، قال حدثنا أبو مسهر، قال حدثنا إسماعيل، - وهو ابن عبد الله بن سماعة - قال أنبأنا الأوزاعي، قال أخبرني يحيى، قال حدثني أبو سلمة، قال حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل له قتيل فهو بخير النظرين إما أن يقاد وإما أن يفدى ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: 'If a person's relative is killed, he has the choice of two things: Either he may retaliate, or he may take the ransom.\"'",
      "chain": [
        "30284",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "906",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن الوليد الخلال الدمشقي، حدثنا مروان بن محمد، وأبو مسهر قالا حدثنا خالد بن يزيد بن صالح بن صبيح المري، حدثنا طلحة بن عمرو، عن عطاء، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما حسدتكم اليهود على شىء ما حسدتكم على آمين فأكثروا من قول آمين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “The Jews do not envy you for anything more than they envy youforthe Salam and (saying) Amin, so say Amin a great deal.”",
      "chain": [
        "20640",
        "30284",
        "27507",
        "23023",
        "11029",
        "17"
      ]
    }
  ],
  "total_hadiths": 17
}