{
  "id": "30289",
  "name": "Ahmed bin Ishaq bin al-Husain أحمد بن إسحاق بن الحصين",
  "full_name": "Ahmed bin Ishaq bin al-Husain أحمد بن إسحاق بن الحصين",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "242",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Bukhara"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Sarmari",
      "al-Bukhari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "22107",
      "name": "'Abdullah bin Musa عبد الله بن موسى بن إبراهيم بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "520",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن إسحاق السرماري، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال بينما رسول الله صلى الله عليه وسلم قائم يصلي عند الكعبة، وجمع قريش في مجالسهم إذ قال قائل منهم ألا تنظرون إلى هذا المرائي أيكم يقوم إلى جزور آل فلان، فيعمد إلى فرثها ودمها وسلاها فيجيء به، ثم يمهله حتى إذا سجد وضعه بين كتفيه فانبعث أشقاهم، فلما سجد رسول الله صلى الله عليه وسلم وضعه بين كتفيه، وثبت النبي صلى الله عليه وسلم ساجدا، فضحكوا حتى مال بعضهم إلى بعض من الضحك، فانطلق منطلق إلى فاطمة  عليها السلام  وهى جويرية، فأقبلت تسعى وثبت النبي صلى الله عليه وسلم ساجدا حتى ألقته عنه، وأقبلت عليهم تسبهم، فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش  ثم سمى  اللهم عليك بعمرو بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأمية بن خلف، وعقبة بن أبي معيط، وعمارة بن الوليد ‏\"‏‏.‏ قال عبد الله فوالله لقد رأيتهم صرعى يوم بدر، ثم سحبوا إلى القليب قليب بدر، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ وأتبع أصحاب القليب لعنة ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin Maimun [??]:                     `Abdullah bin Mas`ud said, \"While Allah's Apostle was praying beside the Ka`ba, there were some Quraish people sitting in a gathering. One of them said, 'Don't you see this (who does deeds just to show off)? Who amongst you can go and bring the dung, blood and the Abdominal contents (intestines, etc.) of the slaughtered camels of the family of so and so and then wait till he prostrates and put that in between his shoulders?' The most unfortunate amongst them (`Uqba bin Abi Mu'ait) went (and brought them) and when Allah's Apostle prostrated, he put them between his shoulders. The Prophet remained in prostration and they laughed so much so that they fell on each other. A passerby went to Fatima, who was a young girl in those days. She came running and the Prophet was still in prostration. She removed them and cursed upon the Quraish on their faces. When Allah's Apostle completed his prayer, he said, 'O Allah! Take revenge on Quraish.' He said so thrice and added, 'O Allah! take revenge on `Amr bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, `Uqba bin Abi Mu'ait and `Umar a bin Al-Walid.\" `Abdullah added, \"By Allah! I saw all of them dead in the battle field on the day of Badr and they were dragged and thrown in the Qalib (a well) at Badr: Allah's Apostle then said, 'Allah's curse has descended upon the people of the Qalib (well).",
      "chain": [
        "30289",
        "20340",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "3464",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، قال حدثني عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم ح وحدثني محمد، حدثنا عبد الله بن رجاء، أخبرنا همام، عن إسحاق بن عبد الله، قال أخبرني عبد الرحمن بن أبي عمرة، أن أبا هريرة  رضى الله عنه  حدثه أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أبرص وأقرع وأعمى بدا لله أن يبتليهم، فبعث إليهم ملكا، فأتى الأبرص‏.‏ فقال أى شىء أحب إليك قال لون حسن وجلد حسن، قد قذرني الناس‏.‏ قال فمسحه، فذهب عنه، فأعطي لونا حسنا وجلدا حسنا‏.‏ فقال أى المال أحب إليك قال الإبل  أو قال البقر هو شك في ذلك، إن الأبرص والأقرع، قال أحدهما الإبل، وقال الآخر البقر  فأعطي ناقة عشراء‏.‏ فقال يبارك لك فيها‏.‏ وأتى الأقرع فقال أى شىء أحب إليك قال شعر حسن، ويذهب عني هذا، قد قذرني الناس‏.‏ قال فمسحه فذهب، وأعطي شعرا حسنا‏.‏ قال فأى المال أحب إليك قال البقر‏.‏ قال فأعطاه بقرة حاملا، وقال يبارك لك فيها‏.‏ وأتى الأعمى فقال أى شىء أحب إليك قال يرد الله إلى بصري، فأبصر به الناس‏.‏ قال فمسحه، فرد الله إليه بصره‏.‏ قال فأى المال أحب إليك قال الغنم‏.‏ فأعطاه شاة والدا، فأنتج هذان، وولد هذا، فكان لهذا واد من إبل، ولهذا واد من بقر، ولهذا واد من الغنم‏.‏ ثم إنه أتى الأبرص في صورته وهيئته فقال رجل مسكين، تقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله ثم بك، أسألك بالذي أعطاك اللون الحسن والجلد الحسن والمال بعيرا أتبلغ عليه في سفري‏.‏ فقال له إن الحقوق كثيرة‏.‏ فقال له كأني أعرفك، ألم تكن أبرص يقذرك الناس فقيرا فأعطاك الله فقال لقد ورثت لكابر عن كابر‏.‏ فقال إن كنت كاذبا فصيرك الله إلى ما كنت، وأتى الأقرع في صورته وهيئته، فقال له مثل ما قال لهذا، فرد عليه مثل ما رد عليه هذا فقال إن كنت كاذبا فصيرك الله إلى ما كنت‏.‏ وأتى الأعمى في صورته فقال رجل مسكين وابن سبيل وتقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله، ثم بك أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري‏.‏ فقال قد كنت أعمى فرد الله بصري، وفقيرا فقد أغناني، فخذ ما شئت، فوالله لا أجهدك اليوم بشىء أخذته لله‏.‏ فقال أمسك مالك، فإنما ابتليتم، فقد رضي الله عنك وسخط على صاحبيك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard Allah's Apostle saying, \"Allah willed to test three Israelis who were a Leper, a blind man and a bald-headed man. So, he sent them an angel who came to the leper and said, 'What thing do you like most?' He replied, \"Good color and good skin, for the people have a strong aversion to me.' The angel touched him and his illness was cured, and he was given a good color and beautiful skin. The angel asked him, 'What kind of property do you like best?' He replied, 'Camels (or cows).' (The narrator is in doubt, for either the leper or the bald-headed man demanded camels and the other demanded cows.) So he (i.e. the leper) was given a pregnant she-camei, and the angel said (to him), 'May Allah bless you in it.' The angel then went to the bald-headed man and said, 'What thing do you like most?' He said, 'I like good hair and wish to be cured of this disease, for the people feel repulsion for me.' The angel touched him and his illness was cured, and he was given good hair. The angel asked (him), 'What kind of property do you like bests' He replied, 'Cows,' The angel gave him a pregnant cow and said, 'May Allah bless you in it.' The angel went to the blind man and asked, 'What thing do you like best?' He said, '(I like) that Allah may restore my eye-sight to me so that I may see the people.' The angel touched his eyes and Allah gave him back his eye-sight. The angel asked him, \"What kind of property do you like best?' He replied, 'Sheep.' The angel gave him a pregnant sheep. Afterwards, all the three pregnant animals gave birth to young ones, and multiplied and brought forth so much that one of the (three) men had a herd of camels filling a valley, and one had a herd of cows filling a valley, and one had a flock of sheep filling a valley. Then the angel, disguised in the shape and appearance of a leper, went to the leper and said, I am a poor man, who has lost all means of livelihood while on a journey. So none will satisfy my need except Allah and then you. In the Name of Him Who has given you such nice color and beautiful skin, and so much property, I ask you to give me a camel so that I may reach my destination. The man replied, 'I have many obligations (so I cannot give you).' The angel said, 'I think I know you; were you not a leper to whom the people had a strong aversion? Weren't you a poor man, and then Allah gave you (all this property).' He replied, '(This is all wrong), I got this property through inheritance from my fore-fathers' The angel said, 'If you are telling a lie, then let Allah make you as you were before. ' Then the angel, disguised in the shape and appearance of a bald man, went to the bald man and said to him the same as he told the first one, and he too answered the same as the first one did. The angel said, 'If you are telling a lie, then let Allah make you as you were before.' The angel, disguised in the shape of a blind man, went to the blind man and said, 'I am a poor man and a traveler, whose means of livelihood have been exhausted while on a journey. I have nobody to help me except Allah, and after Him, you yourself. I ask you in the Name of Him Who has given you back your eye-sight to give me a sheep, so that with its help, I may complete my journey' The man said, 'No doubt, I was blind and Allah gave me back my eye-sight; I was poor and Allah made me rich; so take anything you wish from my property. By Allah, I will not stop you for taking anything (you need) of my property which you may take for Allah's sake.' The angel replied, 'Keep your property with you. You (i.e 3 men) have been tested and Allah is pleased with you and is angry with your two companions.\"",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3675",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عبيد الله بن موسى، حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله بن مسعود  رضى الله عنه  قال انطلق سعد بن معاذ معتمرا  قال  فنزل على أمية بن خلف أبي صفوان، وكان أمية إذا انطلق إلى الشأم فمر بالمدينة نزل على سعد، فقال أمية لسعد انتظر حتى إذا انتصف النهار، وغفل الناس انطلقت فطفت، فبينا سعد يطوف إذا أبو جهل فقال من هذا الذي يطوف بالكعبة فقال سعد أنا سعد‏.‏ فقال أبو جهل تطوف بالكعبة آمنا، وقد آويتم محمدا وأصحابه فقال نعم‏.‏ فتلاحيا بينهما‏.‏ فقال أمية لسعد لا ترفع صوتك على أبي الحكم، فإنه سيد أهل الوادي‏.‏ ثم قال سعد والله لئن منعتني أن أطوف بالبيت لأقطعن متجرك بالشأم‏.‏ قال فجعل أمية يقول لسعد لا ترفع صوتك‏.‏ وجعل يمسكه، فغضب سعد فقال دعنا عنك، فإني سمعت محمدا صلى الله عليه وسلم يزعم أنه قاتلك‏.‏ قال إياى قال نعم‏.‏ قال والله ما يكذب محمد إذا حدث‏.‏ فرجع إلى امرأته، فقال أما تعلمين ما قال لي أخي اليثربي قالت وما قال قال زعم أنه سمع محمدا يزعم أنه قاتلي‏.‏ قالت فوالله ما يكذب محمد‏.‏ قال فلما خرجوا إلى بدر، وجاء الصريخ قالت له امرأته أما ذكرت ما قال لك أخوك اليثربي قال فأراد أن لا يخرج، فقال له أبو جهل إنك من أشراف الوادي، فسر يوما أو يومين، فسار معهم فقتله الله‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Sa`d bin Mu`adh came to Mecca with the intention of performing `Umra, and stayed at the house of Umaiya bin Khalaf Abi Safwan, for Umaiya himself used to stay at Sa`d's house when he passed by Medina on his way to Sham. Umaiya said to Sa`d, \"Will you wait till midday when the people are (at their homes), then you may go and perform the Tawaf round the Ka`ba?\" So, while Sa`d was going around the Ka`ba, Abu Jahl came and asked, \"Who is that who is performing Tawaf?\" Sa`d replied, \"I am Sa`d.\" Abu Jahl said, \"Are you circumambulating the Ka`ba safely although you have given refuge to Muhammad and his companions?\" Sa`d said, \"Yes,\" and they started quarreling. Umaiya said to Sa`d, \"Don't shout at Abi-l-Hakam (i.e. Abu Jahl), for he is chief of the valley (of Mecca).\" Sa`d then said (to Abu Jahl). 'By Allah, if you prevent me from performing the Tawaf of the Ka`ba, I will spoil your trade with Sham.\" Umaiya kept on saying to Sa`d, \"Don't raise your voice.\" and kept on taking hold of him. Sa`d became furious and said, (to Umaiya), \"Be away from me, for I have heard Muhammad saying that he will kill you.\" Umaiiya said, \"Will he kill me?\" Sa`d said, \"Yes,.\" Umaiya said, \"By Allah! When Muhammad says a thing, he never tells a lie.\" Umaiya went to his wife and said to her, \"Do you know what my brother from Yathrib (i.e. Medina) has said to me?\" She said, \"What has he said?\" He said, \"He claims that he has heard Muhammad claiming that he will kill me.\" She said, By Allah! Muhammad never tells a lie.\" So when the infidels started to proceed for Badr (Battle) and declared war (against the Muslims), his wife said to him, \"Don't you remember what your brother from Yathrib told you?\" Umaiya decided not to go but Abu Jahl said to him, \"You are from the nobles of the valley (of Mecca), so you should accompany us for a day or two.\" He went with them and thus Allah got him killed.",
      "chain": [
        "30289",
        "20340",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "4223",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عثمان بن عمر، أخبرنا شعبة، عن قتادة، عن أنس بن مالك  رضى الله عنه ‏{‏إنا فتحنا لك فتحا مبينا‏}‏ قال الحديبية‏.‏ قال أصحابه هنيئا مريئا فما لنا فأنزل الله ‏{‏ليدخل المؤمنين والمؤمنات جنات‏}‏ قال شعبة فقدمت الكوفة فحدثت بهذا كله عن قتادة ثم رجعت فذكرت له فقال أما ‏{‏إنا فتحنا لك‏}‏ فعن أنس، وأما هنيئا مريئا فعن عكرمة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     regarding Allah's Statement: \"Verily! We have granted you (O, Muhammad) Manifest victory.\" (48.1) It refers to the Al-Hudaibiya Pledge. And the companions of the Prophet said (to the Prophet), \"Congratulations and happiness for you; but what reward shall we get?\" So Allah revealed:-- \"That He may admit the believing men and women to gardens beneath which rivers flow.\" (48.5)",
      "chain": [
        "30289",
        "20262",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4893",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن إسحاق السلمي، حدثنا يعلى، حدثنا عبد العزيز بن سياه، عن حبيب بن أبي ثابت، قال أتيت أبا وائل أسأله فقال كنا بصفين فقال رجل ألم تر إلى الذين يدعون إلى كتاب الله‏.‏ فقال علي نعم‏.‏ فقال سهل بن حنيف اتهموا أنفسكم فلقد رأيتنا يوم الحديبية  يعني الصلح الذي كان بين النبي صلى الله عليه وسلم والمشركين  ولو نرى قتالا لقاتلنا، فجاء عمر فقال ألسنا على الحق وهم على الباطل أليس قتلانا في الجنة وقتلاهم في النار قال ‏\"‏ بلى ‏\"‏‏.‏ قال ففيم أعطي الدنية في ديننا، ونرجع ولما يحكم الله بيننا‏.‏ فقال ‏\"‏ يا ابن الخطاب إني رسول الله ولن يضيعني الله أبدا ‏\"‏‏.‏ فرجع متغيظا، فلم يصبر حتى جاء أبا بكر فقال يا أبا بكر ألسنا على الحق وهم على الباطل قال يا ابن الخطاب إنه رسول الله صلى الله عليه وسلم ولن يضيعه الله أبدا‏.‏ فنزلت سورة الفتح‏.‏",
      "text_en": " Narrated Habib bin Abi Thabit:                     I went to Abu Wail to ask him (about those who had rebelled against `Ali). On that Abu Wail said, \"We were at Siffin (a city on the bank of the Euphrates, the place where me battle took place between `Ali and Muawiya) A man said, \"Will you be on the side of those who are called to consult Allah's Book (to settle the dispute)?\" `Ali said, 'Yes (I agree that we should settle the matter in the light of the Qur'an).\" ' Some people objected to `Ali's agreement and wanted to fight. On that Sahl bin Hunaif said, 'Blame yourselves! I remember how, on the day of Al-Hudaibiya (i.e. the peace treaty between the Prophet and the Quraish pagans), if we had been allowed to choose fighting, we would have fought (the pagans). At that time `Umar came (to the Prophet) and said, \"Aren't we on the right (path) and they (pagans) in the wrong? Won't our killed persons go to Paradise, and theirs in the Fire?\" The Prophet replied, \"Yes.\" `Umar further said, \"Then why should we let our religion be degraded and return before Allah has settled the matter between us?\" The Prophet said, \"O the son of Al-Khattab! No doubt, I am Allah's Apostle and Allah will never neglect me.\" So `Umar left the place angrily and he was so impatient that he went to Abu Bakr and said, \"O Abu Bakr! Aren't we on the right (path) and they (pagans) on the wrong?\" Abu Bakr said, \"O the son of Al-Khattab! He is Allah's Apostle, and Allah will never neglect him.\" Then Sura Al-Fath (The Victory) was revealed.\"",
      "chain": [
        "30289",
        "20372",
        "20335",
        "11331"
      ]
    },
    {
      "hadith_no": "7599",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، سمعت عبد الرحمن بن أبي عمرة، قال سمعت أبا هريرة، قال سمعت النبي صلى الله عليه وسلم قال ‏\"‏ إن عبدا أصاب ذنبا  وربما قال أذنب ذنبا  فقال رب أذنبت  وربما قال أصبت  فاغفر لي فقال ربه أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي‏.‏ ثم مكث ما شاء الله، ثم أصاب ذنبا أو أذنب ذنبا، فقال رب أذنبت  أو أصبت  آخر فاغفره‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي، ثم مكث ما شاء الله ثم أذنب ذنبا  وربما قال أصاب ذنبا  قال قال رب أصبت  أو أذنبت  آخر فاغفره لي‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي  ثلاثا  فليعمل ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"If somebody commits a sin and then says, 'O my Lord! I have sinned, please forgive me!' and his Lord says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sins).' Then he remains without committing any sin for a while and then again commits another sin and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sin). Then he remains without Committing any another sin for a while and then commits another sin (for the third time) and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord Who forgives sins and punishes for it I therefore have forgiven My slave (his sin), he can do whatever he likes.\"",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3078",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا أحمد بن إسحاق، حدثنا همام بن يحيى، عن قتادة، عن أبي حسان، قال قيل لابن عباس إن هذا الأمر قد تفشغ بالناس من طاف بالبيت فقد حل الطواف عمرة ‏.‏ فقال سنة نبيكم صلى الله عليه وسلم وإن رغمتم ‏.‏",
      "text_en": " Abu Hassan reported:                      It was said to Ibn 'Abbas (Allah be pleased with them) that this affair had engaged the attention of the people that he who circumambu- lates the House was permitted to circumambulate for Umra (even though he was in a state of Ihram for Hajj), whereupon he said: That is the Sunnah of your Apostle (may peace be upon him), even though you may not approve of it.",
      "chain": [
        "30296",
        "30289",
        "20297",
        "11019"
      ]
    },
    {
      "hadith_no": "6610",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، حدثنا أحمد بن إسحاق، حدثنا أبو عوانة، عن مغيرة، عن عامر، عن عدي بن حاتم، قال أتيت عمر بن الخطاب فقال لي إن أول صدقة بيضت وجه رسول الله صلى الله عليه وسلم ووجوه أصحابه صدقة طيئ جئت بها إلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Adi b. Hatim reported:                      I came to Umar b. Khattab and he said to me: The first consignment of Sadaqa brought to Allah's Messenger (may peace be upon him) which brightened the face of Allah's Messenger (may peace be upon him) and the faces of his Companions was that of Tayyi.",
      "chain": [
        "30022",
        "30289",
        "20469",
        "11072",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "7381",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني زهير بن حرب، حدثنا أحمد بن إسحاق، ح وحدثني محمد بن حاتم، حدثنا  بهز، قالا جميعا حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن  النبي صلى الله عليه وسلم قال ‏\"‏ يحشر الناس على ثلاث طرائق راغبين راهبين واثنان على بعير وثلاثة على بعير وأربعة على بعير وعشرة على بعير وتحشر بقيتهم النار تبيت معهم حيث باتوا وتقيل معهم حيث قالوا وتصبح معهم حيث أصبحوا وتمسي معهم حيث أمسوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying, The people will be assembled in three categories. Those desirous (of Paradise), fearing (Hell), coming two upon the came], three upon the camel, four upon the camel, ten upon the camel and the rest will be assembled, Hell-Fire being with them when they are at midday where they would spend the night and where they would spend the morning and where they would spend the evening.",
      "chain": [
        "30022",
        "30289",
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "7420",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن إسحاق، حدثنا وهيب، حدثنا عبد، الله بن طاوس عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏ ‏.‏ وعقد وهيب بيده تسعين ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      Today the wall (barrier) of Gog and Magog has been opened so much, and WUhaib (in order to explain it) made the figure of ninety with the help of his hand.",
      "chain": [
        "30201",
        "30289",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3867",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أحمد بن إسحاق، حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم استعط ‏.‏",
      "text_en": " Ibn’Abbas said:                      The Messenger of Allah (ﷺ) snuffed medicine.",
      "chain": [
        "30203",
        "30289",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4434",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن إسحاق الأهوازي، حدثنا أبو أحمد، حدثنا بشير بن المهاجر، حدثني عبد الله بن بريدة، عن أبيه، قال كنا أصحاب رسول الله نتحدث أن الغامدية وماعز بن مالك لو رجعا بعد اعترافهما أو قال لو لم يرجعا بعد اعترافهما لم يطلبهما وإنما رجمهما عند الرابعة ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     We, the Companions of the Messenger of Allah (ﷺ), used to talk mutually: Would that al-Ghamidiyyah and Ma'iz ibn Malik had withdrawn after their confession; or he said: Had they not withdrawn after their confession, he would not have pursued them (for punishment). He had them stoned after the fourth (confession).",
      "chain": [
        "30289",
        "20355",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1827",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني أحمد بن إسحاق، قال حدثنا وهيب، قال حدثنا منصور ابن صفية، عن أمه، صفية بنت شيبة عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا هلكاكم قول لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'Prompt your dying ones to say La ilaha illahllah (there is none worthy of worship except Allah).\"'",
      "chain": [
        "38088",
        "30289",
        "20299",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "1935",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني أحمد بن إسحاق، قال حدثنا وهيب، قال حدثنا منصور بن عبد الرحمن، عن أمه، عن عائشة، قالت ذكر عند النبي صلى الله عليه وسلم هالك بسوء فقال ‏\"‏ لا تذكروا هلكاكم إلا بخير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Something bad was said in the presence of the Prophet about a person who had died. He said: 'Do not say anything but good about your dead.\"'",
      "chain": [
        "38088",
        "30289",
        "20299",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "2840",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن إسحاق الصاغاني، قال حدثنا أحمد بن إسحاق، قال حدثنا حماد بن سلمة، عن حميد، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم تزوج ميمونة وهو محرم ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That the Messenger of Allah married Maimunah when he was in Ihram.",
      "chain": [
        "30511",
        "30289",
        "20021",
        "11279",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 15
}