{
  "id": "30283",
  "name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
  "full_name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "227",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20239",
      "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20398",
      "name": "Sdqh bin Khalid al-Amwy صدقة بن خالد الأموي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34000",
      "name": "Ahmed bin Ibrahim bin Muhammad أحمد بن إبراهيم بن محمد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37544",
      "name": "Yazid bin Muhammad يزيد بن محمد بن عبد الصمد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38344",
      "name": "Abd al-Smd bin Abd عبد الصمد بن عبد الوهاب الحضرمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-2909",
      "hadith_no": "2909",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك ح وحدثنا قتيبة، عن مالك، فيما قرئ عليه عن أبي النضر، عن نافع، مولى أبي قتادة عن أبي قتادة، - رضى الله عنه - أنه كان مع رسول الله صلى الله عليه وسلم حتى إذا كان ببعض طريق مكة تخلف مع أصحاب له محرمين وهو غير محرم فرأى حمارا وحشيا فاستوى على فرسه فسأل أصحابه أن يناولوه سوطه فأبوا عليه فسألهم رمحه فأبوا عليه فأخذه ثم شد على الحمار فقتله فأكل منه بعض أصحاب النبي صلى الله عليه وسلم وأبى بعضهم فأدركوا رسول الله صلى الله عليه وسلم فسألوه عن ذلك فقال ‏\"‏ إنما هي طعمة أطعمكموها الله ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada (Allah be pleased with him) reported that while he was with the Messenger of Allah (may peace be upon him) on one of the highways of Mecca, he lagged behind him (the Holy Prophet) along with companions who were in the state of Ihram, whereas he was himself not Muhrim. He saw a wild ass. As he was mounting his horse he asked his companions to pick up for him his whip (which had dropped) but they refused to do so. He asked them to hand him over the spear, but they refused. He then himself took hold of it and chased the wild ass and killed it. Some of the Companions of the Apostle of Allah (way peace be upon him) ate (its meat), but some of them refused to do so. They overtook the Messenger of Allah (may peace be upon him) and asked him about it, and he said:                      It is a food which Allah provided you (so eat it).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30367",
        "30283",
        "11224",
        "391"
      ]
    },
    {
      "id": "sahih-muslim-6187",
      "hadith_no": "6187",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا مجاهد بن موسى، وأبو بكر بن النضر بن أبي النضر وهارون بن عبد الله جميعا عن أبي النضر، قال أبو بكر حدثنا أبو النضر، - يعني هاشم بن القاسم - حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا صلى الغداة جاء خدم المدينة بآنيتهم فيها الماء فما يؤتى بإناء إلا غمس يده فيها فربما جاءوه في الغداة الباردة فيغمس يده فيها ‏.‏",
      "text_en": " Anas b. Malik reported that when Allah's Messenger (may peace be upon him) had completed his dawn prayer, the servants of Medina came to him with utensils containing water, and no utensil was brought in which he did not dip his hand; and sometime they came in the cold dawn (and he did not feel reluctant in acceding to their request even in the cold weather) and dipped his hand in them.",
      "usc_msa_ref": "",
      "chain": [
        "30521",
        "30283",
        "20436",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 2
}