{
  "id": "30293",
  "name": "Ahmed bin Hafs bin 'Abdullah أحمد بن حفص بن عبد الله",
  "full_name": "Ahmed bin Hafs bin 'Abdullah أحمد بن حفص بن عبد الله",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "258",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  س  -  صدوق ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Nisapuri"
    ]
  },
  "parents": [
    {
      "id": "20420",
      "name": "Hafs bin 'Abdullah bin Rashid حفص بن عبد الله بن راشد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20420",
      "name": "Hafs bin 'Abdullah bin Rashid حفص بن عبد الله بن راشد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1379",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله السلمي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن عباد بن إسحاق، عن محمد بن مسلم الزهري، عن ضمرة بن عبد الله بن أنيس، عن أبيه، قال كنت في مجلس بني سلمة وأنا أصغرهم، فقالوا من يسأل لنا رسول الله صلى الله عليه وسلم عن ليلة القدر وذلك صبيحة إحدى وعشرين من رمضان ‏.‏ فخرجت فوافيت مع رسول الله صلى الله عليه وسلم صلاة المغرب ثم قمت بباب بيته فمر بي فقال ‏\"‏ ادخل ‏\"‏ ‏.‏ فدخلت فأتي بعشائه فرآني أكف عنه من قلته فلما فرغ قال ‏\"‏ ناولني نعلي ‏\"‏ ‏.‏ فقام وقمت معه فقال ‏\"‏ كأن لك حاجة ‏\"‏ ‏.‏ قلت أجل أرسلني إليك رهط من بني سلمة يسألونك عن ليلة القدر فقال ‏\"‏ كم الليلة ‏\"‏ ‏.‏ فقلت اثنتان وعشرون قال ‏\"‏ هي الليلة ‏\"‏ ‏.‏ ثم رجع فقال ‏\"‏ أو القابلة ‏\"‏ ‏.‏ يريد ليلة ثلاث وعشرين ‏.‏",
      "text_en": " Narrated Abdullah ibn Unays:                     I was present at the gathering of Banu Salamah, and I was the youngest of them.  They (the people) said: Who will ask the Messenger of Allah (ﷺ) for us about Laylat al-Qadr? That was the twenty-first of Ramadan. I went out and said the sunset prayer along with the Messenger of Allah (ﷺ). I then stood at the door of his house.  He passed by me and said: Come in. I entered (the house) and dinner was brought for him. I was prevented from taking food as it was scanty.  When he finished his dinner, he said to me: Give me my shoes. He then stood up and I also stood up with him. He said: Perhaps you have some business with me.  I said: Yes. Some people of Banu Salamah have sent me to you to ask you about Laylat al-Qadr. He asked: Which night: Is it tonight?  I said: Twenty-second.  He said: This is the very night. He then withdrew and said: Or the following night, referring to the twenty-third night.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20176",
        "12190",
        "1048"
      ]
    },
    {
      "hadith_no": "1707",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن حفص، حدثني أبي، حدثني إبراهيم بن طهمان، عن عباد بن إسحاق، عن عبد الله بن يزيد، عن أبيه، يزيد مولى المنبعث عن زيد بن خالد الجهني، أنه قال سئل رسول الله صلى الله عليه وسلم فذكر نحو حديث ربيعة ‏.‏ قال وسئل عن اللقطة فقال ‏\"‏ تعرفها حولا فإن جاء صاحبها دفعتها إليه وإلا عرفت وكاءها وعفاصها ثم أفضها في مالك فإن جاء صاحبها فادفعها إليه ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Zaid bin Khalid al-Juhani through a different chain of narrators. This version has:                      The Messenger of Allah (SWAS) was asked about a find.  He replied : Make the matter known for a year; if its owner comes, give it to him, otherwise note its string and its container and have it along with your property.  If its owner comes, deliver it to him.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "1945",
        "3625"
      ]
    },
    {
      "hadith_no": "2112",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله، حدثني أبي حفص بن عبد الله، حدثني إبراهيم بن طهمان، عن الحجاج بن الحجاج الباهلي، عن عسل، عن عطاء بن أبي رباح، عن أبي هريرة، نحو هذه القصة لم يذكر الإزار والخاتم فقال ‏\"‏ ما تحفظ من القرآن ‏\"‏ ‏.‏ قال سورة البقرة أو التي تليها ‏.‏ قال ‏\"‏ فقم فعلمها عشرين آية وهي امرأتك ‏\"‏ ‏.‏",
      "text_en": " A tradition similar to the one narrated above has also been transmitted by Abu Hurairah through a different chain of narrators. This version does not mention the lower garment and iron ring. He (the Prophet) said:                      How much do you memorize from Qur'an? He said: Surat al-Baqarah or the one that follows it. He said: Stand up and teach her twenty verses: she is your wife.",
      "chain": [
        "30293",
        "20187",
        "11581",
        "11029"
      ]
    },
    {
      "hadith_no": "3303",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله السلمي، قال حدثني أبي قال، حدثني إبراهيم، - يعني ابن طهمان - عن مطر، عن عكرمة، عن ابن عباس، ‏:‏ أن أخت، عقبة بن عامر نذرت أن تحج، ماشية وأنها لا تطيق ذلك، فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ إن الله لغني عن مشى أختك، فلتركب ولتهد بدنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The sister of Uqbah ibn Amir took a vow that she would perform hajj on foot, and she was unable to do so. The Prophet (ﷺ) said: Allah is not in need of the walking of your sister. She must ride and offer a sacrificial camel.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11023"
      ]
    },
    {
      "hadith_no": "4725",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حفص، قال حدثني أبي، حدثنا إبراهيم بن طهمان، عن سماك، بإسناده ومعنى هذا الحديث الطويل ‏.‏",
      "text_en": " The tradition mentioned above has again been transmitted by Simak through a different chain of narrators and to the same effect as this lengthy tradition.",
      "chain": [
        "30293",
        "20420",
        "20187"
      ]
    },
    {
      "hadith_no": "4727",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن موسى بن عقبة، عن محمد بن المنكدر، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ أذن لي أن أحدث عن ملك من ملائكة الله من حملة العرش إن ما بين شحمة أذنه إلى عاتقه مسيرة سبعمائة عام ‏\"‏ ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah reported the Prophet (May peace be upon him) as saying :                      I have been permitted to tell about one of Allah’s angels who bears the throne that the distance between the lobe of his ear and his shoulder is a journey of seven hundred years.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11106",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4895",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حفص، قال حدثني أبي، حدثني إبراهيم بن طهمان، عن الحجاج، عن قتادة، عن يزيد بن عبد الله، عن عياض بن حمار، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أوحى إلى أن تواضعوا حتى لا يبغي أحد على أحد ولا يفخر أحد على أحد ‏\"‏ ‏.‏",
      "text_en": " Narrated Iyad ibn Himar (al-Mujashi'i):                     The Prophet (ﷺ) said: Allah has revealed to me that you must be humble, so that no one oppresses another and boasts over another.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20381",
        "11019",
        "11318",
        "5217"
      ]
    },
    {
      "hadith_no": "409",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ بينما أيوب عليه الصلاة والسلام يغتسل عريانا خر عليه جراد من ذهب فجعل يحثي في ثوبه قال فناداه ربه عز وجل يا أيوب ألم أكن أغنيتك قال بلى يا رب ولكن لا غنى بي عن بركاتك ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'While Ayyub, peace be upon him, was bathing naked, locusts of gold landed on him and he started to collect them in his garment. Then his Lord called him (saying): \"O Ayyub, did I not make you rich?\" he said: \"Yes, O Lord, but I cannot do without Your blessing.\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "1354",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله النيسابوري، قال حدثني أبي قال، حدثني إبراهيم، - يعني ابن طهمان - عن الحجاج بن الحجاج، عن أبي الزبير، عن أبي علقمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سبح في دبر صلاة الغداة مائة تسبيحة وهلل مائة تهليلة غفرت له ذنوبه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever says the tasbih one hundred times following the morning prayer, and the tahlil one hundred times, he will be forgiven his sins even if they are like the foam of the sea.'\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11263",
        "13"
      ]
    },
    {
      "hadith_no": "1597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن مالك بن أنس، عن الزهري، عن عروة، أنه حدثه أن عائشة حدثته أن أبا بكر الصديق دخل عليها وعندها جاريتان تضربان بالدف وتغنيان ورسول الله صلى الله عليه وسلم مسجى بثوبه - وقال مرة أخرى متسج ثوبه - فكشف عن وجهه فقال ‏\"‏ دعهما يا أبا بكر إنها أيام عيد ‏\"‏ ‏.‏ وهن أيام منى ورسول الله صلى الله عليه وسلم يومئذ بالمدينة ‏.‏",
      "text_en": " It was narrated from 'Urwah that he narrated from Aishah that Abu Bakr As-Siddiq :                     Entered upon her and there were two girls with her beating the duff and singing, and the Messenger of Allah (ﷺ) was covered with his garment. He uncovered his face and said: \"Let them be there, O Abu Bakr, for these are the days of 'Eid.\" Those were the days of Mina and the Messenger of Allah (ﷺ) was in Al-Madinah on that day.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1822",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الحجاج، - وهو البصري - عن يونس، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تدعوا بالموت ولا تتمنوه فمن كان داعيا لا بد فليقل اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah said: 'Do not pray for death or wish for it. Whoever insists on praying for it let him say: Allahumma ahini ma kanatil-hayatu khairanli wa tawaffani idha kanatil-wafatu khairanli (O Allah, keep me alive so long as life is good for me, and cause me to die when death is good for me.)\"'",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، قال حدثني إبراهيم بن طهمان، عن موسى، قال حدثني أبو الزناد، عن عبد الرحمن، عن أبي هريرة، قال أمر رسول الله صلى الله عليه وسلم بصدقة مثله سواء ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah enjoined giving Sadaqah;\"and he narrated something similar.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20040",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "3564",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرني أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، قال لم يكن شىء أحب إلى رسول الله صلى الله عليه وسلم بعد النساء من الخيل ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"There was nothing dearer to the Messenger of Allah after women than horses.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3689",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم، عن سعيد بن أبي عروبة، عن عامر الأحول، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يرجع أحد في هبته إلا والد من ولده والعائد في هبته كالعائد في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                      \"The Messenger of Allah said: 'No one should take back his gift except a father (taking back a gift) from his son. The one who takes back his gift is like one who goes back to his vomit.'\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11073",
        "10693",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3854",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن يحيى بن سعيد، عن حميد الطويل، عن أنس بن مالك، قال أتى رسول الله صلى الله عليه وسلم على رجل يهادى بين ابنيه فقال ‏\"‏ ما شأن هذا ‏\"‏ ‏.‏ فقيل نذر أن يمشي إلى الكعبة ‏.‏ فقال ‏\"‏ إن الله لا يصنع بتعذيب هذا نفسه شيئا ‏\"‏ ‏.‏ فأمره أن يركب ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah came to a man who was being supported by two others and said: 'What is the matter with him?' It was said: 'He vowed to walk to the Ka'bah.' He said: 'Allah does not benefit from his torturing himself.' And he told him to ride.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11062",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3941",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، قال لم يكن شىء أحب إلى رسول الله صلى الله عليه وسلم بعد النساء من الخيل ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"Nothing was dearer to the Messenger of Allah after women than horses.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3994",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الأعمش، عن شقيق، ثم ذكر كلمة معناها عن عمرو بن شرحبيل، عن عبد الله، قال أول ما يقضى بين الناس يوم القيامة في الدماء ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11060",
        "11644",
        "16"
      ]
    },
    {
      "hadith_no": "4219",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، - هو ابن طهمان - عن الحجاج بن الحجاج، عن قتادة، عن عكرمة، عن ابن عباس، قال عق رسول الله صلى الله عليه وسلم عن الحسن والحسين رضى الله عنهما بكبشين كبشين ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah offered an 'Aqiqah for Al-Hasan and Al-Husain, may Allah be please with them, two rams for each.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4452",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله النيسابوري، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن عمر بن سعيد، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أطيب ما أكل الرجل من كسبه وإن ولده من كسبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'The best (most pure) food that a man eats is that which he has earned himself and his child (and his child's wealth) is part of hiss earning.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "10652",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4645",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن يحيى بن سعيد، عن عمرو بن شعيب، عن عبد الله بن أبي نجيح، عن مجاهد، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن بيع المغانم حتى تقسم وعن الحبالى أن يوطأن حتى يضعن ما في بطونهن وعن لحم كل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah forbade selling something from the spoils of war prior to its distribution, having intercourse with a pregnant woman until she gives birth, and (eating) the flesh of any predator that has fangs.",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11062",
        "19934",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "4743",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة أم المؤمنين، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لا يحل قتل مسلم إلا في إحدى ثلاث خصال زان محصن فيرجم ورجل يقتل مسلما متعمدا ورجل يخرج من الإسلام فيحارب الله عز وجل ورسوله فيقتل أو يصلب أو ينفى من الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah, the Mother of the Believers, that the Messenger of Allah said:                     \"It is not permissible to kill a Muslim except in one of three cases: A adulterer who has been married, who is to be stoned; a man who kills a Muslim deliberately; and a man who leaves Islam and wages war against Allah, the Mighty and Sublime, and His Messenger, who is to be killed, crucified or banished from the land.\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11257",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "4746",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الحجاج بن الحجاج، عن قتادة، عن أبي حسان الأعرج، عن الأشتر، أنه قال لعلي إن الناس قد تفشغ بهم ما يسمعون فإن كان رسول الله صلى الله عليه وسلم عهد إليك عهدا فحدثنا به ‏.‏ قال ما عهد إلى رسول الله صلى الله عليه وسلم عهدا لم يعهده إلى الناس غير أن في قراب سيفي صحيفة فإذا فيها ‏\"‏ المؤمنون تتكافأ دماؤهم يسعى بذمتهم أدناهم لا يقتل مؤمن بكافر ولا ذو عهد في عهده ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrataed from Al-Ashtar that he said to 'Ali:                     \"What the people have been hearing from you has become widespread. If the Messenger of Allah told you anything, then tell us,\" He said: \"The Messenger of Allah did not tell me anything that he did not tell the people, except that in the sheath of my sword there is a sheet, in which it says: 'The lives of the believers are equal in value, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect.\"' It is an abridgement of it.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11019",
        "10730",
        "11041"
      ]
    },
    {
      "hadith_no": "5186",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثنا أبي قال، حدثنا إبراهيم، عن الحجاج، - هو ابن الحجاج - عن قتادة، عن عبد الملك بن عبيد، عن بشير بن نهيك، عن أبي هريرة، قال نهاني رسول الله صلى الله عليه وسلم عن تختم الذهب ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] forbade me to wear gold rings.\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11019",
        "18661",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "5274",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الحجاج، - وهو ابن الحجاج - عن قتادة، عن عبد الملك بن عبيد، عن بشير بن نهيك، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن تختم الذهب ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     The Messenger of Allah [SAW] forbade gold rings.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11019",
        "18661",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "5427",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رأى عيسى ابن مريم عليه السلام رجلا يسرق فقال له أسرقت قال لا والله الذي لا إله إلا هو ‏.‏ قال عيسى عليه السلام آمنت بالله وكذبت بصري ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Isa bin Mariam, peace be upon him, saw a man stealing, and said to him: Are you stealing? He said: No, by Allah besides Whom there is no other God! 'Isa, peace be upon him, said: I believe in Allah and I disbelieve my eyes.'\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "5505",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن موسى بن عقبة، أخبرني أبو الزناد، عن عبد الرحمن بن هرمز الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعوذ بالله من عذاب جهنم وأعوذ بالله من عذاب القبر وأعوذ بالله من شر المسيح الدجال وأعوذ بالله من شر فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: \"A'udhu billahi min 'adhabi jahannama, wa a'udhu billahi min 'adhabil-qabri, wa a'udhu billahi min sharril-masihid-dajjali, wa a'udhu billahi min sharri fitnatil-mahya wal-mamat (I seek refuge with Allah from the torment of Hell, and I seek refuge with Allah from the torment of the grave, and I seek refuge with Allah from the evil of the Dajjal, and I seek refuge with Allah from the evil of the trials of life and death.)'\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11106",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5519",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم، عن سفيان بن سعيد، عن أبي حسان، عن جسرة، عن عائشة، أنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم رب جبرائيل وميكائيل ورب إسرافيل أعوذ بك من حر النار ومن عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] said: 'Allahumma, rabba jibra'ila, wa mika'ila wa rabba israfila, a'udhu bika min harrin-nari wa (min) 'adhabil-qabr (O Allah, Lord of Jibra'il and Mika'il and Lord of Israfil, I seek refuge in You from the heat of the Fire and (from) the torment of the grave.)'\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "20012",
        "53"
      ]
    },
    {
      "hadith_no": "5553",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، - هو ابن طهمان - عن عمر بن سعيد، عن سليمان، عن مالك بن الحارث، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم أن يخلط التمر والزبيب وأن يخلط الزهو والتمر والزهو والبسر‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] forbade mixing dried dates and raisins, and mixing Az-Zahuw and dried dates, and Az-Zahuw and Al-Busr.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "10652",
        "11005",
        "11041",
        "38"
      ]
    }
  ],
  "total_hadiths": 28
}