{
  "id": "30292",
  "name": "Ahmed bin al-Hasan bin Junaydab أحمد بن الحسن بن جنيدب",
  "full_name": "Ahmed bin al-Hasan bin Junaydab أحمد بن الحسن بن جنيدب",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Tirmidh"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  ت  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Tirmidhi",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "24069",
      "name": "Hjaj bin Nsyr حجاج بن نصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30411",
      "name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4513",
      "hadith_no": "4513",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن الحسن، حدثنا أحمد بن محمد بن حنبل بن هلال، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة‏.‏",
      "text_en": " Narrated Buraida:                     That he fought sixteen Ghazawat with Allah''s Apostle.",
      "usc_msa_ref": "749",
      "chain": [
        "30292",
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-195",
      "hadith_no": "195",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا المعلى بن أسد، حدثنا عبد المنعم، هو صاحب السقاء قال حدثنا يحيى بن مسلم، عن الحسن، وعطاء، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال لبلال ‏\"‏ يا بلال إذا أذنت فترسل في أذانك وإذا أقمت فاحدر واجعل بين أذانك وإقامتك قدر ما يفرغ الآكل من أكله والشارب من شربه والمعتصر إذا دخل لقضاء حاجته ولا تقوموا حتى تروني ‏\"‏ ‏.‏",
      "text_en": " Jabir [bin Abdullah] narrated:                     \"Allah's Messenger said to Bilal: \"O Bilal! When you call the Adhan then do so deliberately and slowly, and when you call the Iqamah then be quick. Allow enough time between your Adhan and Iqamah for the person eating to finish what he is eating, the person drinking to finish what he is drinking, and the one who needs time to relive himself, and do not stand until you see me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "24282",
        "14419",
        "11016",
        "11029",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-502",
      "hadith_no": "502",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "سمعت أحمد بن الحسن، يقول كنا عند أحمد بن حنبل فذكروا على من تجب الجمعة فلم يذكر أحمد فيه عن النبي صلى الله عليه وسلم شيئا ‏.‏ قال أحمد بن الحسن فقلت لأحمد بن حنبل فيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ فقال أحمد عن النبي صلى الله عليه وسلم قلت نعم ‏.‏ قال أحمد بن الحسن حدثنا حجاج بن نصير حدثنا معارك بن عباد عن عبد الله بن سعيد المقبري عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ الجمعة على من آواه الليل إلى أهله ‏\"‏ ‏.‏ قال فغضب على أحمد بن حنبل وقال لي استغفر ربك استغفر ربك ‏.‏ قال أبو عيسى إنما فعل أحمد بن حنبل هذا لأنه لم يعد هذا الحديث شيئا وضعفه لحال إسناده ‏.‏",
      "text_en": " Narrator not mentioned:                     I heard Ahmad bin Husain saying: \"We were with Ahmad bin Hanbal, so they mentioned the one upon whom the Friday prayer is obligatory. Ahmad did not mention anything about it from the Prophet.\" Ahmad bin Al-Hasan said: \"I said to Ahmad bin Hanbal: 'There is something about it from Abu Hurairah, from the Prophet.' So Ahmad bin Hanbal said: 'From the Prophet?' I said: 'Yes.'\" [Ahmed bin Hanbal said:] \"Hajjaj bin Nusair narrated to us; Mubarik bin Abbad narrated to us from Abdullah bin Sa'eed Al-Maqburi, from his father, from Abu Hurairah that the Prophet said: \"The Friday prayer is required from whomever can return to his family by the night.\" He said: \"So Ahmad [bin Hanbal] became angry with me, and he said to me: 'Seek forgiveness from your Lord, seek forgiveness from your Lord.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30292"
      ]
    },
    {
      "id": "jami-al-tirmidhi-640",
      "hadith_no": "640",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا سعيد بن أبي مريم، حدثنا ابن وهب، حدثني يونس، عن ابن شهاب، عن سالم، عن أبيه، عن رسول الله صلى الله عليه وسلم أنه سن فيما سقت السماء والعيون أو كان عثريا العشر وفيما سقي بالنضح نصف العشر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Salim narrated from his father that :                     the Messenger of Allah instituted the Ushr of what was watered by the heavens and steams, or through natural channels, and half of the Ushr for what is watered by irrigation.",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "30232",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-980",
      "hadith_no": "980",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن الحسن، قال حدثنا مسلم بن إبراهيم، قال حدثنا حسام بن المصك، قال حدثنا أبو معشر، عن إبراهيم، عن علقمة، قال سمعت عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن نفس المؤمن تخرج رشحا ولا أحب موتا كموت الحمار ‏\"‏ ‏.‏ قيل وما موت الحمار قال ‏\"‏ موت الفجأة ‏\"‏ ‏.‏",
      "text_en": " [Alqamah narrated:                     \"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20285",
        "10765",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1477",
      "hadith_no": "1477",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، قال نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) prohibited (eating) every predator possessing canine teeth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2150",
      "hadith_no": "2150",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش البغدادي، حدثنا حبان بن هلال، حدثنا مبارك بن فضالة، حدثني عبد ربه بن سعيد، عن محمد بن المنكدر، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من أحبكم إلى وأقربكم مني مجلسا يوم القيامة أحاسنكم أخلاقا وإن أبغضكم إلى وأبعدكم مني مجلسا يوم القيامة الثرثارون والمتشدقون والمتفيهقون ‏\"‏ ‏.‏ قالوا يا رسول الله قد علمنا الثرثارون والمتشدقون فما المتفيهقون قال ‏\"‏ المتكبرون ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة ‏.‏ وهذا حديث حسن غريب من هذا الوجه ‏.‏ وروى بعضهم هذا الحديث عن المبارك بن فضالة عن محمد بن المنكدر عن جابر عن النبي صلى الله عليه وسلم ولم يذكر فيه عن عبد ربه بن سعيد وهذا أصح ‏.‏ والثرثار هو الكثير الكلام والمتشدق الذي يتطاول على الناس في الكلام ويبذو عليهم ‏.‏",
      "text_en": " Jabir narrated that the Messenger of Allah said:                     \"Indeed the most beloved among you to me, and the nearest to sit with me on the Day of Judgment is the best of you in character. And indeed, the most disliked among you to me, and the one sitting furthest from me on the Day of Judgement are the Thartharun, and the Mutashaddiqun and the Muthafaihiqun.\" They said: \"O Messenger of Allah! We know about the Thartharun, and the Mutashaddiqun, but what about the Muthafaihiqun?\"' He said:\"The arrogant.\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20218",
        "14352",
        "11191",
        "11048",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2203",
      "hadith_no": "2203",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش البغدادي، حدثنا أحمد بن إسحاق الحضرمي، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان شيء سابق القدر لسبقته العين وإذا استغسلتم فاغسلوا ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن عمرو ‏.‏ وهذا حديث حسن صحيح غريب ‏.‏ وحديث حية بن حابس حديث غريب ‏.‏ وروى شيبان عن يحيى بن أبي كثير عن حية بن حابس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وعلي بن المبارك وحرب بن شداد لا يذكران فيه عن أبي هريرة ‏.‏",
      "text_en": " \" Ibn 'Abbas narrated  that  the Messenger of Allah (s.a.w) said:                     \"If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20528",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2465",
      "hadith_no": "2465",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك، نحوه وقال ابن أبي عمرة ‏.‏ قال هذا حديث حسن ‏.‏ وأكثر الناس يقولون عبد الرحمن بن أبي عمرة واختلفوا على مالك في رواية هذا الحديث فروى بعضهم عن أبي عمرة وروى بعضهم عن ابن أبي عمرة وهو عبد الرحمن بن أبي عمرة الأنصاري وهذا أصح لأنه قد روي من غير حديث مالك عن عبد الرحمن بن أبي عمرة عن زيد بن خالد وقد روي عن ابن أبي عمرة عن زيد بن خالد غير هذا الحديث وهو حديث صحيح أيضا وأبو عمرة مولى زيد بن خالد الجهني وله حديث الغلول وأكثر الناس يقولون عبد الرحمن بن أبي عمرة ‏.‏",
      "text_en": " (Another chain) from Malik in which he said:                     Ibn Abi 'Amrah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20164",
        "20001"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3561-2",
      "hadith_no": "3561",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن نافع الصائغ، قراءة عليه عن حماد بن أبي حميد، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أن النبي صلى الله عليه وسلم بعث بعثا قبل نجد فغنموا غنائم كثيرة وأسرعوا الرجعة فقال رجل ممن لم يخرج ما رأينا بعثا أسرع رجعة ولا أفضل غنيمة من هذا البعث ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا أدلكم على قوم أفضل غنيمة وأسرع رجعة قوم شهدوا صلاة الصبح ثم جلسوا يذكرون الله حتى طلعت عليهم الشمس فأولئك أسرع رجعة وأفضل غنيمة ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وحماد بن أبي حميد هو أبو إبراهيم الأنصاري المزني وهو محمد بن أبي حميد المدني وهو ضعيف في الحديث ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated:                     That the Prophet sent an expedition in the direction of Najd. They gained many spoils of war and returned quickly. A man among those who did not go out said: “We have not seen an expedition quicker in return or greater in spoils than this expedition.” So the Messenger of Allah said: “Should I not direct you to a group greater in spoils and quicker in return? A group who attended Salat As-Subh, then sat remembering Allah until the sun rose, for these are quicker in return and greater in spoils.”",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3568-2",
      "hadith_no": "3568",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا أصبغ بن الفرج، أخبرني عبد الله بن وهب، عن عمرو بن الحارث، أنه أخبره عن سعيد بن أبي هلال، عن خزيمة، عن عائشة بنت سعد بن أبي وقاص، عن أبيها، أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى أو قال حصى تسبح به فقال ‏\"‏ ألا أخبرك بما هو أيسر عليك من هذا أو أفضل سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض وسبحان الله عدد ما بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ولا حول ولا قوة إلا بالله مثل ذلك ‏\"‏ ‏.‏ قال وهذا حديث حسن غريب من حديث سعد ‏.‏",
      "text_en": " Aishah bint Sa’d bin Abi Waqqas narrated from her father,:                     that he entered with the Messenger of Allah upon a women, before here was a date-seed – or he said – stone – that she would make Tasbih with. So he said: “Should I not inform you of what is easier for you then this, and better? Glory to Allah according to the number of what He created in the ski, and glory to Allah according to the number of what He created in the earth, and glory to Allah according to the number of what is between that, and glory to Allah according to the number of what He is going to create, and Allah is great, in similar amount to that, and all praise is due to Allah, in similar amount to that, and there is no might or power except by Allah, in similar amount to that (Subhan Allahi Adada Ma Khalaqa Fis-Sama Wa Subhan Allahi Adada Ma Khalaqa Fil-Ard, Wa Subhan allahi Adada Ma Baina Dhalik, Wa Subhan Allahi Adada Ma Huwa Khalaq, Wa Allahi Akbbaru Mithla Dhalik, Wa La Hawla Wa La Quwwata Illa Billahi Mithla Dhalik).”",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "30228",
        "20029",
        "20377",
        "11169",
        "10559",
        "9"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3570-2",
      "hadith_no": "3570",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا الوليد بن مسلم، حدثنا ابن جريج، عن عطاء بن أبي رباح، وعكرمة، مولى ابن عباس عن ابن عباس، أنه قال بينما نحن عند رسول الله صلى الله عليه وسلم إذ جاءه علي بن أبي طالب فقال بأبي أنت وأمي تفلت هذا القرآن من صدري فما أجدني أقدر عليه ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا الحسن أفلا أعلمك كلمات ينفعك الله بهن وينفع بهن من علمته ويثبت ما تعلمت في صدرك ‏\"‏ ‏.‏ قال أجل يا رسول الله فعلمني ‏.‏ قال ‏\"‏ إذا كان ليلة الجمعة فإن استطعت أن تقوم في ثلث الليل الآخر فإنها ساعة مشهودة والدعاء فيها مستجاب وقد قال أخي يعقوب لبنيه ‏:‏ ‏(‏سوف أستغفر لكم ربي ‏)‏ يقول حتى تأتي ليلة الجمعة فإن لم تستطع فقم في وسطها فإن لم تستطع فقم في أولها فصل أربع ركعات تقرأ في الركعة الأولى بفاتحة الكتاب وسورة يس وفي الركعة الثانية بفاتحة الكتاب و‏(‏ حم ‏)‏ الدخان وفي الركعة الثالثة بفاتحة الكتاب والم تنزيل السجدة وفي الركعة الرابعة بفاتحة الكتاب وتبارك المفصل فإذا فرغت من التشهد فاحمد الله وأحسن الثناء على الله وصل على وأحسن وعلى سائر النبيين واستغفر للمؤمنين والمؤمنات ولإخوانك الذين سبقوك بالإيمان ثم قل في آخر ذلك اللهم ارحمني بترك المعاصي أبدا ما أبقيتني وارحمني أن أتكلف ما لا يعنيني وارزقني حسن النظر فيما يرضيك عني اللهم بديع السموات والأرض ذا الجلال والإكرام والعزة التي لا ترام أسألك يا الله يا رحمن بجلالك ونور وجهك أن تلزم قلبي حفظ كتابك كما علمتني وارزقني أن أتلوه على النحو الذي يرضيك عني اللهم بديع السموات والأرض ذا الجلال والإكرام والعزة التي لا ترام أسألك يا الله يا رحمن بجلالك ونور وجهك أن تنور بكتابك بصري وأن تطلق به لساني وأن تفرج به عن قلبي وأن تشرح به صدري وأن تغسل به بدني لأنه لا يعينني على الحق غيرك ولا يؤتيه إلا أنت ولا حول ولا قوة إلا بالله العلي العظيم يا أبا الحسن تفعل ذلك ثلاث جمع أو خمس أو سبع تجاب بإذن الله والذي بعثني بالحق ما أخطأ مؤمنا قط ‏\"‏ ‏.‏ قال عبد الله بن عباس فوالله ما لبث علي إلا خمسا أو سبعا حتى جاء علي رسول الله صلى الله عليه وسلم في مثل ذلك المجلس فقال يا رسول الله إني كنت فيما خلا لا آخذ إلا أربع آيات أو نحوهن وإذا قرأتهن على نفسي تفلتن وأنا أتعلم اليوم أربعين آية أو نحوها وإذا قرأتها على نفسي فكأنما كتاب الله بين عينى ولقد كنت أسمع الحديث فإذا رددته تفلت وأنا اليوم أسمع الأحاديث فإذا تحدثت بها لم أخرم منها حرفا ‏.‏ فقال له رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ مؤمن ورب الكعبة يا أبا الحسن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الوليد بن مسلم ‏.‏",
      "text_en": " Ikrimah, the freed slave of Ibn Abbas, narrated that:                     Ibn Abbas said: “We were with the Messenger of Allah (S) when Ali bin Abi Talib came to him, and he said: ‘May my father and mother be ransomed for you! This Quran has suddenly left my heart, and I do not find myself capable of it.’ So the Messenger of Allah (A) said to him: ‘O Abul-Hasan! Should I not teach you words that Allah shall benefit you with, and benefit whomever you teach, and they will make whatever you have learned in your chest firm?’ He said: ‘Of course, O Messenger of Allah (S), so teach me.’ He said: ‘When it is the night of (before) Friday, then if you are able to stand in the last third of the night, then verily it is a witnessed hour, and supplication is answered in it. And my brother Ya’qub (AS) did say to his sons: I shall seek forgiveness for you from my Lord. He said: “Until the night of Friday comes.” So if you are not able, then stand in the middle of it, and if you are not able then stand in the first of it. And pray four Rak’ah. Recite  Fatihatul-Kitab (the Opening of the Book) and Surat Ya-Sin in the first Rakah, and Fatihatul-Kitab and Ha-Min Ad-Dukhan in the second Rakah, and Fatihatul-Kitab and Alif Lam Mim Tanzil As-Sajdah in the third Rakah, and Fatihatul-Kitab and Tabarak Al-Mufassal in the fourth Rakah. So when you have finished with the Tasha-hud, then praise Allah and mention Allah’s greatness in an excellent manner, and send Salat upon me - and be excellent in it - and upon the rest of the Prophet. And seek forgiveness for the believing women, and for your brothers who have preceded you in faith. Then say in the end of that: “O Allah, have mercy on me by abandonment of sins forever, so long as You keep me remaining. And have mercy on me from taking upon myself what does not concern me, and provide me good sight for what will make You pleased with me. O Allah, Originator of the heavens and the earth, Possessor of glory, and generosity, and honor that is not exceeded. I ask you, O Allah, O Rahman, by Your glory and the light of Your Face, to make my heart constant in remembering Your Book as You taught me, and grant me that I recite it in the manner that will make You pleased with me. O Allah, Originator of the heavens and the earth, Possessor of glory, and generosity, and honor that is not exceeded. I ask you, O Allah, O Rahman, by Your glory and the light of Your Face, to enlighten me sight with Your Book, and make my tongue free with it, and to relieve my heart with it, and to expand my chest with it, and to wash my body with it. For indeed, none aids me upon the truth other than You, and none gives it except You, and there is no might or power except by Allah, the High, the Magnificent. (Allahummarhamni Bitarkil-Ma’asi Abadan Ma Abqaitani, Warhamni An Atakallafa Ma La Ya’nini, Warzuqni Husnan-Nazari Fi Ma Yurdika Anni. Allahumma Badi’as Samawati Wal-Ardi Dhal-Jalali Wal-Ikrami Wal-Izzatil-lat La Turamu As’aluka Ya Allahu Ya Rahmanu Bi-Jalalika Wa Nuri Wajhika An Tulzima Qalbi Hifza Kitabika Kama Allamtani Warzuqni An Atluwahu Alan-Nahwil-ladhi Yurdika Anni. Allahumma Badi’as Samawati Wal Ardi Dhal-Jalali Wal-Ikrami Wal Izzati-llahi La Turamu As’aluka Ya Allahu, Ya Rahmanu Bi-Jalalika Wa Nuri Wajhika An Tunawwira Bi-Kitabika Basari, Wa An Tufarrija Bihi Sadri, Wa An Taghsila Bihi Badani, Fa’innahu La Yu’inuni Alal-Haqqi Ghairuka Wa La Yu’tihi Illa Anta Wa La Hawla Wa La Quwwata Illa Billahil-Alil-Azim).” O Abul-Hasan! So do this three Fridays, or five, or seven, you will be answered - by the will of Allah - by the One Who sent me with the Truth, it has not failed a believer once.’”Abdullah bin abbas said: “So, by Allah, ali did not wait but five or seven until [Ali] came to the Messenger of Allah in a gathering similar to that and said: ‘O Messenger of Allah, indeed I was [a man] in the time that passed, who used to not take except four Ayat or about that much, so when I would recite them to myself they would suddenly depart from me, and today I learn forty Ayat or about that much, and when I recite them to myself, then it is as if the Book of Allah is before my eyes. I used to hear a Hadith and when I would repeat it, it would suddenly depart from me, and today I hear Ahadith, and when I report them, I do not err in a single letter.’ So the Messenger of Allah said at that point: ‘A believer, by the Lord of the Ka’bah, O Abul-Hasan.’”",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "30587",
        "20733",
        "11070",
        "11029",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4021",
      "hadith_no": "4021",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن أبي النضر، عن عبيد بن حنين، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم جلس على المنبر قال ‏\"‏ إن عبدا خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عنده فاختار ما عنده ‏\"‏ ‏.‏ فقال أبو بكر فديناك يا رسول الله بآبائنا وأمهاتنا ‏.‏ قال فعجبنا فقال الناس انظروا إلى هذا الشيخ يخبر رسول الله عن عبد خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عند الله وهو يقول فديناك بآبائنا وأمهاتنا ‏.‏ قال فكان رسول الله هو المخير وكان أبو بكر هو أعلمنا به فقال النبي صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبو بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن أخوة الإسلام لا تبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"The Messenger of Allah (ﷺ) sat upon the Minbar and said: 'Indeed a worshiper has been given a choice by Allah, between Him giving him from the bounty of this life as much as he wishes, and between what is with Him. So he chose what is with Him.' So Abu Bakr said: 'We will ransom our fathers and mothers for you O Messenger of Allah!'\" He said: \"So we were amazed. Then the people said: 'Look at this old man. The Messenger of Allah (ﷺ) informs about a worshiper whom Allah gave the choice, between Him giving him from the bounty of this life as much as he wishes, and between that which is with Allah, and he says: 'We will ransom our fathers and mothers for you?' But the Messenger of Allah (ﷺ) was the one given the choice, and Abu Bakr was the most knowledgeable of it among them. So the Prophet (ﷺ) said: 'From those who were most beneficial to me among the people in their companionship and their wealth was Abu Bakr. And if I were to take a Khalil, I would would have taken Abu Bakr as a Khalil. But rather, the brotherhood of Islam. Let there not remain a door in the Masjid except the door of Abu Bakr.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4186",
      "hadith_no": "4186",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم بعث بعثا وأمر عليهم أسامة بن زيد فطعن الناس في إمارته فقال النبي صلى الله عليه وسلم ‏\"‏ إن تطعنوا في إمارته فقد كنتم تطعنون في إمرة أبيه من قبل وايم الله إن كان لخليقا للإمارة وإن كان من أحب الناس إلى وإن هذا من أحب الناس إلى بعده ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) sent and army and put Usamah bin Zaid in charge of them. So the people contested his leadership, so the Prophet (ﷺ) said: 'If you contest his leadership, then you did contest the leadership of his father before him. And indeed, by Allah, he was certainly fit for leadership, and he was of the most beloved of people to me, and this one is among the most beloved of people to me after him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4190",
      "hadith_no": "4190",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عمر بن أبي سلمة بن عبد الرحمن، عن أبيه، أخبرني أسامة بن زيد، قال كنت جالسا عند النبي صلى الله عليه وسلم إذ جاء علي والعباس يستأذنان فقالا يا أسامة استأذن لنا على رسول الله صلى الله عليه وسلم ‏.‏ فقلت يا رسول الله علي والعباس يستأذنان ‏.‏ فقال ‏\"‏ أتدري ما جاء بهما ‏\"‏ ‏.‏ قلت لا أدري ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لكني أدري ‏\"‏ ‏.‏ فأذن لهما فدخلا فقالا يا رسول الله جئناك نسألك أى أهلك أحب إليك قال ‏\"‏ فاطمة بنت محمد ‏\"‏ ‏.‏ فقالا ما جئناك نسألك عن أهلك ‏.‏ قال ‏\"‏ أحب أهلي إلى من قد أنعم الله عليه وأنعمت عليه أسامة بن زيد ‏\"‏ ‏.‏ قالا ثم من قال ‏\"‏ ثم علي بن أبي طالب ‏\"‏ ‏.‏ قال العباس يا رسول الله جعلت عمك آخرهم قال ‏\"‏ لأن عليا قد سبقك بالهجرة ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وكان شعبة يضعف عمر بن أبي سلمة ‏.‏",
      "text_en": " Narrated Usamah bin Zaid:                     \"I was sitting [with the Prophet (ﷺ)] when 'Ali and Al-'Abbas came seeking permission to enter. They said: 'O Usamah, seek permission for us from the Messenger of Allah (ﷺ).' So I said: 'O Messenger of Allah, 'Ali and Al-'Abbas seek permission to enter.' He said: 'Do you know what has brought them?' I said: 'No [I do not know].' So the Prophet (ﷺ) said: 'But I know, grant them permission.' So they entered and said: 'O Messenger of Allah, we have come to you, to ask you which of your family is most beloved to you.' He said: 'Fatimah bint Muhammad.' So they said: 'We did not come to ask you about (immediate) family.' He said: 'The most beloved of my family to me is the one whom Allah favored and I favored, Usamah bin Zaid.' They said: 'Then who?' He said: 'Then 'Ali bin Abi Talib.' Al-'Abbas said: 'O Messenger of Allah, you have made your uncle the last of them.' He said: 'Indeed, 'Ali has preceded you in emigration.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20040",
        "20469",
        "50"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4281",
      "hadith_no": "4281",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا سليمان بن داود الهاشمي، حدثنا إبراهيم بن سعد، حدثني صالح بن كيسان، عن الزهري، عن محمد بن أبي سفيان، عن يوسف بن الحكم، عن محمد بن سعد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد هوان قريش أهانه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Sa'd:                     that the Messenger of Allah (ﷺ) said: \"Whoever wishes to humiliate the Quraish then Allah will humiliate him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "30584",
        "20150",
        "11176",
        "11013",
        "30008"
      ]
    }
  ],
  "total_hadiths": 16
}