{
  "id": "30297",
  "name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
  "full_name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "259",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  د  م  س  ق  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34251",
      "name": "Muhammad bin Yahya bin 'Abdul Karim محمد بن يحيى بن عبد الكريم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1636",
      "hadith_no": "1636",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، أخبرنا ورقاء، أخبرنا زيد بن أسلم، عن أبيه، قال رأيت عمر بن الخطاب  رضى الله عنه  قبل الحجر وقال لولا أني رأيت رسول الله صلى الله عليه وسلم قبلك ما قبلتك‏.‏",
      "text_en": " Narrated Zaid bin Aslam that his father said:                     \"I saw `Umar bin Al-Khattab kissing the Black Stone and he then said, (to it) 'Had I not seen Allah's Apostle kissing you, (stone) I would not have kissed you.' \"",
      "usc_msa_ref": "679",
      "chain": [
        "30297",
        "20472",
        "20363",
        "11163",
        "11416"
      ]
    },
    {
      "id": "sahih-muslim-6176",
      "hadith_no": "6176",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا زهير بن حرب، ومحمد بن المثنى، وأحمد بن سنان، قال زهير حدثنا  عبد الرحمن بن مهدي، عن شعبة، عن قتادة، قال سمعت عبد الله بن أبي عتبة، يقول سمعت  أبا سعيد الخدري، يقول كان رسول الله صلى الله عليه وسلم أشد حياء من العذراء في خدرها وكان إذا كره شيئا عرفناه في وجهه ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that Allah's Messenger (may peace be upon him) was more modest than the virgin behind the curtain (or in the apartment), and when he disliked anything, we recognised that from his face.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "30297",
        "20321",
        "20033",
        "20020",
        "11019",
        "11598",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-299",
      "hadith_no": "299",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سنان القطان الواسطي، حدثنا يزيد، عن أيوب بن أبي مسكين، عن الحجاج، عن أم كلثوم، عن عائشة، في المستحاضة تغتسل - تعني مرة واحدة - ثم توضأ إلى أيام أقرائها ‏.‏",
      "text_en": " 'Aishah said about the woman who has a prolonged flow of blood:                      She should take bath, i.e. only once; then she should perform ablution until he next menstrual period.",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "20381",
        "10500"
      ]
    },
    {
      "id": "sunan-abi-daud-300",
      "hadith_no": "300",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سنان القطان الواسطي، حدثنا يزيد، عن أيوب أبي العلاء، عن ابن شبرمة، عن امرأة، مسروق عن عائشة، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو داود وحديث عدي بن ثابت والأعمش عن حبيب وأيوب أبي العلاء كلها ضعيفة لا تصح ودل على ضعف حديث الأعمش عن حبيب هذا الحديث أوقفه حفص بن غياث عن الأعمش وأنكر حفص بن غياث أن يكون حديث حبيب مرفوعا وأوقفه أيضا أسباط عن الأعمش موقوف عن عائشة ‏.‏ قال أبو داود ورواه ابن داود عن الأعمش مرفوعا أوله وأنكر أن يكون فيه الوضوء عند كل صلاة ودل على ضعف حديث حبيب هذا أن رواية الزهري عن عروة عن عائشة قالت فكانت تغتسل لكل صلاة ‏.‏ في حديث المستحاضة وروى أبو اليقظان عن عدي بن ثابت عن أبيه عن علي - رضي الله عنه - وعمار مولى بني هاشم عن ابن عباس وروى عبد الملك بن ميسرة وبيان والمغيرة وفراس ومجالد عن الشعبي عن حديث قمير عن عائشة ‏\"‏ توضئي لكل صلاة ‏\"‏ ‏.‏ ورواية داود وعاصم عن الشعبي عن قمير عن عائشة ‏\"‏ تغتسل كل يوم مرة ‏\"‏ ‏.‏ وروى هشام بن عروة عن أبيه المستحاضة تتوضأ لكل صلاة ‏.‏ وهذه الأحاديث كلها ضعيفة إلا حديث قمير وحديث عمار مولى بني هاشم وحديث هشام بن عروة عن أبيه والمعروف عن ابن عباس الغسل ‏.‏",
      "text_en": " This tradition has also been narrated by 'Aishah through a different chain of transmitters.Abu Dawud said:                      All the traditions (on this subject) transmitted by 'Adi b. Thabit and A'mash on the authority of Habib and Ayyub al-'Ala, all of them are weak; none of them is sound. This tradition indicates\tthe tradition reported by al-A'mash a a statement of Companion, i.e. 'Aishah. Hafs b. Ghayath has rejected the tradition transmitted by Habib as the statement (of the Prophet). And Asbat also reported it as a statement of 'Aishah.Abu Dawud said: Ibn Dawud has narrated the first part of this tradition as a statement (of the Prophet), and denied that there was any mention of performing ablution for every prayer. The weakness of the tradition reported by Habib is also indicated by the fact that the version transmuted by al-Zuhri from 'Urwah on the authority of 'Aishah says that she used to wash herself for every prayer; (these words occur) in the tradition about the woman who has a flow of blood. This tradition has been reported by Abu al-Yaqzan from 'Adi b. Thabit from his father from 'Ali, and narrated by 'Ammar, the freed salve of Banu Hashim, from Ibn 'Abbas, and transmitted by 'Abd al-Malik b. Maisarah, Bayan, al-Mughirah, Firas, on the authority of al-Sha'bi, from Qumair from 'Aishah, stating: You should perform ablution for every prayer. The version transmitted by Dawud, and 'Asim from al-Sha'bi from Qumair from 'Aishah has the words: She should take bath only once every day. The version reported by Hisham b. 'Urwah from his father has the words: The woman having a flow of blood should perform ablution for every prayer. All these traditions are weak except the tradition reported by Qumair and the tradition reported by 'Ammar, the freed slave of Banu Hashim, and the tradition narrated by Hisham b. 'Urwah on the authority of his father. What is commonly known from Ibn 'Abbas is bathing (for every prayer).",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-597",
      "hadith_no": "597",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سنان، وأحمد بن الفرات أبو مسعود الرازي، - المعنى - قالا حدثنا يعلى، حدثنا الأعمش، عن إبراهيم، عن همام، أن حذيفة أم الناس، بالمدائن على دكان فأخذ أبو مسعود بقميصه فجبذه فلما فرغ من صلاته قال ألم تعلم أنهم كانوا ينهون عن ذلك قال بلى قد ذكرت حين مددتني ‏.‏",
      "text_en": " Hammam said:                      Hudhaifah led the people in prayer in al-Mada’in standing on the shop(or a bench). Abu Mas’ud took him by his shirt, and brought him down. When he( Abu Mas’ud) finished his prayer, he said: Do you not know that they(the people) were prohibited to do so. He said: Yes, I remembered when you pulled me down.",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20372",
        "11060",
        "11051",
        "11447"
      ]
    },
    {
      "id": "sunan-abi-daud-2663",
      "hadith_no": "2663",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو أحمد الزبيري، حدثنا عبد الرحمن بن سليمان بن الغسيل، عن حمزة بن أبي أسيد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم حين اصطففنا يوم بدر ‏\"‏ إذا أكثبوكم - يعني إذا غشوكم - فارموهم بالنبل واستبقوا نبلكم ‏\"‏ ‏.‏",
      "text_en": " Abu Usaid reported the Apostle of Allaah(ﷺ) as saying to us at the battle of Badr when he drew up in rows. When they came near you, shoot arrows at them, but do not use all your arrows.",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20355",
        "11517",
        "1461",
        "113"
      ]
    },
    {
      "id": "sunan-abi-daud-3042",
      "hadith_no": "3042",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن سنان الواسطي، حدثنا محمد بن بلال، عن عمران القطان، عن أبي جمرة، عن ابن عباس، قال إن أهل فارس لما مات نبيهم كتب لهم إبليس المجوسية ‏.‏",
      "text_en": " Ibn ‘Abbas said “When the Prophet of the Persians dies, Iblis (satan) led them to Mazdaism.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "24388",
        "20718",
        "11309",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4654",
      "hadith_no": "4654",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد بن سلمة، ح وحدثنا أحمد بن سنان، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن عاصم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم قال موسى ‏\"‏ فلعل الله ‏\"‏ ‏.‏ وقال ابن سنان ‏\"‏ اطلع الله على أهل بدر فقال اعملوا ما شئتم فقد غفرت لكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying – will be according to the version of Musa :                      Perhaps Allah, and Ibn Sinan’s version has : Allah looked at the participants of the battle of Badr (with mercy) and said : Do whatever you wish ; I have forgiven you.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20021",
        "30297",
        "20472",
        "20021",
        "11080",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-132",
      "hadith_no": "132",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، أنبأنا إسحاق، عن موسى بن طلحة، قال كنا عند معاوية فقال أشهد لسمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ طلحة ممن قضى نحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Musa bin Talhah said:                     We were with Mu'awiyah and he said: \"I heard the Messenger of Allah say: 'Talhah is one of those who fulfilled their covenant.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "30021",
        "579"
      ]
    },
    {
      "id": "sunan-ibn-majah-562",
      "hadith_no": "562",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، حدثنا شريك، عن طريف بن شهاب، قال سمعت أبا نضرة، يحدث عن جابر بن عبد الله، قال انتهينا إلى غدير فإذا فيه جيفة حمار ‏.‏ قال فكففنا عنه حتى انتهى إلينا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ إن الماء لا ينجسه شىء ‏\"‏ ‏.‏ فاستقينا وأروينا وحملنا ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"We came to a pond in which there was the carcass of a donkey, so we refrained from using the water until the Messenger of Allah came to us and said: 'Water is not made impure by anything.' Then we drank from it and gave it to our animals to drink, and we carried some with us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "20587",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-667-2",
      "hadith_no": "667",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح، وأحمد بن سنان، قالا حدثنا إسحاق بن يوسف الأزرق، أنبأنا سفيان، ح وحدثنا علي بن ميمون الرقي، حدثنا مخلد بن يزيد، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فسأله عن وقت الصلاة فقال ‏\"‏ صل معنا هذين اليومين ‏\"‏ ‏.‏ فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما كان من اليوم الثاني أمره فأذن الظهر فأبرد بها وأنعم أن يبرد بها ثم صلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعدما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                     \"A man came to the Prophet and asked him about the times of the prayer. He said: 'Pray with us for two days.' When the sun passed its zenith he commanded Bilal to call the Adhan, then he commanded him to give the Iqamah for Zuhr; then he commanded him to give the Iqamah for 'Asr when the sun was high and clearly white. Then he commanded him to give the Iqamah for Maghrib when the sun had set; then he commanded him to give the Iqamah for 'Isha' when the red afterglow had disappeared; then he commanded him to give the Iqamah for Fajr when dawn came. On the following day he commanded him to give the Adhan for Zuhr when the extreme heat had passed and it had cooled down; then he prayed 'Asr when the sun was still high, but he delayed it more than he had done the day before; then he prayed Maghrib before the red afterglow disappeared; he prayed 'Isha' when one-third of the night had passed; and he prayed Fajr at the time when it was already light. Then he said: 'Where is the one who was asking about the times of Prayer?' The man said: 'Here I am, O Messenger of Allah.' He said: 'The times of your prayer are between the times you have seen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "30297",
        "20411",
        "20012",
        "38412",
        "20462",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-760",
      "hadith_no": "760",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو معاوية، عن خالد بن إياس، عن يحيى بن عبد الرحمن بن حاطب، عن أبي سعيد الخدري، قال أول من أسرج في المساجد تميم الداري ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The first person who put lamps in the mosque was Tamim Ad-Dari.\"",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20354",
        "10625",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1203",
      "hadith_no": "1203",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سنان، ومحمد بن عبادة الواسطيان، قالا حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن مجاهد، عن ابن عمر، قال رمقت النبي  صلى الله عليه وسلم  شهرا فكان يقرأ في الركعتين قبل الفجر ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد}‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “I watched the Prophet (ﷺ) foramonth, and in the two Rak’ah before Fajr he used to recite: “Say:Oyou disbelievers!” [Al-Kafirun (109)] and “Say: Allah is One.”[Al-Ikhlas (112)]",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "30378",
        "20355",
        "20012",
        "11049",
        "11028",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1249",
      "hadith_no": "1249",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سنان، وإسحاق بن منصور، قالا حدثنا يزيد بن هارون، أنبأنا شعبة، عن جابر، عن سالم، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  يصلي في السفر ركعتين لا يزيد عليهما وكان يتهجد من الليل ‏.‏ قلت وكان يوتر قال نعم ‏.‏",
      "text_en": " It wasnarrated from Salim that his father said:                      “The Messenger ofAllah(ﷺ) used to pray two Rak’ah while traveling, and he did not domore than that. And he used to pray Tahajjud at night.” I asked:“Didhe pray Witr?” He said: “Yes.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "30313",
        "20472",
        "20020",
        "34",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1256",
      "hadith_no": "1256",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، قال كنت مع ابن عمر فتخلفت فأوترت فقال ما خلفك قلت أوترت ‏.‏ فقال أما لك في رسول الله  صلى الله عليه وسلم  أسوة حسنة قلت بلى ‏.‏ قال فإن رسول الله  صلى الله عليه وسلم  كان يوتر على بعيره ‏.‏",
      "text_en": " It wasnarrated that Sa’eed bin Yasar said:                      “I was with Ibn ‘Umar andI lagged behind and prayed Witr. He said: ‘What kept you?’ Isaid: ‘Iwas praying Witr.’ He said: ‘Do you not have the bestof examples inthe Messenger of Allah (ﷺ)?’ I said: ‘Ofcourse.’ He said: ‘TheMessenger of Allah (ﷺ) used to pray Witrwhile riding his camel.’”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20033",
        "20001",
        "20186",
        "11170"
      ]
    },
    {
      "id": "sunan-ibn-majah-1524",
      "hadith_no": "1524",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن سنان، والعباس بن عبد العظيم، وسهل بن أبي سهل، قالوا حدثنا يحيى بن سعيد، عن سفيان، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله، عن ابن عباس، وعائشة، أن أبا بكر، قبل النبي  صلى الله عليه وسلم  وهو ميت ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas and ‘Aishah that Abu Bakr kissed theProphet (ﷺ) when he died.",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "30437",
        "38259",
        "20031",
        "20012",
        "11399",
        "11004",
        "17",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1951",
      "hadith_no": "1951",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو أحمد، حدثنا إسرائيل، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال تزوج النبي  صلى الله عليه وسلم  عائشة وهي بنت سبع وبنى بها وهي بنت تسع وتوفي عنها وهي بنت ثماني عشرة سنة ‏.‏",
      "text_en": " It was narrated that:                     Abdullah said: “The Prophet married Aishah when she was seven years old, and consummated the marriage with her when she was nine, and he passed away when she was eighteen.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20355",
        "20311",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2147",
      "hadith_no": "2147",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، عن نافع، عن ابن عمر، أن رجلا، لاعن امرأته وانتفى من ولدها ففرق رسول الله  صلى الله عليه وسلم  بينهما وألحق الولد بالمرأة ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     a man invoked curses on his wife, and refused to accept her child. The Messenger of Allah (ﷺ) separated them, and left the child with the woman.",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20033",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2222",
      "hadith_no": "2222",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا كثير بن هشام، حدثنا كلثوم بن جوشن القشيري، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ التاجر الأمين الصدوق المسلم مع الشهداء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     'The trustworthy, honest Muslim merchant will be with the martyrs on the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20633",
        "28496",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2291",
      "hadith_no": "2291",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، وأحمد بن سنان، قالوا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم رجل على فضل ماء بالفلاة يمنعه ابن السبيل ورجل بايع رجلا سلعة بعد العصر فحلف بالله لأخذها بكذا وكذا فصدقه وهو على غير ذلك ورجل بايع إماما لا يبايعه إلا لدنيا فإن أعطاه منها وفى له وإن لم يعطه منها لم يف له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     \"There are three to whom Allah will not speak on the Day of Resurrection, nor will He look at them or purify them, and theirs will be a painful torment: A man who has surplus water in the desert but refuses to give any to a wayfarer; a man who sells a product to a man after 'Asr and swears by Allah that he bought it for such and such amount, and he believes him, when that is not the case; and a man who swears allegiance to a ruler, and only does so for worldly gains, so if he gives him some of (these worldly benefits) he fulfills his oath of allegiance, and if he is not given anything he does not uphold his oath of allegiance. \"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "30297",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2312-2",
      "hadith_no": "2312",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا محمد بن بلال، عن عمران القطان، عن حسين، - يعني ابن عمران - عن أبي إسحاق الشيباني، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله مع القاضي ما لم يجر فإذا جار وكله إلى نفسه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Abu Awfa that the Messenger of Allah (ﷺ) said:                     “Allah is with the judge so long as he is not unjust, but if he rules unjustly, He entrusts him to himself.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "24388",
        "20718",
        "11352",
        "5115"
      ]
    },
    {
      "id": "sunan-ibn-majah-2588",
      "hadith_no": "2588",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا أحمد بن سنان، والعلاء بن سالم، قالا حدثنا يزيد بن هارون، أنبأنا شريك، عن سماك، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كانت له أرض فأراد بيعها فليعرضها على جاره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Prophet (ﷺ) said:                     “Whoever has land and wants to sell it, let him offer it to his neighbor.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "11858",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2619",
      "hadith_no": "2619",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو معاوية، حدثنا هشام بن عروة، عن أبيه، عن أبي مراوح، عن أبي ذر، قال قلت يا رسول الله أى الرقاب أفضل قال ‏\"‏ أنفسها عند أهلها وأغلاها ثمنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     “I said: 'O Messenger of Allah (ﷺ), which slave is best?' He said: ‘The one who is most precious to his master and most valuable in price.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20354",
        "11065",
        "10511",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-2870",
      "hadith_no": "2870",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بالمدينة رجالا ما قطعتم واديا ولا سلكتم طريقا إلا شركوكم في الأجر حبسهم العذر ‏\"‏ ‏.‏ قال أبو عبد الله بن ماجه أو كما قال كتبته لفظا ‏.‏",
      "text_en": " It wasnarrated from Jabir that the Messenger of Allah (ﷺ) said:                     “inAl-Madinah there are men who, every time you crossed a valley ortravelled a road, they shared with you in the reward. They were keptbehind by (legitimate) excuses.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20354",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2980",
      "hadith_no": "2980",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، وأحمد بن سنان، قالوا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم رجل على فضل ماء بالفلاة يمنعه من ابن السبيل ورجل بايع رجلا بسلعة بعد العصر فحلف بالله لأخذها بكذا وكذا فصدقه وهو على غير ذلك ورجل بايع إماما لا يبايعه إلا لدنيا فإن أعطاه منها وفى له وإن لم يعطه منها لم يف له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “There are three to whom Allah will not speak on the Day ofResurrection, not will He look at them nor purify them, and theirswill be a painful torment: A man who has surplus water in the desertand withholds it from a wayfarer; a man who sells a man his productafter ‘Asr, swearing by Allah that he bought it for such and such aprice, and the other believes him, but that is not the case; and amanwho gives his pledge to a ruler, only doing to for the purpose ofworldly gain, and if he is given something he fulfills it, but if heis not given anything he does not fulfill it.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "30297",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2989",
      "hadith_no": "2989",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن سنان، وأبو عمر قالا حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى أن يسافر بالقرآن إلى أرض العدو مخافة أن يناله العدو ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)forbadetraveling with the Qur’an to the land of the enemy, lest theenemygets hold of it.",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20033",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3074",
      "hadith_no": "3074",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معلى بن منصور، ح وحدثنا إسحاق بن منصور، وأحمد بن سنان، قالا حدثنا عبد الرحمن بن مهدي، قالا حدثنا مالك بن أنس، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب، عن أم سلمة، أنها مرضت فأمرها رسول الله  صلى الله عليه وسلم  أن تطوف من وراء الناس وهي راكبة ‏.‏ قالت فرأيت رسول الله  صلى الله عليه وسلم  يصلي إلى البيت وهو يقرأ ‏{والطور * وكتاب مسطور}‏ ‏.‏ قال ابن ماجه هذا حديث أبي بكر ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that she fell sick, so the MessengerofAllah (ﷺ) told her to perform Tawaf from behind the people,riding.She said:                      “I saw the Messenger of Allah (ﷺ) praying facingtheHouse, and reciting: “By the Tur (Mount), And by the BookInscribed.’” [52:1-2]",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30278",
        "30313",
        "30297",
        "20033",
        "20001",
        "11105",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-3153",
      "hadith_no": "3153",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا مالك بن أنس، ح وحدثنا أحمد بن سنان، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، حدثني عبد الله بن أبي بكر، عن أبيه، عن أبي البداح بن عاصم، عن أبيه، قال رخص رسول الله  صلى الله عليه وسلم  لرعاء الإبل في البيتوتة أن يرموا يوم النحر ثم يجمعوا رمى يومين بعد النحر فيرمونه في أحدهما - قال مالك ظننت أنه قال في الأول منهما - ثم يرمون يوم النفر ‏.‏",
      "text_en": " It wasnarrated from Abu Baddah bin ‘Asim that his father said:                      “TheMessenger of Allah (ﷺ) granted permission to some camel herdersregarding staying (in Mina),* and allowing them to stone the Pillarson the Day of Sacrifice, then to combine the stoning of two daysafterthe sacrifice, so that they could do it on one of the twodays.”**Malik said: “I think that he said: ‘On the first ofthe first of thetwo days, then they could stone them on the day ofdeparture (fromMina).’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20001",
        "30297",
        "20033",
        "20001",
        "11104",
        "11239",
        "19953",
        "1722"
      ]
    },
    {
      "id": "sunan-ibn-majah-3355",
      "hadith_no": "3355",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، ح وحدثنا أحمد بن سنان، وإسحاق بن منصور، قالا حدثنا عبد الرحمن بن مهدي، قالا حدثنا مالك بن أنس، عن إسماعيل بن أبي حكيم، عن عبيدة بن سفيان، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أكل كل ذي ناب من السباع حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Eating anypredatory animal that has fangs is unlawful.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20609",
        "30297",
        "30313",
        "20033",
        "20001",
        "11828",
        "11888",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3561",
      "hadith_no": "3561",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا زيد بن الحباب، حدثنا مندل بن علي، عن محمد بن إسحاق، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، قال كان لرسول الله  صلى الله عليه وسلم  قدح من قوارير يشرب فيه ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)hada glass cup from which he would drink.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20650",
        "25314",
        "11107",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-4099",
      "hadith_no": "4099",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، عن سليمان التيمي، وسعيد بن أبي عروبة، عن قتادة، عن الحسن، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار ‏\"‏ ‏.‏ قالوا يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ إنه أراد قتل صاحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Messenger of Allah (ﷺ) said:                     “When two Muslims confront one another with their swords, both thekiller and the slain will be in Hell.” They said: “O Messenger ofAllah, (we understand about) this killer, but what is wrong with theone who is slain?” He said: “He wanted to kill his companion.’”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "11289",
        "11073",
        "11019",
        "11016",
        "41"
      ]
    }
  ],
  "total_hadiths": 31
}