{
  "id": "30296",
  "name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
  "full_name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "253",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  ت  ق  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Darmi",
      "al-Nisapuri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30555",
      "name": "'Ali bin al-Husain bin Waqid علي بن الحسين بن واقد المروزي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1100",
      "hadith_no": "1100",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن سعيد، قال حدثنا حبان، قال حدثنا همام، قال حدثنا أنس بن سيرين، قال استقبلنا أنسا حين قدم من الشأم، فلقيناه بعين التمر، فرأيته يصلي على حمار ووجهه من ذا الجانب، يعني عن يسار القبلة‏.‏ فقلت رأيتك تصلي لغير القبلة‏.‏ فقال لولا أني رأيت رسول الله صلى الله عليه وسلم فعله لم أفعله‏.‏ رواه ابن طهمان عن حجاج عن أنس بن سيرين عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- Tamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the Qibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" He replied, \"If I had not seen Allah's Apostle doing it, I would not have done it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20297",
        "11038"
      ]
    },
    {
      "id": "sahih-bukhari-2433",
      "hadith_no": "2433",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "وقال أحمد بن سعيد حدثنا روح، حدثنا زكرياء، حدثنا عمرو بن دينار، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يعضد عضاهها، ولا ينفر صيدها، ولا تحل لقطتها إلا لمنشد، ولا يختلى خلاها ‏\"‏‏.‏ فقال عباس يا رسول الله إلا الإذخر‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn 'Abbas (ra):                      Allah's Messenger () also said, \"It (i.e., Makkah's) thorny bushes should not be uprooted and its game should not be chased, and picking up its fallen things is illegal except by  him who makes public announcement about it, and its grass should not be cut.\" 'Abbas said, \"O Allah's Messenger ! Except Idhkhir (a kind of grass).\" The Prophet () said, \"Except Idhkhir.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20229",
        "11338",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3362",
      "hadith_no": "3362",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، عن أبيه، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ يرحم الله أم إسماعيل، لولا أنها عجلت لكان زمزم عينا معينا ‏\"‏‏.‏   قال الأنصاري حدثنا ابن جريج، أما كثير بن كثير فحدثني قال إني وعثمان بن أبي سليمان جلوس مع سعيد بن جبير، فقال ما هكذا حدثني ابن عباس، قال أقبل إبراهيم بإسماعيل وأمه عليهم السلام وهى ترضعه، معها شنة  لم يرفعه  ثم جاء بها إبراهيم وبابنها إسماعيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to fill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on the surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his mother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'",
      "usc_msa_ref": "582",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3589",
      "hadith_no": "3589",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أحمد بن سعيد أبو عبد الله، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سمعت البراء، يقول كان رسول الله صلى الله عليه وسلم أحسن الناس وجها وأحسنه خلقا، ليس بالطويل البائن ولا بالقصير‏.‏",
      "text_en": " Narrated Al-Bara:                     Allah's Apostle was the handsomest of all the people, and had the best appearance. He was neither very tall nor short.",
      "usc_msa_ref": "749",
      "chain": [
        "30296",
        "30313",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-3720",
      "hadith_no": "3720",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، حدثنا صخر، عن نافع، أن عبد الله بن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينما أنا على بئر أنزع منها جاءني أبو بكر وعمر، فأخذ أبو بكر الدلو، فنزع ذنوبا أو ذنوبين وفي نزعه ضعف، والله يغفر له، ثم أخذها ابن الخطاب من يد أبي بكر، فاستحالت في يده غربا، فلم أر عبقريا من الناس يفري فريه، فنزع حتى ضرب الناس بعطن ‏\"‏‏.‏ قال وهب العطن مبرك الإبل، يقول حتى رويت الإبل فأناخت‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said. \"While (in a dream), I was standing by a well, drawing water from it. Abu Bakr and `Umar came to me. Abu Bakr took the bucket (from me) and drew one or two buckets of water, and there was some weakness in his drawing. May Allah forgive him. Then Ibn Al-Khattab took the bucket from Abu Bakr, and the bucket turned into a very large one in his hands. I had never seen such a mighty person amongst the people as him in performing such hard work. He drew so much water that the people drank to their satisfaction and watered their camels.\" (Wahab, a sub-narrator said, \"till their camels drank and knelt down.\")",
      "usc_msa_ref": "25",
      "chain": [
        "30296",
        "20298",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4019",
      "hadith_no": "4019",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، سأل رجل البراء وأنا أسمع، قال أشهد علي بدرا قال بارز وظاهر‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     A man asked Al-Bara' and I was listening, \"Did `Ali take part in (the battle of) Badr?\" Al-Bara' said, \"(Yes). he even met (his enemies) in a duel and was clad in two armors (one over the other).",
      "usc_msa_ref": "309",
      "chain": [
        "30296",
        "30313",
        "20406",
        "20473",
        "11049"
      ]
    },
    {
      "id": "sahih-bukhari-4738",
      "hadith_no": "4738",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني أحمد بن سعيد، حدثنا بشر بن عمر، حدثنا شعبة، عن سليمان، عن أبي وائل، عن عبد الله بن مسعود، قال هيت لك قال وإنما نقرؤها كما علمناها ‏{‏مثواه‏}‏ مقامه ‏{‏ألفيا‏}‏ وجدا ‏{‏ألفوا آباءهم‏}‏ ‏{‏ألفينا‏}‏ وعن ابن مسعود ‏{‏بل عجبت ويسخرون‏}‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah bin Mas`ud recited \"Haita laka (Come you),\" and added, \"We recite it as we were taught it.\"",
      "usc_msa_ref": "214",
      "chain": [
        "30296",
        "20211",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-6170",
      "hadith_no": "6170",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، وأحمد بن سعيد، قالا حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الرجل لأخيه يا كافر فقد باء به أحدهما ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"If a man says to his brother, O Kafir      (disbeliever)!' Then surely one of them is such (i.e., a Kafir). \"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30296",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-332-3",
      "hadith_no": "332",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا منصور، عن أمه، عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم كيف أغتسل عند الطهر فقال ‏\"‏ خذي فرصة ممسكة فتوضئي بها ‏\"‏ ‏.‏ ثم ذكر نحو حديث سفيان ‏.‏",
      "text_en": " 'A'isha reported:                      A woman asked the Apostle of Allah (may peace be upon him) how he should wash herself after the menstrual period. He (the Holy Prophet) said: Take a cotton with musk and purity yourself, and the rest of the hadith was narrated like that of Sufyan.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-376-5",
      "hadith_no": "376",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا حماد، عن ثابت، عن أنس، أنه قال أقيمت صلاة العشاء فقال رجل لي حاجة ‏.‏ فقام النبي صلى الله عليه وسلم يناجيه حتى نام القوم - أو بعض القوم - ثم صلوا ‏.‏",
      "text_en": " Anas reported:                      (The people) stood up for the night prayer when a man spoke forth: I need to say something. The Apostle of Allah (may peace be upon him) entered into secret conversation with him, till the people dozed off or some of the people (dozed off), and then they said the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1595",
      "hadith_no": "1595",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا عبيد الله بن عبد المجيد، حدثنا سلم بن زرير العطاردي، قال سمعت أبا رجاء العطاردي، عن عمران بن حصين، قال كنت مع نبي الله صلى الله عليه وسلم في مسير له فأدلجنا ليلتنا حتى إذا كان في وجه الصبح عرسنا فغلبتنا أعيننا حتى بزغت الشمس - قال - فكان أول من استيقظ منا أبو بكر وكنا لا نوقظ نبي الله صلى الله عليه وسلم من منامه إذا نام حتى يستيقظ ثم استيقظ عمر فقام عند نبي الله صلى الله عليه وسلم فجعل يكبر ويرفع صوته بالتكبير حتى استيقظ رسول الله صلى الله عليه وسلم فلما رفع رأسه ورأى الشمس قد بزغت قال ‏\"‏ ارتحلوا ‏\"‏ ‏.‏ فسار بنا حتى إذا ابيضت الشمس نزل فصلى بنا الغداة فاعتزل رجل من القوم لم يصل معنا فلما انصرف قال له رسول الله صلى الله عليه وسلم ‏\"‏ يا فلان ما منعك أن تصلي معنا ‏\"‏ ‏.‏ قال يا نبي الله أصابتني جنابة ‏.‏ فأمره رسول الله صلى الله عليه وسلم فتيمم بالصعيد فصلى ثم عجلني في ركب بين يديه نطلب الماء وقد عطشنا عطشا شديدا ‏.‏ فبينما نحن نسير إذا نحن بامرأة سادلة رجليها بين مزادتين فقلنا لها أين الماء قالت أيهاه أيهاه لا ماء لكم ‏.‏ قلنا فكم بين أهلك وبين الماء ‏.‏ قالت مسيرة يوم وليلة ‏.‏ قلنا انطلقي إلى رسول الله صلى الله عليه وسلم ‏.‏ قالت وما رسول الله فلم نملكها من أمرها شيئا حتى انطلقنا بها فاستقبلنا بها رسول الله صلى الله عليه وسلم فسألها فأخبرته مثل الذي أخبرتنا وأخبرته أنها موتمة لها صبيان أيتام فأمر براويتها فأنيخت فمج في العزلاوين العلياوين ثم بعث براويتها فشربنا ونحن أربعون رجلا عطاش حتى روينا وملأنا كل قربة معنا وإداوة وغسلنا صاحبنا غير أنا لم نسق بعيرا وهي تكاد تنضرج من الماء - يعني المزادتين - ثم قال ‏\"‏ هاتوا ما كان عندكم ‏\"‏ ‏.‏ فجمعنا لها من كسر وتمر وصر لها صرة فقال لها ‏\"‏ اذهبي فأطعمي هذا عيالك واعلمي أنا لم نرزأ من مائك ‏\"‏ ‏.‏ فلما أتت أهلها قالت لقد لقيت أسحر البشر أو إنه لنبي كما زعم كان من أمره ذيت وذيت ‏.‏ فهدى الله ذاك الصرم بتلك المرأة فأسلمت وأسلموا ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      I was with the Apostle of Allah (may peace be upon him) in a journey. We travelled the whole of the night, and when it was about to dawn, we got down for rest, and were overpowered (by sleep) till the sun shone. Abu Bakr was the first to awake amongst us. and we did not awake the Apostle of Allah (may peace be upon him) from his sleep allowing him to wake up (of his own accord). It was 'Umar who then woke up. He stood by the side of the Apostle of Allah (may peace be upon him) and recited takbir in a loud voice till the Messenger of Allah (may peace be upon him) woke up. When he lifted his head, he saw that the sun had arisen; he then said: Proceed on. He travelled along with us till the sun shone brightly. He came down (from his camel) and led us in the morning prayer. A person, however, remained away from the people and did not say, prayer along with us. After having completed the prayer, the Messenger of Allah (may peace be upon him) said to him: O, so and so, what prevented you from observing prayer with us? He said: Apostle of Allah! I was not in a state of purity. The Messenger of Allah (may peace be upon him) ordered him arid lie performed Tayammum with dust and said prayer. He then urged me to go ahead immediately along with other riders to find out water, for we felt very thirsty. We were traveling when we came across a woman who was sitting (on a camel) with her feet hanging over two leathern water bags. We said to her: How far is water available? She, said: Far, very far, very far. You cannot get water. We (again) said: How much distance is there between (the residence of) your family and water? She said: It is a day and night journey. We said to her: You go to the Messenger of Allah (may peace be upon him). She said: Who is the Messenger of Allah? We somehow or the other managed to bring her to the Messenger of Allah (may peace be upon him) and he asked about her, and she informed him as she had informed us that she was a widow having orphan children. He ordered that her camel should be made to kneal down and he gargled in the opening (of her leathern water-bag). The camel was then raised up and we forty thirsty men drank water till we were completely satiated, and we filled up all leathern water-bags and water-skins that we had with us and we washed our companions, but we did not make any camel drink, and (the leathern water-bags) were about to burst (on account of excess of water). He then said: Bring whatever you have with you. So we collected the bits (of estable things) and dates and packed them up in a bundle, and said to her: Take it away. This is meant for your children, and know that we have not its any way done any loss to your water. W hen she came to her family she said: I have met the greatest magician amongst human beings, or he is an apostle, as he claims to be, and she then narrated what had happened and Allah guided aright those people through that woman. She affirmed her faith in Islam and so did the people embrace Islam.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "11591",
        "11440",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-2146",
      "hadith_no": "2146",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا منصور، عن أمه، عن أسماء بنت أبي بكر، قالت كسفت الشمس على عهد النبي صلى الله عليه وسلم ففزع فأخطأ بدرع حتى أدرك بردائه بعد ذلك قالت فقضيت حاجتي ثم جئت ودخلت المسجد فرأيت رسول الله صلى الله عليه وسلم قائما فقمت معه فأطال القيام حتى رأيتني أريد أن أجلس ثم ألتفت إلى المرأة الضعيفة فأقول هذه أضعف مني ‏.‏ فأقوم فركع فأطال الركوع ثم رفع رأسه فأطال القيام حتى لو أن رجلا جاء خيل إليه أنه لم يركع ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr reported:                      The sun eclipsed during the lifetime of the Apostle of Allah (may peace be upon him) ; so he felt perturbed and he, by mistake, took hold of the outer garment of a woman till he was given his own cloak. After this I satisfied my need and then came and entered the mosque. I saw the Messenger of Allah (may peace be upon him) standing in prayer. I stood along with him. He prolonged his qiyam till I wished to sit down. Then I cast a glance towards an old woman. So I said: She is older than I. I, therefore, kept standing. He (the Holy Prophet) then observed ruku', and prolonged his ruku'. He then raised his head. He then prolonged his qiyam to such an extent that if a person happened to come he would have thought that he had not observed the ruku'.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "70"
      ]
    },
    {
      "id": "sahih-muslim-2806",
      "hadith_no": "2806",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان بن هلال، حدثنا أبان العطار، حدثنا غيلان بن جرير، في هذا الإسناد بمثل حديث شعبة غير أنه ذكر فيه الاثنين ولم يذكر الخميس ‏.‏",
      "text_en": " This hadith has been narrated by Ghailan b. Jarir with the same chain of transmitters, but with one variation, that there has been made mention of Monday and not of Thursday.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20205",
        "11300"
      ]
    },
    {
      "id": "sahih-muslim-3078",
      "hadith_no": "3078",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا أحمد بن إسحاق، حدثنا همام بن يحيى، عن قتادة، عن أبي حسان، قال قيل لابن عباس إن هذا الأمر قد تفشغ بالناس من طاف بالبيت فقد حل الطواف عمرة ‏.‏ فقال سنة نبيكم صلى الله عليه وسلم وإن رغمتم ‏.‏",
      "text_en": " Abu Hassan reported:                      It was said to Ibn 'Abbas (Allah be pleased with them) that this affair had engaged the attention of the people that he who circumambu- lates the House was permitted to circumambulate for Umra (even though he was in a state of Ihram for Hajj), whereupon he said: That is the Sunnah of your Apostle (may peace be upon him), even though you may not approve of it.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30289",
        "20297",
        "11019"
      ]
    },
    {
      "id": "sahih-muslim-3487",
      "hadith_no": "3487",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا أبو النعمان، حدثنا وهيب، حدثنا عمارة بن غزية، حدثني الربيع بن سبرة الجهني، عن أبيه، قال خرجنا مع رسول الله صلى الله عليه وسلم عام الفتح إلى مكة ‏.‏ فذكر بمثل حديث بشر ‏.‏ وزاد قالت وهل يصلح ذاك وفيه قال إن برد هذا خلق مح ‏.‏",
      "text_en": " Rabi' b. S'abra al-jahanni reported on the authority of his father. We went with Allah's Messenger (may peace be upon him) to Mecca during the year of Victory and he narrated like this a hadith transmitted by Bishr (the previous one) but with this addition:                     \" She said: Can it be possible?\" And it is also mentioned in it:\" He said: The cloak of this (man) is old and worn out.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20283",
        "20299",
        "11894",
        "11847"
      ]
    },
    {
      "id": "sahih-muslim-3669",
      "hadith_no": "3669",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا همام، حدثنا قتادة، عن أبي، الخليل عن عبد الله بن الحارث، عن أم الفضل، سأل رجل النبي صلى الله عليه وسلم أتحرم المصة فقال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Umm Fadl (Allah be pleased with her) reported that a person asked Allah's Apostle (may peace be upon him):                      Does one suckling make (the marriage) unlawful? He said: No.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20297",
        "11019",
        "11291",
        "912"
      ]
    },
    {
      "id": "sahih-muslim-4053",
      "hadith_no": "4053",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن سعيد بن إبراهيم، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، أخبرني عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول دخل النبي صلى الله عليه وسلم على أم معبد حائطا فقال ‏\"‏ يا أم معبد من غرس هذا النخل أمسلم أم كافر ‏\"‏ ‏.‏ فقالت بل مسلم ‏.‏ قال ‏\"‏ فلا يغرس المسلم غرسا فيأكل منه إنسان ولا دابة ولا طير إلا كان له صدقة إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported:                      Allah's Apostle (may peace be upon him) visited the orchard of Umm Ma'sud and said: Umm Ma'bad. he who has planted this tree, is he a Muslim or a non-Muslim? She said: Of course, he is a Muslim, whereupon he (the Holy Prophet) said: No Muslim who plants (trees) and from their fruits the human beings or the beasts or birds eat, but that would be taken as an act of charity on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4841",
      "hadith_no": "4841",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا سليمان بن حرب، حدثنا حماد، - يعني ابن زيد - عن أيوب، عن يحيى بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال ذكر رسول الله صلى الله عليه وسلم الغلول فعظمه ‏.‏ واقتص الحديث قال حماد ثم سمعت يحيى بعد ذلك يحدثه فحدثنا بنحو ما حدثنا عنه أيوب ‏.‏",
      "text_en": " Abu Huraira has narrated this hadith with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20193",
        "20022",
        "11015",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5188",
      "hadith_no": "5188",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا أبو النعمان، عارم بن الفضل حدثنا عبد الواحد، - يعني ابن زياد - حدثنا عاصم الأحول، عن الشعبي، حدثني البراء، بن عازب قال خطبنا رسول الله صلى الله عليه وسلم في يوم نحر فقال ‏\"‏ لا يضحين أحد حتى يصلي ‏\"‏ ‏.‏ قال رجل عندي عناق لبن هي خير من شاتى لحم قال ‏\"‏ فضح بها ولا تجزي جذعة عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported:                      Allah's Messenger (may peace be upon him) addressed us on the day of Nahr and said: None should sacrifice the animal unless he has completed the ('Id) prayer. A person said: I have a milch goat of less than one year, better than two fat goats. Thereupon he said: Sacrifice it, and no goat of less than a year of age will be accepted as sacrifice after you.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20283",
        "20256",
        "11080",
        "11052",
        "400"
      ]
    },
    {
      "id": "sahih-muslim-5479",
      "hadith_no": "5479",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني حجاج بن الشاعر، وأحمد بن سعيد بن صخر، - واللفظ منهما قريب - قالا حدثنا أبو النعمان، حدثنا ثابت، - في رواية حجاج بن يزيد أبو زيد الأحول - حدثنا عاصم، عن عبد الله بن الحارث، عن أفلح، مولى أبي أيوب عن أبي أيوب، أن النبي صلى الله عليه وسلم نزل عليه فنزل النبي صلى الله عليه وسلم في السفل وأبو أيوب في العلو - قال - فانتبه أبو أيوب ليلة فقال نمشي فوق رأس رسول الله صلى الله عليه وسلم ‏.‏ فتنحوا فباتوا في جانب ثم قال للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ السفل أرفق ‏\"‏ ‏.‏ فقال لا أعلو سقيفة أنت تحتها ‏.‏ فتحول النبي صلى الله عليه وسلم في العلو وأبو أيوب في السفل فكان يصنع للنبي صلى الله عليه وسلم طعاما فإذا جيء به إليه سأل عن موضع أصابعه فيتتبع موضع أصابعه فصنع له طعاما فيه ثوم فلما رد إليه سأل عن موضع أصابع النبي صلى الله عليه وسلم فقيل له لم يأكل ‏.‏ ففزع وصعد إليه فقال أحرام هو فقال النبي صلى الله عليه وسلم ‏\"‏ لا ولكني أكرهه ‏\"‏ ‏.‏ قال فإني أكره ما تكره أو ما كرهت ‏.‏ قال وكان النبي صلى الله عليه وسلم يؤتى ‏.‏",
      "text_en": " Aflah, the freed slave of Abu Ayyub Ansiri, reported:                      Allah's Messnger (may peace be upon him) had alighted in his house (viz. of Abu Ayyub Ansari at the time of his emigration to Medina) and he occupied the lower storey, whereas Abu Ayyub Ansari lived in the upper storey. One night, Abu Ayyub Ansari got up and said (to himself): (How unfortunate it is) that we walk above the head of Allah's Messenger (may peace be upon him), so they went aside and spent the night in a nook and then told Allah's Apostle (may peace be upon him) about it whereupon Allah's Apostle (may peace be upon him) said: The lower storey is more comfortable (for me). but he (Abu Ayyub Ansari) said: We (would not live) over the roof under which you live. So Allah's Messenger (may peace be upon him) shifted to the upper storey, whereas Abu Ayyub Ansari shifted to the lower storey; and he (Abu Ayyub Ansari) used to prepare food for Allah's Apostle (may peace be upon him) ; and when it was brought (back) to him he asked (to locate) the part, where his fingers had touched (the food), and he followed his fingers on that part where his fingers (those of the Holy Prophet) had touched it. (One day) he prepared food which contained garlic, and when it was returned to him he asked (to locate) the part which the fingers of Allah's Apostle (may peace be upon him) had touched. It was said to him that he had not eaten (the food). He (Abd Ayyub Ansari) was distressed and went up to him (to the Holy Prophet) and said: Is it forbidden? But Allah's Messenger (may peace be upon him) said: No, (it is not forbidden), but I do not like it. and he (Abu Ayyub Ansari) said: I also do not like what you do not like or which you did not like. He (Abu Ayyub Ansari) said: (The Holy Prophet did not eat garlic) as Allah's Apostle (may peace be upon him) was visited (by angels) and brought him the message of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "30296",
        "20283",
        "11080",
        "912",
        "11830",
        "33"
      ]
    },
    {
      "id": "sahih-muslim-5689",
      "hadith_no": "5689",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، أخبرنا حبان، حدثنا وهيب، حدثنا منصور، عن  أمه، عن أسماء بنت أبي بكر، أن امرأة، أتت النبي صلى الله عليه وسلم فقالت إني زوجت ابنتي فتمرق شعر رأسها وزوجها يستحسنها أفأصل يا رسول الله فنهاها ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that a woman came to Allah's Apostle (may peace be upon him) and said:                      I have married my daughter (whose) hair of head have fallen. Her spouse likes them (the long hair). Allah's Messenger (may add false hair to her head? He forbade her to do this.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "70"
      ]
    },
    {
      "id": "sahih-muslim-5879",
      "hadith_no": "5879",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان بن هلال، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وأعطى الحجام أجره واستعط ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Apostle (may peace be upon him) got himself cupped and gave to the cupper his wages and he put the medicine in the nostril.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-6200",
      "hadith_no": "6200",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا حماد، حدثنا ثابت، عن أنس، قال كان رسول الله صلى الله عليه وسلم أزهر اللون كأن عرقه اللؤلؤ إذا مشى تكفأ ولا مسست ديباجة ولا حريرة ألين من كف رسول الله صلى الله عليه وسلم ولا شممت مسكة ولا عنبرة أطيب من رائحة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) had a very fair complexion and (the drops) of his perspiration shone like pearls, and when he walked he walked inclining forward, and I never touched brocade and silk (and found it) as soft as the softness of the palm of Allah's Messenger (may peace be upon him) and I never smelt musk or ambergris and found its fragrance as sweet as the fragrance of Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6416",
      "hadith_no": "6416",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا موسى بن عقبة، حدثني سالم، عن عبد الله، بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority 'Abdullah through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11106",
        "11011"
      ]
    },
    {
      "id": "sahih-muslim-6705",
      "hadith_no": "6705",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا سهيل، عن  أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تباغضوا ولا تدابروا ولا تنافسوا وكونوا عباد الله إخوانا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Don't bear aversion against one another and don't be jealous of one another and be servants of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20299",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6950",
      "hadith_no": "6950",
      "source": "Sahih Muslim",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا أبان، حدثنا أبو عمران قال قال لنا جندب ونحن غلمان بالكوفة قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ‏\"‏ ‏.‏ بمثل حديثهما ‏.‏",
      "text_en": " Abu Imran reported that Jundub told us as we we-re young boys living in Kilfa, that Allah's Messenger (may peace be upon him) had said:                      Recite the Qur'an. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20577",
        "11296"
      ]
    },
    {
      "id": "sunan-abi-daud-169",
      "hadith_no": "169",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، سمعت معاوية، - يعني ابن صالح - يحدث عن أبي عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كنا مع رسول الله صلى الله عليه وسلم خدام أنفسنا نتناوب الرعاية رعاية إبلنا فكانت على رعاية الإبل فروحتها بالعشي فأدركت رسول الله صلى الله عليه وسلم يخطب الناس فسمعته يقول ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقوم فيركع ركعتين يقبل عليهما بقلبه ووجهه إلا قد أوجب ‏\"‏ ‏.‏ فقلت بخ بخ ما أجود هذه ‏.‏ فقال رجل من بين يدى التي قبلها يا عقبة أجود منها ‏.‏ فنظرت فإذا هو عمر بن الخطاب فقلت ما هي يا أبا حفص قال إنه قال آنفا قبل أن تجيء ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقول حين يفرغ من وضوئه أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏ قال معاوية وحدثني ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir said:                      We served ourselves in the company of Messenger of Allah (ﷺ). We tended our camels by turn. One day I had my turn to tend the camels, and I drove them in the afternoon. I found the Messenger of Allah (ﷺ) addressing the people. I heard him say: Anyone amongst you who performs ablution, and does it well, then he stands and offers two rak’ahs of prayer, concentrating on it with his heart and body, Paradise will be his lot by all means. I said: Ha-ha! How fine it is! A man in front of me said: The action (mentioned by the Prophet) earlier, O ‘Uqbah, is finer that this one. I looked at him and found him to be ‘Umar b. al-Khattab. I asked him: What is that, O Abu Hafs? He replied: He (the Prophet) had said before you came: If any one of you performs ablution, and does it well, and when he finishes the ablution, he utters the words : I bear witness that there is no deity except Allah, He has no associate, and I bear witness that Muhammad is His Servant and His Messenger, all the eight doors of Paradise will be opened for him; he may enter (through) any of them. Mu’awiyah said: Rabi’ah b. Yazid narrated this tradition to me from Abu Idris and the authority of  ‘Uqbah b.’Amir.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20675",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-707",
      "hadith_no": "707",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، ح حدثنا سليمان بن داود، قالا حدثنا ابن وهب، أخبرني معاوية، عن سعيد بن غزوان، عن أبيه، أنه نزل بتبوك وهو حاج فإذا رجل مقعد فسأله عن أمره فقال له سأحدثك حديثا فلا تحدث به ما سمعت أني حى إن رسول الله صلى الله عليه وسلم نزل بتبوك إلى نخلة فقال ‏\"‏ هذه قبلتنا ‏\"‏ ‏.‏ ثم صلى إليها فأقبلت وأنا غلام أسعى حتى مررت بينه وبينها فقال ‏\"‏ قطع صلاتنا قطع الله أثره ‏\"‏ ‏.‏ فما قمت عليها إلى يومي هذا ‏.‏",
      "text_en": " Sa’id b. Ghazwan reported on the authority  of his father that he made his stay at Tabuk(during his journey) for performing Hajj. All of a sudden he saw a crippled man and asked him about his condition. He said:                      I relate to you a tradition, but do not narrate it to anyone so long as I am alive: The Messenger of Allah (ﷺ) encamped at Tabuk near a date-palm and he said:  This is our qiblah (direction for praying). He then offered prayer facing it. I came running, when I was a boy, until I passed the place between him and the tree. He said (cursing): He cut off our prayer, may Allah cut off his walking. I could not, therefore, stand upon them(feet) till today.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30584",
        "20029",
        "27",
        "116"
      ]
    },
    {
      "id": "sunan-abi-daud-814",
      "hadith_no": "814",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سعيد السرخسي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن عمرو بن شعيب، عن أبيه، عن جده، أنه قال ما من المفصل سورة صغيرة ولا كبيرة إلا وقد سمعت رسول الله صلى الله عليه وسلم يؤم الناس بها في الصلاة المكتوبة ‏.‏",
      "text_en": " ‘Amr b. Shu’aib, on his father’s authority, quoted his grandfather as saying:                      There is no short or long surah in al-Mufassal which I have not heard the Messenger of Allah (May peace be upon him) reciting when he led the people in the prescribed prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-1377",
      "hadith_no": "1377",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا عبد الله بن وهب، أخبرني مسلم بن خالد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال خرج رسول الله صلى الله عليه وسلم فإذا أناس في رمضان يصلون في ناحية المسجد فقال ‏\"‏ ما هؤلاء ‏\"‏ ‏.‏ فقيل هؤلاء ناس ليس معهم قرآن وأبى بن كعب يصلي وهم يصلون بصلاته ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أصابوا ونعم ما صنعوا ‏\"‏ ‏.‏ قال أبو داود ليس هذا الحديث بالقوي مسلم بن خالد ضعيف ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) came out and saw that the people were praying during (the night of) Ramadan in the corner of the mosque. He asked: Who are these people ? It was said to him that those were people who had not learnt Quran. But Ubayy b. Ka'b is praying and they would pray behind him. The Prophet (ﷺ) said: They did right and it is good what they did.Abu Dawud said: This tradition is not strong, the narrator Muslim b. Khalid is weak.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "23063",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2874",
      "hadith_no": "2874",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، عن سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏ ‏.‏ قيل يا رسول الله وما هن قال ‏\"‏ الشرك بالله والسحر وقتل النفس التي حرم الله إلا بالحق وأكل الربا وأكل مال اليتيم والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات ‏\"‏ ‏.‏ قال أبو داود أبو الغيث سالم مولى ابن مطيع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: Refrain from seven (characteristics) which cause destruction. He was asked: What are they, Messenger of Allah ? He replied: To assign partner to Allah, magic, to kill a soul (man) which is prohibited by Allah except for which is due, to take usury, to consume the property of an orphan, to retreat on the day of the battle, and to slander chaste women, indiscreet but believing.Abu Dawud said: The name Abu al-Ghaith is Salim client of Ibn Muti'.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3075",
      "hadith_no": "3075",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا وهب، عن أبيه، عن ابن إسحاق، بإسناده ومعناه إلا أنه قال عند قوله مكان الذي حدثني هذا فقال رجل من أصحاب النبي صلى الله عليه وسلم وأكثر ظني أنه أبو سعيد الخدري فأنا رأيت الرجل يضرب في أصول النخل ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn Ishaq through a different chain of narrators and to the same effect. Instead of the phrase “one who transmitted this tradition to me” this version has “A man from among the Companions of the Prophet (ﷺ) and probably he was Abu Sa’id Al Khudri. I saw the man striking at the roots of the palm trees.”",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20298",
        "11272"
      ]
    },
    {
      "id": "sunan-abi-daud-3365",
      "hadith_no": "3365",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد ربه بن سعيد الأنصاري، أنه قال العرية الرجل يعري الرجل النخلة أو الرجل يستثني من ماله النخلة أو الاثنتين يأكلها فيبيعها بتمر ‏.‏",
      "text_en": " 'Abd Rabbihi b. Sa'id al-Ansari said:                      'Ariyyah means that a man gives another man a palm-tree on loan, or it means that reserves one or two palm-trees from his property for his personal use, then he sells for dried dates.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20377",
        "11191"
      ]
    },
    {
      "id": "sunan-abi-daud-3470",
      "hadith_no": "3470",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، وأحمد بن سعيد الهمداني، قالا أخبرنا ابن وهب، قال أخبرني ابن جريج، ح وحدثنا محمد بن معمر، حدثنا أبو عاصم، عن ابن جريج، - المعنى - أن أبا الزبير المكي، أخبره عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن بعت من أخيك تمرا فأصابتها جائحة فلا يحل لك أن تأخذ منه شيئا بم تأخذ مال أخيك بغير حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Messenger of Allah (ﷺ) as saying: If you were to sell dried dates to your brother and they were smitten by blight, it will not be allowable for you to take your brother's property unjustly.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "30296",
        "20029",
        "11070",
        "30172",
        "20241",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3596",
      "hadith_no": "3596",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، وأحمد بن السرح، قالا أخبرنا ابن وهب، أخبرني مالك بن أنس، عن عبد الله بن أبي بكر، أن أباه، أخبره أن عبد الله بن عمرو بن عثمان بن عفان أخبره أن عبد الرحمن بن أبي عمرة الأنصاري أخبره أن زيد بن خالد الجهني أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الشهداء الذي يأتي بشهادته أو يخبر بشهادته قبل أن يسألها ‏\"‏ ‏.‏ شك عبد الله بن أبي بكر أيتهما قال ‏.‏ قال أبو داود قال مالك الذي يخبر بشهادته ولا يعلم بها الذي هي له ‏.‏ قال الهمداني ويرفعها إلى السلطان ‏.‏ قال ابن السرح أو يأتي بها الإمام ‏.‏ والإخبار في حديث الهمداني ‏.‏ قال ابن السرح ابن أبي عمرة ‏.‏ لم يقل عبد الرحمن ‏.‏",
      "text_en": " Zaid bin Khalid al-Juhani reported the Messenger of Allah (ﷺ) as saying:                      \"Shall I not tell you of the best witnesses ? He is the one who produces his deposition or gives his evidence (the narrator is doubtful) before he is asked for it.\" 'Abd Allah bin Abi Bakr dobted which of them he said.Abu Dawud said: Malis said: This refers to a man gives his evidence, but he does not know for whom it is meant. Al-Hamdani said: \"He should inform the authorities. Ibn al-Sarh said: \"He should give it to the ruler. The work ikhbar (inform) occurs in the version of al-Hamdani.\" Ibn al-Sarh said: \"Ibn Abi 'Amrah and not 'Abd al-Rahman.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20001",
        "11104",
        "11239",
        "10933",
        "1238",
        "3625"
      ]
    },
    {
      "id": "sunan-abi-daud-3602",
      "hadith_no": "3602",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، ونافع بن يزيد، عن ابن الهاد، عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تجوز شهادة بدوي على صاحب قرية ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The testimony of a nomad Arab against a townsman is not allowable.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20379",
        "20629",
        "11234",
        "11220",
        "11020",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4102",
      "hadith_no": "4102",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، ح وحدثنا سليمان بن داود المهري، وابن السرح، وأحمد بن سعيد الهمداني، قالوا أخبرنا ابن وهب، قال أخبرني قرة بن عبد الرحمن المعافري، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، - رضى الله عنها - أنها قالت يرحم الله نساء المهاجرات الأول لما أنزل الله ‏{‏ وليضربن بخمرهن على جيوبهن ‏}‏ شققن أكنف - قال ابن صالح أكثف - مروطهن فاختمرن بها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     May Allah have mercy on the early immigrant women. When the verse \"That they should draw their veils over their bosoms\" was revealed, they tore their thick outer garments and made veils from them.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30584",
        "30485",
        "30296",
        "20029",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4116",
      "hadith_no": "4116",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وأحمد بن سعيد الهمداني، قالا أخبرنا ابن وهب، أخبرنا ابن لهيعة، عن موسى بن جبير، أن عبيد الله بن عباس، حدثه عن خالد بن يزيد بن معاوية، عن دحية بن خليفة الكلبي، أنه قال أتي رسول الله صلى الله عليه وسلم بقباطي فأعطاني منها قبطية فقال ‏\"‏ اصدعها صدعين فاقطع أحدهما قميصا وأعط الآخر امرأتك تختمر به ‏\"‏ ‏.‏ فلما أدبر قال ‏\"‏ وأمر امرأتك أن تجعل تحته ثوبا لا يصفها ‏\"‏ ‏.‏ قال أبو داود رواه يحيى بن أيوب فقال عباس بن عبيد الله بن عباس ‏.‏",
      "text_en": " Narrated Dihyah ibn Khalifah al-Kalbi:                     The Messenger of Allah (ﷺ) was brought some pieces of fine Egyptian linen and he gave me one and said: Divide it into two; cut one of the pieces into a shirt and give the other to your wife for veil. Then when he turned away, he said: And order your wife to wear a garment below it and not show her figure.Abu Dawud said: Yahya b. Ayyub transmitted it and said: 'Abbas b. 'Ubaid Allah b. 'Abbas",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30296",
        "20029",
        "20624",
        "21181",
        "17506"
      ]
    },
    {
      "id": "sunan-abi-daud-4204",
      "hadith_no": "4204",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وأحمد بن سعيد الهمداني، قالا حدثنا ابن وهب، حدثنا ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، قال أتي بأبي قحافة يوم فتح مكة ورأسه ولحيته كالثغامة بياضا فقال رسول الله صلى الله عليه وسلم ‏\"‏ غيروا هذا بشىء واجتنبوا السواد ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     Abu Quhafah was brought on the day of the conquest of Mecca with head and beard while like hyssop. The Messenger of Allah (ﷺ) said: Change this something, but avoid black.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30296",
        "20029",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4449",
      "hadith_no": "4449",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، حدثني هشام بن سعد، أن زيد بن أسلم، حدثه عن ابن عمر، قال أتى نفر من يهود فدعوا رسول الله صلى الله عليه وسلم إلى القف فأتاهم في بيت المدراس فقالوا يا أبا القاسم إن رجلا منا زنى بامرأة فاحكم بينهم فوضعوا لرسول الله صلى الله عليه وسلم وسادة فجلس عليها ثم قال ‏\"‏ ائتوني بالتوراة ‏\"‏ ‏.‏ فأتي بها فنزع الوسادة من تحته فوضع التوراة عليها ثم قال ‏\"‏ آمنت بك وبمن أنزلك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ائتوني بأعلمكم ‏\"‏ ‏.‏ فأتي بفتى شاب ثم ذكر قصة الرجم نحو حديث مالك عن نافع ‏.‏",
      "text_en": " Narrated Abdullah Ibn Umar:                     A group of Jews came and invited the Messenger of Allah (ﷺ) to Quff. So he visited them in their school.  They said: AbulQasim, one of our men has committed fornication with a woman; so pronounce judgment upon them.  They placed a cushion for the Messenger of Allah (ﷺ) who sat on it and said: Bring the Torah. It was then brought. He then withdrew the cushion from beneath him and placed the Torah on it saying: I believed in thee and in Him Who revealed thee. He then said: Bring me one who is learned among you. Then a young man was brought. The transmitter then mentioned the rest of the tradition of stoning similar to the one transmitted by Malik from Nafi'(No. 4431).",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20519",
        "11163",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4472",
      "hadith_no": "4472",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني أبو أمامة بن سهل بن حنيف، أنه أخبره بعض، أصحاب رسول الله صلى الله عليه وسلم من الأنصار أنه اشتكى رجل منهم حتى أضني فعاد جلدة على عظم فدخلت عليه جارية لبعضهم فهش لها فوقع عليها فلما دخل عليه رجال قومه يعودونه أخبرهم بذلك وقال استفتوا لي رسول الله صلى الله عليه وسلم فإني قد وقعت على جارية دخلت على ‏.‏ فذكروا ذلك لرسول الله صلى الله عليه وسلم وقالوا ما رأينا بأحد من الناس من الضر مثل الذي هو به لو حملناه إليك لتفسخت عظامه ما هو إلا جلد على عظم فأمر رسول الله صلى الله عليه وسلم أن يأخذوا له مائة شمراخ فيضربوه بها ضربة واحدة ‏.‏",
      "text_en": " Narrated Abu Umamah b. Sahl Hunaif:                     AbuUmamah ibn Sahl ibn Hunayf said that some companions of the Messenger of Allah (ﷺ) told that one of their men suffered so much from some illness that he pined away until he was skin and bone (i.e. only a skeleton). A slave-girl of someone visited him, and he was cheered by her and had unlawful intercourse with her. When his people came to visit the patient, he told them about it.  He said: Ask the Messenger of Allah (ﷺ) about the legal verdict for me, for I have had unlawful intercourse with a slave-girl who visited me.  So they mentioned it to the Messenger of Allah (ﷺ) saying: We have never seen anyone (so weak) from illness as he is. If we bring him to you, his bones will disintegrate. He is only skin and bone. So the Messenger of Allah (ﷺ) commanded them to take one hundred twigs and strike him once.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20475",
        "11013",
        "405"
      ]
    },
    {
      "id": "sunan-abi-daud-4503",
      "hadith_no": "4503",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، قال حدثنا محمد بن إسحاق، فحدثني محمد بن جعفر بن الزبير، قال سمعت زياد بن ضميرة الضمري، ح وحدثنا وهب بن بيان، وأحمد بن سعيد الهمداني، قالا حدثنا ابن وهب، أخبرني عبد الرحمن بن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر، أنه سمع زياد بن سعد بن ضميرة السلمي، - وهذا حديث وهب وهو أتم - يحدث عروة بن الزبير عن أبيه - قال موسى - وجده وكانا شهدا مع رسول الله صلى الله عليه وسلم حنينا - ثم رجعنا إلى حديث وهب - أن محلم بن جثامة الليثي قتل رجلا من أشجع في الإسلام وذلك أول غير قضى به رسول الله صلى الله عليه وسلم فتكلم عيينة في قتل الأشجعي لأنه من غطفان وتكلم الأقرع بن حابس دون محلم لأنه من خندف فارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة لا والله حتى أدخل على نسائه من الحرب والحزن ما أدخل على نسائي ‏.‏ قال ثم ارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة مثل ذلك أيضا إلى أن قام رجل من بني ليث يقال له مكيتل عليه شكة وفي يده درقة فقال يا رسول الله إني لم أجد لما فعل هذا في غرة الإسلام مثلا إلا غنما وردت فرمي أولها فنفر آخرها اسنن اليوم وغير غدا فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمسون في فورنا هذا وخمسون إذا رجعنا إلى المدينة ‏\"‏ ‏.‏ وذلك في بعض أسفاره ومحلم رجل طويل آدم وهو في طرف الناس فلم يزالوا حتى تخلص فجلس بين يدى رسول الله صلى الله عليه وسلم وعيناه تدمعان فقال يا رسول الله إني قد فعلت الذي بلغك وإني أتوب إلى الله تبارك وتعالى فاستغفر الله عز وجل لي يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته بسلاحك في غرة الإسلام اللهم لا تغفر لمحلم ‏\"‏ ‏.‏ بصوت عال زاد أبو سلمة فقام وإنه ليتلقى دموعه بطرف ردائه قال ابن إسحاق فزعم قومه أن رسول الله صلى الله عليه وسلم استغفر له بعد ذلك ‏.‏ قال أبو داود قال النضر بن شميل الغير الدية ‏.‏",
      "text_en": " Narrated Ziyad ibn Sa'd ibn Dumayrah as-Sulami:                     On the authority of his father (Sa'd) and his grandfather (Dumayrah) (according to Musa's version) who were present in the battle of Hunayn with the Messenger of Allah (ﷺ): After the advent of Islam, Muhallam ibn Jaththamah al-Laythi killed a man of Ashja'. That was the first blood-money decided by the Messenger of Allah (ﷺ) (for payment). Uyaynah spoke about the killing of al-Ashja'i, for he belonged to Ghatafan, and al-Aqra' ibn Habis spoke on behalf of Muhallam, for he belonged to Khunduf. The voices rose high, and the dispute and noise grew.  So the Messenger of Allah (ﷺ) said: Do you not accept blood-money, Uyaynah?  Uyaynah then said: No, I swear by Allah, until I cause his women to suffer the same fighting and grief as he caused my women to suffer. Again the voices rose high, and the dispute and noise grew.  The Messenger of Allah (ﷺ) said: Do you not accept the blood-money Uyaynah? Uyaynah gave the same reply as before, and a man of Banu Layth called Mukaytil stood up. He had a weapon and a skin shield in his hand.  He said: I do not find in the beginning of Islam any illustration for what he has done except the one that \"some sheep came on, and those in the front were shot; hence those in the rear ran away\". (The other example is that) \"make a law today and change it.\"  The Messenger of Allah (ﷺ) said: Fifty (camels) here immediately and fifty when we return to Medina. This happened during some of his journeys. Muhallam was a tall man of dark complexion. He was with the people. They continued (to make effort for him) until he was released. He sat before the Messenger of Allah (ﷺ), with his eyes flowing.  He said: Messenger of Allah! I have done (the act) of which you have been informed. I repent to Allah, the Exalted, so ask Allah's forgiveness for me. Messenger of Allah!  The Messenger of Allah (ﷺ) then said: Did you kill him with your weapon at the beginning of Islam. O Allah! do not forgive Muhallam. He said these words loudly.  AbuSalamah added: He (Muhallam) then got up while he was wiping his tears with the end of his garment.  Ibn Ishaq said: His people alleged that the Messenger of Allah (ﷺ) asked forgiveness for him after that.Abu Dawud said: Al-Nadr b. Shumail said: al-ghiyar means blood-wit.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11107",
        "36063",
        "30296",
        "20029",
        "20509",
        "448",
        "20173"
      ]
    },
    {
      "id": "sunan-abi-daud-4720",
      "hadith_no": "4720",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، أخبرنا ابن وهب، قال أخبرني ابن لهيعة، وعمرو بن الحارث، وسعيد بن أبي أيوب، عن عطاء بن دينار، عن حكيم بن شريك الهذلي، عن يحيى بن ميمون، عن ربيعة الجرشي، عن أبي هريرة، عن عمر بن الخطاب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تجالسوا أهل القدر ولا تفاتحوهم الحديث ‏\"‏ ‏.‏",
      "text_en": " ‘Umar b. al-Khattab reported the Messenger of Allah (May peace be upon him) as saying :                      Do not sit with those who believe in free will and do not address them before they address you.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20624",
        "20377",
        "20375",
        "16075",
        "26009",
        "24500",
        "14894",
        "13",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-4912",
      "hadith_no": "4912",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، وأحمد بن سعيد السرخسي، أن أبا عامر، أخبرهم قال حدثنا محمد بن هلال، قال حدثني أبي، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لمؤمن أن يهجر مؤمنا فوق ثلاث فإن مرت به ثلاث فليلقه فليسلم عليه فإن رد عليه السلام فقد اشتركا في الأجر وإن لم يرد عليه فقد باء بالإثم ‏\"‏ ‏.‏ زاد أحمد ‏\"‏ وخرج المسلم من الهجرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not allowable for a believer to keep from a believer for more than three days. If three days pass, he should meet him and give him a salutation, and if he replies to it they will both have shared in the reward; but if he does not reply he will bear his sin (according to Ahmad's version) and the one who gives the salutation will have come forth from the sin of keeping apart.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30296",
        "20443",
        "12489",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5076",
      "hadith_no": "5076",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، قال أخبرنا ح، وحدثنا الربيع بن سليمان، قال حدثنا ابن وهب، قال أخبرني الليث، عن سعيد بن بشير النجاري، عن محمد بن عبد الرحمن البيلماني، - قال الربيع ابن البيلماني - عن أبيه، عن ابن عباس، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من قال حين يصبح ‏{‏ فسبحان الله حين تمسون وحين تصبحون * وله الحمد في السموات والأرض وعشيا وحين تظهرون ‏}‏ إلى ‏{‏ وكذلك تخرجون ‏}‏ أدرك ما فاته في يومه ذلك ومن قالهن حين يمسي أدرك ما فاته في ليلته ‏\"‏ ‏.‏ قال الربيع عن الليث ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone repeats in the morning: \"So glory be to Allah in the evening and in the morning; to Him is the praise in the heavens and the earth, and in the late evening and at noon....thus shall you be brought forth, \" he will get that day what he has missed; and if anyone repeats these words in the evening he will get that night what he has missed. Ar-Rabi' transmitted it from al-Layth.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30583",
        "20029",
        "20023",
        "20710",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-5116",
      "hadith_no": "5116",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا المعافى، ح وحدثنا أحمد بن سعيد الهمداني، أخبرنا ابن وهب، - وهذا حديثه - عن هشام بن سعد، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل قد أذهب عنكم عبية الجاهلية وفخرها بالآباء مؤمن تقي وفاجر شقي أنتم بنو آدم وآدم من تراب ليدعن رجال فخرهم بأقوام إنما هم فحم من فحم جهنم أو ليكونن أهون على الله من الجعلان التي تدفع بأنفها النتن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Allah, Most High, has removed from you the pride of the pre-Islamic period and its boasting in ancestors. One is only a pious believer or a miserable sinner. You are sons of Adam, and Adam came from dust. Let the people cease to boast about their ancestors. They are merely fuel in Jahannam; or they will certainly be of less account with Allah than the beetle which rolls dung with its nose.",
      "usc_msa_ref": "",
      "chain": [
        "35154",
        "30296",
        "20029",
        "20519",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5145",
      "hadith_no": "5145",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، قال حدثني عمرو بن الحارث، أن عمر بن السائب، حدثه أنه، بلغه أن رسول الله صلى الله عليه وسلم كان جالسا يوما فأقبل أبوه من الرضاعة فوضع له بعض ثوبه فقعد عليه ثم أقبلت أمه فوضع لها شق ثوبه من جانبه الآخر فجلست عليه ثم أقبل أخوه من الرضاعة فقام له رسول الله صلى الله عليه وسلم فأجلسه بين يديه ‏.‏",
      "text_en": " Narrated Umar ibn as-Sa'ib:                     One day when the Messenger of Allah (ﷺ) was sitting, his foster-father came forward. He spread out of a part of his garment and he sit on it. Then his mother came forward to him and he spread out the other side of his garment and she sat on it. Again , his foster-brother came forward. The Messenger of Allah (ﷺ) stood for him and seated him before himself.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20377"
      ]
    },
    {
      "id": "sunan-abi-daud-5164",
      "hadith_no": "5164",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، وأحمد بن عمرو بن السرح، - وهذا حديث الهمداني وهو أتم - قالا حدثنا ابن وهب قال أخبرني أبو هانئ الخولاني عن العباس بن جليد الحجري قال سمعت عبد الله بن عمرو يقول جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله كم نعفو عن الخادم فصمت ثم أعاد عليه الكلام فصمت فلما كان في الثالثة قال ‏\"‏ اعفوا عنه في كل يوم سبعين مرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     A man came to the Prophet (ﷺ) and asked: Messenger of Allah! how often shall I forgive a servant? He gave no reply, so the man repeated what he had said, but he still kept silence. When he asked a third time, he replied: Forgive him seventy times daily.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30485",
        "20029",
        "10856",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-5200",
      "hadith_no": "5200",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، قال أخبرني معاوية بن صالح، عن أبي موسى، عن أبي مريم، عن أبي هريرة، قال إذا لقي أحدكم أخاه فليسلم عليه فإن حالت بينهما شجرة أو جدار أو حجر ثم لقيه فليسلم عليه أيضا ‏.‏ قال معاوية وحدثني عبد الوهاب بن بخت عن أبي الزناد عن الأعرج عن أبي هريرة عن رسول الله صلى الله عليه وسلم مثله سواء ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When one of you meets his brother, he should salute him, then if he meets him again after a tree, wall or stone has come between them, he should also salute him.Mu'awiyah said: 'Abd al-Wahhab b. Bakht transmitted a similar tradition to me from Abu al-Zinad, from al-A'raj, from Abu Hurairah, from the Messenger of Allah (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20675",
        "19370",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5255",
      "hadith_no": "5255",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، وأحمد بن سعيد الهمداني، قالا أخبرنا ابن وهب، قال أخبرني أسامة، عن نافع، في هذا الحديث قال نافع ثم رأيتها بعد في بيته ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Nafi through a different chain of transmitters. In this version Nafi said:                      After that I saw it again in his house.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30296",
        "20029",
        "50"
      ]
    },
    {
      "id": "sunan-abi-daud-5259",
      "hadith_no": "5259",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، أخبرنا ابن وهب، قال أخبرنا مالك، عن صيفي، مولى ابن أفلح قال أخبرني أبو السائب، مولى هشام بن زهرة أنه دخل على أبي سعيد الخدري فذكر نحوه وأتم منه قال ‏\"‏ فآذنوه ثلاثة أيام فإن بدا لكم بعد ذلك فاقتلوه فإنما هو شيطان ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Sa'id al-Khudri in a similar manner through a different chain of narrators. This version is more perfect. In this version he said :                      give it a warning for three days; if it appears to you after that, then kill it, for it is only a devil.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20001"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1258",
      "hadith_no": "1258",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا حبان، وهو ابن هلال أبو حبيب البصري حدثنا هارون الأعور المقرئ، وهو ابن موسى القارئ حدثنا الزبير بن الخريت، عن أبي لبيد، عن عروة البارقي، قال دفع إلى رسول الله صلى الله عليه وسلم دينارا لأشتري له شاة فاشتريت له شاتين فبعت إحداهما بدينار وجئت بالشاة والدينار إلى النبي صلى الله عليه وسلم ‏.‏ فذكر له ما كان من أمره فقال له ‏\"‏ بارك الله لك في صفقة يمينك ‏\"‏ ‏.‏ فكان يخرج بعد ذلك إلى كناسة الكوفة فيربح الربح العظيم فكان من أكثر أهل الكوفة مالا ‏.‏",
      "text_en": " Narrated 'Urwah Al-Bariqi:                     \"The Messenger of Allah (ﷺ) gave me on Dinar to purchase a sheep for him. So I purchased two sheeps for him, and I sold one of them for a Dinar. So I returned with the sheep and the Dinar to the Prophet (ﷺ), and I mentioned what had happened and he said: 'May Allah bless you in your business dealings.' After that we went to Kunasah in Al-Kufah, and he made tremendous profits. He was among the wealthiest of the people in Al-Kufah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "11587",
        "5176"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1258-2",
      "hadith_no": "1258",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا سعيد بن زيد، هو أخو حماد بن زيد قال حدثنا الزبير بن خريت، عن أبي لبيد، فذكر نحوه ‏.‏ قال أبو عيسى وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا به وهو قول أحمد وإسحاق ‏.‏ ولم يأخذ بعض أهل العلم بهذا الحديث منهم الشافعي ‏.‏ وسعيد بن زيد أخو حماد بن زيد ‏.‏ وأبو لبيد اسمه لمازة بن زبار ‏.‏",
      "text_en": " Another chain of narration with similar meaning.[Abu 'Eisa said:                     ] Some of the people of knowledge followed this Hadith and stated their view accordingly. This is the view of Ahmad and Ishaq. Some of the people of knowledge did not use this Hadith, among them are Ash-Shafi'i and Sa'eed bin Zaid the brother of Hammad bin Zaid. And Abu Labid's (a narrator) name is Limazah bin Zabbar.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "11"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1387",
      "hadith_no": "1387",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، أخبرنا حبان، وهو ابن هلال حدثنا محمد بن راشد، أخبرنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل مؤمنا متعمدا دفع إلى أولياء المقتول فإن شاءوا قتلوا وإن شاءوا أخذوا الدية وهي ثلاثون حقة وثلاثون جذعة وأربعون خلفة وما صالحوا عليه فهو لهم ‏\"‏ ‏.‏ وذلك لتشديد العقل ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن غريب ‏.‏",
      "text_en": " Narrated Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) said: \"Whoever kills [a believer] deliberately, he is handed over to the guardians of the one killed. If they wish to, they have him killed, and if they wish to, they take the blood-money. That is thirty Hiqqah, thirty Jadha'ahs and forty pregnant camels. Whatever (amount more) they require from him, than that is for them (if they choose).\" THat is because of the severity of blood-money.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1817",
      "hadith_no": "1817",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر، وإبراهيم بن يعقوب، قالا حدثنا يونس بن محمد، حدثنا المفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فأدخله معه في القصعة ثم قال ‏\"‏ كل بسم الله ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث يونس بن محمد عن المفضل بن فضالة ‏.‏ والمفضل بن فضالة هذا شيخ بصري والمفضل بن فضالة شيخ آخر مصري أوثق من هذا وأشهر ‏.‏ وقد روى شعبة هذا الحديث عن حبيب بن الشهيد عن ابن بريدة أن ابن عمر أخذ بيد مجذوم وحديث شعبة أثبت عندي وأصح ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"The Messenger of Allah (ﷺ) took the hand of a leper and put it in the Qas'ah. Then he said: 'Eat in Allah's Name, trusting in Allah and relying upon Him.'\"[Abu 'Eisa said:] This is a Gharib Hadith, we do not know of it except through the report of Yunus bin Muhammad, from Al-Mufaddal bin Fadalah, a Shaikh from Al-Basrah. There is another Shaikh from Al-Basrah named Al-Mufaddal bin Fadalah, who is more reliable han this one and more popular. Shu'bah reported this Hadith from Habib bin Ash-Shahid, from Ibn Buraidah: \"That Ibn 'Umar took the hand of a leper\" and the narration of Shu'bah is more appropriate to me and more correct.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "38088",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2228",
      "hadith_no": "2228",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر الرباطي، حدثنا روح بن عبادة، حدثنا مرزوق أبو عبد الله الشامي، حدثنا سعيد، رجل من أهل الشام أخبرنا ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أصاب أحدكم الحمى فإن الحمى قطعة من النار فليطفئها عنه بالماء فليستنقع نهرا جاريا ليستقبل جرية الماء فيقول بسم الله اللهم اشف عبدك وصدق رسولك بعد صلاة الصبح قبل طلوع الشمس فليغتمس فيه ثلاث غمسات ثلاثة أيام فإن لم يبرأ في ثلاث فخمس وإن لم يبرأ في خمس فسبع فإن لم يبرأ في سبع فتسع فإنها لا تكاد تجاوز تسعا بإذن الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Thawban narrated that the Prophet (S.A.W) said:                     \"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummasahfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20229",
        "130"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2266-2",
      "hadith_no": "2266",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر، حدثنا يونس بن محمد، وهاشم بن القاسم، قالا حدثنا صالح المري، عن سعيد الجريري، عن أبي عثمان النهدي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان أمراؤكم خياركم وأغنياؤكم سمحاءكم وأموركم شورى بينكم فظهر الأرض خير لكم من بطنها وإذا كان أمراؤكم شراركم وأغنياؤكم بخلاءكم وأموركم إلى نسائكم فبطن الأرض خير لكم من ظهرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث صالح المري ‏.‏ وصالح المري في حديثه غرائب ينفرد بها لا يتابع عليها وهو رجل صالح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"When your leaders are the best of you, the richest are the most generous among you, and your affairs are consulted among you, then the surface of the earth is better for you than its belly. And when your leaders are the worst of you, the richest are the stingiest among you, and your affairs are referred to your women, then the belly of the earth is better for you than its surface.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20393",
        "20390",
        "24207",
        "11286",
        "11113",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2405",
      "hadith_no": "2405",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا محمد بن عباد، أخبرنا حاتم بن إسماعيل، أخبرنا حمزة بن أبي محمد، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى قال لقد خلقت خلقا ألسنتهم أحلى من العسل وقلوبهم أمر من الصبر فبي حلفت لأتيحنهم فتنة تدع الحليم منهم حيرانا فبي يغترون أم على يجترءون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عمر لا نعرفه إلا من هذا الوجه.",
      "text_en": " Ibn 'Umar narrated that the Prophet(s.a.w) said:                     \"Indeed Allah, Most High, said:'I have created creatures whose tongues are sweeter than honey and their hearts are more bitter than aloes. So by Me, I swear to abase them with a Fitnah, leaving them utterly devoid of reason. Is it Me whom they try to delude, or it is  against Me whom they conspire?'\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30377",
        "20159",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3130",
      "hadith_no": "3130",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أحمد بن سعيد الدارمي، حدثنا قتيبة، عن حميد بن عبد الرحمن، بهذا ‏.‏ وفي الباب عن أبي بكر الصديق، ولا يصح حديث أبي بكر من قبل إسناده إسناده ضعيف ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30367",
        "10561",
        "2"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4208",
      "hadith_no": "4208",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أحمد بن سعيد الحراني، حدثني محمد بن سلمة الحراني، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن مالك بن أبي عامر، قال جاء رجل إلى طلحة بن عبيد الله فقال يا أبا محمد أرأيت هذا اليماني يعني أبا هريرة هو أعلم بحديث رسول الله صلى الله عليه وسلم منكم نسمع منه ما لا نسمع منكم أو يقول على رسول الله صلى الله عليه وسلم ما لم يقل ‏.‏ قال أما أن يكون سمع من رسول الله صلى الله عليه وسلم ما لم نسمع فلا أشك إلا أنه سمع من رسول الله صلى الله عليه وسلم ما لم نسمع وذاك أنه كان مسكينا لا شىء له ضيفا لرسول الله صلى الله عليه وسلم يده مع يد رسول الله صلى الله عليه وسلم وكنا نحن أهل بيوتات وغنى وكنا نأتي رسول الله صلى الله عليه وسلم طرفى النهار فلا نشك إلا أنه سمع من رسول الله صلى الله عليه وسلم ما لم نسمع ولا نجد أحدا فيه خير يقول على رسول الله صلى الله عليه وسلم ما لم يقل ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن إسحاق ‏.‏ وقد رواه يونس بن بكير وغيره عن محمد بن إسحاق ‏.‏",
      "text_en": " Narrated Malik bin Abi 'Amir:                     \"A man came to Talhah bin 'Ubaidullah and said: 'O Abu Muhammad, do you see this Yemeni - meaning: Abu Hurairah - is he more knowledgeable of Ahadith of the Messenger of Allah (ﷺ) than you? We hear from him what we do not hear from you, or does he attribute to the Messenger of Allah (ﷺ) what he did not say?' He said: 'As for his having heard from the Messenger of Allah (ﷺ) what we did not hear from him, then that is because he was poor, having nothing, a guest of the Messenger of Allah (ﷺ), his hand was in the hand of the Messenger of Allah (ﷺ). And we used to be people of houses and wealth, and we used to come to the Messenger of Allah (ﷺ) at the two ends of the day. I do not doubt that he heard from the Messenger of Allah (ﷺ) what we did not hear, and you will not find anyone in whom there is good attributing to the Messenger of Allah (ﷺ) what he did not say.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30296",
        "20672",
        "11107",
        "11213"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4211",
      "hadith_no": "4211",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن سعيد المرابطي، حدثنا روح بن عبادة، حدثنا أسامة بن زيد، عن عبد الله بن رافع، قال قلت لأبي هريرة لم كنيت أبا هريرة قال أما تفرق مني قلت بلى والله إني لأهابك ‏.‏ قال كنت أرعى غنم أهلي فكانت لي هريرة صغيرة فكنت أضعها بالليل في شجرة فإذا كان النهار ذهبت بها معي فلعبت بها فكنوني أبا هريرة ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Abdullah bin Rafi':                     \"I said to Abu Hurairah: 'Why were you given the Kunyah Abu Hurairah?' He said: 'Do you not fear me?'\" He said: \"Indeed, I am in awe of you.' He said: 'I used to tend the sheep of my people, and I had a small kitten; so I used to place it in a tree at night, and during the day I would take it and play with it. So they named me Abu Hurairah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20229",
        "50",
        "11864"
      ]
    },
    {
      "id": "sunan-an-nasai-1633",
      "hadith_no": "1633",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرني أحمد بن سعيد، قال حدثنا حبان، قال حدثنا حماد بن سلمة، قال أنبأنا ثابت، وسليمان التيمي، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ مررت على قبر موسى عليه السلام وهو يصلي في قبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     The Prophet (ﷺ) said: \"I passed by the grave of Musa, peace be upon him, and he was praying in his grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20021",
        "11269",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-3793",
      "hadith_no": "3793",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني أحمد بن سعيد، قال حدثنا حبان، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف فاستثنى فإن شاء مضى وإن شاء ترك غير حنث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet said:                      \"Whoever swears an oath and says: 'If Allah wills', then if he wishes he may go ahead, and if he wishes he may not, without having broken his oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20258",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4162",
      "hadith_no": "4162",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرني أحمد بن سعيد، قال حدثنا يعقوب، قال حدثنا أبي، عن صالح بن كيسان، عن الحارث بن فضيل، أن ابن شهاب، حدثه عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا تبايعوني على ما بايع عليه النساء أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا أولادكم ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف ‏\"‏ ‏.‏ قلنا بلى يا رسول الله فبايعناه على ذلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن أصاب بعد ذلك شيئا فنالته عقوبة فهو كفارة ومن لم تنله عقوبة فأمره إلى الله إن شاء غفر له وإن شاء عاقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin As-Samit that the Messenger of Allah said:                     \"Why don't you pledge to me upon that which the women have pledged: That you will not associate anything with Allah, that you will not steal, that you will not have unlawful sexual relations, that you will not utter slander, fabricating from between your hands and feet, and that you will not disobey me in goodness (Ma'ruf)?\" We said: \"yes, O Messenger of Allah.\" So we gave him our pledge, on that basis. The Messenger of Allah said: \"Whoever commits any of these actions after that, and is punished, that will be an expiation. Whoever is not punished, then his affair is up to Allah; if He wills, He will forgive him, and if He wills, He will punish him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20184",
        "20150",
        "11176",
        "11835",
        "11013",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-5253",
      "hadith_no": "5253",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سعيد، قال حدثنا وهب بن جرير، حدثنا أبي قال، سمعت الأعمش، يحدث عن إبراهيم، عن علقمة، عن عبد الله، قال لعن رسول الله صلى الله عليه وسلم الواشمات والمتفلجات والمتنمصات المغيرات خلق الله عز وجل ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] cursed the women who do tattoos, those who have their teeth separated and Al-Mutanammisat who change the creation of Allah, the Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5261",
      "hadith_no": "5261",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سعيد، قال حدثنا يعقوب بن إبراهيم، قال حدثنا أبي، عن صالح، عن محمد بن عبد الله بن عمرو بن هشام، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، أخبرتني زينب الثقفية، امرأة عبد الله أن رسول الله صلى الله عليه وسلم قال لها ‏\"‏ إذا خرجت إلى العشاء فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Busr bin Sa'eed that Zainab, the wife of 'Abdullah, told him that :                     The Messenger of Allah [SAW] said to her: \"If you go out to 'Isha' then do not touch any perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20184",
        "20150",
        "11176",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sunan-ibn-majah-155",
      "hadith_no": "155",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا يحيى بن أبي بكير، حدثنا زائدة بن قدامة، عن عاصم بن أبي النجود، عن زر بن حبيش، عن عبد الله بن مسعود، قال كان أول من أظهر إسلامه سبعة رسول الله  صلى الله عليه وسلم  وأبو بكر وعمار وأمه سمية وصهيب وبلال والمقداد فأما رسول الله  صلى الله عليه وسلم  فمنعه الله بعمه أبي طالب وأما أبو بكر فمنعه الله بقومه وأما سائرهم فأخذهم المشركون وألبسوهم أدراع الحديد وصهروهم في الشمس فما منهم من أحد إلا وقد واتاهم على ما أرادوا إلا بلالا فإنه قد هانت عليه نفسه في الله وهان على قومه فأخذوه فأعطوه الولدان فجعلوا يطوفون به في شعاب مكة وهو يقول أحد أحد ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The first people to declare their Islam publicly were seven: The Messenger of Allah, Abu Bakr, 'Ammar and his mother Sumayyah, Suhaib, Bilal and Miqdad. With regard to the Messenger of Allah, Allah protected him through his paternal uncle Abu Talib. With regard to Abu Bakr, Allah protected him through his people. As for the rest, the idolators seized them and made them wear coats of chain-mail and exposed them to the intense heat of the sun. There was none of them who did not do what they wanted them to do, except for Bilal. He did not care what happened to him for the sake of Allah, and his people did not care what happened to him. Then they gave him to the children who took him around in the streets of Makkah while he was saying, 'Ahad, Ahad (One, One).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20365",
        "20320",
        "11358",
        "11337",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-377",
      "hadith_no": "377",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن محمد الطلحي، وأحمد بن سعيد الدارمي، قالا حدثنا روح بن عبادة، عن سعيد، عن قتادة، عن الحسن، عن حضين بن المنذر بن الحارث بن وعلة أبي ساسان الرقاشي، عن المهاجر بن قنفذ بن عمير بن جدعان، قال أتيت النبي  صلى الله عليه وسلم  وهو يتوضأ فسلمت عليه فلم يرد على السلام فلما فرغ من وضوئه قال ‏\"‏ إنه لم يمنعني من أن أرد عليك إلا أني كنت على غير وضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muhajir bin Qunfudh bin (Umair) bin Jud'an said:                     \"I came to the Prophet when he was performing ablution and greeted him with the Salam, but he did not return (the greeting). When he had finished his ablution he said: 'Nothing prevented me from returning your greeting but the fact that I need to have ablution.'\" (Da'if)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20229",
        "11168",
        "11019",
        "11016"
      ]
    },
    {
      "id": "sunan-ibn-majah-801",
      "hadith_no": "801",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا النضر بن شميل، حدثنا حماد، عن ثابت، عن أبي أيوب، عن عبد الله بن عمرو، قال صلينا مع رسول الله  صلى الله عليه وسلم  المغرب فرجع من رجع وعقب من عقب فجاء رسول الله  صلى الله عليه وسلم  مسرعا قد حفزه النفس و قد حسر عن ركبتيه فقال ‏\"‏ أبشروا هذا ربكم قد فتح بابا من أبواب السماء يباهي بكم الملائكة يقول انظروا إلى عبادي قد قضوا فريضة وهم ينتظرون أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"We performed the Maghrib (prayer) with the Messenger of Allah, then those who went back went back, and those who stayed, stayed. Then the Messenger of Allah came back in a hurry, out of breath, with his garment pulled up to his knees, and said: 'Be of good cheer, for your Lord has opened one of the gates of heaven and is boasting of you before the angels, saying: \"Look at My slaves; they have fulfilled one obligatory duty and are awaiting another.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20291",
        "20022",
        "11269",
        "33",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-1072",
      "hadith_no": "1072",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا النضر بن شميل، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال كنا نسلم في الصلاة فقيل لنا إن في الصلاة لشغلا ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah said:                      “We would greet others duringtheprayer, and it was said to us: ‘During the prayer one ispreoccupied.’”",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20291",
        "10846",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1492",
      "hadith_no": "1492",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا سليمان بن حرب، حدثنا حماد بن سلمة، عن داود بن أبي هند، عن زرارة بن أوفى، عن تميم الداري، عن النبي  صلى الله عليه وسلم  ح وحدثنا الحسن بن محمد بن الصباح، حدثنا عفان، حدثنا حماد، أنبأنا حميد، عن الحسن، عن رجل، عن أبي هريرة، وداود بن أبي هند، عن زرارة بن أوفى، عن تميم الداري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أول ما يحاسب به العبد يوم القيامة صلاته فإن أكملها كتبت له نافلة فإن لم يكن أكملها قال الله سبحانه لملائكته انظروا هل تجدون لعبدي من تطوع فأكملوا بها ما ضيع من فريضته ‏.‏ ثم تؤخذ الأعمال على حسب ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Tamim Dari that the Prophet (ﷺ) said:                      “Thefirstthing for which a person will be brought to account on the DayofResurrection will be his prayer. If it is complete, then thevoluntary (prayers) will also be recorded for him (as an increase).Ifit is not complete then Allah will say to His angels: ‘Look andseewhether you find any voluntary prayers for My slave, and takethem tomake up what is lacking from his obligatory prayers.’ Thenall hisdeeds will be reckoned in like manner.”",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20193",
        "20021",
        "11585",
        "11284",
        "382"
      ]
    },
    {
      "id": "sunan-ibn-majah-2126",
      "hadith_no": "2126",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا علي بن الحسين بن واقد، حدثنا هشام بن سعد، عن الزهري، عن عروة، عن المسور بن مخرمة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا طلاق قبل نكاح ولا عتق قبل ملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miswar bin Makharamah that the Prophet (ﷺ) said:                     \"There is no divorce before marriage, and no manumission before taking possession.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30555",
        "20519",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2494",
      "hadith_no": "2494",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا حبان بن هلال، حدثنا سعيد بن زيد، عن الزبير بن الخريت، عن أبي لبيد، لمازة بن زبار عن عروة بن أبي الجعد البارقي، قال قدم جلب فأعطاني النبي صلى الله عليه وسلم دينارا فذكر نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "11",
        "11587",
        "14339"
      ]
    },
    {
      "id": "sunan-ibn-majah-2743",
      "hadith_no": "2743",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا أبو عاصم، أخبرني ابن جريج، حدثني عمرو بن دينار، أنه سمع طاوسا، عن ابن عباس، عن عمر بن الخطاب، أنه نشد الناس قضاء النبي صلى الله عليه وسلم في ذلك يعني في الجنين فقام حمل بن مالك بن النابغة فقال كنت بين امرأتين لي فضربت إحداهما الأخرى بمسطح فقتلتها وقتلت جنينها فقضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد وأن تقتل بها ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that :                     he asked the people about the ruling of the Prophet (ﷺ) concerning that - concerning a fetus. Hamal bin Malik bin Nabighah stood up and said: “I was between my two wives and one of them struck the other with a tent-pole, killing her and a fetus. The Messenger of Allah (ﷺ) ruled that the blood money for the fetus was a slave, and that she would be killed in retaliation.”",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20241",
        "11070",
        "11081",
        "11053",
        "17",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-3464",
      "hadith_no": "3464",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسحاق بن منصور، وأحمد بن سعيد الدارمي، قالا حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، حدثنا قتادة، قال كنا نأتي أنس بن مالك - قال إسحاق وخبازه قائم وقال الدارمي وخوانه موضوع - فقال يوما كلوا فما أعلم رسول الله  صلى الله عليه وسلم  رأى رغيفا مرققا بعينه حتى لحق بالله ولا شاة سميطا قط ‏.‏",
      "text_en": " Qatadahsaid:                      “We used to go to (visit) Anas bin Malik.” (One of thenarrators) Ishaq said: “And his baker was standing there.” (Inanothernarration) Darimi said: “And his table was set. He said oneday:‘(Come and) eat, for the Messenger of Allah (ﷺ) never sawany thinloaf of bread until he met Allah, nor any roasted sheep(withskin).’”*",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30296",
        "20250",
        "20297",
        "11019"
      ]
    },
    {
      "id": "sunan-ibn-majah-3621",
      "hadith_no": "3621",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، غندر حدثنا شعبة، ح وحدثنا أحمد بن سعيد الدارمي، حدثنا النضر بن شميل، حدثنا شعبة، حدثنا محمد بن عبد الرحمن بن سعد بن زرارة الأنصاري، قال سمعت عمي، يحيى - وما أدركت رجلا منا به شبيها يحدث الناس أن سعد بن زرارة - وهو جد محمد من قبل أمه أنه أخذه وجع في حلقه يقال له الذبحة فقال النبي  صلى الله عليه وسلم  ‏\"‏ لأبلغن أو لأبلين في أبي أمامة عذرا ‏\"‏ ‏.‏ فكواه بيده فمات فقال النبي  صلى الله عليه وسلم  ‏\"‏ ميتة سوء لليهود يقولون أفلا دفع عن صاحبه ‏.‏ وما أملك له ولا لنفسي شيئا ‏\"‏ ‏.‏",
      "text_en": " Muhammadbin ‘Abdur-Rahman bin Sa’d bin Zurarah Al-Ansari said:                      “Iheardmy paternal uncle Yahya – and I have not seen a man among uslikehim – tell the people that Sa'd bin Zurarah, who was thegrandfather of Muhammad through his mother, was suffering from paininhis throat, known as croup. The Prophet (ﷺ) said: ‘I shall domybest for Abu Umamah.’ Such that I will be excused (i.e., free ofblameif he is not healed). And he cauterized him with his own hand,but hedied. The Prophet (sw) said: ‘May the Jews be doomed! Theywill say:“Why could he not avert death from his Companions?” ButI have nopower to do anything for him or for my own self.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30160",
        "20278",
        "20020",
        "30296",
        "20291",
        "20020"
      ]
    }
  ],
  "total_hadiths": 76
}