{
  "id": "30298",
  "name": "Ahmed bin Abi Sarayj أحمد بن أبي سريج",
  "full_name": "Ahmed bin Abi Sarayj أحمد بن أبي سريج",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  د  س  -  ثقة حافظ ]",
      "Recitation/Quran"
    ],
    "tags": [
      "al-Razi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "332",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن أبي سريج، قال أخبرنا شبابة، قال أخبرنا شعبة، عن حسين المعلم، عن ابن بريدة، عن سمرة بن جندب، أن امرأة، ماتت في بطن، فصلى عليها النبي صلى الله عليه وسلم فقام وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet offered the funeral prayer for the dead body of a woman who died during delivery (i.e. childbirth) and he stood by the middle of her body.",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "4103",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن أبي سريج، أخبرنا عبيد الله بن موسى، حدثنا شيبان، عن فراس، عن الشعبي، قال حدثني جابر بن عبد الله  رضى الله عنهما أن أباه، استشهد يوم أحد وترك عليه دينا، وترك ست بنات، فلما حضر جذاذ النخل قال أتيت رسول الله صلى الله عليه وسلم فقلت قد علمت أن والدي قد استشهد يوم أحد، وترك دينا كثيرا، وإني أحب أن يراك الغرماء‏.‏ فقال ‏\"‏ اذهب فبيدر كل تمر على ناحية ‏\"‏‏.‏ ففعلت ثم دعوته، فلما نظروا إليه كأنهم أغروا بي تلك الساعة، فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات، ثم جلس عليه، ثم قال ‏\"‏ ادع لك أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله عن والدي أمانته، وأنا أرضى أن يؤدي الله أمانة والدي، ولا أرجع إلى أخواتي بتمرة، فسلم الله البيادر كلها وحتى إني أنظر إلى البيدر الذي كان عليه النبي صلى الله عليه وسلم كأنها لم تنقص تمرة واحدة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     That his father was martyred on the day of the battle of Uhud and was in debt and left six (orphan) daughters. Jabir, added, \"When the season of plucking the dates came, I went to Allah's Apostle and said, \"You know that my father was martyred on the day of Uhud, and he was heavily in debt, and I would like that the creditors should see you.\" The Prophet said, \"Go and pile every kind of dates apart.\" I did so and called him (i.e. the Prophet ). When the creditors saw him, they started claiming their debts from me then in such a harsh manner (as they had never done before). So when he saw their attitude, he went round the biggest heap of dates thrice, and then sat over it and said, 'O Jabir), call your companions (i.e. the creditors).' Then he kept on measuring (and giving) to the creditors (their due) till Allah paid all the debt of my father. I would have been satisfied to retain nothing of those dates for my sisters after Allah had paid the debts of my father. But Allah saved all the heaps (of dates), so that when I looked at the heap where the Prophet had been sitting, it seemed as if a single date had not been taken away thereof.\"",
      "chain": [
        "30298",
        "20340",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "7635",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن أبي سريج، أخبرنا شبابة، حدثنا شعبة، عن معاوية بن قرة، عن عبد الله بن مغفل المزني، قال رأيت رسول الله صلى الله عليه وسلم يوم الفتح على ناقة له يقرأ سورة الفتح، أو من سورة الفتح  قال  فرجع فيها  قال  ثم قرأ معاوية يحكي قراءة ابن مغفل وقال ‏\"‏ لولا أن يجتمع الناس عليكم لرجعت كما رجع ابن مغفل ‏\"‏‏.‏ يحكي النبي صلى الله عليه وسلم فقلت لمعاوية كيف كان ترجيعه قال آ آ آ ثلاث مرات‏.‏",
      "text_en": " Narrated Shu`ba:                     Mu'awiya bin Qurra reported that `Abdullah bin Al-Maghaffal Al-Muzani said, \"I saw Allah's Apostle on the day of the Conquest of Mecca, riding his she-camel and reciting Surat-al-Fath (48) or part of Surat-al-Fath. He recited it in a vibrating and pleasant voice. Then Mu'awiya recited as `Abdullah bin Mughaffal had done and said, \"Were I not afraid that the people would crowd around me, I would surely recite in a vibrating pleasant voice as Ibn Mughaffal did, imitating the Prophet.\" I asked Muawiya, \"How did he recite in that tone?\" He said thrice, \"A, A , A.\"",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "hadith_no": "310",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن أبي سريج الرازي، أخبرنا عبد الله بن الجهم، حدثنا عمرو بن أبي قيس، عن عاصم، عن عكرمة، عن حمنة بنت جحش، أنها كانت مستحاضة وكان زوجها يجامعها ‏.‏",
      "text_en": " 'Ikrimah reported Hamnah daughter of Jahsh as saying that her husband would have intercourse with her during the period she had a flow of blood.",
      "chain": [
        "30298",
        "38295",
        "20726",
        "11080",
        "11023",
        "72"
      ]
    },
    {
      "hadith_no": "699",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن أبي سريج الرازي، أخبرنا أبو أحمد الزبيري، أخبرنا مسرة بن معبد اللخمي، - لقيته بالكوفة - قال حدثني أبو عبيد، حاجب سليمان قال رأيت عطاء بن يزيد الليثي قائما يصلي فذهبت أمر بين يديه فردني ثم قال حدثني أبو سعيد الخدري أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من استطاع منكم أن لا يحول بينه وبين قبلته أحد فليفعل ‏\"‏ ‏.‏",
      "text_en": " Abu 'Ubaid said:                      I saw 'Ata b. Yazid al-Laithi praying in a standing posture. So I went to him passing in front of him; he, therefore, turned me away. He then said to me: Abu Sa'id al-Khudri reported the Messenger of Allah (ﷺ) as saying: If anyone of you can do that he should not let anyone pass between him and the qiblah, he should do it.",
      "chain": [
        "30298",
        "20355",
        "28561",
        "10993",
        "38"
      ]
    },
    {
      "hadith_no": "2558",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن أبي سريج الرازي، أخبرني عبد الله بن الجهم، حدثنا عمرو، - يعني ابن أبي قيس - عن أيوب السختياني، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن الجلالة في الإبل أن يركب عليها ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) prohibited to ride a camel which eats dung.",
      "chain": [
        "30298",
        "38295",
        "20726",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3787",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن أبي سريج، أخبرني عبد الله بن جهم، حدثنا عمرو بن أبي قيس، عن أيوب السختياني، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن الجلالة في الإبل أن يركب عليها أو يشرب من ألبانها ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) forbade riding the camel which feeds on filth and drinking its milk.",
      "chain": [
        "30298",
        "20726",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3894",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن أبي سريج الرازي، أخبرنا مكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، قال رأيت أثر ضربة في ساق سلمة فقلت ما هذه قال أصابتني يوم خيبر فقال الناس أصيب سلمة فأتي بي رسول الله صلى الله عليه وسلم فنفث في ثلاث نفثات فما اشتكيتها حتى الساعة ‏.‏",
      "text_en": " Yazid b. Abi ‘Ubaid said :                      I saw a sign of injury in the shin of Salamah. I asked : What is this ? He replied : I was afflicted. I was afflicted by it on the day of Khaibar. The people said : Salamah has been afflicted. I was then brought to the Prophet (ﷺ). He blew on me three times. I did not feel any pain up till now.",
      "chain": [
        "30298",
        "20202",
        "11450"
      ]
    },
    {
      "hadith_no": "4724",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن أبي سريج، أخبرنا عبد الرحمن بن عبد الله بن سعد، ومحمد بن سعيد، قالا أخبرنا عمرو بن أبي قيس، عن سماك، بإسناده ومعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Simak through a different chain of narrators to the same effect.",
      "chain": [
        "30298",
        "20726"
      ]
    },
    {
      "hadith_no": "4738",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن أبي سريج الرازي، وعلي بن الحسين بن إبراهيم، وعلي بن مسلم، قالوا حدثنا أبو معاوية، حدثنا الأعمش، عن مسلم، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ إذا تكلم الله بالوحى سمع أهل السماء للسماء صلصلة كجر السلسلة على الصفا فيصعقون، فلا يزالون كذلك حتى يأتيهم جبريل حتى إذا جاءهم جبريل فزع عن قلوبهم ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فيقولون ‏:‏ يا جبريل ماذا قال ربك فيقول ‏:‏ الحق فيقولون ‏:‏ الحق الحق ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) reported the Messenger of Allah (May peace be upon him) as saying ; when Allah, the exalted, speaks to send revelation the inhabitant of the heaven hear the clinging of a bell from the other heaven like pulling a chain on the mountain of al-safa, and then swoon. They continue to remain in this recover and say ; what did your lord say, Gabriel? He would say ; Truth, so they would say ; Truth, truth.",
      "chain": [
        "30298",
        "11045",
        "30261",
        "20354",
        "11060",
        "11392",
        "11018",
        "16"
      ]
    }
  ],
  "total_hadiths": 10
}