{
  "id": "30308",
  "name": "Ibrahim bin al-Mandhir bin 'Abdullah إبراهيم بن المنذر بن عبد الله",
  "full_name": "Ibrahim bin al-Mandhir bin 'Abdullah إبراهيم بن المنذر بن عبد الله",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "236",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20436",
      "name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30274",
      "name": "Muhammad bin Abi Ghalb محمد بن أبي غالب القومسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "59",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، ح وحدثني إبراهيم بن المنذر، قال حدثنا محمد بن فليح، قال حدثني أبي قال، حدثني هلال بن علي، عن عطاء بن يسار، عن أبي هريرة، قال بينما النبي صلى الله عليه وسلم في مجلس يحدث القوم جاءه أعرابي فقال متى الساعة فمضى رسول الله صلى الله عليه وسلم يحدث، فقال بعض القوم سمع ما قال، فكره ما قال، وقال بعضهم بل لم يسمع، حتى إذا قضى حديثه قال ‏\"‏ أين  أراه  السائل عن الساعة ‏\"‏‏.‏ قال ها أنا يا رسول الله‏.‏ قال ‏\"‏ فإذا ضيعت الأمانة فانتظر الساعة ‏\"‏‏.‏ قال كيف إضاعتها قال ‏\"‏ إذا وسد الأمر إلى غير أهله فانتظر الساعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
      "chain": [
        "34207",
        "20169",
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "148",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، عن عبيد الله، عن محمد بن يحيى بن حبان، عن واسع بن حبان، عن عبد الله بن عمر، قال ارتقيت فوق ظهر بيت حفصة لبعض حاجتي، فرأيت رسول الله صلى الله عليه وسلم يقضي حاجته مستدبر القبلة مستقبل الشأم‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     I went up to the roof of Hafsa's house for some job and I saw Allah's Apostle answering the call of nature facing Sham (Syria, Jordan, Palestine and Lebanon regarded as one country) with his back towards the Qibla. (See Hadith No. 147).",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا معن، قال حدثني ابن أبي ذئب، عن ابن شهاب، عن عروة، وعن عمرة، عن عائشة، زوج النبي صلى الله عليه وسلم أن أم حبيبة استحيضت سبع سنين، فسألت رسول الله صلى الله عليه وسلم عن ذلك، فأمرها أن تغتسل فقال ‏\"‏ هذا عرق ‏\"‏‏.‏ فكانت تغتسل لكل صلاة‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Um Habiba got bleeding in between the periods for seven years. She asked Allah's Apostle about it. He ordered her to take a bath (after the termination of actual periods) and added that it was (from) a blood vessel. So she used to take a bath for every prayer.",
      "chain": [
        "30308",
        "30112",
        "20177",
        "11013",
        "10511",
        "11455"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، قال حدثنا موسى بن عقبة، عن نافع، أن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم كان ينزل بذي الحليفة حين يعتمر، وفي حجته حين حج، تحت سمرة في موضع المسجد الذي بذي الحليفة، وكان إذا رجع من غزو كان في تلك الطريق أو حج أو عمرة هبط من بطن واد، فإذا ظهر من بطن واد أناخ بالبطحاء التي على شفير الوادي الشرقية، فعرس ثم حتى يصبح، ليس عند المسجد الذي بحجارة، ولا على الأكمة التي عليها المسجد، كان ثم خليج يصلي عبد الله عنده، في بطنه كثب كان رسول الله صلى الله عليه وسلم ثم يصلي، فدحا السيل فيه بالبطحاء حتى دفن ذلك المكان الذي كان عبد الله يصلي فيه‏.‏",
      "text_en": " The narrated Hadith is about the various places on the way from Medina to Mecca where the Prophet () prayed and is not translated.",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أبو ضمرة، قال حدثنا موسى بن عقبة، عن نافع، أن عبد الله، كان إذا دخل الكعبة مشى قبل وجهه حين يدخل، وجعل الباب قبل ظهره، فمشى حتى يكون بينه وبين الجدار الذي قبل وجهه قريبا من ثلاثة أذرع، صلى يتوخى المكان الذي أخبره به بلال أن النبي صلى الله عليه وسلم صلى فيه‏.‏ قال وليس على أحدنا بأس إن صلى في أى نواحي البيت شاء‏.‏",
      "text_en": " Narrated Nafi':                      Whenever 'Abdullah entered the Ka'bah, he used to go ahead leaving the door of the Ka'bah behind him. He would proceed on till the remaining distance between him and the opposite wall about three cubits. Then he would off prayer there where the Prophet () had offered Salat, as Bilal informed me. Ibn 'Umar said, \"It does not matter for any of us to offer prayers at any place inside the Ka'bah.\"",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "544",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، عن هشام، عن أبيه، أن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي العصر والشمس لم تخرج من حجرتها‏.‏ وقال أبو أسامة عن هشام من قعر حجرتها‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle used to offer the `Asr prayer when the sunshine had not disappeared from my chamber.",
      "chain": [
        "30308",
        "20157",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "692",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن ابن عمر، قال لما قدم المهاجرون الأولون العصبة  موضع بقباء  قبل مقدم رسول الله صلى الله عليه وسلم كان يؤمهم سالم مولى أبي حذيفة، وكان أكثرهم قرآنا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When the earliest emigrants came to Al-`Usba [??] a place in Quba', before the arrival of the Prophet- Salim, the slave of Abu Hudhaifa, who knew the Qur'an more than the others used to lead them in prayer.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "730",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا ابن أبي فديك، قال حدثنا ابن أبي ذئب، عن المقبري، عن أبي سلمة بن عبد الرحمن، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان له حصير يبسطه بالنهار، ويحتجره بالليل، فثاب إليه ناس، فصلوا وراءه‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet had a mat which he used to spread during the day and use as a curtain at night. So a number of people gathered at night facing it and prayed behind him.",
      "chain": [
        "30308",
        "20172",
        "20177",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "933",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال حدثني إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال أصابت الناس سنة على عهد النبي صلى الله عليه وسلم فبينا النبي صلى الله عليه وسلم يخطب في يوم جمعة قام أعرابي فقال يا رسول الله هلك المال وجاع العيال، فادع الله لنا‏.‏ فرفع يديه، وما نرى في السماء قزعة، فوالذي نفسي بيده ما وضعها حتى ثار السحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته صلى الله عليه وسلم فمطرنا يومنا ذلك، ومن الغد، وبعد الغد والذي يليه، حتى الجمعة الأخرى، وقام ذلك الأعرابي  أو قال غيره  فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع يديه، فقال ‏\"‏ اللهم حوالينا، ولا علينا ‏\"‏‏.‏ فما يشير بيده إلى ناحية من السحاب إلا انفرجت، وصارت المدينة مثل الجوبة، وسال الوادي قناة شهرا، ولم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once in the lifetime of the Prophet (p.b.u.h) the people were afflicted with drought (famine). While the Prophet was delivering the Khutba on a Friday, a Bedouin stood up and said, \"O, Allah's Apostle! Our possessions are being destroyed and the children are hungry; Please invoke Allah (for rain)\". So the Prophet raised his hands. At that time there was not a trace of cloud in the sky. By Him in Whose Hands my soul is as soon as he lowered his hands, clouds gathered like mountains, and before he got down from the pulpit, I saw the rain falling on the beard of the Prophet. It rained that day, the next day, the third day, the fourth day till the next Friday. The same Bedouin or another man stood up and said, \"O Allah's Apostle! The houses have collapsed, our possessions and livestock have been drowned; Please invoke Allah (to protect us)\". So the Prophet raised both his hands and said, \"O Allah! Round about us and not on us\". So, in whatever direction he pointed with his hands, the clouds dispersed and cleared away, and Medina's (sky) became clear as a hole in between the clouds. The valley of Qanat remained flooded, for one month, none came from outside but talked about the abundant rain.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "957",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس، عن عبيد الله، عن نافع، عن عبد الله بن عمر،‏.‏ أن رسول الله صلى الله عليه وسلم كان يصلي في الأضحى والفطر، ثم يخطب بعد الصلاة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle used to offer the prayer of `Id-ul-Adha and `Id-ul-Fitr and then deliver the Khutba after the prayer.",
      "chain": [
        "30308",
        "19",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "973",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال أخبرني نافع، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يغدو إلى المصلى، والعنزة بين يديه، تحمل وتنصب بالمصلى بين يديه فيصلي إليها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet used to proceed to the Musalla and an 'Anaza used to be carried before him and planted in the Musalla in front of him and he would pray facing it (as a Sutra).",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1329",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن اليهود، جاءوا إلى النبي صلى الله عليه وسلم برجل منهم وامرأة زنيا، فأمر بهما فرجما قريبا من موضع الجنائز عند المسجد‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Jew brought to the Prophet a man and a woman from amongst them who have committed (adultery) illegal sexual intercourse. He ordered both of them to be stoned (to death), near the place of offering the funeral prayers beside the mosque.\"",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1527",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو الأوزاعي، حدثني إسحاق بن عبد الله بن أبي طلحة، حدثني أنس بن مالك  رضى الله عنه  قال غدوت إلى رسول الله صلى الله عليه وسلم بعبد الله بن أبي طلحة ليحنكه، فوافيته في يده الميسم يسم إبل الصدقة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I took `Abdullah bin Abu Talha to Allah's Apostle to perform Tahnik for him. (Tahnik was a custom among the Muslims that whenever a child was born they used to take it to the Prophet who would chew a piece of date and put a part of its juice in the child's mouth). I saw the Prophet and he had an instrument for branding in his hands and was branding the camels of Zakat.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم كان يخرج من طريق الشجرة، ويدخل من طريق المعرس، وأن رسول الله صلى الله عليه وسلم كان إذا خرج إلى مكة يصلي في مسجد الشجرة، وإذا رجع صلى بذي الحليفة ببطن الوادي، وبات حتى يصبح‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle used to go (for Hajj) via Ash-Shajara way and return via Muarras way; and no doubt, whenever Allah's Apostle went to Mecca, he used to offer the prayer in the Mosque of Ash-Shajara; and on his return, he used to offer the prayer at Dhul-Hulaifa in the middle of the valley, and pass the night there till morning.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1600",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني معن، قال حدثني مالك، عن نافع، عن ابن عمر  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يدخل من الثنية العليا، ويخرج من الثنية السفلى‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle used to enter Mecca from the high Thaniya and used to leave Mecca from the low Thaniya.",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1641",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، أنس حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج أو العمرة أول ما يقدم سعى ثلاثة أطواف، ومشى أربعة، ثم سجد سجدتين، ثم يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     When Allah's Apostle performed Tawaf of the Ka`ba for Hajj or `Umra, he used to do Ramal during the first three rounds, and in the last four rounds he used to walk; then after the Tawaf he used to offer two rak`at and then performed Tawaf between Safa and Marwa.",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1642",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم كان إذا طاف بالبيت الطواف الأول يخب ثلاثة أطواف، ويمشي أربعة، وأنه كان يسعى بطن المسيل إذا طاف بين الصفا والمروة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When the Prophet performed the Tawaf of the Ka`ba, he did Ramal during the first three rounds and in the last four rounds he used to walk and while doing Tawaf between Safa and Marwa, he used to run in the midst of the rain water passage.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1654",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن عبد الله  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم ينهى عن الصلاة عند طلوع الشمس وعند غروبها‏.‏",
      "text_en": " Narrated `Abdullah:                     I heard the Prophet forbidding the offering of prayers at the time of sunrise and sunset.",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1681",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن عمر، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم بمنى ركعتين، وأبو بكر وعمر وعثمان صدرا من خلافته‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle offered a two-rak`at prayer at Mina. Abu Bakr, `Umar and `Uthman, (during the early years of his caliphate) followed the same practice.",
      "chain": [
        "30308",
        "20029",
        "20475",
        "11013",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "1733",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، قال أراد ابن عمر  رضى الله عنهما  الحج عام حجة الحرورية في عهد ابن الزبير  رضى الله عنهما  فقيل له إن الناس كائن بينهم قتال، ونخاف أن يصدوك‏.‏ فقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ إذا أصنع كما صنع، أشهدكم أني أوجبت عمرة‏.‏ حتى كان بظاهر البيداء قال ما شأن الحج والعمرة إلا واحد، أشهدكم أني جمعت حجة مع عمرة‏.‏ وأهدى هديا مقلدا اشتراه حتى قدم، فطاف بالبيت وبالصفا، ولم يزد على ذلك، ولم يحلل من شىء حرم منه حتى يوم النحر، فحلق ونحر ورأى أن قد قضى طوافه الحج والعمرة بطوافه الأول، ثم قال كذلك صنع النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar intended to perform Hajj in the year of the Hajj of Al-Harawriya during the rule of Ibn Az- Zubair. Some people said to him, \"It is very likely that there will be a fight among the people, and we are afraid that they might prevent you (from performing Hajj).\" He replied, \"Verily, in Allah's Apostle there is a good example for you (to follow). In this case I would do the same as he had done. I make you witness that I have intended to perform `Umra.\" When he reached Al-Baida', he said, \"The conditions for both Hajj and `Umra are the same. I make you witness that I have intended to perform Hajj along with `Umra.\" After that he took a garlanded Hadi (to Mecca) which he bought (on the way). When he reached (Mecca), he performed Tawaf of the Ka`ba and of Safa (and Marwa) and did not do more than that. He did not make legal for himself the things which were illegal for a Muhrim till it was the Day of Nahr (sacrifice), when he had his head shaved and slaughtered (the sacrifice) and considered sufficient his first Tawaf (between Safa and Marwa), as a (Sa`i) for his Hajj and `Umra both. He then said, \"The Prophet used to do like that.\"",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014"
      ]
    },
    {
      "hadith_no": "1736",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر  رضى الله عنهما  كان يبعث بهديه من جمع من آخر الليل، حتى يدخل به منحر النبي صلى الله عليه وسلم مع حجاج فيهم الحر والمملوك‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to send his Hadi from Jam' (to Mina) in the last third of the night with the pilgrims amongst whom there were free men and slaves, till it was taken into the Manhar (slaughtering place) of the Prophet .",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1794",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر  رضى الله عنهما  كان يبيت بذي طوى بين الثنيتين، ثم يدخل من الثنية التي بأعلى مكة، وكان إذا قدم مكة حاجا أو معتمرا لم ينخ ناقته إلا عند باب المسجد، ثم يدخل فيأتي الركن الأسود فيبدأ به، ثم يطوف سبعا ثلاثا سعيا، وأربعا مشيا، ثم ينصرف فيصلي سجدتين، ثم ينطلق قبل أن يرجع إلى منزله، فيطوف بين الصفا والمروة، وكان إذا صدر عن الحج أو العمرة أناخ بالبطحاء التي بذي الحليفة التي كان النبي صلى الله عليه وسلم ينيخ بها‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to spend the night at Dhi-Tuwa in between the two Thaniyas and then he would enter Mecca through the Thaniya which is at the higher region of Mecca, and whenever he came to Mecca for Hajj or `Umra, he never made his she camel kneel down except near the gate of the Masjid (Sacred Mosque) and then he would enter (it) and go to the Black (stone) Corner and start from there circumambulating the Ka`ba seven times: hastening in the first three rounds (Ramal) and walking in the last four. On finishing, he would offer two rak`at prayer and set out to perform Tawaf between Safa and Marwa before returning to his dwelling place. On returning (to Medina) from Hajj or `Umra, he used to make his camel kneel down at Al-Batha which is at Dhul-Hulaifa, the place where the Prophet used to make his camel kneel down.",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1909",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، قال حدثني عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back to its hole (when in danger).",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "1914",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو، حدثنا إسحاق، حدثني أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس من بلد إلا سيطؤه الدجال، إلا مكة والمدينة، ليس له من نقابها نقب إلا عليه الملائكة صافين، يحرسونها، ثم ترجف المدينة بأهلها ثلاث رجفات، فيخرج الله كل كافر ومنافق ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, and there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in rows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three earthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"",
      "chain": [
        "30308",
        "20733",
        "20024",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "1897",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني معن، قال حدثني مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله نودي من أبواب الجنة يا عبد الله، هذا خير‏.‏ فمن كان من أهل الصلاة دعي من باب الصلاة، ومن كان من أهل الجهاد دعي من باب الجهاد، ومن كان من أهل الصيام دعي من باب الريان، ومن كان من أهل الصدقة دعي من باب الصدقة ‏\"‏‏.‏ فقال أبو بكر  رضى الله عنه  بأبي أنت وأمي يا رسول الله، ما على من دعي من تلك الأبواب من ضرورة، فهل يدعى أحد من تلك الأبواب كلها قال ‏\"‏ نعم‏.‏ وأرجو أن تكون منهم ‏\"‏‏.‏",
      "text_en": " 'Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever gives two kinds (of things or property) in charity for Allah's Cause, will be called from the gates of Paradise and will be addressed, 'O slaves of Allah! Here is prosperity.' So, whoever was amongst the people who used to offer their prayers, will be called from the gate of the prayer; and whoever was amongst the people who used to participate in Jihad, will be called from the gate of Jihad; and whoever was amongst those who used to observe fasts, will be called from the gate of Ar-Raiyan; whoever was amongst those who used to give in charity, will be called from the gate of charity.\" Abu Bakr said, \"Let my parents be sacrificed for you, O Allah's Apostle! No distress or need will befall him who will be called from those gates. Will there be any one who will be called from all these gates?\" The Prophet replied, \"Yes, and I hope you will be one of them.\"",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2328",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، أن عبد الله بن عمر  رضى الله عنهما  أخبره أن النبي صلى الله عليه وسلم عامل خيبر بشطر ما يخرج منها من ثمر أو زرع، فكان يعطي أزواجه مائة وسق ثمانون وسق تمر وعشرون وسق شعير، فقسم عمر خيبر، فخير أزواج النبي صلى الله عليه وسلم أن يقطع لهن من الماء والأرض، أو يمضي لهن، فمنهن من اختار الأرض ومنهن من اختار الوسق، وكانت عائشة اختارت الأرض‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet concluded a contract with the people of Khaibar to utilize the land on the condition that half the products of fruits or vegetation would be their share. The Prophet used to give his wives one hundred Wasqs each, eighty Wasqs of dates and twenty Wasqs of barley. (When `Umar became the Caliph) he gave the wives of the Prophet the option of either having the land and water as their shares, or carrying on the previous practice. Some of them chose the land and some chose the Wasqs, and `Aisha chose the land.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2333",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما ثلاثة نفر يمشون أخذهم المطر، فأووا إلى غار في جبل، فانحطت على فم غارهم صخرة من الجبل فانطبقت عليهم، فقال بعضهم لبعض انظروا أعمالا عملتموها صالحة لله فادعوا الله بها لعله يفرجها عنكم‏.‏ قال أحدهم اللهم إنه كان لي والدان شيخان كبيران، ولي صبية صغار كنت أرعى عليهم، فإذا رحت عليهم حلبت، فبدأت بوالدى أسقيهما قبل بني، وإني استأخرت ذات يوم فلم آت حتى أمسيت، فوجدتهما ناما، فحلبت كما كنت أحلب، فقمت عند رءوسهما، أكره أن أوقظهما، وأكره أن أسقي الصبية، والصبية يتضاغون عند قدمى، حتى طلع الفجر، فإن كنت تعلم أني فعلته ابتغاء وجهك فافرج لنا فرجة نرى منها السماء‏.‏ ففرج الله فرأوا السماء‏.‏ وقال الآخر اللهم إنها كانت لي بنت عم أحببتها كأشد ما يحب الرجال النساء، فطلبت منها فأبت حتى أتيتها بمائة دينار، فبغيت حتى جمعتها، فلما وقعت بين رجليها قالت يا عبد الله اتق الله، ولا تفتح الخاتم إلا بحقه، فقمت، فإن كنت تعلم أني فعلته ابتغاء وجهك فافرج عنا فرجة‏.‏ ففرج‏.‏ وقال الثالث اللهم إني استأجرت أجيرا بفرق أرز، فلما قضى عمله قال أعطني حقي‏.‏ فعرضت عليه، فرغب عنه، فلم أزل أزرعه حتى جمعت منه بقرا وراعيها فجاءني فقال اتق الله‏.‏ فقلت اذهب إلى ذلك البقر ورعاتها فخذ‏.‏ فقال اتق الله ولا تستهزئ بي‏.‏ فقلت إني لا أستهزئ بك فخذ‏.‏ فأخذه، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج ما بقي، ففرج الله ‏\"‏‏.‏ قال أبو عبد الله وقال ابن عقبة عن نافع فسعيت‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"While three men were walking, It started raining and they took shelter (refuge) in a cave in a mountain. A big rock rolled down from the mountain and closed the mouth of the cave. They said to each other, \"Think of good deeds which you did for Allah's sake only, and invoke Allah by giving reference to those deeds so that He may remove this rock from you.\" One of them said, 'O Allah! I had old parents and small children and I used to graze the sheep for them. On my return to them in the evening, I used to milk (the sheep) and start providing my parents first of all before my children. One day I was delayed and came late at night and found my parents sleeping. I milked (the sheep) as usual and stood by their heads. I hated to wake them up and disliked to give milk to my children before them, although my children were weeping (because of hunger) at my feet till the day dawned. O Allah! If I did this for Your sake only, kindly remove the rock so that we could see the sky through it.' So, Allah removed the rock a little and they saw the sky. The second man said, 'O Allah! I was in love with a cousin of mine like the deepest love a man may have for a woman. I wanted to outrage her chastity but she refused unless I gave her one hundred Dinars. So, I struggled to collect that amount. And when I sat between her legs, she said, 'O Allah's slave! Be afraid of Allah and do not deflower me except rightfully (by marriage).' So, I got up. O Allah! If I did it for Your sake only, please remove the rock.' The rock shifted a little more. Then the third man said, 'O Allah! I employed a laborer for a Faraq of rice and when he finished his job and demanded his right, I presented it to him, but he refused to take it. So, I sowed the rice many time till I gathered cows and their shepherd (from the yield). (Then after some time) He came and said to me, 'Fear Allah (and give me my right).\" I said, 'Go and take those cows and the shepherd.' He said, 'Be afraid of Allah! Don't mock at me.' I said, 'I am not mocking at you. Take (all that).' So, he took all that. O Allah! If I did that for Your sake only, please remove the rest of the rock.' So, Allah removed the rock.\"",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حق الإبل أن تحلب على الماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"One of the rights of a she camel is that it should be milked at a place of water.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2396",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس، عن هشام، عن وهب بن كيسان، عن جابر بن عبد الله  رضى الله عنهما  أنه أخبره أن أباه توفي، وترك عليه ثلاثين وسقا لرجل من اليهود، فاستنظره جابر، فأبى أن ينظره، فكلم جابر رسول الله صلى الله عليه وسلم ليشفع له إليه، فجاء رسول الله صلى الله عليه وسلم وكلم اليهودي ليأخذ ثمر نخله بالذي له فأبى، فدخل رسول الله صلى الله عليه وسلم النخل، فمشى فيها ثم قال لجابر ‏\"‏ جد له فأوف له الذي له ‏\"‏‏.‏ فجده بعد ما رجع رسول الله صلى الله عليه وسلم فأوفاه ثلاثين وسقا، وفضلت له سبعة عشر وسقا، فجاء جابر رسول الله صلى الله عليه وسلم ليخبره بالذي كان، فوجده يصلي العصر، فلما انصرف أخبره بالفضل، فقال ‏\"‏ أخبر ذلك ابن الخطاب ‏\"‏‏.‏ فذهب جابر إلى عمر، فأخبره‏.‏ فقال له عمر لقد علمت حين مشى فيها رسول الله صلى الله عليه وسلم ليباركن فيها‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When my father died he owed a Jew thirty Awsuq (of dates). I requested him to give me respite for repaying but he refused. I requested Allah's Apostle to intercede with the Jew. Allah's Apostle went to the Jew and asked him to accept the fruits of my trees in place of the debt but the Jew refused. Allah's Apostle entered the garden of the date-palms, wandering among the trees and ordered me (saying), \"Pluck (the fruits) and give him his due.\" So, I plucked the fruits for him after the departure of Allah's Apostle and gave his thirty Awsuq, and still had seventeen Awsuq extra for myself. Jabir said: I went to Allah's Apostle to inform of what had happened, but found him praying the `Asr prayer. After the prayer I told him about the extra fruits which remained. Allah's Apostle told me to inform (`Umar) Ibn Al-Khattab about it. When I went to `Umar and told him about it, `Umar said, \"When Allah's Apostle walked in your garden, I was sure that Allah would definitely bless it.\"",
      "chain": [
        "30308",
        "19",
        "11065",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "2479",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه القاسم، عن عائشة  رضى الله عنها  أنها كانت اتخذت على سهوة لها سترا فيه تماثيل، فهتكه النبي صلى الله عليه وسلم، فاتخذت منه نمرقتين، فكانتا في البيت يجلس عليهما‏.‏",
      "text_en": " Narrated Al-Qasim:                     Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet tore that curtain and she turned it into two cushions which remained in the house for the Prophet to sit on.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "10530",
        "53"
      ]
    },
    {
      "hadith_no": "2576",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم ‏\"‏إذا أتي بطعام سأل عنه أهدية أم صدقة فإن قيل صدقة‏.‏ قال لأصحابه كلوا‏.‏ ولم يأكل، وإن قيل هدية‏.‏ ضرب بيده صلى الله عليه وسلم فأكل معهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Whenever a meal was brought to Allah's Apostle, he would ask whether it was a gift or Sadaqa (something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, but if it was a gift, he would hurry to share it with them.",
      "chain": [
        "30308",
        "30112",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2793",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏لقاب قوس في الجنة خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏ وقال ‏\"‏ لغدوة أو روحة في سبيل الله خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A place in Paradise as small as a bow is better than all that on which the sun rises and sets (i.e. all the world).\" He also said, \"A single endeavor in Allah's Cause in the afternoon or in the forenoon is better than all that on which the sun rises and sets.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3102",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن محمد بن يحيى بن حبان، عن واسع بن حبان، عن عبد الله بن عمر  رضى الله عنهما  قال ارتقيت فوق بيت حفصة، فرأيت النبي صلى الله عليه وسلم يقضي حاجته، مستدبر القبلة، مستقبل الشأم‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once I went upstairs in Hafsa's house and saw the Prophet answering the call of nature with his back towards the Qibla and facing Sham.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "3103",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن هشام، عن أبيه، أن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يصلي العصر والشمس لم تخرج من حجرتها‏.‏",
      "text_en": " Narrated Aisha:                     That Allah's Apostle used to offer the `Asr prayer while the sun was still shining in her Hujra (i.e. her dwelling place).",
      "chain": [
        "30308",
        "20157",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3229",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحدكم في صلاة ما دامت الصلاة تحبسه، والملائكة تقول اللهم اغفر له وارحمه‏.‏ ما لم يقم من صلاته أو يحدث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"As long as any-one of you is waiting for the prayer, he is considered to be praying actually, and the angels say, 'O Allah! Be merciful to him and forgive him', (and go on saying so) unless he leaves his place of praying or passes wind (i.e. breaks his ablution).",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3254",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ أول زمرة تدخل الجنة على صورة القمر ليلة البدر، والذين على آثارهم كأحسن كوكب دري في السماء إضاءة، قلوبهم على قلب رجل واحد، لا تباغض بينهم ولا تحاسد، لكل امرئ زوجتان من الحور العين، يرى مخ سوقهن من وراء العظم واللحم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The first batch (of people) who will enter Paradise will be (glittering) like the full moon, and the batch next to them will be (glittering) like the most brilliant star in the sky. Their hearts will be as if the heart of a single man, for they will have neither enmity nor jealousy amongst themselves; everyone will have two wives from the houris, (who will be so beautiful, pure and transparent that) the marrow of the bones of their legs will be seen through the bones and the flesh.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، أن عبد الله بن عمر  رضى الله عنهما  أخبره أن الناس نزلوا مع رسول الله صلى الله عليه وسلم أرض ثمود الحجر، فاستقوا من بئرها، واعتجنوا به، فأمرهم رسول الله صلى الله عليه وسلم أن يهريقوا ما استقوا من بئرها، وأن يعلفوا الإبل العجين، وأمرهم أن يستقوا من البئر التي كان تردها الناقة‏.‏ تابعه أسامة عن نافع‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The people landed at the land of Thamud called Al-Hijr along with Allah's Apostle and they took water from its well for drinking and kneading the dough with it as well. (When Allah's Apostle heard about it) he ordered them to pour out the water they had taken from its wells and feed the camels with the dough, and ordered them to take water from the well whence the she-camel (of Prophet Salih) used to drink.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3439",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى، عن نافع، قال عبد الله ذكر النبي صلى الله عليه وسلم يوما بين ظهرى الناس المسيح الدجال، فقال ‏\"‏ إن الله ليس بأعور، ألا إن المسيح الدجال أعور العين اليمنى، كأن عينه عنبة طافية ‏\"‏‏.‏   ‏\"‏ وأراني الليلة عند الكعبة في المنام، فإذا رجل آدم كأحسن ما يرى من أدم الرجال، تضرب لمته بين منكبيه، رجل الشعر، يقطر رأسه ماء، واضعا يديه على منكبى رجلين وهو يطوف بالبيت‏.‏ فقلت من هذا فقالوا هذا المسيح ابن مريم‏.‏ ثم رأيت رجلا وراءه جعدا قططا أعور عين اليمنى كأشبه من رأيت بابن قطن، واضعا يديه على منكبى رجل، يطوف بالبيت، فقلت من هذا قالوا المسيح الدجال ‏\"‏‏.‏ تابعه عبيد الله عن نافع‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet mentioned the Masih Ad-Dajjal in front of the people saying, Allah is not one-eyed while Masih Ad-Dajjal is blind in the right eye and his eye looks like a bulging out grape. While sleeping near the Ka`ba last night, I saw in my dream a man of brown color the best one can see amongst brown color and his hair was long that it fell between his shoulders. His hair was lank and water was dribbling from his head and he was placing his hands on the shoulders of two men while circumambulating the Ka`ba. I asked, 'Who is this?' They replied, 'This is Jesus, son of Mary.' Behind him I saw a man who had very curly hair and was blind in the right eye, resembling Ibn Qatan (i.e. an infidel) in appearance. He was placing his hands on the shoulders of a person while performing Tawaf around the Ka`ba. I asked, 'Who is this? 'They replied, 'The Masih, Ad-Dajjal.' \"",
      "chain": [
        "30308",
        "20157",
        "20040",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3572",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إبراهيم بن المنذر، قال حدثني معن، عن مالك، عن ابن شهاب، عن محمد بن جبير بن مطعم، عن أبيه  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لي خمسة أسماء أنا محمد، وأحمد، وأنا الماحي الذي يمحو الله بي الكفر، وأنا الحاشر الذي يحشر الناس على قدمي، وأنا العاقب ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     Allah's Apostle said, \"I have five names: I am Muhammad and Ahmad; I am Al-Mahi through whom Allah will eliminate infidelity; I am Al-Hashir who will be the first to be resurrected, the people being resurrected there after; and I am also Al-`Aqib (i.e. There will be no prophet after me).",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11013",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "3691",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا ابن أبي الفديك، عن ابن أبي ذئب، عن المقبري، عن أبي هريرة  رضى الله عنه  قال قلت يا رسول الله إني سمعت منك كثيرا فأنساه‏.‏ قال ‏\"‏ ابسط رداءك ‏\"‏‏.‏ فبسطت فغرف بيده فيه، ثم قال ‏\"‏ ضمه ‏\"‏ فضممته، فما نسيت حديثا بعد‏.‏",
      "text_en": " Narrated Abu Huraira:                     I said, \"O Allah's Apostle! I hear many narrations from you but I forget them.\" He said, \"Spread your covering sheet.\" I spread my sheet and he moved both his hands as if scooping something and emptied them in the sheet and said, \"Wrap it.\" I wrapped it round my body, and since then I have never forgotten.",
      "chain": [
        "30308",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4067",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، عن موسى بن عقبة، قال ابن شهاب حدثنا أنس بن مالك، أن رجالا، من الأنصار استأذنوا رسول الله صلى الله عليه وسلم فقالوا ائذن لنا فلنترك لابن أختنا عباس فداءه‏.‏ قال ‏\"‏ والله لا تذرون منه درهما ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some men of the Ansar requested Allah's Apostle to allow them to see him, they said, \"Allow us to forgive the ransom of our sister's son, `Abbas.\" The Prophet said, \"By Allah, you will not leave a single Dirham of it!\"",
      "chain": [
        "30308",
        "20178",
        "11106",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4076",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح بن سليمان، عن موسى بن عقبة، عن ابن شهاب، قال هذه مغازي رسول الله صلى الله عليه وسلم‏.‏ فذكر الحديث، فقال رسول الله صلى الله عليه وسلم وهو يلقيهم ‏\"‏ هل وجدتم ما وعدكم ربكم حقا ‏\"‏‏.‏ قال موسى قال نافع قال عبد الله قال ناس من أصحابه يا رسول الله تنادي ناسا أمواتا قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنتم بأسمع لما قلت منهم ‏\"‏‏.‏ قال أبو عبد الله فجميع من شهد بدرا من قريش ممن ضرب له بسهمه أحد وثمانون رجلا، وكان عروة بن الزبير يقول قال الزبير قسمت سهمانهم فكانوا مائة، والله أعلم‏.‏",
      "text_en": " Narrated Ibn Shihab:                     These were the battles of Allah's Apostle (which he fought), and while mentioning (the Badr battle) he said, \"While the corpses of the pagans were being thrown into the well, Allah's Apostle said (to them), 'Have you found what your Lord promised true?\" `Abdullah said, \"Some of the Prophet's companions said, \"O Allah's Apostle! You are addressing dead people.' Allah's Apostle replied, 'You do not hear what I am saying, better than they.' The total number of Muslim fighters from Quraish who fought in the battle of Badr and were given their share of the booty, were 81 men.\" Az-Zubair said, \"When their shares were distributed, their number was 101 men. But Allah knows it better.\"",
      "chain": [
        "30308",
        "20178",
        "11106",
        "11013"
      ]
    },
    {
      "hadith_no": "4442",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن المنذر، أخبرنا أنس بن عياض، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر، أخبره أن حفصة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرته أن النبي صلى الله عليه وسلم أمر أزواجه أن يحللن عام حجة الوداع، فقالت حفصة فما يمنعك فقال ‏\"‏ لبدت رأسي وقلدت هديي، فلست أحل حتى أنحر هديي ‏\"‏‏.‏",
      "text_en": " Narrated Hafsa:                     (the wife of the Prophet) The Prophet ordered all his wives to finish their Ihram during the year of Hajjat-ul-Wada`. On that, I asked the Prophet \"What stops you from finishing your lhram?\" He said, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram unless I have slaughtered my Hadi.\"",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "4454",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر  رضى الله عنهما  أخبرهم أن رسول الله صلى الله عليه وسلم حلق رأسه في حجة الوداع‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet got his head shaved during Hajjat-ul-Wada`.'",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4598",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن اليهود، جاءوا إلى النبي صلى الله عليه وسلم برجل منهم وامرأة قد زنيا، فقال لهم ‏\"‏ كيف تفعلون بمن زنى منكم ‏\"‏‏.‏ قالوا نحممهما ونضربهما‏.‏ فقال ‏\"‏ لا تجدون في التوراة الرجم ‏\"‏‏.‏ فقالوا لا نجد فيها شيئا‏.‏ فقال لهم عبد الله بن سلام كذبتم ‏{‏فأتوا بالتوراة فاتلوها إن كنتم صادقين‏}‏ فوضع مدراسها الذي يدرسها منهم كفه على آية الرجم، فطفق يقرأ ما دون يده وما وراءها، ولا يقرأ آية الرجم، فنزع يده عن آية الرجم فقال ما هذه فلما رأوا ذلك قالوا هي آية الرجم‏.‏ فأمر بهما فرجما قريبا من حيث موضع الجنائز عند المسجد، فرأيت صاحبها يجنأ عليها يقيها الحجارة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Jews brought to the Prophet a man and a woman from among them who had committed illegal sexual intercourse. The Prophet said to them, \"How do you usually punish the one amongst you who has committed illegal sexual intercourse?\" They replied, \"We blacken their faces with coal and beat them,\" He said, \"Don't you find the order of Ar-Rajm (i.e. stoning to death) in the Torah?\" They replied, \"We do not find anything in it.\" `Abdullah bin Salam (after hearing this conversation) said to them. \"You have told a lie! Bring here the Torah and recite it if you are truthful.\" (So the Jews brought the Torah). And the religious teacher who was teaching it to them, put his hand over the Verse of Ar- Rajm and started reading what was written above and below the place hidden with his hand, but he did not read the Verse of Ar-Rajm. `Abdullah bin Salam removed his (i.e. the teacher's) hand from the Verse of Ar-Rajm and said, \"What is this?\" So when the Jews saw that Verse, they said, \"This is the Verse of Ar-Rajm.\" So the Prophet ordered the two adulterers to be stoned to death, and they were stoned to death near the place where biers used to be placed near the Mosque. I saw her companion (i.e. the adulterer) bowing over her so as to protect her from the stones.",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4718",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أنه قال لما توفي عبد الله بن أبى جاء ابنه عبد الله بن عبد الله إلى رسول الله صلى الله عليه وسلم فأعطاه قميصه وأمره أن يكفنه فيه ثم قام يصلي عليه، فأخذ عمر بن الخطاب بثوبه فقال تصلي عليه وهو منافق وقد نهاك الله أن تستغفر لهم‏.‏ قال ‏\"‏ إنما خيرني الله أو أخبرني فقال ‏{‏استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم‏}‏ فقال سأزيده على سبعين ‏\"‏‏.‏ قال فصلى عليه رسول الله صلى الله عليه وسلم وصلينا معه ثم أنزل الله عليه ‏{‏ولا تصل على أحد منهم مات أبدا ولا تقم على قبره إنهم كفروا بالله ورسوله وماتوا وهم فاسقون‏}‏",
      "text_en": " Narrated Ibn `Umar:                     When `Abdullah bin Ubai died, his son `Abdullah bin `Abdullah came to Allah's Apostle who gave his shirt to him and ordered him to shroud his father in it. Then he stood up to offer the funeral prayer for the deceased, but `Umar bin Al-Khattab took hold of his garment and said, \"Do you offer the funeral prayer for him though he was a hypocrite and Allah has forbidden you to ask forgiveness for hypocrites?\" The Prophet said, \"Allah has given me the choice (or Allah has informed me) saying: \"Whether you, O Muhammad, ask forgiveness for them, or do not ask forgiveness for them, even if you ask forgiveness for them seventy times, Allah will not forgive them,\" (9.80) The he added, \"I will (appeal to Allah for his sake) more than seventy times.\" So Allah's Apostle offered the funeral prayer for him and we too, offered the prayer along with him. Then Allah revealed: \"And never, O Muhammad, pray (funeral prayer) for anyone of them that dies, nor stand at his grave. Certainly they disbelieved in Allah and His Apostle and died in a state of rebellion.\" (9.84)",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4743",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا معن، قال حدثني مالك، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مفاتيح الغيب خمس لا يعلمها إلا الله لا يعلم ما في غد إلا الله، ولا يعلم ما تغيض الأرحام إلا الله ولا يعلم متى يأتي المطر أحد إلا الله، ولا تدري نفس بأى أرض تموت، ولا يعلم متى تقوم الساعة إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"The keys of Unseen are five which none knows but Allah: None knows what will happen tomorrow but Allah; none knows what is in the wombs (a male child or a female) but Allah; none knows when it will rain but Allah; none knows at what place one will die; none knows when the Hour will be established but Allah.\" (See The Qur'an 31:34.\")",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4749",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال لأصحاب الحجر ‏\"‏ لا تدخلوا على هؤلاء القوم إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     (While we were going for the Battle of Tabuk and when we reached the places of the dwellers of Al- Hijr), Allah's Apostle said about the dwellers of Al-Hijr (to us). \"Do not enter (the dwelling places) of these people unless you enter weeping, but if you weep not, then do not enter upon them, lest you be afflicted with what they were afflicted with.\"",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4828",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى الناس به في الدنيا والآخرة، اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن ترك مالا فليرثه عصبته من كانوا، فإن ترك دينا أو ضياعا فليأتني وأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no believer but I, of all the people, I am the closest to him both in this world and in the Hereafter. Recite if you wish: 'The Prophet is closer to the believers than their own selves.' (33.6) so if a believer (dies) leaves some property then his relatives will inherit that property; but if he is in debt or he leaves poor children, let those (creditors and children) come to me (that I may pay the debt and provide for the children), for them I am his sponsor (surely).",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "4853",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، من بني عامر بن لؤى عن عطاء بن يسار، عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال أنا خير من يونس بن متى فقد كذب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"He who says that I am better than Jonah bin Matta, tells a lie.'",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    }
  ],
  "total_hadiths": 95
}