{
  "id": "30301",
  "name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن أبي",
  "full_name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن أبي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "233",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20465",
      "name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20708",
      "name": "al-Harith bin 'Umayr Abu الحارث بن عمير أبو عمير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20463",
      "name": "Mskyn bin Bkyr al-Hrany مسكين بن بكير الحراني أبو عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4723",
      "hadith_no": "4723",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد، حدثنا أحمد بن أبي شعيب، حدثنا موسى بن أعين، حدثنا إسحاق بن راشد، أن الزهري، حدثه قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك،، وهو أحد الثلاثة الذين تيب عليهم أنه لم يتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط غير غزوتين غزوة العسرة وغزوة بدر‏.‏ قال فأجمعت صدق رسول الله صلى الله عليه وسلم ضحى، وكان قلما يقدم من سفر سافره إلا ضحى وكان يبدأ بالمسجد، فيركع ركعتين، ونهى النبي صلى الله عليه وسلم عن كلامي وكلام صاحبى، ولم ينه عن كلام أحد من المتخلفين غيرنا، فاجتنب الناس كلامنا، فلبثت كذلك حتى طال على الأمر، وما من شىء أهم إلى من أن أموت فلا يصلي على النبي صلى الله عليه وسلم أو يموت رسول الله صلى الله عليه وسلم فأكون من الناس بتلك المنزلة، فلا يكلمني أحد منهم، ولا يصلي على، فأنزل الله توبتنا على نبيه صلى الله عليه وسلم حين بقي الثلث الآخر من الليل، ورسول الله صلى الله عليه وسلم عند أم سلمة، وكانت أم سلمة محسنة في شأني معنية في أمري، فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أم سلمة تيب على كعب ‏\"‏‏.‏ قالت أفلا أرسل إليه فأبشره قال ‏\"‏ إذا يحطمكم الناس فيمنعونكم النوم سائر الليلة ‏\"‏‏.‏ حتى إذا صلى رسول الله صلى الله عليه وسلم صلاة الفجر آذن بتوبة الله علينا، وكان إذا استبشر استنار وجهه حتى كأنه قطعة من القمر، وكنا أيها الثلاثة الذين خلفوا عن الأمر الذي قبل من هؤلاء الذين اعتذروا حين أنزل الله لنا التوبة، فلما ذكر الذين كذبوا رسول الله صلى الله عليه وسلم من المتخلفين، واعتذروا بالباطل، ذكروا بشر ما ذكر به أحد قال الله سبحانه ‏{‏يعتذرون إليكم إذا رجعتم إليهم قل لا تعتذروا لن نؤمن لكم قد نبأنا الله من أخباركم وسيرى الله عملكم ورسوله‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik who was one of the three who were forgiven, saying that he had never remained behind Allah's Apostle in any Ghazwa which he had fought except two Ghazwat Ghazwat- Al-`Usra (Tabuk) and Ghazwat-Badr. He added. \"I decided to tell the truth to Allah's Apostle in the forenoon, and scarcely did he return from a journey he made, except in the forenoon, he would go first to the mosque and offer a two-rak`at prayer. The Prophet forbade others to speak to me or to my two companions, but he did not prohibit speaking to any of those who had remained behind excepting us. So the people avoided speaking to us, and I stayed in that state till I could no longer bear it, and the only thing that worried me was that I might die and the Prophet would not offer the funeral prayer for me, or Allah's Apostle might die and I would be left in that social status among the people that nobody would speak to me or offer the funeral prayer for me. But Allah revealed His Forgiveness for us to the Prophet in the last third of the night while Allah's Apostle was with Um Salama. Um Salama sympathized with me and helped me in my disaster. Allah's Apostle said, 'O Um Salama! Ka`b has been forgiven!' She said, 'Shall I send someone to him to give him the good tidings?' He said, 'If you did so, the people would not let you sleep the rest of the night.' So when the Prophet had offered the Fajr prayer, he announced Allah's Forgiveness for us. His face used to look as bright as a piece of the (full) moon whenever he was pleased. When Allah revealed His Forgiveness for us, we were the three whose case had been deferred while the excuse presented by those who had apologized had been accepted. But when there were mentioned those who had told the Prophet lies and remained behind (the battle of Tabuk) and had given false excuses, they were described with the worse description one may be described with. Allah said: 'They will present their excuses to you (Muslims) when you return to them. Say: Present no excuses; we shall not believe you. Allah has already informed us of the true state of matters concerning you. Allah and His Apostle will observe your actions.\" (9.94)",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30301",
        "20465",
        "20409",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "id": "sunan-abi-daud-67",
      "hadith_no": "67",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن أبي شعيب، وعبد العزيز بن يحيى الحرانيان، قالا حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن سليط بن أيوب، عن عبيد الله بن عبد الرحمن بن رافع الأنصاري، ثم العدوي عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم وهو يقال له إنه يستقى لك من بئر بضاعة وهي بئر يلقى فيها لحوم الكلاب والمحايض وعذر الناس ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الماء طهور لا ينجسه شىء ‏\"‏ ‏.‏ قال أبو داود وسمعت قتيبة بن سعيد قال سألت قيم بئر بضاعة عن عمقها قال أكثر ما يكون فيها الماء إلى العانة ‏.‏ قلت فإذا نقص قال دون العورة ‏.‏ قال أبو داود وقدرت أنا بئر بضاعة بردائي مددته عليها ثم ذرعته فإذا عرضها ستة أذرع وسألت الذي فتح لي باب البستان فأدخلني إليه هل غير بناؤها عما كانت عليه قال لا ‏.‏ ورأيت فيها ماء متغير اللون ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     I heard that the people asked the Prophet of Allah (ﷺ): Water is brought for you from the well of Buda'ah. It is a well in which dead dogs, menstrual clothes and excrement of people are thrown. The Messenger of Allah (ﷺ) replied: Verily water is pure and is not defiled by anything.Abu Dawud said I heard Qutaibah b. Sa'id say: I asked the person in charge of the well of Bud'ah about the depth of the well. He replied: At most the water reaches pubes. Then I asked: Where does it reach when its level goes down ? He replied: Below the private part of the body.Abu Dawud said: I measured the breadth of the well of Buda'ah with my sheet which I stretched over it. I them measured it with the hand. It measured six cubits in breadth. I then asked the man who opened the door of garden for me and admitted me to it: Has the condition of this well changed from what it had originally been in the past ? He replied: No. I saw the color of water in this well had changed.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "38349",
        "20672",
        "11107",
        "12156",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-155",
      "hadith_no": "155",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، وأحمد بن أبي شعيب الحراني، قالا حدثنا وكيع، حدثنا دلهم بن صالح، عن حجير بن عبد الله، عن ابن بريدة، عن أبيه، أن النجاشي، أهدى إلى رسول الله صلى الله عليه وسلم خفين أسودين ساذجين فلبسهما ثم توضأ ومسح عليهما ‏.‏ قال مسدد عن دلهم بن صالح ‏.‏ قال أبو داود هذا مما تفرد به أهل البصرة ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     Negus presented to the Messenger of Allah (ﷺ) two black and simple socks. He put them on; then he performed ablution and wiped over them.Musaddad reported this tradition from Dulham b. Salih.Abu Dawud said: This tradition has been narrated by the people of Basrah alone.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30301",
        "20032",
        "15130",
        "28094",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-781",
      "hadith_no": "781",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن أبي شعيب، حدثنا محمد بن فضيل، عن عمارة، ح وحدثنا أبو كامل، حدثنا عبد الواحد، عن عمارة، - المعنى - عن أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا كبر في الصلاة سكت بين التكبير والقراءة فقلت له بأبي أنت وأمي أرأيت سكوتك بين التكبير والقراءة أخبرني ما تقول ‏.‏ قال ‏\"‏ اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم أنقني من خطاياى كالثوب الأبيض من الدنس اللهم اغسلني بالثلج والماء والبرد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah (ﷺ) kept silence between the takbir and the recitation of Qur’an. So I asked him, for whom I would give my father and mother as ransom: What do you say during you period of silence between the takbir and the recitation? He replied (that he said): O Allah, purify me from sins as a white garment is purified from filth. O Allah, wash away my sings with snow, water and hail.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20356",
        "11379",
        "30559",
        "20256",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1193",
      "hadith_no": "1193",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثني الحارث بن عمير البصري، عن أيوب السختياني، عن أبي قلابة، عن النعمان بن بشير، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم فجعل يصلي ركعتين ركعتين ويسأل عنها حتى انجلت ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     There was an eclipse of the sun in the time of the Prophet (ﷺ). He began to pray a series of pairs of rak'ahs enquiring about the sun (at the end of them) till it became clear.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20708",
        "11015",
        "11047",
        "274"
      ]
    },
    {
      "id": "sunan-abi-daud-1255",
      "hadith_no": "1255",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا زهير بن معاوية، حدثنا يحيى بن سعيد، عن محمد بن عبد الرحمن، عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يخفف الركعتين قبل صلاة الفجر حتى إني لأقول هل قرأ فيهما بأم القرآن",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) would pray two rak'ahs before the dawn prayer lightly so much so that I would say: Did he recite Surah al-Fatihah in them.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20321",
        "11062",
        "11105",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1412",
      "hadith_no": "1412",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، ح وحدثنا أحمد بن أبي شعيب، حدثنا ابن نمير، - المعنى - عن عبيد الله، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يقرأ علينا السورة - قال ابن نمير في غير الصلاة ثم اتفقا - فيسجد ونسجد معه حتى لا يجد أحدنا مكانا لموضع جبهته ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) would recite to us a surah (according to the version of Ibn Numair) outside the prayer (the agreed version goes), then he would prostrate along with him, and none of us could find a place for his forehead.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20031",
        "30301",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1424",
      "hadith_no": "1424",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن أبي شعيب، حدثنا محمد بن سلمة، حدثنا خصيف، عن عبد العزيز بن جريج، قال سألت عائشة أم المؤمنين بأى شىء كان يوتر رسول الله صلى الله عليه وسلم فذكر معناه قال وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏ والمعوذتين ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     AbdulAziz ibn Jurayj said: I asked Aisha, mother of the believers: With which (surah) the Messenger of Allah (ﷺ) used to observe witr? (She reported same as in the Hadith of Ubayy ibn Ka'b, No. 1418) This version adds: In the third rak'ah he would recite: \"Say, He is Allah, the One\" (Surah 112), and  \"Say, I seek refuge in the Lord of daybreak\" (Surah 113), and \"Say, I seek refuge in the Lord of mankind\" (Surah 114).",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20672",
        "19908",
        "19831",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1457",
      "hadith_no": "1457",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا عيسى بن يونس، حدثنا ابن أبي ذئب، عن المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ‏{‏ الحمد لله رب العالمين ‏}‏ أم القرآن وأم الكتاب والسبع المثاني ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      All praise be to Allah, the Lord of the Universe\" (1) is the epitome or basis of the Qur'an, the epitome or basis of the Book, and the seven oft-repeated verses.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20347",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1600",
      "hadith_no": "1600",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا موسى بن أعين، عن عمرو بن الحارث المصري، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال - أحد بني متعان - إلى رسول الله صلى الله عليه وسلم بعشور نحل له وكان سأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب - رضى الله عنه - كتب سفيان بن وهب إلى عمر بن الخطاب يسأله عن ذلك فكتب عمر رضى الله عنه إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشور نحله له فاحم له سلبة وإلا فإنما هو ذباب غيث يأكله من يشاء ‏.‏",
      "text_en": " 'Amr bin Shu'aib, on his father's authority, said that his grandfather reported:                      Hilal, a man from the tribe of Banu Mat'an brought a tenth of honey which he possessed in beehives to the Messenger of Allah (ﷺ). He asked him (the apostle of Allah) to give the wood known as Salabah as a protected (or restricted) land. The Messenger of Allah (ﷺ) gave him that wood as a protected land. When Umar ibn al-Khattab succeeded, Sufyan ibn Wahb wrote to Umar asking him about this wood. Umar ibn al-Khattab wrote to him: If he (Hilal) pays you the tithe on honey what he used to pay to the Messenger of Allah (ﷺ), leave the protected land of Salabah in his possession; otherwise those bees are like those of any wood; anyone can take the honey as he likes.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20465",
        "20377",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-1668",
      "hadith_no": "1668",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا عيسى بن يونس، حدثنا هشام بن عروة، عن أبيه، عن أسماء، قالت قدمت على أمي راغبة في عهد قريش وهي راغمة مشركة فقلت يا رسول الله إن أمي قدمت على وهي راغمة مشركة أفأصلها قال ‏\"‏ نعم فصلي أمك ‏\"‏ ‏.‏",
      "text_en": " Asma‘ said My mother came to me seeking some act of kindness from me during the treaty of the Quraish (at Hudaibiyyah).  While she hated Islam and she was a polytheist.  I said Messenger of Allah (ﷺ), my mother has come to me while she hates Islam and she is a disbeliever.  May I do an act of kindness to her?  He replied Yes, do an act of kindness to her.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20347",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "id": "sunan-abi-daud-2604",
      "hadith_no": "2604",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ترسلوا فواشيكم إذا غابت الشمس حتى تذهب فحمة العشاء فإن الشياطين تعيث إذا غابت الشمس حتى تذهب فحمة العشاء ‏\"‏ ‏.‏ قال أبو داود الفواشي ما يفشو من كل شىء ‏.‏",
      "text_en": " Jabir bin ‘Abd Allaah reported the Apostle of Allaah(ﷺ) as saying “Do not send out your beasts when the sun has set till the darkness of the night prevails, for the devils grope about in the dark when the sun has set till the darkness of the night prevails.”",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20321",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-2797",
      "hadith_no": "2797",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا زهير بن معاوية، حدثنا أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تذبحوا إلا مسنة إلا أن يعسر عليكم فتذبحوا جذعة من الضأن ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     The Messenger of Allah (ﷺ) as saying: Sacrifice only a full-grown animal unless it is difficult for you, in which case sacrifice a lamb.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20321",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3604",
      "hadith_no": "3604",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا الحارث بن عمير البصري، ح وحدثنا عثمان بن أبي شيبة، حدثنا إسماعيل ابن علية، كلاهما عن أيوب، عن ابن أبي مليكة، عن عبيد بن أبي مريم، عن عقبة بن الحارث، - وقد سمعته من، عقبة ولكني لحديث عبيد أحفظ - فذكر معناه ‏.‏ قال أبو داود نظر حماد بن زيد إلى الحارث بن عمير فقال هذا من ثقات أصحاب أيوب ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Uqbah bin al-Harith to the same effect through a different chain of narrators.Abu Dawud said:                      Hammad bin Zaid looked at al-Harith bin 'Umair and said: He is from reliable narrators from Ayyub.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20708",
        "30203",
        "20208",
        "11015",
        "11090",
        "872"
      ]
    },
    {
      "id": "sunan-abi-daud-4312",
      "hadith_no": "4312",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا محمد بن الفضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت ورآها الناس آمن من عليها فذاك حين ‏{‏ لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏}‏ ‏\"‏ ‏.‏ الآية ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The last hour will not come before rising of the sun in its place of setting. When it rises (there) and the people see it, those who are on it (the earth) will believe. This is the time of which the Qur’anic verse says: “. . .no good will it do to a soul to believe in them then, if it believed not before nor earned righteousness through its faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5193",
      "hadith_no": "5193",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن أبي شعيب، حدثنا زهير، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لا تدخلوا الجنة حتى تؤمنوا ولا تؤمنوا حتى تحابوا أفلا أدلكم على أمر إذا فعلتموه تحاببتم أفشوا السلام بينكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying:                      By him in whose hand my soul is, you will not enter Paradise until you believe, and you will not believe until you love one another: should I not guide you to something doing which you will love one another: spread out salutation among you.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20321",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2499",
      "hadith_no": "2499",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا أحمد بن أبي شعيب، عن موسى بن أعين، عن عمرو بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال إلى رسول الله صلى الله عليه وسلم بعشور نحل له وسأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب كتب سفيان بن وهب إلى عمر بن الخطاب يسأله فكتب عمر إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشر نحله فاحم له سلبة ذلك وإلا فإنما هو ذباب غيث يأكله من شاء ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father that his grandfather said:                     \"Hilal came to the Messenger of Allah with one-tenth of the honey and asked him to protect a valley for him that was called Salabah. 'The Messenger of Allah protected that valley for him. When 'Umar bin Al-Khattab became the Khalifah, sufyan bin Wahb wrote the 'Umar and asked him (about that), and Umar wrote: 'If the gives me what he used to give to the Messenger of Allah, one-tenth of his honey, I will protect Salahab for him, otherwise they are just bees and anyone who wants to may eat of it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20182",
        "30301",
        "20465",
        "20377",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4268",
      "hadith_no": "4268",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرني عمرو بن يحيى بن الحارث، قال حدثنا أحمد بن أبي شعيب، قال حدثنا موسى بن أعين، عن معمر، عن عاصم بن سليمان، عن عامر الشعبي، عن عدي بن حاتم، أنه سأل رسول الله صلى الله عليه وسلم عن الصيد فقال ‏\"‏ إذا أرسلت كلبك فخالطته أكلب لم تسم عليها فلا تأكل فإنك لا تدري أيها قتله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:                     \"If you release your dog and other dogs over with you have not mentioned the name of Allah join him, then do not eat (what they catch), because you do not know which of them killed it (the game),\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "30301",
        "20465",
        "20115",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4275",
      "hadith_no": "4275",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا أحمد بن أبي شعيب، قال حدثنا موسى بن أعين، عن معمر، عن عاصم بن سليمان، عن الشعبي، عن عدي بن حاتم الطائي، أنه سأل رسول الله صلى الله عليه وسلم عن الصيد قال ‏\"‏ إذا أرسلت كلبك فذكرت اسم الله عليه فقتل ولم يأكل فكل وإن أكل منه فلا تأكل فإنما أمسكه عليه ولم يمسك عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim At-Tai that:                     he asked the Messenger of Allah about hunting. He said: \"If you release your dog and mention the name of Allah over him, and he kills (the game), but does not eat any of it, then eat. But if he has eaten form it, then do not eat, for he caught it for himself, and not for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "30301",
        "20465",
        "20115",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4299",
      "hadith_no": "4299",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا أحمد بن أبي شعيب، قال حدثنا موسى بن أعين، عن معمر، عن عاصم بن سليمان، عن عامر الشعبي، عن عدي بن حاتم، أنه سأل رسول الله صلى الله عليه وسلم عن الصيد فقال ‏\"‏ إذا أرسلت سهمك وكلبك وذكرت اسم الله فقتل سهمك فكل ‏\"‏ ‏.‏ قال فإن بات عني ليلة يا رسول الله قال ‏\"‏ إن وجدت سهمك ولم تجد فيه أثر شىء غيره فكل وإن وقع في الماء فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:                     \"When you release your arrow or your dog, mentioned the name of Allah, and when your arrow kills (the game), then eat.\" He said: \"What if it gets away form me for a night, O Messenger of Allah?\" He said: \"If you find your arrow and you do not find the mark of anything else, then eat it. But if it falls into the water, do not eat it.\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "30301",
        "20465",
        "20115",
        "11080",
        "11052",
        "212"
      ]
    }
  ],
  "total_hadiths": 20
}