{
  "id": "30309",
  "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
  "full_name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Razi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20467",
      "name": "Hisham bin Yusuf al-Sana'i هشام بن يوسف الصنعاني أبو عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36621",
      "name": "Muhammad bin Isma'il bin Yusuf محمد بن إسماعيل بن يوسف",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "296",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني هشام، عن عروة، أنه سئل أتخدمني الحائض أو تدنو مني المرأة وهى جنب فقال عروة كل ذلك على هين، وكل ذلك تخدمني، وليس على أحد في ذلك بأس، أخبرتني عائشة أنها كانت ترجل  تعني  رأس رسول الله صلى الله عليه وسلم وهي حائض، ورسول الله صلى الله عليه وسلم حينئذ مجاور في المسجد، يدني لها رأسه وهى في حجرتها، فترجله وهى حائض‏.‏",
      "text_en": " Narrated `Urwa:                     A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" I replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person to do the same. `Aisha told me that she used to comb the hair of Allah's Apostle while she was in her menses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she would comb his hair, while she used to be in her menses.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "665",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، عن معمر، عن الزهري، قال أخبرني عبيد الله بن عبد الله، قال قالت عائشة لما ثقل النبي صلى الله عليه وسلم واشتد وجعه استأذن أزواجه أن يمرض في بيتي فأذن له، فخرج بين رجلين تخط رجلاه الأرض، وكان بين العباس ورجل آخر‏.‏ قال عبيد الله فذكرت ذلك لابن عباس ما قالت عائشة فقال لي وهل تدري من الرجل الذي لم تسم عائشة قلت لا‏.‏ قال هو علي بن أبي طالب‏.‏",
      "text_en": " Narrated `Aisha:                     \"When the Prophet became seriously ill and his disease became aggravated he asked for permission from his wives to be nursed in my house and he was allowed. He came out with the help of two men and his legs were dragging on the ground. He was between Al-`Abbas and another man.\" 'Ubaidullah said, \"I told Ibn `Abbas what `Aisha had narrated and he said, 'Do you know who was the (second) man whose name `Aisha did not mention'\" I said, 'No.' Ibn `Abbas said, 'He was `Ali Ibn Abi Talib.' \"",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "707",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا الوليد، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه أبي قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأقوم في الصلاة أريد أن أطول فيها، فأسمع بكاء الصبي، فأتجوز في صلاتي كراهية أن أشق على أمه ‏\"‏‏.‏ تابعه بشر بن بكر وابن المبارك وبقية عن الأوزاعي‏.‏",
      "text_en": " Narrated `Abdullah bin 'Abi Qatada:                     My father said, \"The Prophet said, 'When I stand for prayer, I intend to prolong it but on hearing the cries of a child, I cut it short, as I dislike to trouble the child's mother.' \"",
      "chain": [
        "30309",
        "20733",
        "20024",
        "11449",
        "11804"
      ]
    },
    {
      "hadith_no": "885",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني إبراهيم بن ميسرة، عن طاوس، عن ابن عباس  رضى الله عنهما  أنه ذكر قول النبي صلى الله عليه وسلم في الغسل يوم الجمعة فقلت لابن عباس أيمس طيبا أو دهنا إن كان عند أهله فقال لا أعلمه‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas mentioned the statement of the Prophet regarding the taking of a bath on Friday and then I asked him whether the Prophet (p.b.u.h) had ordered perfume or (hair) oil to be used if they could be found in one's house. He (Ibn `Abbas) replied that he did not know about it.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11240",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "961",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني عطاء، عن جابر بن عبد الله، قال سمعته يقول إن النبي صلى الله عليه وسلم خرج يوم الفطر، فبدأ بالصلاة قبل الخطبة‏.‏ قال وأخبرني عطاء، أن ابن عباس، أرسل إلى ابن الزبير في أول ما بويع له إنه لم يكن يؤذن بالصلاة يوم الفطر، إنما الخطبة بعد الصلاة‏.‏ وأخبرني عطاء، عن ابن عباس، وعن جابر بن عبد الله، قالا لم يكن يؤذن يوم الفطر ولا يوم الأضحى‏.‏ وعن جابر بن عبد الله، قال سمعته يقول إن النبي صلى الله عليه وسلم قام فبدأ بالصلاة، ثم خطب الناس بعد، فلما فرغ نبي الله صلى الله عليه وسلم نزل فأتى النساء، فذكرهن وهو يتوكأ على يد بلال، وبلال باسط ثوبه، يلقي فيه النساء صدقة‏.‏ قلت لعطاء أترى حقا على الإمام الآن أن يأتي النساء فيذكرهن حين يفرغ قال إن ذلك لحق عليهم، وما لهم أن لا يفعلوا",
      "text_en": " Narrated Ibn Juraij:                     `Ata' said, \"Jabir bin `Abdullah said, 'The Prophet went out on the Day of `Id-ul-Fitr and offered the prayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn `Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced (in the life time of Allah's Apostle) and the Khutba used to be delivered after the prayer. Ata told me that Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr and `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet stood up and started with the prayer, and after it he delivered the Khutba. When the Prophet of Allah (p.b.u.h) finished (the Khutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was spreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it incumbent upon an Imam to go to the women and preach to them after finishing the prayer and Khutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1077",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني أبو بكر بن أبي مليكة، عن عثمان بن عبد الرحمن التيمي، عن ربيعة بن عبد الله بن الهدير التيمي  قال أبو بكر وكان ربيعة من خيار الناس عما حضر ربيعة من عمر بن الخطاب  رضى الله عنه  قرأ يوم الجمعة على المنبر بسورة النحل حتى إذا جاء السجدة نزل فسجد وسجد الناس، حتى إذا كانت الجمعة القابلة قرأ بها حتى إذا جاء السجدة قال يا أيها الناس إنا نمر بالسجود فمن سجد فقد أصاب، ومن لم يسجد فلا إثم عليه‏.‏ ولم يسجد عمر  رضى الله عنه‏.‏ وزاد نافع عن ابن عمر  رضى الله عنهما إن الله لم يفرض السجود إلا أن نشاء‏.‏",
      "text_en": " Narrated Rabi`a:                     `Umar bin Al-Khattab recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse of Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday `Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O people! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right thing, yet it is no sin for the one who does not prostrate.\" And `Umar did not prostrate (that day). Added Ibn `Umar \"Allah has not made the prostration of recitation compulsory but if we wish we can do it.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11569",
        "11525",
        "20436"
      ]
    },
    {
      "hadith_no": "1200",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى  هو ابن يونس  عن إسماعيل، عن الحارث بن شبيل، عن أبي عمرو الشيباني، قال قال لي زيد بن أرقم إن كنا لنتكلم في الصلاة على عهد النبي صلى الله عليه وسلم، يكلم أحدنا صاحبه بحاجته حتى نزلت ‏{‏حافظوا على الصلوات‏}‏ الآية، فأمرنا بالسكوت‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     In the lifetime of the Prophet we used to speak while praying, and one of us would tell his needs to his companions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were ordered to remain silent while praying.",
      "chain": [
        "30309",
        "20347",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "1320",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني عطاء، أنه سمع جابر بن عبد الله  رضى الله عنهما  يقول قال النبي صلى الله عليه وسلم ‏\"‏ قد توفي اليوم رجل صالح من الحبش فهلم فصلوا عليه ‏\"‏‏.‏ قال فصففنا فصلى النبي صلى الله عليه وسلم عليه ونحن صفوف‏.‏ قال أبو الزبير عن جابر كنت في الصف الثاني‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"Today a pious man from Ethiopia (i.e. An Najashi) has expired, come on to offer the funeral prayer.\" (Jabir said): We lined up in rows and after that the Prophet led the prayer and we were in rows. Jabir added, I was in the second row.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1645",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا هشام، أن ابن جريج، أخبرهم قال أخبرني سليمان الأحول، أن طاوسا، أخبره عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم مر وهو يطوف بالكعبة بإنسان ربط يده إلى إنسان بسير، أو بخيط، أو بشىء غير ذلك، فقطعه النبي صلى الله عليه وسلم بيده، ثم قال ‏\"‏ قده بيده ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While the Prophet was performing Tawaf of the Ka`ba, he passed by a person who had tied his hands to another person with a rope or string or something like that. The Prophet cut it with his own hands and said, \"Lead him by the hand.\"",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11247",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن ابن جريج، قال أخبرني عطاء، عن أبي صالح الزيات، أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله كل عمل ابن آدم له إلا الصيام، فإنه لي، وأنا أجزي به‏.‏ والصيام جنة، وإذا كان يوم صوم أحدكم، فلا يرفث ولا يصخب، فإن سابه أحد، أو قاتله فليقل إني امرؤ صائم‏.‏ والذي نفس محمد بيده لخلوف فم الصائم أطيب عند الله من ريح المسك، للصائم فرحتان يفرحهما إذا أفطر فرح، وإذا لقي ربه فرح بصومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah said, 'All the deeds of Adam's sons (people) are for them, except fasting which is for Me, and I will give the reward for it.' Fasting is a shield or protection from the fire and from committing sins. If one of you is fasting, he should avoid sexual relation with his wife and quarreling, and if somebody should fight or quarrel with him, he should say, 'I am fasting.' By Him in Whose Hands my soul is' The unpleasant smell coming out from the mouth of a fasting person is better in the sight of Allah than the smell of musk. There are two pleasures for the fasting person, one at the time of breaking his fast, and the other at the time when he will meet his Lord; then he will be pleased because of his fasting.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "1993",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن ابن جريج، قال أخبرني عمرو بن دينار، عن عطاء بن مينا، قال سمعته يحدث، عن أبي هريرة  رضى الله عنه  قال ينهى عن صيامين، وبيعتين الفطر، والنحر،، والملامسة، والمنابذة،‏.‏",
      "text_en": " Narrated Abu Huraira:                     Two fasts and two kinds of sale are forbidden: fasting on the day of `Id ul Fitr and `Id-ul-Adha and the kinds of sale called Mulamasa and Munabadha. (These two kinds of sale used to be practiced in the days of Pre-Islamic period of ignorance; Mulamasa means when you touch something displayed for sale you have to buy it; Munabadha means when the seller throws something to you, you have to buy it.)",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11081",
        "13"
      ]
    },
    {
      "hadith_no": "2072",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، عن ثور، عن خالد بن معدان، عن المقدام  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أكل أحد طعاما قط خيرا من أن يأكل من عمل يده، وإن نبي الله داود  عليه السلام  كان يأكل من عمل يده ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miqdam:                     The Prophet said, \"Nobody has ever eaten a better meal than that which one has earned by working with one's own hands. The Prophet of Allah, David used to eat from the earnings of his manual labor.\"",
      "chain": [
        "30309",
        "20347",
        "11155",
        "11422",
        "5304"
      ]
    },
    {
      "hadith_no": "2128",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا الوليد، عن ثور، عن خالد بن معدان، عن المقدام بن معديكرب، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ كيلوا طعامكم يبارك لكم ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miqdam bin Ma'diyakrib:                     The Prophet said, \"Measure your foodstuff and you will be blessed.\"",
      "chain": [
        "30309",
        "20733",
        "11155",
        "11422"
      ]
    },
    {
      "hadith_no": "2263",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، عن عروة بن الزبير، عن عائشة  رضى الله عنها  واستأجر النبي صلى الله عليه وسلم وأبو بكر رجلا من بني الديل ثم من بني عبد بن عدي هاديا خريتا  الخريت الماهر بالهداية  قد غمس يمين حلف في آل العاص بن وائل، وهو على دين كفار قريش، فأمناه فدفعا إليه راحلتيهما، ووعداه غار ثور بعد ثلاث ليال، فأتاهما براحلتيهما، صبيحة ليال ثلاث، فارتحلا، وانطلق معهما عامر بن فهيرة، والدليل الديلي فأخذ بهم أسفل مكة وهو طريق الساحل‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet and Abu Bakr employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of Bani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to abide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet and Abu Bakr had confidence in him and gave him their riding camels and told him to bring them to the Cave of Thaur after three days. So, he brought them their two riding camels after three days and both of them (The Prophet and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili guide who guided them below Mecca along the road leading to the sea-shore.",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2267",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يعلى بن مسلم، وعمرو بن دينار، عن سعيد بن جبير، يزيد أحدهما على صاحبه، وغيرهما قال قد سمعته يحدثه عن سعيد قال قال لي ابن عباس  رضى الله عنهما  حدثني أبى بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فانطلقا فوجدا جدارا يريد أن ينقض ‏\"‏‏.‏ قال سعيد بيده هكذا، ورفع يديه فاستقام، قال يعلى حسبت أن سعيدا قال‏.‏ فمسحه بيده فاستقام ‏{‏قال‏}‏ ‏\"‏لو شئت لاتخذت عليه أجرا ‏\"‏‏.‏ قال سعيد أجرا نأكله‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     Allah's Apostle said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall which was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the wall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or Sa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if you had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to buy food . \"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11568",
        "11081",
        "11050",
        "11168",
        "17"
      ]
    },
    {
      "hadith_no": "2375",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني ابن شهاب، عن علي بن حسين بن علي، عن أبيه، حسين بن علي عن علي بن أبي طالب  رضى الله عنهم  أنه قال أصبت شارفا مع رسول الله صلى الله عليه وسلم في مغنم يوم بدر قال وأعطاني رسول الله صلى الله عليه وسلم شارفا أخرى، فأنختهما يوما عند باب رجل من الأنصار، وأنا أريد أن أحمل عليهما إذخرا لأبيعه، ومعي صائغ من بني قينقاع فأستعين به على وليمة فاطمة، وحمزة بن عبد المطلب يشرب في ذلك البيت معه قينة، فقالت ألا يا حمز للشرف النواء‏.‏ فثار إليهما حمزة بالسيف، فجب أسنمتهما، وبقر خواصرهما، ثم أخذ من أكبادهما‏.‏ قلت لابن شهاب ومن السنام قال قد جب أسنمتهما فذهب بها‏.‏ قال ابن شهاب قال علي  رضى الله عنه  فنظرت إلى منظر أفظعني فأتيت نبي الله صلى الله عليه وسلم وعنده زيد بن حارثة فأخبرته الخبر فخرج ومعه زيد، فانطلقت معه، فدخل على حمزة فتغيظ عليه فرفع حمزة بصره وقال هل أنتم إلا عبيد لآبائي فرجع رسول الله صلى الله عليه وسلم يقهقر حتى خرج عنهم، وذلك قبل تحريم الخمر‏.‏",
      "text_en": " Narrated Husain bin `Ali:                     `Ali bin Abi Talib said: \"I got a she-camel as my share of the war booty on the day (of the battle) of Badr, and Allah's Apostle gave me another she-camel. I let both of them kneel at the door of one of the Ansar, intending to carry Idhkhir on them to sell it and use its price for my wedding banquet on marrying Fatima. A goldsmith from Bani Qainqa' was with me. Hamza bin `Abdul-Muttalib was in that house drinking wine and a lady singer was reciting: \"O Hamza! (Kill) the (two) fat old she camels (and serve them to your guests). So Hamza took his sword and went towards the two she-camels and cut off their humps and opened their flanks and took a part of their livers.\" (I said to Ibn Shihab, \"Did he take part of the humps?\" He replied, \"He cut off their humps and carried them away.\") `Ali further said, \"When I saw that dreadful sight, I went to the Prophet and told him the news. The Prophet came out in the company of Zaid bin Haritha who was with him then, and I too went with them. He went to Hamza and spoke harshly to him. Hamza looked up and said, 'Aren't you only the slaves of my forefathers?' The Prophet retreated and went out. This incident happened before the prohibition of drinking.\"",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11013",
        "11045",
        "5"
      ]
    },
    {
      "hadith_no": "2574",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا عبدة، حدثنا هشام، عن أبيه، عن عائشة  رضى الله عنها  أن الناس، كانوا يتحرون بهداياهم يوم عائشة، يبتغون بها  أو يبتغون بذلك  مرضاة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     The people used to look forward for the days of my (`Aisha's) turn to send gifts to Allah's Apostle in order to please him.",
      "chain": [
        "30309",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2588",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، قال أخبرني عبيد الله بن عبد الله، قالت عائشة  رضى الله عنها  لما ثقل النبي صلى الله عليه وسلم فاشتد وجعه استأذن أزواجه أن يمرض في بيتي، فأذن له، فخرج بين رجلين، تخط رجلاه الأرض، وكان بين العباس، وبين رجل آخر‏.‏ فقال عبيد الله فذكرت لابن عباس ما قالت عائشة، فقال لي وهل تدري من الرجل الذي لم تسم عائشة قلت لا‏.‏ قال هو علي بن أبي طالب‏.‏",
      "text_en": " Narrated Az-Zuhri:                     Ubaidullah bin `Abdullah told me that `Aisha had said, \"When the Prophet became sick and his condition became serious, he requested his wives to allow him to be treated in my house, and they allowed him. He came out leaning on two men while his feet were dragging on the ground. He was walking between Al-`Abbas and another man.\" 'Ubaidullah said, \"When I informed Ibn `Abbas of what `Aisha had said, he asked me whether I knew who was the second man whom `Aisha had not named. I replied in the negative. He said, 'He was `Ali bin Abi Talib.\"",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "2624",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني عبد الله بن عبيد الله بن أبي مليكة، أن بني صهيب، مولى ابن جدعان ادعوا بيتين وحجرة، أن رسول الله صلى الله عليه وسلم أعطى ذلك صهيبا، فقال مروان من يشهد لكما على ذلك قالوا ابن عمر‏.‏ فدعاه فشهد لأعطى رسول الله صلى الله عليه وسلم صهيبا بيتين وحجرة‏.‏ فقضى مروان بشهادته لهم‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr (ra):                      My mother came to me during the lifetime of Allah's Messenger () and she was a Mushrikah (polytheist, idolatress, pagan). I said to Allah's Messenger () (seeking his verdict), \"My mother has come to and she desires to recieve a reward from me, shall I keep good relations with her ?\" The Prophet () said, \"Yes, keep good relation with her.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11090"
      ]
    },
    {
      "hadith_no": "2683",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن ابن جريج، قال أخبرني عمرو بن دينار، عن محمد بن علي، عن جابر بن عبد الله، رضى الله عنهم قال لما مات النبي صلى الله عليه وسلم جاء أبا بكر مال من قبل العلاء بن الحضرمي، فقال أبو بكر من كان له على النبي صلى الله عليه وسلم دين، أو كانت له قبله عدة، فليأتنا‏.‏ قال جابر فقلت وعدني رسول الله صلى الله عليه وسلم أن يعطيني هكذا وهكذا وهكذا، فبسط يديه ثلاث مرات، قال جابر فعد في يدي خمسمائة، ثم خمسمائة، ثم خمسمائة‏.‏",
      "text_en": " Narrated Muhammad bin `Ali:                     Jabir bin `Abdullah said, \"When the Prophet died, Abu Bakr received some property from Al-`Ala bin Al-Hadrami. Abu Bakr said to the people, \"Whoever has a money claim on the Prophet, or was promised something by him, should come to us (so that we may pay him his right).\" Jabir added, \"I said (to Abu Bakr), Allah's Apostle promised me that he would give me this much, and this much, and this much (spreading his hands three times).\" Jabir added, \"Abu Bakr counted for me and handed me five-hundred (gold pieces), and then five-hundred, and then five-hundred.\"",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11081",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "2728",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبره قال أخبرني يعلى بن مسلم، وعمرو بن دينار، عن سعيد بن جبير، يزيد أحدهما على صاحبه وغيرهما قد سمعته يحدثه عن سعيد بن جبير قال إنا لعند ابن عباس  رضى الله عنهما  قال حدثني أبى بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ موسى رسول الله ‏\"‏ فذكر الحديث ‏{‏قال ألم أقل إنك لن تستطيع معي صبرا‏}‏ كانت الأولى نسيانا، والوسطى شرطا، والثالثة عمدا ‏{‏قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا‏}‏‏.‏ ‏{‏لقيا غلاما فقتله‏}‏ فانطلقا فوجدا جدارا يريد أن ينقض فأقامه‏.‏ قرأها ابن عباس أمامهم ملك‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     Allah's Apostle said, \"Moses the Apostle of Allah,\" and then he narrated the whole story about him. Al-Khadir said to Moses, \"Did not I tell you that you can have no patience with me.\" (18.72). Moses then violated the agreement for the first time because of forgetfulness, then Moses promised that if he asked Al-Khadir about anything, the latter would have the right to desert him. Moses abided by that condition and on the third occasion he intentionally asked Al-Khadir and caused that condition to be applied. The three occasions referred to above are referred to by the following Verses: \"Call me not to account for forgetting And be not hard upon me.\" (18.73) \"Then they met a boy and Khadir killed him.\" (18.74) \"Then they proceeded and found a wall which was on the verge of falling and Khadir set it up straight.\" (18.77)",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11568",
        "11081",
        "11050",
        "11050"
      ]
    },
    {
      "hadith_no": "2762",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يعلى، أنه سمع عكرمة، مولى ابن عباس يقول أنبأنا ابن عباس، أن سعد بن عبادة  رضى الله عنهم  أخا بني ساعدة توفيت أمه وهو غائب، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي توفيت وأنا غائب عنها، فهل ينفعها شىء إن تصدقت به عنها قال ‏\"‏ نعم ‏\"‏‏.‏ قال فإني أشهدك أن حائطي المخراف صدقة عليها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That the mother of Sa`d bin Ubada the brother of Bani Saida died in Sa`d's absence, so he came to the Prophet saying, \"O Allah's Apostle! My mother died in my absence, will it benefit her if I give in charity on her behalf?\" The Prophet said, \"Yes.\" Sa`d said, \"I take you as my witness that I give my garden Al-Makhraf in charity on her behalf.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "20372",
        "11023",
        "17",
        "35"
      ]
    },
    {
      "hadith_no": "2812",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عبد الوهاب، حدثنا خالد، عن عكرمة، أن ابن عباس، قال له ولعلي بن عبد الله ائتيا أبا سعيد فاسمعا من حديثه‏.‏ فأتيناه وهو وأخوه في حائط لهما يسقيانه، فلما رآنا جاء فاحتبى وجلس فقال كنا ننقل لبن المسجد لبنة لبنة، وكان عمار ينقل لبنتين لبنتين، فمر به النبي صلى الله عليه وسلم ومسح عن رأسه الغبار وقال ‏\"‏ ويح عمار، تقتله الفئة الباغية، عمار يدعوهم إلى الله ويدعونه إلى النار ‏\"‏‏.‏",
      "text_en": " Narrated `Ikrima:                     that Ibn `Abbas told him and `Ali bin `Abdullah to go to Abu Sa`id and listen to some of his narrations; So they both went (and saw) Abu Sa`id and his brother irrigating a garden belonging to them. When he saw them, he came up to them and sat down with his legs drawn up and wrapped in his garment and said, \"(During the construction of the mosque of the Prophet) we carried the adobe of the mosque, one brick at a time while `Ammar used to carry two at a time. The Prophet passed by `Ammar and removed the dust off his head and said, \"May Allah be merciful to `Ammar. He will be killed by a rebellious aggressive group. `Ammar will invite them to (obey) Allah and they will invite him to the (Hell) fire.\"",
      "chain": [
        "30309",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2901",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة  رضى الله عنه  قال بينا الحبشة يلعبون عند النبي صلى الله عليه وسلم بحرابهم دخل عمر، فأهوى إلى الحصى فحصبهم بها‏.‏ فقال ‏\"‏ دعهم يا عمر ‏\"‏‏.‏ وزاد علي حدثنا عبد الرزاق أخبرنا معمر في المسجد‏.‏",
      "text_en": " Narrated Abu Huraira:                     While some Ethiopians were playing in the presence of the Prophet, `Umar came in, picked up a stone and hit them with it. On that the Prophet said, \"O `Umar! Allow them (to play).\" Ma`mar (the subnarrator) added that they were playing in the Mosque.",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  قال لما كان يوم الأحزاب قال رسول الله صلى الله عليه وسلم ‏\"‏ ملأ الله بيوتهم وقبورهم نارا، شغلونا عن الصلاة الوسطى حين غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     When it was the day of the battle of Al-Ahzab (i.e. the clans), Allah's Apostle said, \"O Allah! Fill their (i.e. the infidels') houses and graves with fire as they busied us so much that we did not perform the prayer (i.e. `Asr) till the sun set.\"",
      "chain": [
        "30309",
        "20347",
        "11065",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3079",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا يزيد بن زريع، عن خالد، عن أبي عثمان النهدي، عن مجاشع بن مسعود، قال جاء مجاشع بأخيه مجالد بن مسعود إلى النبي صلى الله عليه وسلم فقال هذا مجالد يبايعك على الهجرة‏.‏ فقال ‏\"‏ لا هجرة بعد فتح مكة، ولكن أبايعه على الإسلام ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Uthman An-Nahdi:                     Mujashi (bin Mas`ud) took his brother Mujalid bin Musud to the Prophet and said, \"This is Mujalid and he will give a pledge of allegiance to you for migration.\" The Prophet said, \"There is no migration after the Conquest of Mecca, but I will take his pledge of allegiance for Islam.\"",
      "chain": [
        "30309",
        "20304",
        "11282",
        "11113",
        "5271"
      ]
    },
    {
      "hadith_no": "3268",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت سحر النبي صلى الله عليه وسلم‏.‏ وقال الليث كتب إلى هشام أنه سمعه ووعاه عن أبيه عن عائشة قالت سحر النبي صلى الله عليه وسلم حتى كان يخيل إليه أنه يفعل الشىء وما يفعله، حتى كان ذات يوم دعا ودعا، ثم قال ‏\"‏ أشعرت أن الله أفتاني فيما فيه شفائي أتاني رجلان، فقعد أحدهما عند رأسي والآخر عند رجلى، فقال أحدهما للآخر ما وجع الرجل قال مطبوب‏.‏ قال ومن طبه قال لبيد بن الأعصم‏.‏ قال في ماذا قال في مشط ومشاقة وجف طلعة ذكر‏.‏ قال فأين هو قال في بئر ذروان ‏\"‏‏.‏ فخرج إليها النبي صلى الله عليه وسلم ثم رجع فقال لعائشة حين رجع ‏\"‏ نخلها كأنها رءوس الشياطين ‏\"‏‏.‏ فقلت استخرجته فقال ‏\"‏ لا أما أنا فقد شفاني الله، وخشيت أن يثير ذلك على الناس شرا، ثم دفنت البئر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Magic was worked on the Prophet so that he began to fancy that he was doing a thing which he was not actually doing. One day he invoked (Allah) for a long period and then said, \"I feel that Allah has inspired me as how to cure myself. Two persons came to me (in my dream) and sat, one by my head and the other by my feet. One of them asked the other, \"What is the ailment of this man?\" The other replied, 'He has been bewitched\" The first asked, 'Who has bewitched him?' The other replied, 'Lubaid bin Al-A'sam.' The first one asked, 'What material has he used?' The other replied, 'A comb, the hair gathered on it, and the outer skin of the pollen of the male date-palm.' The first asked, 'Where is that?' The other replied, 'It is in the well of Dharwan.' \" So, the Prophet went out towards the well and then returned and said to me on his return, \"Its date-palms (the date-palms near the well) are like the heads of the devils.\" I asked, \"Did you take out those things with which the magic was worked?\" He said, \"No, for I have been cured by Allah and I am afraid that this action may spread evil amongst the people.\" Later on the well was filled up with earth.",
      "chain": [
        "30309",
        "20347",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3352",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما أن النبي صلى الله عليه وسلم لما رأى الصور في البيت لم يدخل، حتى أمر بها فمحيت، ورأى إبراهيم وإسماعيل  عليهما السلام  بأيديهما الأزلام فقال ‏\"‏ قاتلهم الله، والله إن استقسما بالأزلام قط ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet saw pictures in the Ka`ba, he did not enter it till he ordered them to be erased. When he saw (the pictures of Abraham and Ishmael carrying the arrows of divination, he said, \"May Allah curse them (i.e. the Quraish)! By Allah, neither Abraham nor Ishmael practiced divination by arrows.\"",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3394",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ليلة أسري به ‏\"‏ رأيت موسى وإذا رجل ضرب رجل، كأنه من رجال شنوءة، ورأيت عيسى، فإذا هو رجل ربعة أحمر كأنما خرج من ديماس، وأنا أشبه ولد إبراهيم صلى الله عليه وسلم به، ثم أتيت بإناءين، في أحدهما لبن، وفي الآخر خمر فقال اشرب أيهما شئت‏.‏ فأخذت اللبن فشربته فقيل أخذت الفطرة، أما إنك لو أخذت الخمر غوت أمتك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"On the night of my Ascension to Heaven, I saw (the prophet) Moses who was a thin person with lank hair, looking like one of the men of the tribe of Shanua; and I saw Jesus who was of average height with red face as if he had just come out of a bathroom. And I resemble prophet Abraham more than any of his offspring does. Then I was given two cups, one containing milk and the other wine. Gabriel said, 'Drink whichever you like.' I took the milk and drank it. Gabriel said, 'You have accepted what is natural, (True Religion i.e. Islam) and if you had taken the wine, your followers would have gone astray.' \"",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، عن معمر،‏.‏ حدثني محمود، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليلة أسري به لقيت موسى  قال فنعته  فإذا رجل  حسبته قال  مضطرب رجل الرأس، كأنه من رجال شنوءة  قال  ولقيت عيسى  فنعته النبي صلى الله عليه وسلم فقال  ربعة أحمر كأنما خرج من ديماس  يعني الحمام  ورأيت إبراهيم، وأنا أشبه ولده به  قال  وأتيت بإناءين أحدهما لبن والآخر فيه خمر، فقيل لي خذ أيهما شئت‏.‏ فأخذت اللبن فشربته، فقيل لي هديت الفطرة، أو أصبت الفطرة، أما إنك لو أخذت الخمر غوت أمتك ‏\"‏‏.‏",
      "text_en": " Narrated Hisham:                     From Ma`mar as below.Narrated Abu Huraira:The Prophet said, \"I met Moses on the night of my Ascension to heaven.\" The Prophet then described him saying, as I think, \"He was a tall person with lank hair as if he belonged to the people of the tribe of Shanu's.' The Prophet further said, \"I met Jesus.\" The Prophet described him saying, \"He was one of moderate height and was red-faced as if he had just come out of a bathroom. I saw Abraham whom I resembled more than any of his children did.\" The Prophet further said, \"(That night) I was given two cups; one full of milk and the other full of wine. I was asked to take either of them which I liked, and I took the milk and drank it. On that it was said to me, 'You have taken the right path (religion). If you had taken the wine, your (Muslim) nation would have gone astray.\"",
      "chain": [
        "30309",
        "20295",
        "20115",
        "30277",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا ابن أبي زائدة، حدثنا هاشم بن هاشم بن عتبة بن أبي وقاص، قال سمعت سعيد بن المسيب، يقول سمعت سعد بن أبي وقاص، يقول ما أسلم أحد إلا في اليوم الذي أسلمت فيه، ولقد مكثت سبعة أيام وإني لثلث الإسلام‏.‏ تابعه أبو أسامة حدثنا هاشم‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     No man embraced Islam before the day on which I embraced Islam, and no doubt, I remained for seven days as one third of the then extant Muslims.",
      "chain": [
        "30309",
        "20366",
        "11227",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "3797",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن معمر، عن الزهري، عن أنس،‏.‏ وقال عبد الرزاق أخبرنا معمر، عن الزهري، أخبرني أنس، قال لم يكن أحد أشبه بالنبي صلى الله عليه وسلم من الحسن بن علي‏.‏",
      "text_en": " Narrated Anas:                     None resembled the Prophet more than Al-Hasan bin `Ali did.",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "20121",
        "20115",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3939",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم قال عطاء قال جابر أنا وأبي، وخالي، من أصحاب العقبة‏.‏",
      "text_en": " Narrated Jabir:                     My father, my two maternal uncles and I were among those who took part in the 'Aqaba Pledge.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11029"
      ]
    },
    {
      "hadith_no": "3960",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن ابن جريج، قال أخبرني عبيد الله بن عمر، عن نافع يعني، عن ابن عمر، عن عمر بن الخطاب، رضى الله عنه قال كان فرض للمهاجرين الأولين أربعة آلاف في أربعة، وفرض لابن عمر ثلاثة آلاف وخمسمائة فقيل له هو من المهاجرين، فلم نقصته من أربعة آلاف فقال إنما هاجر به أبواه‏.‏ يقول ليس هو كمن هاجر بنفسه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar bin Al-Khattab fixed a grant of 4000 (Dirhams) for every Early Emigrant (i.e. Muhajir) and fixed a grant of 3500 (Dirhams) only for Ibn `Umar. Somebody said to `Umar, \"Ibn `Umar is also one of the Early Emigrants; why do you give him less than four-thousand?\" `Umar replied, \"His parents took him with them when they migrated, so he was not like the one who had migrated by himself.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4002",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني عبد الكريم، أنه سمع مقسما، مولى عبد الله بن الحارث يحدث عن ابن عباس، أنه سمعه يقول ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ عن بدر، والخارجون، إلى بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The believers who failed to join the Ghazwa of Badr and those who took part in it are not equal (in reward).",
      "chain": [
        "30309",
        "20295",
        "11070",
        "18655",
        "17"
      ]
    },
    {
      "hadith_no": "4022",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "أخبرني إبراهيم بن موسى، حدثنا هشام بن يوسف، عن معمر، عن هشام، عن عروة، قال كان في الزبير ثلاث ضربات بالسيف، إحداهن في عاتقه، قال إن كنت لأدخل أصابعي فيها‏.‏ قال ضرب ثنتين يوم بدر، وواحدة يوم اليرموك‏.‏ قال عروة وقال لي عبد الملك بن مروان حين قتل عبد الله بن الزبير يا عروة، هل تعرف سيف الزبير قلت نعم‏.‏ قال فما فيه قلت فيه فلة فلها يوم بدر‏.‏ قال صدقت‏.‏ بهن فلول من قراع الكتائب ثم رده على عروة‏.‏ قال هشام فأقمناه بيننا ثلاثة آلاف، وأخذه بعضنا، ولوددت أني كنت أخذته‏.‏",
      "text_en": "      Narrated 'Urwa (the son of Az- Zubair):                          Az-Zubair had three scars      caused by the sword, one of which was over his shoulder and I used to      insert my fingers in it. He received two of those wounds on the day of     Badr and one on the day of Al-Yarmuk. When 'Abdullah bin Zubair was      killed, 'Abdul-Malik bin Marwan said to me, \"O 'Urwa, do you recognize     the sword of Az-Zubair?\" I said, \"Yes.\" He said, \"What marks does it      have?\" I replied, \"It has a dent in its sharp edge which was caused in     it on the day of Badr.\" 'Abdul- Malik said, \"You are right! (i.e.      their swords) have dents because of clashing with the regiments of the     enemies Then 'Abdul-Malik returned that sword to me (i.e. Urwa).      (Hisham, 'Urwa's son said, \"We estimated the price of the sword as      three-thousand (Dinars) and after that it was taken by one of us (i.e.     the inheritors) and I wish I could have had it.\")",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11065",
        "10511",
        "10511"
      ]
    },
    {
      "hadith_no": "4045",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال يوم بدر ‏\"‏ هذا جبريل آخذ برأس فرسه  عليه أداة الحرب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said on the day (of the battle) of Badr, \"This is Gabriel holding the head of his horse and equipped with arms for the battle.",
      "chain": [
        "30309",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4052",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري،‏.‏ حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن ابن عباس  رضى الله عنهما  قال أخبرني أبو طلحة  رضى الله عنه  صاحب رسول الله صلى الله عليه وسلم وكان قد شهد بدرا مع رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة ‏\"‏‏.‏ يريد التماثيل التي فيها الأرواح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Talha, a companion of Allah's Apostle and one of those who fought at Badr together with Allah's Apostle told me that Allah's Apostle said. \"Angels do not enter a house in which there is a dog or a picture\" He meant the images of creatures that have souls.",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "11418",
        "15185",
        "11005",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4077",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن هشام بن عروة، عن أبيه، عن الزبير، قال ضربت يوم بدر للمهاجرين بمائة سهم‏.‏",
      "text_en": " Narrated Az-Zubair:                     On the day of Badr, (Quraishi) Emigrants received 100 shares of the war booty.\"",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11065",
        "10511",
        "7"
      ]
    },
    {
      "hadith_no": "4085",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، أن فاطمة  عليها السلام  والعباس أتيا أبا بكر يلتمسان ميراثهما، أرضه من فدك، وسهمه من خيبر‏.‏   فقال أبو بكر سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا نورث، ما تركنا صدقة، إنما يأكل آل محمد في هذا المال ‏\"‏‏.‏ والله لقرابة رسول الله صلى الله عليه وسلم أحب إلى أن أصل من قرابتي‏.‏",
      "text_en": " Narrated `Aisha:                     Fatima and Al-`Abbas came to Abu Bakr, claiming their inheritance of the Prophet's land of Fadak and his share from Khaibar. Abu Bakr said, \"I heard the Prophet saying, 'Our property is not inherited, and whatever we leave is to be given in charity. But the family of Muhammad can take their sustenance from this property.' By Allah, I would love to do good to the Kith and kin of Allah's Apostle rather than to my own Kith and kin.\"",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4091",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم أحد ‏\"‏ هذا جبريل آخذ برأس فرسه عليه أداة الحرب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of Uhud. the Prophet said, \"This is Gabriel holding the head of his horse and equipped with war material.'",
      "chain": [
        "30309",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4135",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن معمر، عن الزهري، عن عمرو بن أبي سفيان الثقفي، عن أبي هريرة  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية عينا، وأمر عليهم عاصم بن ثابت  وهو جد عاصم بن عمر بن الخطاب  فانطلقوا حتى إذا كان بين عسفان ومكة ذكروا لحي من هذيل، يقال لهم بنو لحيان، فتبعوهم بقريب من مائة رام، فاقتصوا آثارهم حتى أتوا منزلا نزلوه فوجدوا فيه نوى تمر تزودوه من المدينة فقالوا هذا تمر يثرب‏.‏ فتبعوا آثارهم حتى لحقوهم، فلما انتهى عاصم وأصحابه لجئوا إلى فدفد، وجاء القوم فأحاطوا بهم، فقالوا لكم العهد والميثاق إن نزلتم إلينا أن لا نقتل منكم رجلا‏.‏ فقال عاصم أما أنا فلا أنزل في ذمة كافر، اللهم أخبر عنا نبيك‏.‏ فقاتلوهم حتى قتلوا عاصما في سبعة نفر بالنبل، وبقي خبيب، وزيد ورجل آخر، فأعطوهم العهد والميثاق، فلما أعطوهم العهد والميثاق نزلوا إليهم، فلما استمكنوا منهم حلوا أوتار قسيهم فربطوهم بها‏.‏ فقال الرجل الثالث الذي معهما هذا أول الغدر‏.‏ فأبى أن يصحبهم فجرروه وعالجوه على أن يصحبهم، فلم يفعل، فقتلوه، وانطلقوا بخبيب وزيد حتى باعوهما بمكة، فاشترى خبيبا بنو الحارث بن عامر بن نوفل، وكان خبيب هو قتل الحارث يوم بدر، فمكث عندهم أسيرا حتى إذا أجمعوا قتله استعار موسى من بعض بنات الحارث أستحد بها فأعارته، قالت فغفلت عن صبي لي فدرج إليه حتى أتاه، فوضعه على فخذه، فلما رأيته فزعت فزعة عرف ذاك مني، وفي يده الموسى فقال أتخشين أن أقتله ما كنت لأفعل ذاك إن شاء الله‏.‏ وكانت تقول ما رأيت أسيرا قط خيرا من خبيب، لقد رأيته يأكل من قطف عنب، وما بمكة يومئذ ثمرة، وإنه لموثق في الحديد، وما كان إلا رزق رزقه الله، فخرجوا به من الحرم، ليقتلوه فقال دعوني أصلي ركعتين‏.‏ ثم انصرف إليهم فقال لولا أن تروا أن ما بي جزع من الموت، لزدت‏.‏ فكان أول من سن الركعتين عند القتل هو، ثم قال اللهم أحصهم عددا ثم قال ما أبالي حين أقتل مسلما على أى شق كان لله مصرعي وذلك في ذات الإله وإن يشأ يبارك على أوصال شلو ممزع ثم قام إليه عقبة بن الحارث فقتله، وبعث قريش إلى عاصم ليؤتوا بشىء من جسده يعرفونه، وكان عاصم قتل عظيما من عظمائهم يوم بدر، فبعث الله عليه مثل الظلة من الدبر، فحمته من رسلهم، فلم يقدروا منه على شىء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet sent a Sariya of spies and appointed `Asim bin Thabit, the grandfather of `Asim bin `Umar bin Al-Khattab, as their leader. So they set out, and when they reached (a place) between 'Usfan and Mecca, they were mentioned to one of the branch tribes of Bani Hudhail called Lihyan. So, about one-hundred archers followed their traces till they (i.e. the archers) came to a journey station where they (i.e. `Asim and his companions) had encamped and found stones of dates they had brought as journey food from Medina. The archers said, \"These are the dates of Medina,\" and followed their traces till they took them over. When `Asim and his companions were not able to go ahead, they went up a high place, and their pursuers encircled them and said, \"You have a covenant and a promise that if you come down to us, we will not kill anyone of you.\" `Asim said, \"As for me, I will never come down on the security of an infidel. O Allah! Inform Your Prophet about us.\" So they fought with them till they killed `Asim along with seven of his companions with arrows, and there remained Khubaib, Zaid and another man to whom they gave a promise and a covenant. So when the infidels gave them the covenant and promise, they came down. When they captured them, they opened the strings of their arrow bows and tied them with it. The third man who was with them said, \"This is the first breach in the covenant,\" and refused to accompany them. They dragged him and tried to make him accompany them, but he refused, and they killed him. Then they proceeded on taking Khubaib and Zaid till they sold them in Mecca. The sons of Al-Harith bin `Amr bin Naufal bought Khubaib. It was Khubaib who had killed Al-Harith bin `Amr on the day of Badr. Khubaib stayed with them for a while as a captive till they decided unanimously to kill him. (At that time) Khubaib borrowed a razor from one of the daughters of Al- Harith to shave his pubic hair. She gave it to him. She said later on, \"I was heedless of a little baby of mine, who moved towards Khubaib, and when it reached him, he put it on his thigh. When I saw it, I got scared so much that Khubaib noticed my distress while he was carrying the razor in his hand. He said 'Are you afraid that I will kill it? Allah willing, I will never do that,' \" Later on she used to say, \"I have never seen a captive better than Khubaib Once I saw him eating from a bunch of grapes although at that time no fruits were available at Mecca, and he was fettered with iron chains, and in fact, it was nothing but food bestowed upon him by Allah.\" So they took him out of the Sanctuary (of Mecca) to kill him. He said, \"Allow me to offer a two-rak`at prayer.\" Then he went to them and said, \"Had I not been afraid that you would think I was afraid of death, I would have prayed for a longer time.\" So it was Khubaib who first set the tradition of praying two rak`at before being executed. He then said, \"O Allah! Count them one by one,\" and added, 'When I am being martyred as a Muslim, I do not care in what way I receive my death for Allah's Sake, because this death is in Allah's Cause. If He wishes, He will bless the cut limbs.\" Then `Uqba bin Al-Harith got up and martyred him. The narrator added: The Quraish (infidels) sent some people to `Asim in order to bring a part of his body so that his death might be known for certain, for `Asim had killed one of their chiefs on the day of Badr. But Allah sent a cloud of wasps which protected his body from their messengers who could not harm his body consequently.",
      "chain": [
        "30309",
        "20467",
        "20115",
        "11013",
        "11531",
        "13"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، عن سالم، عن ابن عمر، قال وأخبرني ابن طاوس، عن عكرمة بن خالد، عن ابن عمر، قال دخلت على حفصة ونسواتها تنطف، قلت قد كان من أمر الناس ما ترين، فلم يجعل لي من الأمر شىء‏.‏ فقالت الحق فإنهم ينتظرونك، وأخشى أن يكون في احتباسك عنهم فرقة‏.‏ فلم تدعه حتى ذهب، فلما تفرق الناس خطب معاوية قال من كان يريد أن يتكلم في هذا الأمر فليطلع لنا قرنه، فلنحن أحق به منه ومن أبيه‏.‏ قال حبيب بن مسلمة فهلا أجبته قال عبد الله فحللت حبوتي وهممت أن أقول أحق بهذا الأمر منك من قاتلك وأباك على الإسلام‏.‏ فخشيت أن أقول كلمة تفرق بين الجمع، وتسفك الدم، ويحمل عني غير ذلك، فذكرت ما أعد الله في الجنان‏.‏ قال حبيب حفظت وعصمت‏.‏ قال محمود عن عبد الرزاق ونوساتها‏.‏",
      "text_en": " Narrated `Ikrima bin Khalid:                     Ibn `Umar said, \"I went to Hafsa while water was dribbling from her twined braids. I said, 'The condition of the people is as you see, and no authority has been given to me.' Hafsa said, (to me), 'Go to them, and as they (i.e. the people) are waiting for you, and I am afraid your absence from them will produce division amongst them.' \" So Hafsa did not leave Ibn `Umar till we went to them. When the people differed. Muawiya addressed the people saying, \"'If anybody wants to say anything in this matter of the Caliphate, he should show up and not conceal himself, for we are more rightful to be a Caliph than he and his father.\" On that, Habib bin Masalama said (to Ibn `Umar), \"Why don't you reply to him (i.e. Muawiya)?\" `Abdullah bin `Umar said, \"I untied my garment that was going round my back and legs while I was sitting and was about to say, 'He who fought against you and against your father for the sake of Islam, is more rightful to be a Caliph,' but I was afraid that my statement might produce differences amongst the people and cause bloodshed, and my statement might be interpreted not as I intended. (So I kept quiet) remembering what Allah has prepared in the Gardens of Paradise (for those who are patient and prefer the Hereafter to this worldly life).\" Habib said, \"You did what kept you safe and secure (i.e. you were wise in doing so).",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "11011",
        "18",
        "11433",
        "11709",
        "18"
      ]
    },
    {
      "hadith_no": "4209",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، عن إسماعيل، عن قيس، أنه سمع مرداسا الأسلمي، يقول  وكان من أصحاب الشجرة  يقبض الصالحون الأول فالأول، وتبقى حفالة كحفالة التمر والشعير، لا يعبأ الله بهم شيئا‏.‏",
      "text_en": " Narrated Mirdas Al-Aslami:                     Who was among those (who had given the Pledge of allegiance) under the Tree: Pious people will die in succession, and there will remain the dregs of society who will be like the useless residues of dates and barley and Allah will pay no attention to them.",
      "chain": [
        "30309",
        "20347",
        "11418",
        "11046"
      ]
    },
    {
      "hadith_no": "4273",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا ابن أبي زائدة، أخبرنا عاصم، عن عامر، عن البراء بن عازب  رضى الله عنهما  قال أمرنا النبي صلى الله عليه وسلم في غزوة خيبر أن نلقي الحمر الأهلية نيئة ونضيجة، ثم لم يأمرنا بأكله بعد‏.‏",
      "text_en": " Narrated Al-Bara Bin Azib:                     During the Ghazwa of Khaibar, the Prophet ordered us to throw away the meat of the donkeys whether it was still raw or cooked. He did not allow us to eat it later on.",
      "chain": [
        "30309",
        "20366",
        "11080",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "4346",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، عن سنين أبي جميلة، قال أخبرنا ونحن، مع ابن المسيب قال وزعم أبو جميلة أنه أدرك النبي صلى الله عليه وسلم، وخرج معه عام الفتح‏.‏",
      "text_en": " Narrated Az-Zuhri:                     While we were in the company of the Ibn Al-Musaiyab, Sunain Abi Jamila informed us (a Hadith), Abu Jamila said that he lived during the lifetime of the Prophet and that he had accompanied him ( to Mecca) during the year of the Conquest (of Mecca).",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013"
      ]
    },
    {
      "hadith_no": "4410",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، حدثنا هشام بن يوسف، أن ابن جريج، أخبرهم عن ابن أبي مليكة، أن عبد الله بن الزبير، أخبرهم أنه، قدم ركب من بني تميم على النبي صلى الله عليه وسلم فقال أبو بكر أمر القعقاع بن معبد بن زرارة‏.‏ قال عمر بل أمر الأقرع بن حابس‏.‏ قال أبو بكر ما أردت إلا خلافي‏.‏ قال عمر ما أردت خلافك‏.‏ فتماريا حتى ارتفعت أصواتهما فنزل في ذلك ‏{‏يا أيها الذين آمنوا لا تقدموا‏}‏ حتى انقضت‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     `Abdullah bin Az-Zubair said that a group of riders belonging to Banu Tamim came to the Prophet, Abu Bakr said (to the Prophet ), \"Appoint Al-Qa'qa bin Mabad bin Zurara as (their) ruler.\" `Umar said (to the Prophet). \"No! But appoint Al-Aqra bin H`Abis.\" Thereupon Abu Bakr said (to `Umar). \"You just wanted to oppose me.\" `Umar replied. \"I did not want to oppose you.\" So both of them argued so much that their voices became louder, and then the following Divine Verses were revealed in that connection:-- \"O you who believe ! Do not be forward in the presence of Allah and His Apostle...\" (till the end of Verse)...(49.1)",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11090",
        "106"
      ]
    },
    {
      "hadith_no": "4566",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن ابن جريج، قال سمعت ابن أبي مليكة، يقول قال ابن عباس  رضى الله عنهما  ‏{‏حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا‏}‏ خفيفة، ذهب بها هناك، وتلا ‏{‏حتى يقول الرسول والذين آمنوا معه متى نصر الله ألا إن نصر الله قريب‏}‏      فلقيت عروة بن الزبير فذكرت له ذلك فقال قالت عائشة معاذ الله، والله ما وعد الله رسوله من شىء قط إلا علم أنه كائن قبل أن يموت، ولكن لم يزل البلاء بالرسل حتى خافوا أن يكون من معهم يكذبونهم، فكانت تقرؤها ‏{‏وظنوا أنهم قد كذبوا‏}‏ مثقلة‏.‏",
      "text_en": " Narrated Ibn Abu Mulaika:                     Ibn `Abbas recited: \"(Respite will be granted) until when the Apostles gave up hope (of their people) and thought that they were denied (by their people). There came to them Our Help ....\" (12.110) reading Kudhibu without doubling the sound 'dh', and that was what he understood of the Verse. Then he went on reciting: \"..even the Apostle and those who believed along with him said: When (will come) Allah's Help? Yes, verily, Allah's Help is near.\" (2.214) Then I met `Urwa bin Az-Zubair and I mentioned that to him. He said, \"Aisha said, 'Allah forbid! By Allah, Allah never promised His Apostle anything but he knew that it would certainly happen before he died. But trials were continuously presented before the Apostles till they were afraid that their followers would accuse them of telling lies. So I used to recite:-- \"Till they (come to) think that they were treated as liars.\" reading 'Kudh-dhibu with double 'dh.'",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "4595",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن موسى، عن هشام، عن معمر،‏.‏ وحدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة، قال حدثني ابن عباس، قال حدثني أبو سفيان، من فيه إلى في قال انطلقت في المدة التي كانت بيني وبين رسول الله صلى الله عليه وسلم  قال  فبينا أنا بالشأم إذ جيء بكتاب من النبي صلى الله عليه وسلم إلى هرقل قال وكان دحية الكلبي جاء به فدفعه إلى عظيم بصرى، فدفعه عظيم بصرى إلى  هرقل  قال فقال هرقل هل ها هنا أحد من قوم هذا الرجل الذي يزعم أنه نبي فقالوا نعم‏.‏ قال فدعيت في نفر من قريش فدخلنا على هرقل، فأجلسنا بين يديه فقال أيكم أقرب نسبا من هذا الرجل الذي يزعم أنه نبي فقال أبو سفيان فقلت أنا‏.‏ فأجلسوني بين يديه، وأجلسوا أصحابي خلفي، ثم دعا بترجمانه فقال قل لهم إني سائل هذا عن هذا الرجل الذي يزعم أنه نبي، فإن كذبني فكذبوه‏.‏ قال أبو سفيان وايم الله، لولا أن يؤثروا على الكذب لكذبت‏.‏ ثم قال لترجمانه سله كيف حسبه فيكم قال قلت هو فينا ذو حسب‏.‏ قال فهل كان من آبائه ملك قال قلت لا‏.‏ قال فهل كنتم تتهمونه بالكذب قبل أن يقول ما قال قلت لا‏.‏ قال أيتبعه أشراف الناس أم ضعفاؤهم قال قلت بل ضعفاؤهم‏.‏ قال يزيدون أو ينقصون قال قلت لا بل يزيدون‏.‏ قال هل يرتد أحد منهم عن دينه، بعد أن يدخل فيه، سخطة له قال قلت لا‏.‏ قال فهل قاتلتموه قال قلت نعم‏.‏ قال فكيف كان قتالكم إياه قال قلت تكون الحرب بيننا وبينه سجالا، يصيب منا ونصيب منه‏.‏ قال فهل يغدر قال قلت لا ونحن منه في هذه المدة لا ندري ما هو صانع فيها‏.‏ قال والله ما أمكنني من كلمة أدخل فيها شيئا غير هذه‏.‏ قال فهل قال هذا القول أحد قبله قلت لا‏.‏ ثم قال لترجمانه قل له إني سألتك عن حسبه فيكم، فزعمت أنه فيكم ذو حسب، وكذلك الرسل تبعث في أحساب قومها، وسألتك هل كان في آبائه ملك فزعمت أن لا فقلت لو كان من آبائه ملك قلت رجل يطلب ملك آبائه، وسألتك عن أتباعه أضعفاؤهم أم أشرافهم فقلت بل ضعفاؤهم، وهم أتباع الرسل، وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فزعمت أن لا، فعرفت أنه لم يكن ليدع الكذب على الناس ثم يذهب فيكذب على الله، وسألتك هل يرتد أحد منهم عن دينه بعد أن يدخل فيه سخطة له فزعمت أن لا، وكذلك الإيمان إذا خالط بشاشة القلوب، وسألتك هل يزيدون أم ينقصون فزعمت أنهم يزيدون، وكذلك الإيمان حتى يتم، وسألتك هل قاتلتموه فزعمت أنكم قاتلتموه فتكون الحرب بينكم وبينه سجالا، ينال منكم وتنالون منه، وكذلك الرسل تبتلى، ثم تكون لهم العاقبة، وسألتك هل يغدر فزعمت أنه لا يغدر، وكذلك الرسل لا تغدر، وسألتك هل قال أحد هذا القول قبله فزعمت أن لا، فقلت لو كان قال هذا القول أحد قبله قلت رجل ائتم بقول قيل قبله‏.‏ قال ثم قال بم يأمركم قال قلت يأمرنا بالصلاة والزكاة والصلة والعفاف‏.‏ قال إن يك ما تقول فيه حقا فإنه نبي، وقد كنت أعلم أنه خارج، ولم أك أظنه منكم، ولو أني أعلم أني أخلص إليه لأحببت لقاءه، ولو كنت عنده لغسلت عن قدميه، وليبلغن ملكه ما تحت قدمى‏.‏ قال ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرأه، فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم من محمد رسول الله، إلى هرقل عظيم الروم، سلام على من اتبع الهدى، أما بعد، فإني أدعوك بدعاية الإسلام، أسلم تسلم، وأسلم يؤتك الله أجرك مرتين، فإن توليت فإن عليك إثم الأريسيين، و‏{‏يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله‏}‏ إلى قوله ‏{‏اشهدوا بأنا مسلمون‏}‏‏\"‏‏.‏ فلما فرغ من قراءة الكتاب ارتفعت الأصوات عنده، وكثر اللغط، وأمر بنا فأخرجنا قال فقلت لأصحابي حين خرجنا لقد أمر أمر ابن أبي كبشة، أنه ليخافه ملك بني الأصفر فما زلت موقنا بأمر رسول الله صلى الله عليه وسلم أنه سيظهر حتى أدخل الله على الإسلام‏.‏ قال الزهري فدعا هرقل عظماء الروم فجمعهم في دار له فقال يا معشر الروم، هل لكم في الفلاح والرشد آخر الأبد، وأن يثبت لكم ملككم قال فحاصوا حيصة حمر الوحش إلى الأبواب، فوجدوها قد غلقت، فقال على بهم‏.‏ فدعا بهم فقال إني إنما اختبرت شدتكم على دينكم، فقد رأيت منكم الذي أحببت‏.‏ فسجدوا له ورضوا عنه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Sufyan narrated to me personally, saying, \"I set out during the Truce that had been concluded between me and Allah's Apostle. While I was in Sham, a letter sent by the Prophet was brought to Heraclius. Dihya Al-Kalbi had brought and given it to the governor of Busra, and the latter forwarded it to Heraclius. Heraclius said, 'Is there anyone from the people of this man who claims to be a prophet?' The people replied, 'Yes.' So I along with some of Quraishi men were called and we entered upon Heraclius, and we were seated in front of him. Then he said, 'Who amongst you is the nearest relative to the man who claims to be a prophet?' So they made me sit in front of him and made my companions sit behind me. Then he called upon his translator and said (to him). 'Tell them ( i.e. Abu Sufyan's companions) that I am going to ask him (i.e. Abu Sufyan) regarding that man who claims to be a prophet. So, if he tell me a lie, they should contradict him (instantly).' By Allah, had I not been afraid that my companions would consider me a liar, I would have told lies. Heraclius then said to his translator, 'Ask him: What is his (i.e. the Prophet's) family status amongst you? I said, 'He belongs to a noble family amongst us.\" Heraclius said, 'Was any of his ancestors a king?' I said, 'No.' He said, 'Did you ever accuse him of telling lies before his saying what he has said?' I said, 'No.' He said, 'Do the nobles follow him or the poor people?' I said, 'It is the poor who followed him.' He said, 'Is the number of his follower increasing or decreasing?' I said, 'The are increasing.' He said, 'Does anyone renounce his religion (i.e. Islam) after embracing it, being displeased with it?' I said, 'No.' He said, 'Did you fight with him?' I replied, 'Yes.' He said, 'How was your fighting with him?' I said, 'The fighting between us was undecided and victory was shared by him and us by turns. He inflicts casualties upon us and we inflict casualties upon him.' He said, 'Did he ever betray?' I said, 'No, but now we are away from him in this truce and we do not know what he will do in it\" Abu Sufyan added, \"By Allah, I was not able to insert in my speech a word (against him) except that. Heraclius said, 'Did anybody else (amongst you) ever claimed the same (i.e. Islam) before him? I said, 'No.' Then Heraclius told his translator to tell me (i.e. Abu Sufyan), 'I asked you about his family status amongst you, and you told me that he comes from a noble family amongst you Verily, all Apostles come from the noblest family among their people. Then I asked you whether any of his ancestors was a king, and you denied that. Thereupon I thought that had one of his fore-fathers been a king, I would have said that he (i.e. Muhammad) was seeking to rule the kingdom of his fore-fathers. Then I asked you regarding his followers, whether they were the noble or the poor among the people, and you said that they were only the poor (who follow him). In fact, such are the followers of the Apostles. Then I asked you whether you have ever accused him of telling lies before saying what he said, and your reply was in the negative. Therefore, I took for granted that a man who did not tell a lie about others, could ever tell a lie about Allah. Then I asked you whether anyone of his followers had renounced his religion (i.e. Islam) after embracing it, being displeased with it, and you denied that. And such is Faith when it mixes with the cheerfulness of the hearts. Then I asked you whether his followers were increasing or decreasing. You claimed that they were increasing. That is the way of true faith till it is complete. Then I asked you whether you had ever fought with him, and you claimed that you had fought with him and the battle between you and him was undecided and the victory was shared by you and him in turns; he inflicted casual ties upon you and you inflicted casualties upon them. Such is the case with the Apostles; they are out to test and the final victory is for them. Then I asked you whether he had ever betrayed; you claimed that he had never betrayed. I need, Apostles never betray. Then I asked you whether anyone had said this statement before him; and you denied that. Thereupon I thought if somebody had said that statement before him, then I would have said that he was but a man copying some sayings said before him.\" Abu Safyan said, \"Heraclius then asked me, 'What does he order you to do?' I said, 'He orders us (to offer) prayers and (to pay) Zakat and to keep good relationship with the Kith and kin and to be chaste.' Then Heraclius said, 'If whatever you have said, is true, he is really a prophet, and I knew that he ( i.e. the Prophet ) was going to appear, but I never thought that he would be from amongst you. If I were certain that I can reach him, I would like to meet him and if I were with him, I would wash his feet; and his kingdom will expand (surely to what is under my feet.' Then Heraclius asked for the letter of Allah's Apostle and read it wherein was written: \"In the Name of Allah, the Most Beneficent, the Most Merciful. This letter is) from Muhammad, Apostle of Allah, to Heraclius, the sovereign of Byzantine........ Peace be upon him who follows the Right Path. Now then, I call you to embrace Islam. Embrace Islam and you will be saved (from Allah's Punishment); embrace Islam, and Allah will give you a double reward, but if you reject this, you will be responsible for the sins of all the people of your kingdom (Allah's Statement):--\"O the people of the Scripture (Jews and Christians)! Come to a word common to you and us that we worship None but Allah....bear witness that we are Muslims.' (3.64) When he finished reading the letter, voices grew louder near him and there was a great hue and cry, and we were ordered to go out.\" Abu Sufyan added, \"While coming out, I said to my companions, 'The situation of Ibn Abu Kabsha (i.e. Muhammad) has become strong; even the king of Banu Al14 Asfar is afraid of him.' So I continued to believe that Allah's Apostle would be victorious, till Allah made me embrace Islam.\" Az-Zuhri said, \"Heraclius then invited all the chiefs of the Byzantines and had them assembled in his house and said, 'O group of Byzantines! Do you wish to have a permanent success and guidance and that your kingdom should remain with you?' (Immediately after hearing that), they rushed towards the gate like onagers, but they found them closed. Heraclius then said, 'Bring them back to me.' So he called them and said, 'I just wanted to test the strength of your adherence to your religion. Now I have observed of you that which I like.' Then the people fell in prostration before him and became pleased with him.\" (See Hadith No. 6,Vol 1)",
      "chain": [
        "30309",
        "20295",
        "20115",
        "30351",
        "20121",
        "20115",
        "11013",
        "11004",
        "17"
      ]
    }
  ],
  "total_hadiths": 152
}