{
  "id": "30312",
  "name": "Ishaq bin Shahyn al-Wasti إسحاق بن شاهين بن الحارث الواسطي",
  "full_name": "Ishaq bin Shahyn al-Wasti إسحاق بن شاهين بن الحارث الواسطي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  س  -  صدوق ]"
    ],
    "tags": [
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38042",
      "name": "Ahmed bin 'Ali bin Sa'id أحمد بن علي بن سعيد",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "173",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله بن دينار، سمعت أبي، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا رأى كلبا يأكل الثرى من العطش، فأخذ الرجل خفه فجعل يغرف له به حتى أرواه، فشكر الله له فأدخله الجنة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"A man saw a dog eating mud from (the severity of)      thirst. So, that man took a shoe (and filled it) with water and kept      on pouring the water for the dog till it quenched its thirst. So Allah     approved of his deed and made him to enter Paradise.\"",
      "chain": [
        "30312",
        "20250",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "180",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق، قال أخبرنا النضر، قال أخبرنا شعبة، عن الحكم، عن ذكوان أبي صالح، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم أرسل إلى رجل من الأنصار فجاء ورأسه يقطر، فقال النبي صلى الله عليه وسلم ‏\"‏ لعلنا أعجلناك ‏\"‏‏.‏ فقال نعم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أعجلت أو قحطت، فعليك الوضوء ‏\"‏‏.‏ تابعه وهب قال حدثنا شعبة‏.‏ قال أبو عبد الله ولم يقل غندر ويحيى عن شعبة الوضوء‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle sent for a Ansari man who came with water dropping from his head. The Prophet said, \"Perhaps we have forced you to hurry up, haven't we?\" The Ansari replied, \"Yes.\" Allah's Apostle further said, \"If you are forced to hurry up (during intercourse) or you do not discharge then ablution is due on you (This order was canceled later on, i.e. one has to take a bath).",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11069",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "309",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق، قال حدثنا خالد بن عبد الله، عن خالد، عن عكرمة، عن عائشة، أن النبي صلى الله عليه وسلم اعتكف معه بعض نسائه وهى مستحاضة ترى الدم، فربما وضعت الطست تحتها من الدم‏.‏ وزعم أن عائشة رأت ماء العصفر فقالت كأن هذا شىء كانت فلانة تجده‏.‏",
      "text_en": " Narrated `Aisha:                     Once one of the wives of the Prophet did I`tikaf along with him and she was getting bleeding in between her periods. She used to see the blood (from her private parts) and she would perhaps put a dish under her for the blood. (The sub-narrator `Ikrima added, `Aisha once saw the liquid of safflower and said, \"It looks like what so and so used to have.\")",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "369",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا يعقوب بن إبراهيم، قال حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني حميد بن عبد الرحمن بن عوف، أن أبا هريرة، قال بعثني أبو بكر في تلك الحجة في مؤذنين يوم النحر نؤذن بمنى أن لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏ قال حميد بن عبد الرحمن ثم أردف رسول الله صلى الله عليه وسلم عليا، فأمره أن يؤذن ببراءة قال أبو هريرة فأذن معنا علي في أهل منى يوم النحر لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏",
      "text_en": " Narrated Abu Huraira:                     On the Day of Nahr (10th of Dhul-Hijja, in the year prior to the last Hajj of the Prophet when Abu Bakr was the leader of the pilgrims in that Hajj) Abu Bakr sent me along with other announcers to Mina to make a public announcement: \"No pagan is allowed to perform Hajj after this year and no naked person is allowed to perform the Tawaf around the Ka`ba. Then Allah's Apostle sent 'All to read out the Surat Bara'a (at-Tauba) to the people; so he made the announcement along with us on the day of Nahr in Mina: \"No pagan is allowed to perform Hajj after this year and no naked person is allowed to perform the Tawaf around the Ka`ba.\"",
      "chain": [
        "30312",
        "20184",
        "20176",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "482",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا ابن شميل، أخبرنا ابن عون، عن ابن سيرين، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم إحدى صلاتى العشي  قال ابن سيرين سماها أبو هريرة ولكن نسيت أنا  قال فصلى بنا ركعتين ثم سلم، فقام إلى خشبة معروضة في المسجد فاتكأ عليها، كأنه غضبان، ووضع يده اليمنى على اليسرى، وشبك بين أصابعه، ووضع خده الأيمن على ظهر كفه اليسرى، وخرجت السرعان من أبواب المسجد فقالوا قصرت الصلاة‏.‏ وفي القوم أبو بكر وعمر، فهابا أن يكلماه، وفي القوم رجل في يديه طول يقال له ذو اليدين قال يا رسول الله، أنسيت أم قصرت الصلاة قال ‏\"‏ لم أنس، ولم تقصر ‏\"‏‏.‏ فقال ‏\"‏ أكما يقول ذو اليدين ‏\"‏‏.‏ فقالوا نعم‏.‏ فتقدم فصلى ما ترك، ثم سلم، ثم كبر وسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر، ثم كبر وسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر‏.‏ فربما سألوه ثم سلم فيقول نبئت أن عمران بن حصين قال ثم سلم‏.‏",
      "text_en": " Narrates Ibn Seereen:                     Abu Huraira said, \"Allah's Apostle led us in one of the two `Isha' prayers (Abu Huraira named that prayer but I forgot it).\" Abu Huraira added, \"He prayed two rak`at and then finished the prayer with Taslim. He stood up near a piece of wood Lying across the mosque and leaned on it in such a way as if he was angry. Then he put his right hand over the left and clasped his hands by interlacing his fingers and then put his J right cheek on the back of his left hand. The people who were in haste left the mosque through its gates. They wondered whether the prayer was reduced. And amongst them were Abu Bakr and `Umar but they hesitated to ask the Prophet. A long-handed man called Dhul- Yadain asked the Prophet, 'O Allah's Apostle! Have you forgotten or has the prayer been reduced?' The Prophet replied, 'I have neither forgotten nor has the prayer been reduced' The Prophet added, 'Is what Dhul Yadain has said true?' They (the people) said, 'Yes, it is true.' The Prophet stood up again and led the prayer, completing the remaining prayer, forgotten by him, and performed Taslim, and then said, 'Allahu Akbar.' And then he did a prostration as he used to prostrate or longer than that. He then raised his head saying, 'Allahu Akbar; he then again said, 'Allahu Akbar', and prostrated as he used to prostrate or longer than that. Then he raised his head and said, 'Allahu Akbar.' \" (The subnarrator added, \"I think that they asked (Ibn Seereen) whether the Prophet completed the prayer with Taslim. He replied, \"I heard that `Imran bin Husain had said, 'Then he (the Prophet) did Taslim.\")",
      "chain": [
        "30312",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "515",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، قال حدثني ابن أخي ابن شهاب، أنه سأل عمه عن الصلاة، يقطعها شىء فقال لا يقطعها شىء، أخبرني عروة بن الزبير أن عائشة زوج النبي صلى الله عليه وسلم قالت لقد كان رسول الله صلى الله عليه وسلم يقوم فيصلي من الليل، وإني لمعترضة بينه وبين القبلة على فراش أهله‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Allah's Apostle used to get up at night and pray while I used to lie across between him and the Qibla on his family's bed.",
      "chain": [
        "30312",
        "20184",
        "20176",
        "10511"
      ]
    },
    {
      "hadith_no": "624",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن ابن بريدة، عن عبد الله بن مغفل المزني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بين كل أذانين صلاة  ثلاثا  لمن شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal Al-Muzani:                     Allah's Apostle said thrice, \"There is a prayer between the two Adhans (Adhan and Iqama),\" and added, \"For the one who wants to pray.\"",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "640",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال أقيمت الصلاة فسوى الناس صفوفهم، فخرج رسول الله صلى الله عليه وسلم فتقدم وهو جنب ثم قال ‏\"‏ على مكانكم ‏\"‏‏.‏ فرجع فاغتسل ثم خرج ورأسه يقطر ماء فصلى بهم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once Iqama was pronounced and the people had straightened the rows, Allah's Apostle went forward (to lead the prayer) but he was Junub, so he said, \"Remain in your places.\" And he went out, took a bath and returned with water trickling from his head. Then he led the prayer.",
      "chain": [
        "30312",
        "30388",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "727",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، عن إسحاق، عن أنس بن مالك، قال صليت أنا ويتيم، في بيتنا خلف النبي صلى الله عليه وسلم وأمي أم سليم خلفنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     One night an orphan and I offered the prayers behind the Prophet in my house and my mother (Um Sulaim) was standing behind us (by herself forming a row).",
      "chain": [
        "30351",
        "20005",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "737",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد بن عبد الله، عن خالد، عن أبي قلابة، أنه رأى مالك بن الحويرث إذا صلى كبر ورفع يديه، وإذا أراد أن يركع رفع يديه، وإذا رفع رأسه من الركوع رفع يديه، وحدث أن رسول الله صلى الله عليه وسلم صنع هكذا‏.‏",
      "text_en": " Narrated Abu Qilaba:                     I saw Malik bin Huwairith saying Takbir and raising both his hands (on starting the prayers and raising his hands on bowing and also on raising his head after bowing. Malik bin Huwairith said, \"Allah's Apostle did the same.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11047"
      ]
    },
    {
      "hadith_no": "784",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن أبي العلاء، عن مطرف، عن عمران بن حصين، قال صلى مع علي  رضى الله عنه  بالبصرة فقال ذكرنا هذا الرجل صلاة كنا نصليها مع رسول الله صلى الله عليه وسلم‏.‏ فذكر أنه كان يكبر كلما رفع وكلما وضع‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     I offered the prayer with `Ali in Basra and he made us remember the prayer which we used to pray with Allah's Apostle. `Ali said Takbir on each rising and bowing.",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "871",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا ابن عيينة، عن إسحاق، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم في بيت أم سليم، فقمت ويتيم خلفه، وأم سليم خلفنا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet prayed in the house of Um Sulaim; and I, along with an orphan stood behind him while Um Sulaim (stood) behind us.",
      "chain": [
        "20348",
        "20005",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "874",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا ابن عيينة، عن إسحاق، عن أنس، قال صلى النبي صلى الله عليه وسلم في بيت أم سليم، فقمت ويتيم خلفه، وأم سليم خلفنا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet prayed in the house of Um Sulaim; and I, along with an orphan stood behind him while Um Sulaim (stood) behind us.",
      "chain": [
        "20348",
        "20005",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "1011",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق، قال حدثنا وهب، قال أخبرنا شعبة، عن محمد بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم استسقى فقلب رداءه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet turned his cloak inside out on Istisqa.",
      "chain": [
        "30312",
        "20298",
        "20020",
        "11214",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1185",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أنه عقل رسول الله صلى الله عليه وسلم، وعقل مجة مجها في وجهه من بئر كانت في دارهم‏.‏ فزعم محمود أنه سمع عتبان بن مالك الأنصاري   رضى الله عنه  وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم يقول كنت أصلي لقومي ببني سالم، وكان يحول بيني وبينهم واد إذا جاءت الأمطار فيشق على اجتيازه قبل مسجدهم، فجئت رسول الله صلى الله عليه وسلم فقلت له إني أنكرت بصري، وإن الوادي الذي بيني وبين قومي يسيل إذا جاءت الأمطار فيشق على اجتيازه، فوددت أنك تأتي فتصلي من بيتي مكانا أتخذه مصلى‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل ‏\"‏‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر  رضى الله عنه  بعد ما اشتد النهار فاستأذن رسول الله صلى الله عليه وسلم فأذنت له فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت له إلى المكان الذي أحب أن أصلي فيه، فقام رسول الله صلى الله عليه وسلم فكبر وصففنا وراءه، فصلى ركعتين، ثم سلم وسلمنا حين سلم، فحبسته على خزير يصنع له فسمع أهل الدار رسول الله صلى الله عليه وسلم في بيتي فثاب رجال منهم حتى كثر الرجال في البيت‏.‏ فقال رجل منهم ما فعل مالك لا أراه‏.‏ فقال رجل منهم ذاك منافق لا يحب الله ورسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل ذاك ألا تراه قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ فقال الله ورسوله أعلم‏.‏ أما نحن فوالله لا نرى وده ولا حديثه إلا إلى المنافقين‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال محمود فحدثتها قوما فيهم أبو أيوب صاحب رسول الله صلى الله عليه وسلم في غزوته التي توفي فيها ويزيد بن معاوية عليهم بأرض الروم، فأنكرها على أبو أيوب قال والله ما أظن رسول الله صلى الله عليه وسلم قال ما قلت قط‏.‏ فكبر ذلك على فجعلت لله على إن سلمني حتى أقفل من غزوتي أن أسأل عنها عتبان بن مالك  رضى الله عنه  إن وجدته حيا في مسجد قومه، فقفلت فأهللت بحجة أو بعمرة، ثم سرت حتى قدمت المدينة فأتيت بني سالم، فإذا عتبان شيخ أعمى يصلي لقومه فلما سلم من الصلاة سلمت عليه وأخبرته من أنا، ثم سألته عن ذلك الحديث فحدثنيه كما حدثنيه أول مرة‏.‏",
      "text_en": " Narrated Mahmud bin Ar-rabi' Al-Ansari:                     that he remembered Allah's Apostle and he also remembered a mouthful of water which he had thrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard `Itban bin Malik, who was present with Allah's Apostle in the battle of Badr saying, \"I used to lead my people at Bani Salim in the prayer and there was a valley between me and those people. Whenever it rained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Apostle and said, 'I have weak eyesight and the valley between me and my people flows during the rainy season and it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so that I could take that place as a praying place.' Allah's Apostle said, 'I will do so.' So Allah's Apostle and Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Apostle asked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you want us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So Allah's Apostle stood up for the prayer and started the prayer with Takbir and we aligned in rows behind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim with him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a special type of dish prepared from barley flour and meat soup)-- When the neighbors got the news that Allah's Apostle was in my house, they poured it till there were a great number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' One of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's Apostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but Allah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we never saw him but helping and talking with the hypocrites.' Allah's Apostle replied, 'No doubt, whoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of Allah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some people, one of whom was Abu Aiyub, the companion of Allah's Apostle in the battle in which he (Abu Aiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the narration and said, 'I doubt that Allah's Apostle ever said what you have said.' I felt that too much, and I vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin Malik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for Hajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin Malik, who was by then an old blind man, was leading his people in the prayer. When he finished the prayer, I greeted him and introduced myself to him and then asked him about that narration. He told that narration again in the same manner as he had narrated it the first time.\"",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "1657",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني إسحاق الواسطي، حدثنا خالد، عن خالد الحذاء، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم طاف بالبيت، وهو على بعير، كلما أتى على الركن أشار إليه بشىء في يده وكبر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle performed Tawaf (of the Ka`ba) ending a camel (at that time the Prophet had foot injury). Whenever he came to the Corner (having the Black Stone) he would point out towards it with a thing in his hand and say, \"Allahu-Akbar.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1660",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق، حدثنا خالد، عن خالد الحذاء، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم جاء إلى السقاية، فاستسقى، فقال العباس يا فضل اذهب إلى أمك، فأت رسول الله صلى الله عليه وسلم بشراب من عندها‏.‏ فقال ‏\"‏ اسقني ‏\"‏‏.‏ قال يا رسول الله إنهم يجعلون أيديهم فيه‏.‏ قال ‏\"‏ اسقني ‏\"‏‏.‏ فشرب منه، ثم أتى زمزم، وهم يسقون ويعملون فيها، فقال ‏\"‏ اعملوا، فإنكم على عمل صالح  ثم قال  لولا أن تغلبوا لنزلت حتى أضع الحبل على هذه ‏\"‏‏.‏  يعني عاتقه  وأشار إلى عاتقه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle came to the drinking place and asked for water. Al-Abbas said, \"O Fadl! Go to your mother and bring water from her for Allah's Apostle .\" Allah's Apostle said, \"Give me water to drink.\" Al-Abbas said, \"O Allah's Apostle! The people put their hands in it.\" Allah's Apostle again said, 'Give me water to drink. So, he drank from that water and then went to the Zamzam (well) and there the people were offering water to the others and working at it (drawing water from the well). The Prophet then said to them, \"Carry on! You are doing a good deed.\" Then he said, \"Were I not afraid that other people would compete with you (in drawing water from Zamzam), I would certainly take the rope and put it over this (i.e. his shoulder) (to draw water).\" On saying that the Prophet pointed to his shoulder.",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه وأنه يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره أن يحلق وهو بالحديبية، ولم يتبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     (Reporting the speech of Ka`b bin Umra) Allah's Apostle saw him (i.e. Ka`b) while the lice were falling on his face. He asked (him), \"Have your lice troubled you?\" He replied in the affirmative. So, he ordered him to get his head shaved while he was at Al-Hudaibiya. At that time they were not permitted to finish their Ihram, and were still hoping to enter Mecca. So, Allah revealed the verses of Al-Fidya. Allah's Apostle ordered him to feed six poor persons with one Faraq of food or to slaughter one sheep (as a sacrifice) or to fast for three days.",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1914",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو، حدثنا إسحاق، حدثني أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس من بلد إلا سيطؤه الدجال، إلا مكة والمدينة، ليس له من نقابها نقب إلا عليه الملائكة صافين، يحرسونها، ثم ترجف المدينة بأهلها ثلاث رجفات، فيخرج الله كل كافر ومنافق ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, and there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in rows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three earthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"",
      "chain": [
        "30308",
        "20733",
        "20024",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "1955",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن الشيباني، عن عبد الله بن أبي أوفى  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم في سفر، وهو صائم، فلما غربت الشمس قال لبعض القوم ‏\"‏ يا فلان قم، فاجدح لنا ‏\"‏‏.‏ فقال يا رسول الله، لو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال يا رسول الله فلو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال إن عليك نهارا‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ فنزل فجدح لهم، فشرب النبي صلى الله عليه وسلم ثم قال ‏\"‏ إذا رأيتم الليل قد أقبل من ها هنا، فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     We were in the company of the Prophet on a journey and he was fasting, and when the sun set, he addressed somebody, \"O so-and-so, get up and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (Will you wait) till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (If you wait) till it is evening.\" The Prophet said again, \"Get down and mix Sawiq with water for us.\" He replied, \"It is still daytime.\"(1) The Prophet said again, \"Get down and mix Sawiq with water for us.\" He got down and mixed Sawiq for them. The Prophet drank it and then said, \"When you see night falling from this side, the fasting person should break his fast.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "1980",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك على عبد الله بن عمرو فحدثنا أن رسول الله صلى الله عليه وسلم ذكر له صومي فدخل على، فألقيت له وسادة من أدم، حشوها ليف، فجلس على الأرض، وصارت الوسادة بيني وبينه‏.‏ فقال ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏‏.‏ قال قلت يا رسول الله‏.‏ قال ‏\"‏ خمسا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ سبعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ تسعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ لا صوم فوق صوم داود  عليه السلام  شطر الدهر، صم يوما، وأفطر يوما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle was informed about my fasts, and he came to me and I spread for him a leather cushion stuffed with palm fires, but he sat on the ground and the cushion remained between me and him, and then he said, \"Isn't it sufficient for you to fast three days a month?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Five?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Seven?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Nine (days per month)?\" I replied, \"O Allah's Apostle! (I can fast more)\" He said, \"Eleven (days per month)?\" And then the Prophet said, \"There is no fast superior to that of the Prophet David it was for half of the year. So, fast on alternate days.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "2090",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق، حدثنا خالد بن عبد الله، عن خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله حرم مكة، ولم تحل لأحد قبلي، ولا لأحد بعدي، وإنما حلت لي ساعة من نهار، ولا يختلى خلاها، ولا يعضد شجرها، ولا ينفر صيدها ولا يلتقط لقطتها إلا لمعرف ‏\"‏‏.‏ وقال عباس بن عبد المطلب إلا الإذخر لصاغتنا ولسقف بيوتنا‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏ فقال عكرمة هل تدري ما ينفر صيدها هو أن تنحيه من الظل، وتنزل مكانه‏.‏ قال عبد الوهاب عن خالد لصاغتنا وقبورنا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"Allah made Mecca a sanctuary and it was neither permitted for anyone before, nor will it be permitted for anyone after me (to fight in it). And fighting in it was made legal for me for a few hours of a day only. None is allowed to uproot its thorny shrubs or to cut down its trees or to chase its game or to pick up its Luqata (fallen things) except by a person who would announce it publicly.\" `Abbas bin `Abdul-Muttalib requested the Prophet, \"Except Al-Idhkhir, for our goldsmiths and for the roofs of our houses.\" The Prophet said, \"Except Al-Idhkhir.\" `Ikrima said, \"Do you know what is meant by chasing its game? It is to drive it out of the shade and sit in its place.\" Khalid said, \"(`Abbas said: Al-Idhkhir) for our goldsmiths and our graves.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2110",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا شعبة، قال قتادة أخبرني عن صالح أبي الخليل، عن عبد الله بن الحارث، قال سمعت حكيم بن حزام  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يتفرقا، فإن صدقا وبينا بورك لهما في بيعهما، وإن كذبا وكتما محقت بركة بيعهما ‏\"‏‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     The Prophet said, \"The buyer and the seller have the option of canceling or confirming the bargain unless they separate, and if they spoke the truth and made clear the defects of the goods, them they would be blessed in their bargain, and if they told lies and hid some facts, their bargain would be deprived of Allah's blessings.\"",
      "chain": [
        "30312",
        "20218",
        "20020",
        "11019",
        "11291",
        "912",
        "423"
      ]
    },
    {
      "hadith_no": "2114",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني إسحاق، حدثنا حبان، حدثنا همام، حدثنا قتادة، عن أبي الخليل، عن عبد الله بن الحارث، عن حكيم بن حزام  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يتفرقا ‏\"‏  قال همام وجدت في كتابي يختار ثلاث مرار  ‏\"‏فإن صدقا وبينا بورك لهما في بيعهما، وإن كذبا وكتما فعسى أن يربحا ربحا، ويمحقا بركة بيعهما ‏\"‏‏.‏   قال وحدثنا همام، حدثنا أبو التياح، أنه سمع عبد الله بن الحارث، يحدث بهذا الحديث عن حكيم بن حزام، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     The Prophet said, \"Both the buyer and the seller have the option of canceling or confirming the bargain unless they separate.\" The sub-narrator, Hammam said, \"I found this in my book: 'Both the buyer and the seller give the option of either confirming or canceling the bargain three times, and if they speak the truth and mention the defects, then their bargain will be blessed, and if they tell lies and conceal the defects, they might gain some financial gain but they will deprive their sale of (Allah's) blessings.\"",
      "chain": [
        "30312",
        "20218",
        "20297",
        "11019",
        "11291",
        "912",
        "423"
      ]
    },
    {
      "hadith_no": "2212",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني إسحاق، حدثنا ابن نمير، أخبرنا هشام، وحدثني محمد، قال سمعت عثمان بن فرقد، قال سمعت هشام بن عروة، يحدث عن أبيه، أنه سمع عائشة  رضى الله عنها  تقول ‏{‏ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف‏}‏ أنزلت في والي اليتيم الذي يقيم عليه، ويصلح في ماله، إن كان فقيرا أكل منه بالمعروف‏.‏",
      "text_en": " Narrated Hisham bin `Urwa from his father:                     who heard Aisha saying, \"The Holy Verse; 'Whoever amongst the guardians is rich, he should take no wages (from the property of the orphans) but If he is poor, let him have for himself what is just and reasonable (according to his labors)' (4.6) was revealed concerning the guardian of the orphans who looks after them and manages favorably their financial affairs; If the guardian Is poor, he could have from It what Is just and reasonable, (according to his labors).",
      "chain": [
        "30312",
        "30212",
        "20295",
        "20278",
        "20263",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2245",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا إسحاق، حدثنا خالد بن عبد الله، عن الشيباني، عن محمد بن أبي مجالد، بهذا وقال فنسلفهم في الحنطة والشعير‏.‏ وقال عبد الله بن الوليد عن سفيان حدثنا الشيباني وقال والزيت‏.‏ حدثنا قتيبة حدثنا جرير عن الشيباني وقال في الحنطة والشعير والزبيب‏.‏",
      "text_en": " Narrated Muhammad bin Abi Al-Mujalid:                     as above (446) and said, \"We used to pay them in advance for wheat and barley (to be delivered later). Narrated Ash-Shaibani--\"And also for oil.\"Narrated Ash-Shaibani:who said \"We used to pay in advance for wheat barley and dried grapes.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "20012",
        "11352",
        "30367",
        "20028",
        "11352"
      ]
    },
    {
      "hadith_no": "2707",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل سلامى من الناس عليه صدقة، كل يوم تطلع فيه الشمس يعدل بين الناس صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There is a Sadaqa to be given for every joint of the human body; and for every day on which the sun rises there is a reward of a Sadaqa (i.e. charitable gift) for the one who establishes justice among people.\"",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2801",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر الحوضي، حدثنا همام، عن إسحاق، عن أنس  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم أقواما من بني سليم إلى بني عامر في سبعين، فلما قدموا، قال لهم خالي أتقدمكم، فإن أمنوني حتى أبلغهم عن رسول الله صلى الله عليه وسلم وإلا كنتم مني قريبا‏.‏ فتقدم، فأمنوه، فبينما يحدثهم عن النبي صلى الله عليه وسلم إذ أومئوا إلى رجل منهم، فطعنه فأنفذه فقال الله أكبر، فزت ورب الكعبة‏.‏ ثم مالوا على بقية أصحابه فقتلوهم، إلا رجلا أعرج صعد الجبل‏.‏ قال همام فأراه آخر معه، فأخبر جبريل  عليه السلام  النبي صلى الله عليه وسلم أنهم قد لقوا ربهم، فرضي عنهم وأرضاهم، فكنا نقرأ أن بلغوا قومنا أن قد لقينا ربنا فرضي عنا وأرضانا‏.‏ ثم نسخ بعد، فدعا عليهم أربعين صباحا، على رعل وذكوان وبني لحيان وبني عصية الذين عصوا الله ورسوله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet sent seventy men from the tribe of Bani Salim to the tribe of Bani Amir. When they reached there, my maternal uncle said to them, \"I will go ahead of you, and if they allow me to convey the message of Allah's Apostle (it will be all right); otherwise you will remain close to me.\" So he went ahead of them and the pagans granted him security But while he was reporting the message of the Prophet , they beckoned to one of their men who stabbed him to death. My maternal uncle said, \"Allah is Greater! By the Lord of the Ka`ba, I am successful.\" After that they attached the rest of the party and killed them all except a lame man who went up to the top of the mountain. (Hammam, a sub-narrator said, \"I think another man was saved along with him).\" Gabriel informed the Prophet that they (i.e the martyrs) met their Lord, and He was pleased with them and made them pleased. We used to recite, \"Inform our people that we have met our Lord, He is pleased with us and He has made us pleased \" Later on this Qur'anic Verse was cancelled. The Prophet invoked Allah for forty days to curse the murderers from the tribe of Ral, Dhakwan, Bani Lihyan and Bam Usaiya who disobeyed Allah and his Apostle.",
      "chain": [
        "34062",
        "20297",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "2811",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق، أخبرنا محمد بن المبارك، حدثنا يحيى بن حمزة، قال حدثني يزيد بن أبي مريم، أخبرنا عباية بن رافع بن خديج، قال أخبرني أبو عبس، هو عبد الرحمن بن جبر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما اغبرت قدما عبد في سبيل الله فتمسه النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Abs:                     (who is `Abdur-Rahman bin Jabir) Allah's Apostle said,\" Anyone whose both feet get covered with dust in Allah's Cause will not be touched by the (Hell) fire.\"",
      "chain": [
        "30312",
        "30382",
        "20402",
        "11674",
        "11179"
      ]
    },
    {
      "hadith_no": "2989",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل سلامى من الناس عليه صدقة كل يوم تطلع فيه الشمس، يعدل بين الاثنين صدقة، ويعين الرجل على دابته، فيحمل عليها، أو يرفع عليها متاعه صدقة، والكلمة الطيبة صدقة، وكل خطوة يخطوها إلى الصلاة صدقة، ويميط الأذى عن الطريق صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There is a (compulsory) Sadaqa (charity) to be given for every joint of the human body (as a sign of gratitude to Allah) everyday the sun rises. To judge justly between two persons is regarded as Sadaqa, and to help a man concerning his riding animal by helping him to ride it or by lifting his luggage on to it, is also regarded as Sadaqa, and (saying) a good word is also Sadaqa, and every step taken on one's way to offer the compulsory prayer (in the mosque) is also Sadaqa and to remove a harmful thing from the way is also Sadaqa.\"",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3121",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق، سمع جريرا، عن عبد الملك، عن جابر بن سمرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا هلك كسرى فلا كسرى بعده، وإذا هلك قيصر فلا قيصر بعده، والذي نفسي بيده، لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     Allah's Apostle said, \"When Khosrau is ruined, there will be no Khosrau after him; and when Caesar is ruined, their will be no Caesar after him. By Him in Whose Hands my life is, you will spend their treasures in Allah's Cause.\"",
      "chain": [
        "30312",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "3304",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسحاق، أخبرنا روح، أخبرنا ابن جريج، قال أخبرني عطاء، سمع جابر بن عبد الله  رضى الله عنهما  قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان جنح الليل  أو أمسيتم  فكفوا صبيانكم، فإن الشياطين تنتشر حينئذ، فإذا ذهب ساعة من الليل فحلوهم، وأغلقوا الأبواب، واذكروا اسم الله، فإن الشيطان لا يفتح بابا مغلقا ‏\"‏‏.‏ قال وأخبرني عمرو بن دينار سمع جابر بن عبد الله نحو ما أخبرني عطاء ولم يذكر ‏\"‏ واذكروا اسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"When night falls (or it is evening), keep your children close to you for the devils spread out at that time. But when an hour of the night elapses, you can let them free. Close the doors and mention the Name of Allah, for Satan does not open a closed door.\"",
      "chain": [
        "30312",
        "20229",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3448",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، أن سعيد بن المسيب، سمع أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده، ليوشكن أن ينزل فيكم ابن مريم حكما عدلا، فيكسر الصليب، ويقتل الخنزير، ويضع الجزية، ويفيض المال حتى لا يقبله أحد، حتى تكون السجدة الواحدة خيرا من الدنيا وما فيها ‏\"‏‏.‏ ثم يقول أبو هريرة واقرءوا إن شئتم ‏{‏وإن من أهل الكتاب إلا ليؤمنن به قبل موته ويوم القيامة يكون عليهم شهيدا‏}‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"By Him in Whose Hands my soul is, surely (Jesus,) the son of Mary will soon descend amongst you and will judge mankind justly (as a Just Ruler); he will break the Cross and kill the pigs and there will be no Jizya (i.e. taxation taken from non Muslims). Money will be in abundance so that nobody will accept it, and a single prostration to Allah (in prayer) will be better than the whole world and whatever is in it.\" Abu Huraira added \"If you wish, you can recite (this verse of the Holy Book): -- 'And there is none Of the people of the Scriptures (Jews and Christians) But must believe in him (i.e Jesus as an Apostle of Allah and a human being) Before his death. And on the Day of Judgment He will be a witness Against them.\" (4.159) (See Fath-ul-Bari, Page 302 Vol 7)",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11176",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3580",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إسحاق، أخبرنا الفضل بن موسى، عن الجعيد بن عبد الرحمن، رأيت السائب بن يزيد ابن أربع وتسعين جلدا معتدلا فقال قد علمت ما متعت به سمعي وبصري إلا بدعاء رسول الله صلى الله عليه وسلم، إن خالتي ذهبت بي إليه فقالت يا رسول الله إن ابن أختي شاك فادع الله‏.‏ قال فدعا لي‏.‏",
      "text_en": " Narrated Al-Ju'aid bin `Abdur Rahman:                     I saw As-Sa'ib bin Yazid when he was ninety-four years old, quite strong and of straight figure. He said, \"I know that I enjoyed my hearing and seeing powers only because of the invocation of Allah's Apostle . My aunt took me to him and said, 'O Allah's Apostle! My nephew is sick; will you invoke Allah for him?' So he invoked (Allah) for me.\"",
      "chain": [
        "30312",
        "20452"
      ]
    },
    {
      "hadith_no": "3693",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إسحاق، حدثنا النضر، أخبرنا شعبة، عن أبي جمرة، سمعت زهدم بن مضرب، سمعت عمران بن حصين  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي قرني ثم الذين يلونهم ثم الذين يلونهم ‏\"‏‏.‏ قال عمران فلا أدري أذكر بعد قرنه قرنين أو ثلاثا ‏\"‏ ثم إن بعدكم قوما يشهدون ولا يستشهدون، ويخونون ولا يؤتمنون، وينذرون ولا يفون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     \"Allah's Apostle said, 'The best of my followers are those living in my generation (i.e. my contemporaries). and then those who will follow the latter\" `Imran added, \"I do not remember whether he mentioned two or three generations after his generation, then the Prophet added, 'There will come after you, people who will bear witness without being asked to do so, and will be treacherous and untrustworthy, and they will vow and never fulfill their vows, and fatness will appear among them.\"",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "3870",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن بيان، عن قيس، قال سمعته يقول قال جرير بن عبد الله  رضى الله عنه ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا ضحك‏.‏",
      "text_en": "     Narrated Jarir bin 'Abdullah:                          Allah's Apostle has never refused to admit me since I embraced Islam, and whenever he saw me, he would smile.",
      "chain": [
        "30312",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "3906",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسحاق، أخبرنا أبو أسامة، حدثنا هاشم، قال سمعت سعيد بن المسيب، قال سمعت أبا إسحاق، سعد بن أبي وقاص يقول ما أسلم أحد إلا في اليوم الذي أسلمت فيه، ولقد مكثت سبعة أيام وإني لثلث الإسلام",
      "text_en": " Narrated Abu 'Is-haq Saud bin Abi Waqqas:                     None embraced Islam, except on the day I embraced it. And for seven days I was one of the three persons who were Muslims (one-third of Islam).",
      "chain": [
        "30312",
        "20318",
        "11002"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الزهري، عن عطاء بن يزيد، عن عبيد الله بن عدي، عن المقداد بن الأسود، حدثني إسحاق، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو الكندي، وكان حليفا لبني زهرة، وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أنه قال لرسول الله صلى الله عليه وسلم أرأيت إن لقيت رجلا من الكفار فاقتتلنا، فضرب إحدى يدى بالسيف فقطعها، ثم لاذ مني بشجرة فقال أسلمت لله‏.‏ آأقتله يا رسول الله بعد أن قالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏‏.‏ فقال يا رسول الله، إنه قطع إحدى يدى، ثم قال ذلك بعد ما قطعها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله، فإن قتلته فإنه بمنزلتك قبل أن تقتله، وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miqdad bin `Amr Al-Kindi, who was an ally of Bani Zuhra and one of those who fought the battle of Badr together with Allah's Apostle told him that he said to Allah's Apostle, \"Suppose I met one of the infidels and we fought, and he struck one of my hands with his sword and cut it off and then took refuge in a tree and said, \"I surrender to Allah (i.e. I have become a Muslim),' could I kill him, O Allah's Apostle, after he had said this?\" Allah's Apostle said, \"You should not kill him.\" Al- Miqdad said, \"O Allah's Apostle! But he had cut off one of my two hands, and then he had uttered those words?\" Allah's Apostle replied, \"You should not kill him, for if you kill him, he would be in your position where you had been before killing him, and you would be in his position where he had been before uttering those words.\"",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11206",
        "163",
        "30312",
        "20184",
        "20176",
        "11206",
        "880"
      ]
    },
    {
      "hadith_no": "4222",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا يحيى بن صالح، قال حدثنا معاوية  هو ابن سلام  عن يحيى، عن أبي قلابة، أن ثابت بن الضحاك، أخبره أنه، بايع النبي صلى الله عليه وسلم تحت الشجرة‏.‏",
      "text_en": " Narrated Abu Qilaba:                     that Thabit bin Ad-Dahhak had informed him that he was one of those who had given the Pledge of allegiance (of Al-Hudaibiya) beneath the Tree.",
      "chain": [
        "30312",
        "20470",
        "20401",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "4333",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، قال حدثني أبي، حدثنا أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم لما قدم مكة أبى أن يدخل البيت وفيه الآلهة، فأمر بها فأخرجت، فأخرج صورة إبراهيم، وإسماعيل في أيديهما من الأزلام، فقال النبي صلى الله عليه وسلم ‏\"‏ قاتلهم الله لقد علموا ما استقسما بها قط ‏\"‏‏.‏ ثم دخل البيت، فكبر في نواحي البيت، وخرج ولم يصل فيه‏.‏ تابعه معمر عن أيوب‏.‏ وقال وهيب حدثنا أيوب عن عكرمة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle arrived in Mecca, he refused to enter the Ka`ba while there were idols in it. So he ordered that they be taken out. The pictures of the (Prophets) Abraham and Ishmael, holding arrows of divination in their hands, were carried out. The Prophet said, \"May Allah ruin them (i.e. the infidels) for they knew very well that they (i.e. Abraham and Ishmael) never drew lots by these (divination arrows). Then the Prophet entered the Ka`ba and said. \"Allahu Akbar\" in all its directions and came out and not offer any prayer therein.",
      "chain": [
        "30312",
        "20250",
        "20258",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4358",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني حسن بن مسلم، عن مجاهد، أن رسول الله قام يوم الفتح فقال ‏\"‏ إن الله حرم مكة يوم خلق السموات والأرض، فهى حرام بحرام الله إلى يوم القيامة، لم تحل لأحد قبلي، ولا تحل لأحد بعدي، ولم تحلل لي إلا ساعة من الدهر، لا ينفر صيدها، ولا يعضد شوكها، ولا يختلى خلاها ولا تحل لقطتها إلا لمنشد ‏\"‏‏.‏ فقال العباس بن عبد المطلب إلا الإذخر يا رسول الله، فإنه لا بد منه للقين والبيوت، فسكت ثم قال ‏\"‏ إلا الإذخر فإنه حلال ‏\"‏‏.‏ وعن ابن جريج أخبرني عبد الكريم عن عكرمة عن ابن عباس بمثل هذا أو نحو هذا‏.‏ رواه أبو هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mujahid:                     Allah's Apostle got up on the day of the Conquest of Mecca and said, \"Allah has made Mecca a sanctuary since the day He created the Heavens and the Earth, and it will remain a sanctuary by virtue of the sanctity Allah has bestowed on it till the Day of Resurrection. It (i.e. fighting in it) was not made lawful to anyone before me!, nor will it be made lawful to anyone after me, and it was not made lawful for me except for a short period of time. Its game should not be chased, nor should its trees be cut, nor its vegetation or grass uprooted, not its Luqata (i.e. Most things) picked up except by one who makes a public announcement about it.\" Al-Abbas bin `Abdul Muttalib said, \"Except the Idhkhir, O Allah's Apostle, as it is indispensable for blacksmiths and houses.\" On that, the Prophet kept quiet and then said, \"Except the Idhkhir as it is lawful to cut.\"",
      "chain": [
        "30312",
        "20241",
        "11070",
        "11028"
      ]
    },
    {
      "hadith_no": "4386",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا خالد، عن الشيباني، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى الأشعري  رضى الله عنه  أن النبي صلى الله عليه وسلم بعثه إلى اليمن، فسأله عن أشربة تصنع بها، فقال ‏\"‏ وما هي ‏\"‏‏.‏ قال البتع والمزر‏.‏ فقلت لأبي بردة ما البتع قال نبيذ العسل، والمزر نبيذ الشعير‏.‏ فقال ‏\"‏ كل مسكر حرام ‏\"‏‏.‏ رواه جرير وعبد الواحد عن الشيباني عن أبي بردة‏.‏",
      "text_en": " Narrated Abi Burda:                     That Abu Musa Al-Ash`ari said that the Prophet had sent him to Yemen and he asked the Prophet about certain (alcoholic) drink which used to be prepared there The Prophet said, \"What are they?\" Abu Musa said, \"Al-Bit' and Al-Mizr?\" He said, \"Al-Bit is an alcoholic drink made from honey; and Al-Mizr is an alcoholic drink made from barley.\" The Prophet said, \"All intoxicants are prohibited.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4401",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، أخبرنا خالد بن عبد الله، عن خالد الحذاء، عن أبي عثمان، أن رسول الله صلى الله عليه وسلم بعث عمرو بن العاص على جيش ذات السلاسل قال فأتيته فقلت أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏‏.‏ قلت من الرجال قال ‏\"‏ أبوها ‏\"‏‏.‏ قلت ثم من قال ‏\"‏ عمر ‏\"‏‏.‏ فعد رجالا فسكت مخافة أن يجعلني في آخرهم‏.‏",
      "text_en": " Narrated Abu `Uthman:                     Allah's Apostle sent `Amr bin Al As as the commander of the troops of Dhat-us-Salasil. `Amr bin Al- `As said, \"(On my return) I came to the Prophet and said, 'Which people do you love most?' He replied, `Aisha.' I said, 'From amongst the men?' He replied, 'Her father (Abu Bakr)'. I said, 'Whom (do you love) next?' He replied, \"`Umar.' Then he counted the names of many men, and I became silent for fear that he might regard me as the last of them.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11113"
      ]
    },
    {
      "hadith_no": "4557",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، أخبرنا النضر، حدثنا شعبة، عن سليمان، قال سمعت أبا وائل، عن حذيفة، ‏{‏وأنفقوا في سبيل الله ولا تلقوا بأيديكم إلى التهلكة‏}‏ قال نزلت في النفقة‏.‏",
      "text_en": " Narrated Abu Wail:                     Hudhaifa said, \"The Verse:-- \"And spend (of your wealth) in the Cause of Allah and do not throw yourselves in destruction,\" (2.195) was revealed concerning spending in Allah's Cause (i.e. Jihad).",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "4568",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، أخبرنا النضر بن شميل، أخبرنا ابن عون، عن نافع، قال كان ابن عمر  رضى الله عنهما  إذا قرأ القرآن لم يتكلم حتى يفرغ منه، فأخذت عليه يوما، فقرأ سورة البقرة حتى انتهى إلى مكان قال تدري فيما أنزلت‏.‏ قلت لا‏.‏ قال أنزلت في كذا وكذا‏.‏ ثم مضى‏.‏       وعن عبد الصمد، حدثني أبي، حدثني أيوب، عن نافع، عن ابن عمر، ‏{‏فأتوا حرثكم أنى شئتم‏}‏ قال يأتيها في‏.‏ رواه محمد بن يحيى بن سعيد عن أبيه عن عبيد الله عن نافع عن ابن عمر‏.‏",
      "text_en": " Narrated Nafi`:                     Whenever Ibn `Umar recited the Qur'an, he would not speak to anyone till he had finished his recitation. Once I held the Qur'an and he recited Surat-al-Baqara from his memory and then stopped at a certain Verse and said, \"Do you know in what connection this Verse was revealed? \" I replied, \"No.\" He said, \"It was revealed in such-and-such connection.\" Ibn `Umar then resumed his recitation. Nafi` added regarding the Verse:--\"So go to your tilth when or how you will\" Ibn `Umar said, \"It means one should approach his wife in ..\"",
      "chain": [
        "30312",
        "20291",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4573",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ قال كانت هذه العدة تعتد عند أهل زوجها واجب، فأنزل الله ‏{‏والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج فإن خرجن فلا جناح عليكم فيما فعلن في أنفسهن من معروف‏}‏ قال جعل الله لها تمام السنة سبعة أشهر وعشرين ليلة وصية، إن شاءت سكنت في وصيتها، وإن شاءت خرجت، وهو قول الله تعالى ‏{‏غير إخراج فإن خرجن فلا جناح عليكم‏}‏ فالعدة كما هي واجب عليها‏.‏ زعم ذلك عن مجاهد‏.‏ وقال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهلها، فتعتد حيث شاءت، وهو قول الله تعالى ‏{‏غير إخراج‏}‏‏.‏ قال عطاء إن شاءت اعتدت عند أهله وسكنت في وصيتها، وإن شاءت خرجت لقول الله تعالى ‏{‏فلا جناح عليكم فيما فعلن‏}‏‏.‏ قال عطاء ثم جاء الميراث فنسخ السكنى فتعتد حيث شاءت، ولا سكنى لها‏.‏ وعن محمد بن يوسف حدثنا ورقاء عن ابن أبي نجيح عن مجاهد بهذا‏.‏ وعن ابن أبي نجيح عن عطاء عن ابن عباس قال نسخت هذه الآية عدتها في أهلها، فتعتد حيث شاءت لقول الله ‏{‏غير إخراج‏}‏ نحوه‏.‏",
      "text_en": " Narrated Mujahi:                     (regarding the Verse):-- \"Those of you who die and leave wives behind. They - (their wives) -- shall wait (as regards their marriage ) for four months and ten days).\" (2.234) The widow, according to this Verse, was to spend this period of waiting with her husband's family, so Allah revealed: \"Those of you who die and leave wives (i.e. widows) should bequeath for their wives, a year's maintenance and residences without turning them out, but if they leave (their residence), there is no blame on you for what they do with themselves provided it is honorable.' (i.e. lawful marriage) (2.240). So Allah entitled the widow to be bequeathed extra maintenance for seven months and twenty nights, and that is the completion of one year. If she wished she could stay (in her husband's home) according to the will, and she could leave it if she wished, as Allah says: \"..without turning them out, but if they leave (the residence), there is no blame on you.\" So the 'Idda (i.e. four months and ten days as it) is obligatory for her. 'Ata said: Ibn `Abbas said, \"This Verse, i.e. the Statement of Allah: \"..without turning them out..\" cancelled the obligation of staying for the waiting period in her dead husband's house, and she can complete this period wherever she likes.\" 'Ata's aid: If she wished, she could complete her 'Idda by staying in her dead husband's residence according to the will or leave it according to Allah's Statement:-- \"There is no blame on you for what they do with themselves.\" `Ata' added: Later the regulations of inheritance came and abrogated the order of the dwelling of the widow (in her dead husband's house), so she could complete the 'Idda wherever she likes. And it was no longer necessary to provide her with a residence. Ibn `Abbas said, \"This Verse abrogated her (i.e. widow's) dwelling in her dead husband's house and she could complete the 'Idda (i.e. four months and ten days) wherever she liked, as Allah's Statement says:--\"...without turning them out...\"",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254"
      ]
    },
    {
      "hadith_no": "4588",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا روح، أخبرنا شعبة، عن خالد الحذاء، عن مروان الأصفر، عن رجل، من أصحاب رسول الله صلى الله عليه وسلم  قال أحسبه ابن عمر  ‏{‏إن تبدوا ما في أنفسكم أو تخفوه‏}‏ قال نسختها الآية التي بعدها‏.‏",
      "text_en": " Narrated Marwan Al-Asghar:                     A man from the companions of Allah's Apostle who I think, was Ibn `Umar said, \"The Verse:-- \"Whether you show what is in your minds or conceal it....\" was abrogated by the Verse following it.\"",
      "chain": [
        "30312",
        "20229",
        "20020",
        "11282",
        "11611"
      ]
    },
    {
      "hadith_no": "4618",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا عبد الله بن نمير، حدثنا هشام، عن أبيه، عن عائشة  رضى الله عنها  في قوله تعالى ‏{‏ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف‏}‏ أنها نزلت في مال اليتيم إذا كان فقيرا، أنه يأكل منه مكان قيامه عليه، بمعروف‏.‏",
      "text_en": " Narrated Aisha:                     regarding the Statement of Allah: \"And whoever amongst the guardian is rich, he should take no wages, but if he is poor, let him have for himself what is just and reasonable (according to his work). This Verse was revealed regarding the orphan's property. If the guardian is poor, he can take from the property of the orphan, what is just and reasonable according to his work and the time he spends on managing it.",
      "chain": [
        "30312",
        "20331",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4681",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت ورآها الناس آمنوا أجمعون، وذلك حين لا ينفع نفسا إيمانها ‏\"‏‏.‏ ثم قرأ الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The hour will not be established till the sun rises from the West; and when it rises (from the West) and the people see it, they all will believe. And that is (the time) when no good will it do to a soul to believe then.\" Then he recited the whole Verse (6.158)",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4686",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ قيل لبني إسرائيل ‏{‏ادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم‏}‏ فبدلوا فدخلوا يزحفون على أستاههم وقالوا حبة في شعرة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"It was said to the children of Israel, 'Enter the gate in prostration and say Hitatun. (7.161) We shall forgive you, your faults.' But they changed (Allah's Order) and entered, dragging themselves on their buttocks and said, 'Habatun (a grain) in a Sha'ratin (hair).",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    }
  ],
  "total_hadiths": 214
}