{
  "id": "30316",
  "name": "Bashr bin al-Hakam bin Habib بشر بن الحكم بن حبيب",
  "full_name": "Bashr bin al-Hakam bin Habib بشر بن الحكم بن حبيب",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "238",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Nisapuri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "23027",
      "name": "'Abdullah bin Raja' al-Makki عبد الله بن رجاء المكي أبو عمران",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20251",
      "name": "'Abdul 'Aziz bin 'Abdul Samad عبد العزيز بن عبد الصمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25293",
      "name": "Mhbwb bin Mhrz al-Tmymy محبوب بن محرز التميمي القواريري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25262",
      "name": "Muhammad bin Rabi'ya al-Klaby محمد بن ربيعة الكلابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1161",
      "hadith_no": "1161",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا بشر بن الحكم، حدثنا سفيان، قال حدثني سالم أبو النضر، عن أبي سلمة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان إذا صلى ‏{‏سنة الفجر‏}‏ فإن كنت مستيقظة حدثني وإلا اضطجع حتى يؤذن بالصلاة‏.‏",
      "text_en": " Narrated `Aisha:                     After offering the Sunna of the Fajr prayer, the Prophet used to talk to me, if I happen to be awake; otherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).",
      "usc_msa_ref": "258",
      "chain": [
        "30316",
        "20005",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1301",
      "hadith_no": "1301",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا بشر بن الحكم، حدثنا سفيان بن عيينة، أخبرنا إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك  رضى الله عنه  يقول اشتكى ابن لأبي طلحة  قال  فمات وأبو طلحة خارج، فلما رأت امرأته أنه قد مات هيأت شيئا ونحته في جانب البيت، فلما جاء أبو طلحة قال كيف الغلام قالت قد هدأت نفسه، وأرجو أن يكون قد استراح‏.‏ وظن أبو طلحة أنها صادقة، قال فبات، فلما أصبح اغتسل، فلما أراد أن يخرج، أعلمته أنه قد مات، فصلى مع النبي صلى الله عليه وسلم ثم أخبر النبي صلى الله عليه وسلم بما كان منهما، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لعل الله أن يبارك لكما في ليلتكما ‏\"‏‏.‏ قال سفيان فقال رجل من الأنصار فرأيت لهما تسعة أولاد كلهم قد قرأ القرآن‏.‏",
      "text_en": " Narrated Anas bin Malik:                     One of the sons of Abu Talha became sick and died and Abu Talha at that time was not at home. When his wife saw that he was dead, she prepared him (washed and shrouded him) and placed him somewhere in the house. When Abu Talha came, he asked, \"How is the boy?\" She said, \"The child is quiet and I hope he is in peace.\" Abu Talha thought that she had spoken the truth. Abu Talha passed the night and in the morning took a bath and when he intended to go out, she told him that his son had died, Abu Talha offered the (morning) prayer with the Prophet and informed the Prophet of what happened to them. Allah's Apostle said, \"May Allah bless you concerning your night. (That is, may Allah bless you with good offspring).\" Sufyan said, \"One of the Ansar said, 'They (i.e. Abu Talha and his wife) had nine sons and all of them became reciters of the Qur'an (by heart).' \"",
      "usc_msa_ref": "388",
      "chain": [
        "30316",
        "20005",
        "11151",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-37",
      "hadith_no": "37",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني بشر بن الحكم العبدي، قال سمعت سفيان بن عيينة، يقول أخبروني عن أبي عقيل، صاحب بهية أن أبناء، لعبد الله بن عمر سألوه عن شىء لم يكن عنده فيه علم فقال له يحيى بن سعيد والله إني لأعظم أن يكون مثلك وأنت ابن إمامى الهدى - يعني عمر وابن عمر - تسأل عن أمر ليس عندك فيه علم ‏.‏ فقال أعظم من ذلك والله عند الله وعند من عقل عن الله أن أقول بغير علم أو أخبر عن غير ثقة ‏.‏ قال وشهدهما أبو عقيل يحيى بن المتوكل حين قالا ذلك ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20005"
      ]
    },
    {
      "id": "sahih-muslim-101",
      "hadith_no": "101",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني بشر بن الحكم، قال سمعت يحيى بن سعيد القطان، ضعف حكيم بن جبير وعبد الأعلى وضعف يحيى موسى بن دينار قال حديثه ريح ‏.‏ وضعف موسى بن دهقان وعيسى بن أبي عيسى المدني ‏.‏ قال وسمعت الحسن بن عيسى، يقول قال لي ابن المبارك إذا قدمت على جرير فاكتب علمه كله إلا حديث ثلاثة لا تكتب حديث عبيدة بن معتب والسري بن إسماعيل ومحمد بن سالم ‏.‏ قال مسلم وأشباه ما ذكرنا من كلام أهل العلم في متهمي رواة الحديث وإخبارهم عن معايبهم كثير يطول الكتاب بذكره على استقصائه وفيما ذكرنا كفاية لمن تفهم وعقل مذهب القوم فيما قالوا من ذلك وبينوا وإنما ألزموا أنفسهم الكشف عن معايب رواة الحديث وناقلي الأخبار وأفتوا بذلك حين سئلوا لما فيه من عظيم الخطر إذ الأخبار في أمر الدين إنما تأتي بتحليل أو تحريم أو أمر أو نهى أو ترغيب أو ترهيب فإذا كان الراوي لها ليس بمعدن للصدق والأمانة ثم أقدم على الرواية عنه من قد عرفه ولم يبين ما فيه لغيره ممن جهل معرفته كان آثما بفعله ذلك غاشا لعوام المسلمين إذ لا يؤمن على بعض من سمع تلك الأخبار أن يستعملها أو يستعمل بعضها ولعلها أو أكثرها أكاذيب لا أصل لها مع أن الأخبار الصحاح من رواية الثقات وأهل القناعة أكثر من أن يضطر إلى نقل من ليس بثقة ولا مقنع ولا أحسب كثيرا ممن يعرج من الناس على ما وصفنا من هذه الأحاديث الضعاف والأسانيد المجهولة ويعتد بروايتها بعد معرفته بما فيها من التوهن والضعف إلا أن الذي يحمله على روايتها والاعتداد بها إرادة التكثر بذلك عند العوام ولأن يقال ما أكثر ما جمع فلان من الحديث وألف من العدد ‏.‏ ومن ذهب في العلم هذا المذهب وسلك هذا الطريق فلا نصيب له فيه وكان بأن يسمى جاهلا أولى من أن ينسب إلى علم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20031"
      ]
    },
    {
      "id": "sahih-muslim-160",
      "hadith_no": "160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
      "text_en": " It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:                      He relished the flavor of faith (Iman) who became the book of faith pleased with Allah as Lord, with al-Islam as the code of life and with Muhammad as the Messenger (of Allah).",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30316",
        "20167",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "sahih-muslim-485",
      "hadith_no": "485",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "قال وحدثني بشر بن الحكم، - واللفظ له - حدثنا سفيان بن عيينة، حدثنا مطرف، وابن، أبجر سمعا الشعبي، يقول سمعت المغيرة بن شعبة، يخبر به الناس على المنبر قال سفيان رفعه أحدهما - أراه ابن أبجر - قال ‏\"‏ سأل موسى ربه ما أدنى أهل الجنة منزلة قال هو رجل يجيء بعد ما أدخل أهل الجنة الجنة فيقال له ادخل الجنة ‏.‏ فيقول أى رب كيف وقد نزل الناس منازلهم وأخذوا أخذاتهم فيقال له أترضى أن يكون لك مثل ملك ملك من ملوك الدنيا فيقول رضيت رب ‏.‏ فيقول لك ذلك ومثله ومثله ومثله ومثله ‏.‏ فقال في الخامسة رضيت رب ‏.‏ فيقول هذا لك وعشرة أمثاله ولك ما اشتهت نفسك ولذت عينك ‏.‏ فيقول رضيت رب ‏.‏ قال رب فأعلاهم منزلة قال أولئك الذين أردت غرست كرامتهم بيدي وختمت عليها فلم تر عين ولم تسمع أذن ولم يخطر على قلب بشر ‏\"‏ ‏.‏ قال ومصداقه في كتاب الله عز وجل ‏{‏ فلا تعلم نفس ما أخفي لهم من قرة أعين‏}‏ الآية ‏.‏",
      "text_en": " It is reported on the authority of al-Mughira b. Shu'ba that the Messenger of Allah (may peace be upon him) said:                      Moses asked his Lord: Who amongst the inhabitants of Paradise is the lowest to rank? He (Allah) said: The person who would be admitted into Paradise last of all among those deserving of Paradise who are admitted to it. I would be said to him: Enter Paradise. He would gay: O my Lord! how (should I enter) while the people have settled in their apartments and taken the shares (portions)? It would be said to him: Would you be pleased if there be for you like the kingdom of a king amongst the kings of the world? He would say: I am pleased my Lord. He (Allah) would say: For you is that, and like that, and like that, and like that, and that. He would say at the fifth (point): I am well pleased. My Lord. He (Allah) would say: It is for you and, ten times like it, and for you is what your self desires and your eye enjoys. He would say: I am well pleased, my Lord. He (Moses) said: (Which is) the highest of their (inhabitants of Paradise) ranks? He (Allah) said: They are those whom I choose. I establish their honour with My own hand and then set a seal over it (and they would be blessed with Bounties) which no eye has seen, no ear has heard and no human mind has perceived: and this is sub- stantiated by the Book of Allah, Exalted and Great:\" So no soul knows what delight of the eye is hidden for them; a reward for what they did\" (xxxii. 17).",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20005",
        "11395",
        "10792",
        "11052",
        "166",
        "10792"
      ]
    },
    {
      "id": "sahih-muslim-238-2",
      "hadith_no": "238",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز، - يعني الدراوردي - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1883",
      "hadith_no": "1883",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني بشر بن الحكم، حدثنا عبد العزيز بن محمد، حدثنا يزيد، - وهو ابن الهاد - عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated with the same chain of transmitters by Ibn al-Had except this that Abu Huraira reported Allah's Messenger (may peace be upon him) as saying and he did not say:                     \" He heard it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4063",
      "hadith_no": "4063",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا بشر بن الحكم، وإبراهيم بن دينار، وعبد الجبار بن العلاء، - واللفظ لبشر - قالوا حدثنا سفيان بن عيينة، عن حميد الأعرج، عن سليمان بن عتيق، عن جابر، أنوسلم أمر بوضع الجوائح ‏.‏ قال أبو إسحاق - وهو صاحب مسلم - حدثنا عبد الرحمن بن بشر عن سفيان بهذا ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported that Allah's Apostle (may peace be upon him) commanded to make deductions in the payment of that stricken with a Calamity.",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "30496",
        "30419",
        "20005",
        "11856",
        "30356"
      ]
    },
    {
      "id": "sahih-muslim-4496",
      "hadith_no": "4496",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز بن محمد، عن يزيد بن عبد الله، بن الهاد عن أبي بكر بن محمد، عن عمرة، عن عائشة، أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تقطع يد السارق إلا في ربع دينار فصاعدا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that she heard Allah's Apostle (may peace be upon him) as saying:                      The hand of the thief may not be cut off but for a quarter of a dinar and upwards.",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11455",
        "53"
      ]
    }
  ],
  "total_hadiths": 10
}