{
  "id": "30313",
  "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
  "full_name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": [
        "170 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "251",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv",
      " Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  ق  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Maervazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "42",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن منصور، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أحسن أحدكم إسلامه، فكل حسنة يعملها تكتب له بعشر أمثالها إلى سبعمائة ضعف، وكل سيئة يعملها تكتب له بمثلها ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"If any one of you improve (follows strictly)      his Islamic religion then his good deeds will be rewarded ten times to     seven hundred times for each good deed and a bad deed will be recorded     as it is.\"",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "494",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا عبد الله بن نمير، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا خرج يوم العيد أمر بالحربة فتوضع بين يديه، فيصلي إليها والناس وراءه، وكان يفعل ذلك في السفر، فمن ثم اتخذها الأمراء‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Whenever Allah's Apostle came out on `Id day, he used to order that a Harba [??] (a short spear) to be planted in front of him (as a Sutra for his prayer) and then he used to pray facing it with the people behind him and used to do the same while on a journey. After the Prophet , this practice was adopted by the Muslim rulers (who followed his traditions).",
      "chain": [
        "30313",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1115",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن منصور، قال أخبرنا روح بن عبادة، أخبرنا حسين، عن عبد الله بن بريدة، عن عمران بن حصين  رضى الله عنه  أنه سأل نبي الله صلى الله عليه وسلم‏.‏ أخبرنا إسحاق قال أخبرنا عبد الصمد قال سمعت أبي قال حدثنا الحسين عن ابن بريدة قال حدثني عمران بن حصين  وكان مبسورا  قال سألت رسول الله صلى الله عليه وسلم عن صلاة الرجل قاعدا فقال ‏\"‏ إن صلى قائما فهو أفضل، ومن صلى قاعدا فله نصف أجر القائم، ومن صلى نائما فله نصف أجر القاعد ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     (who had piles) I asked Allah's Apostle about the praying of a man while sitting. He said, \"If he prays while standing it is better and he who prays while sitting gets half the reward of that who prays standing; and whoever prays while Lying gets half the reward of that who prays while sitting.\"",
      "chain": [
        "30313",
        "20229",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1139",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق، قال حدثنا عبيد الله، قال أخبرنا إسرائيل، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، قال سألت عائشة  رضى الله عنها  عن صلاة رسول الله صلى الله عليه وسلم بالليل‏.‏ فقالت سبع وتسع وإحدى عشرة سوى ركعتى الفجر‏.‏",
      "text_en": " Narrated Masruq:                     I asked Aisha about the night prayer of Allah's Apostle and she said, \"It was seven, nine or eleven rak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"",
      "chain": [
        "30313",
        "20260",
        "20311",
        "11371",
        "11664",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن نمير، حدثنا إسحاق بن منصور، حدثنا هريم بن سفيان، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated `Abdullah:                     The same as No. 290. from the Prophet.",
      "chain": [
        "30212",
        "30313",
        "20362",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1221",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا روح، حدثنا عمر  هو ابن سعيد  قال أخبرني ابن أبي مليكة، عن عقبة بن الحارث  رضى الله عنه  قال صليت مع النبي صلى الله عليه وسلم العصر، فلما سلم قام سريعا دخل على بعض نسائه، ثم خرج ورأى ما في وجوه القوم من تعجبهم لسرعته فقال ‏\"‏ ذكرت وأنا في الصلاة تبرا عندنا، فكرهت أن يمسي أو يبيت عندنا فأمرت بقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     I offered the `Asr prayer with the Prophet and after finishing the prayer with Taslim he got up quickly and went to some of his wives and then came out. He noticed the signs of astonishment on the faces of the people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of gold was Lying in my house and I disliked that it should remain with us throughout the night, and so I have ordered it to be distributed.\"",
      "chain": [
        "30313",
        "20229",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "1427",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا الجريري، عن أبي العلاء، عن الأحنف بن قيس، قال جلست‏.‏ وحدثني إسحاق بن منصور، أخبرنا عبد الصمد، قال حدثني أبي، حدثنا الجريري، حدثنا أبو العلاء بن الشخير، أن الأحنف بن قيس، حدثهم قال جلست إلى ملإ من قريش، فجاء رجل خشن الشعر والثياب والهيئة حتى قام عليهم فسلم ثم قال بشر الكانزين برضف يحمى عليه في نار جهنم، ثم يوضع على حلمة ثدى أحدهم حتى يخرج من نغض كتفه، ويوضع على نغض كتفه حتى يخرج من حلمة ثديه يتزلزل، ثم ولى فجلس إلى سارية، وتبعته وجلست إليه، وأنا لا أدري من هو فقلت له لا أرى القوم إلا قد كرهوا الذي قلت‏.‏ قال إنهم لا يعقلون شيئا‏.‏ قال لي خليلي  قال قلت من خليلك قال النبي صلى الله عليه وسلم  ‏\"‏ يا أبا ذر أتبصر أحدا ‏\"‏‏.‏ قال فنظرت إلى الشمس ما بقي من النهار وأنا أرى أن رسول الله صلى الله عليه وسلم يرسلني في حاجة له، قلت نعم‏.‏ قال ‏\"‏ ما أحب أن لي مثل أحد ذهبا أنفقه كله إلا ثلاثة دنانير ‏\"‏‏.‏ وإن هؤلاء لا يعقلون، إنما يجمعون الدنيا‏.‏ لا والله لا أسألهم دنيا، ولا أستفتيهم عن دين حتى ألقى الله‏.‏",
      "text_en": " Narrated Al-Ahnaf bin Qais:                     While I was sitting with some people from Quraish, a man with very rough hair, clothes, and appearance came and stood in front of us, greeted us and said, \"Inform those who hoard wealth, that a stone will be heated in the Hell-fire and will be put on the nipples of their breasts till it comes out from the bones of their shoulders and then put on the bones of their shoulders till it comes through the nipples of their breasts the stone will be moving and hitting.\" After saying that, the person retreated and sat by the side of the pillar, I followed him and sat beside him, and I did not know who he was. I said to him, \"I think the people disliked what you had said.\" He said, \"These people do not understand anything, although my friend told me.\" I asked, \"Who is your friend?\" He said, \"The Prophet said (to me), 'O Abu Dhar! Do you see the mountain of Uhud?' And on that I (Abu Dhar) started looking towards the sun to judge how much remained of the day as I thought that Allah's Apostle wanted to send me to do something for him and I said, 'Yes!' He said, 'I do not love to have gold equal to the mountain of Uhud unless I spend it all (in Allah's cause) except three Dinars (pounds). These people do not understand and collect worldly wealth. No, by Allah, Neither I ask them for worldly benefits nor am I in need of their religious advice till I meet Allah, The Honorable, The Majestic.\" '",
      "chain": [
        "30157",
        "20246",
        "11286",
        "11112",
        "30313",
        "20250",
        "20258",
        "11286",
        "11318",
        "11112"
      ]
    },
    {
      "hadith_no": "1713",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا النضر، أخبرنا شعبة، حدثنا أبو جمرة، قال سألت ابن عباس  رضى الله عنهما  عن المتعة، فأمرني بها، وسألته عن الهدى، فقال فيها جزور أو بقرة أو شاة أو شرك في دم قال وكأن ناسا كرهوها، فنمت فرأيت في المنام كأن إنسانا ينادي حج مبرور، ومتعة متقبلة‏.‏ فأتيت ابن عباس  رضى الله عنهما  فحدثته فقال الله أكبر سنة أبي القاسم صلى الله عليه وسلم قال وقال آدم ووهب بن جرير وغندر عن شعبة عمرة متقبلة، وحج مبرور‏.‏",
      "text_en": " Narrated Abu Jamra:                     I asked Ibn `Abbas about Hajj-at-Tamattu`. He ordered me to perform it. I asked him about the Hadi (sacrifice). He said, \"You have to slaughter a camel, a cow or a sheep, or you may share the Hadi with the others.\" It seemed that some people disliked it (Hajj-at-Tamattu`). I slept and dreamt as if a person was announcing: \"Hajj Mabrur and accepted Mut'ah (Hajj-at-Tamattu`)\" I went to Ibn `Abbas and narrated it to him. He said, \"Allah is Greater. (That was) the tradition of Abu Al-Qasim (i.e. Prophet). Narrated Shu`ba that the call in the dream was. \"An accepted `Umra and Hajj-Mabrur. \"",
      "chain": [
        "30313",
        "20291",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1974",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق، أخبرنا هارون بن إسماعيل، حدثنا علي، حدثنا يحيى، قال حدثني أبو سلمة، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال دخل على رسول الله صلى الله عليه وسلم فذكر الحديث يعني ‏\"‏ إن لزورك عليك حقا، وإن لزوجك عليك حقا ‏\"‏‏.‏ فقلت وما صوم داود قال ‏\"‏ نصف الدهر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     \"Once Allah's Apostle came to me,\" and then he narrated the whole narration, i.e. your guest has a right on you, and your wife has a right on you. I then asked about the fasting of David. The Prophet replied, \"Half of the year,\" (i.e. he used to fast on every alternate day).",
      "chain": [
        "30313",
        "20292",
        "20449",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "2312",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا إسحاق، حدثنا يحيى بن صالح، حدثنا معاوية  هو ابن سلام  عن يحيى، قال سمعت عقبة بن عبد الغافر، أنه سمع أبا سعيد الخدري  رضى الله عنه  قال جاء بلال إلى النبي صلى الله عليه وسلم بتمر برني فقال له النبي صلى الله عليه وسلم ‏\"‏ من أين هذا ‏\"‏‏.‏ قال بلال كان عندنا تمر ردي، فبعت منه صاعين بصاع، لنطعم النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم عند ذلك ‏\"‏ أوه أوه عين الربا عين الربا، لا تفعل، ولكن إذا أردت أن تشتري فبع التمر ببيع آخر ثم اشتره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id al-Khudri:                     Once Bilal brought Barni (i.e. a kind of dates) to the Prophet and the Prophet asked him, \"From where have you brought these?\" Bilal replied, \"I had some inferior type of dates and exchanged two Sas of it for one Sa of Barni dates in order to give it to the Prophet; to eat.\" Thereupon the Prophet said, \"Beware! Beware! This is definitely Riba (usury)! This is definitely Riba (Usury)! Don't do so, but if you want to buy (a superior kind of dates) sell the inferior dates for money and then buy the superior kind of dates with that money.\"",
      "chain": [
        "30313",
        "20470",
        "20401",
        "11449",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "2785",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عفان، حدثنا همام، حدثنا محمد بن جحادة، قال أخبرني أبو حصين، أن ذكوان، حدثه أن أبا هريرة  رضى الله عنه  حدثه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال دلني على عمل يعدل الجهاد‏.‏ قال ‏\"‏ لا أجده  قال  هل تستطيع إذا خرج المجاهد أن تدخل مسجدك فتقوم ولا تفتر وتصوم ولا تفطر ‏\"‏‏.‏ قال ومن يستطيع ذلك قال أبو هريرة إن فرس المجاهد ليستن في طوله فيكتب له حسنات‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"Instruct me as to such a deed as equals Jihad (in reward).\" He replied, \"I do not find such a deed.\" Then he added, \"Can you, while the Muslim fighter is in the battle-field, enter your mosque to perform prayers without cease and fast and never break your fast?\" The man said, \"But who can do that?\" Abu- Huraira added, \"The Mujahid (i.e. Muslim fighter) is rewarded even for the footsteps of his horse while it wanders bout (for grazing) tied in a long rope.\"",
      "chain": [
        "30313",
        "30106",
        "20297",
        "18897",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3139",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن محمد بن جبير، عن أبيه  رضى الله عنه  أن النبي صلى الله عليه وسلم قال في أسارى بدر ‏\"‏ لو كان المطعم بن عدي حيا، ثم كلمني في هؤلاء النتنى، لتركتهم له ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     The Prophet talked about war prisoners of Badr saying, \"Had Al-Mut`im bin Adi been alive and interceded with me for these mean people, I would have freed them for his sake.\"",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11013",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "3382",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله، عن أبيه، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف ابن يعقوب بن إسحاق بن إبراهيم  عليهم السلام ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The honorable is the son of the honorable, the son the honorable, i.e. Joseph, the son of Jacob, the son of Isaac, the son of Abraham.",
      "chain": [
        "30313",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أحمد بن سعيد أبو عبد الله، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سمعت البراء، يقول كان رسول الله صلى الله عليه وسلم أحسن الناس وجها وأحسنه خلقا، ليس بالطويل البائن ولا بالقصير‏.‏",
      "text_en": " Narrated Al-Bara:                     Allah's Apostle was the handsomest of all the people, and had the best appearance. He was neither very tall nor short.",
      "chain": [
        "30296",
        "30313",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3940",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني أبو إدريس، عائذ الله أن عبادة بن الصامت  من الذين شهدوا بدرا مع رسول الله صلى الله عليه وسلم  ومن أصحابه ليلة العقبة  أخبره أن رسول الله صلى الله عليه وسلم قال وحوله عصابة من أصحابه ‏\"‏ تعالوا بايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتون ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب به في الدنيا فهو له كفارة، ومن أصاب من ذلك شيئا فستره الله فأمره إلى الله، إن شاء عاقبه، وإن شاء عفا عنه ‏\"‏‏.‏ قال فبايعته على ذلك‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Who had taken part in the battle of Badr with Allah's Apostle and had been amongst his companions on the night of Al-`Aqaba Pledge: Allah's Apostle, surrounded by a group of his companions said, \"Come along and give me the pledge of allegiance that you will not worship anything besides Allah, will not steal, will not commit illegal sexual intercourse will not kill your children, will not utter; slander, invented by yourself, and will not disobey me if I order you to do something good. Whoever among you will respect and fulfill this pledge, will be rewarded by Allah. And if one of you commits any of these sins and is punished in this world then that will be his expiation for it, and if one of you commits any of these sins and Allah screens his sin, then his matter, will rest with Allah: If He will, He will punish him and if He will,. He will excuse him.\" So I gave the pledge of allegiance to him for these conditions.",
      "chain": [
        "30313",
        "20184",
        "20176"
      ]
    },
    {
      "hadith_no": "3980",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث،‏.‏ وحدثنا إسحاق بن منصور، أخبرنا عبد الصمد، قال سمعت أبي يحدث، حدثنا أبو التياح، يزيد بن حميد الضبعي قال حدثني أنس بن مالك  رضى الله عنه  قال لما قدم رسول الله صلى الله عليه وسلم المدينة، نزل في علو المدينة في حى يقال لهم بنو عمرو بن عوف  قال  فأقام فيهم أربع عشرة ليلة، ثم أرسل إلى ملإ بني النجار  قال  فجاءوا متقلدي سيوفهم، قال وكأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته، وأبو بكر ردفه، وملأ بني النجار حوله حتى ألقى بفناء أبي أيوب، قال فكان يصلي حيث أدركته الصلاة، ويصلي في مرابض الغنم، قال ثم إنه أمر ببناء المسجد، فأرسل إلى ملإ بني النجار، فجاءوا فقال ‏\"‏ يا بني النجار، ثامنوني حائطكم هذا ‏\"‏‏.‏ فقالوا لا، والله لا نطلب ثمنه إلا إلى الله‏.‏ قال فكان فيه ما أقول لكم كانت فيه قبور المشركين، وكانت فيه خرب، وكان فيه نخل، فأمر رسول الله صلى الله عليه وسلم بقبور المشركين فنبشت، وبالخرب فسويت، وبالنخل فقطع، قال فصفوا النخل قبلة المسجد  قال  وجعلوا عضادتيه حجارة‏.‏ قال قال جعلوا ينقلون ذاك الصخر وهم يرتجزون، ورسول الله صلى الله عليه وسلم معهم يقولون اللهم إنه لا خير إلا خير الآخره فانصر الأنصار والمهاجره‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle arrived at Medina, he alighted at the upper part of Medina among the people called Bani `Amr bin `Auf and he stayed with them for fourteen nights. Then he sent for the chiefs of Bani An-Najjar, and they came, carrying their swords. As if I am just now looking at Allah's Apostle on his she-camel with Abu Bakr riding behind him (on the same camel) and the chiefs of Bani An- Najjar around him till he dismounted in the courtyard of Abu Aiyub's home. The Prophet used to offer the prayer wherever the prayer was due, and he would pray even in sheepfolds. Then he ordered that the mosque be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said, \"O Banu An-Najjar! Suggest to me the price of this garden of yours.\" They replied \"No! By Allah, we do not demand its price except from Allah.\" In that garden there were the (following) things that I will tell you: Graves of pagans, unleveled land with holes and pits etc., and date-palm trees. Allah's Apostle ordered that the graves of the pagans be dug up and, the unleveled land be leveled and the date-palm trees be cut down. The trunks of the trees were arranged so as to form the wall facing the Qibla. The Stone pillars were built at the sides of its gate. The companions of the Prophet were carrying the stones and reciting some lyrics, and Allah's Apostle . . was with them and they were saying, \"O Allah! There is no good Excel the good of the Hereafter, so bestow victory on the Ansar and the Emigrants. \"",
      "chain": [
        "30175",
        "30313",
        "20250",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4019",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، سأل رجل البراء وأنا أسمع، قال أشهد علي بدرا قال بارز وظاهر‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     A man asked Al-Bara' and I was listening, \"Did `Ali take part in (the battle of) Badr?\" Al-Bara' said, \"(Yes). he even met (his enemies) in a duel and was clad in two armors (one over the other).",
      "chain": [
        "30296",
        "30313",
        "20406",
        "20473",
        "11049"
      ]
    },
    {
      "hadith_no": "4044",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يزيد، أخبرنا يحيى، سمع معاذ بن رفاعة، أن ملكا، سأل النبي صلى الله عليه وسلم‏.‏ وعن يحيى، أن يزيد بن الهاد أخبره أنه كان معه يوم حدثه معاذ هذا الحديث، فقال يزيد فقال معاذ إن السائل هو جبريل عليه السلام‏.‏",
      "text_en": " Narrated Mu`adh:                     The one who asked (the Prophet) was Gabriel (refer to Hadith 5.327).",
      "chain": [
        "30313",
        "20472",
        "20031",
        "11554"
      ]
    },
    {
      "hadith_no": "4072",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن محمد بن جبير، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور، وذلك أول ما وقر الإيمان في قلبي‏.‏",
      "text_en": "      Narrated Jubair bin Mut'im:                          I heard the Prophet reciting Surat-at-Tur in Maghrib prayer, and that      was at a time when belief was first planted in my heart. The Prophet      while speaking about the war prisoners of Badr, said, \"Were Al-Mutim      bin Adi alive and interceded with me for these filthy people, I would      definitely forgive them for his sake.\"",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11013",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "4082",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، أخبرنا جويرية بن أسماء، عن نافع، عن ابن عمر  رضى الله عنهما أن النبي صلى الله عليه وسلم حرق نخل بني النضير قال ولها يقول حسان بن ثابت وهان على سراة بني لؤى حريق بالبويرة مستطير قال فأجابه أبو سفيان بن الحارث أدام الله ذلك من صنيع وحرق في نواحيها السعير ستعلم أينا منها بنزه وتعلم أى أرضينا تضير",
      "text_en": " Narrated Ibn `Umar:                     The Prophet burnt the date-palm trees of Bani An-Nadir. Hassan bin Thabit said the following poetic Verses about this event:-- \"the terrible burning of Al-Buwaira Has been received indifferently By the nobles of Bani Luai (The masters and nobles of Quraish).\" Abu Sufyan bin Al-Harith (i.e. the Prophet's cousin who was still a disbeliever then) replied to Hassan, saying in poetic verses:-- \"May Allah bless that burning And set all its (i.e. Medina's) Parts on burning fire. You will see who is far from it (i.e. Al-Buwaira) And which of our lands will be Harmed by it (i.e. the burning of Al- Buwaira).",
      "chain": [
        "30313",
        "20218",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4841",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الله بن بكر السهمي، حدثنا حميد، عن أنس  رضى الله عنه  قال أولم رسول الله صلى الله عليه وسلم حين بنى بزينب ابنة جحش فأشبع الناس خبزا ولحما ثم خرج إلى حجر أمهات المؤمنين كما كان يصنع صبيحة بنائه فيسلم عليهن ويدعو لهن ويسلمن عليه ويدعون له فلما رجع إلى بيته رأى رجلين جرى بهما الحديث، فلما رآهما رجع عن بيته، فلما رأى الرجلان نبي الله صلى الله عليه وسلم رجع عن بيته وثبا مسرعين، فما أدري أنا أخبرته بخروجهما أم أخبر فرجع حتى دخل البيت، وأرخى الستر بيني وبينه وأنزلت آية الحجاب‏.‏ وقال ابن أبي مريم أخبرنا يحيى حدثني حميد سمع أنسا عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     When Allah's Apostle married Zainab bint Jahsh, he made the people eat meat and bread to their fill (by giving a Walima banquet). Then he went out to the dwelling places of the mothers of the believers (his wives), as he used to do in the morning of his marriage. He would greet them and invoke good on them, and they (too) would return his greeting and invoke good on him. When he returned to his house, he found two men talking to each other; and when he saw them, he went out of his house again. When those two men saw Allah's Apostle: going out of his house, they quickly got up (and departed). I do not remember whether I informed him of their departure, or he was informed (by somebody else). So he returned, and when he entered the house, he lowered the curtain between me and him. Then the Verse of Al-Hijab was revealed.",
      "chain": [
        "30313",
        "20244",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4973",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا عبد الصمد، حدثنا حرب، حدثنا يحيى، قال سألت أبا سلمة أى القرآن أنزل أول فقال ‏{‏يا أيها المدثر‏}‏ فقلت أنبئت أنه ‏{‏اقرأ باسم ربك الذي خلق‏}‏ فقال أبو سلمة سألت جابر بن عبد الله أى القرآن أنزل أول فقال ‏{‏يا أيها المدثر‏}‏ فقلت أنبئت أنه ‏{‏اقرأ باسم ربك‏}‏ فقال لا أخبرك إلا بما قال رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم ‏\"‏ جاورت في حراء فلما قضيت جواري، هبطت فاستبطنت الوادي فنوديت، فنظرت أمامي وخلفي وعن يميني وعن شمالي فإذا هو جالس على عرش بين السماء والأرض، فأتيت خديجة فقلت دثروني وصبوا على ماء باردا، وأنزل على ‏{‏يا أيها المدثر * قم فأنذر * وربك فكبر‏}‏‏\"‏",
      "text_en": " Narrated Yahya:                     I asked Aba Salama, \"Which Sura of the Qur'an was revealed first?\" He replied, \"O you, wrapped-up' (Al-Muddaththir).\" I said, \"I have been informed that it was, 'Read, in the Name of your Lord who created........ (i.e. Surat Al-Alaq).",
      "chain": [
        "30313",
        "20250",
        "20220",
        "11449"
      ]
    },
    {
      "hadith_no": "5027",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن منصور، قال وحدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله كذبني ابن آدم ولم يكن له ذلك، وشتمني ولم يكن له ذلك، أما تكذيبه إياى أن يقول إني لن أعيده كما بدأته، وأما شتمه إياى أن يقول اتخذ الله ولدا، وأنا الصمد الذي لم ألد ولم أولد ولم يكن لي كفؤا أحد ‏\"‏‏.‏ ‏{‏لم يلد ولم يولد * ولم يكن له كفؤا أحد‏}‏ كفؤا وكفيئا وكفاء واحد‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah said:-- 'The son of Adam tells a lie against Me and he hasn't the right to do so; and he abuses me and he hasn't the right to do so. His telling a lie against Me is his saying that I will not recreate him as I created him for the first time; and his abusing Me is his saying that Allah has begotten children, while I am the self-sufficient Master, Whom all creatures need, Who begets not nor was He begotten, and there is none like unto Me.\"",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5398",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا روح بن عبادة، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ قال كانت هذه العدة تعتد عند أهل زوجها واجبا، فأنزل الله ‏{‏والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج فإن خرجن فلا جناح عليكم فيما فعلن في أنفسهن من معروف‏}‏ قال جعل الله لها تمام السنة سبعة أشهر وعشرين ليلة وصية إن شاءت سكنت في وصيتها، وإن شاءت خرجت، وهو قول الله تعالى ‏{‏غير إخراج فإن خرجن فلا جناح عليكم‏}‏ فالعدة كما هي، واجب عليها، زعم ذلك عن مجاهد‏.‏ وقال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهلها، فتعتد حيث شاءت، وقول الله تعالى ‏{‏غير إخراج‏}‏‏.‏ وقال عطاء إن شاءت اعتدت عند أهلها، وسكنت في وصيتها، وإن شاءت خرجت لقول الله ‏{‏فلا جناح عليكم فيما فعلن‏}‏‏.‏ قال عطاء ثم جاء الميراث فنسخ السكنى، فتعتد حيث شاءت، ولا سكنى لها‏.‏",
      "text_en": " Narrated Mujahid:                     (regarding the Verse): 'If any of you dies and leaves wives behind,' That was the period of the 'Iddah which the widow was obliged to spend in the house of the late husband. Then Allah revealed: And those of you who die and leave wives should bequeath for their wives a year's maintenance and residence without turning them out, but if they leave, there is no blame on you for what they do of themselves, provided it is honorable (i.e. lawful marriage) (2.240) Mujahid said: Allah has ordered that a widow has the right to stay for seven months and twenty days with her husband's relatives through her husband's will and testament so that she will complete the period of one year (of 'Iddah). But the widow has the right to stay that extra period or go out of her husband's house as is indicated by the statement of Allah: 'But if they leave there is no blame on you,... ' (2.240) Ibn `Abbas said: The above Verse has cancelled the order of spending the period of the 'Iddah at her late husband's house, and so she could spend her period of the 'Iddah wherever she likes. And Allah says: 'Without turning them out.' 'Ata said: If she would, she could spend her period of the 'Iddah at her husband's house, and live there according to her (husband's) will and testament, and if she would, she could go out (of her husband's house) as Allah says: 'There is no blame on you for what they do of themselves.' (2.240) 'Ata added: Then the Verses of inheritance were revealed and the order of residence (for the widow) was cancelled, and she could spend her period of the 'Iddah wherever she would like, and she was no longer entitled to be accommodated by her husband's family.",
      "chain": [
        "30313",
        "20229",
        "11559",
        "11254"
      ]
    },
    {
      "hadith_no": "5683",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا روح بن عبادة، أخبرنا ابن جريج، قال أخبرني عطاء، أنه سمع جابر بن عبد الله  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان جنح الليل  أو أمسيتم  فكفوا صبيانكم، فإن الشياطين تنتشر حينئذ، فإذا ذهب ساعة من الليل فحلوهم، فأغلقوا الأبواب واذكروا اسم الله، فإن الشيطان لا يفتح بابا مغلقا، وأوكوا قربكم واذكروا اسم الله، وخمروا آنيتكم واذكروا اسم الله، ولو أن تعرضوا عليها شيئا وأطفئوا، مصابيحكم ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"When night falls (or when it is evening), stop your children from going out, for the devils spread out at that time. But when an hour of the night has passed, release them and close the doors and mention Allah's Name, for Satan does not open a closed door. Tie the mouth of your waterskin and mention Allah's Name; cover your containers and utensils and mention Allah's Name. Cover them even by placing something across it, and extinguish your lamps. \"",
      "chain": [
        "30313",
        "20229",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "5828",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو أسامة، حدثنا هاشم بن هاشم، قال سمعت عامر بن سعد، سمعت سعدا  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من تصبح سبع تمرات عجوة، لم يضره ذلك اليوم سم ولا سحر ‏\"‏‏.‏",
      "text_en": " Narrated Saud:                     I heard Allah's Apostle saying, \"If Somebody takes seven 'Ajwa dates in the morning, neither magic nor poison will hurt him that day.\"",
      "chain": [
        "30313",
        "20318",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "6175",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني إسحاق، أخبرنا أبو المغيرة، حدثنا الأوزاعي، حدثنا الزهري، عن حميد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف منكم فقال في حلفه باللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك، فليتصدق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said: \"Whoever amongst you swears, (saying by error) in his oath 'By Al-Lat and Al- Uzza', then he should say, 'None has the right to be worshipped but Allah.' And whoever says to his companions, 'Come let me gamble' with you, then he must give something in charity (as an expiation for such a sin).\" (See Hadith No. 645)",
      "chain": [
        "30313",
        "20442",
        "20024",
        "11013",
        "11280",
        "13"
      ]
    },
    {
      "hadith_no": "6203",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا روح بن عبادة، حدثنا حسين، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال دخل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألم أخبر أنك تقوم الليل وتصوم النهار ‏\"‏‏.‏ قلت بلى‏.‏ قال ‏\"‏ فلا تفعل، قم ونم، وصم وأفطر، فإن لجسدك عليك حقا، وإن لعينك عليك حقا، وإن لزورك عليك حقا، وإن لزوجك عليك حقا، وإنك عسى أن يطول بك عمر، وإن من حسبك أن تصوم من كل شهر ثلاثة أيام، فإن بكل حسنة عشر أمثالها فذلك الدهر كله ‏\"‏‏.‏ قال فشددت فشدد على فقلت فإني أطيق غير ذلك‏.‏ قال ‏\"‏ فصم من كل جمعة ثلاثة أيام ‏\"‏‏.‏ قال فشددت فشدد على قلت أطيق غير ذلك‏.‏ قال ‏\"‏ فصم صوم نبي الله داود ‏\"‏‏.‏ قلت وما صوم نبي الله داود قال ‏\"‏ نصف الدهر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle entered upon me and said, \"Have I not been informed that you offer prayer all the night and fast the whole day?\" I said, \"Yes.\" He said, \"Do not do so; Offer prayer at night and also sleep; Fast for a few days and give up fasting for a few days because your body has a right on you, and your eye has a right on you, and your guest has a right on you, and your wife has a right on you. I hope that you will have a long life, and it is sufficient for you to fast for three days a month as the reward of a good deed, is multiplied ten times, that means, as if you fasted the whole year.\" I insisted (on fasting more) so I was given a hard instruction. I said, \"I can do more than that (fasting)\" The Prophet said, \"Fast three days every week.\" But as I insisted (on fasting more) so I was burdened. I said, \"I can fast more than that.\" The Prophet said, \"Fast as Allah's prophet David used to fast.\" I said, \"How was the fasting of the prophet David?\" The Prophet said, \"One half of a year (i.e. he used to fast on alternate days). '",
      "chain": [
        "30313",
        "20229",
        "11278",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "6324",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الله بن نمير، حدثنا عبيد الله، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة  رضى الله عنه أن رجلا، دخل المسجد ورسول الله صلى الله عليه وسلم جالس في ناحية المسجد فصلى، ثم جاء فسلم عليه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك السلام ارجع فصل فإنك لم تصل ‏\"‏‏.‏ فرجع فصلى، ثم جاء فسلم‏.‏ فقال ‏\"‏ وعليك السلام فارجع فصل، فإنك لم تصل ‏\"‏‏.‏ فقال في الثانية أو في التي بعدها علمني يا رسول الله‏.‏ فقال ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء، ثم استقبل القبلة فكبر، ثم اقرأ بما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع حتى تستوي قائما، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، ثم افعل ذلك في صلاتك كلها ‏\"‏‏.‏ وقال أبو أسامة في الأخير ‏\"‏ حتى تستوي قائما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man entered the mosque while Allah's Apostle was sitting in one side of the mosque. The man prayed, came, and greeted the Prophet. Allah's Apostle said to him, \"Wa 'Alaikas Salam (returned his greeting). Go back and pray as you have not prayed (properly).\" The man returned, repeated his prayer, came back and greeted the Prophet. The Prophet said, \"Wa alaika-s-Salam (returned his greeting). Go back and pray again as you have not prayed (properly).\" The man said at the second or third time, \"O Allah's Apostle! Kindly teach me how to pray\". The Prophet said, \"When you stand for prayer, perform ablution properly and then face the Qibla and say Takbir (Allahu-Akbar), and then recite what you know from the Qur'an, and then bow with calmness till you feel at ease then rise from bowing, till you stand straight, and then prostrate calmly (and remain in prostration) till you feel at ease, and then raise (your head) and sit with calmness till you feel at ease and then prostrate with calmness (and remain in prostration) till you feel at ease, and then raise (your head) and sit with calmness till you feel at ease in the sitting position, and do likewise in whole of your prayer.\" And Abu Usama added, \"Till you stand straight.\" (See Hadith No. 759, Vol.1)",
      "chain": [
        "30313",
        "20331",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "6339",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا بشر بن شعيب، حدثني أبي، عن الزهري، قال أخبرني عبد الله بن كعب، أن عبد الله بن عباس، أخبره أن عليا  يعني ابن أبي طالب  خرج من عند النبي صلى الله عليه وسلم وحدثنا أحمد بن صالح حدثنا عنبسة حدثنا يونس عن ابن شهاب قال أخبرني عبد الله بن كعب بن مالك أن عبد الله بن عباس أخبره أن علي بن أبي طالب  رضى الله عنه  خرج من عند النبي صلى الله عليه وسلم في وجعه الذي توفي فيه فقال الناس يا أبا حسن كيف أصبح رسول الله صلى الله عليه وسلم قال أصبح بحمد الله بارئا فأخذ بيده العباس فقال ألا تراه أنت والله بعد الثلاث عبد العصا والله إني لأرى رسول الله صلى الله عليه وسلم سيتوفى في وجعه، وإني لأعرف في وجوه بني عبد المطلب الموت، فاذهب بنا إلى رسول الله صلى الله عليه وسلم فنسأله فيمن يكون الأمر فإن كان فينا علمنا ذلك، وإن كان في غيرنا أمرناه فأوصى بنا‏.‏ قال علي والله لئن سألناها رسول الله صلى الله عليه وسلم فيمنعنا لا يعطيناها الناس أبدا، وإني لا أسألها رسول الله صلى الله عليه وسلم أبدا‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     `Ali bin Abu Talib came out of the house of the Prophet during his fatal ailment. The people asked (`Ali), \"O Abu Hasan! How is the health of Allah's Apostle this morning?\" `Ali said, \"This morning he is better, with the grace of Allah.\" Al-`Abbas held `Ali by the hand and said, \"Don't you see him (about to die)? By Allah, within three days you will be the slave of the stick (i.e., under the command of another ruler). By Allah, I think that Allah's Apostle will die from his present ailment, for I know the signs of death on the faces of the offspring of `Abdul Muttalib. So let us go to Allah's Apostle to ask him who will take over the Caliphate. If the authority is given to us, we will know it, and if it is given to somebody else we will request him to recommend us to him. \" `Ali said, \"By Allah! If we ask Allah's Apostle for the rulership and he refuses, then the people will never give it to us. Besides, I will never ask Allah's Apostle for it.\" (See Hadith No 728, Vol 5)",
      "chain": [
        "30313",
        "30317",
        "20428",
        "11013",
        "1131",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "6617",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا روح بن عبادة، حدثنا حاتم بن أبي صغيرة، حدثنا عبد الله بن أبي مليكة، حدثني القاسم بن محمد، حدثتني عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس أحد يحاسب يوم القيامة إلا هلك ‏\"‏‏.‏ فقلت يا رسول الله أليس قد قال الله تعالى ‏{‏فأما من أوتي كتابه بيمينه * فسوف يحاسب حسابا يسيرا‏}‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك العرض، وليس أحد يناقش الحساب يوم القيامة إلا عذب ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle, said, \"None will be called to account on the Day of Resurrection, but will be ruined.\" I said \"O Allah's Apostle! Hasn't Allah said: 'Then as for him who will be given his record in his right hand, he surely will receive an easy reckoning? (84.7-8) -- Allah's Apostle said, \"That (Verse) means only the presentation of the accounts, but anybody whose account (record) is questioned on the Day of Resurrection, will surely be punished.\"",
      "chain": [
        "30313",
        "20229",
        "11274",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "6748",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا أبو أسامة، حدثنا عبيد الله بن عمر، عن سعيد بن أبي سعيد، عن أبي هريرة، أن رجلا، دخل المسجد يصلي ورسول الله صلى الله عليه وسلم في ناحية المسجد، فجاء فسلم عليه فقال له ‏\"‏ ارجع فصل، فإنك لم تصل ‏\"‏‏.‏ فرجع فصلى، ثم سلم فقال ‏\"‏ وعليك، ارجع فصل، فإنك لم تصل ‏\"‏‏.‏ قال في الثالثة فأعلمني‏.‏ قال ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء، ثم استقبل القبلة فكبر، واقرأ بما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع رأسك حتى تعتدل قائما، ثم اسجد حتى تطمئن، ساجدا ثم ارفع حتى تستوي وتطمئن جالسا، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تستوي قائما، ثم افعل ذلك في صلاتك كلها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man entered the mosque and started praying while Allah's Apostle was sitting somewhere in the mosque. Then (after finishing the prayer) the man came to the Prophet and greeted him. The Prophet said to him, \"Go back and pray, for you have not prayed. The man went back, and having prayed, he came and greeted the Prophet. The Prophet after returning his greetings said, \"Go back and pray, for you did not pray.\" On the third time the man said, \"(O Allah's Apostle!) teach me (how to pray).\" The Prophet said, \"When you get up for the prayer, perform the ablution properly and then face the Qibla and say Takbir (Allahu Akbar), and then recite of what you know of the Qur'an, and then bow, and remain in this state till you feel at rest in bowing, and then raise your head and stand straight; and then prostrate till you feel at rest in prostration, and then sit up till you feel at rest while sitting; and then prostrate again till you feel at rest in prostration; and then get up and stand straight, and do all this in all your prayers.\"",
      "chain": [
        "30313",
        "20318",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "6955",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عبيد الله بن أبي بكر، سمع أنسا  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر ‏\"‏‏.‏ وحدثنا عمرو حدثنا شعبة عن ابن أبي بكر عن أنس بن مالك عن النبي صلى الله عليه وسلم قال ‏\"‏ أكبر الكبائر الإشراك بالله وقتل النفس، وعقوق الوالدين، وقول الزور ‏\"‏‏.‏ أو قال ‏\"‏ وشهادة الزور ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"The biggest of Al-Ka`ba'ir (the great sins) are (1) to join others as partners in worship with Allah, (2) to murder a human being, (3) to be undutiful to one's parents (4) and to make a false statement,\" or said, \"to give a false witness.\"",
      "chain": [
        "30313",
        "20250",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6974",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا أبو أسامة، قال هشام أخبرنا عن أبيه، عن عائشة، قالت لما كان يوم أحد هزم المشركون فصاح إبليس أى عباد الله أخراكم‏.‏ فرجعت أولاهم، فاجتلدت هي وأخراهم، فنظر حذيفة فإذا هو بأبيه اليمان فقال أى عباد الله أبي أبي‏.‏ قالت فوالله ما احتجزوا حتى قتلوه‏.‏ قال حذيفة غفر الله لكم‏.‏ قال عروة فما زالت في حذيفة منه بقية حتى لحق بالله‏.‏",
      "text_en": " Narrated `Aisha:                     \"When it was the day of (the battle of) Uhud, the pagans were defeated. Then Satan shouted, \"O Allah's worshipers! Beware of what is behind you!\" So the front files attacked the back files of the army. Hudhaifa looked, and behold, there was his father, Al-Yaman (being attacked) ! He shouted (to his companions), \"O Allah's worshipers, my father, my father!\" But by Allah, they did not stop till they killed him (i.e., Hudhaifa's father). Hudhaifa said, \"May Allah forgive you.\" (`Urwa said, Hudhaifa continued asking Allah's Forgiveness for the killer of his father till he died.",
      "chain": [
        "30313",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7239",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا حسين الجعفي، قال زائدة ذكره عن هشام، عن الحسن، قال أتينا معقل بن يسار نعوده فدخل عبيد الله فقال له معقل أحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما من وال يلي رعية من المسلمين، فيموت وهو غاش لهم، إلا حرم الله عليه الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Ma'qil:                     Allah's Apostle said, \"If any ruler having the authority to rule Muslim subjects dies while he is deceiving them, Allah will forbid Paradise for him.\"",
      "chain": [
        "30313",
        "20315",
        "11065",
        "11016"
      ]
    },
    {
      "hadith_no": "7403",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "‏ حدثنا إسحاق بن منصور، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجاء بنوح يوم القيامة فيقال له هل بلغت فيقول نعم يا رب‏.‏ فتسأل أمته هل بلغكم فيقولون ما جاءنا من نذير‏.‏ فيقول من شهودك فيقول محمد وأمته‏.‏ فيجاء بكم فتشهدون ‏\"‏‏.‏ ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏وكذلك جعلناكم أمة وسطا‏}‏ قال عدلا ‏{‏لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا‏}‏وعن جعفر بن عون، حدثنا الأعمش، عن أبي صالح، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": "",
      "chain": [
        "30313",
        "20318",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "hadith_no": "7435",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجاء بنوح يوم القيامة فيقال له هل بلغت فيقول نعم يا رب‏.‏ فتسأل أمته هل بلغكم فيقولون ما جاءنا من نذير‏.‏ فيقول من شهودك فيقول محمد وأمته‏.‏ فيجاء بكم فتشهدون ‏\"‏‏.‏ ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏وكذلك جعلناكم أمة وسطا‏}‏ قال عدلا ‏{‏لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا‏}‏ وعن جعفر بن عون، حدثنا الأعمش، عن أبي صالح، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"Noah will be brought (before Allah) on the Day of Resurrection, and will be asked, 'Did you convey the message of Allah?\" He will reply, 'Yes, O Lord.' And then Noah's nation will be asked, 'Did he (Noah) convey Allah's message to you?' They will reply, 'No warner came to us.' Then Noah will be asked, 'Who are your witnesses?' He will reply. '(My witnesses are) Muhammad and his followers.' Thereupon you (Muslims) will be brought and you will bear witness.\" Then the Prophet recited: 'And thus We have made of you (Muslims) a just and the best nation, that you might be witness over the nations, and the Apostle a witness over you.' (2.143)",
      "chain": [
        "30313",
        "20318",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "hadith_no": "157",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم ومعاذ بن جبل رديفه على الرحل قال ‏\"‏ يا معاذ ‏\"‏ ‏.‏ قال لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ يا معاذ ‏\"‏ ‏.‏ قال لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ يا معاذ ‏\"‏ ‏.‏ قال لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ ما من عبد يشهد أن لا إله إلا الله وأن محمدا عبده ورسوله إلا حرمه الله على النار ‏\"‏ ‏.‏ قال يا رسول الله أفلا أخبر بها الناس فيستبشروا قال ‏\"‏ إذا يتكلوا ‏\"‏ فأخبر بها معاذ عند موته تأثما ‏.‏",
      "text_en": " It is reported on the authority of Anas b. Malik that the Prophet of Allah (may peace and blessings be upon him) addressed Mu'adh b. Jabal as he was riding behind him to which he replied:                      At thy beck and call, and at thy pleasure, Messenger of Allah. He again called out: Mu'adh, to which he (again) replied: At thy beck and call, and at thy pleasure. He (the Holy Prophet) addressed him (again): Mu'adh, to which he replied: At thy beck and call, and at thy pleasure, Messenger of Allah. Upon this he (the Holy Prophet) observed: If anyone testifies (sincerely from his heart) that there is no god but Allah, and that Muhammad is His bondsman and His messenger, Allah immuned him from Hell. He (Mu'adh) said: Messenger of Allah, should I not then inform people of it, so that they may be of good cheer? He replied: Then they would trust in it alone. Mu'adh told about it at the time of his death, to avoid sinning.",
      "chain": [
        "30313",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "176",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا النضر بن شميل، أنبأنا حماد، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم بنحو حديثهم غير أنه قال ‏\"‏ من أن يرجع يهوديا أو نصرانيا ‏\"‏ ‏.‏",
      "text_en": " A similar hadith has been reported on the authority of Anas (with another chain of transmitters) with the exception of these words:                      that he again becomes a Jew or a Christian.",
      "chain": [
        "30313",
        "20291",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "281",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن أبي الزبير، عن جابر، أن نبي الله صلى الله عليه وسلم قال بمثله ‏.‏",
      "text_en": " The same hadith has been narrated by Ishaq b. Mansur on the authority of Jabir with another chain of transmitters.",
      "chain": [
        "30313",
        "20287",
        "20295",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد بن حميد، وإسحاق بن منصور، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، قال سمعت أبا صخرة، يذكر عن عبد الرحمن بن يزيد، وأبي، بردة بن أبي موسى قالا أغمي على أبي موسى وأقبلت امرأته أم عبد الله تصيح برنة ‏.‏ قالا ثم أفاق قال ألم تعلمي - وكان يحدثها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنا بريء ممن حلق وسلق وخرق ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Burda that Abu Musa fell unconscious and his wife Umm Abdullah came there and wailed loudly. When he felt relief he said:                      Don't you know? -and narrated to her: Verily the Messenger of Allah (may peace be upon him) said: I have no concern with one who shaved her hair, lamented loudly and tore (her clothes in grief).",
      "chain": [
        "30553",
        "30313",
        "20416",
        "20395",
        "11901"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وإسحاق بن منصور، وعبد الوارث بن عبد الصمد، كلهم عن عبد الصمد بن عبد الوارث، عن شعبة، عن أيوب، عن أبي قلابة، عن ثابت بن الضحاك الأنصاري، ح",
      "text_en": " It is narrated on the authority of Thabit b. Dahhak that the Apostle of Allah (may peace be upon him) observed:                      He who took deliberately a false oath on a religion other than Islam would become that which he had professed. And he who killed himself with anything Allah would torment him with that in the Fire of Hell.",
      "chain": [
        "30123",
        "30313",
        "20250",
        "20020",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا وكيع، حدثنا مسعر، وهشام، ح وحدثني إسحاق بن منصور، أخبرنا الحسين بن علي، عن زائدة، عن شيبان، جميعا عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " The same hadith has been narrated by Zuhair b. Harb, Waki, Ishaq b. Mansur, Husain b. 'Ali.",
      "chain": [
        "30022",
        "20032",
        "20359",
        "11065",
        "30313",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني الحسن بن علي الحلواني، وإسحاق بن منصور، ومحمد بن رافع، - وألفاظهم متقاربة - قال إسحاق أخبرنا وقال الآخران، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني سليمان الأحول، أن ثابتا، مولى عمر بن عبد الرحمن أخبره أنه، لما كان بين عبد الله بن عمرو وبين عنبسة بن أبي سفيان ما كان تيسروا للقتال فركب خالد بن العاص إلى عبد الله بن عمرو فوعظه خالد فقال عبد الله بن عمرو أما علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Thabit, that when 'Abdullah b. 'Amr and 'Anbasa b. Abi Sufyan were about to fight against each other, Khalid b. 'As rode to 'Abdullah b. 'Amr and persuaded him (not to do so). Upon this Abdullah b. 'Amr said:                      Are you not aware that the Messenger of Allah (may peace be upon him) had observed:\" He who died in protecting his property is a martyr.\" This hadith has been narrated by Muhammad b. Hatim, Muhammad b. Bakr, Ahmad b. 'Uthman Naufali, Abu 'Asim, Ibn Juraij.",
      "chain": [
        "30115",
        "30313",
        "30375",
        "30312",
        "20121",
        "11070",
        "11247"
      ]
    },
    {
      "hadith_no": "489",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبيد الله بن سعيد، وإسحاق بن منصور، كلاهما عن روح، قال عبيد الله حدثنا روح بن عبادة القيسي، حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يسأل عن الورود، فقال نجيء نحن يوم القيامة عن كذا، وكذا، انظر أى ذلك فوق الناس - قال - فتدعى الأمم بأوثانها وما كانت تعبد الأول فالأول ثم يأتينا ربنا بعد ذلك فيقول من تنظرون فيقولون ننظر ربنا ‏.‏ فيقول أنا ربكم ‏.‏ فيقولون حتى ننظر إليك ‏.‏ فيتجلى لهم يضحك - قال - فينطلق بهم ويتبعونه ويعطى كل إنسان منهم - منافق أو مؤمن - نورا ثم يتبعونه وعلى جسر جهنم كلاليب وحسك تأخذ من شاء الله ثم يطفأ نور المنافقين ثم ينجو المؤمنون فتنجو أول زمرة وجوههم كالقمر ليلة البدر سبعون ألفا لا يحاسبون ثم الذين يلونهم كأضوإ نجم في السماء ثم كذلك ثم تحل الشفاعة ويشفعون حتى يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن شعيرة فيجعلون بفناء الجنة ويجعل أهل الجنة يرشون عليهم الماء حتى ينبتوا نبات الشىء في السيل ويذهب حراقه ثم يسأل حتى تجعل له الدنيا وعشرة أمثالها معها ‏.‏",
      "text_en": " It is reported on the authority of Abu Zubair that he heard from Jabir b 'Abdullah, who was asked about the arrival (of people on the Day of Resurrection). He said. We would come on the Day of Resurrection like this, like this, and see. carefully. that which concerns\" elevated people\". He (the narrator) said:                      Then the people would be summoned along with their idols whom they worshipped, one after another. Then our Lord would come to us and say: Whom are you waiting for? They would say: We are waiting for our Lord. He would say: I am your Lord. They would say: (We are not sure) till we gaze at Thee, and He would manifest Himself to them smilingly, and would go along with them and they would follow Him; and every person, whether a hypocrite or a believer, would be endowed with a light, and there would be spikes and hooks on the bridge of the Hell, which would catch hold of those whom Allah willed. Then the light of the hypocrites would be extinguished, and the believers would secure salvation. and the first group to achieve it would comprise seventy thousand men who would have the brightness of full moon on their faces, and they would not be called to account. Then the people immediately following them would have their faces as the brightest stars in the heaven. This is how (the groups would follow one after another). Then the stage of intercession would come, and they (who are permitted to intercede) would intercede, till he who had declared:\" There is no god but Allah\" and had in his heart virtue of the weight of a barley grain would come out of the Fire. They would be then brought in the courtyard of Paradise and the inhabitants of Paradise would begin to sprinkle water over them till they would sprout like the sprouting of a thing in flood water, and their burns would disappear. They would ask their Lord till they would be granted (the bounties) of the world and with it ten more besides it.",
      "chain": [
        "30359",
        "30313",
        "20229",
        "11201",
        "20229",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا أبان، حدثنا يحيى، أن زيدا، حدثه أن أبا سلام حدثه عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطهور شطر الإيمان والحمد لله تملأ الميزان ‏.‏ وسبحان الله والحمد لله تملآن - أو تملأ - ما بين السموات والأرض والصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏",
      "text_en": " Abu Malik at-Ash'ari reported:                      The Messenger of Allah (may peace be upon him) said: Cleanliness is half of faith and al-Hamdu Liliah (Praise be to Allah) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Liliah (Praise be to Allah) fill upwhat is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.",
      "chain": [
        "30313",
        "20218",
        "20205",
        "11449",
        "10912",
        "10968",
        "5372"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا عمر بن أبي زائدة، عن الشعبي، عن عروة بن المغيرة، عن أبيه، أنه وضأ النبي صلى الله عليه وسلم فتوضأ ومسح على خفيه فقال له فقال ‏\"‏ إني أدخلتهما طاهرتين ‏\"‏ ‏.‏",
      "text_en": " 'Urwah al Mughira reported it from his father:                      He (Mughira) helped the Apostle (may peace be upon him) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.",
      "chain": [
        "30514",
        "30313",
        "11643",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن حاتم بن ميمون، جميعا عن محمد بن بكر، قال أخبرنا ابن جريج، ح وحدثني إسحاق بن منصور، ومحمد بن رافع، واللفظ، لهما - قال إسحاق أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، - أخبرنا ابن جريج، أخبرني عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان حجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على عاتقك من الحجارة ‏.‏ ففعل فخر إلى الأرض وطمحت عيناه إلى السماء ثم قام فقال ‏\"‏ إزاري إزاري ‏\"‏ ‏.‏ فشد عليه إزاره ‏.‏ قال ابن رافع في روايته على رقبتك ‏.‏ ولم يقل على عاتقك ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      When the Ka'ba was constructed the Apostle of Allah (may peace be upon him) and Abbas went and lifted stones. Abbas said to the Messenger of Allah (may peace be upon him): Place your lower garment on your shoulder (so that you may protect yourself from the roughness and hardness of stones). He (the Holy Prophet) did this, but fell down upon the ground in a state of unconciousness and his eyes were turned towards the sky. He then stood up and said: My lower garment, my lower garment; and this wrapper was tied around him. In the hadith transmitted by Ibn Rafi', there is the word:\" On his neck\" and he did not say:\" Upon his shoulder.\"",
      "chain": [
        "30021",
        "38487",
        "20277",
        "11070",
        "30313",
        "30375",
        "30312",
        "20121",
        "11070",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني إسحاق بن منصور، وأبو بكر بن إسحاق قال أبو بكر حدثنا وقال ابن منصور، أخبرنا عمرو بن الربيع، أخبرنا يحيى بن أيوب، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه قال رأيت على ابن وعلة السبئي فروا فمسسته فقال ما لك تمسه قد سألت عبد الله بن عباس قلت إنا نكون بالمغرب ومعنا البربر والمجوس نؤتى بالكبش قد ذبحوه ونحن لا نأكل ذبائحهم ويأتونا بالسقاء يجعلون فيه الودك ‏.‏ فقال ابن عباس قد سألنا رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ دباغه طهوره ‏\"‏ ‏.‏",
      "text_en": " Abu al-Khair reported:                      I saw Ibn Wa'la al-Saba'i wear a fur. I touched it. He said: Why do you touch it? I asked Ibn 'Abbas saying: We are the inhabitants of the western regions, and there (live) with us Berbers and Magians. They bring with them rams and slaughter them, but we do not eat (the meat of the animals) slaughtered by them, and they come with skins full of fat. Upon this Ibn 'Abbas said: We asked the Messenger of Allah (may peace be upon him) about this and he said: Its tanning makes it pure.",
      "chain": [
        "30313",
        "11108",
        "20436",
        "20379",
        "11411",
        "17"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني إسحاق بن منصور، وأبو بكر بن إسحاق عن عمرو بن الربيع، أخبرنا يحيى بن أيوب، عن جعفر بن ربيعة، عن أبي الخير، حدثه قال حدثني ابن وعلة السبئي، قال سألت عبد الله بن عباس قلت إنا نكون بالمغرب فيأتينا المجوس بالأسقية فيها الماء والودك فقال اشرب ‏.‏ فقلت أرأى تراه فقال ابن عباس سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ دباغه طهوره ‏\"‏ ‏.‏",
      "text_en": " Ibn Wa'la al-Saba'i reported:                      I asked 'Abdullah b. 'Abbas saying: We are the inhabitants of the western regions. The Magians come to us with skins full of water and fat. He said: Drink. I said to him: Is it your own opinion? Ibn Abbas said: I heard the Messenger of Allah (may peace be upon him) say: Tanning purifies it (the skin).",
      "chain": [
        "30313",
        "11108",
        "20379",
        "11407",
        "11410",
        "17"
      ]
    }
  ],
  "total_hadiths": 293
}