{
  "id": "30318",
  "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
  "full_name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Mervazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20183",
      "name": "Yahya bin Wadh يحيى بن واضح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38024",
      "name": "Ahmed bin Syar bin Ayoub أحمد بن سيار بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، ح وحدثنا بشر بن محمد، قال أخبرنا عبد الله، قال أخبرنا يونس، ومعمر، عن الزهري، نحوه قال أخبرني عبيد الله بن عبد الله، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم أجود الناس، وكان أجود ما يكون في رمضان حين يلقاه جبريل، وكان يلقاه في كل ليلة من رمضان فيدارسه القرآن، فلرسول الله صلى الله عليه وسلم أجود بالخير من الريح المرسلة‏.‏",
      "text_en": "      Narrated Ibn 'Abbas:                          Allah's Apostle was the most generous of all the people, and he used      to reach the peak in generosity in the month of Ramadan when Gabriel      met him. Gabriel used to meet him every night of Ramadan to teach him      the Qur'an. Allah's Apostle was the most generous person, even more      generous than the strong uncontrollable wind (in readiness and haste      to do charitable deeds).",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "30318",
        "20025",
        "20475",
        "20115",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "893",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا بشر بن محمد، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال أخبرنا سالم بن عبد الله، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم يقول ‏\"‏ كلكم راع ‏\"‏‏.‏ وزاد الليث قال يونس كتب رزيق بن حكيم إلى ابن شهاب  وأنا معه يومئذ بوادي القرى  هل ترى أن أجمع‏.‏ ورزيق عامل على أرض يعملها، وفيها جماعة من السودان وغيرهم، ورزيق يومئذ على أيلة، فكتب ابن شهاب  وأنا أسمع  يأمره أن يجمع، يخبره أن سالما حدثه أن عبد الله بن عمر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كلكم راع، وكلكم مسئول عن رعيته، الإمام راع ومسئول عن رعيته، والرجل راع في أهله وهو مسئول عن رعيته، والمرأة راعية في بيت زوجها ومسئولة عن رعيتها، والخادم راع في مال سيده ومسئول عن رعيته  قال وحسبت أن قد قال  والرجل راع في مال أبيه ومسئول عن رعيته وكلكم راع ومسئول عن رعيته ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard Allah's Apostle saying, \"All of you are Guardians.\" Yunis said: Ruzaiq bin Hukaim wrote to Ibn Shihab while I was with him at Wadi-al-Qura saying, \"Shall I lead the Jumua prayer?\" Ruzaiq was working on the land (i.e. farming) and there was a group of Sudanese people and some others with him; Ruzaiq was then the Governor of Aila. Ibn Shihab wrote (to Ruzaiq) ordering him to lead the Jumua prayer and telling him that Salim told him that `Abdullah bin `Umar had said, \"I heard Allah's Apostle saying, 'All of you are guardians and responsible for your wards and the things under your care. The Imam (i.e. ruler) is the guardian of his subjects and is responsible for them and a man is the guardian of his family and is responsible for them. A woman is the guardian of her husband's house and is responsible for it. A servant is the guardian of his master's belongings and is responsible for them.' I thought that he also said, 'A man is the guardian of his father's property and is responsible for it. All of you are guardians and responsible for your wards and the things under your care.\"",
      "chain": [
        "30318",
        "20025",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، قال يونس قال الزهري أخبرني أنس بن مالك، أن المسلمين، بينا هم في الفجر يوم الاثنين، وأبو بكر  رضى الله عنه  يصلي بهم ففجأهم النبي صلى الله عليه وسلم قد كشف ستر حجرة عائشة  رضى الله عنها  فنظر إليهم، وهم صفوف، فتبسم يضحك، فنكص أبو بكر  رضى الله عنه  على عقبيه، وظن أن رسول الله صلى الله عليه وسلم يريد أن يخرج إلى الصلاة، وهم المسلمون أن يفتتنوا في صلاتهم فرحا بالنبي صلى الله عليه وسلم حين رأوه، فأشار بيده أن أتموا، ثم دخل الحجرة وأرخى الستر، وتوفي ذلك اليوم‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          While Abu Bakr was leading the people in the morning prayer on a      Monday, the Prophet came towards them suddenly having lifted the      curtain of 'Aisha's house, and looked at them as they were standing in     rows and smiled. Abu Bakr tried to come back thinking that Allah's      Apostle wanted to come out for the prayer. The attention of the      Muslims was diverted from the prayer because they were delighted to      see the Prophet. The Prophet waved his hand to them to complete their      prayer, then he went back into the room and let down the curtain. The      Prophet expired on that very day.",
      "chain": [
        "30318",
        "20025",
        "20475",
        "11013",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1242",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، قال أخبرني معمر، ويونس، عن الزهري، قال أخبرني أبو سلمة، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرته قالت أقبل أبو بكر  رضى الله عنه  على فرسه من مسكنه بالسنح حتى نزل، فدخل المسجد، فلم يكلم الناس، حتى نزل فدخل على عائشة  رضى الله عنها  فتيمم النبي صلى الله عليه وسلم وهو مسجى ببرد حبرة، فكشف عن وجهه، ثم أكب عليه فقبله ثم بكى فقال بأبي أنت يا نبي الله، لا يجمع الله عليك موتتين، أما الموتة التي كتبت عليك فقد متها‏.‏   قال أبو سلمة فأخبرني ابن عباس  رضى الله عنهما  أن أبا بكر  رضى الله عنه  خرج وعمر  رضى الله عنه  يكلم الناس‏.‏ فقال اجلس‏.‏ فأبى‏.‏ فقال اجلس‏.‏ فأبى، فتشهد أبو بكر  رضى الله عنه  فمال إليه الناس، وتركوا عمر فقال أما بعد، فمن كان منكم يعبد محمدا صلى الله عليه وسلم فإن محمدا صلى الله عليه وسلم قد مات، ومن كان يعبد الله فإن الله حى لا يموت، قال الله تعالى ‏{‏وما محمد إلا رسول‏}‏ إلى ‏{‏الشاكرين‏}‏ والله لكأن الناس لم يكونوا يعلمون أن الله أنزل الآية حتى تلاها أبو بكر  رضى الله عنه  فتلقاها منه الناس، فما يسمع بشر إلا يتلوها‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr came riding his horse from his dwelling place in As-Sunh. He got down from it, entered the Mosque and did not speak with anybody till he came to me and went direct to the Prophet, who was covered with a marked blanket. Abu Bakr uncovered his face. He knelt down and kissed him and then started weeping and said, \"My father and my mother be sacrificed for you, O Allah's Prophet! Allah will not combine two deaths on you. You have died the death which was written for you.\" Narrated Abu Salama from Ibn `Abbas : Abu Bakr came out and `Umar , was addressing the people, and Abu Bakr told him to sit down but `Umar refused. Abu Bakr again told him to sit down but `Umar again refused. Then Abu Bakr recited the Tashah-hud (i.e. none has the right to be worshipped but Allah and Muhammad is Allah's Apostle) and the people attended to Abu Bakr and left `Umar. Abu Bakr said, \"Amma ba'du, whoever amongst you worshipped Muhammad, then Muhammad is dead, but whoever worshipped Allah, Allah is alive and will never die. Allah said: 'Muhammad is no more than an Apostle and indeed (many) Apostles have passed away before him ..(up to the) grateful.' \" (3.144) (The narrator added, \"By Allah, it was as if the people never knew that Allah had revealed this verse before till Abu Bakr recited it and then whoever heard it, started reciting it.\")",
      "chain": [
        "30318",
        "20025",
        "20115",
        "20475",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1439",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا بشر بن محمد، قال أخبرنا عبد الله، أخبرنا معمر، عن الزهري، قال حدثني عبد الله بن أبي بكر بن حزم، عن عروة، عن عائشة  رضى الله عنها  قالت دخلت امرأة معها ابنتان لها تسأل، فلم تجد عندي شيئا غير تمرة فأعطيتها إياها، فقسمتها بين ابنتيها ولم تأكل منها، ثم قامت فخرجت، فدخل النبي صلى الله عليه وسلم علينا، فأخبرته فقال ‏\"‏ من ابتلي من هذه البنات بشىء كن له سترا من النار ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     A lady along with her two daughters came to me asking (for some alms), but she found nothing with me except one date which I gave to her and she divided it between her two daughters, and did not eat anything herself, and then she got up and went away. Then the Prophet came in and I informed him about this story. He said, \"Whoever is put to trial by these daughters and he treats them generously (with benevolence) then these daughters will act as a shield for him from Hell-Fire.\" (See Hadith No. 24, Vol. 8).",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11013",
        "11104",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2141",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا الحسين المكتب، عن عطاء بن أبي رباح، عن جابر بن عبد الله  رضى الله عنهما  أن رجلا أعتق غلاما له عن دبر، فاحتاج فأخذه النبي صلى الله عليه وسلم فقال ‏\"‏ من يشتريه مني ‏\"‏ فاشتراه نعيم بن عبد الله بكذا وكذا، فدفعه إليه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A man decided that a slave of his would be manumitted after his death and later on he was in need of money, so the Prophet took the slave and said, \"Who will buy this slave from me?\" Nu'aim bin `Abdullah bought him for such and such price and the Prophet gave him the slave.",
      "chain": [
        "30318",
        "20025",
        "11278",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2492",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق شقيصا من مملوكه فعليه خلاصه في ماله، فإن لم يكن له مال قوم المملوك، قيمة عدل ثم استسعي غير مشقوق عليه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever manumits his share of a jointly possessed slave, it is imperative for him to get that slave manumitted completely by paying the remaining price, and if he does not have sufficient money to manumit him, then the price of the slave should be estimated justly, and he is to be allowed to work and earn the amount that will manumit him (without overburdening him)\".",
      "chain": [
        "30318",
        "20025",
        "11073",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "2548",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، سمعت سعيد بن المسيب، يقول قال أبو هريرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ للعبد المملوك الصالح أجران، والذي نفسي بيده لولا الجهاد في سبيل الله والحج وبر أمي، لأحببت أن أموت وأنا مملوك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A pious slave gets a double reward.\" Abu Huraira added: By Him in Whose Hands my soul is but for Jihad (i.e. holy battles), Hajj, and my duty to serve my mother, I would have loved to die as a slave.",
      "chain": [
        "30318",
        "20025",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2751",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا بشر بن محمد السختياني، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني سالم، عن ابن عمر  رضى الله عنهما  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كلكم راع ومسئول عن رعيته، والإمام راع ومسئول عن رعيته، والرجل راع في أهله ومسئول عن رعيته، والمرأة في بيت زوجها راعية ومسئولة عن رعيتها، والخادم في مال سيده راع ومسئول عن رعيته ‏\"‏‏.‏ قال وحسبت أن قد قال ‏\"‏ والرجل راع في مال أبيه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard Allah's Apostle saying, \"All of you are guardians and responsible for your charges: the Ruler (i.e. Imam) is a guardian and responsible for his subjects; and a man is a guardian of his family and is responsible for his charges; and a lady is a guardian in the house of her husband and is responsible for her charge; and a servant is a guardian of the property of his master and is responsible for his charge.\" I think he also said, \"And a man is a guardian of the property of his father.\"",
      "chain": [
        "30318",
        "20025",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2830",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا عاصم، عن حفصة بنت سيرين، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الطاعون شهادة لكل مسلم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Plauge is the cause of martyrdom of every Muslim (who dies because of it).",
      "chain": [
        "30318",
        "20025",
        "11080",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "3196",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، عن موسى بن عقبة، عن سالم، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أخذ شيئا من الأرض بغير حقه خسف به يوم القيامة إلى سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet said, \"Any person who takes a piece of land unjustly will sink down the seven earths on the Day of Resurrection.\"",
      "chain": [
        "30318",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3330",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم نحوه يعني ‏\"‏ لولا بنو إسرائيل لم يخنز اللحم، ولولا حواء لم تخن أنثى زوجها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"But for the Israelis, meat would not decay and but for Eve, wives would never betray their husbands.\"",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3454",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني بشر بن محمد، أخبرنا عبد الله، أخبرني معمر، ويونس، عن الزهري، قال أخبرني عبيد الله بن عبد الله، أن عائشة، وابن، عباس رضى الله عنهم قالا لما نزل برسول الله صلى الله عليه وسلم طفق يطرح خميصة على وجهه، فإذا اغتم كشفها عن وجهه، فقال وهو كذلك ‏\"‏ لعنة الله على اليهود والنصارى، اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ يحذر ما صنعوا‏.‏",
      "text_en": " Narrated `Aisha and Ibn `Abbas:                     On his death-bed Allah's Apostle put a sheet over his-face and when he felt hot, he would remove it from his face. When in that state (of putting and removing the sheet) he said, \"May Allah's Curse be on the Jews and the Christians for they build places of worship at the graves of their prophets.\" (By that) he intended to warn (the Muslim) from what they (i.e. Jews and Christians) had done.",
      "chain": [
        "30318",
        "20025",
        "20115",
        "20475",
        "11013",
        "11004",
        "53",
        "17"
      ]
    },
    {
      "hadith_no": "3485",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبيد الله، أخبرنا يونس، عن الزهري، أخبرني سالم، أن ابن عمر، حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل يجر إزاره من الخيلاء خسف به، فهو يتجلجل في الأرض إلى يوم القيامة ‏\"‏‏.‏ تابعه عبد الرحمن بن خالد عن الزهري‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"While a man was walking, dragging his dress with pride, he was caused to be swallowed by the earth and will go on sinking in it till the Day of Resurrection.\"",
      "chain": [
        "30318",
        "11201",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4504",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا بشر بن محمد، حدثنا عبد الله، قال يونس قال الزهري أخبرني سعيد بن المسيب، في رجال من أهل العلم أن عائشة قالت كان النبي صلى الله عليه وسلم يقول وهو صحيح ‏\"‏ إنه لم يقبض نبي حتى يرى مقعده من الجنة، ثم يخير ‏\"‏‏.‏ فلما نزل به ورأسه على فخذي غشي عليه، ثم أفاق، فأشخص بصره إلى سقف البيت ثم قال ‏\"‏ اللهم الرفيق الأعلى ‏\"‏‏.‏ فقلت إذا لا يختارنا‏.‏ وعرفت أنه الحديث الذي كان يحدثنا وهو صحيح قالت فكانت آخر كلمة تكلم بها ‏\"‏ اللهم الرفيق الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet was healthy, he used to say, \"No soul of a prophet is captured till he is shown his place in Paradise and then he is given the option.\" When death approached him while his head was on my thigh, he became unconscious and then recovered his consciousness. He then looked at the ceiling of the house and said, \"O Allah! (with) the highest companions.\" I said (to myself), \"Hence, he is not going to choose us.\" Then I realized that what he had said was the application of the narration which he used to mention to us when he was healthy. The last word he spoke was, \"O Allah! (with) the highest companion.\"",
      "chain": [
        "30318",
        "20025",
        "20475",
        "11013",
        "11002",
        "53"
      ]
    },
    {
      "hadith_no": "4881",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معاوية بن أبي المزرد، بهذا قال رسول الله صلى الله عليه وسلم ‏\"‏ واقرءوا إن شئتم ‏{‏فهل عسيتم‏}‏",
      "text_en": " Narrated Muawiya bin Abi Al-Muzarrad:                     Allah's Apostle, said, \"Recite if you wish: Would you then if you were given the authority.\" (47.22)",
      "chain": [
        "30318",
        "20025"
      ]
    },
    {
      "hadith_no": "5706",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن الأعمش،‏.‏ حدثني بشر بن محمد، أخبرنا عبد الله، أخبرنا شعبة، عن الأعمش، عن أبي وائل، عن مسروق، عن عائشة  رضى الله عنها  قالت ما رأيت أحدا أشد عليه الوجع من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     I never saw anybody suffering so much from sickness as Allah's Apostle.",
      "chain": [
        "20351",
        "20012",
        "30318",
        "20025",
        "20020",
        "11060",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5774",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، ويونس، قال الزهري أخبرني عبيد الله بن عبد الله بن عتبة، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت لما ثقل رسول الله صلى الله عليه وسلم واشتد وجعه، استأذن أزواجه في أن يمرض في بيتي، فأذن، فخرج بين رجلين، تخط رجلاه في الأرض بين عباس وآخر‏.‏ فأخبرت ابن عباس قال هل تدري من الرجل الآخر الذي لم تسم عائشة قلت لا‏.‏ قال هو علي‏.‏ قالت عائشة فقال النبي صلى الله عليه وسلم بعد ما دخل بيتها واشتد به وجعه ‏\"‏ هريقوا على من سبع قرب لم تحلل أوكيتهن، لعلي أعهد إلى الناس ‏\"‏‏.‏ قالت فأجلسناه في مخضب لحفصة زوج النبي صلى الله عليه وسلم ثم طفقنا نصب عليه من تلك القرب، حتى جعل يشير إلينا أن قد فعلتن‏.‏ قالت وخرج إلى الناس فصلى لهم وخطبهم‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) When the health of Allah's Apostle deteriorated and his condition became serious, he asked the permission of all his wives to allow him to be treated In my house, and they allowed him. He came out, supported by two men and his legs were dragging on the ground between `Abbas and another man. (The sub-narrator told Ibn `Abbas who said: Do you know who was the other man whom `Aisha did not mention? The sub-narrator said: No. Ibn `Abbas said: It was `Ali.) `Aisha added: When the Prophet entered my house and his disease became aggravated, he said, \"Pour on me seven water skins full of water (the tying ribbons of which had not been untied) so that I may give some advice to the people.\" So we made him sit in a tub belonging to Hafsa, the wife of the Prophet and started pouring water on him from those water skins till he waved us to stop. Then he went out to the people and led them in prayer and delivered a speech before them.",
      "chain": [
        "30318",
        "20025",
        "20115",
        "20475",
        "11013",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "6053",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني بشر بن محمد، أخبرنا عبد الله، أخبرنا معاوية بن أبي مزرد، قال سمعت عمي، سعيد بن يسار يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله خلق الخلق حتى إذا فرغ من خلقه، قالت الرحم هذا مقام العائذ بك من القطيعة‏.‏ قال نعم أما ترضين أن أصل من وصلك‏.‏ وأقطع من قطعك‏.‏ قالت بلى يا رب‏.‏ قال فهو لك ‏\"‏‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فاقرءوا إن شئتم ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah created the creations, and when He finished from His creations, Ar-Rahm i.e., womb said, \"(O Allah) at this place I seek refuge with You from all those who sever me (i.e. sever the ties of Kith and kin). Allah said, 'Yes, won't you be pleased that I will keep good relations with the one who will keep good relations with you, and I will sever the relation with the one who will sever the relations with you.' It said, 'Yes, O my Lord.' Allah said, 'Then that is for you ' \" Allah's Apostle added. \"Read (in the Qur'an) if you wish, the Statement of Allah: 'Would you then, if you were given the authority, do mischief in the land and sever your ties of kinship?' (47.22)",
      "chain": [
        "30318",
        "20025",
        "11541",
        "13"
      ]
    },
    {
      "hadith_no": "6133",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والظن، فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا، ولا تحاسدوا، ولا تدابروا، ولا تباغضوا، وكونوا عباد الله إخوانا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Beware of suspicion, for suspicion is the worst of false tales; and do not look for the others' faults and do not spy, and do not be jealous of one another, and do not desert (cut your relation with) one another, and do not hate one another; and O Allah's worshipers! Be brothers (as Allah has ordered you!\")",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6689",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يأتي ابن آدم النذر بشىء لم يكن قد قدرته، ولكن يلقيه القدر وقد قدرته له، أستخرج به من البخيل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said (that Allah said), \"Vowing does not bring to the son of Adam anything I have not already written in his fate, but vowing is imposed on him by way of fore ordainment. Through vowing I make a miser spend of his wealth.\"",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6700",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا علي بن حفص، وبشر بن محمد، قالا أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم لابن صياد ‏\"‏ خبأت لك خبيئا ‏\"‏‏.‏ قال الدخ‏.‏ قال ‏\"‏ اخسأ فلن تعدو قدرك ‏\"‏‏.‏ قال عمر ائذن لي فأضرب عنقه‏.‏ قال ‏\"‏ دعه، إن يكن هو فلا تطيقه، وإن لم يكن هو فلا خير لك في قتله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said to Ibn Saiyad, \"I have kept for you a secret.\" Ibn Saiyad said, \"Ad-Dukh.\" The Prophet said, \"Keep quiet, for you cannot go beyond your limits (or you cannot exceed what has been foreordained for you).\" On that, `Umar said (to the Prophet ), \"Allow me to chop off his neck!\" The Prophet said, \"Leave him, for if he is he (i.e., Ad-Dajjal), then you will not be able to overcome him, and if he is not, then you gain no good by killing him.\"",
      "chain": [
        "20632",
        "30318",
        "20025",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 22
}