{
  "id": "30329",
  "name": "Hafs bin 'Umar bin al-Harith حفص بن عمر بن الحارث",
  "full_name": "Hafs bin 'Umar bin al-Harith حفص بن عمر بن الحارث",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "225",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Azdi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20719",
      "name": "Muhammad bin Rashid al-Mkhwly محمد بن راشد المكحولي الخزاعي الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30264",
      "name": "al-Fadl bin Sahl bin Ibrahim الفضل بن سهل بن إبراهيم الأعرج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34188",
      "name": "Muhammad bin Isma'il bin Ibrahim محمد بن إسماعيل بن إبراهيم بن مقسم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "168",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، قال أخبرني أشعث بن سليم، قال سمعت أبي، عن مسروق، عن عائشة، قالت كان النبي صلى الله عليه وسلم يعجبه التيمن في تنعله وترجله وطهوره وفي شأنه كله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to like to start from the right side on wearing shoes, combing his hair and cleaning or washing himself and on doing anything else.",
      "chain": [
        "30329",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "175",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن ابن أبي السفر، عن الشعبي، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم فقال ‏\"‏ إذا أرسلت كلبك المعلم فقتل فكل، وإذا أكل فلا تأكل، فإنما أمسكه على نفسه ‏\"‏‏.‏ قلت أرسل كلبي فأجد معه كلبا آخر قال ‏\"‏ فلا تأكل، فإنما سميت على كلبك، ولم تسم على كلب آخر ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I asked the Prophet (about the hunting dogs) and he replied, \"If you let loose (with Allah's name) your tamed dog after a game and it hunts it, you may eat it, but if the dog eats of (that game) then do not eat it because the dog has hunted it for itself.\" I further said, \"Sometimes I send my dog for hunting and find another dog with it. He said, \"Do not eat the game for you have mentioned Allah's name only on sending your dog and not the other dog.\"",
      "chain": [
        "30329",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، قال أخبرني قتادة، قال سمعت أنسا، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يتفلن أحدكم بين يديه ولا عن يمينه، ولكن عن يساره أو تحت رجله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"None of you should spit in front or on his right but he could spit either on his left or under his foot.\"",
      "chain": [
        "30329",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "532",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا يزيد بن إبراهيم، قال حدثنا قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ اعتدلوا في السجود، ولا يبسط ذراعيه كالكلب، وإذا بزق فلا يبزقن بين يديه ولا عن يمينه، فإنه يناجي ربه ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Do the prostration properly and do not put your forearms flat with elbows touching the ground like a dog. And if you want to spit, do not spit in front, nor to the right for the person in prayer is speaking in private to his Lord.\"",
      "chain": [
        "30329",
        "20303",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "541",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي المنهال، عن أبي برزة، كان النبي صلى الله عليه وسلم يصلي الصبح وأحدنا يعرف جليسه، ويقرأ فيها ما بين الستين إلى المائة، ويصلي الظهر إذا زالت الشمس، والعصر وأحدنا يذهب إلى أقصى المدينة ثم يرجع والشمس حية، ونسيت ما قال في المغرب، ولا يبالي بتأخير العشاء إلى ثلث الليل‏.‏ ثم قال إلى شطر الليل‏.‏ وقال معاذ قال شعبة ثم لقيته مرة فقال أو ثلث الليل‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     Abu Barza said, \"The Prophet used to offer the Fajr (prayer) when one could recognize the person sitting by him (after the prayer) and he used to recite between 60 to 100 Ayat (verses) of the Qur'an. He used to offer the Zuhr prayer as soon as the sun declined (at noon) and the `Asr at a time when a man might go and return from the farthest place in Medina and find the sun still hot. (The sub-narrator forgot what was said about the Maghrib). He did not mind delaying the `Isha prayer to one third of the night or the middle of the night.\"",
      "chain": [
        "30329",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "581",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا هشام، عن قتادة، عن أبي العالية، عن ابن عباس، قال شهد عندي رجال مرضيون وأرضاهم عندي عمر أن النبي صلى الله عليه وسلم نهى عن الصلاة بعد الصبح حتى تشرق الشمس، وبعد العصر حتى تغرب‏.‏",
      "text_en": " Narrated `Umar:                     \"The Prophet forbade praying after the Fajr prayer till the sun rises and after the `Asr prayer till the sun sets.\"",
      "chain": [
        "30329",
        "20295",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "743",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم وأبا بكر وعمر  رضى الله عنهما  كانوا يفتتحون الصلاة ب  ‏{‏الحمد لله رب العالمين‏}‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet, Abu Bakr and `Umar used to start the prayer with \"Al hamdu li l-lahi Rabbi l-`alamin (All praise is but to Allah, Lord of the Worlds).",
      "chain": [
        "30329",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "791",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن سليمان، قال سمعت زيد بن وهب، قال رأى حذيفة رجلا لا يتم الركوع والسجود قال ما صليت، ولو مت مت على غير الفطرة التي فطر الله محمدا صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Wahb:                     Hudhaifa saw a person who was not performing the bowing and prostration perfectly. He said to him, \"You have not prayed and if you should die you would die on a religion other than that of Muhammad.\"",
      "chain": [
        "30329",
        "20020",
        "20160",
        "11341"
      ]
    },
    {
      "hadith_no": "794",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يقول في ركوعه وسجوده ‏\"‏ سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to say in his bowing and prostrations, \"Subhanaka l-lahumma Rabbana wa bihamdika; Allahumma ghfir li.' (Exalted [from unbecoming attributes] Are you O Allah our Lord, and by Your praise [do I exalt you]. O Allah! Forgive me).",
      "chain": [
        "30329",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1070",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه  أن النبي صلى الله عليه وسلم قرأ سورة النجم فسجد بها، فما بقي أحد من القوم إلا سجد، فأخذ رجل من القوم كفا من حصى أو تراب، فرفعه إلى وجهه وقال يكفيني هذا، فلقد رأيته بعد قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me. Later on I saw him killed as a non-believer.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1103",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن عمرو، عن ابن أبي ليلى، قال ما أنبأ أحد، أنه رأى النبي صلى الله عليه وسلم صلى الضحى غير أم هانئ ذكرت أن النبي صلى الله عليه وسلم يوم فتح مكة اغتسل في بيتها، فصلى ثمان ركعات، فما رأيته صلى صلاة أخف منها، غير أنه يتم الركوع والسجود‏.‏",
      "text_en": " Narrated Ibn Abu Laila:                     Only Um Hani told us that she had seen the Prophet (p.b.u.h) offering the Duha (forenoon prayer). She said, \"On the day of the conquest of Mecca, the Prophet took a bath in my house and offered eight rak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.",
      "chain": [
        "30329",
        "20020",
        "20377",
        "11196"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا خالد بن عبد الله، عن حصين، عن أبي وائل، عن حذيفة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان إذا قام للتهجد من الليل يشوص فاه بالسواك‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.",
      "chain": [
        "30329",
        "20423",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1188",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني عبد الملك بن عمير، عن قزعة، قال سمعت أبا سعيد  رضى الله عنه  أربعا قال سمعت من النبي، صلى الله عليه وسلم وكان غزا مع النبي صلى الله عليه وسلم ثنتى عشرة غزوة ح‏.‏",
      "text_en": "      Narrated Quza'a:                          I heard Abu Said saying four words. He said, \"I heard the Prophet      (saying the following narrative).\" He had participated in twelve holy      battles with the Prophet.",
      "chain": [
        "30329",
        "20020",
        "11368",
        "38"
      ]
    },
    {
      "hadith_no": "1229",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا حفص بن عمر، حدثنا يزيد بن إبراهيم، عن محمد، عن أبي هريرة  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم إحدى صلاتى العشي  قال محمد وأكثر ظني العصر  ركعتين ثم سلم ثم قام إلى خشبة في مقدم المسجد فوضع يده عليها وفيهم أبو بكر وعمر  رضى الله عنهما  فهابا أن يكلماه وخرج سرعان الناس فقالوا أقصرت الصلاة ورجل يدعوه النبي صلى الله عليه وسلم ذو اليدين فقال أنسيت أم قصرت فقال ‏\"‏ لم أنس ولم تقصر ‏\"‏‏.‏ قال بلى قد نسيت‏.‏ فصلى ركعتين ثم سلم ثم كبر فسجد مثل سجوده أو أطول، ثم رفع رأسه فكبر، ثم وضع رأسه فكبر فسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet offered one of the evening prayers (the sub-narrator Muhammad said, \"I think that it was most probably the `Asr prayer\") and he finished it after offering two rak`at only. He then stood near a price of wood in front of the Mosque and put his hand over it. Abu Bakr and `Umar were amongst those who were present, but they dared not talk to him about that (because of excessive respect for him), and those who were in a hurry went out. They said, \"Has the prayer been reduced?\" A man who was called Dhul-Yadain by the Prophet said (to the Prophet), \"Has the prayer been reduced or have you forgotten?\" He said, \"Neither have I forgotten, nor has the prayer been reduced.\" He said, \"Certainly you have forgotten.\" So the Prophet offered two more rak`at and performed Taslim and then said Takbir and performed a prostration of Sahu like his ordinary prostration or a bit longer and then raised his head and said Takbir and then put his head down and performed a prostration like his ordinary prostration or a bit longer, and then raised his head and said Takbir.",
      "chain": [
        "30329",
        "20303",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "1369",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علقمة بن مرثد، عن سعد بن عبيدة، عن البراء بن عازب  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقعد المؤمن في قبره أتي، ثم شهد أن لا إله إلا الله، وأن محمدا رسول الله، فذلك قوله ‏{‏يثبت الله الذين آمنوا بالقول الثابت‏}‏ ‏\"‏‏.‏ حدثنا محمد بن بشار حدثنا غندر حدثنا شعبة بهذا وزاد ‏{‏يثبت الله الذين آمنوا‏}‏ نزلت في عذاب القبر‏.‏",
      "text_en": "      Narrated Al-Bara' bin 'Azib :                          The Prophet (p.b.u.h) said, \"When a faithful believer is made to sit      in his grave, then (the angels) come to him and he testifies that none     has the right to be worshipped but Allah and Muhammad is Allah's      Apostle. And that corresponds to Allah's statement: Allah will keep      firm those who believe with the word that stands firm . . . (14.27).      Narrated Shu'ba:     Same as above and added, \"Allah will keep firm those who believe . . .     (14.27) was revealed concerning the punishment of the grave.\"",
      "chain": [
        "30329",
        "20020",
        "11374",
        "11344",
        "400"
      ]
    },
    {
      "hadith_no": "1414",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن ابن عثمان بن عبد الله بن موهب، عن موسى بن طلحة، عن أبي أيوب، رضى الله عنه أن رجلا، قال للنبي صلى الله عليه وسلم أخبرني بعمل يدخلني الجنة‏.‏ قال ما له ما له وقال النبي صلى الله عليه وسلم ‏\"‏ أرب ماله، تعبد الله، ولا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصل الرحم ‏\"‏‏.‏ وقال بهز حدثنا شعبة، حدثنا محمد بن عثمان، وأبوه، عثمان بن عبد الله أنهما سمعا موسى بن طلحة، عن أبي أيوب، بهذا‏.‏ قال أبو عبد الله أخشى أن يكون، محمد غير محفوظ إنما هو عمرو‏.‏",
      "text_en": " Narrated Abu Aiyub:                     A man said to the Prophet \"Tell me of such a deed as will make me enter Paradise.\" The people said, \"What is the matter with him? What is the matter with him?\" The Prophet said, \"He has something to ask. (What he needs greatly) The Prophet said: (In order to enter Paradise) you should worship Allah and do not ascribe any partners to Him, offer prayer perfectly, pay the Zakat and keep good relations with your Kith and kin.\" (See Hadith No. 12, Vol 8).",
      "chain": [
        "30329",
        "20020",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "1522",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو، عن عبد الله بن أبي أوفى، قال كان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏‏.‏ فأتاه أبي بصدقته، فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah bin Abu Aufa :                          Whenever a person came to the Prophet with his alms, the Prophet would     say, \"O Allah! Send your Blessings upon so and so.\" My father went to      the Prophet with his alms and the Prophet said, \"O Allah! Send your      blessings upon the offspring of Abu Aufa.\"",
      "chain": [
        "30329",
        "20020",
        "20377",
        "5115"
      ]
    },
    {
      "hadith_no": "1767",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني عمرو، قال سمعت جابر بن زيد، قال سمعت ابن عباس  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يخطب بعرفات‏.‏ تابعه ابن عيينة عن عمرو‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I heard the Prophet delivering a sermon at `Arafat.",
      "chain": [
        "30329",
        "20020",
        "20377",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله  رضى الله عنه  أنه انتهى إلى الجمرة الكبرى جعل البيت عن يساره، ومنى عن يمينه، ورمى بسبع، وقال هكذا رمى الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     When `Abdullah, reached the big Jamra (i.e. Jamrat-ul-Aqaba) he kept the Ka`ba on the left side and Mina on his right side and threw seven pebbles (at the Jamra) and said, \"The one on whom Surat-al- Baqara was revealed (i.e. the Prophet) had done the Rami similarly.\"",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "2108",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا همام، عن قتادة، عن أبي الخليل، عن عبد الله بن الحارث، عن حكيم بن حزام  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يفترقا ‏\"‏‏.‏   وزاد أحمد حدثنا بهز، قال قال همام فذكرت ذلك لأبي التياح فقال كنت مع أبي الخليل لما حدثه عبد الله بن الحارث بهذا الحديث‏.‏",
      "text_en": " Narrated Hakim bin Hizam\":                     The Prophet said, \"The buyer and the seller have the option of canceling or confirming the deal unless they separate.\"",
      "chain": [
        "30329",
        "20297",
        "11019",
        "11291",
        "912",
        "423"
      ]
    },
    {
      "hadith_no": "2181",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني حبيب بن أبي ثابت، قال سمعت أبا المنهال، قال سألت البراء بن عازب وزيد بن أرقم  رضى الله عنهم  عن الصرف،، فكل واحد منهما يقول هذا خير مني‏.‏ فكلاهما يقول نهى رسول الله صلى الله عليه وسلم عن بيع الذهب بالورق دينا‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     I asked Al-Bara' bin `Azib and Zaid bin Arqam about money exchanges. Each of them said, \"This is better than I,\" and both of them said, \"Allah's Apostle forbade the selling of silver for gold on credit. \"",
      "chain": [
        "30329",
        "20020",
        "11331",
        "11290",
        "400"
      ]
    },
    {
      "hadith_no": "2243",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن ابن أبي المجالد،‏.‏ وحدثنا يحيى، حدثنا وكيع، عن شعبة، عن محمد بن أبي المجالد، حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني محمد،، أو عبد الله بن أبي المجالد قال اختلف عبد الله بن شداد بن الهاد وأبو بردة في السلف، فبعثوني إلى ابن أبي أوفى  رضى الله عنه  فسألته فقال إنا كنا نسلف على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر، في الحنطة، والشعير والزبيب، والتمر‏.‏ وسألت ابن أبزى فقال مثل ذلك‏.‏",
      "text_en": " Narrated Shu`ba:                     Muhammad or `Abdullah bin Abu Al-Mujalid said, \"Abdullah bin Shaddad and Abu Burda differed regarding As-Salam, so they sent me to Ibn Abi `Aufa and I asked him about it. He replied, 'In the lifetime of Allah's Apostle, Abu Bakr and `Umar, we used to pay in advance the prices of wheat, barley, dried grapes and dates to be delivered later. I also asked Ibn Abza and he, too, replied as above.' \"",
      "chain": [
        "20296",
        "20020",
        "20031",
        "20032",
        "20020",
        "11701",
        "30329",
        "20020"
      ]
    },
    {
      "hadith_no": "2455",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن جبلة، كنا بالمدينة في بعض أهل العراق، فأصابنا سنة، فكان ابن الزبير يرزقنا التمر، فكان ابن عمر  رضى الله عنهما  يمر بنا فيقول إن رسول الله صلى الله عليه وسلم نهى عن الإقران، إلا أن يستأذن الرجل منكم أخاه‏.‏",
      "text_en": " Narrated Jabala:                     \"We were in Medina with some of the Iraqi people, and we were struck with famine and Ibn Az- Zubair used to give us dates. Ibn `Umar used to pass by and say, \"The Prophet forbade us to eat two dates at a time, unless one takes the permission of one's companions.\"",
      "chain": [
        "30329",
        "20020",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "2626",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا حفص بن عمر، حدثنا همام، حدثنا قتادة، قال حدثني النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ العمرى جائزة ‏\"‏‏.‏ وقال عطاء حدثني جابر، عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Umra is permissible.\" Ata said, \"Jabir narrated the same to me from the Prophet.\"",
      "chain": [
        "30329",
        "20297",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "2837",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن البراء  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم الأحزاب ينقل التراب وقد وارى التراب بياض بطنه، وهو يقول لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا‏.‏ فأنزل السكينة علينا وثبت الأقدام إن لاقينا‏.‏ إن الألى قد بغوا علينا إذا أرادوا فتنة أبينا‏.‏",
      "text_en": " Narrated Al-Bara:                     On the day (of the battle) of Al-Ahzab (i.e. clans) I saw the Prophet carrying earth, and the earth was covering the whiteness of his `Abdomen. And he was saying, \"Without You (O Allah!) we would have got no guidance, nor given in charity, nor prayed. So please bless us with tranquility and make firm our feet when we meet our enemies. Indeed (these) people have rebelled against (oppressed) us but never shall we yield if they try to bring affliction upon us.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2850",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن حصين، وابن أبي السفر، عن الشعبي، عن عروة بن الجعد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة ‏\"‏‏.‏ قال سليمان عن شعبة عن عروة بن أبي الجعد‏.‏",
      "text_en": " Narrated Urwa bin Ja'd:                     The Prophet () said, \"Good will remain (as a permanent quality) in the foreheads of horses till the Day of Resurrection.\"",
      "chain": [
        "30329",
        "20020",
        "15097",
        "11636",
        "11052"
      ]
    },
    {
      "hadith_no": "2961",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول كانت الأنصار يوم الخندق تقول نحن الذين بايعوا محمدا على الجهاد ما حيينا أبدا فأجابهم النبي صلى الله عليه وسلم فقال اللهم لا عيش إلا عيش الآخره فأكرم الأنصار والمهاجره",
      "text_en": " Narrated Anas:                     On the day (of the battle) of the Trench, the Ansar were saying, \"We are those who have sworn allegiance to Muhammad for Jihaid (for ever) as long as we live.\" The Prophet replied to them, \"O Allah! There is no life except the life of the Hereafter. So honor the Ansar and emigrants with Your Generosity.\"",
      "chain": [
        "30329",
        "20020",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3213",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عدي بن ثابت، عن البراء  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لحسان ‏\"‏ اهجهم  أو هاجهم  وجبريل معك ‏\"‏‏.‏",
      "text_en": " Narrated Al Bara:                     The Prophet said to Hassan, \"Lampoon them (i.e. the pagans) and Gabriel is with you.\"",
      "chain": [
        "30329",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "3233",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه – ‏{‏لقد رأى من آيات ربه الكبرى‏}‏ قال رأى رفرفا أخضر سد أفق السماء‏.‏",
      "text_en": " Narrated `Abdullah:                     Regarding the Verse: \"Indeed he (Muhammad) did see. Of the Signs of his Lord, The Greatest!\" (53.18) That the Prophet had seen a green carpet spread all over the horizon of the sky.",
      "chain": [
        "30329",
        "20020",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3413",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة، عن أبي العالية، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول إني خير من يونس بن متى ‏\"‏‏.‏ ونسبه إلى أبيه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"No slave (of Allah) should say that I am better than Yunus bin Matta.\" So the Prophet mentioned his father's name with his name.",
      "chain": [
        "30329",
        "20020",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "3577",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن حميد، عن أنس  رضى الله عنه  قال كان النبي صلى الله عليه وسلم في السوق فقال رجل يا أبا القاسم‏.‏ فالتفت النبي صلى الله عليه وسلم فقال ‏\"‏ سموا باسمي، ولا تكتنوا بكنيتي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     While the Prophet was in the market, a man called (somebody), \"O Abu-l-Qasim!' The Prophet turned to him and said \"Name yourselves after me but do not call yourselves by my Kuniya.\"",
      "chain": [
        "30329",
        "20020",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3591",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم مربوعا، بعيد ما بين المنكبين، له شعر يبلغ شحمة أذنه، رأيته في حلة حمراء، لم أر شيئا قط أحسن منه‏.‏ قال يوسف بن أبي إسحاق عن أبيه إلى منكبيه‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet was of moderate height having broad shoulders (long) hair reaching his ear-lobes. Once I saw him in a red cloak and I had never seen a more handsome than him.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3805",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن سليمان، قال سمعت أبا وائل، قال سمعت مسروقا، قال قال عبد الله بن عمرو إن رسول الله صلى الله عليه وسلم لم يكن فاحشا ولا متفحشا وقال ‏\"‏ إن من أحبكم إلى أحسنكم أخلاقا ‏\"‏‏.‏ وقال ‏\"‏ استقرئوا القرآن من أربعة من عبد الله بن مسعود، وسالم مولى أبي حذيفة، وأبى بن كعب، ومعاذ بن جبل ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle neither talked in an insulting manner nor did he ever speak evil intentionally. He used to say, \"The most beloved to me amongst you is the one who has the best character and manners.\" He added, \" Learn the Qur'an from (any of these) four persons. `Abdullah bin Mas`ud, Salim the freed slave of Abu Hudhaifa, Ubai bin Ka`b, and Mu`adh bin Jabal.\"",
      "chain": [
        "30329",
        "20020",
        "20160",
        "11353",
        "11018",
        "29"
      ]
    },
    {
      "hadith_no": "4449",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن جرير، أن النبي صلى الله عليه وسلم قال في حجة الوداع لجرير ‏\"‏ استنصت الناس ‏\"‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet ordered me during Hajjatul-Wada`. \"Ask the people to listen.\" He then said, \"Do not become infidels after me by cutting the necks (throats) of one another. \"",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "4636",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن البراء  رضى الله عنه  قال لما نزلت ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ دعا رسول الله صلى الله عليه وسلم زيدا فكتبها، فجاء ابن أم مكتوم فشكا ضرارته، فأنزل الله ‏{‏غير أولي الضرر‏}‏",
      "text_en": " Narrated Al-Bara:                     When the Verse:-- \"Not equal are those of the believers who sit (at home)\" (4.95) was revealed, Allah Apostle called for Zaid who wrote it. In the meantime Ibn Um Maktum came and complained of his blindness, so Allah revealed: \"Except those who are disabled (by injury or are blind or lame...\" etc.) (4.95)",
      "chain": [
        "30329",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4679",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو، عن أبي وائل، عن عبد الله  رضى الله عنه  قال ‏\"‏ لا أحد أغير من الله، ولذلك حرم الفواحش ما ظهر منها وما بطن، ولا شىء أحب إليه المدح من الله، لذلك مدح نفسه ‏\"‏‏.‏ قلت سمعته من عبد الله قال نعم‏.‏ قلت ورفعه قال نعم‏.‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah (bin Mas`ud) said, \"None has more sense of ghaira than Allah therefore - He prohibits shameful sins (illegal sexual intercourse, etc.) whether committed openly or secretly. And none loves to be praised more than Allah does, and for this reason He praises Himself.\" I asked Abu Wali, \"Did you hear it from `Abdullah?\" He said, \"Yes,\" I said, \"Did `Abdullah ascribe it to Allah's Apostle?\" He said, \"Yes.\"",
      "chain": [
        "30329",
        "20020",
        "20377",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4918",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله، قال كان النبي صلى الله عليه وسلم يقرأ ‏{‏فهل من مدكر‏}‏",
      "text_en": " Narrated `Abdullah bin Masud:                     The Prophet used to recite: \"Fahal-min-Maddakir (then is there any that will receive admonition?\")",
      "chain": [
        "30329",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "4948",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني حفص بن عمر، حدثنا خالد بن عبد الله، حدثنا حصين، عن سالم بن أبي الجعد، وعن أبي سفيان، عن جابر بن عبد الله  رضى الله عنهما  قال أقبلت عير يوم الجمعة ونحن مع النبي صلى الله عليه وسلم فثار الناس إلا اثنا عشر رجلا فأنزل الله ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها‏}‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A caravan of merchandise arrived at Medina on a Friday while we were with the Prophet All the people left (the Prophet and headed for the caravan) except twelve persons. Then Allah revealed:-- 'But when they see some bargain or some amusement they disperse headlong to it.' ..(62.11)",
      "chain": [
        "30329",
        "20423",
        "15097",
        "11342",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5050",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو، عن إبراهيم، عن مسروق، ذكر عبد الله بن عمرو عبد الله بن مسعود فقال لا أزال أحبه سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ خذوا القرآن من أربعة من عبد الله بن مسعود وسالم ومعاذ وأبى بن كعب ‏\"‏‏.‏",
      "text_en": " Narrated Masriq:                     `Abdullah bin `Amr mentioned `Abdullah bin Masud and said, \"I shall ever love that man, for I heard the Prophet saying, 'Take (learn) the Qur'an from four: `Abdullah bin Masud, Salim, Mu`adh and Ubai bin Ka`b.' \"",
      "chain": [
        "30329",
        "20020",
        "20377",
        "11051",
        "11018"
      ]
    },
    {
      "hadith_no": "5054",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا حفص بن عمر، حدثنا همام، حدثنا قتادة، قال سألت أنس بن مالك  رضى الله عنه  من جمع القرآن على عهد النبي صلى الله عليه وسلم قال أربعة كلهم من الأنصار أبى بن كعب ومعاذ بن جبل، وزيد بن ثابت، وأبو زيد‏.‏ تابعه الفضل عن حسين بن واقد عن ثمامة عن أنس‏.‏",
      "text_en": " Narrated Qatada:                     I asked Anas bin Malik: \"Who collected the Qur'an at the time of the Prophet ?\" He replied, \"Four, all of whom were from the Ansar: Ubai bin Ka`b, Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid.\"",
      "chain": [
        "30329",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5516",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن محمد  هو ابن زياد  قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أتى أحدكم خادمه بطعامه، فإن لم يجلسه معه فليناوله أكلة أو أكلتين، أو لقمة أو لقمتين، فإنه ولي حره وعلاجه ‏\"‏‏.‏",
      "text_en": " Narrated .Abu Huraira:                     The Prophet said, \"When your servant brings your food to you, if you do not ask him to join you, then at least ask him to take one or two handfuls, for he has suffered from its heat (while cooking it) and has taken pains to cook it nicely.\"",
      "chain": [
        "30329",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "5648",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن ابن عمر، عن عمر، قال الخمر يصنع من خمسة من الزبيب والتمر والحنطة والشعير والعسل‏.‏",
      "text_en": "      Narrated 'Umar:                          \"Alcoholic drinks are prepared from five things, i.e., raisins, dates.     wheat, barley and honey.\"",
      "chain": [
        "30329",
        "20020",
        "11636",
        "11052",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "5692",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، قال كان حذيفة بالمداين فاستسقى، فأتاه دهقان بقدح فضة، فرماه به فقال إني لم أرمه إلا أني نهيته فلم ينته، وإن النبي صلى الله عليه وسلم نهانا عن الحرير والديباج والشرب في آنية الذهب والفضة وقال ‏\"‏ هن لهم في الدنيا وهى لكم في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Laila:                     While Hudhaita was at Mada'in, he asked for water. The chief of the village brought him a silver vessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he has not stopped using it. The Prophet forbade us to wear clothes of silk or Dibaj, and to drink in gold or silver utensils, and said, 'These things are for them (unbelievers) in this world and for you (Muslims) in the Hereafter.' \"",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "5710",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني أشعث بن سليم، قال سمعت معاوية بن سويد بن مقرن، عن البراء بن عازب  رضى الله عنهما  قال أمرنا رسول الله صلى الله عليه وسلم بسبع، ونهانا عن سبع، نهانا عن خاتم الذهب، ولبس الحرير، والديباج، والإستبرق، وعن القسي، والميثرة، وأمرنا أن نتبع الجنائز، ونعود المريض، ونفشي السلام‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     Allah's Apostle ordered us to do seven things and forbade us to do seven other things. He forbade us to wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral processions, visit the sick and greet everybody. (See Hadith No. 104)",
      "chain": [
        "30329",
        "20020",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "5787",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني حبيب بن أبي ثابت، قال سمعت إبراهيم بن سعد، قال سمعت أسامة بن زيد، يحدث سعدا عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا سمعتم بالطاعون بأرض فلا تدخلوها، وإذا وقع بأرض وأنتم بها فلا تخرجوا منها ‏\"‏‏.‏ فقلت أنت سمعته يحدث سعدا ولا ينكره قال نعم‏.‏",
      "text_en": " Narrated Saud:                     The Prophet said, \"If you hear of an outbreak of plague in a land, do not enter it; but if the plague breaks out in a place while you are in it, do not leave that place.\"",
      "chain": [
        "30329",
        "20020",
        "11331",
        "20150",
        "50",
        "9"
      ]
    },
    {
      "hadith_no": "6098",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن سليمان، سمعت أبا وائل، سمعت مسروقا، قال قال عبد الله بن عمرو‏.‏ حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن شقيق بن سلمة، عن مسروق، قال دخلنا على عبد الله بن عمرو حين قدم مع معاوية إلى الكوفة فذكر رسول الله صلى الله عليه وسلم فقال لم يكن فاحشا ولا متفحشا، وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أخيركم أحسنكم خلقا ‏\"‏‏.‏",
      "text_en": "      Narrated Masruq:                          Abdullah bin 'Amr mentioned Allah's Apostle saying that he was neither     a Fahish nor a Mutafahish. Abdullah bin 'Amr added, Allah's Apostle      said, 'The best among you are those who have the best manners and      character.'",
      "chain": [
        "30329",
        "20020",
        "20160",
        "11353",
        "11018",
        "30367",
        "20028",
        "11060",
        "11353",
        "11018"
      ]
    },
    {
      "hadith_no": "6108",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، قال سألت عائشة ما كان النبي صلى الله عليه وسلم يصنع في أهله قالت كان في مهنة أهله، فإذا حضرت الصلاة قام إلى الصلاة‏.‏",
      "text_en": " Narrated Al-Aswad:                     I asked `Aisha what did the Prophet use to do at home. She replied. \"He used to keep himself busy serving his family and when it was time for the prayer, he would get up for prayer.\"",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "6120",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حفص بن عمر، حدثنا يزيد بن إبراهيم، حدثنا محمد، عن أبي هريرة، صلى بنا النبي صلى الله عليه وسلم الظهر ركعتين، ثم سلم، ثم قام إلى خشبة في مقدم المسجد، ووضع يده عليها، وفي القوم يومئذ أبو بكر وعمر، فهابا أن يكلماه، وخرج سرعان الناس فقالوا قصرت الصلاة‏.‏ وفي القوم رجل كان النبي صلى الله عليه وسلم يدعوه ذا اليدين فقال يا نبي الله أنسيت أم قصرت‏.‏ فقال ‏\"‏ لم أنس ولم تقصر ‏\"‏‏.‏ قالوا بل نسيت يا رسول الله‏.‏ قال ‏\"‏ صدق ذو اليدين ‏\"‏‏.‏ فقام فصلى ركعتين ثم سلم، ثم كبر، فسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر، ثم وضع مثل سجوده أو أطول، ثم رفع رأسه وكبر‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet led us in the Zuhr prayer, offering only two rak`at and then (finished it) with Taslim, and went to a piece of wood in front of the mosque and put his hand over it. Abu Bakr and `Umar were also present among the people on that day but dared not talk to him (about his unfinished prayer). And the hasty people went away, wondering. \"Has the prayer been shortened\" Among the people there was a man whom the Prophet used to call Dhul-Yadain (the longarmed). He said, \"O Allah's Prophet! Have you forgotten or has the prayer been shortened?\" The Prophet said, \"Neither have I forgotten, nor has it been shortened.\" They (the people) said, \"Surely, you have forgotten, O Allah's Apostle!\" The Prophet said, Dhul-Yadain has told the truth.\" So the Prophet got up and offered other two rak`at and finished his prayer with Taslim. Then he said Takbir, performed a prostration of ordinary duration or longer, then he raised his head and said Takbir and performed another prostration of ordinary duration or longer and then raised his head and said Takbir (i.e. he performed the two prostrations of Sahu, i.e., forgetfulness).",
      "chain": [
        "30329",
        "20303",
        "20278"
      ]
    },
    {
      "hadith_no": "6410",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، أخبرني سليمان، عن أبي وائل، عن عبد الله، قال قسم النبي صلى الله عليه وسلم قسما فقال رجل إن هذه لقسمة ما أريد بها وجه الله‏.‏ فأخبرت النبي صلى الله عليه وسلم فغضب حتى رأيت الغضب في وجهه وقال ‏\"‏ يرحم الله موسى، لقد أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet divided something (among the Muslims) and distributed the shares (of the booty). A man said, \"This division has not been made to please Allah.\" When I informed the Prophet about it, he became so furious that I noticed the signs of anger on his face and he then said, \"May Allah bestow His Mercy on Moses, for he was hurt with more than this, yet he remained patient.\"",
      "chain": [
        "30329",
        "20020",
        "20160",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6436",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا حفص بن عمر، حدثنا هشام، عن قتادة، عن أنس  رضى الله عنه سألوا رسول الله صلى الله عليه وسلم حتى أحفوه المسألة فغضب فصعد المنبر فقال ‏\"‏ لا تسألوني اليوم عن شىء إلا بينته لكم ‏\"‏‏.‏ فجعلت أنظر يمينا وشمالا، فإذا كل رجل لاف رأسه في ثوبه يبكي، فإذا رجل كان إذا لاحى الرجال يدعى لغير أبيه فقال يا رسول الله من أبي قال ‏\"‏ حذافة ‏\"‏، ثم أنشأ عمر فقال رضينا بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم رسولا، نعوذ بالله من الفتن‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما رأيت في الخير والشر كاليوم قط، إنه صورت لي الجنة والنار حتى رأيتهما وراء الحائط ‏\"‏‏.‏ وكان قتادة يذكر عند الحديث هذه الآية ‏{‏يا أيها الذين آمنوا لا تسألوا عن أشياء إن تبد لكم تسؤكم‏}‏‏.‏",
      "text_en": " Narrated Anas:                     Once the people started asking Allah's Apostle questions, and they asked so many questions that he became angry and ascended the pulpit and said, \"I will answer whatever questions you may ask me today.\" I looked right and left and saw everyone covering his face with his garment and weeping. Behold ! There was a man who, on quarreling with the people, used to be called as a son of a person other than h is father. He said, \"O Allah's Apostle! Who is my father?\" The Prophet replied, \"Your father is Hudhaifa.\" And then `Umar got up and said, \"We accept Allah as our Lord, and Islam as (our) religion, and Muhammad as (our) Apostle; and we seek refuge with Allah from the afflictions.\" Allah's Apostle said, \" I have never seen a day like today in its good and its evil for Paradise and the Hell Fire were displayed in front of me, till I saw them just beyond this wall.\" Qatada, when relating this Hadith, used to mention the following Verse:-- 'O you who believe! Ask not questions about things which, If made plain to you, May cause you trouble. (5.101)",
      "chain": [
        "30329",
        "20295",
        "11019",
        "19"
      ]
    }
  ],
  "total_hadiths": 175
}