{
  "id": "30320",
  "name": "Byan bin 'Amr بيان بن عمر",
  "full_name": "Byan bin 'Amr بيان بن عمر",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "222",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Bukhara"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Bukhari",
      "'Abid"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20542",
      "name": "Salm bin Nwh bin Aby سالم بن نوح بن أبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1163",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا بيان بن عمرو، حدثنا يحيى بن سعيد، حدثنا ابن جريج، عن عطاء، عن عبيد بن عمير، عن عائشة  رضى الله عنها  قالت لم يكن النبي صلى الله عليه وسلم على شىء من النوافل أشد منه تعاهدا على ركعتى الفجر‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was never more regular and particular in offering any Nawafil than the two rak`at (Sunna) of the Fajr prayer.",
      "chain": [
        "30320",
        "20031",
        "11070",
        "11029",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "1611",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا بيان بن عمرو، حدثنا يزيد، حدثنا جرير بن حازم، حدثنا يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم قال لها ‏\"‏ يا عائشة لولا أن قومك حديث عهد بجاهلية لأمرت بالبيت فهدم، فأدخلت فيه ما أخرج منه وألزقته بالأرض، وجعلت له بابين بابا شرقيا وبابا غربيا، فبلغت به أساس إبراهيم ‏\"‏‏.‏ فذلك الذي حمل ابن الزبير  رضى الله عنهما  على هدمه‏.‏ قال يزيد وشهدت ابن الزبير حين هدمه وبناه وأدخل فيه من الحجر، وقد رأيت أساس إبراهيم حجارة كأسنمة الإبل‏.‏ قال جرير فقلت له أين موضعه قال أريكه الآن‏.‏ فدخلت معه الحجر فأشار إلى مكان فقال ها هنا‏.‏ قال جرير فحزرت من الحجر ستة أذرع أو نحوها‏.‏",
      "text_en": " Narrated Yazid bin Ruman from `Urwa:                     `Aisha said that the Prophet said to her, \"O Aisha! Were your nation not close to the Pre-Islamic Period of Ignorance, I would have had the Ka`ba demolished and would have included in it the portion which had been left, and would have made it at a level with the ground and would have made two doors for it, one towards the east and the other towards the west, and then by doing this it would have been built on the foundations laid by Abraham.\" That was what urged Ibn-Az-Zubair to demolish the Ka`ba. Jazz said, \"I saw Ibn-Az-Zubair when he demolished and rebuilt the Ka`ba and included in it a portion of Al-Hijr (the unroofed portion of Ka`ba which is at present in the form of a compound towards the northwest of the Ka`ba). I saw the original foundations of Abraham which were of stones resembling the humps of camels.\" So Jarir asked Yazid, \"Where was the place of those stones?\" Jazz said, \"I will just now show it to you.\" So Jarir accompanied Yazid and entered Al-Hijr, and Jazz pointed to a place and said, \"Here it is.\" Jarir said, \"It appeared to me about six cubits from Al-Hijr or so.\"",
      "chain": [
        "30320",
        "20472",
        "11272",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3355",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني بيان بن عمرو، حدثنا النضر، أخبرنا ابن عون، عن مجاهد، أنه سمع ابن عباس  رضى الله عنهما  وذكروا له الدجال بين عينيه مكتوب كافر أو ك ف ر‏.‏ قال لم أسمعه ولكنه قال ‏\"‏ أما إبراهيم فانظروا إلى صاحبكم، وأما موسى فجعد آدم على جمل أحمر مخطوم بخلبة، كأني أنظر إليه انحدر في الوادي ‏\"‏‏.‏",
      "text_en": " Narrated Mujahid:                     That when the people mentioned before Ibn `Abbas that the Dajjal would have the word Kafir, (i.e. unbeliever) or the letters Kafir (the root of the Arabic verb 'disbelieve') written on his forehead, I heard Ibn `Abbas saying, \"I did not hear this, but the Prophet said, 'If you want to see Abraham, then look at your companion (i.e. the Prophet) but Moses was a curly-haired, brown man (who used to ride) a red camel, the reins of which was made of fires of date-palms. As if I were now looking down a valley.\"",
      "chain": [
        "30320",
        "20291",
        "11071",
        "11028",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}