{
  "id": "30322",
  "name": "Hiban bin Musa bin Sawar حبان بن موسى بن سوار",
  "full_name": "Hiban bin Musa bin Sawar حبان بن موسى بن سوار",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "233",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Mervazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20458",
      "name": "Muhammad bin Maymun, Abu Hamza محمد بن ميمون المروزي أبو حمزة السكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "38488",
      "name": "Muhammad bin Hatm bin N'ym محمد بن حاتم بن نعيم",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38554",
      "name": "Muhammad bin 'Ali bin al-Hasan محمد بن علي بن الحسن بن شقيق حلق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-838",
      "hadith_no": "838",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حبان بن موسى، قال أخبرنا عبد الله، قال أخبرنا معمر، عن الزهري، عن محمود بن الربيع، عن عتبان، قال صلينا مع النبي صلى الله عليه وسلم فسلمنا حين سلم‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     We prayed with the Prophet and used to finish our prayer with the Taslim along with him.",
      "usc_msa_ref": "800",
      "chain": [
        "30322",
        "20025",
        "20115",
        "11013",
        "5278"
      ]
    },
    {
      "id": "sahih-bukhari-2593",
      "hadith_no": "2593",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا أراد سفرا أقرع بين نسائه، فأيتهن خرج سهمها خرج بها معه، وكان يقسم لكل امرأة منهن يومها وليلتها، غير أن سودة بنت زمعة وهبت يومها وليلتها، لعائشة زوج النبي صلى الله عليه وسلم تبتغي بذلك رضا رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     Whenever Allah's Apostle wanted to go on a journey, he would draw lots as to which of his wives would accompany him. He would take her whose name came out. He used to fix for each of them a day and a night. But Sauda bint Zam`a gave up her (turn) day and night to `Aisha, the wife of the Prophet in order to seek the pleasure of Allah's Apostle (by that action).",
      "usc_msa_ref": "766",
      "chain": [
        "30322",
        "20025",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3071",
      "hadith_no": "3071",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، عن خالد بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد، قالت أتيت رسول الله صلى الله عليه وسلم مع أبي وعلى قميص أصفر، قال رسول الله صلى الله عليه وسلم ‏\"‏ سنه سنه ‏\"‏‏.‏ قال عبد الله وهى بالحبشية حسنة‏.‏ قالت فذهبت ألعب بخاتم النبوة، فزبرني أبي قال رسول الله صلى الله عليه وسلم ‏\"‏ دعها ‏\"‏‏.‏ ثم قال رسول الله ‏\"‏ أبلي وأخلفي، ثم أبلي وأخلفي، ثم أبلي وأخلفي ‏\"‏‏.‏ قال عبد الله فبقيت حتى ذكر‏.‏",
      "text_en": " Narrated Um Khalid:                     (the daughter of Khalid bin Sa`id) I went to Allah's Apostle with my father and I was Nearing a yellow shirt. Allah's Apostle said, \"Sanah, Sanah!\" (`Abdullah, the narrator, said that 'Sanah' meant 'good' in the Ethiopian language). I then started playing with the seal of Prophethood (in between the Prophet's shoulders) and my father rebuked me harshly for that. Allah's Apostle said. \"Leave her,\" and then Allah's Apostle (invoked Allah to grant me a long life) by saying (thrice), \"Wear this dress till it is worn out and then wear it till it is worn out, and then wear it till it is worn out.\" (The narrator adds, \"It is said that she lived for a long period, wearing that (yellow) dress till its color became dark because of long wear.\")",
      "usc_msa_ref": "305",
      "chain": [
        "30322",
        "20025",
        "20422",
        "11509",
        "740"
      ]
    },
    {
      "id": "sahih-bukhari-3099",
      "hadith_no": "3099",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا حبان بن موسى، ومحمد، قالا أخبرنا عبد الله، أخبرنا معمر، ويونس، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت لما ثقل رسول الله صلى الله عليه وسلم استأذن أزواجه أن يمرض في بيتي فأذن له‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) When the sickness of Allah's Apostle got aggravated, he asked the permission of his wives that he should be treated in my house, and they permitted him.",
      "usc_msa_ref": "331",
      "chain": [
        "30322",
        "30213",
        "20025",
        "20115",
        "20475",
        "11013",
        "11004",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4601",
      "hadith_no": "4601",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، قال حدثني سالم، عن أبيه، أنه سمع رسول الله صلى الله عليه وسلم إذا رفع رأسه من الركوع في الركعة الآخرة من الفجر يقول ‏\"‏ اللهم العن فلانا وفلانا وفلانا ‏\"‏‏.‏ بعد ما يقول ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏‏.‏ فأنزل الله ‏{‏ليس لك من الأمر شىء‏}‏ إلى قوله ‏{‏فإنهم ظالمون‏}‏‏.‏ رواه إسحاق بن راشد عن الزهري‏.‏",
      "text_en": " Narrated Salim's father:                     That he heard Allah's Apostle on raising his head from the bowing in the last rak`a in the Fajr prayer, saying, \"O Allah, curse such-and-such person and such-and-such person, and such-and-such person,\" after saying, \"Allah hears him who sends his praises to Him, O our Lord, all praise is for you.\" So Allah revealed:--\"Not for you (O Muhammad) (but for Allah) is the decision, verily they are indeed wrongdoers.\" (3.128)",
      "usc_msa_ref": "",
      "chain": [
        "30322",
        "20025",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4836",
      "hadith_no": "4836",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا عاصم الأحول، عن معاذة، عن عائشة  رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يستأذن في يوم المرأة منا بعد أن أنزلت هذه الآية ‏{‏ترجئ من تشاء منهن وتؤوي إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك‏}‏‏.‏ فقلت لها ما كنت تقولين قالت كنت أقول له إن كان ذاك إلى فإني لا أريد يا رسول الله أن أوثر عليك أحدا‏.‏ تابعه عباد بن عباد سمع عاصما‏.‏",
      "text_en": " Narrated Mu`adha:                     `Aisha said, \"Allah's Apostle used to take the permission of that wife with whom he was supposed to stay overnight if he wanted to go to one other than her, after this Verse was revealed:-- \"You (O Muhammad) can postpone (the turn of) whom you will of them (your wives) and you may receive any (of them) whom you will; and there is no blame on you if you invite one whose turn you have set aside (temporarily). (33.51) I asked Aisha, \"What did you use to say (in this case)?\" She said, \"I used to say to him, \"If I could deny you the permission (to go to your other wives) I would not allow your favor to be bestowed on any other person.\"",
      "usc_msa_ref": "312",
      "chain": [
        "30322",
        "20025",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5630",
      "hadith_no": "5630",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، قال أخبرني يونس، عن الزهري، قال حدثني أبو عبيد، مولى ابن أزهر أنه شهد العيد يوم الأضحى مع عمر بن الخطاب  رضى الله عنه  فصلى قبل الخطبة، ثم خطب الناس فقال يا أيها الناس إن رسول الله صلى الله عليه وسلم قد نهاكم عن صيام هذين العيدين، أما أحدهما فيوم فطركم من صيامكم وأما الآخر فيوم تأكلون نسككم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30322",
        "20025",
        "20475",
        "11013"
      ]
    },
    {
      "id": "sahih-bukhari-5751",
      "hadith_no": "5751",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا يونس بن يزيد، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة  رضى الله عنها  أنها كانت تأمر بالتلبين للمريض وللمحزون على الهالك، وكانت تقول إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن التلبينة تجم فؤاد المريض، وتذهب ببعض الحزن ‏\"‏‏.‏",
      "text_en": " Narrated 'Ursa:                     Aisha used to recommend at-Talbina for the sick and for such a person as grieved over a dead person. She used to say, \"I heard Allah's Apostle saying, 'at-Talbina gives rest to the heart of the patient and makes it active and relieves some of his sorrow and grief.' \"",
      "usc_msa_ref": "593",
      "chain": [
        "30322",
        "20025",
        "20475",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5976",
      "hadith_no": "5976",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني حبان بن موسى، وأحمد بن محمد، قالا أخبرنا عبد الله، أخبرنا يونس، عن الزهري، عن سالم، عن ابن عمر  رضى الله عنهما  قال سمعت رسول الله صلى الله عليه وسلم يهل ملبدا يقول ‏\"‏ لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏‏.‏ لا يزيد على هؤلاء الكلمات‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard Allah's Apostle, while he was in the state of lhram and his hair was stuck together with gum, saying, \"Labbaik, Allahumma Labbaik, Labbaik La Shanka laka Labbaik. Inn-al-Hamda Wan-Ni'mata Laka wal-Mulk, La Shanka Lak.\" He did not add anything to those words. (See Hadith No. 621, Vol. 2)",
      "usc_msa_ref": "797",
      "chain": [
        "30322",
        "30304",
        "20025",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6151",
      "hadith_no": "6151",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  أن رفاعة، القرظي طلق امرأته فبت طلاقها، فتزوجها بعده عبد الرحمن بن الزبير، فجاءت النبي صلى الله عليه وسلم فقالت يا رسول الله إنها كانت عند رفاعة فطلقها آخر ثلاث تطليقات، فتزوجها بعده عبد الرحمن بن الزبير، وإنه والله ما معه يا رسول الله إلا مثل هذه الهدبة، لهدبة أخذتها من جلبابها‏.‏ قال وأبو بكر جالس عند النبي صلى الله عليه وسلم وابن سعيد بن العاص جالس بباب الحجرة ليؤذن له، فطفق خالد ينادي أبا بكر، يا أبا بكر ألا تزجر هذه عما تجهر به عند رسول الله صلى الله عليه وسلم وما يزيد رسول الله صلى الله عليه وسلم على التبسم ثم قال ‏\"‏ لعلك تريدين أن ترجعي إلى رفاعة، لا، حتى تذوقي عسيلته، ويذوق عسيلتك ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Rifa`a Al-Qurazi divorced his wife irrevocably (i.e. that divorce was the final). Later on `Abdur- Rahman bin Az-Zubair married her after him. She came to the Prophet and said, \"O Allah's Apostle! I was Rifa`a's wife and he divorced me thrice, and then I was married to `Abdur-Rahman bin AzZubair, who, by Allah has nothing with him except something like this fringe, O Allah's Apostle,\" showing a fringe she had taken from her covering sheet. Abu Bakr was sitting with the Prophet while Khalid Ibn Sa`id bin Al-As was sitting at the gate of the room waiting for admission. Khalid started calling Abu Bakr, \"O Abu Bakr! Why don't you reprove this lady from what she is openly saying before Allah's Apostle?\" Allah's Apostle did nothing except smiling, and then said (to the lady), \"Perhaps you want to go back to Rifa`a? No, (it is not possible), unless and until you enjoy the sexual relation with him (`Abdur Rahman), and he enjoys the sexual relation with you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30322",
        "20025",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6683",
      "hadith_no": "6683",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني عبد الله بن محيريز الجمحي، أن أبا سعيد الخدري، أخبره أنه، بينما هو جالس عند النبي صلى الله عليه وسلم جاء رجل من الأنصار فقال يا رسول الله إنا نصيب سبيا ونحب المال، كيف ترى في العزل فقال رسول الله صلى الله عليه وسلم ‏\"‏ أوإنكم تفعلون ذلك، لا عليكم أن لا تفعلوا، فإنه ليست نسمة كتب الله أن تخرج إلا هي كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     That while he was sitting with the Prophet a man from the Ansar came and said, \"O Allah's Apostle! We get slave girls from the war captives and we love property; what do you think about coitus interruptus?\" Allah's Apostle said, \"Do you do that? It is better for you not to do it, for there is no soul which Allah has ordained to come into existence but will be created.\"",
      "usc_msa_ref": "600",
      "chain": [
        "30322",
        "20025",
        "20475",
        "11013",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-6686",
      "hadith_no": "6686",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  قال شهدنا مع رسول الله صلى الله عليه وسلم خيبر فقال رسول الله صلى الله عليه وسلم لرجل ممن معه يدعي الإسلام ‏\"‏ هذا من أهل النار ‏\"‏‏.‏ فلما حضر القتال قاتل الرجل من أشد القتال، وكثرت به الجراح فأثبتته، فجاء رجل من أصحاب النبي صلى الله عليه وسلم فقال يا رسول الله أرأيت الذي تحدثت أنه من أهل النار قد قاتل في سبيل الله من أشد القتال، فكثرت به الجراح‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما إنه من أهل النار ‏\"‏‏.‏ فكاد بعض المسلمين يرتاب فبينما هو على ذلك إذ وجد الرجل ألم الجراح فأهوى بيده إلى كنانته، فانتزع منها سهما فانتحر بها، فاشتد رجال من المسلمين إلى رسول الله صلى الله عليه وسلم فقالوا يا رسول الله صدق الله حديثك، قد انتحر فلان فقتل نفسه‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فأذن، لا يدخل الجنة إلا مؤمن، وإن الله ليؤيد هذا الدين بالرجل الفاجر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     We witnessed along with Allah's Apostle the Khaibar (campaign). Allah's Apostle told his companions about a man who claimed to be a Muslim, \"This man is from the people of the Fire.\" When the battle started, the man fought very bravely and received a great number of wounds and got crippled. On that, a man from among the companions of the Prophet came and said, \"O Allah's Apostle! Do you know what the man you described as of the people of the Fire has done? He has fought very bravely for Allah's Cause and he has received many wounds.\" The Prophet said, \"But he is indeed one of the people of the Fire.\" Some of the Muslims were about to have some doubt about that statement. So while the man was in that state, the pain caused by the wounds troubled him so much that he put his hand into his quiver and took out an arrow and committed suicide with it. Off went some men from among the Muslims to Allah's Apostle and said, \"O Allah's Apostle! Allah has made your statement true. So-and-so has committed suicide.\" Allah's Apostle said, \"O Bilal! Get up and announce in public: None will enter Paradise but a believer, and Allah may support this religion (Islam) with a wicked man.\"",
      "usc_msa_ref": "603",
      "chain": [
        "30322",
        "20025",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7196",
      "hadith_no": "7196",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله بن المبارك، أخبرنا يونس بن يزيد، الأيلي ح وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن رافع، وعبد بن حميد، قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، والسياق، حديث معمر من رواية عبد وابن رافع قال يونس ومعمر جميعا عن الزهري أخبرني سعيد بن المسيب وعروة بن الزبير وعلقمة بن وقاص وعبيد الله بن عبد الله بن عتبة بن مسعود عن حديث عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله مما قالوا وكلهم حدثني طائفة من حديثها وبعضهم كان أوعى لحديثها من بعض وأثبت اقتصاصا وقد وعيت عن كل واحد منهم الحديث الذي حدثني وبعض حديثهم يصدق بعضا ذكروا أن عائشة زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج سفرا أقرع بين نسائه فأيتهن خرج سهمها خرج بها رسول الله صلى الله عليه وسلم معه - قالت عائشة - فأقرع بيننا في غزوة غزاها فخرج فيها سهمي فخرجت مع رسول الله صلى الله عليه وسلم وذلك بعد ما أنزل الحجاب فأنا أحمل في هودجي وأنزل فيه مسيرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوه وقفل ودنونا من المدينة آذن ليلة بالرحيل فقمت حين آذنوا بالرحيل فمشيت حتى جاوزت الجيش فلما قضيت من شأني أقبلت إلى الرحل فلمست صدري فإذا عقدي من جزع ظفار قد انقطع فرجعت فالتمست عقدي فحبسني ابتغاؤه وأقبل الرهط الذين كانوا يرحلون لي فحملوا هودجي فرحلوه على بعيري الذي كنت أركب وهم يحسبون أني فيه - قالت - وكانت النساء إذ ذاك خفافا لم يهبلن ولم يغشهن اللحم إنما يأكلن العلقة من الطعام فلم يستنكر القوم ثقل الهودج حين رحلوه ورفعوه وكنت جارية حديثة السن فبعثوا الجمل وساروا ووجدت عقدي بعد ما استمر الجيش فجئت منازلهم وليس بها داع ولا مجيب فتيممت منزلي الذي كنت فيه وظننت أن القوم سيفقدوني فيرجعون إلى فبينا أنا جالسة في منزلي غلبتني عيني فنمت وكان صفوان بن المعطل السلمي ثم الذكواني قد عرس من وراء الجيش فادلج فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني فعرفني حين رآني وقد كان يراني قبل أن يضرب الحجاب على فاستيقظت باسترجاعه حين عرفني فخمرت وجهي بجلبابي ووالله ما يكلمني كلمة ولا سمعت منه كلمة غير استرجاعه حتى أناخ راحلته فوطئ على يدها فركبتها فانطلق يقود بي الراحلة حتى أتينا الجيش بعد ما نزلوا موغرين في نحر الظهيرة فهلك من هلك في شأني وكان الذي تولى كبره عبد الله بن أبى ابن سلول فقدمنا المدينة فاشتكيت حين قدمنا المدينة شهرا والناس يفيضون في قول أهل الإفك ولا أشعر بشىء من ذلك وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي إنما يدخل رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏ ‏.‏ فذاك يريبني ولا أشعر بالشر حتى خرجت بعد ما نقهت وخرجت معي أم مسطح قبل المناصع وهو متبرزنا ولا نخرج إلا ليلا إلى ليل وذلك قبل أن نتخذ الكنف قريبا من بيوتنا وأمرنا أمر العرب الأول في التنزه وكنا نتأذى بالكنف أن نتخذها عند بيوتنا فانطلقت أنا وأم مسطح وهي بنت أبي رهم بن المطلب بن عبد مناف وأمها ابنة صخر بن عامر خالة أبي بكر الصديق وابنها مسطح بن أثاثة بن عباد بن المطلب فأقبلت أنا وبنت أبي رهم قبل بيتي حين فرغنا من شأننا فعثرت أم مسطح في مرطها فقالت تعس مسطح ‏.‏ فقلت لها بئس ما قلت أتسبين رجلا قد شهد بدرا ‏.‏ قالت أى هنتاه أولم تسمعي ما قال قلت وماذا قال قالت فأخبرتني بقول أهل الإفك فازددت مرضا إلى مرضي فلما رجعت إلى بيتي فدخل على رسول الله صلى الله عليه وسلم فسلم ثم قال ‏\"‏ كيف تيكم ‏\"‏ ‏.‏ قلت أتأذن لي أن آتي أبوى قالت وأنا حينئذ أريد أن أتيقن الخبر من قبلهما ‏.‏ فأذن لي رسول الله صلى الله عليه وسلم فجئت أبوى فقلت لأمي يا أمتاه ما يتحدث الناس فقالت يا بنية هوني عليك فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا كثرن عليها - قالت - قلت سبحان الله وقد تحدث الناس بهذا قالت فبكيت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم ثم أصبحت أبكي ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يستشيرهما في فراق أهله - قالت - فأما أسامة بن زيد فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله وبالذي يعلم في نفسه لهم من الود فقال يا رسول الله هم أهلك ولا نعلم إلا خيرا ‏.‏ وأما علي بن أبي طالب فقال لم يضيق الله عليك والنساء سواها كثير وإن تسأل الجارية تصدقك - قالت - فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة هل رأيت من شىء يريبك من عائشة ‏\"‏ ‏.‏ قالت له بريرة والذي بعثك بالحق إن رأيت عليها أمرا قط أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن عجين أهلها فتأتي الداجن فتأكله - قالت - فقام رسول الله صلى الله عليه وسلم على المنبر فاستعذر من عبد الله بن أبى ابن سلول - قالت - فقال رسول الله صلى الله عليه وسلم وهو على المنبر ‏\"‏ يا معشر المسلمين من يعذرني من رجل قد بلغ أذاه في أهل بيتي فوالله ما علمت على أهلي إلا خيرا ولقد ذكروا رجلا ما علمت عليه إلا خيرا وما كان يدخل على أهلي إلا معي ‏\"‏ ‏.‏ فقام سعد بن معاذ الأنصاري فقال أنا أعذرك منه يا رسول الله إن كان من الأوس ضربنا عنقه وإن كان من إخواننا الخزرج أمرتنا ففعلنا أمرك - قالت - فقام سعد بن عبادة وهو سيد الخزرج وكان رجلا صالحا ولكن اجتهلته الحمية فقال لسعد بن معاذ كذبت لعمر الله لا تقتله ولا تقدر على قتله ‏.‏ فقام أسيد بن حضير وهو ابن عم سعد بن معاذ فقال لسعد بن عبادة كذبت لعمر الله لنقتلنه فإنك منافق تجادل عن المنافقين فثار الحيان الأوس والخزرج حتى هموا أن يقتتلوا ورسول الله صلى الله عليه وسلم قائم على المنبر فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت - قالت - وبكيت يومي ذلك لا يرقأ لي دمع ولا أكتحل بنوم ثم بكيت ليلتي المقبلة لا يرقأ لي دمع ولا أكتحل بنوم وأبواى يظنان أن البكاء فالق كبدي فبينما هما جالسان عندي وأنا أبكي استأذنت على امرأة من الأنصار فأذنت لها فجلست تبكي - قالت - فبينا نحن على ذلك دخل علينا رسول الله صلى الله عليه وسلم فسلم ثم جلس - قالت - ولم يجلس عندي منذ قيل لي ما قيل وقد لبث شهرا لا يوحى إليه في شأني بشىء - قالت - فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد يا عائشة فإنه قد بلغني عنك كذا وكذا فإن كنت بريئة فسيبرئك الله وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه فإن العبد إذا اعترف بذنب ثم تاب تاب الله عليه ‏\"‏ ‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة فقلت لأبي أجب عني رسول الله صلى الله عليه وسلم فيما قال ‏.‏ فقال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت لأمي أجيبي عني رسول الله صلى الله عليه وسلم فقالت والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن إني والله لقد عرفت أنكم قد سمعتم بهذا حتى استقر في نفوسكم وصدقتم به فإن قلت لكم إني بريئة والله يعلم أني بريئة لا تصدقوني بذلك ولئن اعترفت لكم بأمر والله يعلم أني بريئة لتصدقونني وإني والله ما أجد لي ولكم مثلا إلا كما قال أبو يوسف فصبر جميل والله المستعان على ما تصفون ‏.‏ قالت ثم تحولت فاضطجعت على فراشي - قالت - وأنا والله حينئذ أعلم أني بريئة وأن الله مبرئي ببراءتي ولكن والله ما كنت أظن أن ينزل في شأني وحى يتلى ولشأني كان أحقر في نفسي من أن يتكلم الله عز وجل في بأمر يتلى ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها قالت فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه ولا خرج من أهل البيت أحد حتى أنزل الله عز وجل على نبيه صلى الله عليه وسلم فأخذه ما كان يأخذه من البرحاء عند الوحى حتى إنه ليتحدر منه مثل الجمان من العرق في اليوم الشات من ثقل القول الذي أنزل عليه - قالت - فلما سري عن رسول الله صلى الله عليه وسلم وهو يضحك فكان أول كلمة تكلم بها أن قال ‏\"‏ أبشري يا عائشة أما الله فقد برأك ‏\"‏ ‏.‏ فقالت لي أمي قومي إليه فقلت والله لا أقوم إليه ولا أحمد إلا الله هو الذي أنزل براءتي - قالت - فأنزل الله عز وجل ‏{‏ إن الذين جاءوا بالإفك عصبة منكم‏}‏ عشر آيات فأنزل الله عز وجل هؤلاء الآيات براءتي - قالت - فقال أبو بكر وكان ينفق على مسطح لقرابته منه وفقره والله لا أنفق عليه شيئا أبدا بعد الذي قال لعائشة ‏.‏ فأنزل الله عز وجل ‏{‏ ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ إلى قوله ‏{‏ ألا تحبون أن يغفر الله لكم‏}‏ قال حبان بن موسى قال عبد الله بن المبارك هذه أرجى آية في كتاب الله ‏.‏ فقال أبو بكر والله إني لأحب أن يغفر الله لي ‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال لا أنزعها منه أبدا ‏.‏ قالت عائشة وكان رسول الله صلى الله عليه وسلم سأل زينب بنت جحش زوج النبي صلى الله عليه وسلم عن أمري ‏\"‏ ما علمت أو ما رأيت ‏\"‏ ‏.‏ فقالت يا رسول الله أحمي سمعي وبصري والله ما علمت إلا خيرا ‏.‏ قالت عائشة وهي التي كانت تساميني من أزواج النبي صلى الله عليه وسلم فعصمها الله بالورع وطفقت أختها حمنة بنت جحش تحارب لها فهلكت فيمن هلك ‏.‏ قال الزهري فهذا ما انتهى إلينا من أمر هؤلاء الرهط ‏.‏ وقال في حديث يونس احتملته الحمية ‏.‏",
      "text_en": " Sa'id b. Musayyib, 'Urwa b. Zubair, 'Alqama b. Waqqas and 'Ubaidullah b. Abdullah b. 'Utba b. Mas'ud--all of them reported the story of the false allegation against 'A'isha, the wife of Allah's Apostle (may peace be upon him). And they (the slanderers) said what they had to say, but Allah exonerated her of this charge and all of them reported a part of the hadith and some of them who had better memories reported more and with better retention, and I tried to retain this hadith (listening) from every one of them that they reported to me and some of them attested the other. (The sumaried substance of the false allegation is this):                      'A'isha said: Whenever Allah's Messenger (may peace be upon him) intended to set out on a journey he cast lots amongst his wives and he took one with him in whose favour the lot was cast. It so happened that he cast lots amongst us while setting out on a battle and it was cast in my favour, so I set out along with Allah's Messenger (may peace be upon him). This relates to the period when the revelation concerning the commands of veil had been made. I was carried in a haudaj and I was brought down where we had to stay. In short, when we set out for return journey from the expedition and our caravan was near Medina, Allah's Messenger (may peace be upon him) commanded one night to march forward. I also got up when the command for the march was given and moved on until I went out of the encampments of the army and after relieving myself I came to my place. I touched my chest and found that my necklace which had been made of the stones of zafar had been broken. I retraced my steps and tried to search my necklace and this detained me there. The group of people who saddled my ride and placed my haudaj carrying me upon the camels marched on. They were under the impression that I was in it. The women in those days were light of weight and they did not wear much flesh, as they ate less food; so they did not perceive the weight of my haudaj as they placed it upon the camel as I was a young girl at that time. So they drove the camel and Eet out and I found my necklace after the army had marched. I came to my place and there was none to call and none to respond (the call). I waited at my place under the impression that when the people would riot find me they would come back. So I kept sitting at my place. I was overpowered by sleep and slept. Safwan b. Mu'attal Sulami Dhakwini, who had lagged behind the army because of taking rest came to my place walking in the latter part of the night and he saw the body of a person who was asleep. He came to me and recognised me as he had seen rue before it was enjoined to observe purda. I got ap by his voice as he recited Inna lillahi wa inna ilaihi raji'un [we are for Allah and to Him we have to return. ] and I covered my head with my headdress. By Allah, he did not speak to me a word and I did not hear a word from him except Inna lillahi. He made his camel kneel down and I amounted the camel as he pressed tLe camel's foreleg and he moved on leaning the camel by the nose string on which I was riding until we came to the army where it had encamped for rest because of extreme heat. Woe be upon those who harboured doubts about me and the most notorious among them was 'Abdullah b. Ubayy, the great hypocrite. We came to Medina and I fell sick for a month. The people had been deliberating over the statements of those who had brought these calumnies against me. I was absolutely unaware of anything concerning that. This, however, caused doubt in my mind that I did not see Allah's Messenger (may peace be upon him.) treating me with such kindness with which he treated me as I fell ill before this. The Holy Prophet (may peace be upon him) would coome and greet me with Assalam-o-'Alaikum and only ask me how I was. This caused doubt in my mind, but I was unaware of the evil. I wept outside despite my failing health and there went along with me Umm Mistah and she said the daughter of Abu Rhm b. Muttalib b. 'Abd Manaf and his mother was the daughter of Sakhr b. 'Amir, the sister of the mother of Abu Bakr Sidiq and his son was Mistah b. Uthatha b. 'Abbad b. Muttalib. I and the daughter of Abu Rahm set towards the direction of my house. Something got into the head dress of Umm Mistah and she said: Woe be upon Mistah. And I said. Woe be upon what you say. Do you curse people who had participated in Badr? She said: Innocent woman, have you not heard what he said? I said: What did he say? She conveyed to me the statement of those who had brought false allegations against me. So my illness was aggravated. I went to my house and Allah's Messenger (may peace be upon him) came to me and he greeted me and then said: How is that woman? I said: Do you permit me to go to the (house) of my parents? She (further) said: I had at that time made up my mind to confirm this news from them. Allah's Messenger (may peace be upon him) permitted me. So I came to (the house of) my parents and said to my mother: Mother, do you know what the people are talking about? She said: My daughter, you should not worry. By Allah, if there is a handsome woman who is loved by her husband and he has co-wives also they talk many a thing about her. I said: Hallowed be Allah, what are the people talking about? I wept during the whole night until it was morning and I did not have a wink of sleep and I wept even in the morning. As the revelation was delayed (in regard to this matter), so Allah's Messenger (may peace be upon him) called 'Ali ibn Abi 'Talib and Usama b. Zaid in order to seek their advice in regard to the separation of his wife. Usama b. Zaid told Allah's Messenger (may peace be apen him) about the innocence of his wives and what he knew about his love for them. He said: Allah's Messenger, they are your wives and we know nothing else about thembut goodness. And as for 'Ali b. Abu Talib, he said: Allah has not put any unnecessary burden upon you (in regard to your wives). There are a number of women besides her and if you ask that maidservant (Barira) she will tell you the truth. So, Allah's Messenger (may peace be upon him) called Bailra and said: Barira, did you see anything in 'A'isha which can cause doubt about her? Barira said: By Him Who sent thee with the truth, I have seen nothing objectionable in her but only this much that she is a young girl and she goes to sleep while kneading the flour and the lamb eats that. Thereupon Allah's Messenger (may peace be upon him) mounted the pulpit and sought vindication against 'Abdullah b. Ubayy b. Salul, and he further said: Who would exonerate me from imputations of that person who has troubled (me) in regard to my family? By Allah, I find nothing in my wife but goodness and the person whom the people have mentioned in this connection is, according to my knowledge, a thoroughly pious person, and he did never get into my house but along with me. Sa'd b. Mu'adh stood up and said: Allah's Messenger, I defend your honour against him. If he belong to the tribe of Aus we would strike his neck and if he belongs to the tribe of our brother Khazraj and you order us we would comply with your order. Then Sa'd b. 'Ubada stood up. He was chief of the Khazraj tribe. He was otherwise a pioas man but he had some what tribal partisanship in him and he said to Sa'd b. Mu'adh: By the everlasting existence of Allah. you are not stating the fact, you will not be able to kill him and you will not have the power to do so. Thereupon, Usaid b. Hudair stood up, and he was the first cousin of Sa'd b. Mu'adh and said to Sa'd b. 'Ubada: By the everlasting existence of Allah, you are not stating the fact. We would kill him. You are a hypocrite and so you argue in defence of the hypocrites, and thus both the tribes Aus and Khazraj were flared up, until they were about to fall upon one another and Allah's Messenger (may peace be upon him) kept standing upon the pulpit and Allah's Messenger (may peace be upon him) tried to subside their anger until they became silent and thus there was silence. 'A'isha further reported: I spent the whole day in weeping and even the night and could not have a wink of sleep even next night. My parents thought that this constant weeping of mine would break my heart. I wept and they sat beside me. In the meanwhile a woman of the Ansar came to see me. I permitted her to see me and she also began to weep. And we were in this very state that Allah's Messenger (may peace be upon him) came and he greeted me and then sat down. He had never sat with me since a month when this rumour was afloat, and there was no revelation (to clarity) my case. Allah's Messenger (may peace be upon him) recited Tashahhud (there is no god but Allah and Muhammad is His Apostle) and then said: Coming to the point, 'A'isha, this is what has reached me about you and if you are innocent, Allah would Himself vindicate your honour, and if accidentally there has been a lapse on your part sock forgiveness of Allah; He will pardon thee for when a servant makes a confession of his fault and turns (to Him) penitently, Allah also turns to him (mercifully) accepting his repentance. When Allah's Messenger (may peace be upon him) talked, my tears dried up and not even a single drop of tear was perceived by me (rolling out of my eyes). I said to my father: You give a reply to Allah's Messenger (may peace be upon him) on my behalf. He said: By Allah, I do not know what I should say to Allah's Messenger (may peace be upon him). I then said to my mother: Give a reply to Allah's Messenger (may peace be upon him) on my behalf, but she said: By Allah, I do not know what I should say to Allah's Messenger (may peace be upon him). I was a small girl at that time and I had not read much of the Qur'an (but I said): By Allah, I perceive that you have heard about this and it has settled down in your mind and you have taken it to be true, so if I say to you that I am quite innocent, and Allah knows that I am innocent, you would never believe me to be true, and if I confess to (the alleged) lapse before you, whereas Allah knows that I am completely innocent (and I have not committed this sin at all), in that case You will take me to be true and, by Allah, I, therefore, find no other alternative for me and for you except that what the father of Yousuf said:, (My course is) comely patience. And Allah it is Whose help is to be sought for in that (predicament) which ye describe\" (xii 18). After this I turned my face to the other side and lay down on my bed. By Allah, I was fully aware of this fact that I was innocent but I did not expect that Allah would descend Wahy Matlu (Qur'anic Wahy) in my case as I did not think myself so much important that Allah, the Exalted and Glorious, would speak in this matter in words to be recited. I only hoped that Allah would in vision give an indication of my innocence to Allah's Messenger (may peace be upon him) during his sleep. And, by Allah, Allah's Messenger (may peace be upon him) had not moved an inch from where he had been sitting and none from the members of my family had gone that Allah, the Exalted and Glorious, descended revelation upon Allah's Messenger (may peace be upon him) there and then and he felt the burden which he used to feel at the time of receiving revelation. He began to perspire because of the burden of words of Allah as they descended upon him even during the winter season and there fell the drops of his sweat like silvery beads. When this state of receiving revelation was over, the Messenger of Allah (may peace be upon him) smiled and the first words which he spoke to me were that he said: 'A'isha, there is glad tidings for you. Verily, Allah has vindicated your honour, and my mother who had been standing by me said: Get up (and thank him, i. e. the Holy Prophet). I said: By Allah, I shall not thank him and laud him but Allah Who has descended revelation vindicating my honour. She ('A'isha) said: Allah, the Exalted and Glorious, revealed:\" 'Verily, those who spread the slander are a gang among you\" (and) ten (subsequent) verses in regard to my innocence. She further said: Abu Bakr used to give to Mistah (some stipend) as a token of kinship with him and for his poverty and he (Abu Bakr) said: By Allah, now I would not spend anything for him. 'A'isha said: It was upon this that Allah the Exalted and Glorious revealed this verse:\" And let not those who possess dignity and ease among you swear to give to the near of the kin\" up to\" Yearn ye not that Allah may forgive you?\" Hibban b. Musa' said that 'Abdullah b. Mubarak used to say: It is a verse contained in the Book which most (eminently) brightens the hope. Abu Bakr said: By Allah, I wish that Allah should pardon me. I shall never stop this stipend. So he continued to give him the stipend which he had withdrawn. 'A'isha said that Allah's Messenger (way peace be upon him) asked Zainab, daughter of Jahsh, the wife of Allah's Apostle (may peace be upon him), about me what she knew or what she had seen in me, and she said: Allah's Messenger, I shall not say anything without hearing (with my ears) and seeing with my eyes. By Allah, I find nothing in her but goodness. (And she stated this in spite of the fact) that she was the only lady who amongst the wives of Allah's Apostle (may peace be upon him) used to vie with me but Allah saved her in bringing false allegation against me because of her God-consciousness. Her sister Hamna bint Jahsh, however, opposed her and she was undone along with others.",
      "usc_msa_ref": "",
      "chain": [
        "30322",
        "20025",
        "20475",
        "30021",
        "30375",
        "30553",
        "20121",
        "20115",
        "11013"
      ]
    },
    {
      "id": "sunan-an-nasai-2105",
      "hadith_no": "2105",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان بن موسى، - خراساني - قال أنبأنا عبد الله، عن معمر، عن الزهري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دخل رمضان فتحت أبواب الرحمة وغلقت أبواب جهنم وسلسلت الشياطين ‏\"‏ ‏.‏",
      "text_en": " It was narrated Az-Zuhri, from Abu Hurairah that the Prophet said:                     \"When Ramadan begins, the gates of mercy are opened and the gates of Hall are closed, and the devils are chained up.\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "30322",
        "20025",
        "20115",
        "11013",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2115",
      "hadith_no": "2115",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، - مصيصي - قال أنبأنا حبان بن موسى المروزي، قال أنبأنا عبد الله، عن سفيان، عن سماك، عن عكرمة، مرسل ‏.‏",
      "text_en": " Narrated 'Ikramah:                     A similar, Mursal, report was narrated from 'Ikrimah.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "30322",
        "20025",
        "20012",
        "10770"
      ]
    },
    {
      "id": "sunan-an-nasai-4916",
      "hadith_no": "4916",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان بن موسى، قال حدثنا عبد الله، عن يونس، عن الزهري، قال قالت عمرة عن عائشة، رضى الله عنها عن رسول الله صلى الله عليه وسلم ‏\"‏ تقطع يد السارق في ربع دينار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Az-Zuhri said:                     \"Amrah said, narrating from 'Aishah, may Allah be pleased with her, that the Messenger of Allah cut off the hand of a thief for a quarter of a Dinar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "30322",
        "20025",
        "20475",
        "11013",
        "11455",
        "53"
      ]
    }
  ],
  "total_hadiths": 16
}