{
  "id": "30333",
  "name": "Khalid bin Khly خالد بن خلي",
  "full_name": "Khalid bin Khly خالد بن خلي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  س  -  صدوق ]"
    ],
    "tags": [
      "al-Kula'i",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30373",
      "name": "Muhammad bin Harb al-Wasti محمد بن حرب بن حرمان النشائي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "28220",
      "name": "Salmah bin 'Abdul Malik سلمة بن عبد الملك العوصي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20456",
      "name": "Muhammad bin Humayr bin Anis محمد بن حمير بن أنيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38467",
      "name": "abu Umayya, Muhammad bin Ibrahim محمد بن إبراهيم أبو أمية الطرسوسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38437",
      "name": "'Imran bin Bakar al-Kula'i عمران بن بكار الكلاعي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-78",
      "hadith_no": "78",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو القاسم، خالد بن خلي قال حدثنا محمد بن حرب، قال قال الأوزاعي أخبرنا الزهري، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس، أنه تمارى هو والحر بن قيس بن حصن الفزاري في صاحب موسى، فمر بهما أبى بن كعب، فدعاه ابن عباس فقال إني تماريت أنا وصاحبي هذا في صاحب موسى الذي سأل السبيل إلى لقيه، هل سمعت رسول الله صلى الله عليه وسلم يذكر شأنه فقال أبى نعم، سمعت النبي صلى الله عليه وسلم يذكر شأنه يقول ‏\"‏ بينما موسى في ملإ من بني إسرائيل، إذ جاءه رجل فقال أتعلم أحدا أعلم منك قال موسى لا‏.‏ فأوحى الله عز وجل إلى موسى بلى، عبدنا خضر، فسأل السبيل إلى لقيه، فجعل الله له الحوت آية، وقيل له إذا فقدت الحوت فارجع، فإنك ستلقاه، فكان موسى صلى الله عليه وسلم يتبع أثر الحوت في البحر‏.‏ فقال فتى موسى لموسى أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره‏.‏ قال موسى ذلك ما كنا نبغي‏.‏ فارتدا على آثارهما قصصا، فوجدا خضرا، فكان من شأنهما ما قص الله في كتابه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     that he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of the Prophet Moses. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend (Hur) and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Apostle mentioning something about him? Ubai bin Ka`b said: \"Yes, I heard the Prophet mentioning something about him (saying) while Moses was sitting in the company of some Israelites, a man came and asked him: \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: '--Yes, Our slave Khadir is more learned than you. Moses asked Allah how to meet him (Al-Khadir). So Allah made the fish a sign for him and he was told when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said: 'Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said, 'That is what we have been seeking.' So they went back retracing their footsteps, and found Khadir. (and) what happened further about them is narrated in the Holy Qur'an by Allah.\" (18.54 up to 18.82)",
      "usc_msa_ref": "78",
      "chain": [
        "30333",
        "30373",
        "20024",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7082",
      "hadith_no": "7082",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا خالد بن خلي، حدثنا محمد بن حرب، حدثني الزبيدي، عن الزهري، قال أبو سلمة قال أبو قتادة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ من رآني فقد رأى الحق ‏\"‏‏.‏ تابعه يونس وابن أخي الزهري",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Whoever sees me (in a dream) then he indeed has seen the truth .\"",
      "usc_msa_ref": "125",
      "chain": [
        "30333",
        "30373",
        "20459",
        "11013",
        "10567",
        "391"
      ]
    }
  ],
  "total_hadiths": 2
}