{
  "id": "30335",
  "name": "al-Rabi' bin Nafi' Abu Tawba al-Halbi الربيع بن نافع أبو توبة الحلبي",
  "full_name": "al-Rabi' bin Nafi' Abu Tawba al-Halbi الربيع بن نافع أبو توبة الحلبي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Halb",
      "Tursus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Halbi",
      "Tursus"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28102",
      "name": "al-Hasan bin 'Umar/'Amr الحسن بن عمر - أبو المليح الرقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20744",
      "name": "al-Hythm bin Hameed al-Ghsany الهيثم بن حميد الغساني مولاهم أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15646",
      "name": "Yazid bin al-Mqdam bin Shryh يزيد بن المقدام بن شريح",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20445",
      "name": "'Ubaidullah bin 'Amr bin Abi Walid عبيد الله بن عمرو بن أبي الوليد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20503",
      "name": "Sa'id bin 'Abdur Rahman bin 'Abdullah سعيد بن عبد الرحمن بن عبد الله بن حميل",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5321",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني الحسن بن صباح، سمع الربيع بن نافع، حدثنا معاوية، عن يحيى بن أبي كثير، عن يعلى بن حكيم، عن سعيد بن جبير، أنه أخبره أنه، سمع ابن عباس، يقول إذا حرم امرأته ليس بشىء‏.‏ وقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏",
      "text_en": " Narrated Sa`id bin Jubair:                     that he heard Ibn `Abbas saying, \"If a man makes his wife unlawful for him, it does not mean that she is divorced.\" He added, \"Indeed in the Apostle of Allah , you have a good example to follow.\"",
      "chain": [
        "30244",
        "30335",
        "27",
        "11449",
        "11567",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني الحسن بن علي الحلواني، حدثنا أبو توبة، - وهو الربيع بن نافع - حدثنا معاوية، - يعني ابن سلام - عن زيد، - يعني أخاه - أنه سمع أبا سلام، قال حدثني أبو أسماء الرحبي، أن ثوبان، مولى رسول الله صلى الله عليه وسلم حدثه قال كنت قائما عند رسول الله صلى الله عليه وسلم فجاء حبر من أحبار اليهود فقال السلام عليك يا محمد ‏.‏ فدفعته دفعة كاد يصرع منها فقال لم تدفعني فقلت ألا تقول يا رسول الله ‏.‏ فقال اليهودي إنما ندعوه باسمه الذي سماه به أهله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن اسمي محمد الذي سماني به أهلي ‏\"‏ ‏.‏ فقال اليهودي جئت أسألك ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أينفعك شىء إن حدثتك ‏\"‏ ‏.‏ قال أسمع بأذنى فنكت رسول الله صلى الله عليه وسلم بعود معه ‏.‏ فقال ‏\"‏ سل ‏\"‏ ‏.‏ فقال اليهودي أين يكون الناس يوم تبدل الأرض غير الأرض والسموات فقال رسول الله صلى الله عليه وسلم ‏\"‏ هم في الظلمة دون الجسر ‏\"‏ ‏.‏ قال فمن أول الناس إجازة قال ‏\"‏ فقراء المهاجرين ‏\"‏ ‏.‏ قال اليهودي فما تحفتهم حين يدخلون الجنة قال ‏\"‏ زيادة كبد النون ‏\"‏ قال فما غذاؤهم على إثرها قال ‏\"‏ ينحر لهم ثور الجنة الذي كان يأكل من أطرافها ‏\"‏ ‏.‏ قال فما شرابهم عليه قال ‏\"‏ من عين فيها تسمى سلسبيلا ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال وجئت أسألك عن شىء لا يعلمه أحد من أهل الأرض إلا نبي أو رجل أو رجلان ‏.‏ قال ‏\"‏ ينفعك إن حدثتك ‏\"‏ ‏.‏ قال أسمع بأذنى ‏.‏ قال جئت أسألك عن الولد قال ‏\"‏ ماء الرجل أبيض وماء المرأة أصفر فإذا اجتمعا فعلا مني الرجل مني المرأة أذكرا بإذن الله وإذا علا مني المرأة مني الرجل آنثا بإذن الله ‏\"‏ ‏.‏ قال اليهودي لقد صدقت وإنك لنبي ثم انصرف فذهب ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد سألني هذا عن الذي سألني عنه وما لي علم بشىء منه حتى أتاني الله به ‏\"‏ ‏.‏",
      "text_en": " Thauban, the freed slave of the Messenger of Allah (may peace be upon him), said:                      While I was standing beside the Messenger of Allah (may peace be upon him) one of the rabbis of the Jews came and said: Peace be upon you, O Muhammad. I pushed him backwith a push that he was going to fall. Upon this he said: Why do you push me? I said: Why don't you say: O Messenger of Allah? The Jew said: We call him by the name by which he was named by his family. The Messenger of Allah (may peace be upon him) said: My name is Muhammad with which I was named by my family. The Jew said: I have come to ask you (something). The Messenger of Allah (may peace be upon him) said: Should that thing be of any benefit to you, if I tell you that? He (the Jew) said: I will lend my ears to it. The Messenger of Allah (may peace be upon him) drew a line with the help of the stick that he had with him and then said: Ask (whatever you like). Thereupon the Jew said: Where would the human beings be on the Daywhen the earth would change into another earth and the heavens too (would change into other heavens)? The Messenger of Allah (may peace be upon him) said: They would be in darkness beside the Bridge. He (the Jew) again said: Who amongst people would be the first to cross (this bridge).? He said: They would be the poor amongst the refugees. The Jew said: What would constitute their breakfast when they would enter Paradise? He (the Holy Prophet) replied: A caul of the fish-liver. He (the Jew) said. What would be their food alter this? He (the Holy Prophet) said: A bullockwhich was fed in the different quarters of Paradise would be slaughtered for them. He (the Jew) said: What would be their drink? He (the Holy Prophet) said: They would be given drink from the fountain which is named\" Salsabil\". He (the Jew) said: I have come to ask you about a thing which no one amongst the people on the earth knows except an apostle or one or two men besides him. He (the Holy Prophet) said: Would it benefit you if I tell you that? He (the Jew) said: I would lend ears to that. He then said: I have come to ask you about the child. He (the Holy Prophet) said: The reproductive substance of man is white and that of woman (i. e. ovum central portion) yellow, and when they have sexual intercourse and the male's substance (chromosomes and genes) prevails upon the female's substance (chromosomes and genes), it is the male child that is created by Allah's Decree, and when the substance of the female prevails upon the substance contributed by the male, a female child is formed by the Decree of Allah. The Jew said: What you have said is true; verily you are an Apostle. He then returned and went away. The Messenger of Allah (may peace be upon him) said: He asked me about such and such things of which I have had no knowledge till Allah gave me that.",
      "chain": [
        "30115",
        "30335",
        "20401",
        "10883"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني الحسن بن علي الحلواني، حدثنا أبو توبة، - وهو الربيع بن نافع - حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، يقول حدثني أبو أمامة، الباهلي قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اقرءوا القرآن فإنه يأتي يوم القيامة شفيعا لأصحابه اقرءوا الزهراوين البقرة وسورة آل عمران فإنهما تأتيان يوم القيامة كأنهما غمامتان أو كأنهما غيايتان أو كأنهما فرقان من طير صواف تحاجان عن أصحابهما اقرءوا سورة البقرة فإن أخذها بركة وتركها حسرة ولا تستطيعها البطلة ‏\"‏ ‏.‏ قال معاوية بلغني أن البطلة السحرة ‏.‏",
      "text_en": " This hadith has been narrated by Mu'awiya with the same chain of transmitters but with this exception that in this the words of Mu'awiya:                     \" It has been conveyed to me...\" have not been mentioned.",
      "chain": [
        "30115",
        "30335",
        "20401",
        "15",
        "4048"
      ]
    },
    {
      "hadith_no": "2039",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني الحسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية، - وهو ابن سلام - عن زيد، - يعني أخاه - أنه سمع أبا سلام، قال حدثني الحكم بن ميناء، أنحدثاه أنهما، سمعا رسول الله صلى الله عليه وسلم يقول على أعواد منبره ‏\"‏ لينتهين أقوام عن ودعهم الجمعات أو ليختمن الله على قلوبهم ثم ليكونن من الغافلين ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Umar and Abu Huraira said that they heard Allah's Messenger (may peace be upon him) say on the planks of his pulpit:                      People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent.",
      "chain": [
        "30115",
        "30335",
        "20401",
        "11840"
      ]
    },
    {
      "hadith_no": "2377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا حسن بن علي الحلواني، حدثنا أبو توبة الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، يقول حدثني عبد الله بن فروخ، أنه سمع عائشة، تقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنه خلق كل إنسان من بني آدم على ستين وثلاثمائة مفصل فمن كبر الله وحمد الله وهلل الله وسبح الله واستغفر الله وعزل حجرا عن طريق الناس أو شوكة أو عظما عن طريق الناس وأمر بمعروف أو نهى عن منكر عدد تلك الستين والثلاثمائة السلامى فإنه يمشي يومئذ وقد زحزح نفسه عن النار ‏\"‏ ‏.‏ قال أبو توبة وربما قال ‏\"‏ يمسي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      Every one of the children of Adam has been created with three hundred and sixty joints; so he who declares the Glory of Allah, praises Allah, declares Allah to be One, Glorifies Allah, and seeks forgiveness from Allah, and removes stone, or thorn, or bone from people's path, and enjoins what is good and forbids from evil, to the number of those three hundred and sixty-four, will walk that day haviing removed himself from Hell.",
      "chain": [
        "30335",
        "20401",
        "15",
        "24242"
      ]
    },
    {
      "hadith_no": "4013",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا حسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية، عن يحيى بن، أبي كثير عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه فإن أبى فليمسك أرضه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who has land should cultivate it or lend it to his brother, but if he refuses, he should retain his land.",
      "chain": [
        "30335",
        "27",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4014",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا الحسن الحلواني، حدثنا أبو توبة، حدثنا معاوية، عن يحيى بن أبي كثير، أن يزيد بن نعيم، أخبره أن جابر بن عبد الله أخبره أنه، سمع رسول الله صلى الله عليه وسلم ينهى عن المزابنة والحقول ‏.‏ فقال جابر بن عبد الله المزابنة الثمر بالتمر ‏.‏ والحقول كراء الأرض ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported:                      I heard Allah's Messenger (may peace be upon him) forbidding Muzabana, and Huqul. Jabir b. Abdullah (Allah be pleased with them) said: Muzabana means the selling of fruits for dry dates and Huqul is the renting of land.",
      "chain": [
        "30335",
        "27",
        "11449",
        "34"
      ]
    },
    {
      "hadith_no": "4979",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني حسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية بن سلام، عن  زيد بن سلام، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم فقال رجل ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج ‏.‏ وقال آخر ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام ‏.‏ وقال آخر الجهاد في سبيل الله أفضل مما قلتم ‏.‏ فزجرهم عمر وقال لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وهو يوم الجمعة ولكن إذا صليت الجمعة دخلت فاستفتيته فيما اختلفتم فيه ‏.‏ فأنزل الله عز وجل ‏{‏ أجعلتم سقاية الحاج وعمارة المسجد الحرام كمن آمن بالله واليوم الآخر‏}‏ الآية إلى آخرها ‏.‏",
      "text_en": " It has been narrated on the authority of Nu'man b. Bashir who said:                      As I was (sitting) near the pulpit of the Messenger of Allah (may peace be upon him), a man said: I do not care if, after embracing Islam, I do not do any good deed (except) distributing drinking water among the pilgrims. Another said: I do not care if, after embracing Islam, I do not do any good deed beyond maintenance service to the Sacred Mosque. Another said: Jihad in the way of Allah is better than what you have said. 'Umar reprimanded them and said: Don't raise your voices near the pulpit of the Messenger of Allah (may peace be upon him) on Friday. When prayer was over, I entered (the apartment of the Holy Prophet) and asked his verdict about the matter in which they had differed. (It was upon this that) Allah, the Almighty and Exalted, revealed the Qur'anic verse:\" Do you make the giving of drinking water to the pilgrims and the maintenance of the Sacred Mosque equal to (the service of those) who believe in Allah and the Last Day and strive hard in the cause of Allah. They are not equal in the sight of God. And Allah guides not the wrongdoing people\" (ix. 20). This tradition has been narrated on the authority of Nu'man b. Bashir through another chain of transmitters.",
      "chain": [
        "30335",
        "20401",
        "10912",
        "274"
      ]
    },
    {
      "hadith_no": "33",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثني عيسى بن يونس، عن ابن أبي عروبة، عن أبي معشر، عن إبراهيم، عن عائشة، قالت كانت يد رسول الله صلى الله عليه وسلم اليمنى لطهوره وطعامه وكانت يده اليسرى لخلائه وما كان من أذى ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) used his right hand for getting water for ablution and taking food, and his left hand for his evacuation and for anything repugnant.",
      "chain": [
        "30335",
        "20347",
        "11073",
        "19825",
        "11051",
        "53"
      ]
    },
    {
      "hadith_no": "116",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، وأبو توبة قالا حدثنا أبو الأحوص، ح وحدثنا عمرو بن عون، أخبرنا أبو الأحوص، عن أبي إسحاق، عن أبي حية، قال رأيت عليا - رضى الله عنه - توضأ فذكر وضوءه كله ثلاثا ثلاثا - قال - ثم مسح رأسه ثم غسل رجليه إلى الكعبين ثم قال إنما أحببت أن أريكم طهور رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hayyah said:                      I saw ‘Ali perform ablution. He (Abu Hayyah) then described that ‘Ali went through every part of the ablution three times, i.e. he performed each detail of his ablution three times. He then wiped his head, then washed his feet up to the ankles. He then said: I wanted to show you how the Messenger of Allah (ﷺ) performed ablution.",
      "chain": [
        "30175",
        "30335",
        "20327",
        "30154",
        "20327",
        "11049",
        "19888",
        "5"
      ]
    },
    {
      "hadith_no": "145",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة، - يعني الربيع بن نافع - حدثنا أبو المليح، عن الوليد بن زوران، عن أنس يعني ابن مالك، أن رسول الله صلى الله عليه وسلم كان إذا توضأ أخذ كفا من ماء فأدخله تحت حنكه فخلل به لحيته وقال ‏\"‏ هكذا أمرني ربي عز وجل ‏\"‏ ‏.‏ قال أبو داود ابن زوران روى عنه حجاج بن حجاج وأبو المليح الرقي ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     Whenever the Messenger of Allah (ﷺ) performed ablution, he took a handful of water, and, putting it under his chin, made it go through his beard, saying: Thus did my Lord command me.",
      "chain": [
        "30335",
        "11453",
        "19128",
        "19"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا ابن المبارك، عن محمد بن إسحاق، حدثني صدقة بن يسار، عن عقيل بن جابر، عن جابر، قال خرجنا مع رسول الله صلى الله عليه وسلم - يعني في غزوة ذات الرقاع - فأصاب رجل امرأة رجل من المشركين فحلف أن لا أنتهي حتى أهريق دما في أصحاب محمد فخرج يتبع أثر النبي صلى الله عليه وسلم فنزل النبي صلى الله عليه وسلم منزلا فقال من رجل يكلؤنا فانتدب رجل من المهاجرين ورجل من الأنصار فقال ‏\"‏ كونا بفم الشعب ‏\"‏ ‏.‏ قال فلما خرج الرجلان إلى فم الشعب اضطجع المهاجري وقام الأنصاري يصلي وأتى الرجل فلما رأى شخصه عرف أنه ربيئة للقوم فرماه بسهم فوضعه فيه فنزعه حتى رماه بثلاثة أسهم ثم ركع وسجد ثم انتبه صاحبه فلما عرف أنهم قد نذروا به هرب ولما رأى المهاجري ما بالأنصاري من الدم قال سبحان الله ألا أنبهتني أول ما رمى قال كنت في سورة أقرأها فلم أحب أن أقطعها ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     We proceeded in the company of the Messenger of Allah (ﷺ) for the battle of Dhat ar-Riqa. One of the Muslims killed the wife of one of the unbelievers. He (the husband of the woman killed) took an oath saying: I shall not rest until I kill one of the companions of Muhammad.  He went out following the footsteps of the Prophet (ﷺ). The Prophet (ﷺ) encamped at a certain place.  He said: Who will keep a watch on us? A person from the Muhajirun (Emigrants) and another from the Ansar (Helpers) responded.  He said: Go to the mouth of the mountain-pass. When they went to the mouth of the mountain-pass the man from the Muhajirun lay down while the man from the Ansar stood praying.  The man (enemy) came to them. When he saw the person he realised that he was the watchman of the Muslims. He shot him with an arrow and hit the target. But he (took the arrow out and) threw it away. He (the enemy) then shot three arrows. Then he (the Muslim) bowed and prostrated and awoke his companion. When he (the enemy) perceived that they (the Muslims) had become aware of his presence, he ran away.  When the man from the Muhajirun saw the (man from the Ansar) bleeding, he asked him: Glory be to Allah! Why did you not wake me up  the first time when he shot at you.  He replied: I was busy reciting a chapter of the Qur'an. I did not like to leave it.",
      "chain": [
        "30335",
        "20025",
        "11107",
        "10641",
        "34"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، أخبرنا معاوية، عن يحيى، أخبرنا أبو سلمة بن عبد الرحمن، أن أبا هريرة، أخبره أن عمر بن الخطاب بينا هو يخطب يوم الجمعة إذ دخل رجل فقال عمر أتحتبسون عن الصلاة فقال الرجل ما هو إلا أن سمعت النداء فتوضأت ‏.‏ فقال عمر والوضوء أيضا أولم تسمعوا رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أتى أحدكم الجمعة فليغتسل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      While 'Umar b. al-Khattab was making a speech on Friday (in the mosque), a man came in. 'Umar said: Are you detained from prayer ? The man said: As soon as I heard the call for prayer, I perfumed ablution. Then 'Umar said: Only ablution ? Did you not hear the Messenger of Allah (ﷺ) say: When any one of you comes for Friday (prayer) he should take a bath.",
      "chain": [
        "30335",
        "27",
        "20031",
        "10567",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "375",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد بن مسرهد، والربيع بن نافع أبو توبة، - المعنى - قالا حدثنا أبو الأحوص، عن سماك، عن قابوس، عن لبابة بنت الحارث، قالت كان الحسين بن علي - رضى الله عنه - في حجر رسول الله صلى الله عليه وسلم فبال عليه فقلت البس ثوبا وأعطني إزارك حتى أغسله قال ‏\"‏ إنما يغسل من بول الأنثى وينضح من بول الذكر ‏\"‏ ‏.‏",
      "text_en": " Narrated Lubabah daughter of al-Harith:                     Al-Husayn ibn Ali was (sitting) in the lap of the Messenger of Allah (ﷺ). He passed water on him. I said: Put on (another) clothe, and give me your wrapper to wash. He said: The urine of a female child should be washed (thoroughly) and the urine of a male child should be sprinkled over.",
      "chain": [
        "30175",
        "30335",
        "20327",
        "10770",
        "15453",
        "17635",
        "20315"
      ]
    },
    {
      "hadith_no": "558",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة، حدثنا الهيثم بن حميد، عن يحيى بن الحارث، عن القاسم أبي عبد الرحمن، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من خرج من بيته متطهرا إلى صلاة مكتوبة فأجره كأجر الحاج المحرم ومن خرج إلى تسبيح الضحى لا ينصبه إلا إياه فأجره كأجر المعتمر وصلاة على أثر صلاة لا لغو بينهما كتاب في عليين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Messenger of Allah (ﷺ) said: If anyone goes out from his house after performing ablution for saying the prescribed prayer in congregation (in the mosque), his reward will be like that of one who goes for hajj pilgrimage after wearing ihram (robe worn by the hajj pilgrims). And he who goes out to say the mid-morning (duha) prayer, and takes the trouble for this purpose, will take the reward like that of a person who performs umrah. And a prayer followed by a prayer with no worldly talk during the gap between them will be recorded in Illiyyun.",
      "chain": [
        "30335",
        "20744",
        "19894",
        "11648",
        "405"
      ]
    },
    {
      "hadith_no": "616",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا عبد العزيز بن عبد الملك القرشي، حدثنا عطاء الخراساني، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصلي الإمام في الموضع الذي صلى فيه حتى يتحول ‏\"‏ ‏.‏ قال أبو داود عطاء الخراساني لم يدرك المغيرة بن شعبة ‏.‏",
      "text_en": " Narrated Mughirah ibn Shu'bah:                     The Prophet (ﷺ) said: The Imam should not pray at the place where he led the prayer until he removes  (from there).Abu Dawud said: 'Ata' al-Khurasani did not see Mughirah b. Shu'bah (This tradition is, therefore munqati', i.e. a link is missing in the chain).",
      "chain": [
        "30335",
        "10947",
        "166"
      ]
    },
    {
      "hadith_no": "622",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع، حدثنا أبو إسحاق، - يعني الفزاري - عن أبي إسحاق، عن محارب بن دثار، قال سمعت عبد الله بن يزيد، يقول على المنبر حدثني البراء، أنهم كانوا يصلون مع رسول الله صلى الله عليه وسلم فإذا ركع ركعوا وإذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ لم نزل قياما حتى يروه قد وضع جبهته بالأرض ثم يتبعونه صلى الله عليه وسلم ‏.‏",
      "text_en": " Al-Bara (b. Azib)said; They (the Companions) used to pray along with the Messenger of Allah (ﷺ). When he bowed, they  bowed; and when he said, “Allah listens to him who praises him”, they remained standing until they saw that he placed his placed his forehead on the ground:                      then they would follow him (ﷺ)",
      "chain": [
        "30335",
        "20405",
        "11049",
        "11389",
        "1945"
      ]
    },
    {
      "hadith_no": "759",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة، حدثنا الهيثم، - يعني ابن حميد - عن ثور، عن سليمان بن موسى، عن طاوس، قال كان رسول الله صلى الله عليه وسلم يضع يده اليمنى على يده اليسرى ثم يشد بينهما على صدره وهو في الصلاة ‏.‏",
      "text_en": " Narrated Tawus:                     The Messenger of Allah (ﷺ) used to place his right hand on his left hand, then he folded them strictly on his chest in prayer.",
      "chain": [
        "30335",
        "20744",
        "11155",
        "10880",
        "11053"
      ]
    },
    {
      "hadith_no": "833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، أخبرنا أبو إسحاق، - يعني الفزاري - عن حميد، عن الحسن، عن جابر بن عبد الله، قال كنا نصلي التطوع ندعو قياما وقعودا ونسبح ركوعا وسجودا ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah said:                      we used to offer supererogatory prayers and recite supplications while we were standing, and would glorify Allah while bowing and prostrating.",
      "chain": [
        "30335",
        "20405",
        "11279",
        "11016",
        "34"
      ]
    },
    {
      "hadith_no": "869",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، وموسى بن إسماعيل، - المعنى - قالا حدثنا ابن المبارك، عن موسى، - قال أبو سلمة موسى بن أيوب - عن عمه، عن عقبة بن عامر، قال لما نزلت ‏{‏ فسبح باسم ربك العظيم ‏}‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوها في ركوعكم ‏\"‏ ‏.‏ فلما نزلت ‏{‏ سبح اسم ربك الأعلى ‏}‏ قال ‏\"‏ اجعلوها في سجودكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     When \"Glorify the name of your mighty Lord\" was revealed, the Messenger of Allah (ﷺ) said: Use it when bowing, and when \"Glorify the name of your most high Lord\" was revealed, he said: Use it when prostrating yourself.",
      "chain": [
        "30335",
        "20040",
        "20025",
        "20040",
        "189"
      ]
    },
    {
      "hadith_no": "896",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا شريك، عن أبي إسحاق، قال وصف لنا البراء بن عازب فوضع يديه واعتمد على ركبتيه ورفع عجيزته وقال هكذا كان رسول الله صلى الله عليه وسلم يسجد ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     Al-Bara' described to us (the nature of prostration). He placed his hands (palms), reclined on his knees, and raised his hips; he said: This is how the Messenger of Allah (ﷺ) used to prostrate himself.",
      "chain": [
        "30335",
        "20587",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "916",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، قال حدثني السلولي، - هو أبو كبشة - عن سهل ابن الحنظلية، قال ثوب بالصلاة - يعني صلاة الصبح - فجعل رسول الله صلى الله عليه وسلم يصلي وهو يلتفت إلى الشعب ‏.‏ قال أبو داود وكان أرسل فارسا إلى الشعب من الليل يحرس ‏.‏",
      "text_en": " Narrated Sahl ibn al-Hanzaliyyah:                     The iqamah for the morning prayer was pronounced and the Messenger of Allah (ﷺ) began to offer prayer while he was looking at the mountain-pass. (AbuDawud elaborated that the Prophet had sent a horseman to the mountain-pass at night in order to keep watch.)",
      "chain": [
        "30335",
        "20401",
        "15",
        "1824"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، والربيع بن نافع، وعثمان بن أبي شيبة، وشجاع بن مخلد، - بمعنى الإسناد - أن ابن عياش، حدثهم عن عبيد الله بن عبيد الكلاعي، عن زهير، - يعني ابن سالم العنسي - عن عبد الرحمن بن جبير بن نفير، قال عمرو وحده عن أبيه، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل سهو سجدتان بعد ما يسلم ‏\"‏ ‏.‏ لم يذكر عن أبيه ‏.‏ غير عمرو ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: For each forgetfulness there are two prostrations after giving the salutation. No one except Amr (ibn Uthman) mentioned the words \"from his father\" (in the chain AbdurRahman ibn Jubayr ibn Nufayr from Thawban).",
      "chain": [
        "10581",
        "30335",
        "30203",
        "30506",
        "17023",
        "10942",
        "130"
      ]
    },
    {
      "hadith_no": "1152",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا سليمان، - يعني ابن حيان - عن أبي يعلى الطائفي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم كان يكبر في الفطر في الأولى سبعا ثم يقرأ ثم يكبر ثم يقوم فيكبر أربعا ثم يقرأ ثم يركع ‏.‏ قال أبو داود رواه وكيع وابن المبارك قالا سبعا وخمسا ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) used to say on the day of the breaking of the fast seven takbirs in the first rak'ah and then recite the Qur'an, and utter the takbir (Allah is most great). Then he would stand, and utter the takbir four times. Thereafter he would recite the Qur'an and bow.Abu Dawud said: This has been narrated by Waki' and Ibn al-Mubarak. Their version goes: \"Seven (in the first rak'ah) and five (in the second).\"",
      "chain": [
        "30335",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1277",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا الربيع بن نافع، حدثنا محمد بن المهاجر، عن العباس بن سالم، عن أبي سلام، عن أبي أمامة، عن عمرو بن عبسة السلمي، أنه قال قلت يا رسول الله أى الليل أسمع قال ‏\"‏ جوف الليل الآخر فصل ما شئت فإن الصلاة مشهودة مكتوبة حتى تصلي الصبح ثم أقصر حتى تطلع الشمس فترتفع قيس رمح أو رمحين فإنها تطلع بين قرنى شيطان وتصلي لها الكفار ثم صل ما شئت فإن الصلاة مشهودة مكتوبة حتى يعدل الرمح ظله ثم أقصر فإن جهنم تسجر وتفتح أبوابها فإذا زاغت الشمس فصل ما شئت فإن الصلاة مشهودة حتى تصلي العصر ثم أقصر حتى تغرب الشمس فإنها تغرب بين قرنى شيطان ويصلي لها الكفار ‏\"‏ ‏.‏ وقص حديثا طويلا قال العباس هكذا حدثني أبو سلام عن أبي أمامة إلا أن أخطئ شيئا لا أريده فأستغفر الله وأتوب إليه ‏.‏",
      "text_en": " Narrated Amr ibn Anbasah as-Sulami:                     I asked: Messenger of Allah, in which part of night the supplication is more likely to be accepted?  He replied: In the last part: Pray as much as you like, for the prayer is attended by the angels and it is recorded till you offer the dawn prayer; then stop praying when the sun is rising till it has reached the height of one or two lances, for it rises between the two horns of the Devil, and the infidels offer prayer for it (at that time). Then pray as much as you like, because the prayer is witnessed and recorded till the shadow of a lance be- comes equal to it. Then cease prayer, for at that time the Hell-fire is heated up and doors of Hell are opened.  When the sun declines, pray as much as you like, for the prayer is witnessed till you pray the afternoon prayer; then cease prayer till the sun sets, for it sets between the horns of the Devil, and (at that time) the infidels offer prayer for it. He narrated a lengthy tradition.  Abbas said: AbuSalam narrated this tradition in a similar manner from AbuUmamah. If I have made a mistake unintentionally, I beg pardon of Allah and repent to Him.",
      "chain": [
        "30335",
        "405",
        "4002"
      ]
    },
    {
      "hadith_no": "1288",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا الهيثم بن حميد، عن يحيى بن الحارث، عن القاسم بن عبد الرحمن، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة في أثر صلاة لا لغو بينهما كتاب في عليين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: Prayer followed by a prayer with no idle talk between the two is recorded in Illiyyun.",
      "chain": [
        "30335",
        "20744",
        "19894",
        "19896",
        "405"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا محمد بن مهاجر، عن عروة بن، رويم حدثني الأنصاري، أن رسول الله صلى الله عليه وسلم قال لجعفر بهذا الحديث فذكر نحوهم قال في السجدة الثانية من الركعة الأولى كما قال في حديث مهدي بن ميمون ‏.‏",
      "text_en": " Narrated 'Urwah b. Ruwaim:                     That an al-Ansari narrated to him: The Messenger of Allah (ﷺ) said to Ja'far. He then narrated the tradition in like manner. This version has the words: \"In the second prostration of the first rak'ah\" in addition to the words transmitted by Mahdi b. Maimun (in the previous tradition).",
      "chain": [
        "30335",
        "20637",
        "20280"
      ]
    },
    {
      "hadith_no": "1318",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو توبة، عن إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن عائشة، قالت ‏:‏ ما ألفاه السحر عندي إلا نائما، تعني النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Aishah:                     When he was with me he would sleep at dawn. By this she referred to the Prophet (ﷺ).",
      "chain": [
        "30335",
        "20150",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1323",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا سليمان بن حيان، عن هشام بن حسان، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ إذا قام أحدكم من الليل فليصل ركعتين خفيفتين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: When one of you gets up at night, he should begin the prayer with two short rak'ahs.",
      "chain": [
        "30335",
        "11311",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقبل في شهر الصوم ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) used to kiss (me) during the month of fasting.",
      "chain": [
        "30335",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "hadith_no": "2501",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة، حدثنا معاوية، - يعني ابن سلام - عن زيد، - يعني ابن سلام - أنه سمع أبا سلام، قال حدثني السلولي أبو كبشة، أنه حدثه سهل ابن الحنظلية، أنهم ساروا مع رسول الله صلى الله عليه وسلم يوم حنين فأطنبوا السير حتى كانت عشية، فحضرت الصلاة عند رسول الله صلى الله عليه وسلم فجاء رجل فارس فقال ‏:‏ يا رسول الله إني انطلقت بين أيديكم حتى طلعت جبل كذا وكذا فإذا أنا بهوازن على بكرة آبائهم بظعنهم ونعمهم وشائهم اجتمعوا إلى حنين ‏.‏ فتبسم رسول الله صلى الله عليه وسلم وقال ‏:‏ ‏\"‏ تلك غنيمة المسلمين غدا إن شاء الله ‏\"‏ ‏.‏ ثم قال ‏:‏ ‏\"‏ من يحرسنا الليلة ‏\"‏ ‏.‏ قال أنس بن أبي مرثد الغنوي ‏:‏ أنا يا رسول الله ‏.‏ قال ‏:‏ ‏\"‏ فاركب ‏\"‏ ‏.‏ فركب فرسا له فجاء إلى رسول الله صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ استقبل هذا الشعب حتى تكون في أعلاه ولا نغرن من قبلك الليلة ‏\"‏ ‏.‏ فلما أصبحنا خرج رسول الله صلى الله عليه وسلم إلى مصلاه فركع ركعتين ثم قال ‏:‏ ‏\"‏ هل أحسستم فارسكم ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله ما أحسسناه ‏.‏ فثوب بالصلاة فجعل رسول الله صلى الله عليه وسلم يصلي وهو يلتفت إلى الشعب حتى إذا قضى صلاته وسلم قال ‏:‏ ‏\"‏ أبشروا فقد جاءكم فارسكم ‏\"‏ ‏.‏ فجعلنا ننظر إلى خلال الشجر في الشعب فإذا هو قد جاء حتى وقف على رسول الله صلى الله عليه وسلم فسلم فقال ‏:‏ إني انطلقت حتى كنت في أعلى هذا الشعب حيث أمرني رسول الله صلى الله عليه وسلم فلما أصبحت اطلعت الشعبين كليهما فنظرت فلم أر أحدا ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ هل نزلت الليلة ‏\"‏ ‏.‏ قال ‏:‏ لا إلا مصليا أو قاضيا حاجة ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ قد أوجبت فلا عليك أن لا تعمل بعدها ‏\"‏ ‏.‏",
      "text_en": " Narrated Sahl ibn al-Hanzaliyyah:                     On the day of Hunayn we travelled with the Messenger of Allah (ﷺ) and we journeyed for a long time until the evening came. I attended the prayer along with the Messenger of Allah (ﷺ).  A horseman came and said: Messenger of Allah, I went before you and climbed a certain mountain where saw Hawazin all together with their women, cattle, and sheep, having gathered at Hunayn.  The Messenger of Allah (ﷺ) smiled and said: That will be the booty of the Muslims tomorrow if Allah wills. He then asked: Who will be on guard tonight?  Anas ibn AbuMarthad al-Ghanawi said: I shall , Messenger of Allah.  He said: Then mount your horse. He then mounted his horse, and came to the Messenger of Allah (ﷺ).  The Messenger of Allah said to him: Go forward to this ravine till you get to the top of it. We should not be exposed to danger from your side. In the morning the Apostle of of Allah (ﷺ) came out to his place of prayer, and offered two rak'ahs.  He then said: Have you seen any sign of your horseman?  They said: We have not, Messenger of Allah. The announcement of the time for prayer was then made, and while the Messenger of Allah (ﷺ) was saying the prayer, he began to glance towards the ravine. When he finished his prayer and uttered salutation, he said: Cheer up, for your horseman has come. We therefore began to look between the trees in the ravine, and sure enough he had come.  He stood beside the Messenger of Allah (ﷺ), saluted him and said: I continued till I reached the top of this ravine where the Messenger of Allah (ﷺ) commanded me, and in the morning I looked down into both ravines but saw no one.  The Messenger of Allah (ﷺ) asked him: Did you dismount during the night?  He replied: No, except to pray or to relieve myself. The Messenger of Allah (ﷺ) said: You have ensured your entry to (Paradise). No blame will be attached to you supposing you do not work after it.",
      "chain": [
        "30335",
        "20401",
        "10912"
      ]
    },
    {
      "hadith_no": "2542",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة، عن الهيثم بن حميد، ح وحدثنا خشيش بن أصرم، حدثنا أبو عاصم، جميعا عن ثور بن يزيد، عن نصر الكناني، عن رجلوقال أبو توبة ‏:‏ عن ثور بن يزيد، عن شيخ، من بني سليم عن عتبة بن عبد السلمي، - وهذا لفظه - أنه سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ لا تقصوا نواصي الخيل ولا معارفها ولا أذنابها، فإن أذنابها مذابها، ومعارفها دفاؤها، ونواصيها معقود فيها الخير ‏\"‏ ‏.‏",
      "text_en": " Narrated Utbah ibn AbdusSulami:                     Utbah heard the Messenger of Allah (ﷺ) say: Do not cut the forelocks, manes, or tails of horse, for their tails are their means of driving flies, their manes provide them with warmth, and blessing is tide to their forelocks.",
      "chain": [
        "30335",
        "20744",
        "38204",
        "20241",
        "20415",
        "20415",
        "5166"
      ]
    },
    {
      "hadith_no": "2646",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا ابن المبارك، عن جرير بن حازم، عن الزبير بن خريت، عن عكرمة، عن ابن عباس، قال نزلت ‏{‏ إن يكن منكم عشرون صابرون يغلبوا مائتين ‏}‏ فشق ذلك على المسلمين حين فرض الله عليهم أن لا يفر واحد من عشرة ثم إنه جاء تخفيف فقال ‏{‏ الآن خفف الله عنكم ‏}‏ قرأ أبو توبة إلى قوله ‏{‏ يغلبوا مائتين ‏}‏ قال فلما خفف الله تعالى عنهم من العدة نقص من الصبر بقدر ما خفف عنهم ‏.‏",
      "text_en": " Ibn ‘Abbas said “When the verse “If there are twenty amongst you patient and persevering, they will vanquish two hundred” was revealed. It was heavy and troublesome for Muslims when Allaah prescribed for them that one (fighting Muslim) should not fly from ten (fighting Non-Muslims). Then a light commandment was revealed saying “For the present Allaah hath lightened your (task).” The narrator Abu Tawbah recited the verse to “they will vanquish two hundred.” When Allaah lightened the number, patient and perseverance also decreased according to the number lightened from them.”",
      "chain": [
        "30335",
        "20025",
        "11272",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2772",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا عيسى، عن إسماعيل، عن قيس، عن جرير، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏ ‏.‏ فأتاها فحرقها ثم بعث رجلا من أحمس إلى النبي صلى الله عليه وسلم يبشره يكنى أبا أرطاة ‏.‏",
      "text_en": " Jarir (bin ‘Abd Allaah) said “The Apostle of Allaah(ﷺ) said to me “Why do you not give me rest from Dhu Al Khulasah? He went there and burned it. He then sent a man from Ahmas to the Prophet (ﷺ) to give him good tidings. His surname was Artah.",
      "chain": [
        "30335",
        "20347",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "2785",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، - يعني ابن سلام - أنه سمع أبا سلام، يقول حدثني عبيد الله بن سلمان، أن رجلا، من أصحاب النبي صلى الله عليه وسلم حدثه قال لما فتحنا خيبر أخرجوا غنائمهم من المتاع والسبى فجعل الناس يتبايعون غنائمهم فجاء رجل حين صلى رسول الله صلى الله عليه وسلم فقال يا رسول الله لقد ربحت ربحا ما ربح اليوم مثله أحد من أهل هذا الوادي قال ‏\"‏ ويحك وما ربحت ‏\"‏ ‏.‏ قال ما زلت أبيع وأبتاع حتى ربحت ثلاثمائة أوقية فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أنبئك بخير رجل ربح ‏\"‏ ‏.‏ قال ما هو يا رسول الله قال ‏\"‏ ركعتين بعد الصلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated A man from the Companions of the Prophet:                     Ubaydullah ibn Salman reported on the authority of a man from the Companions of the Prophet (ﷺ): When we conquered Khaybar, they (the people) took out their spoils which contained equipment and captives. The people began to buy and sell their spoils. When the Messenger of Allah (ﷺ) prayed, a man came to him and said: Messenger of Allah, I have gained today so much so that no one gained from this valley. He asked: Woe unto you, how much did you gain? He replied: I kept on selling and buying until I gained three hundred uqiyahs. The Messenger of Allah (ﷺ) said: I tell you a man who gained better than you. He asked: What is that, Messenger of Allah? He replied! Two rak'ahs (of supererogatory prayer) after the (obligatory) prayer.",
      "chain": [
        "30335",
        "20401",
        "10912"
      ]
    },
    {
      "hadith_no": "3055",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، قال حدثني عبد الله الهوزني، قال لقيت بلالا مؤذن رسول الله صلى الله عليه وسلم بحلب فقلت يا بلال حدثني كيف كانت نفقة رسول الله صلى الله عليه وسلم قال ما كان له شىء كنت أنا الذي ألي ذلك منه منذ بعثه الله إلى أن توفي وكان إذا أتاه الإنسان مسلما فرآه عاريا يأمرني فأنطلق فأستقرض فأشتري له البردة فأكسوه وأطعمه حتى اعترضني رجل من المشركين فقال يا بلال إن عندي سعة فلا تستقرض من أحد إلا مني ففعلت فلما أن كان ذات يوم توضأت ثم قمت لأؤذن بالصلاة فإذا المشرك قد أقبل في عصابة من التجار فلما أن رآني قال يا حبشي ‏.‏ قلت يا لباه ‏.‏ فتجهمني وقال لي قولا غليظا وقال لي أتدري كم بينك وبين الشهر قال قلت قريب ‏.‏ قال إنما بينك وبينه أربع فآخذك بالذي عليك فأردك ترعى الغنم كما كنت قبل ذلك فأخذ في نفسي ما يأخذ في أنفس الناس حتى إذا صليت العتمة رجع رسول الله صلى الله عليه وسلم إلى أهله فاستأذنت عليه فأذن لي فقلت يا رسول الله بأبي أنت وأمي إن المشرك الذي كنت أتدين منه قال لي كذا وكذا وليس عندك ما تقضي عني ولا عندي وهو فاضحي فأذن لي أن آبق إلى بعض هؤلاء الأحياء الذين قد أسلموا حتى يرزق الله رسوله صلى الله عليه وسلم ما يقضي عني فخرجت حتى إذا أتيت منزلي فجعلت سيفي وجرابي ونعلي ومجني عند رأسي حتى إذا انشق عمود الصبح الأول أردت أن أنطلق فإذا إنسان يسعى يدعو يا بلال أجب رسول الله صلى الله عليه وسلم فانطلقت حتى أتيته فإذا أربع ركائب مناخات عليهن أحمالهن فاستأذنت فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أبشر فقد جاءك الله بقضائك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألم تر الركائب المناخات الأربع ‏\"‏ ‏.‏ فقلت بلى ‏.‏ فقال ‏\"‏ إن لك رقابهن وما عليهن فإن عليهن كسوة وطعاما أهداهن إلى عظيم فدك فاقبضهن واقض دينك ‏\"‏ ‏.‏ ففعلت فذكر الحديث ثم انطلقت إلى المسجد فإذا رسول الله صلى الله عليه وسلم قاعد في المسجد فسلمت عليه فقال ‏\"‏ ما فعل ما قبلك ‏\"‏ ‏.‏ قلت قد قضى الله كل شىء كان على رسول الله صلى الله عليه وسلم فلم يبق شىء ‏.‏ قال ‏\"‏ أفضل شىء ‏\"‏ ‏.‏ قلت نعم قال ‏\"‏ انظر أن تريحني منه فإني لست بداخل على أحد من أهلي حتى تريحني منه ‏\"‏ ‏.‏ فلما صلى رسول الله صلى الله عليه وسلم العتمة دعاني فقال ‏\"‏ ما فعل الذي قبلك ‏\"‏ ‏.‏ قال قلت هو معي لم يأتنا أحد ‏.‏ فبات رسول الله صلى الله عليه وسلم في المسجد وقص الحديث حتى إذا صلى العتمة - يعني من الغد - دعاني قال ‏\"‏ ما فعل الذي قبلك ‏\"‏ ‏.‏ قال قلت قد أراحك الله منه يا رسول الله ‏.‏ فكبر وحمد الله شفقا من أن يدركه الموت وعنده ذلك ثم اتبعته حتى إذا جاء أزواجه فسلم على امرأة امرأة حتى أتى مبيته فهذا الذي سألتني عنه ‏.‏",
      "text_en": " Narrated Abdullah al-Hawzani:                     I met Bilal, the Mu'adhdhin of the Messenger of Allah (ﷺ) at Aleppo, and said: Bilal, tell me, what was the financial position of the Messenger of Allah (ﷺ)?  He said: He had nothing. It was I who managed it on his behalf since the day Allah made him Prophet of Allah (ﷺ) until he died. When a Muslim man came to him and he found him naked, he ordered me (to clothe him). I would go, borrow (some money), and purchase a cloak for him. I would then clothe him and feed him.  A man from the polytheists met me and said: I am well off, Bilal. Do not borrow money from anyone except me. So I did accordingly. One day when I performed ablution and stood up to make call to prayer, the same polytheist came along with a body of merchants.  When he saw me, he said: O Abyssinian.  I said: I am at your service. He met me with unpleasant looks and said harsh words to me.  He asked me: Do you know how many days remain in the completion of this month?  I replied: The time is near.  He said: Only four days remain in the completion of this month. I shall then take that which is due from you (i.e. loan), and then shall return you to tend the sheep as you did before. I began to think in my mind what people think in their minds (on such occasions). When I offered the night prayer, the Messenger of Allah (ﷺ) returned to his family. I sought permission from him and he gave me permission.  I said: Messenger of Allah, may my parents be sacrificed for you, the polytheist from whom I used to borrow money said to me such-and-such. Neither you nor I have anything to pay him for me, and he will disgrace me. So give me permission to run away to some of those tribes who have recently embraced Islam until Allah gives His Apostle (ﷺ) something with which he can pay (the debt) for me. So I came out and reached my house. I placed my sword, waterskin (or sheath), shoes and shield near my head. When dawn broke, I intended to be on my way.  All of a sudden I saw a man running towards me and calling: Bilal, return to the Messenger of Allah (ﷺ). So I went till I reached him. I found four mounts kneeling on the ground with loads on them. I sought permission.  The Messenger of Allah (ﷺ) said to me: Be glad, Allah has made arrangements for the payment (of your debt). He then asked: Have you not seen the four mounts kneeling on the ground?  I replied: Yes.  He said: You may have these mounts and what they have on them. There are clothes and food on them, presented to me by the ruler of Fadak. Take them away and pay off your debt. I did so.  He then mentioned the rest of the tradition. I then went to the mosque and found that the Messenger of Allah (ﷺ) was sitting there. I greeted him.  He asked: What benefit did you have from your property?  I replied: Allah Most High paid everything which was due from the Messenger of Allah (ﷺ). Nothing remains now.  He asked: Did anything remain (from that property)?  I said: Yes.  He said: Look, if you can give me some comfort from it, for I shall not visit any member of my family until you give me some comfort from it. When the Messenger of Allah (ﷺ) offered the night prayer, he called me and said: What is the position of that which you had with you (i.e. property)?  I said: I still have it, no one came to me. The Messenger of Allah (ﷺ) passed the night in the mosque.  He then narrated the rest of the tradition. Next day when he offered the night prayer, he called me and asked: What is the position of that which you had (i.e. the rest of the property)?  I replied: Allah has given you comfort from it, Messenger of Allah.  He said: Allah is Most Great, and praised Allah, fearing lest he should die while it was with him. I then followed him until he came to his wives and greeted each one of them and finally he came to his place where he had to pass the night. This is all for which you asked me.",
      "chain": [
        "30335",
        "20401",
        "15"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، قال أخبرني أبو قلابة، أن ثابت بن الضحاك، أخبره أنه، بايع رسول الله صلى الله عليه وسلم تحت الشجرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف بملة غير ملة الإسلام كاذبا فهو كما قال ومن قتل نفسه بشىء عذب به يوم القيامة وليس على رجل نذر فيما لا يملكه ‏\"‏ ‏.‏",
      "text_en": " Narrated Thabit bin Adh-Dahhak:                     That he took oath of allegiance to the Messenger of Allah (ﷺ) under the tree. The Messenger of Allah (ﷺ) said: If anyone swears by religion other than Islam falsely, he is like what has has said. If anyone kills himself with something, he will be punished with it on the Day of Resurrection. A vow over which a man has no control is not binding on him.",
      "chain": [
        "30335",
        "20401",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "3360",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا معاوية، - يعني ابن سلام - عن يحيى بن أبي كثير، أخبرنا عبد الله، أن أبا عياش، أخبره أنه، سمع سعد بن أبي وقاص، يقول نهى رسول الله صلى الله عليه وسلم عن بيع الرطب بالتمر نسيئة ‏.‏ قال أبو داود رواه عمران بن أبي أنس عن مولى لبني مخزوم عن سعد عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Sa'd ibn Abi Waqqas:                     The Messenger of Allah (ﷺ) forbade to sell fresh dates for dry dates when payment is made at a later date.Abu Dawud said: The tradition mentioned above has also been transmitted by Sa'd (b. Abi Waqqas) from the Prophet (ﷺ) through a different chain of narrators in a similar way.",
      "chain": [
        "30335",
        "20401",
        "11449",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا عبيد الله، - يعني ابن عمرو الرقي - عن أيوب، عن ابن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم نهى عن تلقي الجلب فإن تلقاه متلق مشتر فاشتراه فصاحب السلعة بالخيار إذا وردت السوق ‏.‏ قال أبو علي سمعت أبا داود يقول قال سفيان لا يبع بعضكم على بيع بعض أن يقول إن عندي خيرا منه بعشرة ‏.‏",
      "text_en": " Abu Hurairah said:                      Do not go our to meet what is being brought (to market for sale). If anyone does so and buys some of it, the owner of merchandise has a choice (of canceling the deal) when it comes to the market.Abu 'Ali said: I heard Abu Dawud say: Sufyan said: none of you must buy in opposition to one another ; that is he says: I have a better one for ten (dirhams).",
      "chain": [
        "30335",
        "20445",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3479",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، ح وحدثنا الربيع بن نافع أبو توبة، وعلي بن بحر، قالا حدثنا عيسى، وقال، إبراهيم أخبرنا عن الأعمش، عن أبي سفيان، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم نهى عن ثمن الكلب والسنور ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) forbade payment for dog and cat.",
      "chain": [
        "30309",
        "30335",
        "36596",
        "20347",
        "11051",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "hadith_no": "3482",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا عبيد الله، - يعني ابن عمرو - عن عبد الكريم، عن قيس بن حبتر، عن عبد الله بن عباس، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب وإن جاء يطلب ثمن الكلب فاملأ كفه ترابا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) forbade the price paid for a dog; if someone comes to ask for the price of a dog, fill his hand-palm with dust.",
      "chain": [
        "30335",
        "30024",
        "18655",
        "15467",
        "17"
      ]
    },
    {
      "hadith_no": "3584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا ابن المبارك، عن أسامة بن زيد، عن عبد الله بن رافع، مولى أم سلمة عن أم سلمة، قالت أتى رسول الله صلى الله عليه وسلم رجلان يختصمان في مواريث لهما لم تكن لهما بينة إلا دعواهما فقال النبي صلى الله عليه وسلم فذكر مثله فبكى الرجلان وقال كل واحد منهما حقي لك ‏.‏ فقال لهما النبي صلى الله عليه وسلم ‏\"‏ أما إذ فعلتما ما فعلتما فاقتسما وتوخيا الحق ‏.‏ ثم استهما ثم تحالا ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah said:                      Two men came to the Messenger of Allah (ﷺ) who were disputing over their inheritance. They had no evidence except their claim. The Prophet (ﷺ) then said in a similar way. Thereupon both the men wept and each of them said: This right of mine go to you. The Prophet (ﷺ) then said: Now you have done whatever you have done ; do divide it up, aiming at what is right, then drew lots, and let each of you consider the other to have what is legitimately his\"",
      "chain": [
        "30335",
        "20025",
        "50",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "3861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا سعيد بن عبد الرحمن الجمحي، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من احتجم لسبع عشرة وتسع عشرة وإحدى وعشرين كان شفاء من كل داء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: If anyone has himself cupped on the 17th, 19th and 21st it will be a remedy for every disease.",
      "chain": [
        "30335",
        "20503",
        "13"
      ]
    },
    {
      "hadith_no": "3881",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا محمد بن مهاجر، عن أبيه، عن أسماء بنت يزيد بن السكن، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقتلوا أولادكم سرا فإن الغيل يدرك الفارس فيدعثره عن فرسه ‏\"‏ ‏.‏",
      "text_en": " Narrated Asma', daughter of Yazid ibn as-Sakan,:                     I heard the Messenger of Allah (ﷺ) as saying: Do not kill your children secretly, for the milk, with which a child is suckled while his mother is pregnant, overtakes the horseman and throws him from his horse.",
      "chain": [
        "30335",
        "20637",
        "17066",
        "84"
      ]
    },
    {
      "hadith_no": "4147",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو توبة، حدثنا سليمان، - يعني ابن حيان - عن هشام، عن أبيه، عن عائشة، - رضى الله عنها - قالت كانت ضجعة رسول الله صلى الله عليه وسلم من أدم حشوها ليف ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The bedding of the Messenger of Allah (ﷺ) consisted of leather stuffed with palm fibre.",
      "chain": [
        "30335",
        "20295",
        "53"
      ]
    },
    {
      "hadith_no": "4212",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو توبة، حدثنا عبيد الله، عن عبد الكريم الجزري، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون قوم يخضبون في آخر الزمان بالسواد كحواصل الحمام لا يريحون رائحة الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: At the end of time there will be people who will use this black dye like the crops of doves who will not experience the fragrance of Paradise.",
      "chain": [
        "30335",
        "11201",
        "18655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4840",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو توبة، قال زعم الوليد عن الأوزاعي، عن قرة، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل كلام لا يبدأ فيه ب الحمد لله فهو أجذم ‏\"‏ ‏.‏ قال أبو داود رواه يونس وعقيل وشعيب وسعيد بن عبد العزيز عن الزهري عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Every important matter which is not begun by an expression of praise to Allah is maimed.Abu Dawud said: It has also been transmitted by Yunus, 'Aqil, Shu'aib, Sa'id b. 'Abd al-Aziz from al-Zuhri from the Prophet (ﷺ) in Mursal form (the link of the Companion is missing).",
      "chain": [
        "30335",
        "20024",
        "11301",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4955",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الربيع بن نافع، عن يزيد، - يعني ابن المقدام بن شريح - عن أبيه، عن جده، شريح عن أبيه، هانئ أنه لما وفد إلى رسول الله صلى الله عليه وسلم مع قومه سمعهم يكنونه بأبي الحكم فدعاه رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله هو الحكم وإليه الحكم فلم تكنى أبا الحكم ‏\"‏ ‏.‏ فقال إن قومي إذا اختلفوا في شىء أتوني فحكمت بينهم فرضي كلا الفريقين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أحسن هذا فما لك من الولد ‏\"‏ ‏.‏ قال لي شريح ومسلم وعبد الله ‏.‏ قال ‏\"‏ فمن أكبرهم ‏\"‏ ‏.‏ قلت شريح قال ‏\"‏ فأنت أبو شريح ‏\"‏ ‏.‏ قال أبو داود شريح هذا هو الذي كسر السلسلة وهو ممن دخل تستر ‏.‏ قال أبو داود وبلغني أن شريحا كسر باب تستر وذلك أنه دخل من سرب ‏.‏",
      "text_en": " Narrated Hani ibn Yazid:                     When Hani went with his people in a deputation to the Messenger of Allah (ﷺ), he heard them calling him by his kunyah (surname), AbulHakam.  So the Messenger of Allah (ﷺ) called him and said: Allah is the judge (al-Hakam), and to Him judgment belongs. Why are you given the kunyah AbulHakam?  He replied: When my people disagree about a matter, they come to me, and I decide between them, and both parties are satisfied with my decision.  He said: How good this is! What children have you?  He replied: I have Shurayh, Muslim and Abdullah.  He asked; Who is the oldest of them?  I replied: Shurayh.  He said: Then you are AbuShurayh.Abu Dawud said: This is Shuraib who broke the chain, and who entered Tustar.Abu Dawud said: I have been told that Shuraib broke the gate of Tustar, and he entered it through tunnel.",
      "chain": [
        "30335",
        "15646"
      ]
    },
    {
      "hadith_no": "5153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا سليمان بن حيان، عن محمد بن عجلان، عن أبيه، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم يشكو جاره فقال ‏\"‏ اذهب فاصبر ‏\"‏ ‏.‏ فأتاه مرتين أو ثلاثا فقال ‏\"‏ اذهب فاطرح متاعك في الطريق ‏\"‏ ‏.‏ فطرح متاعه في الطريق فجعل الناس يسألونه فيخبرهم خبره فجعل الناس يلعنونه فعل الله به وفعل وفعل فجاء إليه جاره فقال له ارجع لا ترى مني شيئا تكرهه ‏.‏",
      "text_en": " Abu Hurairah said :                      A man came to the prophet (May peace be upon him) complaining against his neighbor. He said: go and have patience. He again came to him twice or thrice. He then said : Go and throw your property in the way. So he threw his property in the way and the people began to ask him and he would tell them about him. The people then began to curse him; may Allah do with him so and so! Then his neighbor came to him and said: Return, you will not see from me anything which you dislike.",
      "chain": [
        "30335",
        "10616",
        "13"
      ]
    },
    {
      "hadith_no": "3882",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن إدريس، قال حدثنا أبو توبة، قال حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، عن يزيد بن نعيم، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم نهى عن الحقل‏.‏‏ وهي المزابنة‏.‏‏ خالفه هشام ورواه عن يحيى عن أبي سلمة عن جابر‏.‏‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah:                      \"The Prophet forbade Al-Haql and it is Al-Muzabanah.\"",
      "chain": [
        "20002",
        "30335",
        "20401",
        "11449",
        "34"
      ]
    },
    {
      "hadith_no": "4579",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد بن كثير الحراني، قال حدثنا أبو توبة، قال حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال نهانا رسول الله صلى الله عليه وسلم أن نبيع الفضة بالفضة إلا عينا بعين سواء بسواء ولا نبيع الذهب بالذهب إلا عينا بعين سواء بسواء قال رسول الله صلى الله عليه وسلم ‏\"‏ تبايعوا الذهب بالفضة كيف شئتم والفضة بالذهب كيف شئتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Bakrah that his father said:                     \"The Messenger of Allah forbade us from selling silver for silver unless it was of equal amounts, or selling gold for gold unless it was of equal amounts. The messenger of Allah said: 'Sell gold for silver however you want, and silver for gold however you want.\"'",
      "chain": [
        "38620",
        "30335",
        "20401",
        "11449",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2546",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا أبو توبة الربيع بن نافع، حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه فإن أبى فليمسك أرضه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever has land, let him cultivate it (himself) or let him give it to his brother (for free, to cultivate it), and if he does not want to do that, let him keep his land.”",
      "chain": [
        "30498",
        "30335",
        "20401",
        "11449",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 52
}