{
  "id": "30346",
  "name": "'Abdullah bin Ja'far al-Raqqi عبد الله بن جعفر الرقي",
  "full_name": "'Abdullah bin Ja'far al-Raqqi عبد الله بن جعفر الرقي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Raqqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "28102",
      "name": "al-Hasan bin 'Umar/'Amr الحسن بن عمر - أبو المليح الرقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20465",
      "name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38001",
      "name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38111",
      "name": "Isma'il bin 'Abdullah, al-Sakri إسماعيل بن عبد الله بن خالد - السكري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38396",
      "name": "'Ali bin al-Husain al-Rqy علي بن الحسين الرقي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30417",
      "name": "Salmah bin Shbyb سلمة بن شبيب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30265",
      "name": "al-Fadl bin Y'aqub bin Ibrahim الفضل بن يعقوب الرخامي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30514",
      "name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38485",
      "name": "Muhammad bin Jabla محمد بن جبلة / بن خالد بن جبلة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30510",
      "name": "Abd al-Salam bin Abd عبد السلام بن عبد الرحمن بن صخر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37535",
      "name": "Mua'wiya bin Salah bin al-Wazir معاوية بن صالح بن الوزير",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30501",
      "name": "al-Hasan bin Ahmed bin Aby الحسن بن أحمد بن أبي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38467",
      "name": "abu Umayya, Muhammad bin Ibrahim محمد بن إبراهيم أبو أمية الطرسوسي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3159",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير، عن جبير بن حية، قال بعث عمر الناس في أفناء الأمصار يقاتلون المشركين، فأسلم الهرمزان فقال إني مستشيرك في مغازي هذه‏.‏ قال نعم، مثلها ومثل من فيها من الناس من عدو المسلمين مثل طائر له رأس وله جناحان وله رجلان، فإن كسر أحد الجناحين نهضت الرجلان بجناح والرأس، فإن كسر الجناح الآخر نهضت الرجلان والرأس، وإن شدخ الرأس ذهبت الرجلان والجناحان والرأس، فالرأس كسرى، والجناح قيصر، والجناح الآخر فارس، فمر المسلمين فلينفروا إلى كسرى‏.‏ وقال بكر وزياد جميعا عن جبير بن حية قال فندبنا عمر واستعمل علينا النعمان بن مقرن، حتى إذا كنا بأرض العدو، وخرج علينا عامل كسرى في أربعين ألفا، فقام ترجمان فقال ليكلمني رجل منكم‏.‏ فقال المغيرة سل عما شئت‏.‏ قال ما أنتم قال نحن أناس من العرب كنا في شقاء شديد وبلاء شديد، نمص الجلد والنوى من الجوع، ونلبس الوبر والشعر، ونعبد الشجر والحجر، فبينا نحن كذلك، إذ بعث رب السموات ورب الأرضين تعالى ذكره وجلت عظمته إلينا نبيا من أنفسنا، نعرف أباه وأمه، فأمرنا نبينا رسول ربنا صلى الله عليه وسلم أن نقاتلكم حتى تعبدوا الله وحده أو تؤدوا الجزية، وأخبرنا نبينا صلى الله عليه وسلم عن رسالة ربنا أنه من قتل منا صار إلى الجنة في نعيم لم ير مثلها قط، ومن بقي منا ملك رقابكم‏.‏ فقال النعمان ربما أشهدك الله مثلها مع النبي صلى الله عليه وسلم فلم يندمك ولم يخزك، ولكني شهدت القتال مع رسول الله صلى الله عليه وسلم كان إذا لم يقاتل في أول النهار انتظر حتى تهب الأرواح وتحضر الصلوات‏.‏",
      "text_en": " Narrated Jubair bin Haiya:                     `Umar sent the Muslims to the great countries to fight the pagans. When Al-Hurmuzan embraced Islam, `Umar said to him. \"I would like to consult you regarding these countries which I intend to invade.\" Al-Hurmuzan said, \"Yes, the example of these countries and their inhabitants who are the enemies. of the Muslims, is like a bird with a head, two wings and two legs; If one of its wings got broken, it would get up over its two legs, with one wing and the head; and if the other wing got broken, it would get up with two legs and a head, but if its head got destroyed, then the two legs, two wings and the head would become useless. The head stands for Khosrau, and one wing stands for Caesar and the other wing stands for Faris. So, order the Muslims to go towards Khosrau.\" So, `Umar sent us (to Khosrau) appointing An-Nu`man bin Muqrin as our commander. When we reached the land of the enemy, the representative of Khosrau came out with forty-thousand warriors, and an interpreter got up saying, \"Let one of you talk to me!\" Al-Mughira replied, \"Ask whatever you wish.\" The other asked, \"Who are you?\" Al-Mughira replied, \"We are some people from the Arabs; we led a hard, miserable, disastrous life: we used to suck the hides and the date stones from hunger; we used to wear clothes made up of fur of camels and hair of goats, and to worship trees and stones. While we were in this state, the Lord of the Heavens and the Earths, Elevated is His Remembrance and Majestic is His Highness, sent to us from among ourselves a Prophet whose father and mother are known to us. Our Prophet, the Messenger of our Lord, has ordered us to fight you till you worship Allah Alone or give Jizya (i.e. tribute); and our Prophet has informed us that our Lord says:-- \"Whoever amongst us is killed (i.e. martyred), shall go to Paradise to lead such a luxurious life as he has never seen, and whoever amongst us remain alive, shall become your master.\" (Al-Mughira, then blamed An-Nu`man for delaying the attack and) An-Nu' man said to Al-Mughira, \"If you had participated in a similar battle, in the company of Allah's Apostle he would not have blamed you for waiting, nor would he have disgraced you. But I accompanied Allah's Apostle in many battles and it was his custom that if he did not fight early by daytime, he would wait till the wind had started blowing and the time for the prayer was due (i.e. after midday).",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225"
      ]
    },
    {
      "hadith_no": "7624",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير بن حية، عن جبير بن حية، قال المغيرة أخبرنا نبينا، صلى الله عليه وسلم عن رسالة، ربنا ‏\"‏ أنه من قتل منا صار إلى الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Our Prophet has informed us our Lord's Message that whoever of us is martyred, will go to Paradise.",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "98",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني أحمد بن إبراهيم الدورقي، قال حدثني عبد السلام الوابصي، قال حدثني عبد الله بن جعفر الرقي، عن عبيد الله بن عمرو، قال كان يحيى بن أبي أنيسة كذابا ‏.‏",
      "text_en": "",
      "chain": [
        "30494",
        "30346",
        "30024"
      ]
    },
    {
      "hadith_no": "4043",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عبد الملك أبي زيد، عن طاوس، عن ابن، عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ من كانت له أرض فإنه أن يمنحها أخاه خير ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:                      He who has land, it is better for him that he should let it out to his brother.",
      "chain": [
        "30025",
        "30346",
        "30024",
        "11340",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن سفيان، ح وحدثني محمد، بن حاتم حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله، - يعني ابن عمرو - عن زيد، بن أبي أنيسة ح وحدثني عبد الرحمن بن بشر، حدثنا بهز، حدثنا حماد بن سلمة، كل هؤلاء عن سلمة بن كهيل، بهذا الإسناد ‏.‏ نحو حديث شعبة ‏.‏ وفي حديثهم جميعا ثلاثة أحوال إلا حماد بن سلمة فإن في حديثه عامين أو ثلاثة ‏.‏ وفي حديث سفيان وزيد بن أبي أنيسة وحماد بن سلمة ‏\"‏ فإن جاء أحد يخبرك بعددها ووعائها ووكائها فأعطها إياه ‏\"‏ ‏.‏ وزاد سفيان في رواية وكيع ‏\"‏ وإلا فهي كسبيل مالك ‏\"‏ ‏.‏ وفي رواية ابن نمير ‏\"‏ وإلا فاستمتع بها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Salama b. Kuhail through different chains of transmitters. In their ahadith, it is three years, except in the hadith of Hammid b. Salama it is two years or three years. In the hadith transmitted on the authority of Sufyan and Zaid b. Abu Unaisa and Hammid b. Salama (the words are):                     \" If someone comes and informs you about the number (of articles) of the bag and the straps, then give that to him.\" Sufyan has made this addition in the narration of Waki':\" Otherwise it is like your property.\" And in the narration of Ibn Numair the words are:\" Otherwise make use of that.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "30201",
        "20032",
        "30212",
        "20005",
        "38487",
        "30346",
        "30024",
        "11340",
        "30356",
        "20214"
      ]
    },
    {
      "hadith_no": "5440",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني عمرو الناقد، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن أنس بن مالك، قال أمر أبو طلحة أم سليم أن تصنع، للنبي صلى الله عليه وسلم طعاما لنفسه خاصة ثم أرسلني إليه ‏.‏ وساق الحديث وقال فيه فوضع النبي صلى الله عليه وسلم يده وسمى عليه ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فدخلوا فقال ‏\"‏ كلوا وسموا الله ‏\"‏ ‏.‏ فأكلوا حتى فعل ذلك بثمانين رجلا ‏.‏ ثم أكل النبي صلى الله عليه وسلم بعد ذلك وأهل البيت وتركوا سؤرا ‏.‏",
      "text_en": " Anas b. Malik reported:                      Abu Talha ordered Umm Sulaim to prepare a meal specially for Allah's Apostle (may peace be upon him). He then sent me to him (to the Holy Prophet) ; the rest of the hadith is the same (but there is a slight variation of wording):\" Allah's Messenger (may peace be upon him) placed his hand and mentioned the name of Allah upon that, and then said: Admit ten men. He (Abu Talha) admitted them and they got in. He (the Holy Prophet) said: Eat while mentioning the name of Allah upon it (the meal). They ate until eighty persons had taken the food. Then Allah's Apostle (may peace be upon him) had his meal and so the members of the household, and still they left some food.\"",
      "chain": [
        "30263",
        "30346",
        "30024",
        "11368",
        "11196",
        "19"
      ]
    },
    {
      "hadith_no": "7583",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني محمد بن حاتم، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن أيوب، عن حميد بن هلال، عن ثلاثة، رهط من قومه فيهم أبو قتادة قالوا كنا نمر على هشام بن عامر إلى عمران بن حصين ‏.‏ بمثل حديث عبد العزيز بن مختار غير أنه قال ‏\"‏ أمر أكبر من الدجال ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Imran b. Husain with a slight variation of wording.",
      "chain": [
        "38487",
        "30346",
        "30024",
        "11015",
        "11281"
      ]
    },
    {
      "hadith_no": "2686",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن الحسين الرقي، قال حدثنا عبد الله بن جعفر الرقي، قال أخبرني عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن إبراهيم، قال أراد الضحاك بن قيس أن يستعمل، مسروقا فقال له عمارة بن عقبة أتستعمل رجلا من بقايا قتلة عثمان فقال له مسروق حدثنا عبد الله بن مسعود - وكان في أنفسنا موثوق الحديث - أن النبي صلى الله عليه وسلم لما أراد قتل أبيك قال من للصبية قال ‏\"‏ النار ‏\"‏ ‏.‏ فقد رضيت لك ما رضي لك رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Ibrahim said: Ad-Dahhak ibn Qays intended to appoint Masruq as governor. Thereupon Umarah ibn Uqbah said to him: Are you appointing a man from the remnants of the murderers of Uthman? Masruq said to him: Ibn Mas'ud narrated to us, and he was trustworthy in respect of traditions, that when the Prophet (ﷺ) intended to kill your father, he said: Who will look after my children? He replied: Fire. I also like for you what the Messenger of Allah (ﷺ) liked for you.",
      "chain": [
        "38396",
        "30346",
        "30024",
        "11340",
        "11381",
        "11051",
        "16"
      ]
    },
    {
      "hadith_no": "4284",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثنا عبد الله بن جعفر الرقي، حدثنا أبو المليح الحسن بن عمر، عن زياد بن بيان، عن علي بن نفيل، عن سعيد بن المسيب، عن أم سلمة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المهدي من عترتي من ولد فاطمة ‏\"‏ ‏.‏ قال عبد الله بن جعفر وسمعت أبا المليح يثني على علي بن نفيل ويذكر منه صلاحا ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Prophet (ﷺ) said: The Mahdi will be of my family, of the descendants of Fatimah. Abdullah ibn Ja'far said: I heard AbulMalih praising Ali ibn Nufayl and describing his good qualities.",
      "chain": [
        "30494",
        "30346",
        "18303",
        "18760",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "4926",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن إبراهيم، قال حدثنا عبد الله بن جعفر الرقي، قال حدثنا أبو المليح، عن ميمون، عن نافع، قال كنا مع ابن عمر فسمع صوت، زامر فذكر نحوه ‏.‏ قال أبو داود وهذا أنكرها ‏.‏",
      "text_en": " Nafi said :                      When we were with Ibn ‘Umar, he heard the sound of a man who was blowing a pipe. He then mentioned a similar tradition.Abu Dawud said : This is more rejected.",
      "chain": [
        "30494",
        "30346",
        "11453",
        "11014",
        "30002"
      ]
    },
    {
      "hadith_no": "1221",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو الرقي، عن أيوب، عن محمد بن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم نهى أن يتلقى الجلب فإن تلقاه إنسان فابتاعه فصاحب السلعة فيها بالخيار إذا ورد السوق ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أيوب وحديث ابن مسعود حديث حسن صحيح ‏.‏ وقد كره قوم من أهل العلم تلقي البيوع وهو ضرب من الخديعة ‏.‏ وهو قول الشافعي وغيره من أصحابنا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Prophet (ﷺ) prohibited meeting the goods being brought (to the market). If someone were to meet them and buy them, then the owner of the goods retains the option when he reaches the market.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib narration of Ayyub (a narrator). The Hadith if Ibn Mas'ud is a Hasan Sahih Hadith. There are those among the people of knowledge who disliked meeting the owners of the goods, saying that it is a type of deception. This is the view of Ash-Shafi'i, and others among our companions.",
      "chain": [
        "30417",
        "30346",
        "20445",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4064",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن زيد، هو ابن أبي أنيسة عن أبي إسحاق، عن أبي عبد الرحمن السلمي، قال لما حصر عثمان أشرف عليهم فوق داره ثم قال أذكركم بالله هل تعلمون أن حراء حين انتفض قال رسول الله صلى الله عليه وسلم ‏\"‏ اثبت حراء فليس عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال أذكركم بالله هل تعلمون أن رسول الله صلى الله عليه وسلم قال في جيش العسرة ‏\"‏ من ينفق نفقة متقبلة ‏\"‏ ‏.‏ والناس مجهدون معسرون فجهزت ذلك الجيش قالوا نعم ‏.‏ ثم قال أذكركم بالله هل تعلمون أن بئر رومة لم يكن يشرب منها أحد إلا بثمن فابتعتها فجعلتها للغني والفقير وابن السبيل قالوا اللهم نعم وأشياء عددها ‏.‏ هذا حديث حسن صحيح غريب من هذا الوجه من حديث أبي عبد الرحمن السلمي عن عثمان ‏.‏",
      "text_en": " Narrated Abu 'Abdur-Rahman As-Sulami:                     \"When 'Uthman was besieged, he looked out over them from atop his house and said: 'I remind you by Allah. Do you know that when (mount) Hira shook, the Messenger of Allah (ﷺ) said: \"Be firm O Hira! For there is none upon you except a Prophet, a Siddiq, and a martyr?\"' They said: 'Yes.' He said: 'I remind you by Allah! Do you know that the Messenger of Allah (ﷺ) said, about the army of distress (Al-'Usrah): \"Who will spend something which shall be accepted (by Allah)?\" And the people were struggling during difficult times, so I prepared that army?' They said: 'Yes.' Then he said: 'I remind you by Allah. Do you know that no one drank from the well of Rumah but have to pay for it, then I bought it and made it for the rich, the poor, and the wayfarer?' They said: 'O Allah! Yes!'\" And he listed other things. This Hadith is Hasan Sahih Gharib from this route; as a narration of Abu 'Abdur-Rahman As-Sulami from 'Uthman.",
      "chain": [
        "30025",
        "30346",
        "30024",
        "11340",
        "11049",
        "11359"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله، عن عبد الكريم، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني أعطيت أمي حديقة لي وإنها ماتت ولم تترك وارثا غيري فقال رسول الله صلى الله عليه وسلم ‏\"‏ وجبت صدقتك ورجعت إليك حديقتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr  bin Shu'aib, from his father, that his grandfather said:                     “A man came to the Prophet (ﷺ) and said: 'I gave my mother a garden of mine, and she has died and has no other heir but me.' The Messenger of Allah(ﷺ) said: 'Your charity is valid and your garden has been returned to you.' ”",
      "chain": [
        "11222",
        "30346",
        "11201",
        "18655",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 13
}