{
  "id": "30340",
  "name": "Salmah bin Sulaiman al-Mervazi سلمة بن سليمان المروزي",
  "full_name": "Salmah bin Sulaiman al-Mervazi سلمة بن سليمان المروزي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Mervazi",
      "al-Mu'addab"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20458",
      "name": "Muhammad bin Maymun, Abu Hamza محمد بن ميمون المروزي أبو حمزة السكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30561",
      "name": "Muhammad bin 'Abdullah bin Qahzad محمد بن عبد الله بن قهزاد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30300",
      "name": "Ahmed bin Abi Raj'a أحمد بن أبي رجاء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30295",
      "name": "Ahmed bin Sa'id bin Ibrahim أحمد بن سعيد بن إبراهيم الرباطي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30556",
      "name": "'Ali bin Khashram علي بن خشرم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38366",
      "name": "Abd'h bin Abd al-Rhym عبدة بن عبد الرحيم بن حسان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38908",
      "name": "Muhammad bin Aslam bin Salm محمد بن أسلم بن سالم",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-5546",
      "hadith_no": "5546",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة،‏.‏ وحدثني أحمد بن أبي رجاء، حدثنا سلمة بن سليمان، عن ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، قال أخبرني أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني  رضى الله عنه  يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم أهل الكتاب، نأكل في آنيتهم، وأرض صيد أصيد بقوسي، وأصيد بكلبي المعلم، والذي ليس معلما، فأخبرني ما الذي يحل لنا من ذلك فقال ‏\"‏ أما ما ذكرت أنك بأرض قوم أهل الكتاب، تأكل في آنيتهم، فإن وجدتم غير آنيتهم، فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها ثم كلوا فيها، وأما ما ذكرت أنك بأرض صيد، فما صدت بقوسك، فاذكر اسم الله، ثم كل، وما صدت بكلبك المعلم، فاذكر اسم الله، ثم كل، وما صدت بكلبك الذي ليس معلما فأدركت ذكاته، فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to Allah's Apostle and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow and trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your saying that you are living in the land of the people of the Scripture and that you eat in their utensils, if you can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than theirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if you hung something with your bow, and have mentioned Allah's Name while hunting, then you can eat (the game). And if you hunt something with your trained hound, and have mentioned Allah's Name on sending it for hunting then you can eat (the game). But if you hunt something with your untrained hound and you were able to slaughter it before its death, you can eat of it.\"",
      "usc_msa_ref": "396",
      "chain": [
        "20241",
        "30300",
        "30340",
        "20025",
        "26010",
        "11414"
      ]
    },
    {
      "id": "sahih-muslim-390-4",
      "hadith_no": "390",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، حدثنا حجين، - وهو ابن المثنى - حدثنا الليث، عن عقيل، ح وحدثني محمد بن عبد الله بن قهزاذ، حدثنا سلمة بن سليمان، أخبرنا يونس، كلاهما عن الزهري، بهذا الإسناد كما قال ابن جريج كان رسول الله صلى الله عليه وسلم إذا قام للصلاة رفع يديه حتى تكونا حذو منكبيه ثم كبر ‏.‏",
      "text_en": " This hadith has been transmitted with the same chain of transmitters by al. Zuhri as narrated by Ibn Juraij (who) said. When the Messenger of Allah (may peace be upon him) stood up for prayer, he raised hands (to the height) apposite the shoulders and then recited takbir.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20382",
        "20023",
        "11207",
        "30561",
        "30340",
        "11070"
      ]
    },
    {
      "id": "sahih-muslim-2579",
      "hadith_no": "2579",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنيه محمد بن عبد الله بن قهزاذ، حدثنا علي بن الحسن بن شقيق، وسلمة، بن سليمان قالا أخبرنا عبد الله، - يعني ابن المبارك - أخبرنا إسماعيل بن أبي خالد، في هذا الإسناد بمعنى حديثهما ‏.‏",
      "text_en": "  This hadith has been narrated by Ibn Abu Khalid with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30362",
        "30340",
        "20025"
      ]
    },
    {
      "id": "sahih-muslim-6861",
      "hadith_no": "6861",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الله بن قهزاذ، حدثنا سلمة بن سليمان، أخبرنا عبد الله، أخبرنا معمر، عن ابن شهاب، حدثني عبد الله بن أبي بكر بن حزم، عن عروة، عن عائشة، ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30561",
        "30340",
        "20025",
        "20115",
        "11013",
        "11104",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-3097",
      "hadith_no": "3097",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبدة بن عبد الرحيم، قال حدثنا سلمة بن سليمان، قال أنبأنا ابن المبارك، قال أنبأنا وهيب، - يعني ابن الورد - قال أخبرني عمر بن محمد بن المنكدر، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من مات ولم يغز ولم يحدث نفسه بغزو مات على شعبة نفاق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"Whoever dies without having fought or thought of fighting, he dies on one of the branches of hypocrisy.\"",
      "usc_msa_ref": "",
      "chain": [
        "38366",
        "30340",
        "20025",
        "20527",
        "20513",
        "11428",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}