{
  "id": "30353",
  "name": "'Abdullah bin Muneer عبد الله بن منير أبو عبد الرحمن المروزي",
  "full_name": "'Abdullah bin Muneer عبد الله بن منير أبو عبد الرحمن المروزي",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Mervazi",
      "Zahid",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30283",
      "name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20471",
      "name": "Yazid bin Abi Hkym يزيد بن أبي حكيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "195",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن منير، سمع عبد الله بن بكر، قال حدثنا حميد، عن أنس، قال حضرت الصلاة، فقام من كان قريب الدار إلى أهله، وبقي قوم، فأتي رسول الله صلى الله عليه وسلم بمخضب من حجارة فيه ماء، فصغر المخضب أن يبسط فيه كفه، فتوضأ القوم كلهم‏.‏ قلنا كم كنتم قال ثمانين وزيادة‏.‏",
      "text_en": " Narrated Anas:                     It was the time for prayer, and those whose houses were near got up and went to their people (to perform ablution), and there remained some people (sitting). Then a painted stove pot (Mikhdab) containing water was brought to Allah's Apostles The pot was small, not broad enough for one to spread one's hand in; yet all the people performed ablution. (The sub narrator said, \"We asked Anas, 'How many persons were you?' Anas replied 'We were eighty or more\"). (It was one of the miracles of Allah's Apostle).",
      "chain": [
        "30353",
        "20244",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تصدق بعدل تمرة من كسب طيب  ولا يقبل الله إلا الطيب  وإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوه حتى تكون مثل الجبل ‏\"‏‏.‏ تابعه سليمان عن ابن دينار‏.‏ وقال ورقاء عن ابن دينار، عن سعيد بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏ ورواه مسلم بن أبي مريم وزيد بن أسلم وسهيل عن أبي صالح عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If one give in charity what equals one date-fruit from the honestly earned money and Allah accepts only the honestly earned money --Allah takes it in His right (hand) and then enlarges its reward for that person (who has given it), as anyone of you brings up his baby horse, so much s that it becomes as big as a mountain",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1533",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن منير، سمع يزيد العدني، حدثنا سفيان، عن زيد بن أسلم، قال حدثني عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري  رضى الله عنه  قال كنا نعطيها في زمان النبي صلى الله عليه وسلم صاعا من طعام، أو صاعا من تمر، أو صاعا من شعير، أو صاعا من زبيب، فلما جاء معاوية وجاءت السمراء قال أرى مدا من هذا يعدل مدين‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     In the lifetime of the Prophet we used to give one Sa' of food or one Sa' of dates or one Sa' of barley or one Sa' of Raisins (dried grapes) as Sadaqat-ul-Fitr. And when Muawiya became the Caliph and the wheat was (available in abundance) he said, \"I think (observe) that one Mudd (of wheat) equals two Mudds (of any of the above mentioned things).",
      "chain": [
        "30353",
        "20012",
        "11163",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1935",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن منير، سمع يزيد بن هارون، حدثنا يحيى  هو ابن سعيد  أن عبد الرحمن بن القاسم، أخبره عن محمد بن جعفر بن الزبير بن العوام بن خويلد، عن عباد بن عبد الله بن الزبير، أخبره أنه، سمع عائشة  رضى الله عنها  تقول إن رجلا أتى النبي صلى الله عليه وسلم فقال إنه احترق‏.‏ قال ‏\"‏ مالك ‏\"‏‏.‏ قال أصبت أهلي في رمضان‏.‏ فأتي النبي صلى الله عليه وسلم بمكتل، يدعى العرق فقال ‏\"‏ أين المحترق ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ تصدق بهذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     A man came to the Prophet and said that he had been burnt (ruined). The Prophet asked him what was the matter. He replied, \"I had sexual intercourse with my wife in Ramadan (while I was fasting).\" Then a basket full of dates was brought to the Prophet and he asked, \"Where is the burnt (ruined) man?\" He replied, \"I am present.\" The Prophet told him to give that basket in charity (as expiation).",
      "chain": [
        "30353",
        "20472",
        "11062",
        "10530",
        "20173",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "2036",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثني عبد الله بن منير، سمع هارون بن إسماعيل، حدثنا علي بن المبارك، قال حدثني يحيى بن أبي كثير، قال سمعت أبا سلمة بن عبد الرحمن، قال سألت أبا سعيد الخدري  رضى الله عنه  قلت هل سمعت رسول الله صلى الله عليه وسلم يذكر ليلة القدر قال نعم، اعتكفنا مع رسول الله صلى الله عليه وسلم العشر الأوسط من رمضان  قال  فخرجنا صبيحة عشرين، قال فخطبنا رسول الله صلى الله عليه وسلم صبيحة عشرين فقال ‏\"‏ إني أريت ليلة القدر، وإني نسيتها، فالتمسوها في العشر الأواخر في وتر، فإني رأيت أني أسجد في ماء وطين، ومن كان اعتكف مع رسول الله صلى الله عليه وسلم فليرجع ‏\"‏‏.‏ فرجع الناس إلى المسجد، وما نرى في السماء قزعة  قال  فجاءت سحابة فمطرت، وأقيمت الصلاة، فسجد رسول الله صلى الله عليه وسلم في الطين والماء، حتى رأيت الطين في أرنبته وجبهته‏.‏",
      "text_en": " Narrated Abu Salama bin `Abdur-Rahman:                     I asked Abu Sa`id Al-Khudri, \"Did you hear Allah's Apostle talking about the Night of Qadr?\" He replied in the affirmative and said, \"Once we were in I`tikaf with Allah's Apostle in the middle ten days of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Apostledelivered a sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of Qadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the month of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of Qadr). So, whoever had been in I`tikaf with Allah's Apostle should return for it.' The people returned to the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came and it rained. Then the prayer was established (they stood for the prayer) and Allah's Apostle prostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.",
      "chain": [
        "30353",
        "20449",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2653",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن منير، سمع وهب بن جرير، وعبد الملك بن إبراهيم، قالا حدثنا شعبة، عن عبيد الله بن أبي بكر بن أنس، عن أنس  رضى الله عنه  قال سئل النبي صلى الله عليه وسلم عن الكبائر قال ‏\"‏ الإشراك بالله، وعقوق الوالدين، وقتل النفس، وشهادة الزور ‏\"‏‏.‏ تابعه غندر وأبو عامر وبهز وعبد الصمد عن شعبة‏.‏",
      "text_en": " Narrated Anas:                     The Prophet was asked about the great sins He said, \"They are:-- (1 ) To join others in worship with Allah, (2) To be undutiful to one's parents. (3) To kill a person (which Allah has forbidden to kill) (i.e. to commit the crime of murdering). (4) And to give a false witness.\"",
      "chain": [
        "30353",
        "20298",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "2892",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبي حازم، عن سهل بن سعد الساعدي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رباط يوم في سبيل الله خير من الدنيا وما عليها، وموضع سوط أحدكم من الجنة خير من الدنيا وما عليها، والروحة يروحها العبد في سبيل الله أو الغدوة خير من الدنيا وما عليها ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa'di:                     Allah's Apostle said, \"To guard Muslims from infidels in Allah's Cause for one day is better than the world and whatever is on its surface, and a place in Paradise as small as that occupied by the whip of one of you is better than the world and whatever is on its surface; and a morning's or an evening's journey which a slave (person) travels in Allah's Cause is better than the world and whatever is on its surface.\"",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3616",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن منير، سمع يزيد، أخبرنا حميد، عن أنس  رضى الله عنه  قال حضرت الصلاة فقام من كان قريب الدار من المسجد يتوضأ، وبقي قوم، فأتي النبي صلى الله عليه وسلم بمخضب من حجارة فيه ماء، فوضع كفه فصغر المخضب أن يبسط فيه كفه، فضم أصابعه فوضعها في المخضب، فتوضأ القوم كلهم جميعا‏.‏ قلت كم كانوا قال ثمانون رجلا‏.‏",
      "text_en": " Narrated Humaid:                     Anas bin Malik said, \"Once the time of the prayer became due and the people whose houses were close to the Mosque went to their houses to perform ablution, while the others remained (sitting there). A stone pot containing water was brought to the Prophet, who wanted to put his hand in it, but It was too small for him to spread his hand in it, and so he had to bring his fingers together before putting his hand in the pot. Then all the people performed the ablution (with that water).\" I asked Anas, \"How many persons were they.\" He replied, \"There were eighty men.\"",
      "chain": [
        "30353",
        "20472",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4520",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن منير، سمع عبد الله بن بكر، حدثنا حميد، عن أنس، قال سمع عبد الله بن سلام، بقدوم رسول الله صلى الله عليه وسلم وهو في أرض يخترف، فأتى النبي صلى الله عليه وسلم فقال إني سائلك عن ثلاث لا يعلمهن إلا نبي فما أول أشراط الساعة وما أول طعام أهل الجنة وما ينزع الولد إلى أبيه أو إلى أمه قال ‏\"‏ أخبرني بهن جبريل آنفا ‏\"‏‏.‏ قال جبريل قال ‏\"‏ نعم ‏\"‏‏.‏ قال ذاك عدو اليهود من الملائكة‏.‏ فقرأ هذه الآية ‏{‏من كان عدوا لجبريل فإنه نزله على قلبك‏}‏ أما أول أشراط الساعة فنار تحشر الناس من المشرق إلى المغرب، وأما أول طعام أهل الجنة فزيادة كبد حوت، وإذا سبق ماء الرجل ماء المرأة نزع الولد، وإذا سبق ماء المرأة نزعت ‏\"‏‏.‏ قال أشهد أن لا إله إلا الله، وأشهد أنك رسول الله‏.‏ يا رسول الله إن اليهود قوم بهت، وإنهم إن يعلموا بإسلامي قبل أن تسألهم يبهتوني‏.‏ فجاءت اليهود فقال النبي صلى الله عليه وسلم ‏\"‏ أى رجل عبد الله فيكم ‏\"‏‏.‏ قالوا خيرنا وابن خيرنا، وسيدنا وابن سيدنا‏.‏ قال ‏\"‏ أرأيتم إن أسلم عبد الله بن سلام ‏\"‏‏.‏ فقالوا أعاذه الله من ذلك‏.‏ فخرج عبد الله فقال أشهد أن لا إله إلا الله، وأن محمدا رسول الله‏.‏ فقالوا شرنا وابن شرنا‏.‏ وانتقصوه‏.‏ قال فهذا الذي كنت أخاف يا رسول الله‏.‏",
      "text_en": " Narrated Anas:                     `Abdullah bin Salam heard the news of the arrival of Allah's Apostle (at Medina) while he was on a farm collecting its fruits. So he came to the Prophet and said, \"I will ask you about three things which nobody knows unless he be a prophet. Firstly, what is the first portent of the Hour? What is the first meal of the people of Paradise? And what makes a baby look like its father or mother?'. The Prophet said, \"Just now Gabriel has informed me about that.\" `Abdullah said, \"Gabriel?\" The Prophet said, \"Yes.\" `Abdullah said, \"He, among the angels is the enemy of the Jews.\" On that the Prophet recited this Holy Verse:-- \"Whoever is an enemy to Gabriel (let him die in his fury!) for he has brought it (i.e. Qur'an) down to your heart by Allah's permission.\" (2.97) Then he added, \"As for the first portent of the Hour, it will be a fire that will collect the people from the East to West. And as for the first meal of the people of Paradise, it will be the caudite (i.e. extra) lobe of the fish liver. And if a man's discharge proceeded that of the woman, then the child resembles the father, and if the woman's discharge proceeded that of the man, then the child resembles the mother.\" On hearing that, `Abdullah said, \"I testify that None has the right to be worshipped but Allah, and that you are the Apostle of Allah, O, Allah's Apostle; the Jews are liars, and if they should come to know that I have embraced Islam, they would accuse me of being a liar.\" In the meantime some Jews came (to the Prophet) and he asked them, \"What is `Abdullah's status amongst you?\" They replied, \"He is the best amongst us, and he is our chief and the son of our chief.\" The Prophet said, \"What would you think if `Abdullah bin Salam embraced Islam?\" They replied, \"May Allah protect him from this!\" Then `Abdullah came out and said, \"I testify that None has the right to be worshipped but Allah and that Muhammad is the Apostle of Allah.\" The Jews then said, \"Abdullah is the worst of us and the son of the worst of us,\" and disparaged him. On that `Abdullah said, \"O Allah's Apostle! This is what I was afraid of!\"",
      "chain": [
        "30353",
        "20244",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4541",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن منير، سمع عبد الله بن بكر السهمي، حدثنا حميد، عن أنس، أن الربيع، عمته كسرت ثنية جارية، فطلبوا إليها العفو فأبوا، فعرضوا الأرش فأبوا، فأتوا رسول الله صلى الله عليه وسلم وأبوا إلا القصاص، فأمر رسول الله صلى الله عليه وسلم بالقصاص، فقال أنس بن النضر يا رسول الله، أتكسر ثنية الربيع لا والذي بعثك بالحق لا تكسر ثنيتها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أنس كتاب الله القصاص ‏\"‏‏.‏ فرضي القوم فعفوا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     That his aunt, Ar-Rubai' broke an incisor tooth of a girl. My aunt's family requested the girl's relatives for forgiveness but they refused; then they proposed a compensation, but they refused. Then they went to Allah's Apostle and refused everything except Al-Qisas (i.e. equality in punishment). So Allah's Apostle passed the judgment of Al-Qisas (i.e. equality of punishment). Anas bin Al-Nadr said, \"O Allah's Apostle! Will the incisor tooth of Ar-Rubai be broken? No, by Him Who sent you with the Truth, her incisor tooth will not be broken.\" Allah's Apostle said, \"O Anas! The prescribed law of Allah is equality in punishment (i.e. Al-Qisas.)\" Thereupon those people became satisfied and forgave her. Then Allah's Apostle said, \"Among Allah's Worshippers there are some who, if they took Allah's Oath (for something), Allah fulfill their oaths.\"",
      "chain": [
        "30353",
        "20244",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4607",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آتاه الله مالا فلم يؤد زكاته، مثل له ماله شجاعا أقرع، له زبيبتان يطوقه يوم القيامة، يأخذ بلهزمتيه  يعني بشدقيه  يقول أنا مالك أنا كنزك ‏\"‏‏.‏ ثم تلا هذه الآية ‏{‏ولا يحسبن الذين يبخلون بما آتاهم الله من فضله‏}‏ إلى آخر الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Anyone whom Allah has given wealth but he does not pay its Zakat, then, on the Day of Resurrection, his wealth will be presented to him in the shape of a bald-headed poisonous male snake with two poisonous glands in its mouth and it will encircle itself round his neck and bite him over his cheeks and say, \"I am your wealth; I am your treasure.\" Then the Prophet recited this Divine Verse:-- \"And let not those who covetously withhold of that which Allah has bestowed upon them of His Bounty.\" (3.180)",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5475",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن منير، سمع أبا حاتم الأشهل بن حاتم، حدثنا ابن عون، عن ثمامة بن أنس، عن أنس  رضى الله عنه  قال دخلت مع النبي صلى الله عليه وسلم على غلام له خياط، فقدم إليه قصعة فيها ثريد  قال  وأقبل على عمله  قال  فجعل النبي صلى الله عليه وسلم يتتبع الدباء  قال  فجعلت أتتبعه فأضعه بين يديه  قال  فما زلت بعد أحب الدباء‏.‏",
      "text_en": " Narrated Anas:                     I went along with the Prophet to the house of a young tailor of his. The tailor presented a dish of Tharid to the Prophet and resumed his work. The Prophet started picking the pieces of gourd and I too, started picking them and putting it before him. Since then I have always loved (to eat) gourd.",
      "chain": [
        "30353",
        "11071",
        "19"
      ]
    },
    {
      "hadith_no": "5490",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عبد الله بن منير، سمع النضر، أخبرنا ابن عون، قال أخبرني ثمامة بن عبد الله بن أنس، عن أنس  رضى الله عنه  قال كنت غلاما أمشي مع رسول الله صلى الله عليه وسلم فدخل رسول الله صلى الله عليه وسلم على غلام له خياط، فأتاه بقصعة فيها طعام وعليه دباء، فجعل رسول الله صلى الله عليه وسلم يتتبع الدباء  قال  فلما رأيت ذلك جعلت أجمعه بين يديه  قال  فأقبل الغلام على عمله‏.‏ قال أنس لا أزال أحب الدباء بعد ما رأيت رسول الله صلى الله عليه وسلم صنع ما صنع‏.‏",
      "text_en": " Narrated Anas:                     I was a young boy when I once was walking with Allah's Apostle . Allah's Apostle entered the house of his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's Apostle started picking and eating the gourd. When I saw that, I started collecting and placing the gourd before him. Then the slave returned to his work. Anas added: I have kept on loving gourd since I saw Allah's Apostle doing what he was doing.",
      "chain": [
        "30353",
        "20291",
        "11071",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6556",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن بن عبد الله  يعني ابن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن العبد ليتكلم بالكلمة من رضوان الله لا يلقي لها بالا، يرفع الله بها درجات، وإن العبد ليتكلم بالكلمة من سخط الله لا يلقي لها بالا يهوي بها في جهنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet; said, \"A slave (of Allah) may utter a word which pleases Allah without giving it much importance, and because of that Allah will raise him to degrees (of reward): a slave (of Allah) may utter a word (carelessly) which displeases Allah without thinking of its gravity and because of that he will be thrown into the Hell-Fire.\"",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "254",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن منير المروزي، قال سمعت علي بن الحسن، قال أخبرنا عبد الله بن المبارك، عن ابن جريج، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يكبر وهو يهوي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين قالوا يكبر الرجل وهو يهوي للركوع والسجود ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger would say the Takhir while he was going down.\"",
      "chain": [
        "30353",
        "20025",
        "11070",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سلمة بن شبيب، وأحمد بن إبراهيم الدورقي، والحسن بن علي الحلواني، وعبد الله بن منير، وغير، واحد، قالوا حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم إذا سجد يضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ قال زاد الحسن بن علي في حديثه قال يزيد بن هارون ولم يرو شريك عن عاصم بن كليب إلا هذا الحديث ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرف أحدا رواه مثل هذا عن شريك ‏.‏ والعمل عليه عند أكثر أهل العلم يرون أن يضع الرجل ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ وروى همام عن عاصم هذا مرسلا ولم يذكر فيه وائل بن حجر ‏.‏",
      "text_en": " Wa'il bin Hujr narrated:                     \"I saw Allah's Messenger when he prostrated placing his knees (on the ground) before his hands, and when he got up, he raised his hands before his knees.\"",
      "chain": [
        "30417",
        "30494",
        "30115",
        "30353",
        "20472",
        "11858",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن عيسى بن يزيد البغدادي، حدثنا عبد الله بن بكر السهمي، ‏.‏ وحدثنا عبد الله بن منير، عن عبد الله بن بكر، عن فائد بن عبد الرحمن، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له إلى الله حاجة أو إلى أحد من بني آدم فليتوضأ وليحسن الوضوء ثم ليصل ركعتين ثم ليثن على الله وليصل على النبي صلى الله عليه وسلم ثم ليقل لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم الحمد لله رب العالمين أسألك موجبات رحمتك وعزائم مغفرتك والغنيمة من كل بر والسلامة من كل إثم لا تدع لي ذنبا إلا غفرته ولا هما إلا فرجته ولا حاجة هي لك رضا إلا قضيتها يا أرحم الراحمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وفي إسناده مقال ‏.‏ فائد بن عبد الرحمن يضعف في الحديث وفائد هو أبو الورقاء ‏.‏",
      "text_en": " Abdullah bin Abi Awfa narrated that :                     Allah's Messenger said: \"Whomever has a need from Allah, or from one of the sons of Adam, then let him perform Wudu, performing it well, then pry two Rak'ah, then pray Allah and say Salat upon the Prophet. Then let him say: (L ilaha illallah Al-Halimul-Karim. Subhan Alla Rabbil-Arshil-Azim. Al-Hamdulillahi Rabbil-Alamin. Asaluka mujibati rahmatika wa aza'im maghfiratika, wal-ghanimata min kulli birrin, was-salamata min kulli ithmin la tada li dhanban illa ghafartahu, wa la hamman illa farrajtahu, wa la Hajatan hiya laka radan Illa Qadaitaha, ya arham ar-rahimin.) 'None has the right t be worshiped but Allah. Al-Halim (the Forbearing) Al-Karim (the Generous). Glorious is Allah, Lord of the Magnificent Throne. All praise is due to Allah, Lord of the worlds. I ask You for that which warrants Your mercy, and that which will determine Your forgiveness, and the spoils (fruits) of every righteous deed, and safety from every sin; do not leave a sin for me without forgiving it, nor a worry without relieving it. Or a need that pleases you without granting it. O Most-Merciful of those who have mercy.'\"",
      "chain": [
        "30353",
        "20244",
        "5115"
      ]
    },
    {
      "hadith_no": "1034",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن منير، عن سعيد بن عامر، عن همام، عن أبي غالب، قال صليت مع أنس بن مالك على جنازة رجل فقام حيال رأسه ثم جاءوا بجنازة امرأة من قريش فقالوا يا أبا حمزة صل عليها ‏.‏ فقام حيال وسط السرير ‏.‏ فقال له العلاء بن زياد هكذا رأيت النبي صلى الله عليه وسلم قام على الجنازة مقامك منها ومن الرجل مقامك منه قال نعم ‏.‏ فلما فرغ قال احفظوا ‏.‏ وفي الباب عن سمرة ‏.‏ قال أبو عيسى حديث أنس هذا حديث حسن وقد روى غير واحد عن همام مثل هذا ‏.‏ وروى وكيع هذا الحديث عن همام فوهم فيه فقال عن غالب عن أنس ‏.‏ والصحيح عن أبي غالب ‏.‏ وقد روى هذا الحديث عبد الوارث بن سعيد وغير واحد عن أبي غالب مثل رواية همام ‏.‏ واختلفوا في اسم أبي غالب هذا فقال بعضهم يقال اسمه نافع ويقال رافع ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Abu Ghalib narrated:                     \"I prayed for the funeral of a man with Anas bin Malik, so he stood parallel to his head. Then they came with the body of a woman from the Quraish. They said: 'O Abu Hamzah perform the prayer for her.' So he stood parallel to her waist. Al-Ala bin Ziyad said to him: 'Is this how you saw the Messenger of Allah standing in the place for the funeral as you did for her, and for a place that you stood for the man?' He said: 'Yes.' When he was finished he said: 'Remember (this).'\"",
      "chain": [
        "30353",
        "20232",
        "20297"
      ]
    },
    {
      "hadith_no": "1295",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن منير، قال سمعت أبا عاصم، عن شبيب بن بشر، عن أنس بن مالك، قال لعن رسول الله صلى الله عليه وسلم في الخمر عشرة عاصرها ومعتصرها وشاربها وحاملها والمحمولة إليه وساقيها وبائعها وآكل ثمنها والمشتري لها والمشتراة له ‏.‏ قال أبو عيسى هذا حديث غريب من حديث أنس ‏.‏ وقد روي نحو هذا عن ابن عباس وابن مسعود وابن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) cursed ten involved in wine: The one who presses it, the one who has it pressed, its drinker, its carrier, and the one it is carried to, its server, its seller, the consumption of its price, the one who purchases it and the one it was purchased for.\"[Abu 'Eisa said:] This Hadith is Gharib as a narration of Anas. Similar to this has been reported from Ibn 'Abbas, Ibn Mas'ud, and Ibn 'Umar, from the Prophet (ﷺ).",
      "chain": [
        "30353",
        "20241",
        "15223",
        "19"
      ]
    }
  ],
  "total_hadiths": 19
}