{
  "id": "30355",
  "name": "'Abdullah bin Yusuf al-Tunaysi عبد الله بن يوسف التنيسي",
  "full_name": "'Abdullah bin Yusuf al-Tunaysi عبد الله بن يوسف التنيسي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "218",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus",
      " Egypt",
      " Tunis"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Kula'i",
      "Damascus",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20432",
      "name": "'Abdullah bin Salm al-Asha'ri عبد الله بن سالم الأشعري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20702",
      "name": "'Abdur Rahman bin Abi Rajal عبد الرحمن بن أبي الرجال بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20744",
      "name": "al-Hythm bin Hameed al-Ghsany الهيثم بن حميد الغساني مولاهم أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26016",
      "name": "Salmah bin al-'Ayyar سلمة بن العيار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36057",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Rahim محمد بن عبد الله بن عبد الرحيم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38582",
      "name": "Muhammad bin Muhammad bin Mus'ab محمد بن محمد بن مصعب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36024",
      "name": "al-Rabi' bin Sulaiman bin Da'ud الربيع بن سليمان بن داود",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30487",
      "name": "Hrmlh bin Yahya bin حرملة بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30230",
      "name": "al-Hasan bin 'Abdul 'Aziz al-Jarwa الحسن بن عبد العزيز بن الوزير الجروى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين  رضى الله عنها  أن الحارث بن هشام  رضى الله عنه  سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله كيف يأتيك الوحى فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحيانا يأتيني مثل صلصلة الجرس  وهو أشده على  فيفصم عني وقد وعيت عنه ما قال، وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول ‏\"‏‏.‏ قالت عائشة رضى الله عنها ولقد رأيته ينزل عليه الوحى في اليوم الشديد البرد، فيفصم عنه وإن جبينه ليتفصد عرقا‏.‏",
      "text_en": "      Narrated 'Aisha:                          (the mother of the faithful believers) Al-Harith bin Hisham asked Allah's Apostle \"O Allah's Apostle! How is the Divine Inspiration revealed to you?\" Allah's Apostle replied, \"Sometimes it is (revealed) like the ringing of a bell, this form of Inspiration is the hardest of all and then this state passes off after I have grasped what is inspired. Sometimes the Angel comes in the form of a man and talks to me and I grasp whatever he says.\" 'Aisha added: Verily I saw the Prophet being inspired divinely on a very cold day and noticed the sweat dropping from his forehead (as the Inspiration was over).",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "24",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك بن أنس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم مر على رجل من الأنصار وهو يعظ أخاه في الحياء، فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعه فإن الحياء من الإيمان ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah (bin 'Umar):                          Once Allah's Apostle passed by an Ansari (man) who was admonishing to      his brother regarding Haya'. On that Allah's Apostle said, \"Leave him      as Haya' is a part of faith.\" (See Hadith No. 8)",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "63",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن سعيد  هو المقبري  عن شريك بن عبد الله بن أبي نمر، أنه سمع أنس بن مالك، يقول بينما نحن جلوس مع النبي صلى الله عليه وسلم في المسجد، دخل رجل على جمل فأناخه في المسجد، ثم عقله، ثم قال لهم أيكم محمد والنبي صلى الله عليه وسلم متكئ بين ظهرانيهم‏.‏ فقلنا هذا الرجل الأبيض المتكئ‏.‏ فقال له الرجل ابن عبد المطلب فقال له النبي صلى الله عليه وسلم ‏\"‏ قد أجبتك ‏\"‏‏.‏ فقال الرجل للنبي صلى الله عليه وسلم إني سائلك فمشدد عليك في المسألة فلا تجد على في نفسك‏.‏ فقال ‏\"‏ سل عما بدا لك ‏\"‏‏.‏ فقال أسألك بربك ورب من قبلك، آلله أرسلك إلى الناس كلهم فقال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن نصلي الصلوات الخمس في اليوم والليلة قال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن نصوم هذا الشهر من السنة قال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن تأخذ هذه الصدقة من أغنيائنا فتقسمها على فقرائنا فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏‏.‏ فقال الرجل آمنت بما جئت به، وأنا رسول من ورائي من قومي، وأنا ضمام بن ثعلبة أخو بني سعد بن بكر‏.‏ رواه موسى وعلي بن عبد الحميد عن سليمان عن ثابت عن أنس عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While we were sitting with the Prophet in the mosque, a man came riding on a camel. He made his camel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" At that time the Prophet was sitting amongst us (his companions) leaning on his arm. We replied, \"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" The Prophet said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask you something and will be hard in questioning. So do not get angry.\" The Prophet said, \"Ask whatever you want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has Allah sent you as an Apostle to all the mankind?\" The Prophet replied, \"By Allah, yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 hours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered you to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from our rich people and distribute it amongst our poor people?\" The Prophet replied, \"By Allah, yes.\" Thereupon that man said, \"I have believed in all that with which you have been sent, and I have been sent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin Bakr.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "104",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثني الليث، قال حدثني سعيد، عن أبي شريح، أنه قال لعمرو بن سعيد وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به النبي صلى الله عليه وسلم الغد من يوم الفتح، سمعته أذناى ووعاه قلبي، وأبصرته عيناى، حين تكلم به، حمد الله وأثنى عليه ثم قال ‏\"‏ إن مكة حرمها الله، ولم يحرمها الناس، فلا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما، ولا يعضد بها شجرة، فإن أحد ترخص لقتال رسول الله صلى الله عليه وسلم فيها فقولوا إن الله قد أذن لرسوله، ولم يأذن لكم‏.‏ وإنما أذن لي فيها ساعة من نهار، ثم عادت حرمتها اليوم كحرمتها بالأمس، وليبلغ الشاهد الغائب ‏\"‏‏.‏ فقيل لأبي شريح ما قال عمرو قال أنا أعلم منك يا أبا شريح، لا يعيذ عاصيا، ولا فارا بدم، ولا فارا بخربة‏.‏",
      "text_en": " Narrated Sa`id:                     Abu Shuraih said, \"When `Amr bin Sa`id was sending the troops to Mecca (to fight `Abdullah bin Az- Zubair) I said to him, 'O chief! Allow me to tell you what the Prophet said on the day following the conquests of Mecca. My ears heard and my heart comprehended, and I saw him with my own eyes, when he said it. He glorified and praised Allah and then said, \"Allah and not the people has made Mecca a sanctuary. So anybody who has belief in Allah and the Last Day (i.e. a Muslim) should neither shed blood in it nor cut down its trees. If anybody argues that fighting is allowed in Mecca as Allah's Apostle did fight (in Mecca), tell him that Allah gave permission to His Apostle, but He did not give it to you. The Prophet added: Allah allowed me only for a few hours on that day (of the conquest) and today (now) its sanctity is the same (valid) as it was before. So it is incumbent upon those who are present to convey it (this information) to those who are absent.\" Abu- Shuraih was asked, \"What did `Amr reply?\" He said `Amr said, \"O Abu Shuraih! I know better than you (in this respect). Mecca does not give protection to one who disobeys (Allah) or runs after committing murder, or theft (and takes refuge in Mecca).",
      "chain": [
        "30355",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "145",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن عبد الله بن عمر، أنه كان يقول إن ناسا يقولون إذا قعدت على حاجتك، فلا تستقبل القبلة ولا بيت المقدس‏.‏ فقال عبد الله بن عمر لقد ارتقيت يوما على ظهر بيت لنا، فرأيت رسول الله صلى الله عليه وسلم على لبنتين مستقبلا بيت المقدس لحاجته‏.‏ وقال لعلك من الذين يصلون على أوراكهم، فقلت لا أدري والله‏.‏ قال مالك يعني الذي يصلي ولا يرتفع عن الأرض، يسجد وهو لاصق بالأرض‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or Baitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's Apostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but there was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "162",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ أحدكم فليجعل في أنفه ثم لينثر، ومن استجمر فليوتر، وإذا استيقظ أحدكم من نومه فليغسل يده قبل أن يدخلها في وضوئه، فإن أحدكم لا يدري أين باتت يده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If anyone of you performs ablution he should put water in his nose and then blow it out and whoever cleans his private parts with stones should do so with odd numbers. And whoever wakes up from his sleep should wash his hands before putting them in the water for ablution, because nobody knows where his hands were during sleep.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "166",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سعيد المقبري، عن عبيد بن جريج، أنه قال لعبد الله بن عمر يا أبا عبد الرحمن، رأيتك تصنع أربعا لم أر أحدا من أصحابك يصنعها‏.‏ قال وما هي يا ابن جريج قال رأيتك لا تمس من الأركان إلا اليمانيين، ورأيتك تلبس النعال السبتية، ورأيتك تصبغ بالصفرة، ورأيتك إذا كنت بمكة أهل الناس إذا رأوا الهلال ولم تهل أنت حتى كان يوم التروية‏.‏ قال عبد الله أما الأركان فإني لم أر رسول الله صلى الله عليه وسلم يمس إلا اليمانيين، وأما النعال السبتية فإني رأيت رسول الله صلى الله عليه وسلم يلبس النعل التي ليس فيها شعر ويتوضأ فيها، فأنا أحب أن ألبسها، وأما الصفرة فإني رأيت رسول الله صلى الله عليه وسلم يصبغ بها، فأنا أحب أن أصبغ بها، وأما الإهلال فإني لم أر رسول الله صلى الله عليه وسلم يهل حتى تنبعث به راحلته‏.‏",
      "text_en": " Narrated `Ubaid Ibn Juraij:                     I asked `Abdullah bin `Umar, \"O Abu `Abdur-Rahman! I saw you doing four things which I never saw being done by anyone of you companions?\" `Abdullah bin `Umar said, \"What are those, O Ibn Juraij?\" I said, \"I never saw you touching any corner of the Ka`ba except these (two) facing south (Yemen) and I saw you wearing shoes made of tanned leather and dyeing your hair with Hinna (a kind of red dye). I also noticed that whenever you were in Mecca, the people assume Ihram on seeing the new moon crescent (1st of Dhul-Hijja) while you did not assume the Ihlal (Ihram) -(Ihram is also called Ihlal which means 'Loud calling' because a Muhrim has to recite Talbiya aloud when assuming the state of Ihram) - till the 8th of Dhul-Hijja (Day of Tarwiya). `Abdullah replied, \"Regarding the corners of Ka`ba, I never saw Allah's Apostle touching except those facing south (Yemen) and regarding the tanned leather shoes, no doubt I saw Allah's Apostle wearing non-hairy shoes and he used to perform ablution while wearing the shoes (i.e. wash his feet and then put on the shoes). So I love to wear similar shoes. And about the dyeing of hair with Hinna; no doubt I saw Allah's Apostle dyeing his hair with it and that is why I like to dye (my hair with it). Regarding Ihlal, I did not see Allah's Apostle assuming Ihlal till he set out for Hajj (on the 8th of Dhul-Hijja).",
      "chain": [
        "30355",
        "20001",
        "11168",
        "11887"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر، فالتمس الناس الوضوء فلم يجدوه، فأتي رسول الله صلى الله عليه وسلم بوضوء، فوضع رسول الله صلى الله عليه وسلم في ذلك الإناء يده، وأمر الناس أن يتوضئوا منه‏.‏ قال فرأيت الماء ينبع من تحت أصابعه حتى توضئوا من عند آخرهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     saw Allah's Apostle when the `Asr prayer was due and the people searched for water to perform ablution but they could not find it. Later on (a pot full of) water for ablution was brought to Allah's Apostle . He put his hand in that pot and ordered the people to perform ablution from it. I saw the water springing out from underneath his fingers till all of them performed the ablution (it was one of the miracles of the Prophet).",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "172",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا شرب الكلب في إناء أحدكم فليغسله سبعا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a dog drinks from the utensil of anyone of you it is essential to wash it seven times.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "185",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عمرو بن يحيى المازني، عن أبيه، أن رجلا، قال لعبد الله بن زيد  وهو جد عمرو بن يحيى  أتستطيع أن تريني، كيف كان رسول الله صلى الله عليه وسلم يتوضأ فقال عبد الله بن زيد نعم‏.‏ فدعا بماء، فأفرغ على يديه فغسل يده مرتين، ثم مضمض واستنثر ثلاثا، ثم غسل وجهه ثلاثا، ثم غسل يديه مرتين مرتين إلى المرفقين، ثم مسح رأسه بيديه، فأقبل بهما وأدبر، بدأ بمقدم رأسه، حتى ذهب بهما إلى قفاه، ثم ردهما إلى المكان الذي بدأ منه، ثم غسل رجليه‏.‏",
      "text_en": " Narrated Yahya Al-Mazini:                     A person asked `Abdullah bin Zaid who was the grandfather of `Amr bin Yahya, \"Can you show me how Allah's Apostle used to perform ablution?\" `Abdullah bin Zaid replied in the affirmative and asked for water. He poured it on his hands and washed them twice, then he rinsed his mouth thrice and washed his nose with water thrice by putting water in it and blowing it out. He washed his face thrice and after that he washed his forearms up to the elbows twice and then passed his wet hands over his head from its front to its back and vice versa (beginning from the front and taking them to the back of his head up to the nape of the neck and then brought them to the front again from where he had started) and washed his feet (up to the ankles).",
      "chain": [
        "30355",
        "20001",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "193",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أنه قال كان الرجال والنساء يتوضئون في زمان رسول الله صلى الله عليه وسلم جميعا‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                      \"During the lifetime of Allah's Messenger () men and women used to perform ablution together.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "207",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس،‏.‏ أن رسول الله صلى الله عليه وسلم أكل كتف شاة، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle ate a piece of cooked mutton from the shoulder region and prayed without repeating ablution.",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "209",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره‏.‏ أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر، حتى إذا كانوا بالصهباء  وهي أدنى خيبر  فصلى العصر، ثم دعا بالأزواد، فلم يؤت إلا بالسويق، فأمر به فثري، فأكل رسول الله صلى الله عليه وسلم وأكلنا، ثم قام إلى المغرب، فمضمض ومضمضنا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin Al-Nu`man:                     In the year of the conquest of Khaibar I went with Allah's Apostle till we reached Sahba, a place near Khaibar, where Allah's Apostle offered the `Asr prayer and asked for food. Nothing but saweeq  was brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet got up for the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he then prayed without repeating the ablution.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "hadith_no": "212",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا نعس أحدكم وهو يصلي فليرقد حتى يذهب عنه النوم، فإن أحدكم إذا صلى وهو ناعس لا يدري لعله يستغفر فيسب نفسه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"If anyone of you feels drowsy while praying he should go to bed (sleep) till his slumber is over because in praying while drowsy one does not know whether one is asking for forgiveness or for a bad thing for oneself.\"",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "222",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين، أنها قالت أتي رسول الله صلى الله عليه وسلم بصبي، فبال على ثوبه، فدعا بماء فأتبعه إياه‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of faithful believers) A child was brought to Allah's Apostle and it urinated on the garment of the Prophet. The Prophet asked for water and poured it over the soiled place.",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "223",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أم قيس بنت محصن، أنها أتت بابن لها صغير، لم يأكل الطعام إلى رسول الله صلى الله عليه وسلم، فأجلسه رسول الله صلى الله عليه وسلم في حجره، فبال على ثوبه، فدعا بماء فنضحه ولم يغسله‏.‏",
      "text_en": " Narrated Um Qais bint Mihsin:                     I brought my young son, who had not started eating (ordinary food) to Allah's Apostle who took him and made him sit in his lap. The child urinated on the garment of the Prophet, so he asked for water and poured it over the soiled (area) and did not wash it.",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11004",
        "827"
      ]
    },
    {
      "hadith_no": "248",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان إذا اغتسل من الجنابة بدأ فغسل يديه، ثم يتوضأ كما يتوضأ للصلاة، ثم يدخل أصابعه في الماء، فيخلل بها أصول شعره ثم يصب على رأسه ثلاث غرف بيديه، ثم يفيض الماء على جلده كله‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet took a bath after Janaba he started by washing his hands and then performed ablution like that for the prayer. After that he would put his fingers in water and move the roots of his hair with them, and then pour three handfuls of water over his head and then pour water all over his body.",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة أم المؤمنين، أنها قالت جاءت أم سليم امرأة أبي طلحة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله، إن الله لا يستحيي من الحق، هل على المرأة من غسل إذا هي احتلمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
      "text_en": " Narrated Um-Salama:                     (the mother of the believers) Um Sulaim, the wife of Abu Talha, came to Allah's Apostle and said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge)?\" Allah's Apostle replied, \"Yes, if she notices a discharge.\"",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال ذكر عمر بن الخطاب لرسول الله صلى الله عليه وسلم أنه تصيبه الجنابة من الليل، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ توضأ واغسل ذكرك ثم نم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar bin Al-Khattab told Allah's Apostle, \"I became Junub at night.\" Allah's Apostle replied, \"Perform ablution after washing your private parts and then sleep.\"",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كنت أرجل رأس رسول الله صلى الله عليه وسلم وأنا حائض‏.‏",
      "text_en": " Narrated `Aisha:                     While in menses, I used to comb the hair of Allah's Apostle .",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أنها قالت قالت فاطمة بنت أبي حبيش لرسول الله صلى الله عليه وسلم يا رسول الله إني لا أطهر، أفأدع الصلاة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك عرق وليس بالحيضة، فإذا أقبلت الحيضة فاتركي الصلاة، فإذا ذهب قدرها فاغسلي عنك الدم وصلي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Fatima bint Abi Hubaish said to Allah's Apostle, \"O Allah's Apostle! I do not become clean (from bleeding). Shall I give up my prayers?\" Allah's Apostle replied: \"No, because it is from a blood vessel and not the menses. So when the real menses begins give up your prayers and when it (the period) has finished wash the blood off your body (take a bath) and offer your prayers.\"",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "307",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أنها قالت سألت امرأة رسول الله صلى الله عليه وسلم فقالت يا رسول الله، أرأيت إحدانا إذا أصاب ثوبها الدم من الحيضة، كيف تصنع فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أصاب ثوب إحداكن الدم من الحيضة، فلتقرصه ثم لتنضحه بماء، ثم لتصلي فيه ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     A woman asked Allah's Apostle, \"O Allah's Apostle! What should we do, if the blood of menses falls on our clothes?\" Allah's Apostle replied, \"If the blood of menses falls on the garment of anyone of you, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it).",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله، إن صفية بنت حيى قد حاضت‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لعلها تحبسنا، ألم تكن طافت معكن ‏\"‏‏.‏ فقالوا بلى‏.‏ قال ‏\"‏ فاخرجي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) I told Allah's Apostle that Safiya bint Huyai had got her menses. He said, \"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that the Prophet told her to depart.",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11239",
        "11455"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء  أو بذات الجيش  انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء، فأتى الناس إلى أبي بكر الصديق فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فقالت عائشة فعاتبني أبو بكر، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فقام رسول الله صلى الله عليه وسلم حين أصبح على غير ماء، فأنزل الله آية التيمم فتيمموا‏.‏ فقال أسيد بن الحضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ قالت فبعثنا البعير الذي كنت عليه، فأصبنا العقد تحته‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) We set out with Allah's Apostle on one of his journeys till we reached Al- Baida' or Dhatul-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to search for it, and so did the people along with him. There was no water at that place, so the people went to Abu- Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh, He said, to me: \"You have detained Allah's Apostle and the people where there is no water and they have no water with them. So he admonished me and said what Allah wished him to say and hit me on my flank with his hand. Nothing prevented me from moving (because of pain) but the position of Allah's Apostle on my thigh. Allah's Apostle got up when dawn broke and there was no water. So Allah revealed the Divine Verses of Tayammum. So they all performed Tayammum. Usaid bin Hudair said, \"O the family of Abu Bakr! This is not the first blessing of yours.\" Then the camel on which I was riding was caused to move from its place and the necklace was found beneath it.",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "350",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن صالح بن كيسان، عن عروة بن الزبير، عن عائشة أم المؤمنين، قالت ‏\"‏ فرض الله الصلاة حين فرضها ركعتين ركعتين في الحضر والسفر، فأقرت صلاة السفر، وزيد في صلاة الحضر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     the mother of believers: Allah enjoined the prayer when He enjoined it, it was two rak`at only (in every prayer) both when in residence or on journey. Then the prayers offered on journey remained the same, but (the rak`at of) the prayers for non-travelers were increased.",
      "chain": [
        "30355",
        "20001",
        "11176",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "358",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن سائلا، سأل رسول الله صلى الله عليه وسلم عن الصلاة في ثوب واحد فقال رسول الله صلى الله عليه وسلم ‏\"‏ أولكلكم ثوبان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A person asked Allah's Apostle about the offering of the prayer in a single garment. Allah's Apostle replied, \"Has every one of you got two garments?\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "375",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر، قال أهدي إلى النبي صلى الله عليه وسلم فروج حرير، فلبسه فصلى فيه، ثم انصرف فنزعه نزعا شديدا كالكاره له وقال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     The Prophet was given a silken Farruj [??] as a present. He wore it while praying. When he had finished his prayer, he took it off violently as if with a strong aversion to it and said, \"It is not the dress of Allah-fearing pious people.\"",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن يزيد، عن عراك، عن عروة، أن النبي صلى الله عليه وسلم كان يصلي وعائشة معترضة بينه وبين القبلة على الفراش الذي ينامان عليه‏.‏",
      "text_en": " Narrated `Urwa:                     The Prophet prayed while `Aisha was lying between him and his Qibla on the bed on which they used to sleep.",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11204",
        "10511"
      ]
    },
    {
      "hadith_no": "403",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك بن أنس، عن عبد الله بن دينار، عن عبد الله بن عمر، قال بينا الناس بقباء في صلاة الصبح إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن، وقد أمر أن يستقبل الكعبة فاستقبلوها، وكانت وجوههم إلى الشأم، فاستداروا إلى الكعبة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While the people were offering the Fajr prayer at Quba' (near Medina), someone came to them and said: \"It has been revealed to Allah's Apostle tonight, and he has been ordered to pray facing the Ka`ba.\" So turn your faces to the Ka`ba. Those people were facing Sham (Jerusalem) so they turned their faces towards Ka`ba (at Mecca).",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "406",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر،‏.‏ أن رسول الله صلى الله عليه وسلم رأى بصاقا في جدار القبلة فحكه، ثم أقبل على الناس فقال ‏\"‏ إذا كان أحدكم يصلي، فلا يبصق قبل وجهه، فإن الله قبل وجهه إذا صلى ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle saw sputum on the wall of the mosque in the direction of the Qibla and scraped it off. He faced the people and said, \"Whenever any one of you is praying, he should not spit in front of him because in the prayer Allah is in front of him.\"",
      "chain": [
        "30355",
        "20001",
        "11014"
      ]
    },
    {
      "hadith_no": "407",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين، أن رسول الله صلى الله عليه وسلم رأى في جدار القبلة مخاطا أو بصاقا أو نخامة فحكه‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of faithful believers) Allah's Apostle saw some nasal secretions, expectoration or sputum on the wall of the mosque in the direction of the Qibla and scraped it off.",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ هل ترون قبلتي ها هنا فوالله ما يخفى على خشوعكم ولا ركوعكم، إني لأراكم من وراء ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Do you consider or see that my face is towards the Qibla? By Allah, neither your submissiveness nor your bowing is hidden from me, surely I see you from my back.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "420",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم سابق بين الخيل التي أضمرت من الحفياء، وأمدها ثنية الوداع، وسابق بين الخيل التي لم تضمر من الثنية إلى مسجد بني زريق، وأن عبد الله بن عمر كان فيمن سابق بها‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle ordered for a horse race; the trained horses were to run from a place called Al-Hafya' to Thaniyat Al-Wada` and the horses which were not trained were to run from Al-Thaniya to the Masjid (mosque of) Bani Zuraiq. The sub narrator added: Ibn `Umar was one of those who took part in the race.",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "422",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله، سمع أنسا، قال وجدت النبي صلى الله عليه وسلم في المسجد معه ناس فقمت، فقال لي ‏\"‏ آرسلك أبو طلحة ‏\"‏ قلت نعم‏.‏ فقال ‏\"‏ لطعام ‏\"‏‏.‏ قلت نعم‏.‏ فقال لمن حوله ‏\"‏ قوموا ‏\"‏‏.‏ فانطلق وانطلقت بين أيديهم‏.‏",
      "text_en": " Narrated Anas:                     I found the Prophet in the mosque along with some people. He said to me, \"Did Abu Talha send you?\" I said, \"Yes\". He said, \"For a meal?\" I said, \"Yes.\" Then he said to his companions, \"Get up.\" They set out and I was ahead of them.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "444",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، عن أبي قتادة السلمي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا دخل أحدكم المسجد فليركع ركعتين قبل أن يجلس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada Al-Aslami:                     Allah's Apostle said, \"If anyone of you enters a mosque, he should pray two rak`at before sitting.\"",
      "chain": [
        "30355",
        "20001",
        "11178",
        "1544"
      ]
    },
    {
      "hadith_no": "445",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الملائكة تصلي على أحدكم ما دام في مصلاه الذي صلى فيه، ما لم يحدث، تقول اللهم اغفر له اللهم ارحمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The angels keep on asking Allah's forgiveness for anyone of you, as long as he is at his Musalla (praying place) and he does not pass wind (Hadath). They say, 'O Allah! Forgive him, O Allah! be Merciful to him.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "462",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، قال حدثنا سعيد بن أبي سعيد، سمع أبا هريرة، قال بعث النبي صلى الله عليه وسلم خيلا قبل نجد، فجاءت برجل من بني حنيفة يقال له ثمامة بن أثال، فربطوه بسارية من سواري المسجد، فخرج إليه النبي صلى الله عليه وسلم فقال ‏\"‏ أطلقوا ثمامة ‏\"‏‏.‏ فانطلق إلى نخل قريب من المسجد، فاغتسل ثم دخل المسجد فقال أشهد أن لا إله إلا الله وأن محمدا رسول الله‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet sent some horsemen to Najd and they brought a man called Thumama bin Uthal from Bani Hanifa. They fastened him to one of the pillars of the mosque. The Prophet came and ordered them to release him. He went to a (garden of) date-palms near the mosque, took a bath and entered the, mosque again and said, \"None has the right to be worshipped but Allah an Muhammad is His Apostle (i.e. he embraced Islam).",
      "chain": [
        "30355",
        "20023",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ قال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick. He told me to perform the Tawaf behind the people while riding. So I did so and Allah's Apostle was praying beside the Ka`ba and reciting the Sura starting with \"Wat-tur wa kitabin mastur.\"",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، قال بينما رسول الله صلى الله عليه وسلم في المسجد فأقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، فأما أحدهما فرأى فرجة فجلس، وأما الآخر فجلس خلفهم، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid al-Laithi:                     While Allah's Apostle was sitting in the mosque (with some people) three men came, two of them came in front of Allah's Apostle and the third one went away, and then one of them found a place in the circle and sat there while the second man sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah and so Allah accepted him and accommodated him; the second felt shy before Allah so Allah did the same for him and sheltered him in His Mercy (and did not punish him), while the third turned his face from Allah, and went away, so Allah turned His face from him likewise.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "493",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن عبد الله بن عباس، أنه قال أقبلت راكبا على حمار أتان، وأنا يومئذ قد ناهزت الاحتلام، ورسول الله صلى الله عليه وسلم يصلي بالناس بمنى إلى غير جدار، فمررت بين يدى بعض الصف، فنزلت وأرسلت الأتان ترتع، ودخلت في الصف، فلم ينكر ذلك على أحد‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I came riding a she-ass when I had just attained the age of puberty. Allah's Apostle was offering the prayer at Mina with no wall in front of him and I passed in front of some of the row. There I dismounted and let my she-ass loose to graze and entered the row and nobody objected to me about it.",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم دخل الكعبة وأسامة بن زيد وبلال وعثمان بن طلحة الحجبي فأغلقها عليه ومكث فيها، فسألت بلالا حين خرج ما صنع النبي صلى الله عليه وسلم قال جعل عمودا عن يساره، وعمودا عن يمينه، وثلاثة أعمدة وراءه، وكان البيت يومئذ على ستة أعمدة، ثم صلى‏.‏ وقال لنا إسماعيل حدثني مالك وقال عمودين عن يمينه‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Umar said, \"Allah's Apostle entered the Ka`ba along with Usama bin Zaid, Bilal and `Uthman bin Talha Al-Hajabi and closed the door and stayed there for some time. I asked Bilal when he came out, 'What did the Prophet do?' He replied, 'He offered prayer with one pillar to his left and one to his right and three behind.' In those days the Ka`ba was supported by six pillars.\" Malik said: \"There were two pillars on his (the Prophet's) right side.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، أن زيد بن خالد، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏‏.‏ قال أبو النضر لا أدري أقال أربعين يوما أو شهرا أو سنة‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     that Zaid bin Khalid sent him to Abi Juhaim to ask him what he had heard from Allah's Apostle about a person passing in front of another person who was praying. Abu Juhaim replied, \"Allah's Apostle said, 'If the person who passes in front of another person in prayer knew the magnitude of his sin he would prefer to wait for 40 (days, months or years) rather than to pass in front of him.\" Abu An-Nadr said, \"I do not remember exactly whether he said 40 days, months or years.\"",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته، فإذا سجد غمزني فقبضت رجلى، فإذا قام بسطتهما‏.‏ قالت والبيوت يومئذ ليس فيها مصابيح‏.‏",
      "text_en": " Narrated `Aisha:                     the wife of the Prophet, \"I used to sleep in front of Allah's Apostle with my legs opposite his Qibla (facing him); and whenever he prostrated, he pushed my feet and I withdrew them and whenever he stood, I stretched them.\" `Aisha added, \"In those days there were no lamps in the houses.\"",
      "chain": [
        "30355",
        "20001",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "516",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، عن أبي قتادة الأنصاري، أن رسول الله صلى الله عليه وسلم كان يصلي وهو حامل أمامة بنت زينب بنت رسول الله صلى الله عليه وسلم ولأبي العاص بن ربيعة بن عبد شمس، فإذا سجد وضعها، وإذا قام حملها‏.‏",
      "text_en": " Narrated Abu Qatada Al-Ansari:                     Allah's Apostle was praying and he was carrying Umama the daughters of Zainab, the daughter of Allah's Apostle and she was the daughter of 'As bin Rabi`a bin `Abd Shams. When he prostrated, he put her down and when he stood, he carried her (on his neck).",
      "chain": [
        "30355",
        "20001",
        "11178",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "551",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن أنس بن مالك، قال كنا نصلي العصر ثم يذهب الذاهب منا إلى قباء، فيأتيهم والشمس مرتفعة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray the `Asr and after that if one of US went to Quba' he would arrive there while the sun was still high.",
      "chain": [
        "30355",
        "20001",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "552",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الذي تفوته صلاة العصر كأنما وتر أهله وماله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Whoever misses the `Asr prayer (intentionally) then it is as if he lost his family and property.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "555",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار، ويجتمعون في صلاة الفجر وصلاة العصر، ثم يعرج الذين باتوا فيكم، فيسألهم وهو أعلم بهم كيف تركتم عبادي فيقولون تركناهم وهم يصلون، وأتيناهم وهم يصلون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Angels come to you in succession by night and day and all of them get together at the time of the Fajr and `Asr prayers. Those who have passed the night with you (or stayed with you) ascend (to the Heaven) and Allah asks them, though He knows everything about you, well, \"In what state did you leave my slaves?\" The angels reply: \"When we left them they were praying and when we reached them, they were praying.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "580",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من الصلاة فقد أدرك الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever could get one rak`a of a prayer, (in its proper time) he has got the prayer.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "585",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يتحرى أحدكم فيصلي عند طلوع الشمس ولا عند غروبها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"None of you should try to pray at sunrise or sunset.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "608",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا نودي للصلاة أدبر الشيطان وله ضراط حتى لا يسمع التأذين، فإذا قضى النداء أقبل، حتى إذا ثوب بالصلاة أدبر، حتى إذا قضى التثويب أقبل حتى يخطر بين المرء ونفسه، يقول اذكر كذا، اذكر كذا‏.‏ لما لم يكن يذكر، حتى يظل الرجل لا يدري كم صلى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Adhan is pronounced Satan takes to his heels and passes wind with noise during his flight in order not to hear the Adhan. When the Adhan is completed he comes back and again takes to his heels when the Iqama is pronounced and after its completion he returns again till he whispers into the heart of the person (to divert his attention from his prayer) and makes him remember things which he does not recall to his mind before the prayer and that causes him to forget how much he has prayed.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    }
  ],
  "total_hadiths": 361
}