{
  "id": "30358",
  "name": "'Abdul 'Aziz bin 'Uthman - Shadhan عبد العزيز بن عثمان - شاذان",
  "full_name": "'Abdul 'Aziz bin 'Uthman - Shadhan عبد العزيز بن عثمان - شاذان",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": [
        "145 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "221",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ خ  س  -  مقبول ]"
    ],
    "tags": [
      "al-Azdi",
      "Client",
      "al-Mervazi"
    ]
  },
  "parents": [
    {
      "id": "30361",
      "name": "'Uthman bin Jabla bin Abi Ruwad عثمان بن جبلة بن أبي رواد العتكي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "30361",
      "name": "'Uthman bin Jabla bin Abi Ruwad عثمان بن جبلة بن أبي رواد العتكي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "38024",
      "name": "Ahmed bin Syar bin Ayoub أحمد بن سيار بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30387",
      "name": "Muhammad bin Yahya bin 'Abdul 'Aziz محمد بن يحيى بن عبد العزيز",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3846",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن يحيى أبو علي، حدثنا شاذان، أخو عبدان حدثنا أبي، أخبرنا شعبة بن الحجاج، عن هشام بن زيد، قال سمعت أنس بن مالك، يقول مر أبو بكر والعباس  رضى الله عنهما  بمجلس من مجالس الأنصار وهم يبكون، فقال ما يبكيكم قالوا ذكرنا مجلس النبي صلى الله عليه وسلم منا‏.‏ فدخل على النبي صلى الله عليه وسلم فأخبره بذلك  قال  فخرج النبي صلى الله عليه وسلم وقد عصب على رأسه حاشية برد  قال  فصعد المنبر ولم يصعده بعد ذلك اليوم، فحمد الله وأثنى عليه، ثم قال ‏\"‏ أوصيكم بالأنصار، فإنهم كرشي وعيبتي، وقد قضوا الذي عليهم، وبقي الذي لهم، فاقبلوا من محسنهم، وتجاوزوا عن مسيئهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Bakr and Al-`Abbas passed by one of the gatherings of the Ansar who were weeping then. He (i.e. Abu Bakr or Al-`Abbas) asked, \"Why are you weeping?\" They replied, \"We are weeping because we remember the gathering of the Prophet with us.\" So Abu Bakr went to the Prophet and told him of that. The Prophet came out, tying his head with a piece of the hem of a sheet. He ascended the pulpit which he never ascended after that day. He glorified and praised Allah and then said, \"I request you to take care of the Ansar as they are my near companions to whom I confided my private secrets. They have fulfilled their obligations and rights which were enjoined on them but there remains what is for them. So, accept the good of the good-doers amongst them and excuse the wrongdoers amongst them.\"",
      "chain": [
        "11222",
        "30358",
        "30361",
        "20020",
        "11228",
        "19"
      ]
    }
  ],
  "total_hadiths": 1
}